{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/714d7f63-9e23-4a7c-8cd6-ea9c47bb3cc0/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "620sl9psp5-8de2-4601-a1b3-4fa08fbcad11",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Ihr wundert euch jetzt vielleicht, es ist gar nicht Dienstag und schon wieder neue Episode in der Playlist. Und dann hat sie nicht einmal eine ordentliche Episoden-Nummer. In Österreich würden wir es vielleicht Belangssendung nennen, manche nennen es Wrap-Up oder einfach nur Andi und ich feiern den ersten Engineering Kiosk Geburtstag. Wir blicken hinter die Kulissen, besprechen einige Statistiken und erzählen euch auch, was wir in der Zukunft noch so vorhaben. Irgendwie ist mir die Musik schon langsam ans Herz gewachsen. Aber jetzt hoffen wir, dass ihr mit uns den ersten Geburtstag feiert. Nimm dir nur deine Zeit.",
            "start": 4157,
            "end": 47529,
            "confidence": 0.72784693877551,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Lieber Wolfgang, heute machen wir eine etwas andere Folge. Und zwar ist das ja Tradition im Podcast-Business, dass man so einen Jahres-Rap macht. Also ich meine Spotify hat ja auch diese Rapped-Technologie, da wo du halt siehst, wie viele Minuten Musik du gehört hast und so weiter und so fort. Und ganz viele Podcasts, die ich höre, die haben jetzt auch so einen Jahresabschluss gemacht. Wie war eigentlich das Jahr von Podcasting? Was hat denen gefallen? Passstatistik und allem drum und dran.",
            "start": 47569,
            "end": 71267,
            "confidence": 0.7164024390243902,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du das wirklich gehört?",
            "start": 71347,
            "end": 72368,
            "confidence": 0.51,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe es gehört, ja.",
            "start": 73369,
            "end": 74309,
            "confidence": 0.7518,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich habe alle aus meiner Playlist gelöscht. Alle diese Jahresrückblicke. Ich finde die schrecklich, diese Jahresrückblicke.",
            "start": 74349,
            "end": 81335,
            "confidence": 0.7957058823529413,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich finde die eigentlich immer ganz gut, weil ich finde es immer ganz interessant mal ein paar Hintergrundinformationen von den Hosts zu bekommen.",
            "start": 81375,
            "end": 87580,
            "confidence": 0.8023478260869567,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber meistens war das ja irgendwie so die Lieblingsthemen oder irgendwas so rückblickend, was im Jahr passiert ist. Und das kennt man ja schon alles. Wenn die dann wieder sagen, was Tolles passiert ist, das hat man schon alles mal in Episoden gehört. Also warum brauche ich einen Rückblick?",
            "start": 87674,
            "end": 100262,
            "confidence": 0.76626,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich hatte jetzt nicht vor, in dieser Episode das ganze Jahr zu wiederholen. Also wir bringen schon neuen Content in der Episode. Und weil die Episode halt so anders ist, so speziell, einfach mal nicht so um knallharte IT-Themen, Hard- und Soft-Skills geht, habe ich gedacht, starte ich die einfach mal anders und zwar mit drei geilen Flachwitzen. Bist du bereit?",
            "start": 100622,
            "end": 120492,
            "confidence": 0.8100967741935488,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist ein neuer Content, den wir jetzt in 2023 liefern, aber gut, dann starten wir.",
            "start": 120512,
            "end": 125473,
            "confidence": 0.659125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aus welcher Stadt kommen die Audiokabel? Augsburg.",
            "start": 125513,
            "end": 131769,
            "confidence": 0.88,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, da braucht man technisches Verständnis auch noch. Den gebe ich dir gut. Was machen Tiere in der Disco?",
            "start": 131809,
            "end": 139531,
            "confidence": 0.6366315789473685,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sie diskutieren.",
            "start": 139571,
            "end": 141772,
            "confidence": 0.8714999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Auch sehr schön, ja.",
            "start": 141812,
            "end": 143232,
            "confidence": 0.39525,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So, und den letzten, den darfst du mir echt nicht übel nehmen, ja? Versprichst du mir das?",
            "start": 143272,
            "end": 147533,
            "confidence": 0.632470588235294,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich werde es versuchen. Wo steht Europas größte Orgel?",
            "start": 147593,
            "end": 152794,
            "confidence": 0.7445555555555555,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In Österreich. Acht Millionen Pfeifen.",
            "start": 152834,
            "end": 154334,
            "confidence": 0.8341999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der ist sogar sehr gut. Gefällt mir.",
            "start": 156034,
            "end": 158255,
            "confidence": 0.3205714285714286,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Herzlich willkommen zum 2022 Wrap-Up Wolfgang. Ich hoffe du bist mir mit dem letzten nicht böse.",
            "start": 158998,
            "end": 165122,
            "confidence": 0.6548125000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Überhaupt nicht. Ihr habt nämlich gerade gelesen, Statistik verlinken wir gerne, Österreich ist das beliebteste Nachbarland von Deutschland. Vielen Dank. Also ihr liebt uns eh alle. Und Wien ist sowieso die lebenswerteste Stadt. Also alles gut.",
            "start": 165162,
            "end": 177429,
            "confidence": 0.76025,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gab es auch den grund wegen den.",
            "start": 178189,
            "end": 179290,
            "confidence": 0.7411428571428571,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Schnitzeln oder weswegen ja keine ahnung ich verstehe das ehrlich gesagt an die bin ja auch kein wiener aber tja.",
            "start": 179310,
            "end": 185774,
            "confidence": 0.67155,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wären wir jetzt ein podcast in wolfgang spot catcher würde er uns glaube ich jetzt löschen aber wir haben uns mal gedacht wir machen auch so eine wrap up folge so eine summary folge weil auch das engineering kiosk hat am, 3. Januar 2022 das Licht der Welt erblickt mit unserer ersten Episode. Und somit haben wir ein komplettes Jahr voll gemacht, was wir beide, glaube ich, nicht gedacht hätten, aber ...",
            "start": 185814,
            "end": 211808,
            "confidence": 0.8215068493150687,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da wollen wir einfach mal ein paar Hintergrundinformationen eigentlich bringen.",
            "start": 211818,
            "end": 216882,
            "confidence": 0.8755000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hintergrundinformationen, Statistiken und auch ein paar Learnings mal mit euch teilen.",
            "start": 216922,
            "end": 221686,
            "confidence": 0.8082727272727273,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber geben wir mal ganz einen Start zurück. Und Anni, du bist ja immer ein großer Fan, dass man irgendwie definiert, was die Ziele sind und so weiter und alles muss goal oriented sein. Und ich kann mich nicht nur erinnern, ihr habt mir einfach überlegt, es wäre extrem cool einen Podcast zu machen und habt die glaube ich extrem lange genervt, da was zu starten und du bist dann mit den richtigen Goals gekommen. Also was waren denn unsere Ziele dann?",
            "start": 221746,
            "end": 242566,
            "confidence": 0.798341463414634,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also hatten wir eigentlich schon eine Lösung und wir suchen jetzt das Problem, richtig?",
            "start": 242946,
            "end": 246550,
            "confidence": 0.8381428571428572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, so haben wir das ja damals gemacht, ja.",
            "start": 247090,
            "end": 249693,
            "confidence": 0.7498888888888889,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe es ja schon öfter mal in diesem podcast erwähnt ich bin ein großer fan davon seine schreib skills zu verbessern und in einem podcast sind ja schreib skills jetzt nicht so gut vertreten deswegen habe ich mir damals oder haben wir uns glaube ich damals als ziel gesetzt unsere aussprache und kommunikation zu verbessern retrospektiv muss ich jedoch mich fragen war das ein erfolg weil eigentlich kriege ich den potz lang halt immer noch nicht raus.",
            "start": 250053,
            "end": 273622,
            "confidence": 0.7915256410256412,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, es kommt ja darauf an, was man wirklich erreichen will. Und ich habe kürzlich mal von Arnold Schwarzenegger, mittlerweile darf man ja sogar wieder positiv erwähnen, seitdem er auf der guten Seite ist, der gute alte quasi Österreicher, hat mal erklärt, er hat Unterricht bekommen, um seinen Akzent wegzubekommen. Da fragen sich immer alle, das hat scheinbar nicht sehr gut funktioniert. Aber er hat dann erklärt, dass das Ziel eigentlich ist, nicht seinen Akzent komplett zu verlieren, weil das macht einen ja aus, aber dass man so sprechen kann, dass man verstanden wird. Also, dass man die Wörter, die kritisch sind, die man vielleicht falsch ausspricht, die man dann richtig ausspricht, aber trotzdem seinen Akzent, seine Note behält. Und insofern würde ich sagen, ist das nicht so schlimm, dass du deinen Bot-Charakter da nicht verlierst. Wenn man mal zurückschaut auf die erste Episode, die wir gemacht haben, die übrigens die meistgehörte Episode ist, leider. Irgendwie starten die Leute immer mit der ersten Episode, obwohl das meistens die schlechteste ist, weil das war halt die erste, ohne dass wir eine Ahnung gehabt haben, wo wir einfach mal losgestartet sind. Und im Vergleich mit aktuellen Episoden würde ich schon sagen, dass man da irgendwo eine Verbesserung merkt, aber das müssen natürlich die HörerInnen entscheiden und nicht wir.",
            "start": 274432,
            "end": 337965,
            "confidence": 0.818504629629629,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie gesagt, da bin ich mir nicht ganz so sicher. Die zweite These war eigentlich, ich kenne nur englische Software-Engineering-Podcasts, aber keine deutschen. Deswegen, lass uns das doch mal starten. Vielleicht haben wir da eine Nische. Weil sehr wenig deutsche hochqualitativen Content zum Thema Software-Engineering, Software-Engineering-Karriere, Staff-Engineering und so weiter und so fort erzählen. Jetzt kann man sich natürlich die Frage stellen, ist unser Content hochqualitativ? Weiß ich nicht, aber irgendwie müssen wir ja auch anfangen uns zu verkaufen.",
            "start": 338825,
            "end": 369072,
            "confidence": 0.8132151898734177,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und dann haben wir mal geschaut, was sonst so am Markt ist und haben gesehen, okay, da gibt es noch zwei, drei andere Podcasts. Und dann haben wir uns überlegt, okay, machen wir doch eine Liste, wenn es da eh nur zwei, drei Podcasts gibt und probieren uns da mal auch vielleicht zu verknüpfen oder halt einfach eine Liste zur Verfügung zu stellen, dass das funktioniert. Und darum haben wir diese deutsche Tech-Podcast-Liste erstellt und haben halt am Anfang unsere zwei, drei Picks, die so am Markt waren, die wir gefunden haben, dort geeditet.",
            "start": 369772,
            "end": 393700,
            "confidence": 0.7879893617021277,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und ich hab sie natürlich auch in meinem Spotify-Account geeditet. Und Spotify hat ja einen ganz guten Empfehlungsalgorithmus. Und inzwischen muss man sagen ... Durch die Vernetzung zu den anderen Podcasts haben wir 66 deutschsprachige Tech-Podcasts gefunden. Die sind zwar nicht alle eins zu eins, so wie das Engineering-Kiosk oder Ähnliches, aber es gibt ein paar mehr, die sehr, sehr nah auch an den Themen dran sind, die wir so behandeln. Und das sind weit mehr als zwei, drei. Somit kann man eigentlich ganz offiziell sagen, dass unsere erste These, wir kennen sehr viele englische Tech-Podcasts, aber keine deutschen, weil es die nicht gibt. Ja gut, also die können wir auch in reinwerfen.",
            "start": 394095,
            "end": 436661,
            "confidence": 0.819601769911504,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und schaut mal rein, falls ihr das noch nicht habt, deutsche Tech-Podcast-Liste oder deutschsprachig eigentlich, da muss man ja genau sein. Wir haben ja auch Schweizer-Podcasts dabei zum Beispiel und die Österreicher natürlich auch. Also schaut da mal rein, gibt wirklich coole, andere Podcasts, die man wirklich super hören kann. Und es werden immer mehr und man muss eigentlich da nur glücklich sein, wenn sich die Szene entwickelt und da mehr Content geliefert wird, weil die sind alle wirklich sehr, sehr lehrreich und auch unterhaltsam.",
            "start": 436901,
            "end": 463046,
            "confidence": 0.7553529411764706,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und als letzte Motivation und These, die hat was mit Corona zu tun. Und zwar vor der Pandemie habe ich sieben oder acht Jahre lang am Stück jeden Monat ein Präsenz-Meetup organisiert. Grüße gehen raus an meinen Co-Host Dominik. Und seit der Pandemie war es irgendwie nicht mehr möglich und dann sind die ganzen Meetups irgendwie auf Online-Meetups. Umgestiegen, aber ich war's irgendwie leid, wenn ich schon remote sitze und acht Stunden oder neun Stunden vorm Rechner sitze, mir dann abends noch mal irgendwo in einem Zoom-Call einzuloggen. Da hab ich gemerkt, da geht der Austausch nicht ganz so vonstatten wie bei einem Präsenzmeetup. Dann hab ich mir gedacht, pass mal auf, lass doch hier in diesem Podcast mit einsteigen, dann hab ich wenigstens eine Plattform, wo wir uns weiter austauschen können. Dann hab ich gemerkt, was Podcasting eigentlich ist, und zwar ist der Feedbackkanal ein bisschen einseitig. Das bedeutet, ich quatsche jetzt hier irgendwie nur mit dem Wolfgang.",
            "start": 463475,
            "end": 516285,
            "confidence": 0.8027484276729558,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mein Feedback interessiert dich sowieso nicht, das ist eh klar.",
            "start": 516306,
            "end": 519048,
            "confidence": 0.6224000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es bringt die Welt ja hier nicht nach vorne, wohingegen natürlich auf einem Präsenzmeetup sich immer mehr Gruppen bilden, man über ganz neue Leute mit ganz neuen Themen spricht und so weiter und so fort. Und ja, da kann man dann auch sagen, Ziel verfehlt, glaube ich.",
            "start": 519107,
            "end": 535022,
            "confidence": 0.868468085106383,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und diese Einseitigkeit ist ja manchmal auch ein bisschen zermürbend, weil man wirklich die Motivation aufbringen musste, immer wieder eine Episode zu machen, jede Woche, und irgendwie dann in dieses schwarze Loch zu sprechen. Also, Andi, du bist jetzt nicht das schwarze Loch, aber dieses schwarze Loch da draußen in irgendeiner Form. Aber da muss ich schon sagen, das war am Anfang wirklich cool und wir fragen ja immer nach Feedback in unseren Episoden. Und wir haben am Anfang recht schnell nach ein, zwei, drei Episoden wirklich Feedback von HörerInnen bekommen. Und das war wirklich super motivierend, dass da Leute wirklich die Extrameile gehen, sich an den Rechner setzen oder an ihr Handy und da eine E-Mail schreiben an uns. mit Feedback, mit Vorschlägen. Und das war eigentlich das, was uns am Anfang wirklich auch motiviert hat, dass wir gesehen haben, okay, das sind wirklich Leute. Das sind nicht nur irgendwelche Downloads, sondern das sitzen wirklich echte Persönlichkeiten dahinter. Und darum wollen wir die auch kurz namentlich erwähnen. Das war Diana, Christian, Dirk, Fabian, Frank, Irina, Luca, Luise, Marcel, Min, Pascal, René, Severin, Simon, Tobias, Ute und Yannif. Die haben uns alle in den ersten Monaten unterstützt, indem sie uns einfach viel Feedback geliefert haben und uns geholfen haben, das Ganze weiterzuentwickeln. Und da sind wir wirklich super dankbar.",
            "start": 535342,
            "end": 612981,
            "confidence": 0.8316164383561641,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch vielen Dank von mir, aber auch natürlich an alle anderen Hörerinnen und Hörer, weil wir sehen natürlich eure Downloads in den Statistiken. Und das motiviert uns natürlich auch, wenn wir Monat für Monat mehr Downloads sehen, weil das übersetzen wir in mehr Leute, die sich wenigstens mal an unserem Content versuchen. Vielen Dank.",
            "start": 613001,
            "end": 631470,
            "confidence": 0.838685185185185,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wenn wir jetzt schon bei den Downloads sind, vielleicht ein paar kleine Statistiken, weil es eigentlich sehr viele Leute auch immer interessiert, darum probieren wir das ja auch bei unserer deutschsprachigen Tech-Podcast-Liste zu forcieren, dass man da auch ein paar Daten reinbekommt, wie viele Downloads die jeweiligen Podcasts auch haben. Und wenn wir mal ins letzte Jahr blicken, also wir haben 53 Episoden produziert, sind über zwei Tage Content, also wer mal alle nachhören will, hat 48 Stunden gut was zu tun.",
            "start": 632150,
            "end": 658967,
            "confidence": 0.7813253012048192,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dabei muss man sagen, wir haben 53 Episoden veröffentlicht, jedoch 55 oder 56 produziert und direkt vom Mikrofon in den Müll transformiert.",
            "start": 659308,
            "end": 670134,
            "confidence": 0.8229090909090909,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist nur, weil du immer so kritisch bist.",
            "start": 670174,
            "end": 672375,
            "confidence": 0.708,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es ist ja jetzt nicht so, als wärst du auch mit diesen Episoden zufrieden gewesen.",
            "start": 672415,
            "end": 676197,
            "confidence": 0.8379333333333332,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein, wir haben uns natürlich entschieden, wenn einer von uns irgendwie ein Problem hat mit einer Episode, weil sie vielleicht in eine falsche Richtung gegangen ist, weil die Qualität zu schlecht war, dann produzieren wir die neu, machen nochmal Research, weil da einfach unsere interne Qualitätskontrolle auf beiden Seiten dann zuschlägt.",
            "start": 676833,
            "end": 693129,
            "confidence": 0.8199999999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hatte gerade auch die Download-Zahlen erwähnt. Aktuell haben wir so 750 Downloads pro Woche. Und in Summe über die Podcast-Plattform circa 500 Leute, die uns dort folgen, nennt man Subscriber. Was mich besonders freut, ist, dass 13 Prozent unserer Hörerschaft weiblich ist.",
            "start": 693229,
            "end": 712376,
            "confidence": 0.8405348837209304,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zumindest auf Spotify. Die anderen Plattformen geben das leider nicht aus. Aber auf Spotify, self-reported, sind es mal 13 Prozent.",
            "start": 712396,
            "end": 719518,
            "confidence": 0.7466,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das freut mich ungemein, danke dafür.",
            "start": 720019,
            "end": 722140,
            "confidence": 0.8676666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hoffe, dass alle Frauen einfach auf Apple sind und darum die Zahl eigentlich zu niedrig ist und eigentlich viel höher ist.",
            "start": 722180,
            "end": 729342,
            "confidence": 0.8750454545454545,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und jetzt hat der Wolfgang, der ist ja so ein Statistik-, Mathe-Freak und der will immer alles ganz genau wissen, ein paar sehr interessante Fakten rausgesucht. wie sich die Hörer und Hörerinnen auf Spotify und auf Apple unterschiedlich verhalten. Und da bin ich mal gespannt für alle Leute, die auch einen Podcast betreiben, ob ihr sowas auch seht. Wolfgang, Bühne frei.",
            "start": 729362,
            "end": 753275,
            "confidence": 0.8105081967213116,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, vielleicht fangen wir zuerst mit was Allgemeinem an. Also 75 Prozent aller Leute hören unsere Episoden im Durchschnitt fertig oder zumindest bis zum letzten Viertel der Episode. Aber wir sehen eben auch einen Trend, dass Spotify-User, also die, die über Spotify hören, eher die Tech-Themen bevorzugen und die Apple-Hörerschaft eher die Soft-Skill-Themen. Also wenn man solche Themen haben wie, wie bekommt man, wie wird man zum Team-Lead, ganz allgemein Leadership-Themen, die Diversity-Episode. Alle diese Themen werden eher über Apple gehört und die Spotify-Hörerschaft droppt da früher nach zehn Minuten einfach raus. Also ihr könnt euch ja mal probieren zu verifizieren, wenn ihr jetzt selber daran denkt, verwende ich Spotify oder Apple, ob ihr wirklich in der jeweiligen Gruppe seid. Aber die Statistiken soweit zeigen das mal. Wenn wir gleich bei der Dropout-Rate bleiben. Die erfolgreichste Folge übrigens wird Andi dich natürlich freuen. war die Folge 46, welche Probleme löst Docker? Die Idee kam nämlich vom Andi und da hatten wir eine Durchhörrate von 92 Prozent. Also das ist wirklich die beste Episode, wenn es um die Durchhörrate geht.",
            "start": 753315,
            "end": 820844,
            "confidence": 0.816162011173184,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das könnte aber auch sein, dass 92 Prozent einfach eingeschlafen sind mit Kopfhörern und der Podcast durchlief, oder?",
            "start": 821445,
            "end": 827748,
            "confidence": 0.7859444444444442,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich frage mich immer diese Metrik, zum Beispiel, da gibt es ein Podcast Einschlafen mit Wikipedia, kann ich jedem empfehlen übrigens. Da ist dann die Frage, ob die Metrik dann gut ist, wenn sie so hoch ist oder schlecht. War ich dann erfolgreich, wenn alle einschlafen und ich immer 100 Prozent Durchhörrate habe? Das ist eine interessante Fragestellung.",
            "start": 828390,
            "end": 844772,
            "confidence": 0.775898305084746,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich würde sagen, wenn die Person eingeschlafen ist und somit dein Audio-Player einfach weiterläuft, dann geht die Statistik nach oben, dass sehr viele Leute die Episode zu Ende gehört haben und ich denke, das ist doch das beste Kompliment, wenn du einen Einschlaf-Podcast machst, oder?",
            "start": 845092,
            "end": 860243,
            "confidence": 0.8404347826086955,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn du zumindest ein Einschlaf-Podcast machst. Aber ich hab schon von einigen Freunden gehört, die gemeint haben, sie hören immer die Podcasts zum Einschlafen, das geht immer ganz gut. Unseren auch.",
            "start": 860643,
            "end": 870845,
            "confidence": 0.7813548387096774,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, dann nenn mir doch mal die Flop-Folge, nenn mir doch mal bitte die Folge, wo die Leute am meisten rausgedroppt sind. Am meisten oder am frühesten? Die meisten am frühesten, oder? Ihr seht das jetzt alle grad nicht, aber der Wolfgang muss selbst nachgucken. Der runzelt nämlich grad die Stirn und guckt auf sein Dashboard.",
            "start": 870925,
            "end": 887148,
            "confidence": 0.7637678571428573,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist die Frage, wie du das siehst, wenn du das auf fertig hören beziehst oder auf einen hinteren Teil zumindest von den Episoden im letzten Drittel, dann gewinnt auf jeden Fall die Flop-Liste, die Nummer 47, wer Visionen hat, soll zum Arzt.",
            "start": 887748,
            "end": 901757,
            "confidence": 0.7908837209302326,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Könnte auch sein, weil die dann alle Visionen hatten und direkt zum Arzt gegangen sind.",
            "start": 901797,
            "end": 905459,
            "confidence": 0.7586666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weil da sind wir bei 58 Prozent, also nur 58 Prozent der HörerInnen hat diese Episode bis ins letzte Drittel gehört. Und da sieht man keinen Unterschied zwischen Spotify und Apple. Gleiches Verhalten bei beiden Plattformen.",
            "start": 905919,
            "end": 919272,
            "confidence": 0.8274166666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja gut, man darf auch mal sagen, dass die Episode vielleicht dann nicht so gut bei unseren Hörerinnen und Hörern angekommen ist. Spaß hatte ich trotzdem. Aber Wolfgang, jetzt haben wir die ganze Sache für ein Jahr gemacht. Was war denn einer deiner Learnings? Was fandest du denn am überraschendsten zum Beispiel von ein Jahr Podcasting, 53 Episoden, mehr als 48 Stunden purer Content?",
            "start": 919652,
            "end": 941630,
            "confidence": 0.7372656249999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also was mich eigentlich immer fasziniert ist, wie schwierig es ist, den Erfolg eines Themas zu prädikten. Das heißt, man überlegt sich irgendwie, das wird die absolute Knalle-Episode, voll interessant, super cooles Thema und dann performt sie irgendwie nur ganz normal. Und dann hast du wieder ein extrem fragwürdiges Thema, sag ich mal, also mir ist es zum Beispiel so gegangen bei Episode 42, wo wir über Lexar und Counter-Strike gesprochen haben, wo du dein Counter-Strike-Projekt vorgestellt hast, da hab ich mir am Anfang gedacht, bei der Aufnahme, das wird wieder irgend so ein Andi-Thema und Er schreibt da irgendwas und hat da wieder irgend so ein Nischenthema, das interessiert keine Menschen. Und dann war aber die Episode sehr cool, die Aufnahme, und wir haben auch extrem viel Feedback bekommen, dass das super cooles Thema ist und dass man sich da so rein nerden kann in dieses Thema. Also das überrascht einen immer wieder. Oder ähnlich die O-Notation zum Beispiel, Folge 28. Das ist so ein theoretisches Thema und Klar, ich finde das ganz cool und mit meinem Uni-Background finde ich das auch sehr wichtig, aber ich habe mir eigentlich überhaupt nicht gedacht, dass das performt, weil jeder abgeschreckt ist schon von diesen Formeln. Und normal sagt man ja immer, wenn man eine Formel in einer Präsentation bringt, verliert man 50 Prozent des Publikums. Und diese Episode hat auch super performt. Also ich finde das super cool, weil die Leute scheinbar doch noch Interesse haben an diesen theoretischen Hintergründen, die ja auch sehr wichtig sind. Aber ich hätte mir einfach nie gedacht, dass das so performt. Und so ist es eigentlich bei jeder Episode. Man kann im Vorhinein eigentlich kaum sagen, wird es der absolute Renner oder floppt das Ganze.",
            "start": 941670,
            "end": 1031269,
            "confidence": 0.7880137931034475,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber ich finde doch gerade das ist doch ein mega vorteil oder das bedeutet das beschützt uns so ein bisschen dass wir uns nicht von dem erfolg oder misserfolg einer einer episode leiten lassen sondern wirklich die episoden machen worauf wir bock haben und das finde ich halt eher positiv dass wir sowas gar nicht sagen können okay wir haben jetzt nur diese clickbait titel oder ähnliches.",
            "start": 1032009,
            "end": 1053496,
            "confidence": 0.8288656716417911,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, wobei du ja auf diese Computerbildthemen stehst, Folge 46, 48, da erwähnt, eben die Dockerfolgen, die extrem gut performen, da springt man ja schon auf ein Hype-Thema dann auf.",
            "start": 1053989,
            "end": 1063741,
            "confidence": 0.7724666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das hat mich zum Beispiel auch überrascht. Ich hab eigentlich gedacht, jeder kennt schon Docker und jeder weiß das schon und das, was wir so erzählen, ist eigentlich Schnee von gestern, doch da haben wir erstaunlicherweise auch recht viel Feedback bekommen und sehr tolles Feedback. Endlich habe ich das mal verstanden, was die eigentlich gemacht haben und so weiter und so fort. Also das fand ich wirklich, wirklich erstaunlich. Und das hat mir auch wieder gezeigt, okay, wir leben schon in so einer kleinen Bubble hier und dass sich halt nicht jeder mit dem Docker-Thema auseinandergesetzt hat.",
            "start": 1063761,
            "end": 1091617,
            "confidence": 0.8476734693877548,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was war denn deine Lieblingsepisode?",
            "start": 1092383,
            "end": 1094205,
            "confidence": 0.7484000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich fand die Counter-Strike-Episode eigentlich granatenhaft, weil ich natürlich über eins meiner Passion-Themen sprechen durfte, wie ich mir ein ganzes Wochenende wegen dem Parser und Lexer für Counter-Strike-Config-Files um die Ohren geschlagen habe. Also das fand ich immer noch toll.",
            "start": 1094245,
            "end": 1106377,
            "confidence": 0.781575,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und du ein Jobangebot bekommen hast, bitte.",
            "start": 1106397,
            "end": 1108880,
            "confidence": 0.581857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und das fand ich halt so strange, so nach dem Motto, du codest ein bisschen was, weil du halt Spaß hattest und was da hinten dran rauspurzelt. Die SQL-Injection mit Episode 41 fand ich auch superinteressant, weil ich find solche Themen Granate, weil jeder denkt, ah, ich weiß doch schon alles. Doch wenn man in das Thema mal reingeht, was ne Time-Based-Blind-SQL-Injection ist, das können dir halt nicht viele Leute beantworten. Und da haben wir dann auch von anderen Podcast-Hosts das Feedback bekommen. Endlich habe ich das mal verstanden, da habe ich richtig was mitgenommen. Und das ehrt mich natürlich richtig. Also da springt mir das Herz.",
            "start": 1109252,
            "end": 1145057,
            "confidence": 0.788803738317757,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was war denn sonst noch irgendwie überraschend für dich? Also wo ist dein Herz gesprungen oder dir in die Hose gefallen?",
            "start": 1145097,
            "end": 1150641,
            "confidence": 0.7490476190476191,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da gab es eigentlich zwei Themen. Auf der einen Seite war es das Thema Podcasting. Also wir haben natürlich auch dieses ganze Projekt gestartet, weil es spannend war. Wir haben noch nie einen Podcast gemacht. und dann steigt man ins podcasting ein und merkt man hey ist ja eigentlich ganz geil ist ja alles eine offene technologie ist irgendwie nur ein ss feed der per http zur verfügung gestellt wird und jeder kann das machen jeder kann sich ein podcatcher du runterladen und du brauchst gar kein spotify und apple und dies und das und dann, merkst du mal die harte und dreckige realität und zwar geht es in den analytics bereich also auf der einen seite ist das podcasting super offen basierend auf offenen standards und auf der anderen seite, hat man keine transparenz in den in den zahlen in analytics das komplette zahlen ecosystem ist super geschlossen und auch total verwirrend, Weil jede Plattform irgendwie andere Metriken hat. Du weißt nicht, wie die richtig berechnet werden. Spotify hat Plays, aber auch Streams und irgendwie ein Play ist erst, wenn eine Episode zwei Minuten gehört wurde und ein Stream ist so und so. Also so völlig verwirrend und dann nimmst du das von Apple und da heißt das anders und du kannst also Plattform eigentlich gar nicht miteinander vergleichen.",
            "start": 1150661,
            "end": 1224393,
            "confidence": 0.79495,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber da arbeiten ja Matthias und ich dran mit unserem Open-Source-Projekt Open Podcasts. Also Andi, da ist dann Hilfe in Sicht für dich.",
            "start": 1224433,
            "end": 1231716,
            "confidence": 0.7658260869565218,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So, und dann hast du die Metrik Downloads, und die kann man schon plattformübergreifend vergleichen, aber wenn ich meinen Podcatcher so eingestellt hab, dass ich jeden Podcast, den ich subscribed hab, automatisch runterlade, dann heißt das ja, der zählt in Download, aber die Person hört das nicht. Also, das ist alles irgendwie humbug und supergeschlossen, und wenn du aus dem Webbereich kommst und die Webanalytics kennst und gewohnt bist, dann bist du halt schon sehr stark enttäuscht beim Podcasting.",
            "start": 1232036,
            "end": 1258354,
            "confidence": 0.8064556962025314,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dürfen wir diese Pitch, die du gerade für unser Open Podcast Projekt gemacht hast, dürfen wir die übernehmen in Zukunft?",
            "start": 1258676,
            "end": 1264673,
            "confidence": 0.78865,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gerne. Habt ihr ein Affiliate-Programm?",
            "start": 1264693,
            "end": 1265817,
            "confidence": 0.40700000000000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, wir sind ein Open-Source-Projekt.",
            "start": 1266594,
            "end": 1268215,
            "confidence": 0.548,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Docker ist auch ein Open-Source-Projekt.",
            "start": 1268255,
            "end": 1269897,
            "confidence": 0.675,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und die machen trotzdem Geld. Ja, okay. Fair point.",
            "start": 1269917,
            "end": 1272179,
            "confidence": 0.732,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Eine andere Geschichte, die ich überraschend fand, ist den Aufwand, den wir hier schon wieder reinstecken. Also das ganze Zeitinvestment. Ja, es ist nur Audio.",
            "start": 1272359,
            "end": 1282927,
            "confidence": 0.88188,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Andi hat sich heute übrigens, wie wir den Call gestartet haben, mit dem Satz gemeldet, Wolfgang, ich sehe dich viel zu oft. So will man mal willkommen geheißen werden.",
            "start": 1282967,
            "end": 1292675,
            "confidence": 0.8664827586206897,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das kann jetzt heißen, dass wir es immer noch nicht hinkriegen, asynchron zu arbeiten. Oder wir nehmen mehr auf, als wir veröffentlichen. Oder, oder, oder. Naja, aber ich find's halt faszinierend, weil am Anfang startest du ein Side-Projekt, ja, du machst das mal so ein bisschen. Und nach einem Jahr stellst du fest, okay, wir beide investieren circa ein Tag pro Woche pro Person in dieses Projekt, ja. Und das beinhaltet Research über ein Thema, Aufnahme, Schneiden. Cover Design, Marketing, Twitter, E-Mail schreiben, die ganze Programmierung für die Webseite, dann ein bisschen drüber nachdenken und auch planen, was machen wir mit dem Projekt nächstes Jahr, das kontinuierlich treiben, das ist schon gar nicht wenig Arbeit. Und dann siehst du noch andere Content Creator, die sowas auf YouTube machen nebenher.",
            "start": 1292915,
            "end": 1336752,
            "confidence": 0.7734692307692309,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und Video ist ja wirklich eine ganz andere Sache, noch zumindest, solange diese Video-AIs noch nicht alles übernehmen können.",
            "start": 1337253,
            "end": 1343599,
            "confidence": 0.8528947368421052,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und da ziehe ich dann meinen Hut vor jedem, der regelmäßig YouTube-Videos macht oder Videocontent, also Respekt. Aber das war für mich auch wieder überraschend, dass wir so viel Zeit investieren und es auch geschissen bekommen. Das finde ich ja viel faszinierender. Also ich habe den Zeitaufwand unterschätzt, aber ich habe auch nicht gedacht, dass wir ein ganzes Jahr jede Woche eine Episode raushauen können und es immer in Zeit geschafft haben. Also ich meine ab und zu sind wir in Bredouille geraten, da haben wir Montagabend aufgenommen, du hast in der Nacht geschnitten und ich habe es dann nochmal Probe gehört und dann morgens früh raus. Das war glaube ich ein oder zweimal der Fall.",
            "start": 1343639,
            "end": 1379444,
            "confidence": 0.7845603448275861,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber im Allgemeinen schaffen wir es ganz gut eigentlich die Zeitplanung. Und für alle, die jetzt enttäuscht sind, dass Andis Meetup, das Web-Engineering-Meetup Düsseldorf, nicht mehr stattfindet aktuell, ich bin die Schuld. Also ich nehme das alles auf mich. Andi hat einfach keine Zeit mehr, weil er mit mir da ständig in irgendwelchen Podcast-Aufnahmen rumhängt.",
            "start": 1379484,
            "end": 1398139,
            "confidence": 0.7987272727272727,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Quartal 3, Quartal 4 letzten Jahres kam die Idee nochmal auf und dann habe ich auch wieder ein paar Firmen kontaktiert und das ist dann alles irgendwie wieder eingeschlafen, weil dann immer so eine Podcast-Folge dazwischen kam.",
            "start": 1398179,
            "end": 1407747,
            "confidence": 0.6870000000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber für alle Leute da im Pod, falls ihr Andi unterstützen wollt, ich glaube, er wäre da offen, Unterstützung anzunehmen.",
            "start": 1408768,
            "end": 1415193,
            "confidence": 0.7977000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "2023 starten wir mal wieder was, weil Corona ist ja jetzt offiziell vorbei in Deutschland und die Politik hat es erklärt, dass wir am Ende sind.",
            "start": 1415203,
            "end": 1423040,
            "confidence": 0.6641923076923077,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber wenn wir schon bei 2023 sind, wir haben natürlich auch einiges geplant für das neue Jahr. Schauen wir mal, was wir alles durchbekommen. Also wir werden natürlich weitermachen und werden wöchentlich eine Episode liefern. Aber wir haben natürlich auch einiges Neues geplant.",
            "start": 1423841,
            "end": 1437512,
            "confidence": 0.8589302325581396,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja auf der einen Seite wollen wir mal gucken welche Podcast Plattform es noch gibt gefühlt ist das sehr viel Schwingung im Markt.",
            "start": 1437932,
            "end": 1444755,
            "confidence": 0.8084347826086955,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vor allem Andi hat uns jetzt bei RTL Plus angemeldet, also auf RTL wollt ihr wirklich als letztes landen Andi, jetzt sind wir auf RTL.",
            "start": 1444775,
            "end": 1452638,
            "confidence": 0.80144,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du bist ja einer der acht Millionen Pfeifen aus meinem Flachwitz, also dann bist du auch nicht mehr weit vom Dschungelcamp entfernt. Deswegen hab ich gesagt, RTL Plus, was mal Audible war, glaub ich, also, RTL Plus hat Audible gekauft, das meinte ich mit Schwingungen im Markt, und da hab ich einfach mal gedacht, okay, lass mal gucken.",
            "start": 1452658,
            "end": 1469137,
            "confidence": 0.7256724137931033,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was, Audible? Audible ist ja Amazon.",
            "start": 1469157,
            "end": 1471099,
            "confidence": 0.3835,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Audio Now.",
            "start": 1471159,
            "end": 1471920,
            "confidence": 0.8500000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Entschuldigung, nicht Audible.",
            "start": 1472220,
            "end": 1473461,
            "confidence": 0.566,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Audio Now haben sie gekauft. Dann hab ich gedacht, okay, probierst du das mal, aber ich musste zugeben, ich hab schon ... Wir sind da jetzt zwar vertreten, aber ich musste schon dreimal mit dem Support sprechen. Also, ganz rund läuft das da noch nicht.",
            "start": 1473521,
            "end": 1485512,
            "confidence": 0.7527777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ich hoffe ja, dass wir jetzt bald solche D-Promis sind, dass wir zum Dschungelcamp wenigstens eingeladen werden. Du möchtest da hin. Oder besser Z-Promis. Keine Ahnung. Läuft das noch? Gibt's das noch?",
            "start": 1486119,
            "end": 1498911,
            "confidence": 0.7333333333333331,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kannst du dir vorstellen, dass das immer noch Geld abwirft?",
            "start": 1498931,
            "end": 1500512,
            "confidence": 0.6426999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, garantiert.",
            "start": 1500832,
            "end": 1501952,
            "confidence": 0.6305000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also läuft das mit hoher Wahrscheinlichkeit noch.",
            "start": 1501992,
            "end": 1504173,
            "confidence": 0.6148571428571428,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das kann gut sein, ja.",
            "start": 1504213,
            "end": 1505574,
            "confidence": 0.48466666666666663,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber wir wollen auch mal gucken, ob wir unseren Audio-Podcast auf YouTube veröffentlichen wollen bzw. können. Und jetzt haben wir uns gedacht, ja, ihr könnt ja das Audio einfach hochladen. Nein, das ist ja alles nicht so einfach, ja? Eigentlich hatte ich mehr Spaß dabei, mal ein bisschen mit FFmpeg rumzuhacken.",
            "start": 1505594,
            "end": 1523904,
            "confidence": 0.8302745098039219,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du wirst es natürlich schon wieder automatisieren, bevor man es einmal ausprobiert, ist eh klar.",
            "start": 1523924,
            "end": 1527806,
            "confidence": 0.5537333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und zwar ist die Grundidee, ich nehme mir das Audio-File. Es gibt eine Möglichkeit mit FFmpeg so eine Audio-Waveform zu generieren und dann mit einem Bild dahinter und dann automatisch über die YouTube-API die ganze Sache zu veröffentlichen. Mal gucken, ob ich das hinkriege. Ich bin noch nicht so der große FFmpeg-König. Aber das Tool hat irgendwie viel zu viele Command-Line-Argumente und Parameter. Mal gucken, ob ich die richtige Kombination hinkriege. Also, falls jemand mehr im YouTube-Space unterwegs ist, anstatt auf Spotify oder Apple oder wo auch immer, kann uns da hoffentlich bald auch da hören.",
            "start": 1527846,
            "end": 1561763,
            "confidence": 0.7904270833333328,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und vielleicht schaffen wir es auch mal, eine Episode mit Video zu machen. Vielleicht, wenn ich mal wieder in Düsseldorf bin, mich hintraue, wenn der neue Bahnhof dann endlich fertiggestellt ist, Andi, komm ich dich mal besuchen, dann können wir mal ein Video aufnehmen, dann sieht man vielleicht auch was von uns. Obwohl ich nicht weiß, ob das irgendwer will.",
            "start": 1562163,
            "end": 1578877,
            "confidence": 0.7809666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Apropos besuchen. eine idee die wir 2023 mal ausprobieren.",
            "start": 1578937,
            "end": 1585123,
            "confidence": 0.8088888888888888,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wollen da war er wieder der überleitungskönig andreas ist unglaublich also vom vom computerbild themenspezialist zum überleitungskönig ist du hast schon.",
            "start": 1585163,
            "end": 1594352,
            "confidence": 0.8061904761904761,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So viele titel bekommen, 2.23 wollen wir mal versuchen, dass uns andere Leute in diesem Podcast besuchen. Und zwar experimentieren wir mal mit dem Format, den einen oder anderen Gast mal einzuladen. Wir haben schon eine kleine Liste gemacht. Wir sind uns noch nicht ganz einig, in welcher Art, in welchem Format das Ganze stattfindet. Aber wenn ihr uns treu bleibt, werdet ihr davon wahrscheinlich in den nächsten paar Wochen mal hören.",
            "start": 1594372,
            "end": 1622483,
            "confidence": 0.8460833333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wer Ideen natürlich hat, wenn jemand jetzt sagt, okay, diese Person solltet ihr eigentlich unbedingt interviewen, deutschsprachigen Rahmen, super cool, bitte gerne, wir sind wirklich offen für jede Vorschläge, nicht nur Themen, sondern eben jetzt auch Gäste. Und wenn wir schon beim Thema sind, andere Leute zu treffen, wir wollen ganz allgemein ein bisschen mehr interaktiv mit euch in Kontakt treten und haben uns auch überlegt, ob wir vielleicht eine kleine Community starten. Einfach damit wir eben nicht nur immer in dieses komische schwarze Loch da von dem Mikrofon sprechen, sondern eben auch irgendwo einen Rückkanal haben. Aber da sind wir auch noch nicht ganz klar, in welche Richtung wir gehen wollen. Wir haben da schon einige Leute befragt, auch mit denen wir seit Anfang an in Kontakt sind. Danke nochmal dafür. Man sendet den Leuten wirklich ein E-Mail und man bekommt sofort eine Antwort. Das ist super hilfreich, wenn man solche Ideen einfach mal checken will. Macht Sinn, irgendwie eine Community zu starten. Wir wollen dann natürlich auch spezielles Thema haben und speziellen Schwerpunkt. Darum wollen wir da nicht einfach irgendwas öffnen, sondern wollen da schon auch ein gutes Konzept dahinter haben. Darum wird es auf jeden Fall noch ein bisschen dauern. Aber ganz konkret, was ein bisschen kurzfristiger ist, wir wollen auch Leute wirklich in der Realität treffen und zwar bei der FOSDEM im Februar. Wer so auf der FOSDEM ist, auf der größten Open Source Konferenz von mindestens Europa, da sind so ungefähr 7000 Leute am Start. Also wer in Belgien ist, zufällig, wir werden da noch irgendwas organisieren. Und werden das natürlich auch über unsere Kanäle nochmal erwähnen, wann, wo, wie das ganze stattfinden wird. Wer da Ideen hat, bitte auch gerne melden.",
            "start": 1622683,
            "end": 1710950,
            "confidence": 0.8256284722222224,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vierter und fünfter Februar in Brüssel, in Belgien. Wer im Pott wohnt, Nordrhein-Westfalen, circa anderthalb Stunden mit dem Auto darüber. Die Konferenz geht zwei Tage lang, ist komplett gratis an der Universität von Brüssel. Das bedeutet, ich müsste eigentlich nur die Anreise und gegebenenfalls eine Schlafmöglichkeit organisieren.",
            "start": 1710990,
            "end": 1730243,
            "confidence": 0.856659574468085,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und den Schirm muss man auch noch zahlen, den man immer braucht, weil es regnet jedes Jahr dort. Es ist arschkalt und es regnet. Aber es gibt gutes belgisches Essen. Und es ist nicht nur diese komischen Bommes da.",
            "start": 1730703,
            "end": 1741969,
            "confidence": 0.8391794871794872,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wer also auf Free and Open Source Software steht und auch sehr viel Detailwissen über Programmiersprachen und ein Ecosystem um Container oder Observability, oder Data Science, Machine Learning, High Performance Computing, PostgreSQL oder ähnliches mal mitnehmen möchte. Diese Konferenz können wir nur empfehlen. Wir fahren seit vielen Jahren hin und haben uns gedacht, hey, das wäre doch einfach mal ein guter Punkt, um Leute aus der Community zu treffen. Den genauen Plan haben wir noch nicht. Die Grundidee ist, dass wir vielleicht irgendwie einen Tisch reservieren und irgendwo in einem Restaurant mal zusammen essen gehen. oder vielleicht irgendwo danach in ne Bar und den ein oder anderen trink Cola Bier oder was weiß ich in die Zukunft nehmen und einfach locker ein bisschen quatschen. Wer uns also auch mal kennenlernen möchte, wir wollen euch natürlich auch kennenlernen, können wir das nur empfehlen. Dazu gibt es aber in den nächsten paar Tagen über die üblichen Social Media Kanäle Infos von uns und Falls ihr das jetzt hört und sagt, hey, ich hab Bock, schreibt uns einfach eine E-Mail stetig at engineeringkiosk.dev und wir melden uns.",
            "start": 1741989,
            "end": 1802380,
            "confidence": 0.7631521739130429,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und damit bleibt uns eigentlich nur mehr uns nochmal wirklich bei euch allen zu bedanken, die da wirklich jede Woche dabei sind, uns zuhören und da wirklich eine Stunde auch durchhalten. Wir sehen es in den Statistiken eben. Über 75 Prozent hören sich da wirklich die ganze Stunde an. Also vielen, vielen Dank, dass ihr alle mit dabei seid und ich wünsche euch allen noch auf jeden Fall ein gutes neues Jahr und hoffentlich ist es dann weltpolitisch auch ein besseres Jahr.",
            "start": 1802420,
            "end": 1826259,
            "confidence": 0.8249634146341465,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vielen Dank! Ich hoffe, wir konnten euch ein paar Hintergrundinformationen mitgeben. Ansonsten sehen wir uns nächsten Dienstag.",
            "start": 1826699,
            "end": 1832924,
            "confidence": 0.7652941176470588,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Viel Spaß! Ciao! Nein, warum geht diese Stopp-Taste nicht? Warst du jetzt auch gerade Connection lost?",
            "start": 1832964,
            "end": 1841976,
            "confidence": 0.471625,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7904858757062176,
    "audio_duration": 1847.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}