{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/8d890e77-cc0f-4cf7-b35b-bf5a21553d60/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "620k1r7uo8-aad4-4caf-81e5-01a65fe8a542",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen zu einer neuen Folge vom Engineering Kiosk. Heute mit einer etwas anderen Episode, der eigentlichen Folge 0. Nach 5 Folgen ziehen wir ein kleines Resümee und reden darüber, wer sind wir eigentlich, stellen uns kurz vor, warum machen wir diesen Podcast, wie sind wir an dieses Projekt herangegangen und was sind unsere aktuellen technischen Learnings nach 5 Folgen. Steigen wir direkt ein und los geht's.",
      "start": 2540,
      "end": 28235,
      "confidence": 0.8376666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir haben jetzt fünf Folgen gemacht. Andi, darf man dann schon gratulieren? Darf ich schon Gratulation Andi sagen?",
      "start": 30767,
      "end": 37448,
      "confidence": 0.7060555555555557,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich denke schon, und ich würde das sehr gerne annehmen und auch zurückspielen, denn es fühlt sich schon so ein bisschen an, als machen wir den Podcast schon eine Ewigkeit.",
      "start": 38075,
      "end": 46279,
      "confidence": 0.6706333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wir haben auch schon extrem viele Hörerinnen, die Feedback gesendet haben und wirklich von vielen Seiten auf uns zugekommen sind. Das freut uns natürlich umso mehr. Und darum fühlt sich das auch schon irgendwie wie ein Podcast an, den es schon lange gibt. Und was wir aber immer vor uns hergeschoben haben, ist eigentlich so eine Einleitungsfolge oder so irgendeine Folge über uns. Und wir haben von vielen Seiten eigentlich die Beschwerde bekommen, wer seid ihr eigentlich? Auch so von Leuten, die eine Person vielleicht von uns kennen, die gemeint haben, wer ist denn dieser andere da im Podcast? Und darum wollen wir das einfach kurz nachholen, so eine mini Vorstellungsrunde.",
      "start": 46299,
      "end": 82080,
      "confidence": 0.8185089285714285,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir könnten jetzt natürlich deinen Lebenslauf ganz langweilig vorlesen oder wir können dich mal richtig kennenlernen, Wolfgang. Und dafür habe ich nämlich drei Fragen und einen Faktencheck vorbereitet. Und ich würde gerne mal wissen von dir, was willst du mal werden, wenn du mal groß bist?",
      "start": 82120,
      "end": 99149,
      "confidence": 0.7939782608695652,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Feuerwehrmann.",
      "start": 99189,
      "end": 100269,
      "confidence": 0.619,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Warum bist du jetzt kein Feuerwehrmann?",
      "start": 100309,
      "end": 101390,
      "confidence": 0.5788333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich bin eigentlich schon Feuerwehrmann und zwar seit 1996, wenn man es genau nimmt, bei der Freiwilligen Feuerwehr. Natürlich mit Unterbrechung, wenn ich im Ausland bin und so weiter, aber ich bin immer noch Mitglied der Freiwilligen Feuerwehr in Innsbruck.",
      "start": 102006,
      "end": 115155,
      "confidence": 0.7694634146341462,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und was blockiert dich, dass du das nicht Vollzeit ausübst?",
      "start": 116016,
      "end": 119598,
      "confidence": 0.6099,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, hauptberuflich Feuerwehrmann zu sein, wäre sicher ganz interessant. Aber wenn man das vergleicht mit der IT, wie schnelllebig die IT ist und wie schnell man da lernt und vorangehen kann, ist das, glaube ich, einfach die interessantere Position als Feuerwehrmann. Und ich kann ja immer noch Feuerwehrmann sein als freiwilliger Feuerwehrmann und da auch viel lernen und miterleben und weitergeben. Und das ist, glaube ich, für mich einfach die bessere Aufteilung.",
      "start": 120036,
      "end": 144364,
      "confidence": 0.8010684931506846,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Zweite Frage, was ist das letzte, nicht IT-technische, was du gelernt hast?",
      "start": 145211,
      "end": 151056,
      "confidence": 0.8523333333333335,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eigentlich dürften wir die ganzen Denkpausen gar nicht rausschneiden, damit es authentisch rüberkommt. Also wir denken wirklich lange nach, aber wir schneiden trotzdem die Pausen raus, damit es einfacher zum Zuhören wird, glaube ich.",
      "start": 151076,
      "end": 161783,
      "confidence": 0.7668529411764705,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, sorry, sonst denkst du Spotify wird ein Hänger.",
      "start": 161803,
      "end": 163805,
      "confidence": 0.42211111111111105,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber um auf die Frage zurückzukommen, was ich als letztes gelernt habe, ich bin gerade gestern eine schwerere Kletterroute gestiegen endlich und habe, glaube ich, diesen Zug endlich gelernt, den richtigen, um die Kletterroute zu schaffen.",
      "start": 164173,
      "end": 176420,
      "confidence": 0.7968333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was genau ist ein Zug? Hast du da eine Eisenbahnschiene?",
      "start": 176460,
      "end": 180163,
      "confidence": 0.6375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also da, Kletter, nennt sich das Kletterzug? Gute Frage, warum das so heißt. Also das ist eine Bewegung, wie man halt zum nächsten Griff kommt, nennt man einen Zug. Wie beim Spielen auch, einen Spielzug.",
      "start": 180223,
      "end": 192650,
      "confidence": 0.7407999999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin jetzt nicht so versiert, was das Klettern angeht, aber ich glaube...",
      "start": 193087,
      "end": 197970,
      "confidence": 0.7993076923076923,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir sind schon oft gemeinsam geklettert. Du darfst dich nicht so abwerten.",
      "start": 197990,
      "end": 201733,
      "confidence": 0.5516666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich komme mit Kraft hoch und du kletterst. Das ist, glaube ich, ein Unterschied.",
      "start": 201773,
      "end": 205996,
      "confidence": 0.8060714285714285,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Welche Kletterschwierigkeiten kletterst du gerade? Ich kämpfe gerade mit 7a.",
      "start": 206036,
      "end": 211159,
      "confidence": 0.7579000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Respekt, Respekt. Okay, kommen wir zur dritten Frage. Was motiviert dich, dich jeden Tag erneut mit IT und Softwareengineering zu beschäftigen?",
      "start": 211219,
      "end": 218584,
      "confidence": 0.768904761904762,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das Interessanteste an IT für mich ist eigentlich, dass man Sachen automatisieren kann, vereinfachen kann, beschleunigen kann und anderen Leuten oder sich selber dann einfach das Leben erleichtern kann. Durch IT und durch die Automatisierung.",
      "start": 219082,
      "end": 234647,
      "confidence": 0.8375142857142858,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf einer Skala von 0 bis 10, wo 0, ich bin super fleißig und 10, muss ich mich jetzt wirklich bewegen. Wie faul bist du?",
      "start": 234667,
      "end": 242709,
      "confidence": 0.7614799999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also deinen Regeln nach gibt es ja nur drei Fragen, das war jetzt eigentlich schon die vierte Frage, aber ich würde mich gemütlich bei drei ansiedeln.",
      "start": 243233,
      "end": 251099,
      "confidence": 0.7926538461538464,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Schon sehr fleißig eigentlich, meines Erachtens nach.",
      "start": 251119,
      "end": 253541,
      "confidence": 0.6262857142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So Moment, welche Bewegung hast du jetzt gemeint? Sportliche Bewegung, weil da würde ich mich höher ansiedeln oder mehr so das Herangehen im Leben, diese Bewegung und Geschwindigkeit?",
      "start": 253561,
      "end": 264810,
      "confidence": 0.7193928571428571,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du kamst auf Automatisierung zu sprechen, also eher Herangehensweisen und Co.",
      "start": 265211,
      "end": 270055,
      "confidence": 0.49218181818181805,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist schwierig zu beantworten. Ich würde gern wesentlich niedriger gehen durch die Automatisierung, aber ich glaube, wenn mich ein Projekt interessiert oder irgendein Thema sehr interessiert, dann kann ich mich da schon auch schnell bewegen.",
      "start": 271201,
      "end": 282912,
      "confidence": 0.7409444444444443,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, danke für die Antwort. Bevor wir zum langweiligen, organisatorischen Kombiname, Wohnort oder ähnlichem, ein kurzer, schneller Faktencheck. Du kriegst jetzt immer eine Frage, eine Oder-Frage gestellt und deine Antwort ist immer einer dieser Auswahlmöglichkeiten. Wir behandeln insgesamt sechs Fragen. um vielleicht ein bisschen Konfliktpotenzial aufzudecken. Bist du bereit?",
      "start": 283395,
      "end": 308199,
      "confidence": 0.8108775510204083,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ... Ich glaub, Politiker sagen immer, solche Wordraps sind das Schlimmste, was sie machen müssen. Ich komm mir grad auch so vor in dieser Situation.",
      "start": 308259,
      "end": 316803,
      "confidence": 0.6963461538461537,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich ignoriere das einfach mal. Wir machen mal weiter. Tabs oder Whitespaces?",
      "start": 317203,
      "end": 320985,
      "confidence": 0.6603333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Whitespaces.",
      "start": 321105,
      "end": 322325,
      "confidence": 0.485,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wim oder Emacs?",
      "start": 322385,
      "end": 323526,
      "confidence": 0.5483333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wim.",
      "start": 323586,
      "end": 324166,
      "confidence": 0.73,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Chrome oder Firefox?",
      "start": 324226,
      "end": 325587,
      "confidence": 0.48500000000000004,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Firefox. Oder eigentlich beides. Ich verwende Firefox und Chrome. Aber Tendenz Firefox.",
      "start": 325627,
      "end": 331790,
      "confidence": 0.7240833333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Pilz oder Altbier?",
      "start": 332423,
      "end": 333544,
      "confidence": 0.769,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Pilz.",
      "start": 333584,
      "end": 334444,
      "confidence": 0.735,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Espresso oder Cappuccino?",
      "start": 334504,
      "end": 335985,
      "confidence": 0.6756666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Cappuccino.",
      "start": 336045,
      "end": 337106,
      "confidence": 0.684,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und das letzte, Kaiserschmarrn mit oder ohne Rosinen?",
      "start": 337146,
      "end": 340167,
      "confidence": 0.75475,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da gibt es nur eine Antwort, es gibt Kaiserschmarrn nur mit Rosinen. Das andere ist kein Kaiserschmarrn.",
      "start": 340187,
      "end": 344990,
      "confidence": 0.7779411764705882,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, also sorry, geht gar nicht. Kaiserschmarrn wird genauso wie Käsekuchen, sagt der Norddeutsche, ohne Rosinen gegessen. Alles andere ist ja...",
      "start": 345050,
      "end": 356396,
      "confidence": 0.8174285714285714,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So fangt ihr schon mal an, es gibt keinen Käsekuchen, das heißt Topfenkuchen.",
      "start": 356436,
      "end": 359217,
      "confidence": 0.5940000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der kommt nicht aus dem Topf. Warum sollte der Kuchen Topfenkuchen heißen?",
      "start": 360398,
      "end": 364001,
      "confidence": 0.57975,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, wir gehen weiter. Aber hier haben wir natürlich Abfragen vorbereitet.",
      "start": 364041,
      "end": 368084,
      "confidence": 0.7321666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Moin, moin, moin. Bevor wir die Vorstellung abschließen.",
      "start": 368104,
      "end": 370747,
      "confidence": 0.630875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ach so, kommt jetzt der langweilige Teil von mir noch.",
      "start": 370807,
      "end": 372708,
      "confidence": 0.6761999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ganz kurz das Organisatorische für deine Personalakte. Okay. Wo kommst du her und wo wohnst du?",
      "start": 372728,
      "end": 378753,
      "confidence": 0.6164999999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich komme aus Österreich, Innsbruck und pendle meistens so zwischen Innsbruck und Amsterdam herum, aber die Halbzeit meines Jahres verbringe ich eigentlich in Amsterdam. Und damit der langweilige Teil auch noch abgeschlossen ist, ich habe gerade nachgeschaut, 1998 habe ich mein erstes eigenständiges Webprojekt begonnen. Und seitdem bin ich eigentlich selbstständig unterwegs als Freelancer im IT-Bereich. Und am Weg habe ich auch nochmal nebenbei acht Jahre auf der Uni gearbeitet, wo ich dann auch meinen Doktor gemacht habe in Informatik. Und 2016 bin ich dann eben auch Vollzeit bei Trivago gewesen und da haben wir uns eben auch kennengelernt.",
      "start": 379142,
      "end": 418174,
      "confidence": 0.7911212121212118,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und die letzte Frage. Wie viele Domains besitzt du, wo du noch kein Zeitprojekt gestartet hast?",
      "start": 418234,
      "end": 422296,
      "confidence": 0.5353125,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe da auch gerade nachgeschaut, weil ich natürlich schon antizipiert habe, dass du diese Frage stellst, eh klar. Und ich habe 34 Domains, mir war es aber nicht ganz klar, welche Domains jetzt wirklich aktiv sind, welche nicht aktiv sind. Ich habe auf jeden Fall diese Regel jetzt aufgestellt, wann immer ich ein neues Projekt starte oder im Kopf habe, darf ich keine Domain kaufen, bis das MVP steht, was man dann wirklich unter dieser Domain online stellen kann. Und ich habe das auch kürzlich in dem Projekt zusammen mit dem Endler Matthias CodePrince.dev gemacht. Und da haben wir wirklich so lange gewartet, bis wir eine funktionierende Version hatten, bis wir die Domain gekauft haben. Und das kann ich wirklich jedem empfehlen. Ist eine super Vorgehensweise.",
      "start": 422850,
      "end": 467153,
      "confidence": 0.8107637795275592,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wer mehr zum Thema SideProjects hören möchte, kann in Episode 1 und 2 mal reinschalten. Danke Wolfgang für die Vorstellung.",
      "start": 467173,
      "end": 472897,
      "confidence": 0.44704999999999995,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, aber damit du uns nicht entkommst, habe ich natürlich auch Fragen vorbereitet. Ich habe zu viele Fragen, das heißt, ich muss jetzt ein paar auswählen. Vielleicht starten wir mal mit der. Was ist das Erste, was du tust, wenn du einen Incident hast und die Webseite down ist?",
      "start": 473816,
      "end": 490451,
      "confidence": 0.8049795918367346,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich gehe zur Kaffeemaschine und hole mir einen Kaffee.",
      "start": 491012,
      "end": 493034,
      "confidence": 0.267,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das habe ich mir erwartet, obwohl du Millionen verlierst in der Zeit.",
      "start": 493054,
      "end": 496277,
      "confidence": 0.7079166666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Obwohl ich Millionen verliere. Weil ich denke, dass wenn du das hörst und das siehst, dein Puls erstmal nach oben schnellt und du durch den Gang zur Kaffeemaschine auf jeden Fall ein bisschen ruhiger wirst. Das Koffein von dem Kaffee hilft wahrscheinlich nicht ganz so, aber danach kann man gut am Inzidenz arbeiten, indem man zwei, dreimal durchgearbeitet hat.",
      "start": 496752,
      "end": 519715,
      "confidence": 0.8010508474576271,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist der Unterschied. Darum trinken wir in Österreich Kaffee und nicht Kaffee, weil das eine Lebensherangehensweise ist und kein Getränk. Das ist eine gemütliche Lebensphilosophie. Und so sollte man auf ein Inzident hingehen.",
      "start": 520202,
      "end": 533910,
      "confidence": 0.8080882352941177,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich muss aber zugeben, aktuell habe ich vor meinem Inzident noch keine Siebträgermaschine oder so genutzt, sondern immer so einen Kaffeevollautomaten. Das bedeutet, da vergehen jetzt keine 10 Minuten, damit ich wirklich meine Milch aufschäume oder ähnliches, sondern ich drücke wirklich auf den Knopf und dann vergeht dann maximal 30 Sekunden.",
      "start": 534454,
      "end": 551683,
      "confidence": 0.8265490196078432,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Gut, kommen wir zur nächsten Frage. Du warst bei Trivago eigentlich immer bekannt als Aufräumer und meines Wissens hast du auch 15 Gewächshäuser abgerissen. Warum macht es dir so Spaß aufzuräumen? Und neben Frage, warum postest du auf Instagram Fotos von von Wasser eingeschlossenen Ziegen?",
      "start": 552099,
      "end": 569590,
      "confidence": 0.7991333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kennst du die Serienfigur Monk?",
      "start": 570074,
      "end": 573997,
      "confidence": 0.849,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich.",
      "start": 574017,
      "end": 574758,
      "confidence": 0.914,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich mag es einfach aufgeräumt und ich habe so einen kleinen Hang zum Perfektionismus. Der schadet mir, glaube ich, mehr als er mir bringt, aber ich glaube, ich mag es gern abgeschlossen. Ich mag gern, das muss fertig sein. Und wenn etwas aufgeräumt ist, wenn ein altes System weggeräumt ist, dann ist das in meinem Kopf so, okay, das ist fertig, das ist abgeschlossen. Und warum ich auf Instagram ein Foto von in Wasser eingeschlossenen Ziegen poste, das hört sich jetzt so an, als würde ich Ziegen quälen, das ist aber nicht der Fall, sondern wir hatten eine Überschwemmung hier und zu der Zeit hatte ich Ziegen auf einem Stück, auf einem Feldstück von mir. Und diese Ziegen sind in ihrem Haus und das Feld war ein bisschen überschwemmt, aber da war kein Wasser im Ziegengehege, also im Ziegenhaus. Die Ziegen haben dann relativ doof aus ihrem Haus geguckt, weil sie halt nicht wirklich wussten, warum hier überall Wasser steht.",
      "start": 574798,
      "end": 625544,
      "confidence": 0.8154562499999995,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wir werden das Bild auf jeden Fall verlegen, sollte man sich auf jeden Fall anschauen.",
      "start": 625584,
      "end": 630306,
      "confidence": 0.8293750000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist auf jeden Fall ein sehr lustiges Bild, in der Tat, in der Tat.",
      "start": 630346,
      "end": 633366,
      "confidence": 0.7879333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und die 15 Gewächshäuser, warum reißt du Gewächshäuser ab?",
      "start": 633926,
      "end": 636527,
      "confidence": 0.5269999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe einen Gärtnerei-Betrieb geerbt und habe die Gewächslose abgerissen, weil ich kein Gärtner bin und sie selbst nicht mehr wirtschaftlich tragbar waren.",
      "start": 637404,
      "end": 644867,
      "confidence": 0.7927826086956521,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du bist eher auf der Abrissseite und weniger auf der Gärtnerseite der neue sprießende Pflanzen und Projekte begründet.",
      "start": 644887,
      "end": 652690,
      "confidence": 0.8513333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn es ums Handwerkliche geht, bin ich nicht wirklich begabt. Mir macht es jedoch viel Spaß. Deswegen dachte ich mir, mit dem Abreißen fängt man an, bevor man etwas neu aufbaut. Auf der technischen Seite ist es genau andersrum. Da macht es mir mehr Spaß, etwas Neues zu beginnen. Da komme ich dann aber meist nicht zu dem abschließenden Ergebnis. Das bedeutet, da ist dann mein Monk nicht wirklich erwachsen.",
      "start": 653240,
      "end": 677382,
      "confidence": 0.8428285714285716,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ihr glaubt gar nicht, wie viele Fotos es von Andi gibt mit irgendeiner Motorsäge in der Hand oder wo er irgendwelche Bäume fällt oder eben Gewächshäuser abreißt. Also wenn ich mal irgendwen brauche, der was abreißt, ich glaube Andi ist definitiv eine gute Anlaufstelle. Aber kommen wir zu meiner letzten Frage. Du darfst dir jetzt aussuchen, Einen Spruch, der entweder auf deinem Grabstein stehen soll, oder auf einem riesengroßen Banner in deiner Heimatstadt Duisburg am Hauptplatz, falls es sowas gibt?",
      "start": 678152,
      "end": 707214,
      "confidence": 0.805775,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Für den Anwendungsfall würde ich jeweils andere Sprüche nehmen. Für meinen Grabstein würde ich so etwas nehmen wie, das kannst du halt schon so machen, aber dann ist es halt kacke. Und für den Banner am Duisburger Hauptplatz, ich glaube nicht, dass es sowas gibt, es gibt einen Rathausplatz oder ähnliches, oder den Vorplatz unseres wunderschönen Hauptbahnhofs, Ich glaube da würde ich sowas schreiben wie Duisburg muss man wollen.",
      "start": 707254,
      "end": 729011,
      "confidence": 0.7759130434782608,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay jeder der in Duisburg schon mal war weiß was gemeint ist. Und jetzt noch dein langweiliger Teil Andi, dein CV von vorne bis hinten.",
      "start": 729071,
      "end": 738635,
      "confidence": 0.8047600000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin aufgewachsen und wohne auch noch in Duisburg im Ruhrgebiet. Hab eine klassische Ausbildung als Fachinformatiker, Fachrichtung Anwendungsentwicklung gemacht. Hab danach in einer klassischen Webagentur gearbeitet, primär mit dem PHP, CMS, Typo 3. Hab neben der Arbeit Wirtschaftsinformatik studiert und bin danach zu Trivago gegangen, wo ich dann auch irgendwann den Wolfgang kennengelernt hab, weil er einer meiner direkten Peers war. Wir waren zu der Zeit beide Engineering Manager. Und weil man sich mit seinen direkten Peers halt sehr, sehr viel austauscht über ähnliche Herausforderungen, sind wir uns halt so immer sympathischer geworden. Oder halt auch nicht, wenn wir uns über Kaiserschmarrn mit oder ohne Rosinen streiten.",
      "start": 738655,
      "end": 783660,
      "confidence": 0.8516018518518512,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du sagst studieren, du hast ein Bachelor gemacht, oder?",
      "start": 784681,
      "end": 787424,
      "confidence": 0.628,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hab ein Bachelor of Science gemacht, richtig.",
      "start": 787444,
      "end": 789085,
      "confidence": 0.57025,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Mein Professor hat immer gesagt, Bachelor ist ein anderes Wort für Studienabbrecher. Aber ich will da gar nicht jetzt diese Diskussion beginnen. Ist natürlich nicht meine Meinung, klar.",
      "start": 789125,
      "end": 799894,
      "confidence": 0.6996785714285715,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber Wolfgang, wir haben jetzt so viel über uns geredet. Lass uns doch mal bitte über den Podcast reden. Erklär doch mal bitte, warum wir diesen Podcast eigentlich machen.",
      "start": 800746,
      "end": 808790,
      "confidence": 0.7787241379310346,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, die ursprüngliche Idee war einfach, dass wir extrem oft miteinander über Sachen, wie man auf Österreichisch sagt, geratscht haben oder auf Tirolerisch gequatscht haben, damit du es auch verstehst. Und wir das eigentlich sehr regelmäßig betrieben haben, wie wir bei Trivago waren, aber auch später Remote und so weiter. Und wir haben uns überlegt, okay, könnte das eventuell für andere auch interessant sein? Und wir könnten es doch einfach aufnehmen, ein Record-Button drücken und eventuell interessiert es auch andere Leute, weil für uns war es eigentlich immer sehr wichtig und es waren auch spannende Themen dabei. Warum sollte man das nicht auch anderen Leuten zugänglich machen? Und vielleicht kann irgendwer davon profitieren, von dem Zeug, was wir so von uns geben.",
      "start": 809250,
      "end": 850332,
      "confidence": 0.8122276422764227,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir haben die Zoom Sessions immer gemacht, wir haben uns immer unterhalten, weil es immer so eine Art Selbsttherapie für uns auch war. Und weil wir im deutschsprachigen Raum eigentlich niemanden gefunden haben, der über die Themen Engineering Culture, Menschen, Open Source und Technologie mit einem speziellen Fokus über Software Engineering gesprochen hat. Deswegen dachten wir uns, okay, lass uns das doch mal probieren. Und jetzt sind wir hier mit dem Engineering Kiosk.",
      "start": 850682,
      "end": 875181,
      "confidence": 0.7703287671232875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was natürlich auch noch ein Thema war, dass wir einfach auch unsere Artikulation verbessern wollten. Das funktioniert jetzt vielleicht nicht so gut, vor allem wenn ich dann im Dialekt spreche. Aber grundsätzlich, wie man über Sachen redet und wie man Sachen beschreibt, ich glaube, da kann ein Podcast auch sehr gut sein. Und das ist natürlich dann auch Teil unserer Selbsttherapie.",
      "start": 875487,
      "end": 896562,
      "confidence": 0.8212258064516127,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ein früherer Kunde von der Webagentur, bei der ich gearbeitet habe, er kommt aus der Eifel. Und als ich immer Meetings hatte, wurde mir irgendwann gesagt, Andi, man hört, dass du aus dem Pott kommst. Weil diese Art von Watt und Dat konnte ich einfach nicht ablegen.",
      "start": 897178,
      "end": 914816,
      "confidence": 0.7988510638297872,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ich habe immer gedacht, ihr verwendet keine Artikel, aber du verwendest, glaube ich, Artikel. Du sagst nicht, ich gehe ins IG-Bett, oder?",
      "start": 914856,
      "end": 920622,
      "confidence": 0.5664782608695652,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich gehe schon ins Bett, aber der klassische Pottfehler ist, dass man immer den falschen Artikel nutzt. Und ich glaube auch, das ist eingebrannt. Ich glaube, das kriegst du irgendwie mit der Muttermilch oder so oder durch den Kohlestaub und Stahlstaub hier irgendwie rein. Ich weiß es nicht. Wolfgang, wir haben über Side-Projects geredet, Episode 1 und 2. Wir haben über deine Domains geredet, 36 oder 38 Domains, ich hab nicht gedacht, dass das so viele sind, aber okay. Und jetzt ist ja das Engineering-Kiosk, der Engineering-Kiosk, was ist eigentlich der richtige Artikel, ich weiß es gerade nicht, ist ja eigentlich auch ein Side-Project von uns. Und wir predigen hier die ganze Zeit, dass man Side-Projects lean starten soll, mit einem MVP, einem Minimal Variable Product, dass man nicht over-engineeren soll. Wie haben wir den Podcast gestartet? Was war unsere Herangehensweise?",
      "start": 921405,
      "end": 968674,
      "confidence": 0.7175460992907801,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, wir haben mit der ganz klassischen Andi Herangehensweise gestartet. Wir machen mal ein Dokument und schreiben einfach rein, was wir so Ideen haben. Oder ich habe damit begonnen und Andi hat es dann strukturiert mit der Andi-Struktur, die meistens wissentlich sophisticated, ich darf keine englischen Wörter verwenden, die sehr aufwendig strukturiert ist im positiven Sinne.",
      "start": 968714,
      "end": 991111,
      "confidence": 0.7811607142857142,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich möchte nur noch mal kurz erwähnen, ein Bachelor ist für Studienabbrecher, hat sein Professor gesagt und der Wolfgang hat einen höheren akademischen Titel als ich und ist nicht in der Lage, ein Dokument zu strukturieren.",
      "start": 991596,
      "end": 1002185,
      "confidence": 0.8158333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber in der Struktur hast du einen Master verdient, eindeutig. Wir haben mit dem Dokument gestartet und haben einfach mal Ideen reingeschrieben, Sachen, die wir uns erwarten vom Podcast, wie wir das definieren, was wir drinnen machen wollen, was uns wichtig ist, ob es irgendwelche No-Gos gibt, wo wir irgendwie Probleme haben untereinander, so Sachen wie zum Beispiel, was ist, wenn irgendwann mal ein politisches Thema aufkommt oder so, wie handhaben wir das? Also es gibt schon einiges, was man da reinschreiben kann und das hat aber eigentlich relativ schnell funktioniert und wir sind dann innerhalb kürzester Zeit eigentlich mit einem sehr soliden Dokument aus diesem Prozess rausgegangen, würde ich sagen, oder?",
      "start": 1002225,
      "end": 1041083,
      "confidence": 0.8341071428571427,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das Dokument wurde länger als erwartet, in der Tat. Wir hatten auch gesagt, sollen wir überhaupt starten? Haben wir überhaupt genug Content? Und da haben wir einfach angefangen, mal eine Themenliste zu erstellen. Und das eigentliche Ziel war, lass uns doch erst mal zehn Themen aufschreiben. Und ich glaube, das Endresultat war, wir hatten 35 oder 36 Themen auf der Liste. Und dank des guten Hörerfeedbacks bekommen wir auch immer mehr und mehr Inspiration für neue Themen.",
      "start": 1041123,
      "end": 1063805,
      "confidence": 0.7761298701298701,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, wir sind mittlerweile auf 70 Themen oder so irgendwas. Sicher überschneiden sich da einige, aber es gibt schon extrem viel, was man in dem ganzen Bereich Engineering, Culture, Menschen, Open-Source-Technologie durchaus erwähnen kann und besprechen kann. Und das füllt, glaube ich, auch fast, oder fast alle dieser Themen füllen eigentlich eine komplette Sendung.",
      "start": 1064218,
      "end": 1084296,
      "confidence": 0.7785818181818184,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der nächste Schritt war eigentlich von mir getriggert und zwar bin ich auf Amazon gegangen und habe geguckt, welche tollen Mikrofons gibt es denn eigentlich, denn ich wollte erstmal Equipment holen. Doch dann kam leider die weisende Stimme von Wolfgang und sagte, lass uns doch einfach mal starten, ohne jetzt großes Geld auszugeben.",
      "start": 1084596,
      "end": 1102446,
      "confidence": 0.8105660377358489,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir hatten dann aber auch das Glück, dass wir, weil das auch in unserem Konzept war, dass wir Leute fragen, die schon Podcasts machen. Ist ja immer eine klassische Herangehensweise, frag die, die schon Erfahrung haben. Und einer davon ist der Shep, der ein sehr erfolgreiches Podcast hat in Deutschland und extrem viele Hörer, tausende Hörer und Hörerinnen hat. Und wir haben ihn einfach mal gefragt, ob er uns vielleicht sein Equipment leihen kann. Der wohnt bei Andi mehr oder weniger um die Ecke. Und der war dann auch so nett und hat uns das Equipment mal geliehen. Und dann haben wir einfach gesagt, okay, wir treffen uns und setzen uns einfach mal zusammen und machen ein, zwei, drei Episoden. Ich glaube, wir haben sogar geplant, wir machen mehr. Im Endeffekt waren das dann wirklich nur ein, zwei, die wir aufgenommen haben. Es braucht dann doch immer länger, als man denkt. Aber so haben wir schon gutes Equipment gehabt und haben dann auch mal ein paar Tipps bekommen von Shep, was man so beachten muss und auch von ein, zwei anderen Leuten, die Podcasts machen.",
      "start": 1102876,
      "end": 1159368,
      "confidence": 0.803394594594594,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Shep ist der Shep vom Working Draft Podcast. Sehr empfehlenswert. Regelmäßige Episoden über Webtechnologien. Schaltet mal rein. Das ganze Wissen und die ganzen Erfahrungen konnten wir nutzen. Und haben, ich glaub, ein oder zwei Folgen aufgenommen. Das erste Mal onsite. Das hat uns sehr geholfen, um mal ein Gefühl dafür zu kriegen, wie schwierig es eigentlich ist, eine Folge aufzunehmen. Wie viel Vorbereitung man benötigt. was der Raum hergeben muss von der Akustik, aber auch wie viel Amps und Ohms und Pausen man eigentlich braucht.",
      "start": 1159872,
      "end": 1193423,
      "confidence": 0.8050823529411764,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und da kommt jetzt schon mein Part. Üblicherweise schneide ich dann mit Audacity. Ist wirklich ein sehr cooles Open-Source-Programm zum Editing. Und das hat auch alle Features, die man braucht. Zum Beispiel Rauschunterdrückung oder ähnliche Dinge, wenn man da einigermaßen semi-professionell so ein Podcast schneiden will. Es ist völlig ausreichend und man kann da wirklich lean starten auf der technischen Seite.",
      "start": 1193893,
      "end": 1219017,
      "confidence": 0.8215901639344262,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Ergebnisse hört ihr seit fünf Folgen. Inzwischen haben wir auch einen regelmäßigen Aufnahmetermin, um ein bisschen Strom und ein bisschen Druck aufs Gaspedal für dieses Projekt zu bekommen. Und warum machen wir jetzt eigentlich diese Folge? Und zwar machen wir diese Folge jetzt, weil wir als initiales Ziel gesetzt haben, lasst uns mal fünf Folgen machen, lasst uns mal fünf Episoden veröffentlichen. Und lasst uns dann mal bitte erneut die Frage stellen, ob wir eigentlich noch Spaß haben, Motivation, dieses Projekt weiterzuführen. Und das haben wir vor kurzem getan.",
      "start": 1219502,
      "end": 1251159,
      "confidence": 0.8371111111111118,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Mit dem Resultat, dass wir beide eindeutig dafür waren. Wir haben wirklich gutes Feedback bekommen, wie wir eigentlich schon öfters erwähnt haben. Also wirklich Danke auch dafür. Das motiviert wirklich, wenn man dieses Feedback bekommt. Und ich glaube, das ist das einzige Kriterium, was wirklich wichtig ist, ob man auch weitermachen will überhaupt, ob man die Motivation weiterhin hat. Und da helfen die Feedbacks extrem, diese Motivation aufrechtzuerhalten. Wir hatten über weit über 1000 Downloads von den ersten fünf Folgen. Sind natürlich da auch wirklich stolz drauf, dass wir das am Anfang schon hatten und darum haben wir uns jetzt auf weitere Folgen committed und alles weitere werden wir dann, weil wir auch immer weiterhin Lean bleiben wollen, am Weg entscheiden. Aber nachdem wir auch immer nicht nur predigen, man soll Lean starten, sondern auch von seinen Fehlern oder von seiner Erfahrung lernen, Hast du irgendwas schon mitgenommen von diesen ersten fünf Folgen und dem Podcast erstellen, Andi?",
      "start": 1251666,
      "end": 1311473,
      "confidence": 0.8501392405063295,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eine ganze Menge sogar, eine ganze Menge. Und zwar dachte ich immer, die Produktion und die Verteilung von Podcasts ist superkomplex. Da stehen irgendwie verschiedene Technologien hinter, vielleicht sogar eigene Protokolle. So wie es halt immer ist, wenn man ein Zeitprojekt startet, man hat keine Ahnung von dem, was man da eigentlich tut. Man hat keine Ahnung, wie das technisch funktioniert. Und das ist auch irgendwie das Spannende an der ganzen Geschichte. Und das Zeitprojekt wird immer langweilig, wenn man das weiß. Und der Wolfgang hat mich dann leider relativ schnell auf den Boden der Tatsachen geholt. Denn wie funktioniert Podcasting eigentlich? Wie funktioniert die Verteilung eigentlich von Podcasts? Und technisch gesehen ist es relativ einfach. Man hat ein Audio-File, in der Regel ein MP3-File, auf irgendeinem Hosting-Provider. Man baut sich ein RSS-Feed, was dann Elemente hat wie zum Beispiel eine Beschreibung, einen Link zum MP3-File, Ein Titel und das war's. Und diesen RSS-Feed stellt man ins Internet und sagt Spotify, hey, schau mal hier. Hier ist mein RSS-Feed. Und das gleiche bei Google und das gleiche bei Amazon Music und das gleiche bei Deezer. Und das war's. Also das ist eigentlich total langweilig, wie ein MP3-File, wie ein Podcast verteilt wird. Und die jeweiligen Plattformen wie Spotify fragen dieses MP3 an, immer wenn ihr auf Play drückt. Ich war so ein bisschen enttäuscht, muss ich zugeben.",
      "start": 1311953,
      "end": 1392628,
      "confidence": 0.7990572687224669,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich war auch der Meinung, dass die das wahrscheinlich cachen und wir haben das dann reverse-engineert. Ich habe sogar mit einem Spotify-Mitarbeiter gesprochen, der sich da eigentlich auch sicher war, dass es gecached wird. Aber wir haben dann wirklich herausgefunden, es wird scheinbar nicht gecached von der Spotify-Plattform. Kann man also wirklich, wenn man die Browser-App verwendet von Spotify, einfach mal nachschauen, wenn man ein Network-Tab aufmacht. Und die Plattformen sind mir am ehesten so ein bisschen ein Thorn im Auge gewesen. Wenn man so aus der Open-Source-Welt und technischen Welt kommt, wo irgendwie alles sehr gut zusammenarbeitet, dann sieht man da schon, dass das eigentlich diese ganze Podcast-Welt noch nicht sehr weit ist. Jede Podcast-Plattform probiert so die eigene Suppe zu kochen, irgendwie möglichst geschlossen zu sein. Es gibt keine API, es gibt keinen Standard. Teilweise sind die Web-Oberflächen auch extrem schlecht. Also so ein Klassiker ist immer noch Seitdem wir jetzt das Podcast machen, wenn wir uns bei Apple einloggen als Podcast-Owner und auf Trends klicken, kommt da something went wrong, ein Error und das war's. Man bekommt keine Informationen, nichts, dieser Tab, großer Tab funktioniert seitdem wir das Podcast machen einfach nicht bei Apple. Also der Fokus scheint auch nicht so auf Podcasts zu liegen. Und ganz allgemein, wenn man sich das Ökosystem-Podcast ansieht, sind wir, glaube ich, immer noch extrem am Beginning, sind wir noch ziemlich am Anfang, was Technologie angeht. Und ich glaube, wer übrigens eine gute Idee hat, irgendwo da eine eine App zu bauen oder irgendwas zu bauen, was das Ganze erleichtert. Ich glaube, da gibt es noch viele Chancen in Zukunft und Podcasts werden hoffentlich auch immer wichtiger. Aber von der Technologieseite ist es schon noch eigentlich ein sehr junges Feld und da ist noch viel, viel, viel Optimierungspotenzial.",
      "start": 1393183,
      "end": 1507345,
      "confidence": 0.8196026936026937,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du erwähntest Apps bzw. Plattformen. Dieses ganze Hosting und Verteilen eines SS-Feeds, dafür gibt es natürlich inzwischen Plattformen und wir nutzen auch eine, wir haben das alles nicht selbst geschrieben. Und diese Plattformen bieten natürlich auch eine Art Analytics. Daher wissen wir, wie viele Downloads wir haben, wie viele Leute uns über Spotify und Amazon Music hören. Und diese Analytics werden eigentlich auf Basis von Access-Logs herausgezogen. So langweilig, wie es klingt, ist es leider auch, weil ich ja gerade gesagt habe, der SS-Feed hat einfach den Link zum MP3-File. Ich war immer noch enttäuscht. Darüber bekommt man natürlich nur Basis-Informationen, wie zum Beispiel, gestern wurde Episode 5 dreimal gehört oder ähnliches. Wir haben natürlich sehr, sehr wenig bis gar keine Informationen über euch als Hörerinnen und Hörer. Bei Spotify bekommt man zum Beispiel, wie viele männliche und weibliche Hörer wir haben. Aber das war's dann auch schon. Weil das ganze Ökosystem sehr geschlossen ist und Podcast ein aufstrebendes Business ist, werden wir genau den anderen Weg gehen. Wir werden regelmäßig unsere Statistiken offenlegen über unseren Twitter-Kanal Engineering Kiosk. und werden veröffentlichen wie viel hörer wir haben welche episode gut war wie viel hörerinnen wir auf spotify haben also wie wir ziehen uns die informationen aus den jeweiligen plattformen raus, um euch mal ein bild zu geben wie groß das side project eigentlich ist oder halt auch wie klein und ab und zu, Beziehungsweise der Größe, wie viele Hörer hat man. Bekommt man zum Beispiel von Spotify, hey, Engineering Kiosk ist jetzt in den Top 50 deutschen Technologie-Podcasts vertreten. Und dann schaut man mal, ich glaub, die Top 30 von den deutschen Technologie-Podcasts, davon ist die Hälfte gefüllt mit englischen Podcasts. Das sind also nicht die Podcasts in Deutsch, sondern eher Podcasts, die aus Deutschland gehört werden. Das ist so ein bisschen enttäuschend.",
      "start": 1507707,
      "end": 1624589,
      "confidence": 0.8061188118811885,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber genau das war ja auch der Grund, warum wir eigentlich ein deutsches Podcast gestartet haben, dass wir da probieren, eine Lücke zu füllen, weil es in dem Tech-Bereich und vor allem in dem Tech-Bereich, wo wir unterwegs sind mit Engineering Culture und Open Source und so weiter, eigentlich kaum etwas zu finden ist, beziehungsweise sehr, sehr wenig. Und ich glaube, da ist sicher noch Platz für viele andere Podcasts, also falls jemand was starten will. Ihr habt jetzt gehört, wie einfach das ist. Es ist wirklich nicht schwer und ich glaube, man kann Nur ja, alle dazu ermutigen sowas zu starten, wenn jemand Lust und Laune dazu hat.",
      "start": 1625326,
      "end": 1660236,
      "confidence": 0.8239174311926603,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn ihr jetzt sagt, Hilfe, Hilfe, Hilfe, ich hab gar kein Equipment dafür. Ihr braucht fast gar kein Equipment. Der Wolfgang hat ein vorhandenes Mikrofon, so ein Ansteckmikrofon. Ich hab mir ein dynamisches Mikrofon für 67 Euro gekauft, was per USB an den Computer angeschlossen wurde. Und dann gibt es Aufnahmesoftware, da drückt ihr auf Record und legt einfach los. Die Einstiegshürde ist relativ gering. Probiert es einfach mal aus.",
      "start": 1660276,
      "end": 1686709,
      "confidence": 0.7470857142857144,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und falls ihr sonst noch Fragen habt, wenn es um die Technik geht, um unsere Statistiken, sonstige Fragen, wie wir begonnen haben, immer gerne einfach, der einfachste Weg ist auf Twitter, engkiosk ist der Username auf Twitter. Sendet uns eine Nachricht und wir versuchen die auch zu beantworten. Aber auch wenn ihr irgendwelche Ideen habt oder weitere Themenvorschläge. Wir sammeln die wirklich alle, wir ranken die, sortieren die und probieren die auch wirklich in den zukünftigen Folgen alle unterzubringen und zu behandeln. Ihr könnt uns natürlich auch ein E-Mail schicken unter stetisch at engineeringkiosk.dev.",
      "start": 1686750,
      "end": 1725719,
      "confidence": 0.8318617021276593,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das war es auch mit einer etwas anderen Art von Folge von uns für diese Woche. Ab nächster Woche sind wir wieder mit einem technischen Thema für euch da. Bis bald.",
      "start": 1725739,
      "end": 1736227,
      "confidence": 0.7360000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genießt die Zeit. Ja, das ist Bier.",
      "start": 1736267,
      "end": 1743917,
      "confidence": 0.721,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ah, nee, Wasser.",
      "start": 1743977,
      "end": 1744798,
      "confidence": 0.7073333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So wird das nie was.",
      "start": 1746621,
      "end": 1747983,
      "confidence": 0.8984,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich muss gleich noch ins Gewächshaus Brombein ausgraben.",
      "start": 1748023,
      "end": 1751148,
      "confidence": 0.852625,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.7895960334029238,
  "audio_duration": 1751.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
