{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/b421f30e-6b8e-4351-8644-7a89b1343287/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62bp8qi9c1-5ecc-491c-b30c-a73ea5a476c9",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk. Heute mit dem Thema Side Projects. Wir schauen uns an, was Side Projects mit dem Recruiting Prozess zu tun haben, warum die Learnings, die man aus einem Side Project zieht, nicht ganz offensichtlich sind, wenn man ein Projekt beginnt und warum man nicht seinen eigenen E-Mail Server betreiben sollte. Und wir springen direkt rein. Los geht's!",
      "start": 3191,
      "end": 22443,
      "confidence": 0.75871875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber Andi, bevor wir starten, erklär mal, warum Engineering-Kiosk?",
      "start": 26075,
      "end": 29880,
      "confidence": 0.7744444444444445,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Engineering-Kiosk, ein Kiosk ist im Pott, also im deutschen Ruhrgebiet, Eine Location wird auch Bude oder Trinkerle genannt, die Waren des alltäglichen Lebens zur Verfügung stellt. Tabak, Alkohol, Zeitschriften oder eine gemischte Tüte und oft trifft man sich da auch zum Schnacken. Man quatscht einfach über Thema A, B, C. Zum was? Zum Schnacken. Kennst du das Wort nicht?",
      "start": 29920,
      "end": 56400,
      "confidence": 0.8158305084745763,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich hab's mal gehört. Eine Freundin von mir, die kommt aus dem hohen Norden in Deutschland und hat studiert in Innsbruck in den Alpen. Die hat mir auch diesbezüglich mal eine Geschichte erzählt, weil die hatten in einer WG gewohnt mit einem Österreicher, Innsbrucker, Tiroler und hat dann irgendwie gemeint, ich geh grad schnell duschen und dann können wir danach schnacken. Und in Österreich gibt es ja das Wort schnacken nicht, aber es gibt das Wort schnackseln, woraufhin sich der Kollege da ausgezogen hat und auf mehr gewartet hat, wie die aus der Dusche zurückgekommen ist, was ziemlich zur Verwirrung geführt hat dann natürlich.",
      "start": 56420,
      "end": 88050,
      "confidence": 0.7852571428571432,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, dann lass uns das Wort schnacken und schnackseln nicht verwechseln, sondern lass uns schnacken und nicht schnackseln.",
      "start": 90351,
      "end": 96553,
      "confidence": 0.7384999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber dann steigen wir mal ein ins Thema Side-Projects. Wir wollen das ja ein bisschen von einer anderen Seite beleuchten. Wir haben ja beide bei Trivago gearbeitet und haben da auch ziemlich viele Interviews geführt als Hiring-Manager, also die Leute, die dann am Ende entscheiden, ob ein Kandidat oder Kandidatin den Job bekommen. Wie war das für dich, wenn du so Lebensläufe angeschaut hast, war das für dich ein wichtiger Punkt, ob da jetzt irgendwo ein Side-Project drinsteht, ob jemand irgendwie beweisen kann, dass er da auch abseits des Jobs irgendwas gemacht hat?",
      "start": 97934,
      "end": 133498,
      "confidence": 0.8207419354838708,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gute Frage.",
      "start": 133538,
      "end": 134359,
      "confidence": 0.899,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "War auch gar nicht vorbereitet, diese Frage.",
      "start": 134379,
      "end": 135700,
      "confidence": 0.6312857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich würde lügen, wenn ich sagen würde, nein, hat es nicht. Ich denke, es hat mich nicht bewusst beeinflusst, aber unterbewusst. Unterbewusst hat mich, glaub ich, positiv beeinflusst. Ich hätte aber auch die Leute ... Also, ich hab auch Leute ohne Side Projects eingeladen, aber auch mit Side Projects. Also, das war jetzt kein Kriterium, wo ich sage, deswegen ... kommt dieser Bewerber oder die Bewerberin nicht ins Interview. Ich denke, das sind andere Kriterien.",
      "start": 135995,
      "end": 165662,
      "confidence": 0.7749199999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also es hat positiv gewirkt.",
      "start": 166122,
      "end": 167723,
      "confidence": 0.526,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also es hat generell positiv gewirkt, aber es war kein Kriterium für einen Ausschluss.",
      "start": 168043,
      "end": 171565,
      "confidence": 0.7482142857142857,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Warum hat's positiv gewirkt?",
      "start": 171605,
      "end": 172885,
      "confidence": 0.86475,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich denke, ein Side-Project untermalt etwas Positives in Bezug auf intrinsischer Motivation. Man kann natürlich von außen nicht sehen, was für ein Ziel dieses Side-Project hatte. Man möchte eine Technologie lernen, man möchte irgendwie Erfahrungen im Bereich Design, Data Science, Produktmanagement sammeln. Oder man möchte ein Side-Business aufbauen. Das kann man von außen nicht sehen. Was man jedoch sehen kann, wenn man zugrunde legt, dass Side-Products in der Regel in der privaten Freizeit gemacht werden, dann hat jemand sich mit einem professionellen Feld, in dem er arbeitet, außerhalb seines Jobs auch noch beschäftigt. Und das ist doch schon ein Problem.",
      "start": 174466,
      "end": 215653,
      "confidence": 0.7732299999999996,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "War das für dich wichtig, in was für einem Bereich das stattgefunden hat? Also wenn jetzt jemand gar nichts mit Technik oder IT gemacht hat, sondern, keine Ahnung, sich irgendwo engagiert hat. Keine Ahnung, so wie ich zum Beispiel bei der Freiwilligen Feuerwehr oder so, könnte man ja auch als Side Project sehen. War das für dich dann irgendwie wichtig? Hat das was mit dem Job zu tun oder nicht? Oder wann hat das was mit dem Job zu tun?",
      "start": 215693,
      "end": 240957,
      "confidence": 0.7662125000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, das war mir jetzt nicht so wichtig. Ich denke, es ist wichtig, dass man was anderes macht als seinen Job. Ich denke, es ist wichtig, dass man sich mit anderen Themen als nur mit seinen Arbeitsthemen beschäftigt, um andere Perspektiven zu kriegen. Ich denke, dass man speziell in der Feuerwehr, wenn du das Beispiel aufgreifst und.",
      "start": 241617,
      "end": 259887,
      "confidence": 0.8296666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt bin ich gespannt, was man in der Feuerwehr lernt.",
      "start": 260644,
      "end": 263288,
      "confidence": 0.6032000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "In der Feuerwehr lernt man, glaube ich, recht gutes Krisenmanagement oder intelligentes Handeln unter Druck.",
      "start": 263328,
      "end": 269793,
      "confidence": 0.7846,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist schön, dass die Bevölkerung einmal auch dieses Bild hat und nicht nur das Bild von saufenden Leuten.",
      "start": 270714,
      "end": 275138,
      "confidence": 0.8081052631578948,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wenn du das aufs IT überträgst, ist das, glaub ich, sehr viel, besonders in der Infrastruktur. Es heißt Reliability Engineering, DevOps, Infrastruktur retten. Ich glaub, da muss man auch einen kühlen Kopf bewahren. Und ich glaub, da gibt's im Incident Management ziemlich viele Parallelen zum Beispiel. Nehmen wir mal das Beispiel von Infrastruktur, IT-Arbeit und Feuerwehr. Aber ich denke auch, dass verschiedene Industrien und verschiedene Bereiche voneinander lernen können und somit auch neue Einblicke reinkommen. Aber es ist natürlich auch so, dass, wenn man ein Side-Project im professionellen Umfeld macht, dass man natürlich dann sein professionelles Umfeld oder dass man da jedenfalls mehr lernt. Ja, also ich weiß jetzt nicht, wie viele, das kannst du mir erzählen, weil du bist ja in der Freiwilligen Feuerwehr und ich hoffe, du säufst nicht nur, wie viel Methoden du in der Feuerwehr gelernt hast, die du dann im Engineering, im Engineering Management anwenden kannst.",
      "start": 275738,
      "end": 328090,
      "confidence": 0.7285065789473685,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, also ich glaube ganz wichtiger Punkt da ist einfach, und das zielt dann auch auf die Side-Projects ab, ist es ein Side-Project, was du jetzt alleine machst oder ist es ein Side-Project, was du im Team machst. Da kriegst du natürlich ganz andere Skills oder auch Feuerwehr, weil du einfach im Team was erarbeitest und auch natürlich schneller lernen kannst, aber es kann auch ein Open-Source-Projekt sein, wo du einfach gemeinsam mit anderen an einer, an einem Projekt arbeitest, da lernst du sicher andere Skills noch dazu, wie du mit Leuten kommunizierst und wie du Konflikte löst und so weiter. Also das kommt natürlich bei einem Side Project, wo du einfach alleine an deinem Computer sitzt und irgendeine Library zum Beispiel schreibst, hast du das natürlich weniger unter Umständen.",
      "start": 328733,
      "end": 371932,
      "confidence": 0.7829769230769229,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber macht das, macht das für dich einen Unterschied in der Bewertung, ob du diese Person, du hast jetzt nur den Lebenslauf vor dir und macht das für dich einen Unterschied in der Bewertung des, des, des, des Punktes Side Projects, ob das jetzt im Team oder alleine ist?",
      "start": 371992,
      "end": 385176,
      "confidence": 0.6470612244897959,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also weniger, ob man den jetzt einlädt oder nicht einlädt, aber es zeigt natürlich vielleicht, dass der eine gewisse Stärke hat, wenn er mit Menschen umgehen kann oder gelernt hat oder umgehen musste in irgendeiner Form, wo das auch immer ist, sei es jetzt Feuerwehr oder in einem Side-Project, also in einem Open-Source-Projekt. Aber die andere Seite, wenn jemand alleine an dem Projekt gearbeitet hat, dann ist er vielleicht Spezialist in einer Technologie oder kennt die Technologie dann besser aus diesem Bereich. Also positiv ist das natürlich auf alle Fälle. Garantieren kann man natürlich sowieso nie dann, dass die Person wirklich, wirklich gut ist. Aber dafür gibt es ja dann das Interview später. Aber grundsätzlich, wenn ein Side-Project im Lebenslauf steht, hat das für mich natürlich schon einen gewissen Bonuspunkt gehabt, aber natürlich, wenn jetzt jemand kein Side-Project drin hat, heißt das nicht automatisch, dass er nicht intrinsisch, ein schweres Wort, egal in welcher Sprache, österreichisch oder deutsch, ob der motiviert ist oder die motiviert ist. Also ich glaube, das kann man nicht automatisch daraus schließen, aber es ist natürlich ein gewisser Pluspunkt. Und ich glaube, es ist auch wichtig, dass man im Lebenslauf solche Dinge reinschreibt, dass man eben auch andere Dinge, die man macht, vielleicht auch abseits des Jobs, dass die durchaus drinnen stehen, weil die halt das Gesamtbild einfach besser zeigen, was ist man für eine Person, wo interessiert man sich, was für Stärken hat man. Vielleicht kommt es dann schon stärker im Lebenslauf raus. Und das ist für mich als Hiringmanager natürlich eigentlich dann auch sehr wichtig, das darin zu lesen. Aber das kann natürlich genauso Familie sein. Wenn der ein Kind hat, sagt mir das ja auch in gewisser Weise was.",
      "start": 385216,
      "end": 479957,
      "confidence": 0.8026258741258744,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt habe ich natürlich mehrere Fragen. Die erste Frage ist, jetzt hast du jemanden, der hat ein Side Project und du machst eine mentale Notiz, weil du sagst, das beeinflusst dich jetzt nicht bewusst, ob du die Person einlädst oder nicht, weil du lädst auch Leute ein ohne Side Project. Es zeigt dir aber eine intrinsische Motivation. Okay, jetzt hast du die Artisite Projects, das ist bei der Feuerwehr mit Team und Kommunikation oder Open Source oder ein Projekt, was er alleine macht oder sie alleine macht. Und was machst du mit dieser Notiz? Was hat diese Information jetzt für einen Wert für den folgenden Interviewprozess für dich?",
      "start": 480298,
      "end": 508903,
      "confidence": 0.7076666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also grundsätzlich macht der Lebenslauf Sivi natürlich eher weniger aus. Also die Entscheidung muss dann im Interview getroffen werden. Aber du kannst die Information natürlich nutzen. Du kannst die Person darauf ansprechen. Du kannst gewisse Fragen stellen in dem Bereich. Du kannst mal über irgendein Thema sprechen, wo die Person sich sehr gut auskennt, wo du glaubst auch, dass sie sehr motiviert ist. Und da kannst du auch sehen, ist die Person wirklich motiviert. Siehst du dann irgendwie so ein Glänzen in den Augen, wenn sie über das Side Project zum Beispiel spricht. weil das glaube ich ganz wichtig ist, auch wenn jemand frustriert ist im Job zum Beispiel, dann musst du auch was finden, wo die Person wirklich motiviert ist, um mal zu sehen, ist die Person überhaupt motiviert, kann sich die für irgendwas begeistern, zumindest wenn dir das wichtig ist, aber für mich war das immer extrem wichtig im Hiring-Prozess das festzustellen, ist die Person irgendwo motiviert und da eignen sich natürlich Side-Projects extrem gut darüber zu sprechen, aber es kann natürlich auch die Familie sein. Wenn jemand extrem motiviert ist und über gewisse Dinge in der Familie spricht, wenn es das wäre zum Beispiel, dann ist es ja auch völlig in Ordnung. Aber ich habe die Information natürlich schon genutzt, um dann vielleicht mal eine Frage zu stellen oder genauer nachzufragen. Gerade wenn es dann Oben-Sauce-Projekte sind, die man vielleicht auch kennt, die man selber nutzt im Idealfall in der Firma, dann ist es natürlich eine Win-Win-Situation für alle Beteiligten und dann kann man da wirklich tiefer gehen. Und sowas ist natürlich dann schon wichtig, aber es ist jetzt weder ein Knockout-Kriterium noch irgendwie ein extrem wichtiger Punkt, aber es ist halt ein Datenpunkt unter ganz, ganz vielen Datenpunkten, die du sammelst in dem Lebenslauf-CV oder in dem ganzen Prozess.",
      "start": 509243,
      "end": 602670,
      "confidence": 0.8132211221122111,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt haben wir natürlich den Bereich des Interviews. Der Interview ist unter anderem dafür da, um die Hard-Skills, aber auch Soft-Skills eines Werbers oder einer Bewerberin zu testen. Und da sind wir natürlich bei den Funk-Companies, die sehr viel mit Cracking the Coding-Interview, Algorithmen-Questions etc. etc. ankommen. Und jetzt kommst du an und fragst nach, erzähl doch mal von deinem Side-Projekt. Wie hilft dir das bei der Evaluation, ob dieser Kandidat oder diese Kandidatin geeignet ist oder so? Weil ich meine, im Endeffekt versuchst du ja immer noch für eine Engineering-Position zu heiern. Also jemand, der Software entwickeln kann. Und jetzt fragst du jemanden über seine Mitarbeit im Side-Projekt bei der Feuerwehr. Was sagt dir das? Wie hilft dir das weiter?",
      "start": 602950,
      "end": 641090,
      "confidence": 0.7698595041322314,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also nachdem ich, wie Hiring-Manager war, meistens eher die Soft-Skills abgefragt habe, weil ja andere Leute dann die Hard-Skills abgefragt haben.",
      "start": 641130,
      "end": 648957,
      "confidence": 0.796,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du sagst also, du hast keine Ahnung.",
      "start": 648977,
      "end": 650338,
      "confidence": 0.4187142857142857,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "War das eine feine Position, weil ihr habt dann schön die Soft-Skills abfragen können und da eignen sich natürlich Side-Projects auch über die Sachen zu sprechen. Aber ich glaube auch, du kannst natürlich Hardskills genauso abtesten, weil wenn der sich in einem Open-Source-Projekt aktiv beteiligt, dann kannst du da eher wirklich in die Tiefe gehen oder dir Sachen erklären lassen, die Architektur, wie Sachen gelöst worden sind. Also da kann man schon natürlich auch in die Tiefe gehen, ganz klar.",
      "start": 650358,
      "end": 675944,
      "confidence": 0.7890875000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich sehe, das ist eine Grundsatzfrage, wie du Interviews führst. Mein persönlicher Interview-Style ist, ich heiere vor Attitude und nicht vor Skill, weil ich denke, hast du eine gute Attitüde, hast du einen guten Grundfundus an Skills, um etwas schnell zu lernen, hast du eine schnelle Auffassungsgabe, bist du intrinsisch motiviert, dann kannst du jeden Skill in einer akzeptablen Zeit lernen. Und speziell in dem heutigen IT-Umfeld ist es, glaube ich, sehr schnelllebig, weil es kommen jede Woche fünf JavaScript-Frameworks raus, DevOp-Tools, und Kubernetes, das möchte ich gar nicht von reden, Data-Science-Algorithmen, etc. Somit ist Learning on the Job eh required. Deswegen denke ich, so mache ich es zumindest, und ich frage die Leute immer, Kannst du mir mal was über dein Side-Project erzählen? Oder ich stelle eine gezielte Frage zum Side-Project, weil das ist auch so eine Art, wo du der Kandidatin dann wirklich hilfst, sich zu beweisen. Weil dein Ziel ist es ja eigentlich auch, nicht Zeit zu verschwinden, um das Interview durchzuführen und die Kandidatin durchfallen zu lassen. Dein Ziel ist ja herauszufinden, ist diese Person, die ich da gerade interviewe, fit fürs Team? Guild-technisch, Team-fit-technisch etc. Das bedeutet, du hast natürlich auch eine Motivation, dieser Person zu helfen. ... sich bestmöglich darzustellen, ... ... aber auch wohlzufühlen ... ... und einen safe Space zu schaffen.",
      "start": 675984,
      "end": 754017,
      "confidence": 0.7596301369863011,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann Side-Projects auch was Negatives bedeuten ... ... für dich als Hiringmanager?",
      "start": 754057,
      "end": 758039,
      "confidence": 0.698,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das kommt auf den Stage der Side-Project an. Nehmen wir mal an, ... ... jemand hat ein Side-Project ... ... und das ist wirklich ein erfolgreiches ... ... Side-Business geworden, ... ... dann ist dieses erfolgreiche Side-Business ... ... natürlich schon ... ... ein enormer Zeitfresser ... ... für den Kandidaten. Das bedeutet, ... ... wenn ich diese Person dann, ... ... ich nenne es mal klassisch, ... ... 40 Stunden die Woche einstelle, ... Und dann frage ich mich natürlich schon, wie viele Stunden pro Woche spendet die Person denn schon auch auf ihr Side Project? Das könnte natürlich dann im Endeffekt natürlich schon die Arbeitsleistung dieser jeweiligen Person beeinflussen.",
      "start": 758079,
      "end": 787734,
      "confidence": 0.6906486486486487,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also als Hiringmanager ist mir jetzt gerade noch eingefallen, was vielleicht auch negativ wäre, weil ich das auch von mir selber kenne, dass ich zu viele Projekte gleichzeitig habe. Und wenn ich dann natürlich jetzt in meinem CV hunderte Projekte aufliste, könnte das ein Zeichen sein, dass jemand sehr gerne Ja sagt und sehr viele Projekte anfängt. Das muss nicht unbedingt negativ sein, aber ich kenne es halt von mir selber. Gerade wenn es um die Zeit geht, das könnte vielleicht ein Punkt sein, was ich mal nachfragen würde. Fängt jemand einfach nur Projekte ständig an und führt die aber nie zu Ende?",
      "start": 787774,
      "end": 820123,
      "confidence": 0.8134854368932042,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hast einen super guten Punkt genannt. Nachfragen. Weil wenn du das nicht tust, interpretierst du natürlich in etwas geschriebenes sehr viel rein. Weil das kann ja auch etliche Gründe haben. Der kann ja auch zehn Projekte gestartet haben und neun davon erfolgreich verkauft. Also es ist wichtig, dass du deine Assumption dann natürlich korrigierst, weil sonst interpretierst du irgendwas rein, nimmst was an und später ist es ja ganz anders. Ich sehe das relativ vergleichbar mit jemand hat innerhalb von drei Jahren viermal den Job gewechselt. Das kann Gründe haben, kann professionelle Gründe haben, das kann familiäre Gründe haben, das kann sein, dass das einfach drei Startups waren und einfach insolvent gegangen sind. Deswegen, ich finde ganz, ganz wichtig, wenn man Zeitprojekte hat in einem CV, dass man da möglichst keine Assumption hat und sehr viel nachfragt.",
      "start": 820623,
      "end": 868563,
      "confidence": 0.8115507246376809,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, das ist ein ganz allgemeiner wichtiger Punkt, dass man nachfragt als Interviewer, also dass man genau die Fragen, die man hat, halt einfach abklärt. Man sieht die Punkte und checkt die dann ab. Aber ich glaube, darüber können wir in einer Recruiting-Folge nochmal extra sprechen. Aber die Frage habe ich persönlich, eine negative Erfahrung gehabt. Gerade weil du erwähnt hast, diese Zeitfresser. Ich glaube, das ist ein guter Punkt. Ich habe zum Beispiel einen, ich würde es mal Side-Project nennen, aber ich habe früher meinen eigenen Mail-Server betrieben. Da kann man extrem viel lernen, weil man glaubt gar nicht, wie komplex Mail ist, obwohl es so eine alte Technologie ist oder vielleicht gerade deswegen. Aber das kann natürlich auch ein extremer Zeitfresser sein, weil wenn du auf irgendwelchen Blacklists landest mit deinem Mail-Server und das ist dein Haupt-Mail-Server, wo deine Mails drüber gehen und vielleicht auch noch Mails von Freunden oder vielleicht unter Umständen sogar noch von, ich war früher Freelancer und dann ist vielleicht irgendein Projekt von einem Kunden noch, das über diesen Mail-Server läuft. Und der Mail-Server schmiert ab oder er hat ein Problem, landet auf einer Blacklist, dann musst du dieses Problem lösen. Dann kannst du nicht sagen, okay, das ist ein Side-Project, ich gebe jetzt gerade wenig Zeit, ich warte eine Woche. Also das kann dann schon extrem viel Zeit fressen und da muss man, glaube ich, auch ziemlich aufpassen, dass so Side-Projects dann nicht zur Belastung werden von einem.",
      "start": 869180,
      "end": 948084,
      "confidence": 0.7507967479674799,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Würdest du das schon als, das noch als Side-Project beschreiben? Weil im Endeffekt ist es ja für dich dann schon kritische Infrastruktur geworden.",
      "start": 948104,
      "end": 956087,
      "confidence": 0.797782608695652,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist ganz allgemein mit so Projekten ja sehr oft, du startest was irgendwo ganz klein und denkst, ja ist ganz praktisch, probieren wir mal aus und dann wird es immer größer und plötzlich ist es irgendeine kritische Infrastruktur geworden. Also auf das muss man halt aufpassen und ich glaube viele Leute vergessen halt die Maintenance, die wirklich nötig ist, egal was es ist. Es kann ja auch ein Open Source Projekt sein. Das du pflegen musst, weil wenn großes wichtiges Open-Source-Projekt und du kannst es oder hast die Zeit nicht mehr das zu maintainern und Issues zu bearbeiten oder die Kommunikation alleine, was die Zeit frisst.",
      "start": 956335,
      "end": 988628,
      "confidence": 0.7592242990654203,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kommen wir nochmal zurück auf dein Mail-Server. Würdest du sagen, du bist irgendwo falsch abgebogen und hast es total verfuckt? Du hast es vergessen oder du hast es nicht hinbekommen, den kritischen Punkt zu erkennen, weil du sagst ja später, du bist dann sehr wahrscheinlich auf Blacklisten gelandet, wichtige E-Mails kommen nicht mehr an. Da denkst du, du hast es einfach erfolgreich gegen die Wand gefahren, weil erfolgreich war es ja, du hast ihn ja betrieben, aber im Endeffekt hat er so viel Zeit gefressen, dass du eigentlich nichts anderes machen konntest und du musstest dich ja darum kümmern, weil es waren ja deine E-Mails. Ich meine, was ist man heutzutage ohne E-Mail?",
      "start": 988648,
      "end": 1021437,
      "confidence": 0.6937345132743361,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe das dann auch probiert, relativ schnell loszuwerden, wie ich gemerkt habe, wie viel Zeit es wirklich fressen kann und die Zeit mir dann zu wichtig war oder ich halt weniger Zeit gehabt habe und habe dann probiert, es wirklich möglichst schnell abzugeben. Aber das ist ja auch gar nicht so leicht, dass man sein Projekt quasi abgibt oder einen professionellen Service dann nimmt, weil das professionelle Service hat dann irgendein cooles, super Feature, was du gebaut hast in deinem Mail-Server, hat es dann nicht. Da ist man dann auch sehr schnell sehr kritisch. Aber das war dann extrem wichtig für mich, das wirklich loszuwerden am Ende. Ganz klar. Also ich glaube, das ist schon auch wichtig, dass man Projekte in einem sinnvollen Rahmen abarbeitet. Sei es dann eben einen anderen Mailserver nimmt oder dass man einen anderen Maintainer sucht oder das auch richtig kommuniziert. Ich habe keine Zeit mehr für dieses Projekt, für dieses Open Source Projekt. Ich glaube, das ist schon extrem wichtig. Und das wäre für mich zum Beispiel auch wichtig dann als Interview, wo ich nachfragen würde, okay, du hast jetzt so und so viele Projekte, wie ist der aktuelle Stand von diesen Projekten? Ich meine, manche Projekte sind, glaube ich, vollkommen okay, wenn die einfach auslaufen, weil man mal was ausprobiert hat oder irgendeine Technologie ausprobiert hat. Das ist vollkommen in Ordnung. Aber wenn natürlich dann hunderte Leichen irgendwo auf Github rumliegen, die so halb maintained sind, finde ich einerseits schade und finde ich auch nicht sehr professionell.",
      "start": 1021697,
      "end": 1098760,
      "confidence": 0.7680905511811027,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hattest du psychologischen Druck bei deinem E-Mail-Server, als du gesagt hast, oh der schmiert mich die ganze Zeit ab, alles läuft im Spam, ich muss das jetzt fixen. Also hat das auch negativ? Irgendwie auf dein Leben ausgewirkt?",
      "start": 1098800,
      "end": 1110484,
      "confidence": 0.606657894736842,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du überlegst dir das halt jedes Mal, wenn irgendwas passiert und du wieder irgendwo drei, vier Stunden oder noch mehr reinstecken musst, damit das Ding wieder läuft, dann wird das halt dann irgendwann zu viel. Aber klar, die vier Stunden, die man dann investiert, das ärgert einen natürlich schon, dass das dann wieder so viel Zeit ist. Vor allem ist es ja meistens keine, Zeit, die man sich irgendwann mal nimmt oder die man geplant hat, sondern die kommt halt plötzlich. Plötzlich stürzt dieser Mail-Server ab oder es hat irgendein Problem. Dann musst du zu diesem Zeitpunkt die vier Stunden investieren und kannst nicht sagen, okay, nimm mir jetzt mal die vier Stunden, weil ich an meinem Projekt weiterarbeiten will. Also ich glaube, das ist dann der große Unterschied zwischen Side-Projects und vielleicht an der kritischen Infrastruktur, ja.",
      "start": 1110504,
      "end": 1149226,
      "confidence": 0.786898550724638,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Würdest du sagen, retrospektiv betrachtet, War das eine gute Entscheidung, deinen E-Mail-Server als Zeitspurprojekt zu betreiben, auch wenn das initiale Ziel gefailt ist und du ihn jetzt glaube ich nicht mehr betreibst? Du aber dennoch unglaublich viel gelernt hast über dich, Selbstreflektion, wann stoppt man vielleicht ein Zeitprojekt, die Route wollen wir jetzt nicht gehen, aber denkst du, retrospektiv betrachtet, war das ein tolles Investment für dich und dein Wachstum?",
      "start": 1149246,
      "end": 1178760,
      "confidence": 0.8004428571428571,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also abgesehen von der Technologie, wo ich auch bei der Technologie viel gelernt habe, weil ich habe dann da auch High Availability eingebaut und zwei Server in unterschiedlichen Datacentern, also wir brauchen da gar nicht in den Rabbit Hole reingehen, Aber auch, wie du richtig sagst, einfach das zu lernen, was es da für Probleme gibt, dass Maintenance ein großer Punkt ist. Das vergessen natürlich viele Developer, auch wenn es ums professionelle Planen geht, dass Maintenance ein großer Punkt ist. Und es reicht nicht einfach nur irgendwas fertig zu programmieren und dann hinzuwerfen, sondern da kommen ganz, ganz viele Aufgaben später noch einmal auf einen zurück, die man einfach mit einrechnen muss und einplanen muss. Aber das ist sicher eine wertvolle Erfahrung, die man auf jeden Fall in irgendeiner Form mal mitnehmen muss. Ob man das jetzt so in einer kritischen Infrastruktur vielleicht mitnehmen muss, ist die andere Frage. Aber hat mir persönlich natürlich viel gebracht und auch den Umgang mit, wenn es kritische Infrastruktur ist, wie man mit der umgeht, wie man reagiert, wie schnell man reagieren muss und dass man das halt mal einfach lernt und persönlich wirklich erfährt.",
      "start": 1178800,
      "end": 1238723,
      "confidence": 0.784712041884818,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Konntest du dieses Wissen wirklich in deiner Zeit danach im professionellen Umfeld in einem Job anwenden oder konntest du auf dieses Wissen zurückgreifen, was dann unter anderem deinen Leadership-Style oder deine Entscheidungen in Projekten beeinflusst hat?",
      "start": 1239123,
      "end": 1256603,
      "confidence": 0.8271111111111112,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich glaube, das, was mir am meisten gebracht hat, ist, dass ich sehr viele Leute getroffen habe in meinem professionellen Umfeld, die mal schnell einen Mail-Server selber bauen wollten oder gemeint haben, ja, dann setzen wir halt schnell da diesen SMTP auf, das funktioniert dann schon. Warum sollen wir irgendwie Mailgun kaufen und bezahlen, wir können doch da schnell selber ein SMTB aufsetzen. Und dann bin ich halt immer mit meiner Geschichte gekommen und meinem Background, hab halt wirklich gesagt, okay, was machst du, wenn du auf diesen Blacklist stehst und die musst du monitoren und das kommt noch dazu und das kommt noch dazu und das kommt noch dazu. Und dann merkt man schon, dass die Leute das dann vielleicht auch schneller verstehen, wenn man dieses Wissen wirklich hat über Mail Service. Es hat schon definitiv auch im professionellen Umfeld was gebracht.",
      "start": 1257569,
      "end": 1301625,
      "confidence": 0.7760624999999997,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also im Endeffekt hast du eigentlich durch deine Erfahrungen, vielleicht durch deine schrecklich gemachten Erfahrungen zu diesem Zeitpunkt, einen höheren finanziellen, ich nenne es mal, Schaden für die Firma vorgebeugt. Weil Maintainance, die man nicht hätte tun sollen, ist im Endeffekt Arbeitszeit, die man opportunitätskostenfleisch ins Produkt stecken kann.",
      "start": 1301886,
      "end": 1321151,
      "confidence": 0.804265306122449,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du sprichst ganz allgemein von Erfahrung. Ich glaube, Erfahrung macht viel aus. Und man braucht ja auch die negative Erfahrung, damit man das dann vermeiden kann. Und es muss halt jeder mal gegen die Wand rennen, um zu verstehen, was es bedeutet. Und das nenne ich Erfahrung. Also ganz allgemein. Ob jetzt jeder einen Mail-Server selber aufsetzen muss, damit er einmal die Erfahrung bekommt, wage ich zu bezweifeln. Aber grundsätzlich, wenn man das vielleicht wieder abstrahiert, Das könnte natürlich schon auch eine große Hilfe sein, da hast du vollkommen recht, wenn du ein Side-Project hast, weil du das einfach komplett ownst. Wenn du nur in einem Job arbeitest für eine Firma, dann je nachdem wie groß die Firma natürlich ist, aber selten bist du alleine verantwortlich für etwas. Wenn du aber in einem Side-Project bist, dann bist du vielleicht alleine oder vielleicht zu zweit voll verantwortlich und muss mit der ganzen Verantwortung auch umgehen lernen. Und das könnte natürlich schon ein wichtiger Punkt sein, den du in einem professionellen Umfeld vielleicht weniger hast, weil da gibt es einen Project Manager, da gibt es einen Product Owner, einen Chef, was auch immer und du diskutierst über Sachen und du hast selten die alleinige Schuld sozusagen oder die Ownership, wenn man es positiv formuliert.",
      "start": 1322472,
      "end": 1395065,
      "confidence": 0.7893537735849059,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist ein Chef?",
      "start": 1395105,
      "end": 1395805,
      "confidence": 0.64825,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ein Schäf ist? Ein Boss? Ein Schäf?",
      "start": 1397046,
      "end": 1401771,
      "confidence": 0.756625,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ein Schäf! Nicht Schäf! Schäf!",
      "start": 1401811,
      "end": 1407257,
      "confidence": 0.663,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, in Österreich nennt man das Schäf.",
      "start": 1407297,
      "end": 1409079,
      "confidence": 0.5072857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, du hast aber gerade von einer Herausforderung gesprochen. Das ist ja super interessant. Und du hattest auch vorhin die Familie erwähnt. Und da komme ich mal zu dem Thema Rollenmanagen. Das habe ich bei mir jetzt relativ gemerkt. Am Anfang, ich meine, du in deinem Zeitprojekt, du warst anscheinend sehr privilegiert, dass du die Zeit, um den Mailserver zu fixen, aufbringen konntest. Drei, vier, fünf Stunden. Du bist das Rabbit Hole runtergegangen. Und ich kann mir aber gut vorstellen, dass Leute, die Familie haben, ein Kind, zwei Kinder, vielleicht sogar noch ein kleines Haus, was nicht standgehalten werden muss.",
      "start": 1409159,
      "end": 1441638,
      "confidence": 0.72665,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder ein großes Haus.",
      "start": 1442619,
      "end": 1443820,
      "confidence": 0.39325000000000004,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder ein großes Haus. Die haben nicht mehr die Zeit oder man muss ja nicht nur Zeit managen, man muss ja auch Energie managen. Die haben vielleicht gar nicht mehr die Energie sich abends um 10, um 9, wenn die Kinder im Bett sind, sich vor den Computer zu setzen oder noch ein Fachbuch zu lesen oder oder oder. Vielleicht will man einfach nur eine Flasche Wein aufmachen und einfach den Abend genießen bei einer schönen Netflix-Serie wie Squid Game oder ähnliches. Ich habe jetzt selbst die Erfahrung gemacht, ich habe jetzt seit 8 Monaten einen Hund. Ein Welpen. Der frisst ungefähr so viel Zeit wie ein Baby. Obwohl ich noch kein Baby hatte. Aber so stelle ich mir das vor. Meine Zeit, meine private Zeit, die ich auf Side-Projects... verwende, ist, ich will nicht sagen gegen Null gegangen, aber ich will sagen gegen Null gegangen. Wie siehst du das mit dem Akt des Rollenmanagens? Ist das etwas, was du von deinen Mitarbeitern erwartest, dass sie sich nebenbei weiterbilden, weil jede private Situation ist anders?",
      "start": 1443880,
      "end": 1503454,
      "confidence": 0.7903485714285713,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Man könnte natürlich jetzt argumentieren, Leadership ist so ähnlich wie ein Welpen aufziehen, aber den Link möchte ich jetzt gar nicht mehr machen. Auf jeden Fall, ich würde mir das auf keinen Fall erwarten, dass das jemand wirklich machen muss oder dass das die einzige Möglichkeit ist. Ich würde sogar positiv sehen, es kann jemand extrem gutes Time-Management haben und sich auch anders weiterbilden. Und meistens diese Leute, gerade um das jetzt wieder die Familie aufzubringen, ich kenne einige, die haben Familie und da hört der Job einfach um 4 Uhr auf und dann kommt die Familie oder sogar noch öfter, je nachdem. Aber die bilden sich trotzdem fort, aber die haben halt extrem gutes Zeitmanagement und bringen das dann in einem gewissen Fenster, das sie halt sich freischaufeln in irgendeiner Form unter. Und ich glaube Priorisierung ist dann halt nochmal wichtiger einfach, wenn du nicht einfach wahllos machen kannst, was du willst. Und das ist, glaube ich, auch extrem wichtig, dass das Gerade junge Personen verstehen und ich glaube, wie wir bei Trivago gemeinsam gearbeitet haben, das war ja auch ein sehr junges Team. Und da sind ja Familienväter auch nicht früher, gerade am Anfang, so gut ausgestiegen. Mittlerweile hat sich die Firma entwickelt und ist älter geworden. Da geht es besser. Aber ich glaube, das ist ein großes Konfliktpotenzial zwischen jungen Leuten, die einfach gar nicht sehen, warum Leute abschalten wollen am Abend, warum die nicht sich zum Sci-Project hinsetzen.",
      "start": 1505525,
      "end": 1596444,
      "confidence": 0.8101776859504132,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber du hattest, du hattest initial was, was interessantes gesagt und zwar, dass Side Projects prinzipiell oder fundamental optional sind und die zwar den, den Fragestyle und welche Fragen du stellst im Folgeinterview gegebenenfalls beeinflussen, aber bei weitem kein Kriterium sind für, wird die Person eingeladen oder nicht. Weil speziell wenn man älter wird, wenn man, wenn man ein Kind hat, Haus und ähnliches, Und wenn man vielleicht einfach mal mehr seine freunde sehen möchte etc dann hat man einfach weniger energie weniger brainpower über am abend um sich weiterzubilden. Und dass die erfahrung die im lebenslauf steht das was du vorher gemacht hast oder vielleicht bist du ein quereinsteiger aus der feuerwehr fürs incident management wie zum beispiel. dass eigentlich die ausschlaggebenden Punkte sind für eine Einladung zu einem Folgeinterview. Und ich glaube, das ist ganz wichtig, dass man nicht voraussetzt, dass man Side Projects machen muss. Ich denke jedoch, und das bestätigst du mir hier gerade, dass wenn man ein Side Project startet mit dem Ziel, eine neue Technologie zu lernen, Man später glaube ich feststellt, dass die Technologie gar nicht das Hauptlearning ist, sondern vielleicht, oh, das war ja komplexer als gedacht oder oh, will ich diese kritische Infrastruktur wirklich betreiben oder oh, es ist ja nicht nur E-Mail, es ist ja auch Blacklisten, es ist ja auch eine Domain-Reputation für Spam. Es ist ja viel mehr. Es ist ja ein Protokoll, was von verschiedenen E-Mail-Clients unterschiedlich interpretiert wird. Oder es geht ins Zeitmanagement. Oder es geht in die Selbstreflektion.",
      "start": 1597184,
      "end": 1699639,
      "confidence": 0.8282727272727267,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vor allem, ich glaube, es sind viele Punkte, die du halt klassisch nicht so direkt verbindest mit einem Entwickler. Ein Entwickler lernt, er studiert vielleicht, er lernt die Technologien und gewisse Grundlagen. Aber diese ganzen Dinge, die du jetzt erwähnt hast, Das sind eher Dinge, die man dann halt lernt, wenn man Projekte selber macht oder selber an Projekten arbeitet oder mal Ownership eben hat über ein gesamtes Projekt. Dann kommen diese ganzen Dinge, die man halt nicht klassisch auf einer Liste hat, diese Technologie oder Grundlagen, Netzwerkstack, whatever, die man halt einfach lernen muss. Aber zu einem Job und auch zu einem guten Kandidaten gehört halt mehr als nur diese Hardskills, dass man weiß, wie SMTP funktioniert oder IMAP, sondern wie gesagt zum Mail-Server gehört halt auch viel mehr dazu als nur die zwei Grundtechnologien und das Protokoll von dem Ganzen.",
      "start": 1699659,
      "end": 1750550,
      "confidence": 0.8143028169014082,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ein guter Kumpel, und zwar Jost, hat mir mal erzählt, wie er große Projekte angeht. Und das fand ich sehr interessant, weil in der heutigen Zeit hat ja niemand mehr Zeit. Jeder hat immer was zu tun. Facebook, Netflix, Twitter, Instagram. Jeder compete um deine Attention. Und er sagte, es ist gar nicht wichtig, dass du dir pro Abend drei Stunden nimmst, um das Zeitprojekt nach vorne zu treiben, sondern du hast einfach eine Idee und investier eigentlich jeden Tag fünf Minuten oder zehn Minuten. Öffne die Datei, mach eine Datenbankanbindung. Nächsten Tag öffnest du die Datei wieder, setz ein Query ab. Select Sternchen from my customer table. Nächsten Tag machst du die Vorschleife und aggregierst die Daten und packst sie ins HTML-Template. Am vierten Tag baust du das HTML-Template und bups, hast du nach einer Werkwoche ein Table-Listing. Ist jetzt kein tolles Produkt, aber jeden Tag 10 Minuten. Du wirst an guten Tagen vielleicht mal 20 investieren, vielleicht sogar 30. Da kriegst du richtig was geschafft. Aber du musst nicht das Multi-Hour-Commitment eingehen. Dennoch verbesserst du Stück für Stück dein Produkt. Und das fand ich eine super Analogie, weil im Endeffekt schreibt jeder mehr in Telegram oder in Whatsapp oder auf Facebook oder scrollt auf Instagram oder guckt in TikTok. Und da kann man 10 Minuten in das Zeitprojekt investieren. Vielleicht hinkt der Verlagerung ein bisschen wegen der sogenannten Rüstzeit, dass man sich auch erst mal wieder reindenken muss, aber um so mehr kleinere schritte man sich vornimmt umso weniger muss man sich ins große ganze rein denken. Verstehst du was ich meine? Macht das Sinn?",
      "start": 1751250,
      "end": 1849860,
      "confidence": 0.7464681647940075,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das stimmt natürlich schon man kann so viel weiterbringen aber ich glaube trotzdem, man kann nicht voraussetzen dass das jemand machen will weil also ich verstehe das voll und ganz wenn man wenn man am abend einfach kaputt ist, und vielleicht einfach nur Instagram da seinen Daumen beschäftigen will. Das ist meiner Meinung nach vollkommen okay, weil wenn ich, wie bei Trivago gearbeitet habe zum Beispiel, und den ganzen Tag nur eigentlich Meetings hatte, ich war am Abend einfach komplett tot, mehr oder weniger, und ich war froh, dass ich mal was programmieren habe können in meinen Side-Projects. Das war quasi die andere Entspannung. Du hättest mich am Abend nicht in noch ein Meeting schicken können. Da will man einfach mal was anderes machen. Und wenn man den ganzen Tag programmiert und codet, dann kann es auch sein, dass man einfach am Abend mal ganz was anderes machen will und einfach nur Instagram machen will oder vielleicht ein ganz anderes Projekt oder Familie oder was es halt auch immer ist. Und die Familie geht, glaube ich, meiner Meinung nach sowieso vor. Aber man kann das nicht erwarten, man kann das positiv sehen, wenn jemand ein Problem hat mit dem Zeitmanagement, dass man sagt, okay, 10 Minuten jeden Tag kann auch schon viel bringen, aber ich kann nicht sagen, okay, du musst unbedingt ein Zeitprojekt machen, investier doch nur 10 Minuten, dann hast du ein Zeitprojekt. das nicht machen will und keinen Sinn darin sieht, finde ich das vollkommen okay.",
      "start": 1849900,
      "end": 1930669,
      "confidence": 0.7824578313253011,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hast einen super Punkt angesprochen, so nach dem Motto, wenn ich acht Stunden in Meetings war, möchte ich außerhalb meines Arbeitstages keine Meetings mehr machen, selbst als Programmierer. Und da kann ich dir eine persönliche Story erzählen. Ich habe eine klassische Ausbildung in Deutschland gemacht als Fachinformatiker, Fachrichtung Anwendungsentwicklung. Das ist der gute deutsche Term für Softwareentwickler. Ich bin in diese Ausbildung gegangen, weil ich in meinem Abitur ziemlich viel Computer gespielt habe und auch meine Webseite programmiert habe. Und das hat super viel Spaß gemacht. Du kennst das ja. Man wählt den Job da, wo man Spaß hat. Und dann habe ich in meinem Job am Anfang sehr, sehr viel programmiert. Habe Aufgaben gekriegt, so was man halt so als Juniorentwickler so macht. Und hab halt programmiert, programmiert, programmiert. Das war eigentlich so 8 Stunden Coden. Und am Ende des Tages kam ich nach Hause und hatte keine Lust mehr zu Coden. Das hatte aber dann zur Folge, weil Coden war ja mein Hobby, dass ich kein Hobby mehr hatte. Und das war schon ein komisches Gefühl, weil man fällt auf einmal in so ein Loch. Auf einmal ist einem wieder langweilig zu Hause. Ich weiß nicht, ob du das kennst, als du als Kind warst, vielleicht war es dann irgendwann langweilig, weil die Eltern noch Kaffee trinken wollten oder so. Und du hattest Hummel im Pöbel und wolltest irgendwas machen.",
      "start": 1930689,
      "end": 2001984,
      "confidence": 0.7454549356223173,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt übrigens Kaffee in Österreich, nicht Kaffee. Das ist ganz wichtig.",
      "start": 2002025,
      "end": 2009791,
      "confidence": 0.4931666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber Hummel in dem Arsch. Und da hattest du dann kein Hobby mehr. Und man fällt dann in so ein kleines Loch. Also ich verstehe das komplett. Und deswegen finde ich es wichtig, auch wirklich zu sagen, okay, du musst kein Side-Product haben, weil man muss auch sagen, Ein guter Job und ein guter Arbeitgeber stellt sicher, dass du kontinuierlich on the Job natürlich auch lernst. Und dass du die notwendigen Skills hast, weil die IT entwickelt sich immer weiter und man kann es nicht voraussetzen, man soll es auch nicht voraussetzen, weil das eine ist Arbeit und das andere ist Freizeit. Aber leider ist das nicht bei jedem Arbeitgeber so, dass da Zeit eingeräumt wird ohne Technologie zu lernen oder ähnliches.",
      "start": 2009851,
      "end": 2051277,
      "confidence": 0.748262295081967,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hat mir übrigens, wie ich da am Abend immer gecodet habe und sonst nur Meetings gemacht habe, das war natürlich auch wirklich gut für meine Weiterentwicklung, weil ich einfach mit Technologien mich weiterentwickelt habe und über diese Technologien habe ich dann natürlich auch wieder diskutieren können mit den Entwicklern, Developers. Ich habe auch von denen natürlich gelernt, habe dann in meinen Side-Projects wieder diese Technologie angewandt. Zum Beispiel von einem alten Site-Project, das sehr viele User hat und aktiv läuft. Das habe ich dann mal damals auf Docker umgebaut, dockerisiert und das war mein erstes Projekt, wo ich wirklich Docker produktiv dann auch eingesetzt habe.",
      "start": 2052340,
      "end": 2088937,
      "confidence": 0.7615377358490565,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du bist also den Microservice- und Container-Hype runtergegangen, oder?",
      "start": 2088956,
      "end": 2091739,
      "confidence": 0.6437777777777778,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau. Es waren keine Microservices, aber grundsätzlich, weil das alles in Docker ist und damit das einfach einfacher läuft. Und wie das in einem Docker Swarm und so weiter läuft, da macht man sich dann viele Gedanken, probiert das mal aus und da kann man dann natürlich auch auf einem anderen Level mit den Developern dann wieder diskutieren und sprechen. Das war schon sehr hilfreich für mich, auch wenn es natürlich dann Freizeit war im Prinzip. Aber ich habe es gern gemacht, für mich war das ja dann das Hobby, die Entspannung. Aber auf der gleichen Seite hat es mich für den Job natürlich auch viel gebracht, weil ich dadurch einfach viel Hands-on Wissen hatte, wo ich dann wirklich über Details auch diskutieren konnte mal.",
      "start": 2091920,
      "end": 2124920,
      "confidence": 0.7563360000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Drehen wir es mal andersrum. Das klingt nach Überstunden für dich.",
      "start": 2124961,
      "end": 2131146,
      "confidence": 0.622,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, wenn du es so siehst, waren es Überstunden, ja.",
      "start": 2131186,
      "end": 2134528,
      "confidence": 0.6708000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Weil wenn ich das richtig verstanden habe, auf der Arbeit war irgendwie das Thema Docker unterwegs. Und in deinem Side-Project hast du gedacht, hey, ich könnte da ja mal alles dockerisieren. Und dann bist du wieder zurück zum Job gegangen und konntest mitreden. Das sind für mich Überstunden.",
      "start": 2134568,
      "end": 2148307,
      "confidence": 0.6955416666666664,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eigentlich ja, wenn man es so sieht. Für mich war es halt erstens ein Hobby und auch Investment meine Weiterentwicklung eigentlich. Aber wenn du es jetzt ganz hart von Arbeitgeberseite siehst, waren es eigentlich Überstunden. Ja, ganz klar. Aber wir kennen das ja alle, bei Trivago gab es ja Bier oder gibt es glaube ich immer noch, oder?",
      "start": 2148928,
      "end": 2170316,
      "confidence": 0.7347068965517242,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt immer noch Bier in den Kühlschränken.",
      "start": 2170596,
      "end": 2172197,
      "confidence": 0.62075,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es gibt noch Bier. Wenn man da am Abend ein Bier zusammen trinkt, diskutiert man ja auch nur 50 Prozent private Dinge und 50 Prozent Firma. Man macht es trotzdem eigentlich ganz gern. Kann man jetzt sehen, wie man will. Positiv, negativ, je nachdem, von welcher Seite man draufblickt. Aber ist natürlich dann auch eigentlich 50 Prozent Arbeitszeit, wenn man es ganz hart sieht.",
      "start": 2172217,
      "end": 2192169,
      "confidence": 0.7438906249999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Lass uns das Thema mal drehen, weil wir haben jetzt eine ganze Zeit lang über Side Projects im Generellen gesprochen. Wir haben über das Thema gesprochen, wie wir als Engineering-Manager, als Hiring-Manager, als Person, die über die Besetzung einer Stelle entscheidet und wie wir Side-Projects bei Kandidaten sehen. Und ich würde gerne mal die Seite wechseln und zwar bringen Side-Projects einem was für die Bewerbung, weil ich habe so das Gefühl, wir lassen uns beide von dem Listing von Side-Projects in CVs beeinflussen, zumindest was die Fragestellungen im Folgeinterview angeht. Ich kann hier aber von meiner Seite aus sagen, ich bin Fan von SideProjects und ich mache über mehrere Jahre SideProjects verschiedener Arten.",
      "start": 2192189,
      "end": 2237257,
      "confidence": 0.7996194690265482,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie viele hast du schon erfolgreich abgeschlossen?",
      "start": 2237297,
      "end": 2240479,
      "confidence": 0.5785714285714285,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist eine ganz kleine Zahl. Stellen wir die Frage anders. Werde ich besser im SideProjects früh stoppen? Ja. Tut es mir immer weh? Ja auch. Aber lerne ich immer was? Enorm. Auf jeden Fall, ist aber auch ein hohes Zeitinvestment, aber wie gesagt, ich habe jetzt einen Hund und da ist das Zeitinvestment trickier.",
      "start": 2240499,
      "end": 2259788,
      "confidence": 0.8271818181818184,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist ja auch ein Side-Project.",
      "start": 2259848,
      "end": 2260929,
      "confidence": 0.3696,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Mein Hund ist auch ein Side-Project, richtig, richtig, doch da lerne ich was nur er irgendwie nix. Aber die Frage ist, haben mir meine Side-Projects schon mal einen Job eröffnet, beziehungsweise bei einer Bewerbungsphase geholfen. Und da muss ich zugeben, die Zeit, die ich in die Side Projects investiert habe, plus, dass ich die im Lebenslauf gelistet habe, versus wie oft wurde ich nach den Side Projects gefragt oder hat es mir den Anschein gegeben, dass diese irgendwie beim Recruitingprozess berücksichtigt wurden, sage ich, das war eher eine negative Erfahrung. Also ich habe relativ wenig bis gar keine Fragen bezüglich meiner Side Projects bekommen und da waren aber alles dabei von wirklich purer technologie bis über sechs sieben jahre lang ein meetup betreiben mit jedem monat tech talks bis über eine engineering konferenz organisieren da war wirklich alles dabei von pure technik bis teamarbeit bis organisation zeitmanagement und die learnings konnte ich immer wieder anbringen aber Ich habe nie selbst Fragen gestellt bekommen diesbezüglich und das bringt mich zu der Frage, lohnt es sich im Endeffekt für eine Jobsuche?",
      "start": 2260949,
      "end": 2337746,
      "confidence": 0.8047318435754187,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich glaube, dass es sich auf jeden Fall lohnt und sogar wenn es nicht angesprochen wird, dann hast du, wie du richtig gesagt hast, einfach die ganzen Learnings daraus, was du einfach mitgenommen hast, was dich ja ausmacht am Ende als Kandidaten. Und bei dir muss man ja auch ganz fair sagen, das letzte Mal, wo du dich richtig beworben hast, war damals zu Trivago-Zeiten vor Jahrzehnten. Damals hattest du weniger Side-Projects, aber jetzt mit deinem ganzen Meetups zum Beispiel, mit den ganzen Dingen, wo du ja auch ein super Netzwerk hast, wenn du dich jetzt wahrscheinlich bei, also du könntest wahrscheinlich alleine dieses Netzwerk von den Meetups nutzen, um überhaupt in den Job reinzukommen. Da haben dir Leute Jobs angeboten, obwohl du gar nicht auf Jobsuche warst. Also wenn man das Meetup als Side-Project sieht, was es ja auch sicher ist, würde ich mal sagen, dann hast du über diese Schiene eigentlich schon extrem viele Angebote und Möglichkeiten bekommen.",
      "start": 2337766,
      "end": 2388091,
      "confidence": 0.7963726708074531,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hast ein sehr gutes Wort erwähnt, Möglichkeiten. Und da muss ich schon sagen, retrospektiv betrachtet, jedes Side-Project, was ich in irgendeiner Art und Weise gemacht habe, hat mir irgendwo eine Tür geöffnet. Ob man diese Tür dann nutzt oder nicht, sei dahingestellt. Aber es kommen immer Leute auf einen zu. Das ist dann schon interessant. Ja, das ist dann schon wirklich, wirklich interessant. Aber was ich, was ich aber auch jedem empfehlen kann, der Side-Projects macht, auch wenn man im Bewerbungsprozess nicht danach gefragt wird, diese aber im CV gelistet hat. Bringt die einfach mal mit ein. Nutzt die Side Projects als Exempel, um irgendeinen Punkt zu verdeutlichen. Weil da könnt ihr das Interview wirklich steuern. Ihr bringt einen Punkt und viele Interviewer springen dann auf etwas auf, was du genannt hast. Und das hilft dir so ein bisschen, das Interview in deine Richtung zu steuern.",
      "start": 2389071,
      "end": 2443397,
      "confidence": 0.8449659863945574,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe zum Beispiel in Interviews ganz gerne eine Frage gestellt, die mir von meinem großen Interview-Mentor Tom, glaube ich, damals auch bekommen habe. Das ist, was war das Projekt, auf das du am stolzesten bist? Stolzesten, ist das ein deutsches Wort? Ich glaube nicht. Egal.",
      "start": 2444197,
      "end": 2462148,
      "confidence": 0.7711521739130435,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf welchem Projekt bist du wirklich stolz?",
      "start": 2462208,
      "end": 2464469,
      "confidence": 0.5615714285714285,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, genau. Formulieren wir das mal so. Damals war es auf Englisch, das ist immer leichter. Und man glaubt gar nicht, wie viele Leute, also ich hab immer auch dazu gesagt, muss nicht aus dem Job sein, kann auch alles andere sein, und man glaubt gar nicht, wie viele Leute dann andere Projekte erwähnen. Einerseits, weil scheinbar der vorige Job einfach eher uninteressant war, aber vielleicht haben sie sich darum beworben. Aber es haben auch ganz viele Leute einfach irgendwelche Side-Projects, Open-Source-Projekte, Master-Projekte aus der Uni-Zeit, andere Projekte erwähnt. Also ich glaub da Das war ja für mich auch genau der Sinn von der Frage, zu sehen, wo ist jemand wirklich motiviert. Und ich glaube, man kann auch bei ganz allgemeinen Fragen, die man so in Interviews kriegt, viel öfters auf diese Side Projects gehen und kann die halt auch dementsprechend erwähnen. Und ich glaube, da sieht man halt dann auch, wie viel Erfahrung jemand hat. Und das kann man ja durchaus nutzen, wenn man in einem Interview sitzt, auf jeden Fall. Also ich finde das extrem wichtig. Man darf das nicht nur, viele Kandidaten haben dann oft Angst, dass sie nur irgendwas aus ihrem bestehenden Job sagen dürfen oder irgendwie erwähnen dürfen, dass das vielleicht irgendwie schlecht wäre, wenn sie was anderes auch gemacht haben, andere Projekte, Side Projects oder das irgendwie verknüpfen mit einer anderen Tätigkeit. Aber ich finde, das ist eigentlich noch viel mehr wert, wenn jemand wirklich globaler denkt und weniger nur stur in dem Job und nur der Job darf, ist wichtig.",
      "start": 2464589,
      "end": 2549376,
      "confidence": 0.8161712062256807,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Side-Projects helfen dir auf jeden Fall, wie du schon richtig sagst, einige Fragen sehr einfach zu beantworten, wo man in der Regel recht lange darüber nachdenken müsste. Worauf bist du wirklich stolz? Was ist dein größtes Learning? Welches Projekt hast du mal richtig verfuckt? Wo hast du am meisten gelernt? Ich glaube, da sind Zeitprojekt schon eine sehr gute Vorlage.",
      "start": 2549416,
      "end": 2568304,
      "confidence": 0.7685833333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Verfuckt kann man übrigens nicht verschnackselt sagen. Das geht nicht. Wollte ich nur nochmal anbringen.",
      "start": 2569245,
      "end": 2574467,
      "confidence": 0.4413999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Verschnackselt.",
      "start": 2574507,
      "end": 2575187,
      "confidence": 0.578,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Verschnackselt geht nicht. Verfuckt geht.",
      "start": 2575207,
      "end": 2577508,
      "confidence": 0.7816,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber ich finde, wir haben sehr, sehr schön geschnackt.",
      "start": 2578248,
      "end": 2581450,
      "confidence": 0.8354444444444445,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, geschnackt.",
      "start": 2582090,
      "end": 2583691,
      "confidence": 0.534,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe sehr viel gelernt, wie zum Beispiel, dass ich keinen eigenen E-Mail-Server betreiben möchte, obwohl ich Das glaube ich vielleicht doch mal tun sollte, um mehr über SMTP zu lernen und POP3 und Co, weil das ist so ein Feld, da weiß ich echt nicht viel.",
      "start": 2583711,
      "end": 2595475,
      "confidence": 0.8123191489361701,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, POP3 ist wirklich schon tot. Also POP3 braucht niemand mehr.",
      "start": 2595495,
      "end": 2598836,
      "confidence": 0.5470909090909092,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dann ersetze POP3 durch IMAP, glaube ich. Deswegen, das werde ich auf jeden Fall nicht tun, weil es scheint ein Rabbit Hole zu sein, wo man sehr viele Stunden Arbeitszeit verschwindet.",
      "start": 2598876,
      "end": 2609020,
      "confidence": 0.8271290322580643,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist gut investiertes Geld, wenn du da ein paar Euro in einem Profi ausgibst. Mailbox.org kann ich übrigens empfehlen. Die sind zwar nicht billig, aber machen einen wirklich guten Job und sind in Deutschland.",
      "start": 2609663,
      "end": 2619889,
      "confidence": 0.7041714285714287,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist das die Werbung oder eine persönliche Empfehlung?",
      "start": 2619929,
      "end": 2622291,
      "confidence": 0.7665000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bekomme nicht bezahlt, leider. Ich zahle denen sogar, aber ich bin sehr zufrieden mit ihnen.",
      "start": 2622331,
      "end": 2627854,
      "confidence": 0.7346249999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Welchen Top-Tipp gibst du unseren Hörern zum Ende?",
      "start": 2627894,
      "end": 2630676,
      "confidence": 0.6607500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der Tipp schlechthin ist, wenn jemand noch kein Side-Project macht, macht ein Side-Project, egal was es ist, in welchem Bereich. Aber man kann überall lernen und wenn man andere Dinge sieht, dann hilft es einfach nicht nur im Job weiter, sondern eigentlich im gesamten Leben. Also macht einfach irgendwas anderes, probiert mal was aus, andere Technologien, andere Bereiche, irgendwo engagieren, das hilft einem einfach extrem weiter.",
      "start": 2631842,
      "end": 2659341,
      "confidence": 0.8548484848484847,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Mein Top-Tipp wäre ähnlich. Macht ein Zeitprojekt, aber macht euch Gedanken über eure eigenen Erwartungen. Erwartet nicht, dass ihr innerhalb von einer Woche ein nutzbares Produkt rausschießt, sondern schraubt die Erwartungen auf ein realistisches Level, auf ein realistisches Zeit-Commitment und geht das langsam an. Ihr werdet auf jeden Fall was lernen, auch wenn das Thema, was ihr lernt, von Anfang an noch nicht ganz offensichtlich ist. Ein Jahr down the road werdet ihr sehr, sehr viele Learnings haben.",
      "start": 2659998,
      "end": 2691663,
      "confidence": 0.8340769230769232,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielleicht auch noch ein Punkt dazu gesagt, weil du auch zuerst Intellectual Property angesprochen hast. Und die haben ja das auch oft gedacht, dass die Arbeitgeber eigentlich gar nicht happy sind mit Side Projects. Aber mein Learning ist da, und das war nicht nur Trivago, sondern auch was ich von anderen Firmen mitbekommen habe und heutzutage, dass die Firmen das eigentlich sehr, sehr positiv sehen, wenn ihre Mitarbeiter sich in irgendeiner Form engagieren, andere Side Projects haben, sich weiterbilden. Bei Trivago, die haben sich das sogar an die Fahne gehängt und haben da YouTube-Videos als Employer-Branding gemacht über Side-Projects von ihren Mitarbeiterinnen. Also ich glaube, man darf das nicht so negativ sehen. Manche verstecken sich da. Ich glaube, dass das bei den meisten Firmen, wenn das jetzt nicht ein extrem konservativer Konzern ist, dass die das alle sehr, sehr positiv sehen. Und dass man da eher hinausgehen kann und das public machen kann, als dass man sich versteckt und das im Geheimen nur macht und Angst hat, dass da der Arbeitgeber etwas dagegen hat.",
      "start": 2692487,
      "end": 2749787,
      "confidence": 0.8061666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da stimme ich zu und ich habe ähnliche Erfahrungen gemacht. Vielen Dank Wolfgang.",
      "start": 2749827,
      "end": 2754930,
      "confidence": 0.6641538461538462,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielen Dank Andi.",
      "start": 2754970,
      "end": 2756151,
      "confidence": 0.4053333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "An alle Hörer, lasst uns doch mal wissen, wie ihr zu dem Thema Side Project steht. Lasst mal ein paar Kommentare da.",
      "start": 2756191,
      "end": 2763116,
      "confidence": 0.8403181818181817,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bitte auf Twitter, wir werden das natürlich alles in den Shownotes verlinken.",
      "start": 2763136,
      "end": 2766098,
      "confidence": 0.7074166666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir verlassen das Engineering-Kiosk für heute. Wir stellen uns noch eine gemischte Tüte für einen Euro zusammen und bis zum nächsten Mal. Tschüss!",
      "start": 2767175,
      "end": 2777300,
      "confidence": 0.8176086956521739,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.7765939010784658,
  "audio_duration": 2782.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
