{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/e51b5ba0-f174-4965-8203-8b5673dac440/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62b81kv1rs-bef1-4903-b453-0916345af456",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zu einer neuen Episode beim Engineering Kiosk. Sein eigener Boss sein, freie Zeiteinteilung, nur interessante Projekte machen und dabei auch noch exorbitant viel Geld verdienen. Wir besprechen heute den Traum der Selbstständigkeit und welche Fragen man sich stellen sollte, bevor man den Schritt zum Freelancing wagt. Hallo Wolfgang. Einen wunderschönen guten Abend. Heute ausnahmsweise mal am Abend. Bisher haben wir immer in der Früh oder am Morgen, wie du sagst, aufgenommen. Heute mal am Abend. Eigentlich sollten wir uns Bier organisieren, oder? Warum haben wir kein Bier?",
            "start": 1700,
            "end": 37401,
            "confidence": 0.8099090909090908,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, dann holen wir uns mal eben kurz ein Bier.",
            "start": 37441,
            "end": 39103,
            "confidence": 0.4678,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, sehr gut. Okay, das klingt bei dir besser. Was gibt es bei dir heute? Ich habe ein Ayvit Weißbier aus Amsterdam. Lokale Brauerei.",
            "start": 39143,
            "end": 55549,
            "confidence": 0.6258333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Lokale Brauerei. Ui. Ich bin auch lokal. Boltenhalt. Diesmal aber nicht aus dem Ruhrgebiet, sondern vom Niederrhein.",
            "start": 55589,
            "end": 61957,
            "confidence": 0.681764705882353,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Klingt doch sehr gut.",
            "start": 61977,
            "end": 63098,
            "confidence": 0.7565000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Prost. Prost. So, heute machen wir ein bisschen was anderes. Du hast mich letztens zum Thema Open Source interviewt. Heute geht es dir mal ein bisschen an den Kragen. Und zwar beackern wir mal eine Userfrage, eine Hörerfrage. Und zwar hat uns jemand geschrieben und die Person möchte gerne mehr über das Thema Freelancing wissen. Ich persönlich habe nicht so wirklich viele Erfahrungen mit Freelancing. Aber der Wolfgang macht das schon seit Jahr und Tag, wie er mir offenbart hat, seit er 16 Jahre alt ist. Das müsste also nach seinem aktuellen Alter kurz nach der Wende gewesen sein, als die Mauer gefallen ist. Wolfgang, ist das korrekt?",
            "start": 63138,
            "end": 104370,
            "confidence": 0.8086666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dürfte ungefähr hinkommen. Ich glaube, das Projekt, wenn ich mich richtig entsinne, das erste Projekt hatte mit CD-ROMs zu tun und es war eine extrem wilde JavaScript-Implementierung und da reden wir von JavaScript zu Netscape-Zeiten in einem Webprojekt, was dann schlussendlich auf CD gebrannt wurde und einem Buch beigelegt wurde und da habe ich irgendwie ein fanziges JavaScript geschrieben, dass wenn man was in die Zwischenablage postet, dass ein Copyright hintendran gehängt wird, glaube ich.",
            "start": 104870,
            "end": 135792,
            "confidence": 0.7956933333333335,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Warst du irgendwie für die AOL-CDs verantwortlich?",
            "start": 135832,
            "end": 138595,
            "confidence": 0.8137142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, Gott sei Dank nicht.",
            "start": 139598,
            "end": 141019,
            "confidence": 0.354,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Neben der Hörerfrage haben wir in letzter Zeit auch vermehrt ehemalige Kollegen gesehen oder beobachtet, die diesen Schritt gegangen sind aus einer Festanstellung in die Freelancer-Tätigkeit. Und ja, da haben wir uns einfach mal gedacht, wir nehmen uns ein bisschen die Zeit und sprechen darüber.",
            "start": 141039,
            "end": 157753,
            "confidence": 0.8099555555555555,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ganz interessant, weil du gerade Kollegin sagst, das waren wirklich Kollegen, ich kenne keine Kollegin, die das bisher gemacht hat. Und im Freelancing-Bereich gibt es, glaube ich, eigentlich sehr wenig Frauen, zumindest meines Wissens. Wäre auch mal interessant, warum das so ist und ob da meine Einschätzung richtig ist oder ob die Statistiken da was anderes sagen. Falls jemand weiß, warum oder wenn jemand Statistiken darüber hat, wäre auch sehr interessant.",
            "start": 159060,
            "end": 183352,
            "confidence": 0.8121971830985919,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In der Tat, Software-Engineers im Freelancing-Bereich kenne ich, also weibliche Software-Engineers kenne ich auch keine. Wo es aber dann ganz anders aussieht, ist im Design- und UX-Bereich. Da kenne ich diverse Freelancerinnen und da kenne ich sehr, sehr wenig Freelancer, also männliche Freelancer im Design- und UX-Bereich.",
            "start": 184247,
            "end": 202500,
            "confidence": 0.7953404255319151,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das stimmt, also trifft das klassische Klischee wieder.",
            "start": 202880,
            "end": 205702,
            "confidence": 0.621,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auf jeden Fall scheint es ein heißes Thema zu sein. Ehemalige Kollegen sind in den Schritt gegangen. Wir haben eine Hörerfrage erreicht. Also Wolfgang, lass uns mal direkt einsteigen. Erzähl doch mal bitte, wie du zu Freelancing gekommen bist, wie du gestartet hast. Womit geht man rundherum?",
            "start": 206172,
            "end": 221949,
            "confidence": 0.6935106382978723,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, wie gesagt, das war, wie ich 16 oder so war, mit einem ersten Projekt, das über die Familie irgendwo gekommen ist und ich gefragt worden bin, ob ich das machen kann und technisch umsetzen kann. Und danach waren einfach, eigentlich sind da von links und rechts irgendwie Projekte an mich herangetragen worden und ich hatte da gar nicht irgendwie Marketing gemacht oder ähnliche Sachen, sondern bin da einfach in diese ganze Schiene irgendwie hineingerutscht und hatte dann auch eine Firma zusammen mit einem Kollegen, wo wir Projekte gemacht haben, aber auch Beratung, Consulting, Umsetzungen. Und so ist es irgendwie über die ganzen Jahre, auch während ich dann an der Uni angestellt war, sogar während Trivago habe ich das für alte Kunden weitergemacht. weil die einfach da waren. Und ich habe mich gar nicht sehr darum gekümmert und die Projekte sind einfach so von links und rechts angekommen von selbst. Muss aber auch dazu sagen, dass ich natürlich eben bei Trivago angestellt war, an der Universität angestellt war. Das heißt, ich hatte so einen gewissen Grund, Stock an Einkommen immer und war nicht so hundertprozentig auf diese Freelancer-Tätigkeit meistens angewiesen. Ich habe es zeitweise auch Vollzeit gemacht, das waren aber relativ kurze Zeiten.",
            "start": 223573,
            "end": 291190,
            "confidence": 0.8068669950738917,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt gerade hast du aber keine richtige Anstellung, jetzt gerade bist du Vollzeit-Freelancer, ist das richtig?",
            "start": 291210,
            "end": 296292,
            "confidence": 0.5985625,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aktuell bin ich Vollzeit-Freelancer, beziehungsweise arbeite an meinen eigenen Projekten.",
            "start": 296332,
            "end": 300493,
            "confidence": 0.8070999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, mit dem Ziel, dass Sie auch irgendwann mal Einkommen generieren.",
            "start": 301073,
            "end": 303974,
            "confidence": 0.7800909090909091,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Natürlich, das ist auf jeden Fall das Ziel, ja.",
            "start": 304014,
            "end": 305515,
            "confidence": 0.6196666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hattest gerade erwähnt, dass du immer ein stabiles Einkommen hattest. Würdest du diese Zeiten wirklich als Freelancing bezeichnen, als du bei Trivago gearbeitet hast, als du an der Uni angestellt warst?",
            "start": 305870,
            "end": 313847,
            "confidence": 0.69171875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich glaube, das ist ganz allgemein, dieses Freelancing-Word sollte man vielleicht ein bisschen genauer betrachten, weil das ist so ähnlich wie Festanstellung. Die Festanstellung sagt auch sehr wenig darüber aus, was du machst, wie du das machst, sondern dass du halt angestellt bist. Und so ähnlich sehe ich das Freelancing, dass man halt einfach was macht, was nicht auf Festanstellungsbasis ist. Das ist die einzige Definition. Aber man muss dann schon genauer reinschauen, was Freelancing überhaupt sein kann. Freelancing, Consulting, da gibt es ja relativ viele Begriffe, die verwendet werden. Und ich sehe da darunter auch unterschiedliche Tätigkeiten. Also man kann darüber streiten, ob Freelancing und Consulting was anderes ist oder das Gleiche. Ich glaube, da gibt es auch keine Standarddefinition. Wo ich das immer unterscheide, ist eigentlich, ist das Freelancing eigentlich eine Festanstellung? Also ist es nur am Blatt Papier? Freelancing, dass man also keine Fixanstellung hat, aber eigentlich die gleiche Tätigkeit macht. Das gibt es sehr oft, dass Leute einfach zum Beispiel, wenn die Firma remote ist, also in irgendeinem anderen Land und die Firma zum Beispiel in Deutschland gar nicht tätig ist, dann kannst du eigentlich gar nicht in einem anderen Land angestellt werden, musst also selbstständig sein und für diese Firma aber fulltime arbeiten. Das ist eigentlich wie eine Fixanstellung, würde ich fast sagen, ist aber rein formell natürlich Selbstständigkeit, Freelancing. Da gibt es natürlich diese eher Beratungstätigkeit, würde ich es mal nennen, wo man einfach eine Firma berät in irgendeinem gewissen Spezialfeld, weil man zum Beispiel, so jetzt wie du, Infrastrukturbereich sehr gut drauf ist, kann man halt denen einfach helfen, ihre Infrastruktur erforderbar zu bringen. Und da geht man dann halt in die Firma rein, vielleicht sogar nur ein paar Tage oder zwei Tage, macht irgendwelche Workshops mit denen und hilft denen halt weiterzukommen. Das heißt, die zahlen dich für dein Knowledge. Das sind halt wirklich so kurze Aufträge. Dann gibt es natürlich auch längere Aufträge, wenn man zum Beispiel Softwareentwickler ist, dass man halt über ein paar Monate vielleicht angestellt ist oder eben nicht angestellt ist, aber für eine Firma arbeitet, für ein größeres Projekt oder auch parallel mehrere Projekte. Also es kommt schon darauf an, wie viel man macht, ob man wirklich hands-on arbeitet für die Firma. ob man eher Beratungstätigkeiten macht, Workshops plant, Präsentationen gibt oder denen einfach zur Seite steht mit dem Knowledge, das man aufgebaut hat oder ob man wirklich Hands-on vielleicht sogar in der Firma sitzt vor Ort und was für die programmiert oder ein abgeschlossenes Projekt programmiert von zu Hause aus und denen dann einfach am Ende für einen gewissen Betrag übergibt, einfach eine klassische Softwareentwicklung. Die brauchen eine App, zum Beispiel irgendeine Web-App und du programmierst denen diese Web-App und ihr habt vereinbart, okay, diese Web-App kostet 3.000 Euro und am Ende deliverst du diese Web-App und bekommst die 3.000 Euro.",
            "start": 314678,
            "end": 476037,
            "confidence": 0.8068991596638659,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das klingt schon mal ganz interessant, das sind auf jeden Fall, ich glaube, grundlegend unterschiedliche Arten von Arbeiten. Ich möchte mal ganz kurz auf einen Punkt zu sprechen kommen und zwar sagtest du, es gibt auch eine Art Selbstständigkeit, dass man für eine Firma komplett arbeitet, dass man eigentlich gar nicht andere Kunden hat. Ist das, was ist das, Remote Work oder?",
            "start": 476357,
            "end": 496889,
            "confidence": 0.7757741935483871,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, wie gesagt, eigentlich ist es wie eine Festanstellung. Man arbeitet halt dann remote für eine Firma oder auch vor Ort. Also ich kenne viele, die, keine Ahnung, für Daimler zum Beispiel, Mercedes oder sonst was einfach dort vor Ort arbeiten. Die arbeiten in dem Office von Daimler und sitzen da einfach drinnen, sind aber eigentlich selbstständig oder bei einer anderen Firma angestellt und sind dort Leiharbeiter oder sind eben selbstständig und arbeiten dort einfach 40 Stunden ganz normal, wie normale Mitarbeiter sind dort integriert natürlich auch. Je nachdem, je nach Firma ist man da unterschiedlich integriert natürlich. Darf man da jetzt zum Beispiel bei einem Team-Event, wo es gratis Bier gibt am Abend, darf man da mitmachen als Externer oder nicht oder bei anderen internen Events. Das kommt natürlich darauf an, je nach Firma. Was man sich aber schon im Klaren sein muss, ist, dass halt das theoretisch am nächsten Tag, wenn es nicht anders vereinbart ist vertraglich, dass am nächsten Tag dieser Job weg sein kann. Gerade wenn es jetzt irgendwo Kürzungen gibt oder wenn ein Projekt eingestampft wird, dann kann es halt sein, dass man eine Woche später keinen Job mehr hat oder diese Anstellung, diese Pseudo-Anstellung als Freelancer zum Beispiel nicht mehr hat. Also man ist schon immer ein Mitarbeiter zweiter Klasse, würde ich sagen, als Freelancer grundsätzlich.",
            "start": 497519,
            "end": 566908,
            "confidence": 0.8116621621621624,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt sei mal nicht so negativ. Ich möchte noch mal auf die positiven Seiten kommen. Moment mal, das würde bedeuten, dass ich jetzt theoretisch in diesem Modell auch für jede Firma weltweit arbeiten könnte, richtig? Dass die Firma, für die ich arbeite, jetzt eigentlich nicht in Deutschland sitzen muss oder in Österreich jedenfalls, da wo ich wohne.",
            "start": 567337,
            "end": 581220,
            "confidence": 0.7797719298245616,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, und bei Remote Work ist es sogar sehr oft der Fall, dass genau so ein Modell gewählt wird, weil diese Firmen eben keinen Firmensitz haben in Deutschland und du darum selbstständig sein musst, um für diese Firma in Amerika, in Schweden oder sonst irgendwo zu arbeiten.",
            "start": 581890,
            "end": 598120,
            "confidence": 0.8608510638297874,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe mal den Begriff scheinselbstständig gehört. Hat das was damit zu tun?",
            "start": 598381,
            "end": 602183,
            "confidence": 0.7185384615384615,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Denn die Scheinselbstständigkeit gibt es vor allem in Deutschland, in Österreich ist es weniger ein Problem. Ich weiß nicht genau wie sie hundertprozentig definiert ist, ob es da überhaupt eine hundertprozentige Definition gibt, ab wieviel Kunden du keine Scheinselbstständigkeit mehr hast, aber du läufst natürlich schon in dieses Problem. dass wenn du nur einen Kunden hast, dass das quasi eine Umgehung ist von dem deutschen Recht, von der Sicherheit als Angestellter und so weiter. Wobei da im IT-Bereich natürlich eigentlich kein Problem besteht, dass man da irgendwie in prekären Verhältnissen arbeitet, ohne versichert zu sein und irgendwie mit einem extrem niedrigen Lohn wie bei Paketdiensten oder so. Also da hat man weniger das Problem, aber rein formell muss man da aufpassen, und braucht eventuell ein, zwei andere Kunden, denen man auch Rechnungen stellt, damit man eben nicht in diese Scheinselbstständigkeit fällt.",
            "start": 603193,
            "end": 654256,
            "confidence": 0.8351985815602834,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hattest gerade verschiedene Arten von Freelancing mal vorgestellt. Welche hast du primär gemacht oder beziehungsweise welche haben dir am meisten Spaß gemacht?",
            "start": 654276,
            "end": 662228,
            "confidence": 0.6986956521739132,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube, meine ersten Projekte waren klassisch eher Programmieren. Man definiert einen Projektumfang, irgendeine App oder irgendein Produkt, das man baut, definiert einen Preis, stellt ein Angebot. Drei Monate später, wenn man das delivert, wird das bezahlt. Das waren eigentlich die meisten Projekte zu Beginn, später sind die Projekte einfach gewachsen, dann habe ich schon andere Freelancer mit hereingenommen in mein Team und wir haben gemeinsam als Team sozusagen Produkte entwickelt, die dann ausgeliefert wurden an die Kunden. Und in letzter Zeit mache ich hauptsächlich Beratung in dem Sinne, dass ich Workshops mache oder Firmen mein Knowledge zur Verfügung stelle, das ich einfach über die letzten Jahrzehnte gesammelt habe und die haben irgendwo Schwierigkeiten oder wollen irgendeine spezielle Umstrukturierung oder klassisch, wenn eine kleine Firma wächst und irgendwann kommt dieser Punkt, ab wann brauche ich einen Teamlead, wie kann ich denn diese Transformation von dem Mini-Unternehmen, wo alles noch automatisch geht, irgendwie in eine richtig strukturierte Firma überführen und die Firmen suchen dann Unterstützung zum Beispiel in so einem Bereich. Das sind dann eher klassische Projekte, wo man mal ein, zwei Tage mit denen einfach arbeitet und denen hilft, so ein bisschen zeigt, was denn üblich ist heutzutage.",
            "start": 662799,
            "end": 740377,
            "confidence": 0.8015075376884424,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das klingt jetzt eher so, dass deine Art von Freelancing-Jobs, die du bekommen hast, mit dir und deinen Erfahrungen gewachsen sind. Am Anfang hast du abgeschlossene Projekte gekriegt. Da habe ich gleich auch noch eine Frage, weil meines Erachtens nach rostet halt Software bezüglich der Maintenance, aber kommt gleich. Und über die Zeit hast du dann mehr, ich nenne es mal, Beratung gemacht. Beraten tut man ja, wenn man ziemlich viel Erfahrung hat, wenn man weiß, wie Sachen laufen, wo man schon mal gegen die Wand gefahren ist. um Wissen zu teilen. Würdest du sagen, das stimmt so, dass du mit mehr eigener Erfahrung andere Art von Freelancing-Jobs gemacht hast?",
            "start": 740668,
            "end": 774229,
            "confidence": 0.7671363636363638,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Stimmt natürlich. Aber es ist auch meine persönliche Präferenz, einfach auf Problemstellungen hinzugehen und diese zu lösen in einem breiteren Umfeld, dass man einfach eben ein gesamtes Produkt delivert, eine ganze App, dass man sich anhört, wo haben die Kunden ein Problem, wie kann man diese Probleme lösen, sei es jetzt mit einer App oder mit irgendeinem Tool, aber auch mit einer Umstrukturierung oder mit einer Änderung in deren Ablauf, in deren Prozess. Ich glaube, es gibt aber sehr wohl andere Freelancer, die einfach ihr technologisches Knowledge einfach so weit aufbauen und die dann vielleicht einfach Spezialisten in irgendeinem ganz spezifischen Bereich sind, irgendwie Linux, Kernel, keine Ahnung, irgendwas. Hochperformantes und dann dort einfach auch klassische Programmierarbeiten oder Problemlösungen in so einem Bereich machen. Aber klar entwickelt man sich über die Zeit und lernt auch Dinge, die man dann natürlich in den Projekten dementsprechend auch weitergeben kann.",
            "start": 774269,
            "end": 834794,
            "confidence": 0.8263265306122448,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hattest du als erstes Projekt was genannt, was du als abgeschlossenes Software bezeichnet hast. Du hast etwas, du hast Requirements bekommen, du hast etwas geschrieben und hast du diese Software abgeliefert, aber Software braucht ja auch Wartung, Liebe, sonst rostet sie. Wie verhält sich sowas bei einem Freelancing-Job? Kannst du da ganz offen gesprochen irgendwas hinrotzen, abgeben und dich da nicht mehr drum kümmern oder kommt der Kunde dann immer mal wieder und sagt hey kannst du mal ein Update hier machen oder irgendwie läuft das mit der neuesten Salesforce Version nicht mehr oder wie läuft sowas?",
            "start": 835535,
            "end": 865417,
            "confidence": 0.7050204081632653,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das kommt wirklich auf den Kunden drauf an, aber es ist ein großes Problem, was du da ansprichst, weil klassischerweise Kunden wollen ungern mehr zahlen und wenn du denen sagst, okay, realistisch ist es halt so, dass du 20 Prozent von dem Projektwert nochmal pro Jahr einrechnen musst für Wartung und Weiterentwicklung und up to date halten, da haben viele Kunden keinen Spaß mit so einer Aussage. Das heißt, du musst auch wirklich kämpfen, damit die mehr Geld investieren in diese Wartung, in diese Updates, in die Beseitung von Technical Depth. Und oft geht es auch rein um den Preis. Die wollen was möglichst billig haben. Die wollen keine schöne Umsetzung, gerade wenn es so projektbasierte Arbeiten sind. Die wollen ein Problem möglichst schnell gelöst haben. Und manche Firmen sind schon so weit, dass sie wissen, dass mehr dazugehört zu einer ordentlichen Lösung. Aber ganz, ganz vielen Kunden muss man das ganz genau erklären und probieren zu verkaufen, dass das wichtig ist. Aber ganz oft funktioniert es auch einfach nicht und die sind zufrieden, dass es eine Lösung gibt und irgendwann zwei Jahre später wird ihnen das auf den Kopf fallen.",
            "start": 866474,
            "end": 933800,
            "confidence": 0.8300621761658036,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Beschreibung, die du gerade abgeliefert hast, die erinnert mich so hundertprozentig an so eine klassische Webagentur. Da macht man nämlich auch nur das, was der Kunde zahlt. Keine Unit-Tests. Möglichst günstig. Bitte keine saubere Architektur, sondern raus, raus, raus und Geld einstreichen.",
            "start": 934180,
            "end": 948104,
            "confidence": 0.7640465116279072,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, jeder muss mal dieses Lehrgeld zahlen und wie gesagt, zwei Jahre später werden sie dann halt die Rechnung präsentiert bekommen, weil irgendwann kommt dann die IT-Abteilung und sagt, okay, dieses Ding läuft immer noch auf einer Version, die nicht mehr supported wird und acht Jahre alt ist. Was machen wir jetzt damit? Und dann gibt es ein Problem zum Beispiel.",
            "start": 948445,
            "end": 968115,
            "confidence": 0.8299016393442623,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich muss jetzt aber nochmal ganz kurz eine Lanze brechen für die Webagenturen, natürlich ist nicht jede Webagentur so. Und wegen alter Software, du hast es gerade beschrieben, wir hatten glaube ich mal in der ersten oder zweiten Episode über Side Projects geredet und da hattest du offenbart, dass du wohl noch Send Framework 1 im Einsatz hast, richtig?",
            "start": 968415,
            "end": 984795,
            "confidence": 0.7941186440677965,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das ist korrekt.",
            "start": 985135,
            "end": 986097,
            "confidence": 0.64025,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Danach hatten wir eine Diskussion beziehungsweise Hörer Feedback, dass in einer recht großen Produktfirma, die ihr eigenes Produkt hat, ebenfalls noch Send Framework 1 im Einsatz ist und das noch richtig viel Geld verdient. Also Wolfgang, du bist nicht der einzige.",
            "start": 986597,
            "end": 999409,
            "confidence": 0.7985121951219514,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das stimmt. Ich habe auch Kunden, die Tools noch im Einsatz haben. Ich habe gerade einen, Da hat es kürzlich ein Problem gegeben und dann habe ich mit der IT-Abteilung geredet, weil es da irgendwie ein Problem mit der Authentifizierung gegeben hat, mit deren Active Directory. Und dann hat diese IT-Mietarbeiter einfach gemeint, okay, diese Ubuntu-Version, die unterstützen wir schon lange nicht mehr. Also entweder wir updaten die Ubuntu-Version, davor loggt er sich nicht mal mehr auf diesen Server ein, um irgendwas zu debuggen oder das Problem zu finden.",
            "start": 1000229,
            "end": 1027130,
            "confidence": 0.7334269662921346,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und ich wurde ausgelacht über irgendwelche Server, die in der Ecke stehen und Staub sammeln, die das Geld verdienen. Und sorry, sie kommen immer wieder, weil jede Firma hat sie.",
            "start": 1027602,
            "end": 1037590,
            "confidence": 0.8292999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, muss ich dir leider recht geben.",
            "start": 1038291,
            "end": 1040454,
            "confidence": 0.6155714285714285,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, kommen wir mal zum nächsten Punkt. Und zwar stelle ich mir immer die Frage, warum soll ich denn Freelancer werden? Was sind denn so die drei, vier, fünf positiven Aspekte des Freelancer-Daseins?",
            "start": 1040534,
            "end": 1052105,
            "confidence": 0.803060606060606,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich kann natürlich nicht für alle sprechen. Ich glaube, ganz viele machen es einfach, weil es sehr gut bezahlt ist. Aber ich glaube, ein sehr wichtiger Punkt ist einfach, dass man eine andere Verantwortung hat gegenüber Projekten. Also man betrachtet Projekte viel gesamtheitlicher, dass man wirklich verantwortlich ist, von UI bis zur Datenbank selbst macht, auch die Probleme analysieren muss zuerst vom Kunden, weil ganz viele Kunden wissen gar nicht, was sie wollen. Also gerade wenn man so Projektaufträge macht, ist es glaube ich wirklich ein sehr interessantes Geschäft und ich habe extrem viel dabei gelernt, weil es halt wirklich darum geht, ein Angebot zu schreiben. Du musst den Kunden überzeugen, du musst die Architektur designen, du musst also wirklich alles machen, Du bist dein eigener Chef sozusagen, schaffst dir auch selber an, was du zu tun hast, welche Teile du schreiben musst, in welcher Zeit du die schreiben musst. Du musst die Estimates machen, du musst dann das Angebot machen. Also du bist wirklich eine komplette Firma in einer Person. Das habe ich immer sehr spannend empfunden und habe Wie gesagt, hat mir auch extrem viel gebracht für meine anderen Jobs und auch später, gerade den Umgang mit Kunden, der war für mich extrem wichtig. Und das klingt jetzt alles sehr positiv, aber es gibt natürlich auch negative Sachen, gerade wenn es um Zeiteinteilung geht. Du kannst zwar selber deine Zeit einteilen, aber du musst auch selber deine Zeit einteilen und deine Estimates müssen dann halt auch stimmen, weil sonst sitzt du halt einfach an den Wochenenden genauso an dem Projekt, weil es gibt eine Deadline am Montag. Und dem Kunden ist komplett egal, ob es da Wochenende ist oder nicht.",
            "start": 1052406,
            "end": 1149542,
            "confidence": 0.8013745583038876,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Lass uns mal kurz bei den positiven Seiten bleiben. Du sagtest gerade, du kannst dir aussuchen, worin du arbeitest. Da wollte ich dich fragen, ist das wirklich so? Also ich stelle mir jetzt vor, ich fange jetzt damit an. Und wenn ich damit anfange und jetzt noch keine lange Schlange an Kunden habe, dann ist es eher so, dass ich auf gut Deutsch vielleicht sogar die Nutte bin, weil ich einfach auch Geld brauche. Ich muss halt leben. Da kann ich mir nicht wirklich aussuchen, Für Häckler und Koch, die zahlen zwar sehr gut, möchte ich eigentlich nicht arbeiten, aber gut, irgendwer muss die Miete zahlen.",
            "start": 1149942,
            "end": 1180293,
            "confidence": 0.7415188679245281,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gerade am Anfang kann es natürlich sein, dass du Kunden oder Projekte annehmen musst, die vielleicht weniger interessant sind, sofern du auf das Geld angewiesen bist. Aber ich glaube, wenn man allgemein interessiert ist, kann man auch bei Projekten, die jetzt vielleicht am Anfang weniger interessant wirken, auch noch einiges lernen. Und gerade wenn man so ein komplettes Projekt übernimmt, kann das schon auch sehr spannend sein. Aber wie es in einem normalen Job halt auch ist, bei einer Festanstellung, du machst auch nicht 100 Prozent Sachen, die dir gefallen in der Festanstellung. Und so ist es halt bei der Selbstständigkeit auch. Und wenn du das dritte Wochenende durcharbeitest, weil du eine Deadline erfüllen musst, das macht auch keinen Spaß, auch wenn das Projekt noch so interessant ist.",
            "start": 1181033,
            "end": 1217343,
            "confidence": 0.7789453124999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie viele Projekte bzw. Kunden hast du schon aktiv abgelehnt? Nicht aus Zeitgründen, sondern weil das Projekt dir ja nicht spannend vorkam oder weil dir irgendwas nicht geschmeckt hat?",
            "start": 1217383,
            "end": 1226430,
            "confidence": 0.7398620689655173,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe da jetzt keine Nummer im Kopf, aber ich habe vor allem Projekte abgelehnt, wo ich keinen Mehrwert gesehen habe, dass ich der Firma einen Mehrwert bringen kann. Also zum Beispiel, ich hatte gerade kürzlich mit einem Kunden eine Diskussion, wo ich dann am Ende einfach gesagt habe, okay, es ist nett, ich könnte euch da jetzt was programmieren, aber sucht euch einfach jemand, der euch das in Excel schnell implementieren kann. Und das mache ich garantiert nicht, weil ich kein Excel-Mensch bin. und auch keine Excel-Erfahrung habe. Und das macht einfach keinen Sinn. Also da war ich auch so ehrlich, dass das keinen Sinn macht. Und eher waren es solche Projekte, wo ich den Kunden einfach geholfen habe, eine richtige Lösung zu finden, auch wenn ich gar nicht die Lösung war.",
            "start": 1226752,
            "end": 1269762,
            "confidence": 0.7912105263157894,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment mal, aber wenn du dem sagst, hey, pass mal auf, eine eigene Applikation macht gar keinen Sinn, Excel ist das Tool der Wahl, ist das nicht dann eigentlich schon dem Kunden zu beraten, was er eigentlich möchte?",
            "start": 1269802,
            "end": 1279948,
            "confidence": 0.725578947368421,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das geht sehr in die Richtung, da ist auch so eine Schwierigkeit, wenn man selbstständig ist und auch mit Bestandskunden. Ab wann kannst du eine Rechnung stellen? Und was ist noch Angebotserstellung? Und wie viel ist schon wirklich Beratung? Und kannst du eine Rechnung stellen für diese Beratung? Das ist so eine Gratwanderung, die extrem schwierig ist. Und ich mache es mittlerweile wirklich so, dass ich auch oft sage, okay, wir müssen dieses Projekt genauer beleuchten. Wir können uns das mal in einem Tag genauer anschauen. Ein Tagessatz. Und am Ende kommt dann, putzelt da ein Dokument heraus, wo dann einfach genauer drinsteht, um was es geht in diesem Projekt, was es für Möglichkeiten gibt für die Umsetzung. Das könnt ihr dann auch mit einem anderen Freelancer zum Beispiel umsetzen. Da geht es einfach darum, das Ganze genauer zu dokumentieren und zu beschreiben. Und dann kann man, wenn man sich das im Vorhinein auch ausmacht, dann kann man für dieses Dokument auch schon dementsprechend was verrechnen und macht das nicht einfach umsonst.",
            "start": 1280289,
            "end": 1334716,
            "confidence": 0.8082790697674419,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist ein spannender Aspekt. Ich vergleiche das immer mit Agenturen, mit Webagenturen und sogenannten Pitches. Irgendein Kunde hat ein Großprojekt, er lädt drei, vier Agenturen für einen Pitch ein. Eigentlich eine Konzepterstellung, wie würden sie es umsetzen etc. Und eine Pitchvorbereitung kostet eigentlich recht viel Zeit. Kleine Agenturen haben da eigentlich nicht dieses Budget, weil In den früheren Tagen wurden diese Pitches gar nicht bezahlt. Und bei seriösen Firmen, die halt schon die ganze Sache ernst nehmen, inzwischen bezahlen sie auch diese Pitches. Das ist ja genau das, was du da gerade sagst. Wir schauen uns das Projekt mal einen Tag an. Eine andere Geschichte bei der positiven. Bei den positiven Aspekten, die du genannt hast, waren, du kannst dir deine Zeit frei einteilen und du musst aber auch das Projekt schätzen. Meine Erfahrung ist eigentlich, dass Software-Ingenieure relativ scheiße sind in Projekte schätzen.",
            "start": 1335076,
            "end": 1380459,
            "confidence": 0.7580689655172416,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich habe extrem viel gelernt mit meinen Schätzungen, aber es ist immer noch verdammt schwierig etwas zu schätzen. Und leider ist es immer noch so, gerade mit vielen Firmen, die hätten halt gern einen Preis da am Ende stehen. Die hätten gern ein Angebot, das du am besten kostenlos erstellst für die. Das hat dann 20 Seiten, wo dann schon alles genau aufgesplittet ist und am unteren Rand steht dann eine Summe, auf die du dich committest und die sollte sich auf keinen Fall ändern. Wenn du dann zum Kunden kommst und sagst, wir machen das agil, das ist der Stundensatz, es könnten mal 100 Stunden sein, vielleicht sind es auch 300 Stunden. Die wenigsten haben da wirklich Spaß damit. Also gutes Schätzen ist extrem schwierig. Mir kommt vor, die Kunden werden mittlerweile offener, dass es einfach schwierig ist zu schätzen. Was ich persönlich mache meistens ist, dass ich das ganze Projekt grob einteile in größere Phasen und dann wirklich nur die erste Phase anbiete und sage, okay, die erste Phase, schauen wir uns mal diesen Teilbereich an. Das ist das erste Deliverable, was man wirklich verwenden kann dann auch. das kostet so und so viel und dann schauen wir uns das mal an und wenn es dann okay ist, dann kann man in die nächsten Phasen gehen und dann macht man aber nochmal eigene Angebote für die nächsten Phasen, dass man so wirklich so einen kleinen ersten Teil einfach abschätzt, dann gibt es einen Price Tag am Ende, da weiß der Kunde okay, so und so viel kostet der erste Teil, da kann ich schon mal damit arbeiten und alles andere kommt dann später und das ist dann für die meisten Kunden auch okay so und dann hat man auch für sich selber einfach eine gute Herangehensweise an so eine Schätzung, weil irgendwie ein Projekt zu schätzen, was sechs Monate dauert, das ist fast unmöglich im Vorhinein. Vor allem, weil der Kunde dreimal ums Eck kommt mit irgendwelchen Änderungen oder dreimal, dreißigmal ums Eck kommt mit irgendwelchen Änderungen.",
            "start": 1380479,
            "end": 1485164,
            "confidence": 0.8069029411764705,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du mal mit Multiplikatoren bei der Zeitschätzung rumgespielt? Keine Ahnung, deine erste Zeitschätzung mal zweieinhalb und das schreibst du aufs Angebot?",
            "start": 1485204,
            "end": 1491509,
            "confidence": 0.5400454545454545,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also die erste Preisschätzung, so im Nachhinein gesehen, würde ich mal eher mal Faktor 5 oder so nehmen. Mittlerweile bin ich so bei einem Faktor von zwei meistens bei meinen Schätzungen. Das kommt dann am Ende ganz gut hin. Aber es sind auch wieder so Sachen, wenn die Kunden mit Änderungen kommen, da muss man halt extrem aufpassen, weil da können Schätzungen sich schon extrem dann ändern dadurch und das muss man halt auch klar kommunizieren, dass das wirklich eine Änderung ist und nicht einfach eine kleine Änderung, weil der Kunde sagt, kannst du den nicht diesen Ablauf nur da schnell mal klein abändern und für dich im Hintergrund ist es natürlich eine Riesenänderung. Also das muss man ganz klar kommunizieren und sonst auch ablehnen. Und wenn man das zu spät macht, das ist glaube ich auch ein klassischer Fehler, den man am Anfang so macht, dass man zu wenig kommuniziert und zu wenig auf diesen Preis achtet und am Ende steigt man extrem schlecht aus, weil man einfach viel weniger Geld bekommt oder vielleicht sogar zu wenig Geld bekommt, um zu überleben oder dass das halt in einem sinnvollen Rahmen ist. Aber das lernt man auch mit der Zeit garantiert.",
            "start": 1491889,
            "end": 1551684,
            "confidence": 0.7782425742574255,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das würde ich jetzt aber auch mal recht generalisieren, weil dieses Problem der Zeitschätzung und der frühen Kommunikation, das sollte eigentlich jeder Softwareingenieur, der mit einem Projektmanager, Produktmanager oder ähnlichem zu tun hat, mit einer taffen Deadline und während des Projektes ändern sich die Anforderungen. Ich glaube, das kennen viele unserer Hörer und Hörerinnen.",
            "start": 1551704,
            "end": 1571622,
            "confidence": 0.7915185185185186,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Unterschied ist aber, dass du einen Projektmanager hast, der sich darum kümmert und wahrscheinlich auch dir, vor allem wenn du agil arbeitest, das ja jede Woche im Idealfall sogar noch kürzer überprüft, sind wir noch in der Zeit oder muss ich da irgendwas ändern? Das heißt, da kümmert sich eine Person nur um diesen Bereich und wenn du nur Programmierer warst und und keine Projekte gemanagt hast, dann ist das natürlich für dich eine andere Verantwortung, die du hast. Und da musst du auf deine eigene Zeit achten und deine eigenen Schätzungen machen und vielleicht deine Zeit tracking. Also was mir extrem geholfen hat, ist wirklich ganz hartes Tracking auf die Minute genau, wenn es möglich ist, um wirklich die eigenen Schätzungen zu überprüfen und vor allem danach auch daraus zu lernen, wenn du ganz falsch geschätzt hast.",
            "start": 1571842,
            "end": 1614127,
            "confidence": 0.8356115107913668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe jetzt gerade so ein bisschen angefangen, die positiven Seiten des Freelancer-Daseins ein bisschen zu challengen. Kommen wir nochmal ganz kurz zurück. Was du genannt hast, waren eigentlich die freie Zeiteinteilung, dass du dein eigener Chef bist und dass du dir deine Kunden und Projekte, in Anführungszeichen nennen wir mal, aussuchen kannst. Das sind so die positiven Seiten, die du genannt hast. Ist das richtig?",
            "start": 1614472,
            "end": 1632806,
            "confidence": 0.6822878787878787,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und dass du die Projekte ganzheitlich betrachten kannst, wenn du das als positiv siehst, ja.",
            "start": 1632846,
            "end": 1637770,
            "confidence": 0.7312000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was würdest du sagen, sind die Kernpunkte der negativen Seiten, der Schwierigkeiten? Was würdest du sagen, das ist aber ein Rattenschwanz, den hatte ich nicht so im Zettel?",
            "start": 1638238,
            "end": 1647178,
            "confidence": 0.7129285714285715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, wir haben jetzt eigentlich eh schon extrem viele Schwierigkeiten auch angesprochen bei den positiven Dingen, vor allem wenn man die eigene Zeiteinteilung nimmt. Das kann positiv sein, ist aber auch wirklich eine große Herausforderung, die Selbstdisziplin zu haben, dass man da wirklich die Zeit investiert, dass man die richtigen Schätzungen macht, dass man da keine Probleme hat und am Ende nur Wochenenden durcharbeitet, weil es eine Deadline gibt. Alles rund um Schätzung und Zeiteinteilung kann auch ein extrem negativer Punkt sein und wirklich auch die ganze Motivation womöglich auffressen von einer Selbstständigkeit. Also gerade da würde ich extrem aufpassen. Und wenn jemand schlecht ist im Selbstmanagement, in der Selbstdisziplin, kann das durchaus ein Problem werden. Das heißt nicht, dass man das nicht lernen kann, aber man muss auf jeden Fall extrem aufpassen.",
            "start": 1647905,
            "end": 1696219,
            "confidence": 0.8242180451127822,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hast jetzt ein bisschen Selbstdisziplin genannt für die Arbeit, aber wie kommst du denn an die Arbeit? Du stellst dich ja bestimmt nicht mit einem Schild an die Straße in Tirol und sagst, hey, ich bin ITler und kann programmieren, gib mir Arbeit.",
            "start": 1696259,
            "end": 1708107,
            "confidence": 0.66675,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du sprichst da schon einen sehr wichtigen Bereich an, und zwar die Kundenakquise, die unter Umständen, vor allem wenn du davon leben musst, sehr schwierig ist. Ich hatte meistens das Glück, irgendwie nebenbei, zum Beispiel über die Universität, irgendwie ein fixes Einkommen zu haben. Und dann kann man sich wirklich die Projekte aussuchen und muss auch weniger Akquise machen. Dann geht es wirklich über Mundpropaganda. Aber es kann natürlich sein, dass du wirklich gerade am Anfang Aquise machen musst, kalte Aquise womöglich, wirklich deine Kontakte anschreiben, Firmen anschreiben. Das muss man auch erstmal mögen. Das ist klassisches Sales und gerade Entwicklern liegt das sehr oft nicht. Also das muss man schon auch mögen und gerade wenn man wirklich seine Rechnungen bezahlen muss und vielleicht auch mal über eine einen gewissen Zeitraum dann keine Projekte hat, das ist für viele Leute schon auch ein Problem. Also da muss man sich schon auch überlegen, hat man diese Risikobereitschaft und kann man dann noch ruhig schlafen, wenn man einfach mal, keine Ahnung, ein Monat kein Geld bekommt oder einfach mal 50 Prozent weniger von seinem Monatsgehalt bekommt, kann man da noch gut schlafen oder ist das eben ein Knock-out-Kriterium? Dann sollte man sich das wirklich überlegen.",
            "start": 1708127,
            "end": 1775149,
            "confidence": 0.8230788177339903,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hast ja jetzt das Thema Geld angesprochen. Ist ja auch eine sehr wichtige Geschichte, weil das ist ja jetzt ein 1 zu 1 Austausch. Meine Arbeitszeit, meine Fähigkeiten gegen Geld. Woher weiß ich denn, wie viel ich überhaupt wert bin oder meine Arbeit? Wie nennt man das Thema Preisfindung?",
            "start": 1775564,
            "end": 1791707,
            "confidence": 0.7834200000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wie ich schon gesagt habe, gerade wenn man so Projektarbeiten macht und einen Preis für dieses Projekt am Ende dann irgendwie drunterschreiben muss bei diesem Angebot, dann hat man da extreme Probleme. Bei einem klassischen Stundensatz ist es schon ein bisschen einfacher. Da gibt es diese Faustregel, Bruttogehalt mal zwei, wobei man da natürlich auch genauer darauf achten muss, was jetzt ein Bruttogehalt ist. Man darf da nicht einfach eine 40-Stunden-Woche annehmen. Du hast ja Urlaub, du hast einen Krankenstand. Du musst dich vielleicht selber weiterbilden. Du kannst ja nicht 40 Stunden in der Woche nur geben und nirgends was wieder nehmen im Sinne von Lernen. Also da muss man auch extrem aufpassen, was man da an Stunden wirklich annimmt. Und ich habe das auch ganz oft erlebt, wenn man dann irgendjemandem sagt, ja, ich habe einen Stundensatz von 150 Euro, nehmen wir mal an, oder 100 Euro ist einfach zu rechnen. Dann fangen die Leute so im Kopf rechnen an, okay, der arbeitet also 40 Stunden. In der Woche mal 100 Euro, das sind 4.000 Euro, die der in der Woche verdient, mal 4, das sind 16.000 Euro, die der pro Monat verdient. Wow, das ist nicht schlecht. Und dann in den Köpfen schwirrt dann so 16.000 Euro pro Monat herum. Wenn man aber das sinnvoll rechnet, ich habe da eine Zahl, die man immer ganz gerne merkt. Im Durchschnitt hat man 222 Arbeitstage im Jahr. Das heißt, da ist der klassische Urlaub und die kranken Zeiten schon abgerechnet. Mit dem kann man ganz gut rechnen. Und wenn man jetzt rechnet, man hat...",
            "start": 1792189,
            "end": 1885661,
            "confidence": 0.8025509433962259,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt kommt der Akademiker, der einen Taschenrechner braucht. Okay, jetzt bin ich gespannt.",
            "start": 1885681,
            "end": 1890343,
            "confidence": 0.5056153846153847,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Rechne du mal Jahresgehalt durch 2022. Weil es ganz interessant ist, wie man das rechnet. Also nehmen wir mal an, ein durchschnittlicher Entwickler, das haben wir ja auch kürzlich gerade getweetet, bekommt 66.000 brutto im Jahr. Wenn man jetzt das dazurechnet, was der Arbeitgeber noch zusätzlich an Abgaben zahlt, ich rechne das jetzt mal mit 30 Prozent ungefähr ein, was der zahlt an Versicherungen und anderen Abgaben, Und wenn man das jetzt dividiert durch die 222 aktiven Tage, die man wirklich hat in einem Jahr, durch 8 Stunden, dann kommt man bereits auf 48 Euro. Also 48 Euro Stundenlohn. Viele Menschen vergessen das, dass das wirklich unter Umständen schon sehr hoch ist, was die eigentlich pro Stunde verdienen. Und als Selbstständiger musst du ja dann noch deine Versicherung selber zahlen. Du musst womöglich eine Ausfallversicherung zahlen. Du musst Pensions-, Rentenversicherung zahlen. Du brauchst einen Buffer. Was ist, wenn du eine Woche später deinen Job verlierst für zwei Monate? Du brauchst vielleicht eine Haftpflichtversicherung. Also wenn man das alles mitrechnet, dann ist man sehr schnell auf so einem Stundensatz von 100 Euro und was eher üblicher ist, so im deutschsprachigen Raum, ist schon eher über 100 Euro mittlerweile für einen normalen Entwickler. Aber man darf eben nicht vergessen, dass da im Hintergrund viele Abgaben liegen, die man noch tätigen muss. steuern und so weiter und die muss man natürlich auch mitberechnen, wenn man wirklich so einen Preis definiert. Also ein Anfängerfehler ist glaube ich ganz oft, dass man sich der Unterwert verkauft und da sollte man im Vorhinein wirklich darauf achten, dass man da schon einen sinnvollen Preis hat, wo man dann auch gut damit leben kann.",
            "start": 1890560,
            "end": 1996292,
            "confidence": 0.816347826086956,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Verlangst du andere Preise für andere Arten von Freedancing? Beispiel, du musst programmieren, Preis A, du gibst Consultancy, Preis B?",
            "start": 1996984,
            "end": 2004832,
            "confidence": 0.7840999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, natürlich. Also ist ganz klar, wenn jetzt jemand quasi auf mein Wissen zurückgreifen will, was ich in den letzten 30 Jahren angehäuft habe, dann sollte das ja mehr wert sein, als wenn ich jetzt irgendeine simple JavaScript-Umsetzung mache, um aus der Zwischenablage irgendwas, wenn was kopiert wird, was hinten dran.",
            "start": 2004872,
            "end": 2021208,
            "confidence": 0.7792745098039219,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kurzer Einwand, die Wände, war 32 bis 33 Jahre her, nicht 30 Jahre. Kannst du sagen, was du aktuell so aufrufst pro Stunde?",
            "start": 2021689,
            "end": 2029651,
            "confidence": 0.7690869565217391,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich habe gerade kürzlich ein bisschen Research gemacht, weil ich auch wieder jetzt eben mehr Freelance als früher und meine Preise ja auch irgendwie nicht mehr up to date sind. Daher weiß ich eben, dass wirklich für Programmierer, Jobs, klassische Programmierer auf jeden Fall 100 Euro plus drin sind und Berater Tätigkeiten gehen dann auf jeden Fall in Richtung 150 Euro, würde ich mal sagen, so in dem Bereich. Kommt aber wirklich immer darauf an, wer ist der Kunde? Ist es ein Bestandskunde? Wie groß ist das Projekt? Das macht natürlich einen Unterschied, wenn ich jetzt nur einen Tag bei einem Kunden bin und dem möglichst viel von meinem Wissen vermittle in einem Tag oder wenn das ein großes Projekt ist, wo man irgendwie über drei Monate zusammenarbeitet, dann macht man denen natürlich auch einen besseren Preis und geht mit den Stundensätzen dann schon ordentlich runter, würde ich sagen, weil das einfach dementsprechend ein großes Projekt ist. Aber nach oben hin gibt es sowieso keine Grenzen. Und man kann sich das auch sehr gut anschauen. Es gibt von diversen Plattformen so Rechner, so Stundensatzrechner oder wo man sich so ein bisschen informieren kann, was andere verlangen oder wie viel so gezahlt wird in verschiedenen Bereichen. Das können wir gerne noch verlinken. Einen gibt es von Gulb oder Galb, wie man es auch immer ausspricht. Der ist eigentlich sehr, sehr gut und gibt eine gute Übersicht über solche Tätigkeiten. Im Beraterumfeld ist es ein bisschen schwieriger, einen sinnvollen Preis zu finden. Aber ich würde sagen, man braucht da jetzt keine Angst haben, wenn man der Firma wirklich Mehrwert liefern kann, dass man da 150 Euro zum Beispiel pro Stunde ansetzt. Das sollte überhaupt kein Problem sein, wenn die Firma wirklich dieses Wissen verwenden kann. Wenn man denen, wie gesagt, nur irgendwie JavaScript programmiert, dann ist es die Frage, vielleicht heutzutage auch, weil es einfach so wenig JavaScript Programmierer gibt, Aber je nachdem, wie komplex eben so ein Projekt ist oder die Anforderungen von der Firma, kann man dann schon höher gehen. Aber wie gesagt, ich würde mal sagen, unter 80 Euro würde ich eigentlich auf keinen Fall arbeiten als normaler Entwickler. Zumindest, wenn man einige Jahre schon Erfahrung hat.",
            "start": 2030177,
            "end": 2153519,
            "confidence": 0.7896612466124661,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Spielt die Programmiersprache, in der du programmierst, eine Rolle für deine Preisfindung? Also, ich weiß jetzt nicht, ob du SAP ABAP kannst oder COBOL, aber ich kann mir schon vorstellen, umso weniger Leute es gibt, die das programmieren, die können dann mehr chargen. Also spielt das für dich eine Rolle, wenn du PHP oder Go oder JavaScript oder Rust oder Python schreibst?",
            "start": 2153895,
            "end": 2174083,
            "confidence": 0.7358387096774193,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich persönlich programmiere eigentlich kaum mehr. Insofern kenne ich jetzt keine konkreten Zahlen, aber ich kann mir schon gut vorstellen, dass es da höhere Werte gibt, wenn eine Sprache, also wenn es einfach schwieriger ist, Leute zu bekommen. Und darum habe ich auch JavaScript erwähnt, weil Es suchen so viele Leute JavaScript-Entwickler, dass mittlerweile JavaScript wirklich hoch bezahlt wird. Es ist einfach ein ganz klassischer Markt mit Nachfrage und Angebot. Und wenn du einen COBOL-Entwickler oder einen JavaScript-Entwickler suchst, dann musst du wahrscheinlich tiefer in die Tasche greifen, ganz klar.",
            "start": 2174408,
            "end": 2205000,
            "confidence": 0.7901666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, auf jeden Fall ein sehr, sehr spannendes Thema. Was ist der richtige Preis? Und auch sehr, sehr spannend, was du angesprochen hast, dass du deine Preise hier und da mal überprüfst und Research machst. Ich bin gespannt auf die Links in den Show Notes. Bevor wir mal zum nächsten Punkt kommen, wie man das Ganze denn mal umsetzen kann. Wie kann man starten? Wie sieht sowas rechtlich aus? Was muss ich beachten? Kurze Frage, wie ist dein Bierstatus?",
            "start": 2205866,
            "end": 2229004,
            "confidence": 0.7340632911392406,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, geht so.",
            "start": 2229824,
            "end": 2230805,
            "confidence": 0.5163333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich würde sagen, mach mal leer, hol mal neu.",
            "start": 2230825,
            "end": 2232326,
            "confidence": 0.48839999999999995,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, dann stell mal eine Frage in der Zwischenzeit.",
            "start": 2232807,
            "end": 2234428,
            "confidence": 0.5872222222222222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir haben jetzt über die positiven und negativen Seiten gesprochen. Erzähl mir doch mal, wie ich jetzt loslegen würde. Wie setze mir das Ganze in die Praxis um? Wie kann ich selbstständig werden? Ich bin Festangestellter. Das war ich die letzten 12, 13 Jahre. Bin es immer noch. Was muss ich tun, um um die Selbstständigkeit zu kommen? Vielleicht im deutschen Raum oder im österreichischen Raum. Ich glaube nicht, dass sich da so viel unterscheidet. Nenn mir mal ein paar Rahmenbedingungen.",
            "start": 2234680,
            "end": 2257048,
            "confidence": 0.7238641975308643,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nachdem ich ja weiß, dass du nicht nur fest angestellt bist, sondern auch noch nebenbei selbstständig und zumindest Gewerbe hast, kannst du ja die deutsche Seite mal abdecken. Wie hast du damals gegründet oder dieses Gewerbe angemeldet? War es kompliziert oder war es einfach für dich? Dann kann ich mal die österreichische Seite erklären, weil ich kenne mich nur in Österreich aus, um ehrlich zu sein in dieser Beziehung.",
            "start": 2257608,
            "end": 2280277,
            "confidence": 0.7379565217391302,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, ich muss sagen, ich habe limitierte Erfahrungen im Freelancer-Dasein. Ich habe ein kleines Gewerbe für Software- und Hardware-Entwicklung und Beratung, weil in einem deutschen Gewerbe muss man einen Grund angeben bzw. eine Tätigkeit, das, was man macht. Das bedeutet, wenn ich jetzt einen Kiosk eröffnen würde, dürfte ich das nicht über mein aktuelles Gewerbe machen. Kleiner Pro-Tipp kam von meinem Steuerberater. Halte diese Tätigkeit von dem Gewerbe so generell wie möglich, dann kann man auch recht viel darunter verpacken. Pro-Tipp Ende. Was ich gemacht habe, ich habe ein deutsches Gewerbe angemeldet, ein Kleinunternehmergewerbe, hat mich 10 Euro gekostet, bin ich zum Bürgerservice gegangen, zum Bezirksbürgeramt, habe es angemeldet und damit bin ich eigentlich berechtigt Rechnungen zu schreiben unter einem gewissen Paragrafen der Kleinunternehmerregelung und ich darf pro jahr bis zu 22.000 euro umsatz machen ohne umsatzsteuer abzuführen das ist muss ich zugeben erstmal eine ganz große ist eine hausnummer die muss man erst mal erreichen.",
            "start": 2280687,
            "end": 2345601,
            "confidence": 0.8067884615384612,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das heißt, es sind dann pro Monat 2000 Euro.",
            "start": 2345903,
            "end": 2349925,
            "confidence": 0.4911111111111111,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn man mal jeden Monat was macht, genau. Aber also ich für meinen Teil jedes Quartal mal ein bisschen was oder ein halbes Jahr mal was, eine kleine App für irgendwen oder ein bisschen Beratung, Architekturreview von der Infrastruktur oder ähnliches. Immer so in größter Ordnung ein bis drei Tage so maximal und dann kommt man da bei weitem auch nicht dran.",
            "start": 2349945,
            "end": 2372239,
            "confidence": 0.7795161290322578,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei man jetzt sagen muss, wenn man wirklich all in geht und davon leben will, dann sollte man hoffentlich über diese Grenze schießen, weil wir reden da ja immer von Bruttobeträgen. Das heißt, das was man wirklich dem Kunden verrechnet und im Idealfall hast du natürlich mehr als 2.000 Euro pro Monat Umsatz, weil du ja die ganzen Versicherungen und alles zahlen musst, damit am Ende noch genug für dich rausschaut. In Österreich ist die Grenze sogar höher, da kann man bis 35.000 Euro pro Jahr Umsatz machen, bis man umsatzsteuerpflichtig wird.",
            "start": 2372554,
            "end": 2408842,
            "confidence": 0.8426521739130435,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehr, sehr unternehmerfreundliches Land, dieses Österreich.",
            "start": 2408862,
            "end": 2412507,
            "confidence": 0.8038333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielleicht noch nachgeschossen. Die Anmeldung ist ähnlich in Österreich. Keine Ahnung mehr genau, was der Gewerbeschein kostet. Irgendwie 100 Euro oder so. Wenn man ein eingetragenes Unternehmen im Firmenregister haben will, dass man also auch einen eigenständigen Namen vergeben kann, dann kostet es ein bisschen mehr. Braucht man glaube ich sogar einen... Wie heißen diese Typen, die nur Geld verlangen für das, dass sie die Unterschrift kontrollieren?",
            "start": 2412527,
            "end": 2436824,
            "confidence": 0.786507462686567,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Notar.",
            "start": 2436864,
            "end": 2437224,
            "confidence": 0.636,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Danke, Notar. Braucht man Notar und dadurch wird es natürlich teurer. Ist aber alles nicht nötig, wenn man einfach schnell los starten will. Du hast jetzt ein paar Mal den Steuerberater erwähnt. Braucht man einen Steuerberater?",
            "start": 2437924,
            "end": 2449767,
            "confidence": 0.735388888888889,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also man braucht erstmal keinen Steuerberater. Man kann das auch alles selbst machen. Ich meine, es gibt ja noch etliche Steuerhilfeprogramme. In Deutschland gibt es ELSTER, auch gar nicht so schlecht. Aber ich habe einen Steuerberater und ich muss zugeben, ich weiß, ich zahle da nicht monatlich rein, sondern ich kriege immer so eine Jahresrechnung. Aber da fallen noch ein paar andere Positionen mit rein. Deswegen kann ich das so gar nicht sagen, was man für eine Selbstständigkeit macht. Aber das müsstest du wissen zumindest, was man in Österreich für einen Steuerberater zahlt, oder?",
            "start": 2450372,
            "end": 2478562,
            "confidence": 0.7354148936170211,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich habe auch mal für einen deutschen Steuerberater gezahlt, wie ich in Deutschland gelebt habe. Da habe ich für einen deutschen und einen österreichischen Steuerberater gezahlt. Also ich bin auch der Meinung, ein Steuerberater kann dir extrem viel abnehmen. Du kannst es selber machen. Und in Deutschland ist es vielleicht sogar ein bisschen einfacher, weil die Elsta-App wesentlich besser ist als in Österreich. Aber man darf das nicht vergleichen mit dieser normalen Steuererklärung oder mit dieser Arbeitnehmerveranlagung, wie sie in Österreich heißt, also wenn man normal angestellt ist und da irgendwie dann am Ende des Jahres ein paar Sachen deklariert. Es ist schon wesentlich komplizierter mit einem Gewerbe, aber es ist auch nicht super kompliziert. Aber ich wollte einfach, dass ein Steuerberater da drüber schaut, Man hat einfach weniger Probleme, die können einem Tipps geben. Das heißt, das ist normal gut investiertes Geld und man kann da schon um ein paar hundert Euro, glaube ich, einen Steuerberater bekommen für ein kleines Unternehmen. Das geht natürlich nach oben hin auch wieder offen, aber ich würde mal sagen 500 Euro bis 1000 Euro. kriegt man normal ganz gute Hilfe von einem Steuerberater. In Österreich, ich glaube auch in Deutschland ist es so, hat man auch den Vorteil, wenn es über einen Steuerberater geht, dann muss man die Steuererklärung viel später machen. Man hat nicht mehr dieses Problem, dass man bis März eine Steuererklärung machen muss, sondern durch den Steuerberater verlängern sich diese ganzen Fristen. Und das kann ich eigentlich nur jedem empfehlen, weil man da einfach viel zurückbekommt normalerweise über dieses Wissen, wie wir schon geredet haben. Wenn man als Berater arbeitet und dieses IT-Wissen weitergibt, so ist es halt auch bei Steuerberatern. Die machen das seit Jahrzehnten und die können dir einfach auf diese ganzen kleinen Fehler hinweisen und man hat dann einfach weniger Probleme. Und vor allem, wenn man sich nicht diese Gedanken ständig machen will, was ist mit diesen Steuern und was für Formulare und diese ganzen Abkürzungen. Also ich persönlich bin eigentlich sehr froh einen Steuerberater zu haben oder in meinem Fall eine Steuerberaterin.",
            "start": 2478842,
            "end": 2587520,
            "confidence": 0.7817146974063403,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Fristverlängerung gibt es in Deutschland ebenfalls, sehr vorteilhaft. Du hattest gerade 500 bis 1000 Euro genannt, pro Monat, pro Jahr, pro Quartal, pro welchen Zeitraum reden wir da?",
            "start": 2587560,
            "end": 2596555,
            "confidence": 0.6964827586206896,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das die CSV-Datei am Ende runterladen und macht dann die Feinarbeit sozusagen. Aber es gibt natürlich auch dieses Modell, habe ich gerade von einem Freund gehört, das liegt so bei 1.500 Euro. Den schickt man einfach auch die ganzen Rechnungen bei E-Mail und der macht die Buchhaltung und alles. Also da schickt man einfach die Rechnungen weiter und alles wird erledigt von dem Steuerberater slash Buchhalter. Also das ist, wenn man diese Service in Anspruch nimmt, wird es natürlich teurer, aber dann hat man sozusagen alles ausgelagert.",
            "start": 2597386,
            "end": 2639745,
            "confidence": 0.8022413793103452,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir wollen jetzt keine Werbung für diverse Steuerberater machen, doch diese Art von Job kann euch wirklich Tipps geben, was ihr absetzen könnt, sei es Bücher, sei es IT-Equipment, wie ihr das am besten absetzen könnt, Reisekosten, wenn ihr mal zu einem Kunden reist oder vielleicht auch sogenannte Geschäftsessen. Es ist nämlich nicht so, dass man einfach jedes Essen mit Freunden als Geschäftsessen buchen kann, sondern redet da mal mit eurem Steuerberater drüber bzw. überlegt euch das.",
            "start": 2640188,
            "end": 2666947,
            "confidence": 0.80587012987013,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und was ich auch noch aus Erfahrung sagen kann, das Finanzamt macht ja auch Steuerprüfungen und die Steuerprüfungen werden normal zumindest in Österreich angetriggert von der Software, die Fehler findet. Das heißt, wenn irgendwas komisch ist in dieser Steuererklärung, dann bekommst du eine Steuerprüfung oder halt zufällig. Steuerberater kennen sich dann natürlich auch ganz genau aus, was kann man wirklich deklarieren, wo muss man aufpassen, wie funktionieren diese Algorithmen beim Finanzamt und so hat man dann auch weniger Steuerprüfungen am Ende und einfach ein leichteres Leben. Also das sind normal gut investierte Euro.",
            "start": 2667202,
            "end": 2705907,
            "confidence": 0.8296236559139784,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Stellt euch einfach mal die Frage, worum wollt ihr euch primär kümmern? Wollt ihr euch um eure Fachexpertise kümmern? Die Selbstständigkeit an den Start bringen? Oder wollt ihr einen nicht-essentiellen Anteil eurer Arbeit vielleicht den Steuern widmen? Das ist so eine Art, ich vergleiche es immer ein bisschen mit Make-or-Buy. Kaufe ich, nutze ich jetzt GitHub als Versionskontrollsystem und zahle ich da ein paar Euro und nutze es einfach? Oder packe ich Arbeit rein und hoste mein eigenes GitLab oder meinen eigenen Git-Server?",
            "start": 2706267,
            "end": 2735954,
            "confidence": 0.7030120481927711,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich würde es einfach ganz, ganz hart kalkulieren. Wenn du sagst, du hast einen Stundensatz von 100 Euro, wie lange, wie viele Stunden musst du investieren in diese Buchhaltung, in diese Steuerberatung, bis du dieses Formular, was wirklich kryptisch ist, ausgefüllt hast? Und ist es billiger, jemanden zu zahlen und die Stunden einfach für deine Projekte zu investieren? Oder ist es billiger, wenn du selber die Steuererklärung machst? Ganz abgesehen davon von deinem Interesse. Aber das ist normalerweise auch sehr einfach zu kalkulieren und in den meisten Fällen, wenn man sich ehrlich ist, dann ist es normalerweise billiger, einen Profi anzustellen.",
            "start": 2735974,
            "end": 2771316,
            "confidence": 0.8290396039603962,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, Steuerberatungskosten kommen nochmal oben drauf. Wir haben gerade ein bisschen über gegebenenfalls Umsatzsteuerpflicht gesprochen, Kleinunternehmerregelungen nicht. Wie sieht es denn mit Versicherungen aus? Welche Versicherung braucht man? Was kosten die?",
            "start": 2771737,
            "end": 2786308,
            "confidence": 0.7691290322580645,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube in Deutschland gibt es ja keine Versicherungspflicht. In Österreich ist man automatisch Pflichtversichert, wenn man selbstständig ist. Aber es macht natürlich Sinn, sich kranken zu kranken zu kranken zu versichern kranken zu versichern kranken zu versichern. Also es macht Sinn, eine Krankenversicherung zu haben. Manchmal macht es auch Sinn, eine Ausfallversicherung zu haben. Was ist, wenn man krank ist? Weil man kann sich halt nicht klassisch krank schreiben, vor allem wenn man, wenn man länger krank ist. Pensions Rentenversicherung klarerweise. Es gibt dann auch noch so Spezialversicherungen. Man kann sich als Entwickler seine Finger irgendwie höher versichern lassen, zum Beispiel, wenn man sich die Finger bricht. Was man auf jeden Fall im Hinterkopf behalten muss, ist, dass man 40 Prozent von seinem verdienten Geld abgeben muss. Wenn man Umsatzsteuerpflichtig ist, dann muss man noch Umsatzsteuer draufrechnen. Das ist glaube ich in Deutschland 19 Prozent, in Österreich 20 Prozent. Da muss man auch das abführen. Das heißt, über die Hälfte geht dann direkt an den Staat. Das muss man sich auch bewusst sein. Ist nicht so das große Problem, weil man das ja mit einrechnen kann und oben drauf kommt. Aber, was man nicht machen darf, ist dieses Geld ausgeben in der Zwischenzeit. Weil meistens kommt das Ganze halt eher am Ende des Jahres oder zumindest Quartalsweise und plötzlich will der Staat 50% von deinem Geld haben. Und das muss man sich halt im Vorhinein auch immer mit einrechnen und das muss man halt auch als Buffer aufbehalten. Also man kann schon rechnen 50% oder 40% würde ich mal sagen vom Nettoeinkommen oder vom Nettoumsatz sollte man aufbehalten für den Staat.",
            "start": 2786348,
            "end": 2876563,
            "confidence": 0.8147875457875458,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Thema Versicherung, ich habe mir von einem Bekannten sagen lassen, der überlegt sich, der ist auch selbstständig, der hat die Selbstständigkeit begonnen, ist aus Trivago raus und macht jetzt seit einem Jahr, anderthalb irgendwie sowas. Auf jeden Fall hat er mir von einer Versicherung erzählt, worüber er nachdenkt, dass wenn er in einer Firma angestellt ist als Freelancer und das Produktionssystem abschießt, weiß ich nicht, einfach mal die Datenbank löscht oder ähnliches, dagegen kann man sich auch versichern lassen. Muss ich gar nicht.",
            "start": 2876944,
            "end": 2904378,
            "confidence": 0.752192771084337,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist wahrscheinlich eine Haftpflichtversicherung. In manchen Gewerben ist es sogar Pflicht. Als Rechtsanwalt meines Wissens zum Beispiel brauchst du solche Versicherungen und kann durchaus Sinn machen, gerade wenn man in so einem Umfeld tätig ist. Wobei dann würde man auch überlegen, ob man sich nicht vielleicht eine GmbH überlegt, um das einfach professioneller aufzusetzen, wenn man jetzt zum Beispiel Software entwickelt für Flugzeuge oder sowas. sofern das möglich ist als Einzelperson. Aber da kann man natürlich schon viele Sachen noch versichern und abdecken.",
            "start": 2904418,
            "end": 2935389,
            "confidence": 0.8278192771084337,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Erklär mal ganz kurz, warum du eine GmbH erwähnt hast.",
            "start": 2936290,
            "end": 2939351,
            "confidence": 0.6039,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mit einer GmbH hast du einfach weniger Haftung und hast dein privates Risiko minimiert, weil sonst gibt es ein Durchgriffsrecht auf dein Privatvermögen, wenn du zum Beispiel eben irgendeinen Flugzeugabsturz provozierst mit deiner Software. Dann haftest du natürlich persönlich dafür und mit einer GmbH kannst du das Risiko Minimieren. Nicht vollständig minimieren, aber du kannst es zumindest reduzieren. Wenn du wirklich vorsätzlich gehandelt hast, hast du trotzdem ein Problem. Aber du kannst es zumindest reduzieren.",
            "start": 2939391,
            "end": 2968902,
            "confidence": 0.7724266666666669,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt reden wir natürlich von dem worst worst worst case. Also ich muss zugeben, ich kenne keine Person, die irgendwie diesem Szenario auch nur mal nahe gekommen ist. Aber ja, du hast schon gesagt, hast schon richtig gesagt, ob man überhaupt als Einzelperson mit einer OG, mit einem kleinen Gewerbe, überhaupt an Flugzeugsoftware darf, weiß ich jetzt auch nicht. Müssten wir mal Boeing fragen. wenn wir also einen boeing-mitarbeiter in der hörerschaft haben würde uns das gern mal interessieren aber ansonsten interessant interessant also ist man muss eine ganze menge beachten welche kosten man vorhalten muss wann diese fällig werden steuer rückerstattung oder steuerzahlung ich glaube jährlich in deutschland sind umsatzsteuerzahlungen umsatzsteuer voranmeldungen am quartalsweise man muss auf jeden fall da ein bisschen mit seinem geld jonglieren vielleicht sogar ein geschäftskonto macht auf jeden fall glaube ich so oder so sinn dass man das von seinen privaten trend hast du hast du ein geschäftskonto.",
            "start": 2969335,
            "end": 3022980,
            "confidence": 0.7664935064935068,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Habe ein quasi Geschäftskonto. Ich bin kein großer Fan von diesen Geschäftskonten, weil die sind extrem teuer. Die Banken lassen sich das zahlen und bisher bin ich ehrlich gesagt mit einem Privatkonto gut ausgekommen. Wobei ich sagen muss, ich habe ein eigenes privates Konto natürlich, über welches ich die ganzen Firmensachen abwickle, aber es ist trotzdem mein privates Konto. Also man muss sich nicht diese extrem teuren, ich finde wirklich überteuerten Bankkonten zulegen unbedingt, wo man dann teilweise pro Buchungszeile zahlt und solche Dinge. Also es ist nicht unbedingt nötig. Man kann da wirklich Lean starten mit dem ganz einfachen Bankkonto und ich würde das auch nicht übertreiben. Ganz allgemein, Lean Start ist sicher gut. Man braucht kein Firmenauto zu Beginn, man braucht kein professionelles Bankkonto, man braucht nicht drei Apps, um irgendwie Buchhaltung zu machen und sonstige Dinge. Also ich würde es wirklich möglichst einfach starten und mit der Zeit kann man dann wirklich checken, wo sind Ausgaben sinnvoll, wie viel verdiene ich überhaupt, was macht Sinn.",
            "start": 3023500,
            "end": 3083137,
            "confidence": 0.8009107142857148,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe irgendwie das Gefühl, dieses Gespräch hat so einen negativen Touch aktuell, aber wir sprechen ziemlich viel über die Risiken, was man beachten muss, aber im Endeffekt bist du ja zur Zeit Freelancer, also sag ich mal so, so schlimm kann es ja nicht sein, beziehungsweise die positiven Seiten überwiegen.",
            "start": 3083682,
            "end": 3099364,
            "confidence": 0.7806862745098039,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist auf jeden Fall als IT-Mensch wie auch in der normalen Festanstellung aktuell sicher kein großes Problem Jobs und Projekte zu finden, wenn man einigermaßen delivert. Der Anfang ist immer schwer, weil man sich halt einen Kundenstock aufbauen muss. Aber was ich auch gemerkt habe, wenn du einen Kunden hast, der zufrieden ist mit dir, dann läuft es über Mundpropaganda. Und ich habe eigentlich fast alle meine Projekte über irgendwelche Connections bekommen, also jetzt kein Vitamin B, sondern einfach Leute, die gesagt haben, ja frag mal den, ich kenne jemanden. Weil grundsätzlich fragen die Leute, ja kennt ihr jemanden, der dieses Problem lösen kann? Und alle sind irgendwie auf der Suche. Ich habe auch mit einem Kunden aktuell zu tun, der war Freelancer sucht und die habe ich in meinem Umfeld gefragt, kennt ihr nicht jemanden in dem Umfeld für Our Action? Und ich kenne wirklich relativ viele Leute, die auch viele Freelancer anstellen und alle haben gemeint, ja wir haben gerade einen neuen, wir haben den jetzt fix angestellt, da ist kein Freelancer mehr und wir suchen selber nach diesen Freelancern. Also irgendwie sucht eh jeder. nach guten Leuten. Insofern sind wir als IT-Leute einfach privilegiert und es ist wahrscheinlich aktuell extrem leicht in diese Selbstständigkeit überzulaufen und Projekte zu finden. Wenn man da eine gewisse Runway hat über ein paar Monate, wo man sich über Wasser halten kann, in den paar Monaten wird man Kunden und Projekte finden, garantiert.",
            "start": 3100068,
            "end": 3182616,
            "confidence": 0.7939628099173549,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Zwei andere Wege sind, hat mir ein Bekannter empfohlen, oder ein Freund, der es gerade gemacht hat. Macht euch mal ein Profil auf freelancermap.de oder freelancermap.com, verlinken wir in den Shownotes. Das ist eine deutsche Plattform, wo Firmen Ausschreibungen machen zu Themen und da könnt ihr erstmal starten, um erstmal Kunden zu kriegen. Alternativ schaut mal auf LinkedIn oder Zing von euren ehemaligen Arbeitskollegen, die vielleicht die Firma gewechselt haben. Schreibt ihnen einfach mal eine Nachricht. Hey, sucht ihr irgendwas in dem Bereich? Einfach mal sogenannte cold messages. Aber ich meine, so cold sind die ja nicht, weil ihr kennt die Leute ja. Habt ihr mit denen zusammengearbeitet. Und ihr werdet erstaunt sein, wie viele Leute das gegebenenfalls nutzen. Hey, ja doch, für den kann ich bürgen. Der hat wirklich Expertise im Bereich JavaScript, im Bereich React oder ähnliches. Probiert das einfach mal aus. Ist gegebenenfalls eine Art und Weise, wie ihr mal an Kunden kommt.",
            "start": 3183076,
            "end": 3236072,
            "confidence": 0.707192307692308,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die besseren Leads bekommt man sicher über sein eigenes Network. Und auch wenn es nicht sofort funktioniert, die Leute haben im Hinterkopf alles selbstständig. Und wie gesagt, einen großen Auftrag, den ich mal bekommen habe, der war über einen Freund, der einfach im Krafttraining mit einem anderen war. Und der von dieser Firma war einfach verzweifelt und hat im Krafttraining gefragt, kennt ihr jemanden, der mir dieses Problem lösen kann? Und er hat gemeint, ja, frag mal den Wolfgang, der ist ein Freund von mir und ist ein langjähriger Kunde jetzt von mir einfach über diesen Weg. Also es passieren wirklich so ganz klassische Netzwerkeffekte, also das eigene Netzwerk funktioniert normalerweise am besten.",
            "start": 3236092,
            "end": 3272078,
            "confidence": 0.7801327433628318,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So hätten wir das Thema Kundenakquise auch abgehakt. Kommen wir zum letzten Punkt. Ich bin noch angestellt, du bist selbstständig. Welche Fragen würdest du mir an die Hand geben, die ich mir selbst stellen sollte, um herauszufinden, ob die Selbstständigkeit was für mich ist oder ob ich diese Selbstständigkeit mal angehen sollte? Was würdest du mir mitgeben?",
            "start": 3272498,
            "end": 3295390,
            "confidence": 0.7747017543859648,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube, es gibt zwei Bereiche, die so Killerfragen sind oder vielleicht Knockout-Kriterien sind, weil im Allgemeinen würde ich sagen, probiere es einfach. Also aktuell, wenn du im IT-Bereich unterwegs bist, kannst du es einfach probieren. Da ist relativ wenig Risiko. Die zwei Knockout Kriterien, die ich habe, sind einerseits dein persönliches Risikoprofil. Ich kenne Leute, die können einfach extrem schlecht mit Risiko umgehen. Das heißt, wenn ein Monat kein Gehalt kommt, zwei Monate kein Gehalt kommt oder du mal 50% weniger verdienst. Wenn dir jetzt schon irgendwie die Schweißperlen von der Stirn rinnen, wenn du das nur hörst, dann ist wahrscheinlich Selbstständigsein nichts für dich. Aber sonst ist man da eigentlich relativ abgesichert, wenn man in der IT unterwegs ist. Und man kann es ja einfach auch mal probieren. Man kann sich auch, während man arbeitslos ist, zum Beispiel selbstständig machen. Ich glaube, es gibt auch so Programme in Deutschland, in Österreich gibt es die auch. Wenn man selbstständig wird, braucht man sich dann auf keine Jobs mehr bewerben und wird da auch teilweise unterstützt, wenn man Arbeitslosen bekommt. Also man kann das auch einfach mal ausprobieren, aber es ist natürlich schon ein gewisses Risiko und man muss mit dem Geld umgehen können und sich vielleicht auch ein Puffer bilden, damit man da einfach ein paar Monate überlebt, wenn mal ein Kunde abspringt zum Beispiel. Dieses Risiko besteht einfach. Und der zweite große Punkt ist diese Selbstorganisation. Wenn man einfach jemand ist und das ist keine Wertung, aber ich kenne halt Leute, die einfach gerne zum arbeiten gehen, in ein Office, in einem Team arbeiten, wo recht viel vorgegeben ist, wo der Projektmanager vielleicht auch gewisse Dinge vorgibt, wo man halt einfach gerne an irgendwelchen spezifischen technischen Problemen sitzt und diese lösen will und man überhaupt kein Interesse hat an Finanzen, Steuern, Versicherung, Marketing, wie bekomme ich meine Kunden, wie kann ich dem Kunden was verkaufen, wie kann ich Angebote ordentlich schreiben, wie kann ich Schätzungen machen, wie mache ich das Projektmanagement, mein eigenes Projektmanagement, wann stehe ich in der Früh auf, um an einem Projekt zu starten. Also wenn man diese ganzen Organisationsskills einfach hasst oder nicht hat, dann ist wahrscheinlich Selbstständig zu werden auch nicht sinnvoll. Also eine gewisse Bereitschaft zur Selbstorganisation muss man einfach haben. Und es gibt einfach Leute, die wollen das nicht. Ist vollkommen okay. Die freuen sich einfach, wenn sich andere Leute in den Kopf zerbrechen über solche Dinge. Dann sollte man einfach das nicht machen. für alle, die sagen, okay, ich kann ein paar Monate überleben mit meinem Angesparten, mit meinem Arbeitslosengeld und ich kann mich selber ganz gut organisieren oder will es mal ausprobieren. All denen kann ich das eigentlich gerade aktuell nur empfehlen, weil der Arbeitsmarkt sucht nach vielen guten Leuten und insofern ist es aktuell auch gar nicht so schwierig, Kundenakquise zu machen oder Kunden zu bekommen. Und man kann es ja auch einfach mal ausprobieren und nach ein paar Monaten oder einem Jahr kann man immer noch zurückgehen in eine Festanstellung. Das ist überhaupt kein Problem, auch vom CV. Ich glaube, ganz im Gegenteil. Jeder, der selbstständig mal war, weiß, was man da lernt und was man für Qualitäten mitbringt für einen festangestellten Job. Und ich glaube, dass das im CV eigentlich eher positiv rüberkommt und nicht irgendwie ein negatives Kriterium ist.",
            "start": 3295785,
            "end": 3487093,
            "confidence": 0.8092234234234233,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich habe von Freunden und Bekannten schon jegliche Storys mitbekommen. Eine Story, die auf der einen Seite sehr positiv war. Er hatte einen relativ hohen Tagessatz angesetzt bei einem Kunden, der mal angefragt hat. Und dann ging das Projekt über sechs, neun Monate. Und diesen sehr hohen Tagessatz hat er sogar konstant über sechs bis neun Monate durchgekriegt. Muss man natürlich sagen, er hat in recht moderater Zeit sehr, sehr viel Geld verdient. Man muss aber auch sagen, und das sagte er mir, Er wollte in dieser zeit gar keinen urlaub machen weil er von diesem geld so geblendet wurde er hatte dann sozusagen so so eine art goldene handschellen an das ist natürlich dann die negative seite. Und inzwischen hat er auch erkannt kalt ist bei weitem nicht alles und er hat sich in sich ein paar wochen freigenommen hat urlaub gemacht super.",
            "start": 3487253,
            "end": 3531606,
            "confidence": 0.789703448275862,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube auch gerade bei meinen ersten Projekten oder gerade am Anfang habe ich sehr viele Überstunden gemacht und auch Wochenende reingearbeitet. Das war weniger, weil ich viel Geld bekommen habe, mehr weil meine Schätzungen schlecht waren, aber da muss man schon aufpassen. Es gibt auch niemanden, der dich warnt von einem Burnout oder von einem anderen Problem mit deinem Privatleben zum Beispiel. Also da muss man sich schon im Klaren sein, geht auch ein bisschen wieder in diese Selbstorganisation rein, dass man sich da einigermaßen im Griff hat, dass man sich nicht überarbeitet und angemessen viel Geld bekommt für seine Leistung.",
            "start": 3532832,
            "end": 3568448,
            "confidence": 0.8238932038834951,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Der andere Bekannte hat es probiert und nach vier oder fünf Monaten, oder ich glaube nach einem halben Jahr, dann gesagt, okay, der geht wieder zurück in das Angestelltenverhältnis. Primär, weil er sagte, die Akquise, der ganze Sales Part und die Selbstorganisation, die ist nicht sein Ding, er hat es ausprobiert und ist wieder zurück. Sagte aber auch, er ist sehr dankbar für die Erfahrung und sagte, dass das neues Angestelltenverhältnis zu finden, war jetzt auch nicht wirklich schwer. Ich meine, Attila werden gerade an jeder Ecke gesucht. sei es Softwareentwickler, sei es Projektmanager, Datasign, Dataanalysten, Designer. Also jeder, der, wie gesagt, so einen Freund, so schön Licht am Fahrrad hat, findet gerade einen Job.",
            "start": 3569039,
            "end": 3607445,
            "confidence": 0.7012347826086951,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielleicht noch als kleiner Tipp oder Möglichkeit, wer jetzt nicht voll all-in gehen will, man kann das natürlich auch nebenbei, neben einer Festanstellung machen. Habe ich auch gemacht. Man muss das natürlich mit dem Arbeitgeber abklären. Vermutlich hat man dann eine Klausel im Vertrag. Aber üblicherweise ist das nicht so ein Problem, wenn man nicht in der gleichen Branche tätig ist. Also wenn man bei Trivago arbeitet und jetzt vielleicht einen Preisvergleich nebenher programmiert, ist das vielleicht ein Problem oder für Booking arbeitet. Aber sonst ist das normalerweise weniger ein Problem und so kann man das mal ausprobieren, vielleicht mit ein, zwei kleinen Projekten, die man nebenher in einer Festanstellung macht, aber ich glaube, das klassische Freelancing oder wer das mal richtig ausprobieren will, der sollte schon all in gehen, um einfach mal dieses Gesamtpackage zu bekommen, aber wer mal das ausprobieren will, kann das natürlich auch nebenbei machen, ganz ohne Risiko natürlich.",
            "start": 3607465,
            "end": 3662630,
            "confidence": 0.7921176470588235,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kleiner Zusatz zum deutschen Recht. Falls ihr angestellt seid, ihr müsst das sogar beim Arbeitgeber anmelden, dass ihr eine Nebentätigkeit habt. Der Grund ist ganz einfach, dass die Freizeit und die Wochenenden zur Erholung da sind. Wenn ihr jetzt also eine Nebenbeschäftigung habt, dann arbeitet ihr da auch und könnt euch nicht erholen. Und die zweite Geschichte, die Nebentätigkeit darf das eigentliche Angestelltenverhältnis nicht negativ beeinflussen. Das sind die zwei Hintergründe.",
            "start": 3663755,
            "end": 3692657,
            "confidence": 0.8116478873239439,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube in Deutschland sind es, glaube ich, 48 Stunden, die man auch maximal arbeiten darf. Das heißt, wenn man 40 Stunden Arbeitsverhältnis hat, dann darf man nur 8 Stunden zusätzlich arbeiten. Aber wenn man selbstständig ist, überprüft ja auch niemand. Also egal, was für Stunden man da ankippt, das ist ja dann einem selber überlassen. Ist aber auch natürlich auch gefährlich mit Burnout, Überstunden und so weiter, Workaholic leben. Da muss man auch aufpassen, wenn man einen 40-Stunden-Job hat, kann man da nebenbei überhaupt noch sowas zusätzlich stemmen, weil wenn man wirklich Kundenzufriedenheit haben will, sollte man natürlich auch deliveren und das braucht halt eine gewisse Zeit und ein gewisses Commitment und wenn man sich dann am Wochenende, wo man lieber nicht am Computer sitzt, dann aber am Computer sitzen muss, um irgendwas fertig zu bekommen, also das sollte man schon auch immer mit bedenken.",
            "start": 3692891,
            "end": 3739536,
            "confidence": 0.791123287671233,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Fragt einfach mal eure Personalabteilung. Ihr seid nicht die erste Person, die sowas anfragt. Die können euch da ein paar Sachen zu erzählen. Und wir hoffen, die Folge hat euch etwas Lust auf das Freelancing-Thema gemacht.",
            "start": 3739776,
            "end": 3753423,
            "confidence": 0.7576944444444442,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zusammenfassend, wie gesagt, wir können es auf jeden Fall empfehlen. Probiert es aus, wenn ihr das machen wollt. Startet Lean, macht euch nicht zu viel Gedanken darüber, was man jetzt wirklich machen muss steuertechnisch. Man lernt es am Weg. Achtet immer darauf, dass ihr nicht zu viel arbeitet, dass ihr genug Buffer am Weg mit einplant. Und ich glaube alles andere ergibt sich eigentlich auch am Weg bzw. lässt sich auch ganz einfach googeln. Aber man braucht sich da nicht den Kopf zerbrechen, dass das irgendwie ein extrem großes Projekt ist, um ein Gewerbe zu starten oder um selbstständig zu sein. Also das ist relativ easy und man kann da einfach loslegen.",
            "start": 3753443,
            "end": 3792082,
            "confidence": 0.8396875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war's von uns für heute. Wie immer gilt Feedback an stetisch at engineeringkiosk.dev oder über Twitter ENG Kiosk.",
            "start": 3792102,
            "end": 3800671,
            "confidence": 0.7417368421052631,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wir hoffen natürlich auch, dass wir auf Twitter eure Erfahrungen lesen können. Falls ihr zum Beispiel in die Selbstständigkeit gegangen seid oder aktuell überlegt oder ob ihr sonst irgendwie Erfahrungen in dem Bereich habt. Wie gesagt, wäre sehr hilfreich. Es lesen auch einige mit auf Twitter. Und ich glaube, es freuen sich auch alle über nette Geschichten und Erfahrungsberichte von euch.",
            "start": 3801080,
            "end": 3821636,
            "confidence": 0.8249193548387094,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bis bald.",
            "start": 3821677,
            "end": 3822217,
            "confidence": 0.5685,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Tschüss. Ciao. Und wir stoßen noch an Andi, oder? Prost.",
            "start": 3822237,
            "end": 3825840,
            "confidence": 0.7123999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So, Intro musst du leider machen, der Hund muss raus, ich hab schon Mecker bekommen hier.",
            "start": 3831036,
            "end": 3834272,
            "confidence": 0.6615625,
            "channel": null,
            "speaker": "B"
        }
    ],
    "confidence": 0.7874863284763445,
    "audio_duration": 3841.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}