{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/62eae97a-f058-4352-97a2-d2bc5c48b688/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62bqlot5uu-8cdf-4db4-8324-f618577c9873",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Neuer Aufnahmetermin, neues Engineering-Kiosk. Hallo Wolfgang.",
      "start": 5642,
      "end": 9366,
      "confidence": 0.7546666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Einen schönen guten Abend.",
      "start": 9626,
      "end": 10867,
      "confidence": 0.384,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir nehmen mal wieder zu einer Uhrzeit auf, die dir besser passen sollte. Ist ja schon ein Running Gag geworden. Normalerweise haben wir immer morgens aufgenommen. Heute haben wir Montagabend, pünktlich 20 Uhr, kurz vor der Tagesschau. Passt dir besser.",
      "start": 10907,
      "end": 24739,
      "confidence": 0.7879250000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Super aktuell noch dazu. Also wenn ihr das hört oder nachdem es veröffentlicht worden ist, ist das Podcast weniger als 24 Stunden alt. Also so top aktuell waren wir noch nie, aber wir haben ja auch ein top aktuelles Thema heute.",
      "start": 25357,
      "end": 37435,
      "confidence": 0.7941219512195121,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was viele Hörer nicht wissen, dass der Wolfgang und ich uns auch neben unserem wöchentlichen Aufnahmetermin privat unterhalten. Und eine ganze Zeit lang hat die Corona-Pandemie unsere Gespräche bestimmt, wo der Wolfgang jetzt auch persönlich von betroffen war.",
      "start": 37972,
      "end": 50656,
      "confidence": 0.8303421052631579,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, wir haben jetzt auch die Corona-Pandemie abgeschlossen, wie die Regierung in Österreich offiziell. Nettes Fact am Rande. Die Contact-Tracing-App, die es ja auch in Österreich gibt, wurde jetzt offiziell abgeschalten. Also auch die gibt es nicht mehr. Die Pandemie wurde wirklich beendet. Und nachdem ich jetzt Corona auch eingefangen habe letzte Woche, ist sie auch für mich mehr oder weniger beendet vorerst mal. Und ich möchte dazu sagen, jetzt nicht bei Apres-Ski eingefangen, weil ich gehe ja nie zu Apres-Ski-Aktionen, wie wir seit letzter Episode wissen. Und fälschlicherweise, wie er letzte Episode behauptet, Österreicher kennen keinen Après-Ski. Ich habe dann böse Meldungen bekommen, dass es natürlich sehr wohl Österreicher gibt, die Après-Ski mögen. Andi, du hast Glück. Es gibt auch Österreicher, die Après-Ski mögen.",
      "start": 50696,
      "end": 92781,
      "confidence": 0.7764639999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Somit hat die österreichische Corona-Durchseuchung nun auch Innsbruck erreicht. Hoffen wir, wünschen wir ihm gute Besserung.",
      "start": 92841,
      "end": 100682,
      "confidence": 0.8161875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Danke. Ich bin am Weg auf jeden Fall der Besserung. Vielleicht hört man es noch in meiner Stimme. Aber dank der Impfung habe ich das ja gut überstanden. Kein Problem.",
      "start": 100722,
      "end": 108904,
      "confidence": 0.6860333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich finde auf jeden Fall toll, dass du dir trotzdem Zeit genommen hast, die Aufnahme hier heute durchzuziehen.",
      "start": 109173,
      "end": 113435,
      "confidence": 0.30883333333333335,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, es gibt ja auch ein Thema, was wesentlich wichtiger aktuell ist als Corona. Und wir haben ja auch länger diskutiert, ob wir überhaupt auf diesen Ukraine-Zug aufspringen sollen, weil Ukraine ist natürlich jetzt in aller Munde. Und die Frage ist, müssen wir halt auch noch etwas dazu beisteuern? Aber wir haben uns überlegt, dass wir da durchaus vielleicht einiges zu besprechen haben und gerade von der technischen Seite aus das ganze bisschen beleuchten könnten.",
      "start": 113936,
      "end": 139391,
      "confidence": 0.8477333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir sind kein politisches Podcast. In dieser Episode wollen wir die ganze Thematik mal von der technischen Perspektive ein bisschen durchleuchten und fangen mal direkt mit dem Wolfgang an. Wolfgang, du hast mal in ein Sabbatical Jahr gemacht und bist eine Runde rumgereist, bis Corona deine Reise beendet hat und soviel ich weiß, auf deiner Reise warst du auch mal in der Ukraine. Ist das richtig?",
      "start": 139451,
      "end": 158806,
      "confidence": 0.7934242424242424,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich war in der Ukraine, ich glaube sechs Wochen lang oder so. Und bin da auch in den ganzen Städten, die man jetzt so liest, herumgereist. Also Lviv, Kiew, Charkiv, Odessa im Süden. Also ich war da überall und ich war eigentlich damals sehr erstaunt. Man glaubte immer, die Ukraine ist irgendwie weit weg und das ist in irgendeinem Land im Osten und das ist eine andere Kategorie. Aber ich war eigentlich erstaunt, wie modern das ganze Land ist und wie weit die sind. Sie sind ja auch im IT-Bereich extrem weit und es gibt mittlerweile extrem viele Outsourcing-Firmen in der Ukraine. Und wenn man mal selber in diesen Städten war und da auch in vielen Cafés war und Leute getroffen hat, wir haben natürlich mit Ukrainern auch viel zusammengearbeitet, Andi auch, aber Wenn man mal in den Städten war, fühlt sich das natürlich auch ganz anders an. Auch wenn man so Bilder sieht vor dem Regierungspalast zum Beispiel, wenn man da einfach selber auch mal vorbeigegangen ist, ist das einfach was ganz anderes. Man sollte natürlich jetzt nicht sagen, okay, nur weil sich das westlicher anfühlt, ist das irgendwie alles schlimmer zu bewerten. Wir hatten das ja mal schon in Aleppo mit der russischen Armee kürzlich. Da hat die westliche Welt nicht so direkt drauf geschaut. Also es hat natürlich eigentlich nichts damit zu tun, ob das jetzt westlicher ist oder nicht. Aber wenn es halt direkt vor der Haustür ist, dann schaut man da einfach mehr drauf. Das ist ganz klar. Und wenn man sich das überlegt, also der Andi ist jetzt von mir, glaube ich, so um die 600 Kilometer weg und die ukrainische Grenze ist von Wien nur 450 Kilometer weg. Also eigentlich sind wir aktuell fast näher an der Ukraine als zueinander. Und der Andi hat gemeint, wir sind kein politisches Podcast, das stimmt natürlich, aber ich möchte da auch, so wie die österreichische Regierung, die erstmalserweise mal was Interessantes gesagt hat, wie sich Russland beschwert hat über die österreichische Position, weil es ja ein neutrales Land ist und Österreich dann geantwortet hat, militärisch ist Österreich vielleicht neutral, aber politisch nie neutral, wenn es um die Achtung des Völkerrechts geht. Und insofern kann man auch in manchen Bereichen, glaube ich, durchaus politisch sein, sogar wenn es um IT geht.",
      "start": 159687,
      "end": 287773,
      "confidence": 0.8029142857142865,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie sieht denn deine Informationslage aus, wenn wir Ukraine, Russland und Technologie mal miteinander verbinden? Was kommt dir da sofort in den Sinn?",
      "start": 288475,
      "end": 298439,
      "confidence": 0.8199565217391305,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also es gibt natürlich ganz viele Connections im IT-Bereich zu Ukraine, aber ganz konkret, ganz kürzlich, habe ich einen Tweet gesehen von jemandem aus der Ruby-Community, der da sehr verankert ist, der so einen Tweet geschrieben hat. Er erwartet sich auch gar nicht, dass die Welt jetzt irgendwie viel Geld schickt oder ihm zur Hilfe kommt im Krieg direkt, sondern er würde sich halt nur wünschen, dass die Spread the Word, also dass die, das übersetzt man jetzt am besten, die Informationen verbreitet werden. Das war ihm am wichtigsten. Und ich glaube, das ist auch sehr wichtig. Und was ich sehr interessant gefunden habe, ist, dass ein Freund von mir dann geantwortet hat. Es ist eh die ganze Welt schon informiert und die ganze Welt arbeitet schon daran. Auch die ganzen großen Firmen setzen sich gegen diesen Krieg ein, gegen diesen Angriffskrieg ein. Und er hat eigentlich eher hilflos gefragt, was man noch machen kann. Und es gibt natürlich auch Firmen, die einiges machen und gemacht haben.",
      "start": 298479,
      "end": 355873,
      "confidence": 0.796227544910179,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und zwar gibt es eine ganze Menge. Durch die Pandemie wurde natürlich Remote Work verstärkt und somit haben Wolfgang und ich auch ziemlich viele ukrainische, russische und belarussische Kollegen, die auf der einen Seite natürlich auch aus Deutschland und ähnlichem gearbeitet haben, aber teilweise auch aus Russland, Belarus und Ukraine. Und die diversen Firmen haben ein paar Aktionen getätigt, um natürlich ihren Mitarbeitern und inklusive den Familien zu helfen. Das ging von zum Beispiel, dass die vorhandene Jahresboni und zwei bis drei Gehälter jetzt sofort ausgezahlt haben, damit auf jeden Fall die Kreditmittel für die betroffenen Personen zur Verfügung stehen. Hilft glaube ich schon, besonders wenn man weitere Reisen finanzieren muss für nicht nur sich, sondern sich, seinen Eltern, seine Freunde und so weiter. Dann zum Beispiel ein positives Beispiel Booking. Booking hat sogar recht früh und zwar am 23. Februar, das war noch vor der Invasion, bereits eine E-Mail rundgeschickt mit Details, wie man zum Beispiel umzieht in andere Länder und auch wie Booking selbst dafür unterstützt. Dann gibt es eine Firma, die hat ein Safehouse in der westlichen Ukraine eingerichtet für alle ukrainischen Mitarbeiter dieser Firma. Man muss wissen dazu, dass in der westlichen Ukraine die Beschüsse und Raketen wohl nicht so stark sein sollen, beziehungsweise kaum sein sollen. Das ist so meine Information aktuell.",
      "start": 355913,
      "end": 452727,
      "confidence": 0.8488433179723506,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Noch zumindestens. Das kann sich natürlich noch ändern.",
      "start": 453167,
      "end": 455389,
      "confidence": 0.7953749999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, noch zumindestens. Dann generell ist halt das meiste, was die Firmen machen, ist aktiver Support für den Umzug, finanzielle Mittel zur Verfügung stellen und ja, halt sowas wie ein Safehouse. Das große Problem ist aber, dass Männer in der Ukraine zwischen 18 und 60 Jahren, glaube ich, die Ukraine gar nicht mehr verlassen dürfen, weil da werden sie vom Militär eingezogen, weil sie benötigt werden, um die Invasion zu stoppen.",
      "start": 455869,
      "end": 483394,
      "confidence": 0.8212535211267605,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da kenne ich übrigens auch eine Geschichte von einem, der in Holland arbeitet und nur zu Besuch war auf Urlaub, zu Hause in der Ukraine und genau in diese Zeit reingefallen ist. Und jetzt kann er, darf er einfach nicht mehr ausreisen und hängt jetzt in Kiew fest. Also es betrifft natürlich auch Leute, die Staatsbürger sind, aber nur zufällig jetzt dort gewesen sind und gar nicht dort wohnen.",
      "start": 483674,
      "end": 506773,
      "confidence": 0.8257971014492753,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Firmen, die nicht so viele Mitarbeiter in der Ukraine haben oder keine Büros haben, versuchen natürlich auch zu supporten. Zum Beispiel Google, Trivago oder Ivan. Die haben ihre Mitarbeiter aufgerufen, doch mal an diverse Foundations zu spenden, um finanziellen Support für die Ukraine zu leisten. Und jeder Mitarbeiter, der was spendet, die Firma verdoppelt dann den Spendenbetrag. Das ist natürlich auch eine nette Geste, um die Menschen in der entsprechenden Region zu supporten.",
      "start": 507253,
      "end": 538001,
      "confidence": 0.8314520547945204,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es stimmt natürlich, Geld ist immer gut und ich glaube, es kann jeder so helfen. Aber was mich auch ein bisschen stört und ich muss dazu sagen, es kommt jetzt vielleicht vielen bekannt vor, alle die den Doppelgänger-Podcast hören und das gerade kürzlich gehört haben, haben das vielleicht auch schon gehört in Pip seine Rant zu den großen GAFA-Konzernen. Und dem kann ich eigentlich nur beipflichten, also wir verlinken das gerne, weil es natürlich auch ein bisschen scheinheilig ist, dass diese großen Unternehmen nur unter Anführungszeichen Geld spenden, weil die eigentlich extrem viel Macht hätten. Und wenn sie die Macht zum Beispiel verwenden würden, um die richtigen Informationen nach Russland zu bringen, oder damals, bevor sie gesperrt wurden, mittlerweile sind sie teilweise schon gesperrt, dann hätten sie natürlich extrem viel machen können. Und so haben das zum Beispiel relativ viele User auch übernommen, diese Informationen irgendwie nach Russland zu bringen, indem sie diese Plattformen ausgenutzt, gehackt, kann man eigentlich nicht wirklich sagen, nennt sich auch Crowdstorming, indem sie zum Beispiel, keine Ahnung, auf Tinder ihre Location umgestellt haben auf Russland und so plötzlich Russen erreicht haben, denen sie dann einfach Nachrichten schicken haben können. über ihr Profil. Oder was es auch gegeben hat, ist, dass zum Beispiel aufgerufen wurde, dass man in Google Maps einfach sich russische Restaurants zum Beispiel nimmt und dort einen russischen Text reinpostet, um die Russen zu informieren, was wirklich abgeht. Google hat dann später alle Reviews gelöscht, weltweit, von den letzten Tagen, auch mit einer sehr schwindeligen Ausrede. Und ihr habt's gesehen, mein Review, ich sehe mein Review zum Beispiel noch, ich hab's mit einem Review ausprobiert, aber es ist shadow gebannt, also wenn man dann im Inkognito-Modus auf diesen Maps-Eintrag geht, taucht das Review nicht auf. Also die haben wirklich alle Reviews gelöscht. Und man muss das immer unter dem Hintergrund sehen, warum das gemacht wird. Und da kann man auch gerne einen Text verlinken von russischen Leuten, die teilweise in der Ukraine sind oder im Ausland und probieren, ihren Eltern in Russland zu erklären, was eigentlich abgeht. Und die Eltern glauben den eigenen Kindern einfach nicht und sagen, ja, aber das stimmt ja nicht oder Putin wird schon einen Grund haben und da sind ja die ganzen Nazis in der Ukraine. Also die Information erreicht wirklich viele in Russland nicht und insofern hat man diese Tricks machen müssen, um zum Beispiel irgendwelche Informationen reinzuschleusen. Und solche Plattformen wie Google oder YouTube oder Facebook könnten das natürlich auf hoher Ebene oder automatisiert einfach zum Beispiel ausspielen oder zum Beispiel einfach auf der Startseite eine Verlinkung machen über irgendeine Information zum Ukraine-Krieg, der ja nicht mal Krieg heißen darf in Russland. Meistens sagen halt die großen GAFA-Konzerne, ja, aber wir sind nicht politisch. Und da kann ich auch nur ein Argument vom BIP wiedernehmen. Ich kann das gerne auch noch mal verlinken. Ich habe das extra rausgesucht. Damals, als zum Beispiel das Leistungsschutzrecht in Deutschland diskutiert wurde oder wird, glaube ich, immer noch diskutiert, hat Google plötzlich auf der Startseite groß eine Aktion gestartet. Verteidige dein Netz. Wie willst du die Zukunft im Netz erleben und so weiter. Also da können sie plötzlich schon sehr politisch sein und Informationen auf die Startseite setzen. Aber wenn sie mal diese Macht im positiven Sinne verwenden könnten, dann ziehen sie sich wieder auf diesen Standpunkt zurück. Sie wollen neutral sein. Und das finde ich halt sehr, sehr schade, weil die werden sowieso ein paar Tage später gesperrt, wie man gesehen hat. Das heißt, sie hätten durchaus die paar Tage nutzen können, um noch die unter Anführungszeichen richtigen Informationen zu verbreiten. Und das finde ich halt Auf der einen Seite diskutiert man immer, dass diese GAFA-Konzerne sehr viel Macht haben und diese einschränken müssen. Und wenn sie mal die Macht benutzen könnten in einem positiven Sinn, dann machen sie es auch nicht, weil sie vielleicht auch Angst haben, dass sie dann zugeben, dass sie diese Macht natürlich haben. Und das finde ich eigentlich sehr schade, weil man deshalb von technischer Seite die Möglichkeit hätte, aber sie sie halt nicht genutzt haben und halt sich nur unter Anführungszeichen auf sowas wie die Spenden konzentrieren oder rauswählen.",
      "start": 538041,
      "end": 781015,
      "confidence": 0.8102097701149427,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ach Wolfgang, du weißt auch wie es ist. Die großen Firmen drehen sich dahin, wo es ihnen am besten passt.",
      "start": 781618,
      "end": 788305,
      "confidence": 0.7766,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist meistens vor allem die Seite des Geldes und da möchte ich auch noch gleich mal was loswerden, weil so viele Firmen natürlich mit ihrer Marketingabteilung oder PR-Abteilung das extrem gut verkaufen. Wasser nicht alles abschalten und dass sie Russen Services nicht mehr erlauben und so weiter. Da muss ich natürlich überlegen mit den ganzen Sanktionen, dass alle Transaktionen, zum Beispiel finanziellen Transaktionen, nicht mehr erlaubt sind. Ja, dann ist es relativ easy, weil dann kann ich auch keinen Kunden mehr in Russland haben, wenn der kein Geld zahlen kann. Dann kann ich auch einfach meine russischen Kunden sperren und das noch sehr gut verkaufen. Also das ist schon auch so eine Scheinheiligkeit. Ich möchte nur sagen, dass man da glaube ich auch aufpassen muss. Das ist so ein allgemeines Problem, kenne ich von mir selber auch, wenn man halt in dieser Domäne zu Hause ist, in der IT-Domäne und dann hört man so positive News, dass irgendwas gemacht wird. Das sollte man halt auch ein bisschen kritisch hinterfragen, warum machen die Firmen das und was könnten sie vielleicht noch machen.",
      "start": 788345,
      "end": 844229,
      "confidence": 0.7783406593406593,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Thema Sanktionen ist ein ganz gutes, ich möchte mal ganz kurz einen Überblick geben, was Firmen so gemacht haben beziehungsweise machen muss. Ja, und das speziell natürlich aus dem Tech-Bereich. Also, Facebook hat erst mal alle staatlichen Medien aus Russland verboten, irgendwelche Werbung oder irgendwelche Art monetarisierbarer Content zu schalten. Für Google genau dasselbe. Apple Pay hat seine Services in Russland komplett heruntergefahren. Intel und AMD haben aufgehört, Prozessoren in Russland zu verkaufen. Twitch und Onlyfans akzeptieren keine Zahlungen mehr von russischen Banken.",
      "start": 845479,
      "end": 890381,
      "confidence": 0.8444096385542167,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weil sie alle nicht mehr Zahlungen akzeptieren können wegen den Sanktionen.",
      "start": 890421,
      "end": 893464,
      "confidence": 0.7897272727272728,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Er ist richtig, aber es scheint wohl noch so, dass das Streaming von Twitch und Onlyfans Content in Russland noch möglich ist außer des Zahlens.",
      "start": 893725,
      "end": 902374,
      "confidence": 0.82988,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist vielleicht auch noch ein interessantes Fakt. YouTube und Google sind beide noch verfügbar. Facebook und Twitter wurde meines Wissens ja gesperrt. Und was auch sehr interessant ist, ist, dass YouTube und Google auf den Top 3 besuchten Webseiten in Russland ist. Also es ist nicht so, dass das irgendwie andere Suchmaschinen, Yandex und so weiter sind, sondern Google und YouTube sind ganz oben auf der Liste. Also die haben auch in Russland noch immer großen einfluss sind noch online und da ist halt auch die frage warum sind sie noch online vielleicht eben weil sie diese macht bisher noch nicht genutzt.",
      "start": 902905,
      "end": 937421,
      "confidence": 0.7959029126213595,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Haben jetzt gibt es aber auch noch eine thematik wenn es um geld geht wo es glaube ich ein bisschen umstritten ist und das ganze crypto space bitcoin ethereum oder ethereum etc da gibt es zum beispiel eine ziemlich große ein gut ziemlich großen mining pool von ethereum nennt sich flexpool und die haben alle Rechner und alle Compute-Resources in Russland aus ihrem Mining-Pool genommen. Das bedeutet natürlich nur neues Ethereum zu minen. Du hattest gerade über die großen Firmen gesprochen, du hattest gerade über die machen alles wegen Geld gesprochen. Was ist denn deine Meinung zu der Sache, dass Elon Musk einfach mal ein paar Starlink-Terminals rübergeschickt hat?",
      "start": 937441,
      "end": 979280,
      "confidence": 0.7866330275229357,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, finde ich natürlich extrem gut und scheinbar sind die auch angekommen im Gegensatz zu anderen Aktionen von ihm und die haben jetzt scheinbar Zugriff auf das Starlink-Netzwerk und sind damit unabhängig. Nicht so toll war wieder, dass er wenig später irgendwie erwähnt hat, dass die ganzen russischen TV-Stationen und Streams natürlich bei ihm überall online bleiben, weil er ist der absolute Verfechter der Meinungsfreiheit. Könnte man natürlich auch anders sehen, aber in dem Fall ist es, glaube ich, eh nicht so wichtig, was er da jetzt auf seinem Netzwerk macht.",
      "start": 980161,
      "end": 1013877,
      "confidence": 0.8058351648351648,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Für Leute die uns gerade noch nicht folgen können, was ist Starlink und was ist passiert? Starlink ist ein vom US Raumfahrtunternehmen SpaceX betriebenes Satellitennetzwerk, das künftig weltweiten Internetzugang bieten soll. SpaceX sollten wir inzwischen alle kennen, die Firma von Elon Musk, die wiederverwendbare Raketen baut und die Reise zum Mond und zum Mars erschwinglich machen soll. Was ist also jetzt passiert mit Starlink? Der Vizeminister vom Ministerium für Digitale Transformation hat über Twitter Elon Musk gefragt, ob er etwas, ob er Starlink Hubs bereitstellen könnte, damit die Internetverbindung in der Ukraine gesichert ist, sofern denn Russland die Internetinfrastruktur angreift. Innerhalb von elf Stunden hat Elon Musk dann zurückgetweetet, hat gesagt, Starlink ist nun aktiv in der Ukraine, die Terminals sind auf dem Postweg und ich glaube zwei Tage später waren die da auch vorhanden.",
      "start": 1014237,
      "end": 1083944,
      "confidence": 0.8811629629629628,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube es sind nur 50 Terminals oder so, also man kann nicht allzu viel damit machen, aber wenn das als kritische Infrastruktur gesehen wird, wo dann das Militär oder so drüber kommunizieren kann, ist natürlich grundsätzlich ganz interessant. Was dieser Minister interessanterweise noch gemacht hat, dieser ukrainische, klingt leider wieder etwas dümmer, würde ich fast sagen.",
      "start": 1084024,
      "end": 1105578,
      "confidence": 0.7581052631578946,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist auch gar nicht so bekannt. Das kam jetzt gar nicht so in den Massenmedien.",
      "start": 1105618,
      "end": 1110420,
      "confidence": 0.8105625000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hat der Andi wieder irgendwo gefunden. Hast du das verifiziert, dass das wieder stimmt, wenn wir schon bei Fake News sind?",
      "start": 1110460,
      "end": 1115923,
      "confidence": 0.7341363636363636,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also okay hab ich hab ich gemacht also zumindest von der Domain also entweder hat irgendjemand ikan.org gehackt und ein pdf da hochgeladen oder dass es war ich denke ich denke zweiteres.",
      "start": 1116539,
      "end": 1131176,
      "confidence": 0.8255937500000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dann erklär mal, was da abgegangen ist.",
      "start": 1131533,
      "end": 1133755,
      "confidence": 0.809142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und zwar hat derselbe Vizeminister vom Ministerium für Digitale Transformation, der ICAN geschrieben. Die ICAN ist die Internet Cooperation for Assigned Names and Numbers und die koordiniert die Vergabe von einmaligen Namen und Adressen im Internet. Kurz gesagt Top-Level-Domains, IP-Adressen und so weiter und so fort. Und zwar hat dieser Prime Minister, der IKAN, einen Brief geschrieben mit der Bitte, doch die russisch-spezifischen Top-Level-Domains abzuschalten, alle darauf spezifizierten SSL-Zertifikate zurückzuziehen und die, ich glaube, die DNS-Root-Server, die in Russland located sind, abzuschalten. Und die ICAN hat dann daraufhin eine Antwort verfasst, die sie öffentlich im Netz geteilt hat, die können wir natürlich unten verlinken, was dann eigentlich besagt, dass sie das gar nicht können, aufgrund des dezentralen Aufbaus des Internet. Was ist deine Meinung dazu Wolfgang?",
      "start": 1133815,
      "end": 1204139,
      "confidence": 0.8376190476190479,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dass er sich scheinbar nicht sehr gut auskennt und niemanden zur Verfügung hatte, der sich gut auskennt, gerade in dem Bereich. Aber es muss man auch verstehen, die haben, glaube ich, gerade andere Probleme. Versuchen halt alles Mögliche, das würde wahrscheinlich jeder in der Situation so machen.",
      "start": 1204770,
      "end": 1222018,
      "confidence": 0.8005531914893618,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir verlinken die Antwort in den Show Notes. Aber mal was anderes. Du hast gerade von den großen Firmen gesprochen. Und jetzt reden wir hier gerade über DNS und etc. etc. Wie siehst du das denn, wenn Cloudflare jetzt mal einen Move machen würde? Cloudflare, wie viel betreuen die? Für die geht ja, glaube ich, der halbe Internettraffic durch. Wenn die einfach mal irgendwas abschalten, irgendwas sperren, was wäre deine Meinung dazu?",
      "start": 1222038,
      "end": 1246777,
      "confidence": 0.7368194444444444,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich bin ja sowieso kein Freund von Sperren, wenn es um Informationszugang geht. Und ich glaube, das ist ja genau das Problem, was Russland gerade betreibt, dass sie alle ausländischen Medien aussperren und mittlerweile die ganzen Fernsehstationen ja auch in in Russland eigentlich mehr oder weniger verboten sind, weil niemand mehr Krieg sagen darf und wenn irgendwie jemand negativ berichtet über die ganze Sache, dann gibt es bis zu 15 Jahren Haft. Das heißt, die ganzen ausländischen TV-Stationen und so weiter sind mittlerweile nicht mehr in Russland und haben einfach schließen müssen. Das heißt grundsätzlich die Information, den Informationszugang zu beschränken, ist meiner Meinung nach immer eine schlechte Idee. Und das ist genau das, was Russland eigentlich macht. Und ich würde es eher umgekehrt sehen. Man sollte eigentlich allen Information geben und man muss nicht einmal unbedingt einschränken, meiner Meinung nach, filtern. Solange man auf viele Informationen Zugriff hat.",
      "start": 1247197,
      "end": 1303001,
      "confidence": 0.8252933333333331,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich denke, das Problem jetzt mit den ganzen Sanktionen ist, die ganzen europäischen und amerikanischen Services sperren jetzt ihren Zugang, weil sie es müssen. Aber im Endeffekt betrifft es halt die Zivilbevölkerung und das ist eigentlich das falsche an der ganzen Sache. Die können ja am wenigsten dafür und meines Erachtens brauchen die ja halt auch die Informationen, um die Kommunikation aufrechtzuerhalten, um ihre Auswanderung, ihre Flucht zu planen. Ich bezweifle, dass Putin und die Oligarchen Google Maps nutzen, um zu wissen, wie man nach Kiew kommt.",
      "start": 1303961,
      "end": 1337322,
      "confidence": 0.7905402298850575,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also da muss man zwei Sachen unterscheiden. Ich glaube, die Sanktionen, die es derzeit gegen Russland gibt, die sperren ja keinen Zugang zu Informationen. Das heißt, die ganze Sperrung von Facebook, Twitter und so weiter, die geht ja von Russland aus. Also es ist ja nicht so, dass die Sanktionen jetzt die Informationen nicht mehr zur Verfügung stellen. Aber du hast natürlich vollkommen recht. Die ganzen Sanktionen, die treffen natürlich auch die Bevölkerung. Und wenn jetzt zum Beispiel vor ein paar Tagen hat jetzt Master und Visa angekündigt, alle Transaktionen zu blockieren. Und 74 Prozent aller Transaktionen 2020 waren Master- und Visa-Transaktionen in Russland. Es betrifft sehr wohl die... die Zivilbevölkerung, ganz klar.",
      "start": 1337622,
      "end": 1379628,
      "confidence": 0.7804336283185842,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wie die jeweiligen Firmen auf die Sanktionen reagieren, ist ja komplett unterschiedlich. Nehmen wir jetzt mal Trivago. Trivago hat die ganze russische Plattform einfach mal abgeschaltet. Oder nehmen wir mal, ich habe heute noch gelesen, dass Netflix und TikTok ihren Zugang aus russischen IP-Adressen deutlich vermindern. Das bedeutet natürlich auch, dass TikTok auch ein Kommunikationskanal sein kann für solche Leute.",
      "start": 1379668,
      "end": 1404056,
      "confidence": 0.8128852459016395,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wobei diese Medien, ich glaube, primär von Russland schon gesperrt sind. Also die großen GAFA-Konzerne sperren nicht den Zugang zu ihren Plattformen, sondern Russland sperrt den Zugang zu den Plattformen. Aber du hast natürlich recht, wenn es um Sanktionen geht, trifft das natürlich auch die Bevölkerung. Und das ist, glaube ich, auch die Idee und der einzige, meiner Meinung nach, ich bin jetzt kein Politikwissenschaftler oder so, aber meiner Meinung nach ist da der einzige Ausweg, wenn die Bevölkerung in Russland Wind davon bekommt und nicht manipuliert wird über die Informationsmedien dort, weil sonst glaube ich schafft es niemand irgendwie Putin umzustimmen oder so. Also es kann eigentlich nur von der Bevölkerung ausgehen, aber wenn man natürlich sieht, dass ich glaube gestern 5.000 Leute verhaftet worden sind, weil sie auf die Straße gegangen sind und protestiert haben, friedlich, dann muss man sich das natürlich erstmal trauen. Und das ist schon schwierig. Und wenn man so den Spezialisten zuhört, dann kennt der Großteil in Russland diese Informationen einfach nicht und vertraut Putin. Und wie ich schon erwähnt habe, also wenn man den eigenen Kindern nicht glaubt, dann ist das schon sehr tief verankert. Und das macht die Situation natürlich überhaupt nicht leichter.",
      "start": 1404736,
      "end": 1478451,
      "confidence": 0.7987562189054724,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kommen wir mal von den großen Firmen zu den Individuen. Jetzt hoffentlich schaffen ziemlich viele Leute die Flucht aus dem Kriegsgebiet. Wie sehen denn deren Arbeitschancen hier in Europa, in der Europäischen Union aus? Weil die Ukraine ist ja kein Mitglied der Europäischen Union und Visa Requirements sind ja immer so eine Sache. Hast du da einen Überblick, wie da der aktuelle Stand ist?",
      "start": 1478891,
      "end": 1501013,
      "confidence": 0.8061562500000004,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Meines Wissens ist es vor ein paar Tagen dieses Sonderrecht, ich weiß jetzt leider nicht, wie es heißt, eingesetzt worden, das damals in der EU nach dem Jugoslawienkrieg erstellt worden ist und seitdem nie zur Anwendung gekommen ist, was einfach die Flucht erleichtert. Und die Leute können dann direkt arbeiten oder bekommen eine Arbeitsgenehmigung und auch automatisch Asyl. Oder ich glaube, sie können sogar ohne Asyl arbeiten. Also das ist alles außerhalb des normalen Asylrechts. Und das wird auch nötig sein, weil geschätzt sind ja sieben Millionen Flüchtlinge, die so die EU erwartet. Und das ist damit die größte Flucht seit dem Zweiten Weltkrieg. Wenn man das jetzt mit anderen Flüchtlingen vergleicht, man sollte da nie Vergleiche anstellen, aber es befinden sich natürlich auch sehr viele Fachkräfte darunter. Und das kann natürlich auch dem europäischen Arbeitsmarkt helfen, wenn man mal irgendwas Positives daran sieht in der ganzen schlimmen Situation. Auf jeden Fall wird es trotzdem extrem viel Solidarität brauchen in der EU und bei uns, weil sieben Millionen Leute aufzunehmen und vor allem, so wie es aussieht, wird es eine längere Aktion werden. Das Ganze wird nicht in einer Woche vorbei sein.",
      "start": 1501313,
      "end": 1573153,
      "confidence": 0.8391718750000008,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kommen wir mal zu der Frage, was ihr als Hörer denn tun könnt, und zwar? Wolfgang, wie würdest du jemandem, der zum Beispiel Arbeitskollegen hat, die vielleicht original aus der Ukraine sind oder Verwandte in der Ukraine haben oder aus Russland oder aus Belarus sind, wie würdest du diesen, was würdest du diesen Menschen raten, wie die sich jetzt gegenüber den betroffenen Personen verhalten sollen? Kannst du da Tipps geben? Vielleicht auch als Engineering Manager.",
      "start": 1573173,
      "end": 1602242,
      "confidence": 0.8298799999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich glaube grundsätzlich, ich würde es so handhaben wie bei allen nicht arbeitstechnischen Themen, also wenn es ums Privatleben geht. Es kommt wahrscheinlich immer auf die Person drauf an, ob sie über solche Dinge reden wollen oder nicht oder was das Verhältnis natürlich zu dem Teammember ist. Aber grundsätzlich muss man das halt auch einfach mitdenken. Ich kann mir das nicht anders vorstellen, dass die extrem viele andere Dinge im Kopf haben, natürlich mit Familie und dem eigenen Land. Das heißt, das wirkt sich natürlich auch auf die Arbeit aus und auf die Performance, wenn man es ganz hart sieht. Also ich glaube, da muss man halt einfach auch dementsprechend einen sicheren Raum schaffen, dass das nicht sich irgendwie negativ auswirkt auf alle Beteiligten. Und sonst würde ich einfach mit den Leuten reden. Im Normalfall hat man ja ein gutes Verhältnis als Engineering Manager mit den Leuten und kann über solche Dinge auch sprechen. Und dann sieht man auch, wo man vielleicht direkt helfen kann. Es kann natürlich sein, dass man wirklich direkt helfen kann, unter Umständen auch als Privatperson oder sonst auch als Firma oder einfach die nötigen Freiheiten dann gibt.",
      "start": 1602702,
      "end": 1675411,
      "confidence": 0.8337150259067365,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sehe ich ähnlich. Ich habe direkte Kollegen, die kommen aus der Ukraine, die haben da auch Verwandte, die gerade betroffen sind. Wir haben Hilfe angeboten, soweit wir es können. Wir reden wirklich nur darüber, wenn der Kollege darüber sprechen möchte. Wir versuchen, so weit wie möglich einen sicheren Raum zu schaffen. Und bitte legt sehr viel Empathie an den Tag und seid da auf gar keinen Fall in irgendeiner Art und Weise aufdringlich und wollt Informationen herrschen. Das wäre völlig der falsche Zeitpunkt. Jetzt hat man gegebenenfalls keine Mitarbeiter, Freunde, Kollegen, die betroffen sind. Was kann denn jeder von uns tun, Wolfgang?",
      "start": 1675671,
      "end": 1712923,
      "confidence": 0.804274509803922,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich glaube, es gibt sehr viele Dinge, die jeder machen kann, aber auch als IT-Person zusätzlich noch machen kann. Ich glaube, ganz grundsätzlich sollte man sich mal nicht einschüchtern lassen von dem Ganzen. Das ist halt in dem Fall die Putin-Kriegsführung. Die soll ja die Unsicherheit schüren in Europa. Sie wird da einfach mal probieren, sich möglichst nicht einschüchtern zu lassen. Und dann natürlich auch die Solidarität, die dann gefragt ist in Zukunft. Und die kann sich natürlich in vielen Bereichen ausdrücken. Ich habe ja letztes Mal schon erwähnt, wir sind ja in dieser Situation, dass man sehr gute Gehälter haben und sehr gut verdienen. Man kann sich auch überlegen, einfach mal ganz dumm zu spenden. Wir verlinken da gerne auch noch ein paar Seiten dazu. Man kann neben Geld ja auch Sachspenden leisten. Da gibt es also auch viele, viele Möglichkeiten. Man kann natürlich auch so weit gehen, dass man wirklich, wenn man ein Zimmer zur Verfügung hat oder einen Teil des Hauses zur Verfügung stellt, kann man da gerne auch noch verlinken. Da gibt es einige große Plattformen. Unterkunft-Ukraine.de ist eine große, aber auch Airbnb macht da viel unter Airbnb.org. Man kann übrigens auch einfach, wenn man will, habe ich neulich gesehen, auch ganz nette Aktion, auf Airbnb ein Zimmer mieten in Kiew aktuell und gar nicht hinfahren, um einfach so möglichst schnell Geld zu transferieren an Leute, die wirklich vor Ort sind. Wobei, ich bin mir nicht ganz sicher, ob man da die richtige Geschichte in der Ukraine trifft. Aber es ist auch eine nette Geste auf jeden Fall.",
      "start": 1713386,
      "end": 1805679,
      "confidence": 0.8023079847908742,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Funktionieren die ganzen Online-Plattformen aktuell? Angenommen, ich würde jetzt jemanden aufnehmen wollen ich kann mir gut vorstellen dass die ganz andere sachen im kopf haben als auf airbnb oder auf couchsurfing gerade nach einem thema zu suchen sondern also erreiche ich da die richtigen leute.",
      "start": 1805699,
      "end": 1821800,
      "confidence": 0.7752666666666669,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja so airbnb.org. Das ist eine eigene Plattform für solche Fälle, wo im Zimmer kostenlos zur Verfügung gestellt werden können, zum Beispiel. Also das ist normalerweise schon bekannt. Aber es gibt eben auch zahlreiche andere Plattformen. Es gibt auch in Österreich Plattformen. Dafür kann ich auch noch gerne einen Link versenden. Das ist sogar eine staatliche Organisation, die derzeit alle freien Couchen und Betten registriert und sich darauf vorbereitet. Und wer sich aus dem Tech-Bereich interessiert, wie sowas abläuft, auch da kann ich wieder den Doppelgänger-Podcast empfehlen, im letzten Doppelgänger-Podcast. Einer der Hosts hat aktuell fünf Kinder und vier Erwachsene in seinem Gästezimmer untergebracht und auf der Couch. Also wer sich das mal persönlich anhören will, kann ihn ja auch noch gerne verlinken. Also man kann da wirklich sehr viel tun und auf verschiedenste Weisen helfen. Was wir, glaube ich, als IT-Menschen noch machen können, auch wenn es jetzt nicht unbedingt IT ist, aber wir arbeiten halt oft in dieser Informationswelt auch und Social Media, ist, glaube ich, einfach die richtigen Informationen verbreiten und vielleicht auch andere Leute darüber informieren, wie das läuft mit Fake News, was Fake News sind, was vielleicht auch gute Quellen sind, denen man trauen kann. Also mir geht das selber auch oft so, wenn da zum Beispiel eine Enon-Gruppe irgendwas postet, man nimmt das sofort für wahr an, aber Es gibt natürlich extrem viel Fake News von allen Seiten und zum Beispiel habe ich gerade kürzlich einen Tweet gesehen von einem Russen, der in der Ukraine gefangen worden ist und jetzt erzählt, wie schlimm das alles ist in der Ukraine und er hat sich das nie geglaubt und was er für Falschinformationen von Russland bekommen hat. Und darunter war dann irgendwie ein Bild von so einem ähnlichen Typen, der so ähnlich ausgeschaut hat und in einem ukrainischen Overall. Das heißt, dass der gar kein Russe sei, sondern ein Ukrainer. Und die haben ja sofort gedacht, ah, okay, das war Fake News. Man sieht da einen Tweet dazu und denkt sich, ah, das haben die Ukrainer einfach nur verbreitet, Fake News. Und wenn man sich das ein bisschen genauer anschaut, ist es aber doch so, dass das Fake News vielleicht von der russischen Seite war, um abzulenken, dass der gar nicht echt sei, dieser russische Soldat. Also es ist extrem schwierig, sogar für Leute, die vielleicht glauben, sie kennen sich gut aus, wie mich zum Beispiel auf Twitter, wie schnell man eigentlich so mit einem Tweet einfach sich denkt, okay, das war Falschinformation. Also man muss da schon extrem aufpassen und weil du zuerst die Tage schaust, erwähnt hast. Ich glaube, solche ganz klassischen öffentlichen Medien, die wirklich gute Arbeit leisten und Faktenchecks machen, auf die sollte man sich immer noch verlassen können und vielleicht auch mehr verlassen in solchen Zeiten und nicht jeden Scheiß auf Twitter retweeten, auch wenn ich das auch gerne mache. ohne lang nachzudenken. Und auch wenn die Informationen von irgendwelchen Quellen wie Enon oder von irgendwelchen anderen Hackerquellen kommt, wo man vielleicht glaubt, ah, das sind ja eh die Guten, da muss es stimmen, würde ich da einfach extrem aufpassen, was man so verbreitet. Und man muss die ganze Sache nicht noch mehr aufheizen, würde ich sagen, als sie schon ist. Und man sollte gerade jetzt eigentlich auf Qualität achten. und vielleicht zweimal auf so einen Tweet schauen, bevor man retweetet oder die Informationen verbreitet. Und da sehe ich halt uns irgendwo gefördert, weil wir uns mehr oder weniger damit auskennen. Und ich glaube, zu Normalzeiten sollte man das schon machen, andere zu educaten, wie man damit umgeht. Aber ich glaube, jetzt in den heißen Zeiten ist es, glaube ich, noch viel wichtiger, dass man das macht. Und das können wir aus dem Tech-Bereich eigentlich ganz gut machen und sollten machen. Und das ist auch hilfreich für die ganze Situation.",
      "start": 1821840,
      "end": 2043822,
      "confidence": 0.7931596244131458,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das war doch mal ein gutes Schlusswort für eine etwas schwierige Engineering-Kiosk-Folge. Geht doch einfach mal zurück zu eurem Arbeitgeber und fragt ihn, was ihr tun könnt. Wir haben ein paar Firmen gesehen, die haben ihre leeren Konferenzräume gerade als Schlafräume umgewandelt, um dort ein paar betroffene Personen aufzunehmen. An jeden größeren Hauptbahnhöfen kommen, glaube ich, täglich Züge an mit Leuten. Schaut doch mal nach, ob es da auch eine Kontaktstelle gibt, wo man sich vielleicht ein bisschen detailliert informieren kann.",
      "start": 2044102,
      "end": 2078253,
      "confidence": 0.8224567901234567,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir verlinken da gerne natürlich alles noch, sowohl für Österreich wie auch Deutschland natürlich. Und man muss sich vielleicht auch noch mal im Hinterkopf behalten, Es geht da auch oft einfach darum, jemanden eine Nacht aufzunehmen. Die reisen sowieso ganz oft weiter in Europa, weil sie da irgendwen kennen, Familie haben und es geht einfach darum, dass die irgendwo schlafen können und vielleicht mal eine Dusche bekommen oder so. Man kann da wirklich sehr einfach helfen und im schlimmsten Fall kann man ja auch einfach nur unter Anführungszeichen was spenden. Das wird dann auch von sinnvollen Organisationen ganz gut verteilt. Und wer es ganz hart will, kann auch direkt dem ukrainischen Militär spenden. Geht auch. Also es gibt wirklich alle Möglichkeiten, wohin man spenden kann.",
      "start": 2078293,
      "end": 2126137,
      "confidence": 0.8491519999999995,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wer mehr dazu lesen möchte, verlinken wir in den Shownotes auch noch einen sehr, sehr guten Artikel von Gergely Oros. Und zwar ist das ein ehemaliger Software-Engineer von Uber, The Pragmatic Engineer, der sehr viel auch über dieses Thema bloggt. Sehr guter Artikel. Oder hört doch mal in die aktuelle Folge von dem Programmierbar-Podcast rein. In der aktuellen News-Folge gibt's auch einen kleinen Rundumschlag über technische Sanktionen.",
      "start": 2126457,
      "end": 2153792,
      "confidence": 0.7730298507462685,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hätten wir fast noch was vergessen. Wir müssen ja auch mal was Positives loswerden in diesen verdammt triesten Zeiten, wo man nur schlechte Nachrichten jeden Tag hört. Wir haben ein kleines Projekt gestartet, ein kleines Repository. Verlinken wir natürlich auch gerne. Und zwar geht es um Open Source Projekte und den interessanten Geschichten dahinter. Ich habe ja letztes Mal erwähnt, Warum MySQL? MySQL heißt für MariaDB, MariaDB. Und wir haben uns gedacht, eigentlich ist das eine coole Information und es gibt ganz viele Open-Source-Projekte, wo keiner eigentlich die Geschichte oder wenige Leute die Geschichte hinter diesen Open-Source-Projekten kennt. Und wir haben gedacht, wir machen einfach ein Repository. Jeder kann mitmachen mit Pull-Requests und wir sammeln einfach diese netten Geschichten hinter diesen Open-Source-Projekten. Woher kommt der Name oder Sonst vielleicht auch Trivia-Geschichten zu den Open-Source-Projekten.",
      "start": 2154199,
      "end": 2205569,
      "confidence": 0.8082074074074076,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aktuell ist noch gar nicht so viel drin, aber wir haben gestartet. Natürlich sind die Hintergründe zu MariaDB und MySQL drin, aber auch warum Hadoop Hadoop heißt oder Apache Kafka Kafka, woher der Name Kubernetes kommt oder was der Hintergrund von Curl ist oder von Debian. Soviel dazu, wir sehen uns nächste Woche wieder.",
      "start": 2205609,
      "end": 2224606,
      "confidence": 0.8286481481481481,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Lasst euch nicht unterkriegen, konsumiert in der Zwischenzeit Informationen, filtert die Informationen und teilt die wertvollen Informationen. Und ich hoffe, dass wir uns dann nächste Woche wiederhören, trotz meinen vielen Monologen, diese Woche hoffentlich in einer besseren Atmosphäre über ein Tech-Thema.",
      "start": 2224646,
      "end": 2242460,
      "confidence": 0.8353414634146342,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bis bald. Ciao.",
      "start": 2242480,
      "end": 2243201,
      "confidence": 0.4606666666666667,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.8074450934579455,
  "audio_duration": 2250.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
