{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/c8d31470-3a28-443c-aafd-af96625f4146/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62bofxrqrb-2f8e-4d43-9977-f3cc917b0a79",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen zu einer neuen Episode des Engineering Kiosks. Vielleicht habt ihr auch schon mal die Aussage gehört, One-on-ones sind sowieso nur Zeitverschwendung. Wir sind da natürlich anderer Meinung und besprechen in dieser Episode, wie jede Person, egal in welcher Position in der Firma, aus One-on-ones unglaublich wertvolle Informationen ziehen kann. Kleine Frage, wie viele One-on-ones hast du in deinem Leben schon geführt? Uh, das ist keine Zahl, uh.",
      "start": 4544,
      "end": 31865,
      "confidence": 0.7770735294117648,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dreistellig auf jeden Fall. Ich weiß gar nicht, ob's schon vierstellig war. Boah, ja doch, das könnte schon vierstellig gewesen sein, ja? Müsste ich noch mal durchrechnen. Hast du eine Strichliste dafür?",
      "start": 32643,
      "end": 43409,
      "confidence": 0.6156874999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gott sei Dank nicht, aber es waren sicher einige. Darum haben wir auch überlegt, ob wir nicht mal eine Episode zu 101 machen. Und auch, weil wir sie in der fünften Episode mal kurz angeschnitten haben, und vor allem erklärt haben damals, dass man die recht regelmäßig führen sollte oder haben sollte. Dann haben wir einiges an Feedback bekommen von Leuten, die irgendwie so gemeint haben, ja, sie haben das so jährlich oder halbjährlich und da spricht man nicht nur über das Gehalt und das war es dann eigentlich. Und dann haben wir uns überlegt, okay, wenn es wirklich so ist und noch so wenig Anklang gefunden hat bei allen, dann machen wir einfach eine Episode mal drüber, was wir uns unter 101 so vorstellen, was unsere Erfahrungen damit sind und was man auch als normaler Mitarbeiter oder Mitarbeiterin einfach machen kann, um diese 101 anzustoßen und was man auch vor allem rausholen kann aus diesen, glaube ich, sehr wichtigen und wertvollen Meetings.",
      "start": 43429,
      "end": 96801,
      "confidence": 0.8379325153374235,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Korrigiere mich bitte, aber soviel ich weiß, kam das Feedback von Personen, die bei deutschen mittelständlern arbeiten oder also durchaus große.",
      "start": 96821,
      "end": 104826,
      "confidence": 0.6328571428571429,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Firmen ja keine keine mini firmen wo man sagen würde okay bei fünf leuten macht es vielleicht weniger sinn so so viel struktur zu haben aber schon bei größeren firmen ja definitiv.",
      "start": 104866,
      "end": 114714,
      "confidence": 0.8296562500000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber tech only firmen oder wirklich mit weiß ich jetzt nicht offline präsenz stahlwerken und co.",
      "start": 114754,
      "end": 121339,
      "confidence": 0.8304375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir haben jetzt kein Feedback von Stahlwerk-Mitarbeitern bekommen. Keine Ahnung, vielleicht hast du da mehr Connections, Andi. Also es waren schon eher Tech-Firmen, die Tech als Produkt haben, aber auch natürlich größere IT-Abteilungen haben und vielleicht ein anderes Produkt eigentlich haben.",
      "start": 121820,
      "end": 136329,
      "confidence": 0.783268292682927,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, bevor wir ins Thema mal ein bisschen tiefer einsteigen, starten wir, wie jeder gute Deutsche starten würde, mit einer Begriffsdefinition. Was ist ein One-on-One-Workung?",
      "start": 136649,
      "end": 146615,
      "confidence": 0.79576,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gute Frage, ob es jetzt eine ganz offizielle Begriffserklärung gibt. Also grundsätzlich ist es ein Meeting zwischen zwei Personen, darum heißt es wahrscheinlich one on one, also eins zu eins. Und das Ganze findet üblicherweise regelmäßig statt. Also ich glaube, das ist alles, was es an Gemeinsamkeiten gibt. Aber natürlich hat es in der moderneren Welt und wahrscheinlich vor allem in Tech-Firmen auch, dieser ganzen New Work Bubble noch mehr Bedeutung und da steckt natürlich noch mehr dahinter.",
      "start": 147113,
      "end": 175480,
      "confidence": 0.8163846153846152,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe gerade mal geguckt, ob es eine Definition auf Wikipedia gibt. Und wenn ich 101 Wikipedia bei Google eingebe, finde ich 1&1 den Internetkonzern und ich finde 1&1 eine Phase beim Poker, bei der nur noch zwei Spieler am Tisch sitzen. Eine bestimmte Beziehungstype in einem Internet Relationship Diagramm. Alles nicht falsch, aber alles nicht das, was wir meinen. Okay, ein Gespräch zwischen zwei Personen. Als ich meiner frau das erste mal erzählt habe ich muss jetzt weg ich habe jetzt im 101 hat die mich auch ganz fragend angeguckt und sagt hä was ist denn ein 101. Und dann musste ich erst mal erklären dass ich ein persönliches gespräch mit meinem chef hatte oder mit meinem damaligen chef und dann hat die mich ganz erschrocken angeguckt und sagt hä das heißt doch Joe fix ist Joe fix das gleiche.",
      "start": 175860,
      "end": 222976,
      "confidence": 0.7402127659574466,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, Surefix wird auch in ganz vielen verschiedenen Varianten verwendet. Ich kenne Surefix zum Beispiel immer als Team-Meeting mit dem gesamten Team. Also ich glaube, da gibt es eigentlich ganz viele Begriffe dafür. Mitarbeitergespräch ist, glaube ich, auch noch ein anderes. Wobei da sehe ich eher so dieses jährliche Gespräch. Und wenn ich da mal gerade den Wikipedia-Artikel anschaue, ist das so eher dieses jährliche Feedback-Gespräch. Aber da kommen natürlich auch schon so Sachen wie Zielvereinbarungen, Leistungsbeurteilungen, Weiterbildungen. Entwicklungsmöglichkeiten und so weiter auch vor. Also vielleicht ist es ein Mitarbeitergespräch, wobei für mich dieses Mitarbeitergespräch eigentlich eher so jährlich stattfindet, erfahrungsgemäß und die coolen, hippen neuen Firmen nennen es dann 101, wenn das Ganze öfters stattfindet.",
      "start": 223503,
      "end": 268315,
      "confidence": 0.7952393162393163,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist uns recht wichtig. Wir besprechen hier One-on-Ones, wir besprechen hier Meetings zwischen zwei Personen, in der Regel zwischen einem Individual Contributor und ihrem Manager. Und die Themenbereiche, die Wolfgang gerade angesprochen hat, Zielvereinbarung, Weiterentwicklungsmöglichkeiten, sind natürlich auch Teil des aktuellen One-on-Ones. Die finden in einer höheren Frequenz statt als jährlich oder halbjährlich. Es kommt ganz drauf an. Manchmal wöchentlich, manchmal zweiwöchentlich, manchmal dreiwöchentlich. Je nach Kontext. Können wir aber gleich nochmal ein bisschen mehr dazu sagen.",
      "start": 268515,
      "end": 303177,
      "confidence": 0.8191025641025644,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was man ganz oft hört von vielen Seiten ist, dass das eigentlich ein unnützes Gespräch ist und das ist nur wieder eine Stunde, die man verliert jede Woche oder jede zweite Woche und man updatet da sowieso nur den Chef oder die Chefin, was man so gemacht hat und das ist eigentlich ziemlich unnütz und wir wollen heute eigentlich auch ein bisschen besprechen, wie man das Ganze so umwandeln kann, dass es eigentlich nützlich ist für beide Seiten, wenn es sowas schon gibt und wenn es sowas noch nicht gibt, warum man das eigentlich einführen sollte unbedingt.",
      "start": 303612,
      "end": 332901,
      "confidence": 0.8167628865979382,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das Feedback, was Wolfgang gerade angesprochen hat, habe ich auch öfters in meiner Karriere gehört, dass Leute aus meinem Team gesagt haben, hey, das stört mich total, das Meeting. Ich habe da keine Lust drauf. Ich habe das auch von links und rechts des anderen Teams gehört. Und mit dem Mythos wollen wir mal ein bisschen aufräumen heute, weil ich denke, dass ein One-on-One mit deinem Vorgesetzten eine super Chance ist, um wirklich viele verschiedene Themen anzusprechen, um das wirklich, ich nenne es mal, dein Meeting zu machen. Deswegen fangen wir mal an. Wofür ist denn ein One-on-One überhaupt gut, Wolfgang? Welche Punkte kommen dir in den Sinn, wenn man sagt, okay, was könnte der Inhalt eines One-on-One sein?",
      "start": 333281,
      "end": 372176,
      "confidence": 0.7540672268907563,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also bevor wir ins Detail gehen, würde ich das Ganze ein bisschen als abstrakteres Meeting noch gerne betrachten. Und zwar sollte das eigentlich ein Ort sein, wo man sich sehr wohl fühlt und nicht irgendwie das Ganze als unnütz angesehen wird, wo man wirklich einen Ort hat, wo man sich gegenseitig vertraut und über problematische Dinge sprechen kann. Es gibt einiges, was so in der Arbeitswelt normalerweise auftaucht an Problemen, an schwierigen Themen wie Gehälter zum Beispiel oder Probleme im Team und dieses 101 soll eigentlich ein Ort sein, wo man genau diese schwierigen Dinge besprechen kann. Natürlich gibt es auch noch andere Dinge, die jetzt vielleicht nicht so schwierig sind, wenn es um Weiterbildung geht oder um einfaches Feedback oder vielleicht auch um irgendwelche Business-Dinge oder Produkt-Dinge, über die man sprechen will. Also das ist kein No-Go, dass man auch über das Produkt mal spricht oder über technische Details. Aber es soll eben kein Status-Update-Meeting sein. Es soll wirklich ein Safe-Place sein, wo man schwierige Themen einfach behandeln kann. Also das ist, glaube ich, mal die Grundlage, die da sein muss, damit man da überhaupt mehr rausholen kann aus so einem Meeting.",
      "start": 372516,
      "end": 438598,
      "confidence": 0.8377305699481862,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hast du grad gesagt das ist ein sicherer raum ein sicheres meeting da kann man probleme ansprechen jetzt ist es nochmal so dass das vertrauensverhältnis natürlich erst aufgebaut werden muss zwischen zwischen den zwei leuten die sich da im one on one unterhalten das ist ja nicht von von grund aus da oder ich mein.",
      "start": 438938,
      "end": 453713,
      "confidence": 0.7488035714285715,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dafür ist natürlich vor allem der Manager gefragt oder die Manager-Seite gefragt, glaube ich, weil die muss natürlich auch dementsprechend die Sicherheit anbieten oder diese Atmosphäre schaffen, damit sich alle drin wohlfühlen und damit man über solche Dinge sprechen kann. Und man wird wahrscheinlich nicht in dem ersten Meeting schon über irgendwelche schwierigen Themen sprechen. Also das Ganze baut sich natürlich über die Zeit auch auf. Also haben wir schon einen Punkt, um den sich die Manager-Seite auf jeden Fall kümmern muss und das auch immer mit beachten muss, damit so eine sichere Atmosphäre entsteht und man über diese Dinge sprechen kann. Hast du konkrete Tipps, wie du so eine sichere Atmosphäre und Umgebung schaffst im Normalfall?",
      "start": 454193,
      "end": 493645,
      "confidence": 0.8100085470085473,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich habe jetzt keine Checkliste, die ich jetzt abgehe, sondern eher erstmal locker starten, die Personen ein bisschen kennenlernen, mit wem spreche ich denn da gerade überhaupt. Das heißt natürlich, dass man vielleicht hier und da auch mal ein bisschen ins Private geht, wobei ich da sagen muss, dass man natürlich auch ganz klar Grenzen setzen sollte und vielleicht sich auch genau darüber unterhalten sollte, wie weit, auf welcher Ebene unterhalten wir uns denn hier, ja? Sind das jetzt hier nur Arbeitsthemen? Oder kann man auch mal fragen, was man am Wochenende gemacht hat? Das bleibt jedem selbst überlassen, wie weit man gehen möchte. Ich sag nur, für mich funktioniert's sehr gut, umso mehr ich die Person wirklich kenne, umso eher kann ich ein vertrauensvolles Verhältnis aufbauen. Und das dauert natürlich, ja. Das dauert jetzt nicht ein Meeting oder zwei Meetings, Es kann Wochen dauern, es kann Monate dauern und umso mehr das Vertrauen da ist, umso mehr ich auch, die Person mir auch bewiesen hat, dass zum Beispiel die Themen, die wir hier besprechen, zwischen uns beiden bleiben, desto größer ist halt mein Vertrauen und desto mehr verliere ich auch meine Hemmschwelle, problematische Themen anzusprechen.",
      "start": 493997,
      "end": 566743,
      "confidence": 0.8054416243654829,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, was auch extrem wichtig ist, ist, dass man das einfach von Anfang an schon klärt zwischen beiden Seiten, was denn eigentlich ein One-on-One-Meeting ist, warum man jetzt da wirklich in dem Raum sitzt jede Woche oder jede zweite Woche und was man da eigentlich diskutiert. Und dann kann man da natürlich auch klar feststellen, okay, da gibt es eine Verschwiegenheitspflicht. Man kann da offen Themen ansprechen, die vielleicht sonst problematisch sind und die gehen nicht nach draußen. Und das muss man natürlich auch von der Manager-Seite vor allem wirklich erfüllen. Wenn man da dann noch irgendwas nach außen trägt, ist natürlich das komplette Vertrauen kaputt. Das ist das Schlimmste, was man machen kann. Aber das grundsätzliche Klären mal, was man da überhaupt machen will in so einem One-on-One ist, glaube ich, extrem wichtig.",
      "start": 567210,
      "end": 609642,
      "confidence": 0.8252666666666668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In vielen Leadership-Trainings habe ich sogenanntes Contracting gelernt. Bevor man überhaupt mit dem Meeting oder mit dem Workshop startet, macht man sogenanntes Contracting und das ist eigentlich genau das, was du beschrieben hast. Was ist das Ziel hier? Was sind die Rahmenbedingungen? Wie weit können wir gehen? Und es ist auch völlig okay, direkt am Anfang zu fragen, hey, sollen wir mal kurz darüber sprechen, inwieweit wir jetzt hier auch was Privates preisgeben oder nicht, was ist okay für dich, was ist okay für mich. Das klingt erstmal total platonisch, man fängt sofort an, aber ich denke, dass diese Rahmenbedingungen es für alle leichter machen, in dem One-on-One sich zu bewegen. Auf jeden Fall kann ich sagen, das braucht Zeit. Es gibt Menschen, die brauchen ein halbes Jahr. Es gibt Menschen, die werden halt einfach nicht warm miteinander. Das ist auch völlig, völlig okay. Man muss nicht mit jedem best friend sein. Und es kann auch einfach sein, dass man mit seinem oder ihrer Managerin einfach gar nicht klarkommt. Dann muss man mal gucken, was man macht. Aber man muss da nichts erzwingen.",
      "start": 610002,
      "end": 675798,
      "confidence": 0.808393442622951,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielleicht auch noch das andere Extrem zu erwähnen. Man muss da natürlich auch aufpassen, dass man nicht best friend wird unter Umständen und dass man auch da nicht zu tief ins Privatleben zum Beispiel geht. Oder man ist auch kein Psychotherapeut, wenn es irgendwo Probleme gibt, die dann so weit reinreichen in das ganze Psychotherapeutische. Man muss da auch aufpassen, dass man da nicht irgendwie die Verantwortung übernimmt und dann Psychotherapeuten ohne Ausbildung wird. Also ich glaube, da gibt es zu Recht Spezialisten und wenn jemand zum Beispiel ein psychisches Problem hat, das ist dann nicht mehr Aufgabe vom Manager das zu lösen und in einem One-on-One das anzugehen. Also ich glaube, das ist die andere extreme Seite und man muss halt schauen, dass man da irgendwo in der Mitte bleibt zwischen den zwei Extremen im Idealfall und so funktioniert dann glaube ich am besten das gemeinsame Arbeitsleben.",
      "start": 676455,
      "end": 727617,
      "confidence": 0.8114797297297301,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir sprechen jetzt aber schon die ganze Zeit, dass ein One-on-One zwischen einem Manager und einem Individual Contributor ist. Muss nicht sein. Meines Erachtens nach sollten auch ganz andere Positionen im Unternehmen One-on-Ones machen, wie zum Beispiel Tech Leads, die jetzt keine Personalverantwortung haben. Mir fallen zum Beispiel Staff Engineers ein, also sehr, sehr erfahrene Engineers, die gegebenenfalls größere Projekte in der Firma leiten. Die können zum Beispiel einfach mal One-on-Ones mit anderen engineers haben produktmanager haben ebenfalls auch keine personalführung könnten aber ebenfalls machen eigentlich eigentlich besteht die frage wer sollte sie nicht tun.",
      "start": 727977,
      "end": 762983,
      "confidence": 0.8116631578947368,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und vielleicht nochmal gleich zur Klarstellung, also ein Product Manager, der hat im Idealfall natürlich 101s mit seinem Manager drüber, aber der kann natürlich auch, obwohl er keine Personalverantwortung hat, zum Beispiel mit Engineers 101s machen, um gewisse Dinge zu klären. Das ist dann vielleicht eine andere Atmosphäre und vielleicht mehr produktorientiert das Ganze, da wird man nicht über irgendwelche privaten Dinge zum Beispiel sprechen. Aber man könnte zum Beispiel über Entwicklungen, wie man sich im Team entwickeln kann mit irgendwelchen Technologien, da kann man natürlich durchaus auch mit Produktmanagern sprechen und nicht nur mit dem eigenen Lead. Also ich glaube, da gibt es guten Input, den man auch von einem Produktmanager zum Beispiel erhalten kann.",
      "start": 763962,
      "end": 808936,
      "confidence": 0.8022758620689655,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Inhalte der Gespräche sind natürlich abhängig von den Personen und den jeweiligen Rollen innerhalb der Unternehmen. Was ich zum Beispiel sehr oft gesehen habe in meiner bisherigen Karriere ist, dass wenn ich One-on-ones mit Produktmanagern hatte, dass es da sehr viel darum ging, wie können wir besser kollaborieren, Wie können wir Engineers zum Beispiel bei der Priorisierung und bei der Feature-Entwicklung oder Feature-Evaluierung helfen? Aber auch andersrum. Zum Beispiel haben wir dadurch sehr, sehr viel gelernt, wie Produktmanager eigentlich arbeiten, wie AB-Tests ausgewertet werden. Also das ist dann eher so ein Geben und Nehmen. Und das hilft natürlich dann für den kompletten Produktzyklus und für die komplette Zeit, in der wir zusammenarbeiten, natürlich ungemein.",
      "start": 809276,
      "end": 855089,
      "confidence": 0.8388782608695647,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die 101s, die wir jetzt besprochen haben, waren meistens zwischen dem Lead und dem Individual Contributor, also ein Hierarchie-Schritt sozusagen, ein Hierarchie-Level. Aber es gibt natürlich auch Skip-Level-101s, nennen sich die, dass man also ein Hierarchie-Level überspringt und das ist auch sehr üblich, dass zum Beispiel wirklich ein Chef oder ein CEO ein, zwei Levels überspringt und dann auch 101 mit Leuten im Unternehmen hat, die gar nicht direkt an ihn reporten zum Beispiel. Also auch das gibt's, das ist natürlich dann in einem anderen Intervall findet das natürlich statt und nicht wöchentlich üblicherweise. Aber die können natürlich auch sehr wertvoll sein, weil man da einfach einen Einblick bekommt, den man sonst weniger hat, weil man ja einfach die Hierarchie-Schritte zwischendrin hat. Also nur, dass das auch erwähnt ist.",
      "start": 855289,
      "end": 905172,
      "confidence": 0.8179767441860466,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe jetzt gerade zum Beispiel One-on-Ones mit meinem Chef-Chef alle vier Wochen, genau. Also es geht auch recht regelmäßig. Die gehen zwar nur eine halbe Stunde.",
      "start": 905813,
      "end": 916519,
      "confidence": 0.6787777777777776,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber hey, Und vor allem hat man da halt dann wirklich auch die Möglichkeit, gewisse Sachen direkt die Hierarchiestufen nach oben zu transportieren, auch wenn man vielleicht die Vermutung hat, dass das eben sonst irgendwelche Dinge gefiltert werden, zu Recht auch oft. Aber so kann man halt direkt auch Leute erreichen, die vielleicht einige Levels höher sind. Also auch da kann man das als Person wirklich auch gut nutzen von beiden Seiten, muss man dazu sagen. Also wenn wir schon bei den Intervallen sind, Andi, was ist ein sinnvoller Intervall für 101? Heißt das der Intervall oder das Intervall? Das Intervall.",
      "start": 916540,
      "end": 949666,
      "confidence": 0.8230693069306931,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der, die, das Intervall. Weiß ich jetzt auch nicht. Spreche ich mal, ich nehme mal die Perspektive von einem Engineering Manager und da klassische Antwort in der Informatik, es kommt drauf an. Ich glaube so alles so zwischen einer und vier Wochen. Nehmen wir mal ein paar Beispiele. Ich habe wen neues im Team und die Person wird gerade geonboardet. Da wird es schon Sinn machen, mindestens, wenn nicht sogar öfter, jede Woche sich mit dieser Person mal zu unterhalten. Gucken wie es läuft, wo man helfen kann, welche Probleme anstehen. Besonders wenn die Person irgendwie umgezogen ist oder die Länder gewechselt hat. Also da würde ich sagen, wie gesagt, einmal in der Woche, wenn nicht sogar deutlich öfter. Obwohl ich dann natürlich für deutlich öfter gegebenenfalls einen Mentor assignen würde, der dann den gleichen Job macht.",
      "start": 949706,
      "end": 996483,
      "confidence": 0.7764817518248173,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man natürlich fairerweise auch sagen muss, da sind viele Dinge dabei, die jetzt weniger klassische 101-Themen sind, sondern eher Business-Themen oder wie kommt man überhaupt rein in den Arbeitsflow und solche Dinge. Also die können natürlich schon Teil von 101 sein. Das sind aber jetzt keine klassischen One-on-One Themen, würde ich sagen. Das ist ja klassisches Onboarding dann.",
      "start": 996503,
      "end": 1015387,
      "confidence": 0.7185593220338985,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dann kommt es natürlich noch ein bisschen auf die Teamgröße an. Wenn man jetzt fünf Leute hat, zum Beispiel im Team, dann kann man schon alle zwei Wochen irgendwie ein One-on-One machen vor einer Stunde oder einer halben Stunde, je nachdem in welcher Phase sich die Leute befinden und welche konkreten Themen man mit denen hat. Also wenn man jetzt zum Beispiel eine Person gerade auf eine Beförderung vorbereitet, dann wird es da schon Sinn machen immer mal so eine Stunde zu investieren, um beim Support des Promotion Dokuments zu helfen oder ähnliches. Umso größer das Team wird, umso größer sollten die Intervalle auch auseinander gestreckt werden. Nicht, weil die Leute es nicht verdienen, sondern weil man da an Kapazitätsgrenzen kommt. Wenn das Team gerade mit 10, 15 Leute hat, dann sollte man sowieso darüber nachdenken, ob man das Team nicht aufsplittet und einen anderen Manager holt. Das dauert natürlich immer. Recruiting ist sehr, sehr zeitintensiv und bis die neue Person dann da ist, kann es natürlich schon sein, dass man für eine gewisse Zeit 10 bis 15 Leute leitet. Da wird es dann einfach zeitlich sehr begrenzt. Da kann man dann kurz mit seinen Leuten reden, hey, ich komme hier an meine Kapazitäten, ob man da nicht dann alle drei Wochen eine halbe Stunde oder Stunde investiert.",
      "start": 1015427,
      "end": 1085858,
      "confidence": 0.7757889908256881,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also meine Grundregel war eigentlich halbe Stunde jede Woche oder eine Stunde alle zwei Wochen. Meine Erfahrung war eigentlich, dass die Stunde alle zwei Wochen effektiver war, weil die halbe Stunde einfach, man fängt ein bisschen später an, man kommt einfach nicht so ins Gespräch. Also eine halbe Stunde, da muss man schon sehr professionell arbeiten auf beiden Seiten, sehr gut vorbereitet sein, damit man da auch wirklich den Value ausholen kann. aus dem Meeting. Also da würde ich eigentlich eher längere Meetings empfehlen. Aber wie du schon richtig sagst, alle ein bis zwei Wochen, je nachdem wie Senior auch jemand ist natürlich. Ich glaube es gibt auch Leute, da ist es vollkommen okay, wenn man das einmal im Monat macht. vielleicht ein bisschen intensiver und vielleicht auch gut vorbereitet, wenn das wirklich alle Beteiligten schaffen, dann ist das sicher auch okay. Also das muss man einfach ausprobieren und das ist, glaube ich, auch ganz wichtig, dass man das immer bespricht im Meeting. Stimmt es noch der Rhythmus? Sollen wir im Rhythmus was verändern? Brauchen wir mehr Zeit? Brauchen wir weniger Zeit? Dass man da also auch dementsprechend agil reagieren kann drauf.",
      "start": 1086203,
      "end": 1148550,
      "confidence": 0.813651041666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich zum Beispiel jetzt gerade habe Jede Woche eine Stunde mit meinem Chef. Liegt aber auch daran, dass ich jetzt gerade mehr oder weniger im Onboarding bin. Aber wir nutzen diese Stunde auch immer komplett aus, diverse Themen, weil wir uns noch in der Phase befinden, wo wir ein vertrauensvolles Verhältnis aufbauen. Das braucht dann natürlich mal ein bisschen mehr Zeit.",
      "start": 1148910,
      "end": 1169068,
      "confidence": 0.7757213114754096,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber gehen wir mal in die Details wirklich, was man in solche 101 eigentlich besprechen sollte. Es gibt ja da extrem viele Artikel, da werden wir natürlich auch einige noch in den Shownotes verlinken, die vor allem Engineering-Managern helfen können, was sie denn für Fragen stellen. Aber probieren wir das Ganze mal von der anderen Seite aufzurollen. Wenn ich als Individual Contributor in meine 101s gehe und die bisher vielleicht langweilig sind oder die bisher mir wenig bringen und einfach nur Zeit fressen. Was könnte ich als Individual Contributor machen, damit ich da wirklich mehr Value rausbekomme aus den Meetings? Wie kann ich meine Meetings vorbereiten? Was kann ich für Fragen stellen, um möglichst viel Value zu generieren?",
      "start": 1169383,
      "end": 1212926,
      "confidence": 0.8425423728813561,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich denke, wenn man das Meeting aktuell als unnütz, als Zeitverschwendung ansieht, dann würde ich als ersten Vorschlag bringen, mal darüber nachzudenken, was man aus diesem Meeting machen kann, beziehungsweise warum es dieses Meeting gibt, weil ein bisschen die Perspektive ändern und nicht nur als Frage-Antwort-Spiel das Ganze zu sehen. Generell ist das Meeting meines Erachtens nach ein Meeting für den Individual Contributor, also für mich selber, um mir Informationen zu holen, um mich weiterzuentwickeln oder mich beziehungsweise weiterentwickeln zu lassen. Auf jeden Fall, mir Feedback einzuholen von meinem Chef.",
      "start": 1213403,
      "end": 1250794,
      "confidence": 0.8331888888888889,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also vielleicht noch grad so zur Erklärung, weil wir immer von Individual Contributor reden, es gilt natürlich für jeden, auch für einen Engineering Manager, der mit seinem Manager dann schlussendlich eine 101 hat, da gelten genau die gleichen Fragen.",
      "start": 1251022,
      "end": 1264230,
      "confidence": 0.827,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, aus Perspektive des 101 kann eigentlich jeder in irgendeiner Art und Weise der Individual Contributor sein. Vielleicht außer der CEO, weil der CEO hat keinen über sich. Aber nehmen wir mal den CTO. Der CTO in dieser Hinsicht reportet zum CEO und in dem 101 wäre der CTO dann der Individual Contributor. Also, von daher, das geht halt quer über die Hierarchien. Aber was kann man da zum Beispiel fragen? Einer meiner Lieblingssachen ist immer, wenn man zum Beispiel den Chef mal gewechselt hat, im ersten 101 würde ich gerne immer fragen, was sind denn die Erwartungen an mich? Dann vergehen ein paar Wochen. Irgendwann frage ich, hast du etwas Feedback für mich und für meine Arbeit? Und nach circa drei Monaten frage ich dann, hey, im ersten 101 hattest du mir diese und diese und diese Erwartungen genannt. Wie erfülle ich diese denn zurzeit? Wie stehe ich denn zu den gesetzten Erwartungen? Und das mache ich dann im Quartalsintervall immer, wo ich dann auch sichergehen kann, okay, die Erwartungen, die an mich gesetzt wurden, die erfülle ich, um irgendwie böse Überraschungen am Ende des Jahres zu vermeiden.",
      "start": 1264490,
      "end": 1324392,
      "confidence": 0.7898783068783065,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt ja auch oft diese Situation, dass dann viele Leute irgendwie enttäuscht sind oder das Nichtkommen gesehen haben, dass irgendetwas nicht stimmt und dann womöglich entlassen werden. Und ich glaube, sowas kann da auch präventiv helfen, vor allem, wenn der Manager nicht sehr gut ist und das nicht von sich aus liefert, was er natürlich sollte. Aber wenn man natürlich selber schon dieses Feedback einfordert zur eigenen Leistung, was es für Erwartungen gibt und so, als was jetzt Andi erklärt hat, Dann kann man dem natürlich präventiv vorsorgen und bekommt da auch schon die wichtigen Informationen vorab.",
      "start": 1325177,
      "end": 1360282,
      "confidence": 0.8324999999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wichtig ist in dem Punkt auch, dass man die Erwartungen, die an einen gesetzt werden, natürlich verschriftlicht. Und ich sehe das immer so als doppeltes Sicherheitsnetz. Auf der einen Seite kann ich dann natürlich gegensteuern, auch mit Argumenten. Hey, pass mal auf, dieses Projekt habe ich nicht geschafft, weil ich in der Zeit sieben andere Engineers geonboardet habe. Auf der anderen Seite ist das auch eine gute Guideline für deinen jeweiligen Manager. Er kann relativ früh einlenken und dann entsprechende Gegenmaßnahmen einleiten. In manchen Firmen heißt das, man wird gepippt. Ein Performance-Improvement-Plan gibt es in manchen Firmen. Aber so weit muss es ja noch gar nicht gehen. Im Endeffekt ist es das, wenn man die Erwartungen in Quartalsweise mal gegencheckt, dass man am Ende des Jahres, wenn es dann zum Beispiel um Gehaltserhöhungen oder um Gehaltsgespräche geht, eigentlich keine bösen Überraschungen erwarten kann. weil man hat ja jedes Quartal mal ein Status Quo abgeholt.",
      "start": 1360302,
      "end": 1411895,
      "confidence": 0.7862142857142856,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und ganz wichtig ist es, dass man das wirklich dokumentiert. Also wenn es da nicht sowieso irgendwie ein Tool gibt oder eine vorgeschlagene Möglichkeit von der Manager-Seite, dann sollte man das selber auf jeden Fall gut dokumentieren oder zusätzlich noch dokumentieren, dass man das also wirklich schwarz auf weiß hat, um, wenn es um irgendeine Konfrontation geht, natürlich da auch besser abgesichert zu sein. Aber auch, um sich zum Beispiel einfach aufs nächste Meeting vorzubereiten, mal zu checken, okay, was haben wir letztes Mal besprochen und was kann ich dieses Mal besprechen oder was muss ich besprechen. Dementsprechend auch gut vorbereiten.",
      "start": 1411955,
      "end": 1446061,
      "confidence": 0.8379504950495051,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was mir gerade noch in den Sinn kommt, ist einfach mal zu fragen, hey, welche meiner Skills kann ich denn ausbauen, um mehr Wert fürs Team und für die Firma zu schaffen? Oder welche Unterstützung bei meiner Weiterentwicklung kann ich denn von der Firma oder von meinem Vorgesetzten erwarten? Was sind meine Ziele und wohin will ich? Es ist vielleicht, auch wenn man die Antwort auf diese Fragen selbst gar nicht hat, dann kann man ja sogar den eigenen Vorgesetzten fragen, hey, ich weiß nicht, was meine Ziele sind und ich weiß auch nicht, wo ich wirklich hin möchte in meiner Karriere. Kannst du mir helfen, das herauszufinden? In der Regel haben Vorgesetzte einige Leadership-Seminare besucht und Coaching und verschiedene Coaching-Techniken sind Teil dieser Seminare. Das bedeutet die diese menschen haben in der regel vielleicht noch nicht die super ausgebauten skills sie haben aber die die methoden die tools zur hand um auch solche schwierigen fragen was sind meine ziele, wohin will ich wo sehe ich mich in zwei drei fünf jahren um auf jeden fall diese gedankenprozesse anzustoßen. Und wenn diese Personen das nicht können, dann wissen sie auf jeden Fall, ob die Firma zum Beispiel professionelles Coaching irgendwie anbietet. Kommen wir mal ein bisschen weg von dem Persönlichen, sondern eine andere Thematik ist, Engineering Manager können helfen, mehr Business Verständnis aufzubauen. Fragen wie, wer ist denn eigentlich unsere Konkurrenz, wie ist unsere Marktposition oder Inwieweit betrifft uns das aktuelle Weltgeschehen in der Ukraine oder die Inflation in Venezuela? Inwieweit betrifft das unser Business?",
      "start": 1446417,
      "end": 1536695,
      "confidence": 0.8379137254901962,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wenn wir schon bei dem Thema sind, um mehr zu verstehen über die Firmen, da gibt es natürlich auch Bereiche, so wie das Team zum Beispiel, wo es vielleicht auch interessant ist, mehr Informationen zu bekommen, dass man also wirklich das 101 ausnützt, um die Manager Seite zu fragen, wie schaut es aus mit unserem Team? Ist es gut aufgestellt? Gibt es Wachstumspläne? Wollen wir mehr Leute? Wollen wir weniger Leute? Fehlt uns vielleicht jemand im Team? Und wenn uns jemand im Team fällt, wollen wir jetzt Recruiting machen und wer macht Recruiting? Vielleicht will ich mich da auch selber einbringen zum Beispiel in das Recruiting, weil mir das interessiert oder weil ich da was lernen will. Dann kann man dadurch auch nachfragen, kann ich mich einbringen, kann ich vielleicht beim Recruiting mithelfen, wenn mich das natürlich jeweils interessiert. Aber auch ganz allgemein, wenn man über das Team hinaus schaut, das ganze Networking in der Firma zum Beispiel kann auch sehr wichtig sein und hilfreich sein und kann ich nur jedem empfehlen, einfach mal andere Leute, zum Beispiel im Bonobon zu fragen. Mit welchen Leuten könnt ihr einfach mal Mittagessen gehen oder einen Kaffee trinken gehen, um einfach mein Netzwerk zu erweitern in der Firma? Wer ist denn wichtig in der Firma? Mit wem sollt ihr vielleicht mal sprechen oder wen sollt ihr einfach kennenlernen, der mir dann später vielleicht bei vielen anderen Projekten oder Bereichen in der Firma wieder helfen kann?",
      "start": 1537131,
      "end": 1611181,
      "confidence": 0.8068930041152259,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Netzwerke sind immer so ein password bingo immer wenn jemand was über netzwerken redet denke ich immer entweder an schneeball systeme oder irgendwelche ganz komischen marketinggruppen auf zing die sagen ja genau so geht internet. So dodgy sind wir aber nicht unterwegs. Wofür ist ein Netzwerk in der eigenen Firma ganz gut? Ich nutze mein eigenes Netzwerk in der Firma immer, um den Prozess zu umgehen. Klingt total fies, aber im Endeffekt komme ich immer ans Ziel. Lernt einfach mal Leute kennen. Wo sind Leute enorm hilfreich? In der Personalabteilung. Die braucht man immer. Im Einkauf. falls man irgendwie einen neuen Service integrieren möchte. Immer den kurzen Dienstweg im Security Team, falls ihr sowas habt. An der Rezeption, das sind wirkliche Helden. Stellt euch gut mit den Leuten an der Rezeption.",
      "start": 1611648,
      "end": 1654648,
      "confidence": 0.752732824427481,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe jetzt gedacht, der Andi bringt irgendwelche Sachen, die nicht dodgy sind, aber er hat jetzt genau die dodgy Sachen erwähnt. Aber ich muss ihm leider recht geben, es gibt sehr wichtige Positionen in einer Company und wenn man diese kennt und einfach leichteren Zugang zu denen hat, kann es einfach sehr viel bewegen. Wenn man jemanden an der Rezeption kennt und man braucht dann vielleicht einmal für irgendeinen Meetup zum Beispiel Hilfe, dann ist das halt einfach wesentlich einfacher, wenn man da schon eine Connection dementsprechend hat. Also da geht es gar nicht um irgendwie illegale Sachen zu machen, sondern einfach um sich das Leben zu erleichtern, aber in einem positiven Sinn, wenn man einfach Hilfe braucht oder gewisse Sachen erledigen will in der Firma, die auch wichtig sind und wo dann alle davon auch profitieren, wenn diese Sachen zum Beispiel realisiert werden, wie ein Meetup oder so in der Firma.",
      "start": 1654708,
      "end": 1703461,
      "confidence": 0.8336928104575163,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, oder ihr arbeitet jetzt im Engineering, stellt euch sehr gut mit den SysAdmins. Da geht unglaublich viel auf dem kurzen Dienstweg. DNS-Einträge für ein Staging-Environment zum Beispiel. Oder habt ihr einen Hausmeister oder jemanden, der sich immer um das Büro kümmert? Stellt euch mit den Leuten super. Die können Berge bewegen. Baut euer Netzwerk ein bisschen aus. Fragt euren Chef, hey, wen würdest du mir denn empfehlen, mit dem ich mich mal unterhalte? Und ... Skateboard einfach mal 101s quer durch die Firma. Diese Menschen sind auch froh, dass ihr die Initiative ergreift.",
      "start": 1704019,
      "end": 1737691,
      "confidence": 0.7718191489361702,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt haben wir die 101s von der IC-Seite oder von der, wie nennt sich das einfach, die 101-Seite auf der Hierarchie unteren Ebene. Es klingt alles so negativ.",
      "start": 1737732,
      "end": 1748166,
      "confidence": 0.7843214285714285,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich finde den Begriff individual contributor, ich finde den gar nicht negativ, eigentlich finde ich den ganz gut.",
      "start": 1748397,
      "end": 1755023,
      "confidence": 0.7653333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir haben diese Ebene besprochen, wenn wir jetzt mal die Hierarchie Ebene höher gehen, auf der Engineering Manager Seite zum Beispiel. Was muss der Engineering Manager beachten oder wie sollte der seine 101s anlegen, Andi?",
      "start": 1755043,
      "end": 1767615,
      "confidence": 0.8509714285714283,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe meinen, also den Leuten, mit denen ich immer One-on-ones gemacht habe, habe ich immer versucht mitzugeben, hey, bereitet das doch mal bitte vor. Macht euch ein paar Gedanken, 10 Minuten, 15 Minuten vor dem One-on-one. Ich habe es natürlich ebenfalls getan, weil die Realität sieht ein bisschen anders aus. Viele der Leute, mit denen ich One-on-ones hatte, haben sich nicht vorbereitet. Und ich habe immer zugesehen, dass ich immer eine relativ lange Liste an Themen habe, die ich besprechen kann. Aus der Sicht des Engineering Managers ist es natürlich so, dass diese Person in der Regel das One-on-One aufsetzt. Jetzt aber, wo ich gerade drüber nachdenke, ist es auch Blödsinn. Vom Engineering Manager kommt auf jeden Fall die Initiative, hey, lass doch mal ein One-on-One machen. Wer es dann im Endeffekt aufsetzt, spielt gar nicht so eine wichtige Rolle. Wichtig ist nur, dass ein wiederkehrender Termin im Kalender steht, der dann auf der einen Seite nicht vergessen wird, aber auch nicht kommentarlos abgesagt wird, weil das gibt natürlich auch in irgendeiner Art und Weise eine Nachricht, wenn man einfach was absagt, ein persönliches Meeting, ohne irgendwie Kontext zu geben oder es zu verschieben. Es ist natürlich völlig okay, wenn beide sagen, hey, ich habe diese Woche nichts oder hey, wir sind gerade ganz kurz vor einem großen Produktlaunch. Lass uns das mal verschieben oder lass uns das mal skippen. Wir machen das in zwei Wochen.",
      "start": 1768084,
      "end": 1842718,
      "confidence": 0.7679282700421945,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei ich das grundsätzlich sehr gefährlich finde, das zu skippen, weil da kommt man sehr schnell in so ein Rad, dass man einfach skippt, skippt, skippt. Also ich habe mich bemüht, möglichst selten irgendwas zu skippen, sondern eher es zu verschieben, wenn es irgendwie möglich war. Wenn man es sowieso wöchentlich hat, kann man schon mal eine Woche oder so ausfallen lassen, kein Problem. Aber auch wenn niemand Themen hat, wenn man dann zusammensitzt in einem Raum, kommen doch immer wieder Themen auf und an die hat man halt vielleicht nicht gedacht. Und ich glaube, das ist schon sehr wertvoll.",
      "start": 1843256,
      "end": 1871473,
      "confidence": 0.7522699999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, du hast einen Punkt. Neben dem Scheduling des Termins sind natürlich die Dokumentationen meines Erachtens nach ein unglaublich wichtiger Punkt. Das bedeutet der Inhalt, der besprochen wird, Packt den einfach mal ins Dokument, damit ihr einfach Meeting Notes, klassische Meeting Notes, auf dieses Dokument habt nur ihr beide Zugriff. Dies ist auf der einen Seite, ist das super, damit ihr euch erinnern könnt, was habt ihr eigentlich vor vier, sechs, acht, zwölf Wochen besprochen. Auf der anderen Seite stellt euch das natürlich sicher, dass ihr beide das gleiche Verständnis habt, ja? Weil Kommunikation ist schwierig und Missverständnis kommt schneller, als ihr gucken könnt. Und so könnt ihr natürlich Punkte immer wieder aufgreifen. Ein weiterer Pluspunkt von Dokumentation ist, falls ihr, angenommen ihr habt jetzt alle zwei Wochen One-on-One mit eurer Vorgesetzten und innerhalb dieser zwei Wochen fallen euch hier und da mal ein paar Dinge ein. Öffnet einfach kurz das Dokument, tippt die Frage da rein und schließt das Dokument wieder, sofern es keine dringende Angelegenheit ist. Füllt sich so das Dokument natürlich mit Themen für das nächste One-on-One von alleine. Wenn das eine dringende Thematik ist, bitte, bitte, bitte, bitte, bitte nicht zwei Wochen warten, sondern direkt zu euren Vorgesetzten gehen und sagen, hey, hast du mal fünf Minuten? Ich würde gerne mal was Dringendes mit dir besprechen. Das habe ich so oft erlebt, dass die Leute ein Problem hatten, was sie wirklich unter den Fingernägeln brennt und sie haben dann bis zum nächsten One-on-One gewartet. Bitte sofort ansprechen bei Problemen, nicht auf die lange Bank schieben.",
      "start": 1872385,
      "end": 1958731,
      "confidence": 0.8081428571428572,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist definitiv ein sehr wichtiger Punkt hier. Im Idealfall ist dieses, also wenn wir jetzt von Dokument sprechen, ist das natürlich ein gesharedes Dokument, auf das beide Zugriff haben und wo beide Seiten die Notizen eintragen und auch eben die Themen für das nächste 101 eintragen und das hilft natürlich dann auch bei der Strukturierung vom 101, wenn man am Anfang schon mal zehn Themen aufgelistet hat oder drei Themen, dann kann man auch priorisieren oder sich überlegen, okay, was für Themen besprechen wir zuerst. Sich schon mal Gedanken machen, beide Seiten können sich Gedanken machen und wie lange das dauert, dann kann man die Struktur einfach wesentlich besser planen für so ein 30-Minuten-Meeting zum Beispiel, wenn man mehrere Themen hat. Also so dieses im Vorhinein irgendwas eintragen ist sehr wichtig.",
      "start": 1959204,
      "end": 1999696,
      "confidence": 0.7859696969696971,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wenn wir jetzt hier von Dokument reden, dann reden wir wirklich von einem Google Doc, von einem Dropbox-Paper, von einer geschlossenen Wiki-Page in eurem Company-Wiki oder ähnliches her. Also wirklich was ganz Simples, worauf beide Zugriff haben.",
      "start": 2000100,
      "end": 2013389,
      "confidence": 0.7536578947368422,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt natürlich schon aufwändige Tools dafür, klarerweise, aber ich glaube, also ich persönlich hatte immer ein Word-Dokument, was drei Spalten hatte. Einmal eine Spalte, wer hat dieses Thema initiiert mit dem Initialen, dann das Thema, wo man einfach Notes und das Thema reinschreibt und dann dritte Spalte Action Points, was sich daraus ergibt, wer hat was bis zum nächsten Mal zu machen, wer übernimmt welchen Action Point. Also das war meine 101-Struktur, ganz, ganz simpel.",
      "start": 2013913,
      "end": 2041033,
      "confidence": 0.8213947368421055,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da warst du schon strukturierter als ich, weil ich hatte keine Tabelle. Ich habe das alles immer als Bullet Points gemacht. Ich bin ein sehr großer Fan von Bullet Points. Wenn wir über Dokumentstrukturen sprechen, da gibt es natürlich jetzt keine Regeln. Das könnt ihr so aufsetzen, wie ihr wollt. Aktuell mache ich zum Beispiel mit meinem Vorgesetzten eine Dokumentstruktur, wo der erste Punkt Persönliches ist, das zweite Team, der dritte Punkt ist alles um die Arbeit, der vierte Punkt ist alles um die Stakeholder, der fünfte Punkt ist, gibt's irgendwas anderes, Arbeits-related, Business-technisch, und da reden wir jetzt nicht von irgendwelchen Status-Updates, sondern Weiterentwicklungsmöglichkeiten oder ähnliches, und der sechste Punkt sind dann Action-Points. Relativ simpel, sehr, sehr High-Level-Punkte, das bedeutet natürlich auch sehr viel Freiheit, und man kann eigentlich jedes Thema bringen, Aber auch andersrum, dass der Individual Contributor vielleicht mal Feedback an den Engineering Manager gibt in Bezug auf, wovon sollte ich, ich der Engineering Manager, mehr tun oder vielleicht sogar weniger? Welche Themen sollte ich lassen und welche Themen sollte ich gegebenenfalls sogar raushalten? Einfach nur mal Feedback von der einen Seite fragen.",
      "start": 2041815,
      "end": 2106607,
      "confidence": 0.8004247311827954,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, das ist auch eine riesen Chance für Engineering Manager, weil ich glaube, das wissen alle Manager, wie oft bekommt man eigentlich wirklich ehrliches Feedback? Sehr, sehr, sehr selten. Das heißt, da kann man wirklich die Chance nutzen und aktiv nach Feedback fragen und vielleicht wirklich ganz, ganz konkrete Fragen stellen, um da wirklich Feedback zu bekommen. Gibt auch noch eine andere Möglichkeit, dass man zum Beispiel Formular aussendet an alle Teammembers, wo man Feedback wirklich einsammelt aktiv. Das ist auch eine sehr gute Möglichkeit, weil es anonym ist. Aber es ist halt nicht so qualitativ, wie wenn man wirklich Feedback in dem 101 und im Idealfall ehrliches Feedback und kritisches Feedback unter Umständen bekommt zu dem Ganzen. Wir verlinken natürlich auch noch einige Blogartikel und Auflistungen von Fragen, die man stellen kann als Engineering Manager in 101s. Was mir persönlich auch immer gut gefallen hat, was ich dann später eigentlich oft gemacht habe, ist so eine Frage zu stellen, wie geht es dir aktuell in deinem Job von der Skala 1 bis 10? Und das war dann eigentlich die Einstiegsfrage in jedem 101. Wie geht es dir? Wie ist die aktuelle Situation? Und dann kann man auch so ein bisschen schauen, okay, wie war es letzte Woche? oder letzte zwei Wochen, hat sich was verändert? Wenn das runtergegangen ist, warum ist das jetzt so negativ? Und da sieht man eigentlich ganz schön die aktuelle Stimmung eigentlich im Team und bei den Leuten, wenn es zum Beispiel Stress gibt im Team, wenn irgendwie hoher Druck ist im Team, dass etwas fertiggestellt werden muss oder wenn es ein privates Problem gibt. Also das drückt ja dann auch auf die Arbeitswelt natürlich rein. Und so kann man das sehr schnell abfragen. und hat auch einen guten Eingangspunkt in das Meeting, wo man einfach weitermachen kann, ohne dass man irgendwie am Anfang fragt, ja, wie geht's denn? Und dann kommt man nie wirklich auf ein Thema hin, was man wirklich bearbeiten kann und genauer betrachten kann. Also das ist, glaube ich, eine ganz gute Einstiegsfrage.",
      "start": 2107098,
      "end": 2214772,
      "confidence": 0.7892244897959184,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Beim Thema Feedback muss man natürlich ein bisschen darauf achten oder eine Sache im Hinterkopf behalten. Wenn ihr natürlich jetzt ein One-on-One mit einem Teammitglied von euch macht, ihr seid jetzt der Engineering Manager und ihr fragt nach Feedback, dann besteht natürlich unter Umständen eine recht große Hemmschwelle bei dem Teammitglied, euch wirklich ehrliches Feedback zu geben, weil der Grund ist einfach nur, hierarchietechnisch steht ihr über dieser Person. Ihr entscheidet in der Regel über die Gehaltserhöhung, über die mögliche Karriere. Also ihr habt einen effektiven Einfluss auf die Karriere und das Leben dieser Person. Und das kann natürlich dazu führen, dass die Person euch kein reales, kein ehrliches Feedback gibt. Einfach nur aus Angst oder Ähnlichem.",
      "start": 2215135,
      "end": 2257960,
      "confidence": 0.823196581196581,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dazu ist es, glaube ich, auch ganz wichtig, dass man ganz konkrete Fragen stellt, also nicht nur, was mache ich denn gut, was mache ich schlecht, weil das ist immer sehr schwierig, aber man kann zum Beispiel ganz konkret fragen, okay, wir hatten dieses Teammeeting diese Woche und meine Präsentation am Anfang oder meine Vorschläge, was denkst du denn darüber oder wie würdest du das im Idealfall machen oder hast du da Ideen dazu, wie man das anders machen könnte oder vielleicht auch einfach die Schwäche unter Umständen zeigen, dass man sagt, okay, Ich würde das gerne verbessern, was es auch immer ist. Hast du Vorschläge, wie man das verbessern könnte? Und so kann man vielleicht auch versuchen, die Leute in die Richtung zu bringen, dass sie wirklich ehrliches Feedback geben, indem sie einfach Hilfe einem selber als Engineering Manager geben.",
      "start": 2258803,
      "end": 2300210,
      "confidence": 0.77468085106383,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eine andere Möglichkeit, um direktes Feedback zu kriegen, ist, macht doch mal One-on-ones mit euren direkten Peers. Das bedeutet, wenn ihr jetzt innerhalb eines Teams seid, ihres Software-Engineers, arbeitet mit fünf Leuten zusammen, macht doch gar nicht mal unbedingt immer nur One-on-ones mit eurem Chef oder eurer Chefin, sondern einfach mal mit eurem direkten Kollegen. Weil ihr steht auf derselben Ebene. Feedback zu geben ist da in der Regel deutlich einfacher. Das gilt natürlich auch für Engineering Manager. In der Regel habt ihr vielleicht andere Teams in der Firma, wo auch Engineering-Manager sind und macht einfach mal mit denen, tauscht euch doch da mal aus, was für Probleme haben diese Leute, um ein Team zu leiten. Und da werdet ihr feststellen, die Probleme sind in der Regel dieselben und ihr könnt auch so eine Art Peer-Coaching starten. Das hat mir oder uns damals auch sehr viel weitergeholfen. Da haben Wolfgang und ich uns auch sehr gut kennengelernt drüber.",
      "start": 2300533,
      "end": 2351096,
      "confidence": 0.769892405063291,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe so viel konstruktives Feedback vom Andi bekommen, dass ihr die 101 dann abgebrochen habt mit Andi.",
      "start": 2351516,
      "end": 2355877,
      "confidence": 0.5394444444444444,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wolfgang, was soll ich sagen, wenn man kacke ist, ist man kacke. Nein, lassen wir das. Zum Thema Dokumentation. Und wir sind ja alle Techies, und wir wollen natürlich immer Tooling haben zum Support von diesen One-on-Ones. Es gibt Tools, es gibt Software-as-a-Services. Lighthouse ist zum Beispiel so eins, oder Office Vibe hat auch eine One-on-One-Software. Wir müssen jedoch sagen, wir haben sowas nie benutzt. Wir waren da relativ old-fashioned und haben einfach, ich nenne es mal, digital Stift und Zettel genutzt. Aber man braucht auch wirklich nicht viel. Diese Tools geben einem natürlich ein bisschen mehr Struktur, wenn man damit anfängt. Diese Tools schlagen einem wirklich Fragen vor, Action-Points und geben dir vielleicht eine Checkliste. Ist vielleicht mal ganz cool zum Ausprobieren. Im Endeffekt haben sie mir zumindest nicht nur eingegrenzt bei der ganzen Thematik. Hast du irgendwelche Erfahrungen mit Tools gemacht, Wolfgang?",
      "start": 2356180,
      "end": 2410123,
      "confidence": 0.7527847222222221,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe auch nie Tools verwendet. Meine eigene Struktur war normal immer am einfachsten für alle Beteiligten. Ich glaube, diese Tools gehen auch sehr stark dann in Feedback von mehreren Seiten. Die haben ja dann so 360-Unterstützung und solche Geschichten. Also ich kenne dann schon wesentlich mehr und eigentlich für ein gutes 101, glaube ich, ist es viel, viel wichtiger, eine gute Atmosphäre zu haben und eine gute Vorbereitung und weniger ein Tool, weil die Vorbereitung musst du trotzdem machen.",
      "start": 2410942,
      "end": 2435399,
      "confidence": 0.7627624999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja zum thema vorbereiten habe ich immer da schiete ich immer so ein bisschen und zwar gibt es eine super seite.",
      "start": 2436039,
      "end": 2441702,
      "confidence": 0.7850476190476192,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt cheaten nicht cheaten.",
      "start": 2441742,
      "end": 2443704,
      "confidence": 0.5438,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Cheaten cheaten ich ich schummel ich schummel immer. Es gibt ein blog post von dezember 2015 der ist so top notch aktuell und zwar heißt der 101 fragen für ein one on one. Und jedes 101 öffne ich diese Webseite, diesen Blogpost und picke mir drei bis vier Fragen raus. Weil, wenn wir in dem 101 sind und die Person hat wirklich nichts vorbereitet, habe ich immer drei oder vier Fragen, die man stellen kann. Und da sind so interessante Gespräche daraus entstanden. Kann ich euch wirklich nur empfohlen. Verlinken wie auch in den Shownotes. Mein Lieblings-Blogpost. 101 Fragen für ein 101.",
      "start": 2443804,
      "end": 2482040,
      "confidence": 0.7622647058823532,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und die sind natürlich jetzt alle von Engineering Manager Perspektive ausgestellt, aber ihr könnt die auch auf der anderen Seite natürlich verwenden. Dreht die Frage einfach um und dann funktioniert sie auch von der anderen Seite. Also das könnt ihr natürlich genauso verwenden.",
      "start": 2482050,
      "end": 2494955,
      "confidence": 0.7995581395348835,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Thema Perspektivenwechsel, was mir gerade noch einfällt ist, wir haben natürlich darüber gesprochen, dass ihr euren Manager fragen könnt, hey, wie kann ich mich denn weiterentwickeln? Aber dreht die Frage doch einfach mal um. Fragt doch einfach mal gerade, wie euer Manager oder eure Managerin sich gerade selbst weiterentwickelt, weil es heißt ja nicht, dass nur ihr lernen müsst, sollt oder wie auch immer, sondern die Person, die euch leitet, soll natürlich auch dazu lernen. Einfach mal fragen und vielleicht challenge man da die Person, weil das ist nämlich auch eure Aufgabe und das dürft ihr natürlich auch tun.",
      "start": 2494975,
      "end": 2526240,
      "confidence": 0.7755050505050508,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das klingt eigentlich schon fast wie der Wink mit dem Zaunpfahl, den du da vorschlägst.",
      "start": 2526758,
      "end": 2531182,
      "confidence": 0.7611333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, vielleicht sogar zurecht. Ich meine, ich finde das immer gut, wenn die Teammitglieder einen auch mal wirklich challengen und auch zum Nachdenken auffordern. So nach dem Motto, hey, was habe ich eigentlich in letzter Zeit gelernt? Hey, und wieso habe ich denn jetzt gerade niemanden, der mich, der mir in den Arsch tritt oder ähnliches? Siehst du das anders?",
      "start": 2531282,
      "end": 2549420,
      "confidence": 0.7135999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe das eh schon kurz erwähnt, ich habe auch mal so ein ganz klassisches Formular ausgesendet, was dann anonym ausgefüllt werden konnte und das hat mir extrem viel gebracht. Also wenn Leute da wirklich dir sagen, was ihnen fehlt oder was du besser machen solltest, dann ist das natürlich extrem hilfreich, weil meistens sehen das eigentlich die meisten Leute gleich und du bekommst da durchaus zwei, drei Punkte, die für das Team wichtig sind und die du scheinbar nicht machst. Wenn du natürlich solche Leute in den 101 hast, die sich trauen sowas zu fragen, ist natürlich noch besser. Aber oft ist das halt nicht der Fall, dann kann man es über so eine Umfrage machen. Aber das zu wissen, ich glaube, das ist eigentlich die Stärke von einem guten Manager, dass er weiß, wo seine Schwächen liegen und wie er mit dem umgehen kann. Man kann ja nicht alle lösen, aber dass man zumindest weiß, dass es sie gibt und wie man damit richtig umgeht.",
      "start": 2550447,
      "end": 2599343,
      "confidence": 0.8150179640718564,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das war das Schlusswort zum Sonntag. Wir hoffen, wir konnten euch ein paar mehr Details zum Thema One-on-One liefern und wir hoffen auch, dass wir ein bisschen mit dem Mythos aufräumen konnten, warum es sich lohnt, dass ihr das Meeting vorbereitet. Mit vorbereiten meine ich nicht eine Stunde, sondern 10 Minuten, 15 Minuten vor dem Meeting reicht vollkommen und Falls ihr jetzt noch keine One-on-ones habt mit eurem Manager, mit euren Peers oder ähnliches, macht das doch mal. Setzt sie doch heute einfach mal an, schreibt eurem Manager einfach mal eine Nachricht im Slack oder per E-Mail. Hey, ich würde mich gerne regelmäßig mit Ihnen oder mit dir, je nachdem, wie eure Firmenkultur ist, austauschen. Wäre es möglich, dass wir alle zwei, drei Wochen mal ein Meeting führen, eine halbe Stunde nach dem Themen, die wir gerne besprechen könnten, wären 1, 2, 3. Direkt Vorschlag machen. Und in der Regel sagt da eigentlich nie jemand Nein.",
      "start": 2599782,
      "end": 2655538,
      "confidence": 0.8059807692307691,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder auch mit Peers zum Beispiel, mit anderen Leuten, die auf der gleichen Ebene sind. Oder vielleicht mit Kollegen wie Product Manager oder ähnliches. Die können auch, wie gesagt, sehr hilfreich sein.",
      "start": 2655578,
      "end": 2666742,
      "confidence": 0.8414999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wenn ihr wirklich nicht wisst, wie ihr am besten startet, schreibt uns eine E-Mail, dann helfen wir euch. Wir versuchen euch zumindest zu helfen. Gerne auch per kurzen Videocall, damit ihr an eure 1on1s kommt. Auf der anderen Seite würden wir natürlich auch gerne mal wissen, wie ihr eure 1on1s gestaltet. Was lief gut, was lief schlecht.",
      "start": 2667050,
      "end": 2684868,
      "confidence": 0.8038620689655174,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder habt ihr überhaupt 101s? Wäre auch schon mal interessant. Also sendet vielleicht einfach einen Tweet und erzählt uns mal, ob ihr überhaupt 101s habt und wie oft ihr 101s habt.",
      "start": 2685508,
      "end": 2695633,
      "confidence": 0.7625806451612903,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie immer erreicht ihr uns auf Twitter unter eng.kiosk und via E-Mail auf stetisch.engineeringkiosk.de.",
      "start": 2695673,
      "end": 2704577,
      "confidence": 0.7109285714285714,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wie immer die Bitte, wenn ihr die Episode gut gefunden habt, teilt die Episode, teilt den Link zum Podcast, damit wir auch mehrere Hörer und Hörerinnen bekommen. Und falls ihr Themenvorschläge habt, sind wir natürlich auch immer offen auf allen Kanälen, was wir denn in Zukunft noch so machen könnten, was euch interessiert und wo wir in irgendeiner Form weiterhelfen können. Ich habe aufgehört zu reden, du musst weiterreden.",
      "start": 2705285,
      "end": 2737072,
      "confidence": 0.848,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich weiß nicht, was ich noch sagen soll.",
      "start": 2737793,
      "end": 2739435,
      "confidence": 0.45625,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist immer, weil ich so alle umfassende Aussagen habe. Ich weiß, es ist schwierig.",
      "start": 2739495,
      "end": 2744801,
      "confidence": 0.7476666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was war jetzt dein letztes Wort?",
      "start": 2744861,
      "end": 2747464,
      "confidence": 0.5989999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, du hörst mir nicht ordentlich zu. Ich habe es schon gemerkt.",
      "start": 2747804,
      "end": 2752529,
      "confidence": 0.41892307692307695,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, teilt den Link, ja? Ja. Vielen Dank.",
      "start": 2752629,
      "end": 2755813,
      "confidence": 0.46099999999999997,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.7951153461634618,
  "audio_duration": 2756.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
