{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/ZzsWCprcj2tSi8z/download/ep_100.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "b32af857-9e44-4c96-8019-fd186c3fe37f",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk. Cool, dass du wieder dabei bist. Heute geht es um das Thema...",
            "start": 3020,
            "end": 8740,
            "confidence": 0.7758,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Guten Morgen, guten Mittag oder auch guten Abend. Herzlich willkommen zu Folge 100 des Engineering Kiosk. Mein Name ist nicht Andi Grunwald und ich bin auch nicht Wolfgang Gassler. Mein Name ist Matthias Entler und ich habe heute die große Ehre, durch diese ganz besondere Jubiläumsausgabe des Engineering Kiosk zu führen. Wie ihr bereits hören könnt, werden heute einige Dinge etwas anders laufen als sonst. Wir haben ein ganz besonderes Programm. Eine kleine Feierepisode, wenn man so will. Und wir wollen euch heute das ein oder andere Schmunzeln auf die Lippen zaubern. Und dafür haben wir... den Sack voll mit Überraschungen, ein Kessel buntes sozusagen.",
            "start": 12825,
            "end": 57773,
            "confidence": 0.8615523809523808,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Müsste man eine Knetlisse auf die Ohren zaubern, anstatt auf die Lippen?",
            "start": 57793,
            "end": 61335,
            "confidence": 0.7315,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich glaube, jetzt hast du einigen Leuten schon ein Schmunzeln auf die Lippen gezaubert. Das geht von den Ohren auf die Lippen.",
            "start": 61355,
            "end": 69018,
            "confidence": 0.8086818181818182,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ins Herz.",
            "start": 69058,
            "end": 69819,
            "confidence": 0.924,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wolfgang, du machst mir eine ganze Einleitung kaputt. Ich würde einfach sagen, bevor wir loslegen, ich will euch herzlich begrüßen, Andi und Wolfgang, zu eurer hundertsten Jubiläumsfolie. Seid ihr nervös?",
            "start": 69839,
            "end": 80344,
            "confidence": 0.7307999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe Angst. Ich habe Angst. Ich bin nicht nervös. Ich habe Angst.",
            "start": 81144,
            "end": 84407,
            "confidence": 0.7927692307692309,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Natürlich bin ich aufgeregt, weil ich habe ja nichts mehr unter Kontrolle. Normal haben wir da so ein Skript, wissen, wo wir hinlaufen. In dem Fall haben wir keine Ahnung. Wobei es auch sehr angenehm. Also man kann die Verantwortung komplett übergeben.",
            "start": 84447,
            "end": 96399,
            "confidence": 0.8473809523809521,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wolfgang, der alte Micromanager. Verschisse, gibt dir die Kontrolle ab, beziehungsweise wird ihm die Kontrolle entzogen. Freiwillig hat er das ja hier nicht gemacht. Ja, dann kommt da ein Zittern.",
            "start": 96419,
            "end": 104667,
            "confidence": 0.7051666666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es war deine Idee, Andi, da was Spezielles zu machen.",
            "start": 105131,
            "end": 107937,
            "confidence": 0.8333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Gutes Stichwort, weil die Frage ist nämlich eigentlich, was machen wir heute? Wir haben uns natürlich im Vorfeld trotzdem ein paar Sachen überlegt. Und wir haben uns gefragt, wie kann man das Ganze ein bisschen interessanter gestalten. Und wir sind mit drei Ideen mal ins Rennen gegangen. Und ich würde jetzt einfach sagen, wir fangen einfach mal an. Wir wollen gar nicht mal zu viel verraten. Um es ganz kurz zusammenzufassen. Andi und Wolfgang bekommen jetzt jeweils die gleiche Schätzfrage. Und sie müssen dann einen Tipp abgeben. Und dann wird die Schätzfrage natürlich aufgelöst. Aber der Clou ist, Wer am weitesten entfernt liegt, insgesamt, also wenn man alle Schätzfragen zusammenzählt, wer am weitesten entfernt liegt, der spendet 100 Euro an ein Open Source Projekt.",
            "start": 107957,
            "end": 153718,
            "confidence": 0.7871290322580644,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oder an mehrere, oder?",
            "start": 153758,
            "end": 154920,
            "confidence": 0.60675,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder an mehrere. Es müssen halt insgesamt 100 Euro sein und die kommen aus eurer privaten Tasche. Nicht aus irgendeinem Werbebudget, sondern das muss schon schmerzen. Ich denke, ihr könnt es verkraften. Aber es ist, glaube ich, eine coole Art und Weise, an Open Source zurückzugeben. Könnte fast eine Tradition werden eigentlich.",
            "start": 154960,
            "end": 170407,
            "confidence": 0.7085384615384616,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Damit wir da mal die Regeln klar machen, weil dann kommt sonst Andy wieder um die Ecke und kommt mit seinen Spezialregeln. Insgesamt am weitesten weg, wird dann pro Frage des gewertet oder werden wirklich die Unterschiede zusammengezählt?",
            "start": 170427,
            "end": 182372,
            "confidence": 0.8422105263157894,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also, wenn man jetzt wirklich die Summe bilden würde, dann würden da Zahlen rauskommen, die absolut unverhältnismäßig sind. Deswegen würde ich tatsächlich auch sagen, jede einzelne Frage zählt einen Punkt und ganz am Ende zählen wir die Punkte eben zusammen. Jeder kriegt einen Punkt und der Verlierer mit weniger Punkte, der macht dann mal den Geldbeutel auf.",
            "start": 182732,
            "end": 202910,
            "confidence": 0.8688596491228071,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, das bekommen wir hin.",
            "start": 203751,
            "end": 205672,
            "confidence": 0.5282,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wer sind unsere Gäste heute?",
            "start": 205692,
            "end": 207054,
            "confidence": 0.89,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir, wir zwei sind die Gäste, Matthias, hast du falsch verstanden.",
            "start": 208033,
            "end": 211054,
            "confidence": 0.6155454545454546,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, aber du hast mich falsch verstanden, weil irgendjemand muss ja auch die Fragen stellen. Und das ist ja nicht jetzt irgendwer. Wir haben uns natürlich ein paar Gedanken gemacht und haben uns gedacht, wer könnte vielleicht in Frage kommen bei so einer wichtigen hundertsten Folge? Wen könnte man einladen? Wen könnte man fragen? Und wir sind halt ganz schnell auf ein paar besondere Menschen gekommen. Fans von euch, andere Podcaster, die Prominenz, die Creme de la Creme. Und bevor wir jetzt weiter labern, fangen wir jetzt einfach mal an mit der ersten Frage von einer bekannten Person. Ich schieße jetzt einfach mal los.",
            "start": 211094,
            "end": 244049,
            "confidence": 0.7956346153846154,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Moment, Moment, bevor du da los startest, Andi, ich habe dein Video im Auge, also wenn du da tippen anfängst und da googlest oder am Handy rumspielst, ich sehe das genau.",
            "start": 244089,
            "end": 253620,
            "confidence": 0.8202580645161289,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber einen Zettel darf ich haben, oder? Welchen Zettel?",
            "start": 253660,
            "end": 256063,
            "confidence": 0.5047777777777778,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist schon ein oldschool Zettel wirklich. Kein E-Ink.",
            "start": 256123,
            "end": 259846,
            "confidence": 0.6020000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wofür brauchst du einen Zettel?",
            "start": 259867,
            "end": 260748,
            "confidence": 0.26759999999999995,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also, Wolfgang, wir committen uns beide ganz offiziell, wir cheaten nicht. Das ist ... Also, das möchte ich jetzt aus deinem Munde hören. Weil du spielst immer mit gezinkten Karten.",
            "start": 261171,
            "end": 272700,
            "confidence": 0.8166666666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, ich cheate sowieso nie, wenn dann cheate ich. Aber ich cheate auch nicht in dem Fall, ja. Weder cheaten noch cheaten noch sonst was. Ich bin ganz brav, ich bin ja ein fairer Gegner, bitte. Aus dem verlierst du sowieso keine Chance.",
            "start": 272740,
            "end": 285570,
            "confidence": 0.7556511627906976,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und wir schießen los gleich mit der ersten. Hallo, ihr beiden, Arne hier. Ich habe den Endler gefragt, ob ich euch so ein bisschen dissen darf und.",
            "start": 285610,
            "end": 293290,
            "confidence": 0.6558148148148149,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der meinte, ja klar. Okay, auf geht's.",
            "start": 293310,
            "end": 296131,
            "confidence": 0.7611428571428572,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich wollte euch nämlich ursprünglich so eine richtig schöne Low-Level-Frage stellen, so ein richtig hartes Teil. Aber dann fiel mir ein, ihr seid ja schon eigentlich seit mehreren Jahren im Management versackt. Das kriegt ihr nicht mehr hin. Also nehmen wir was fluffiges, High-Level-mäßiges. Wie ihr wisst, bin ich ja Freund der Google Cloud, aber Google selber hat sich in den letzten Jahren ja nicht sehr mit Ruhm bekleckert. Deswegen hier meine Frage. Wie viele Services hat Google seit 2006 eingestellt? Und mit Services meine ich so Sachen wie Google Plus oder Google Reader, nicht so was wie Cardboard oder Glasses oder wieder ganze Kram. Also, wie viele Services seit 2006? Ich sage ja, es wird nicht leicht.",
            "start": 296191,
            "end": 337158,
            "confidence": 0.7510593220338984,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Andi, willst du mal erklären, wer Arne ist?",
            "start": 337198,
            "end": 338939,
            "confidence": 0.6955,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Arne ist ein ehemaliger Mitarbeiter aus einem meiner Teams bei Trivago. Der ist als PHP-Entwickler eingestellt worden und ist inzwischen seit Reliability Engineer verantwortlich für den Großteil der Trivago Cloud-Infrastruktur.",
            "start": 338999,
            "end": 353705,
            "confidence": 0.8372333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und war auch federführend beim Umstieg in GCP, richtig?",
            "start": 353745,
            "end": 357827,
            "confidence": 0.8258888888888889,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Hatte da eine sehr starke Rolle.",
            "start": 357847,
            "end": 359748,
            "confidence": 0.7841666666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es ist voll lustig, dass du ihn, Arne, als PHP-Ingenieur vorgestellt hast.",
            "start": 360858,
            "end": 366139,
            "confidence": 0.6135833333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Er freut sich sicher, ja.",
            "start": 366179,
            "end": 369420,
            "confidence": 0.5820000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Er hat einen Background in der Spieleentwicklung und sehr stark im C++-Bereich. Damals hat er bei Trivago dennoch offiziell als PHP-Entwickler angestartet.",
            "start": 369460,
            "end": 379743,
            "confidence": 0.7940454545454546,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Seit 2006 war das, oder?",
            "start": 379783,
            "end": 380663,
            "confidence": 0.5506,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die Frage wird nicht wiederholt. Die zwei Kollegen schreiben jetzt gerade fleißig auf ihren Zettel. Ich höre auch schon die Kugelschreiber. Der kennt wahrscheinlich die Antwort auswendig. Andi sagt 52. Wolfgang sagt, kann ich nicht lesen. 212. Okay. Also einer von euch ist es auf jeden Fall himmelweit entfernt. Aber ja. Spannend, ja. Ich möchte nicht tauschen mit euch. Es wird auch nicht leichter. Aber gut. Die richtige Antwort, Leute, 210. Wenn man alle Sachen zusammennimmt, die Google so über die Zeit gekillt hat, dann sind das etwa 290 Stück. Nachzulesen bei killtbeigoogle.com. Interessante Seite. So, ich hoffe, euer Podcast wird nicht von Google gekillt und ihr werdet die nächsten 100 Folgen auch weiter aufnehmen. Insofern noch viel Spaß mit eurem Management-Späti und den anderen Fragen, die dann noch kommen. Bis dahin, Schüsseldorf. Ja, also erstes Mal natürlich Wolfgang Hack gewonnen, um das jetzt mal irgendwie festzuhalten. Aber woher wusstest du das so genau?",
            "start": 382108,
            "end": 439618,
            "confidence": 0.7615909090909092,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hatte das schon mal öfters gehört, aber hatte keine genaue Zahl mehr im Kopf.",
            "start": 439658,
            "end": 444000,
            "confidence": 0.7818666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Andi, wie fühlt sich das an?",
            "start": 444805,
            "end": 446086,
            "confidence": 0.5731666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich hab erst gedacht, okay, Google Reader und so weiter, die populären, und da hab ich gesagt, seit 2006, glaub ich, war das Jahr, und dann dachte ich, hm, okay, da sind doch noch ein paar mehr vielleicht, die ich nicht kenne, aber, jo, ich hab das ein bisschen unterschätzt. Aber kommen ja noch ein paar.",
            "start": 446126,
            "end": 463132,
            "confidence": 0.6723508771929825,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, also noch ist nichts verloren, 1 zu 0 für den Wolfgang, und wir gehen direkt rein in die nächste Frage.",
            "start": 463152,
            "end": 470875,
            "confidence": 0.8292380952380953,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich freue mich sehr, in eurer 100. Folge dabei zu sein. Vielen lieben Dank für die Einladung. Ihr seid ja so große Open-Source-Fans, deswegen würde ich von euch gerne wissen, wie viele Commits hat der Linux-Körnel auf GitHub auf dem Masterbranch? Uh, squashen die beim Merge?",
            "start": 471767,
            "end": 489843,
            "confidence": 0.8116956521739127,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Weiß das jemand? Du kannst keine Frage stellen, bitte, Andi.",
            "start": 489883,
            "end": 492465,
            "confidence": 0.5757999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ist aber schon eine relevante Frage eigentlich.",
            "start": 493757,
            "end": 497260,
            "confidence": 0.5842857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja und?",
            "start": 497280,
            "end": 498001,
            "confidence": 0.738,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was weiß ich denn? Also ich weiß es zufälligerweise, aber ich sag's dir nicht.",
            "start": 498081,
            "end": 503786,
            "confidence": 0.6208571428571429,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bist du schon bereit, Andi? Mach mal weiter da.",
            "start": 503826,
            "end": 506028,
            "confidence": 0.6938888888888888,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "So, dann will ich mal die Ergebnisse sehen. Der Andi sagt 1,5 Millionen, also 1.500.200 aus irgendeinem Grund. Genauer hättest du es nicht machen können. Und Wolfgang, du brauchst eine bessere Webcam. Einen Komet? Ah, ich verstehe, was deine Strategie war.",
            "start": 506048,
            "end": 524020,
            "confidence": 0.5987804878048782,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist wie beim Bohlen oder beim Kegeln Sicherheitswürfe zu machen.",
            "start": 524041,
            "end": 527844,
            "confidence": 0.849909090909091,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, nein, nein, das hat überhaupt nichts damit zu tun. Ich habe gar nicht gewusst, ob du höher oder niedriger bist. aber die frage kommt ja von christian braun und der mensch von index out of bounds von dem podcast hat immer nur solche sachen im kopf und ich bin mir sicher das ist irgendwie eine fangfrage und darum eins weil es github war er hat github so betont und linux kernel ist nicht auf github aber ein mirror ja ich glaube dass das wirklich nur gepusht wird und dadurch immer nur ein comet ist meine theorie aber lasst mal hören.",
            "start": 527964,
            "end": 559378,
            "confidence": 0.7519603960396037,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich beziehe mich hier auf den Stand vom 28. November um 21.11 Uhr. Und hier hat der Linux-Kernel auf dem Masterbranch auf GitHub 1.234.113 Commits. Und der letzte Commit ist genau eine Stunde her. Also, Wolfgang, ich würde mich sehr, sehr, sehr wundern, wenn ein Linux-Körneln, der auf Git versioniert ist, wofür Git eigentlich auch geschrieben wurde, ja? Wir führen uns mal kurz die Historie in den Kopf. GitHub nicht einfach als Remote anbinden würde und einfach ein Git-Push-Origin ... Git-Push nach GitHub machen würde und nicht alles in einen Comet-Squash würde. Das würde mich sehr wundern.",
            "start": 561673,
            "end": 602247,
            "confidence": 0.7608762886597938,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Stimmt, hast du natürlich recht. Was hast du jetzt geschätzt?",
            "start": 602727,
            "end": 604728,
            "confidence": 0.5044,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Eine Million fünfhunderttausendundzweihundert Git-Comits und der war bei 1,3 Millionen Leute.",
            "start": 605764,
            "end": 610509,
            "confidence": 0.5235454545454545,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nicht schlecht, nicht schlecht Herr Specht.",
            "start": 610529,
            "end": 614292,
            "confidence": 0.5143333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was mich eigentlich wundert ist, wie erschreckend genau ihr an der richtigen Lösung wart. Also beide natürlich von euch getrennt bei anderen Fragen, aber trotzdem. Das finde ich spannend. Hätte ich nicht gedacht. Gut, wir hören mal weiter.",
            "start": 614312,
            "end": 625523,
            "confidence": 0.8201578947368422,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hallo ihr zwei, alles Gute zur 100. Folge Engineering Kiosk. Meine Frage ist weniger technisch und lautet, wie viele Gruppen gibt es weltweit mit dem Thema MySQL auf meetup.com?",
            "start": 626163,
            "end": 637640,
            "confidence": 0.8086896551724138,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war der Dommel, auch ein sehr geschätzter Ex-Kollege vom Andi und vom Wolfgang von Trivago. Grüße gehen raus.",
            "start": 638192,
            "end": 646854,
            "confidence": 0.7904736842105266,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und der Co-Organisator vom Web-Engineering-Meetup Düsseldorf, mit dem ich das seit knapp über 10 Jahren mache. Und der hat sich angehört, als war der gestern in einem Düsseldorfer Brauhaus und ist gerade aufgestanden.",
            "start": 646894,
            "end": 656977,
            "confidence": 0.7805151515151515,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Entweder das, oder er hatte einfach eine anstrengende Nacht mit seinen Kindern.",
            "start": 657298,
            "end": 660400,
            "confidence": 0.785,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und ebenfalls einen Ninja-Vader.",
            "start": 660460,
            "end": 662661,
            "confidence": 0.7495,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt ist natürlich die Frage, hat er da MySQL eingegeben und auf Enter gedrückt, oder ist er irgendwie bei Oracle in dieses Pro-Meetup gegangen und hat sich die MySQL-Community rausgeholt? Du kannst ja bei Meetup wieder so Pro-Gruppen gründen und dann geografische Meetups runterbündeln. Das ist natürlich dann jetzt schon eine andere Anzahl.",
            "start": 662681,
            "end": 681033,
            "confidence": 0.7798301886792454,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, jetzt komm da nicht mit den Ausreden, Andi. Komm da mit einer Zahl um die Ecke. Ja, ich hab's.",
            "start": 681053,
            "end": 688379,
            "confidence": 0.6559,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin's auch. 470 vom Andi versus 1700. Ich lass es dir ab jetzt hier mal vorlesen.",
            "start": 688439,
            "end": 693767,
            "confidence": 0.6020000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie viel hast du, Andi? 470. Viel zu wenig. Die richtige Antwort ist 455. 2 zu 1. Wie kommst du denn auf 1.000 und noch was?",
            "start": 694348,
            "end": 710731,
            "confidence": 0.7381923076923077,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie kommst du auf 400?",
            "start": 710751,
            "end": 711361,
            "confidence": 0.604,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab mir gedacht, im Durchschnitt 10 Meetups pro Land. Das wären ja schon irgendwie 3.000. So viele sind's nicht, dann hab ich die Hälfte genommen.",
            "start": 711371,
            "end": 720613,
            "confidence": 0.648576923076923,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich glaub, eine ganze Menge Länder haben keine Meetups zum Thema MySQL.",
            "start": 720993,
            "end": 726314,
            "confidence": 0.7880833333333332,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das gibt's nicht. Ich hab ja allein 200 in Deutschland wahrscheinlich. Egal.",
            "start": 726334,
            "end": 729975,
            "confidence": 0.46941666666666665,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Faszinierend. Wer meilenweite von entfernt gewesen oder vielleicht bist du einfach auch zu viel auf mieter.com an.",
            "start": 729995,
            "end": 737097,
            "confidence": 0.7377647058823529,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich muss noch niemals geld eingegeben.",
            "start": 737137,
            "end": 740738,
            "confidence": 0.7776666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt kommt eine frage die ist weniger auf den endige bei ist. Moin aus hamburg vom super duper developers club schön dass ich dabei sein darf ich habe eine frage aus dem php bereich. Ich glaube, wir kennen alle das Symfony-Framework. Was glaubt ihr, wie viele Menschen bereits an diesem System mitgearbeitet haben? Ich meine, man kennt immer die großen zwei, drei, vier Leute, aber auf GitHub, wie viele Contributors glaubt ihr, hat das System?",
            "start": 740758,
            "end": 767344,
            "confidence": 0.7918133333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich kenne nicht mal die zwei, drei, vier großen Leute von Symfony.",
            "start": 767685,
            "end": 771927,
            "confidence": 0.7526666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wieder die Frage, zählt ja das Core-Framework oder auch die Komponente dazu?",
            "start": 771947,
            "end": 776709,
            "confidence": 0.6905,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, Symfony-Framework, oder?",
            "start": 776789,
            "end": 778070,
            "confidence": 0.47833333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich geh mal stark davon aus, github.com slash symphony slash symphony. Also, das Core-Framework.",
            "start": 778984,
            "end": 783928,
            "confidence": 0.6212857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Uh, da bin ich sehr schwach. Wie viel Contribute ist richtig?",
            "start": 784008,
            "end": 787651,
            "confidence": 0.4338181818181818,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Moment, Moment.",
            "start": 787671,
            "end": 788832,
            "confidence": 0.4905,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sag doch einfach deine Zahl.",
            "start": 788872,
            "end": 793015,
            "confidence": 0.5188,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "2.300. Ich hab 850.",
            "start": 793025,
            "end": 794406,
            "confidence": 0.53925,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Tatsächlich sind es 2.885 Personen, die da mitgemacht haben. Natürlich sind da auch kleine Sachen dabei, wie da hat mal jemand einen Rechtschreibfehler gefixt, das war ich. Aber ich glaube, es ist total wichtig zu sehen, dass diese großen Frameworks einfach von der Community leben und dass wir alle glücklich sein können, dass 2.885 Leute Spaß daran hatten, da mitzumachen und so.",
            "start": 794416,
            "end": 817515,
            "confidence": 0.846258064516129,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ein Framework besser machen.",
            "start": 817535,
            "end": 818636,
            "confidence": 0.541,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dann viel Spaß mit den nächsten 100 Folgen und danke, dass ich dabei sein durfte. Danke auch.",
            "start": 818656,
            "end": 823240,
            "confidence": 0.7498823529411764,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sportlich.",
            "start": 823300,
            "end": 823701,
            "confidence": 0.588,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Frage oder die Antwort?",
            "start": 824021,
            "end": 825903,
            "confidence": 0.49939999999999996,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hast einfach keine Ahnung, Andi.",
            "start": 826103,
            "end": 828785,
            "confidence": 0.4208333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Merkt man schon. 2.000 Contributor-Managing ist schon eine harte Nummer. Ja, geil. Finde ich super, dass so viele Leute immer noch PHP schreiben.",
            "start": 828805,
            "end": 835901,
            "confidence": 0.3822608695652173,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hallo Wolfgang, lieber Andi. Herzlichen Glückwunsch zur 100. Sendung des Engineering Kiosk. Ihr vermittelt uns die faszinierende Welt der Softwareentwicklung und inspiriert unzählige Hörer. Auf viele weitere spannende Episoden. Macht weiter so. Cheers. Auf die nächsten 100. Und hier kommt die Schätzfrage. Wie viele Dollarzeichen werden in der englischsprachigen Dokumentation der Programmiersprache PHP verwendet?",
            "start": 835941,
            "end": 858579,
            "confidence": 0.8257962962962964,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Boah. Meine Frage ist eher, wie hat er die denn gezählt? Mit den Kommentaren oder ohne?",
            "start": 859099,
            "end": 864347,
            "confidence": 0.694625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In der Dokumentation, oder?",
            "start": 864567,
            "end": 866229,
            "confidence": 0.8265,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, ja, die PRP-Dokumentation hat Kommentare, Wolfgang, das solltest du aber wissen.",
            "start": 866269,
            "end": 870115,
            "confidence": 0.6401666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ach so, du meinst die unten Angehängten. Du mit deinen Details da immer.",
            "start": 870175,
            "end": 874121,
            "confidence": 0.7128461538461538,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also ich würde schon fast sagen, in den Kommentaren sind mehr Dollarzeichen als in der eigentlichen Dokumentation.",
            "start": 874817,
            "end": 879441,
            "confidence": 0.7671176470588236,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war Markus Pörschke. Was gibt es zu Markus zu sagen, außer er ist ein super Typ, uns favorit. Ich hoffe auch, dass er irgendwann mal in die Politik einsteigt.",
            "start": 879481,
            "end": 887767,
            "confidence": 0.7729999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ein ehemaliger Kollege und scheinbar braver Hörer.",
            "start": 887807,
            "end": 891370,
            "confidence": 0.8787142857142857,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und anscheinend PHP-Programmierer. Ich bin so weit, Wolfgang.",
            "start": 891390,
            "end": 894272,
            "confidence": 0.8009999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, ich bin noch nicht so weit. Ich muss mal kurz rechnen.",
            "start": 894352,
            "end": 895873,
            "confidence": 0.3560833333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nicht nur irgendein PHP-Entwickler, also. Da kann man schon ein bisschen rumnehmen.",
            "start": 895893,
            "end": 899116,
            "confidence": 0.4090000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann hat die zum letzten Mal auf der Forst im letzten Jahr gesehen bei einem Bier. Also da hoffe ich, dass wir dieses Jahr auch wieder uns treffen. Und natürlich viele andere Leute.",
            "start": 899627,
            "end": 907732,
            "confidence": 0.8160000000000002,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Unbedingt. Wie sieht's aus?",
            "start": 907812,
            "end": 909153,
            "confidence": 0.397,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich hab meine Zahl, ich bin ready. Verstehst du? Die ist wie bei der, bei irgendeiner Prüfung in der Uni, ja? Nimm das erste Bauchgefühl, das ist eh immer richtig.",
            "start": 909173,
            "end": 918339,
            "confidence": 0.6253870967741937,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay. 10,5 Millionen.",
            "start": 920020,
            "end": 923102,
            "confidence": 0.6446666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich hab 75 Millionen. Ich hab einfach die Kommentare mitgenommen.",
            "start": 923142,
            "end": 926545,
            "confidence": 0.7232,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ach ja, jetzt die Ausreden. Die richtige Antwort lautet 69.860 Dollarzeichen. Bitte?",
            "start": 927105,
            "end": 934647,
            "confidence": 0.6936666666666665,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Dafür, dass eine Variable mit einem Dollarzeichen initiiert wird, finde ich es aber schon recht wenig. Aber Respekt, Wolfgang.",
            "start": 934687,
            "end": 940309,
            "confidence": 0.6992631578947369,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, ich war da auch weit, weit weg, muss ich zugeben.",
            "start": 940650,
            "end": 943331,
            "confidence": 0.6608181818181817,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Du hast gewonnen aktuell nach fünf Fragen. Führst du nämlich 3 zu 2. Ich halte hier nämlich die Punkteliste mit. Ich bin enttäuscht. Ich habe gedacht, da sind mehr.",
            "start": 943351,
            "end": 952475,
            "confidence": 0.6685862068965516,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bis jetzt seid ihr eigentlich ziemlich gleich auf.",
            "start": 953324,
            "end": 955647,
            "confidence": 0.6819999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "3 zu 2 ich führe natürlich.",
            "start": 955657,
            "end": 958430,
            "confidence": 0.6505000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir schauen mal wer am Ende den I told you so dance macht. Lieber Andi, lieber Wolfi, herzlichen Glückwunsch zu 100 Folgen Engineering Kiosk. Meine Frage lautet, wie wir alle wissen, ist WordPress das CMS, was die meisten Seiten im Web antreibt. Aber wie viel Prozent sind es genau? Das war der Shep vom Working Draft Podcast und irgendwie sind wir sehr PHP lastig mit den Fragen hier aktuell.",
            "start": 958450,
            "end": 981480,
            "confidence": 0.783550724637681,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man merkt halt doch, dass wir aus dem PHP Bereich ursprünglich irgendwie kommen.",
            "start": 981520,
            "end": 985443,
            "confidence": 0.7338461538461539,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist halt euer Netzwerk.",
            "start": 985483,
            "end": 986984,
            "confidence": 0.7552,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie viel Prozent weltweit?",
            "start": 987024,
            "end": 988585,
            "confidence": 0.90675,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Mal eine kurze Frage hier. Wie viele WordPress-Seiten betreibt ihr beide so?",
            "start": 989292,
            "end": 994374,
            "confidence": 0.7735833333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, ich demnächst eine wieder.",
            "start": 994454,
            "end": 998876,
            "confidence": 0.7168,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So, okay. Also bei drei Leuten wird eine WordPress-Seite schon mal betrieben. Okay, das rechne ich jetzt hoch.",
            "start": 998936,
            "end": 1004678,
            "confidence": 0.7473333333333332,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bist du soweit, Wolfgang? Natürlich. Okay.",
            "start": 1004698,
            "end": 1007379,
            "confidence": 0.5485,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin bei acht Prozent.",
            "start": 1007419,
            "end": 1008800,
            "confidence": 0.8064,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Elf Prozent.",
            "start": 1008840,
            "end": 1009380,
            "confidence": 0.6395,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Schaut man in den WebAlmanack 2022, der insgesamt 8,4 Millionen Seiten untersucht hat, dann liegt WordPress bei einem Anteil von 35%. What?",
            "start": 1010056,
            "end": 1018039,
            "confidence": 0.766681818181818,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Andi, wieso hast du nicht einfach hochgerechnet? Ein Drittel.",
            "start": 1018059,
            "end": 1025521,
            "confidence": 0.5796666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist doch gemein. Ich hatte gedacht die Gruppe ist hier nicht so ganz repräsentativ.",
            "start": 1025643,
            "end": 1033489,
            "confidence": 0.6399333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wie ist der Zwischenstand?",
            "start": 1034130,
            "end": 1035531,
            "confidence": 0.7007999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Leider führt der Wolfgang mit 4 zu 2.",
            "start": 1035570,
            "end": 1039304,
            "confidence": 0.783375,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So wie immer.",
            "start": 1039314,
            "end": 1039894,
            "confidence": 0.5143333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Als Gewinnertyp.",
            "start": 1039934,
            "end": 1040895,
            "confidence": 0.762,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir kommen darauf wieder zurück. Wir machen aber erstmal weiter. Wir hatten noch eine andere Kategorie und wir nennen die Lookback. Die Idee ist, in den letzten zwei Jahren, das heißt in der Zeit, in der es jetzt Engineering Kiosk gibt, sind ja einige technische Sachen, angefallen über die man reden könnte und die frage ist was waren die highlights dieser letzten zwei jahre das kann, verrückt sein das kann komisch sein das kann schockierend sein was auch immer und die auswahl der themen, stand euch komplett frei ihr musstet euch jeweils drei themen überlegen es kann natürlich sein dass es jetzt, so eine überlappung gibt das ist aber eigentlich auch gar.",
            "start": 1040915,
            "end": 1081305,
            "confidence": 0.847428571428571,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nicht schlimm und moment wir haben gesagt nur zwei themen oder ist doch egal.",
            "start": 1081325,
            "end": 1085588,
            "confidence": 0.657,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jetzt, Wir können gerne über mehr reden aber ja vielleicht fangen wir einfach mal mit andies ersten einfall an was hast du denn auf dem zettel stehen.",
            "start": 1085628,
            "end": 1095073,
            "confidence": 0.6527037037037039,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also eine sache muss ich erst mal sagen ich weiß gar nicht mehr was ich letzte woche zu mittag hatte und jetzt zwei jahre zurück gucken und dann zu reflektieren was ist eigentlich da alles passiert war unglaublich schwierig normalerweise für den job habe ich ein document dafür damit schreibe ich dann immer alles auf aber, Irgendwie habe ich das die letzten zwei Jahre zumindest nicht für die Tech-Geschehnisse gemacht, aber ich habe trotzdem ein paar Sachen gefunden. Und zwar eine Sache, die mir wirklich sehr am Herzen liegt und da würde ich sagen, die ganze Sache hat mir so viel gegeben und da habe ich auch wirklich sehr viel darüber gelernt, auch gelacht, ist Hacker News wurde 15 Jahre alt. Ist das nicht Wahnsinn? Diese Webseite, die ich glaube uns alle antreibt und die komischste Selektion an Tech-Themen hat, meines Erachtens nach, wurde im februar 22 ganze 15 jahre alt alles ist.",
            "start": 1095673,
            "end": 1145861,
            "confidence": 0.8014052287581698,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Schon ein bisschen jetzt ein geburtstag zu nehmen der sich quasi auf die 15 jahre davor auch noch beruht.",
            "start": 1145881,
            "end": 1151444,
            "confidence": 0.8095263157894738,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wieso weiß ich jetzt nicht aber was ist der news ist damals gestartet als, interner Link-Inkubator, wenn man so möchte, als Linksammelsorium für den Startup-Inkubator Y-Combinator, dass die Startups von Y-Combinator interessante Artikel aus dem Bereich Tech und Co. teilen konnten. Das war public, und irgendwie ist das dann durchgegangen.",
            "start": 1151584,
            "end": 1177287,
            "confidence": 0.8227200000000003,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So we read it, im Endeffekt.",
            "start": 1177307,
            "end": 1178248,
            "confidence": 0.37066666666666664,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja war Reddit am Anfang intern?",
            "start": 1178708,
            "end": 1180088,
            "confidence": 0.7201666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, Reddit wurde von Y Combinator total gefördert sogar. Ich glaub die hatten eine Y Combinator Förderung am Anfang dabei und dann wurden die an Korn den Nass verkauft und so weiter. Im Endeffekt Reddit für alte Leute, kann man das so sehen.",
            "start": 1180148,
            "end": 1194373,
            "confidence": 0.74546511627907,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber warum, warum, warum hat der Hacker News mir so viel gegeben? Also ich finde Hacker News, ich habe es eine ganze Zeit lang jeden Abend gelesen und da kommen halt wirklich, wirklich interessante Artikel drauf und dann in den Kommentaren ist auch immer wirklich, da geht der Punk ab, keine Ahnung, da kommt irgendein Artikel über Dropbox oder über Wurzel, zwei Minuten später ist der CEO und CTO in den Kommentaren und kommentiert damit. Also, da ist wirklich, wirklich was los. Und ich lerne da wirklich jeden Tag immer noch aus den Kommentaren. Also, Respekt. Ich glaub, wir sind alle drei Hacker-News-Leser, ist das richtig?",
            "start": 1195333,
            "end": 1228555,
            "confidence": 0.7923679245283018,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Weil ich habe ja euch beide. Und wenn's was Interessantes gibt auf Hacker-News, dann bekomme ich den Link von euch gesendet. Und darum spar ich mir einfach das Ganze. Und ich bin nur passiver Leser, wenn ihr mir quasi was zusendet. Oder wenn ich mal was aktiv poste für ein neues Produkt oder so. Das gibt's natürlich auch. Oder ich eine Frage.",
            "start": 1228595,
            "end": 1246079,
            "confidence": 0.7837258064516129,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Du schaust nur auf Hacker-News, wenn dich da jemand erwähnt, oder?",
            "start": 1246099,
            "end": 1248239,
            "confidence": 0.6828181818181819,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, wenn ich erwähnt wäre.",
            "start": 1248992,
            "end": 1250494,
            "confidence": 0.9032,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn es um dich geht, dann gehst du mal in die Kommentare rein und stellst mir ein paar Sachen klar halt.",
            "start": 1250514,
            "end": 1255758,
            "confidence": 0.6423809523809523,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, genau. Ich werde jetzt dann auch später dann auf Hacker News posten, dass ich das Bill gewonnen habe gegen Andi natürlich.",
            "start": 1255778,
            "end": 1262044,
            "confidence": 0.7800909090909092,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was ist dein First Pick?",
            "start": 1262144,
            "end": 1263625,
            "confidence": 0.527,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Mein First Pick ist etwas, wo ich auch gerade kürzlich daran erinnert worden bin. Ich habe nämlich jetzt gerade vor ein paar Tagen die Rechnung von Copilot bekommen und demnach habe ich genau vor einem Jahr Copilot begonnen zu verwenden und gerade heute mit dem Advent of Code, mit dem ersten Tag gestartet, haben wir gedacht, okay, simples Rätsel, Ich mach einfach schnell unten die Konsole auf, die JavaScript-Konsole im Browser, und programmier das schnell in JavaScript runter. Ist ja nur simples ForEach. Und ich bin gescheitert. Und ich hab dann meine IDE aufgemacht, wo Copilot installiert war, um irgendwie JavaScript-Code zu schreiben, weil's Ich schaffe es fast nicht mehr, ohne CoPilot irgendwie eine Zeile zu schreiben. Es ist ziemlich schlimm, dieses Gefühl, wenn man da drauf kommt, dass es so schwierig ist, Code zu schreiben ohne Hilfe. Es ist so wie früher die Autovervollständigung in IDEs, aber nochmal eine Kategorie höher. Und ich kann mir eigentlich programmieren ohne gar nicht mehr richtig vorstellen. Und ich merke, dass sich da im letzten Jahr extrem viel getan hat bei mir. Also wie ich das verwende und anwende.",
            "start": 1263665,
            "end": 1327635,
            "confidence": 0.821935483870968,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Findest du nicht, dass das ein bisschen stereotypenhaft ist, als Podcaster deinen First-Top-Pick für die letzten zwei Jahre irgendwas mit AI zu nehmen?",
            "start": 1327995,
            "end": 1336125,
            "confidence": 0.768217391304348,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber wenigstens habe ich nicht AI an sich genommen. Ihr hättet ja sagen können, JetGPT, das wollt ihr bewusst nicht. Aber was mich persönlich am meisten beeinflusst hat, ist wirklich das, weil in meinem Alltag, es hat sich einfach komplett geändert, wie ich programmiere. Also ohne, ich schaff's einfach nicht mehr, muss ich zugeben. Und es hilft natürlich. Ich glaube, ich bin auch wesentlich schneller geworden, aber es ist eigentlich nicht mehr möglich sinnvoll, eine Codezeile zu schreiben. Also ich hatte wirklich Probleme, das forEach zu schreiben, in JavaScript korrekt.",
            "start": 1336989,
            "end": 1364927,
            "confidence": 0.8189120879120878,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin jetzt mal gespannt, aber Wie verändert sich das Top-Leader-Board von Advent of Code durch Chat-GPT und Copilot und Co.?",
            "start": 1365207,
            "end": 1374750,
            "confidence": 0.6781904761904762,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das hat es ja früher auch schon gegeben. Du hast auch auf Reddit oder sonstige Foren irgendwo das Ergebnis dir raussuchen können. Also wenn du cheaten willst, geht das immer. Aber bei Advent of Code ist es ja auch so, dass du das Problem verstehen musst. Also es hilft dir zwar bei der Programmierung, du könntest natürlich jetzt auch das Probleme eingeben als Fragestellung und dann hoffen, dass CoPilot dir das schon programmiert. Aber ich mache es schon so, dass ich mir die Struktur überlege, aber dann beim Ausführen der Struktur, um es einfach zu beschleunigen, das Coding an sich, da setze ich dann natürlich sehr gerne auf eine Hilfe, auf eine AI-Hilfe. Aktuell ist es halt CoPilot, aber es gibt ja auch andere. Und in Zukunft wird es wahrscheinlich auch andere noch geben. Aber es hat schon einen starken Einfluss auf meine tägliche Programmierung. Das kann ich nicht abstreiten. Vor allem, wie gesagt, wenn es mal wegfällt und du bist eigentlich so machtlos, wie früher Java-Entwicklung. Java-Entwicklung ohne Autocompletion ist ja wirklich schwierig. Ja, das auch. Du verwendest immer noch keine AI, oder, Andi?",
            "start": 1374790,
            "end": 1431870,
            "confidence": 0.7914569892473113,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, so langsam kickt so das FOMO-Gefühl ein. Also ich versuche halt schon öfters mal jetzt Chat-GPT zu verwenden, wirklich in meinem, ja, kann man Alltag sagen. Im beruflichen Kontext ist natürlich alles immer so ein bisschen limitiert. Aber ich habe immer noch kein GitHub-Copilot. Nee, das muss ich mal testen.",
            "start": 1432248,
            "end": 1451411,
            "confidence": 0.8420980392156866,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und schuld an der ganzen Sache ist ja Matthias. Das kann ich ja auch gleich mal erwähnen, weil ich hatte mal mit Matthias eine Pair-Programming-Session und war so neidisch auf diesen Copilot, dass ich mir zugelegt habe.",
            "start": 1452012,
            "end": 1463264,
            "confidence": 0.7356216216216217,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Echt jetzt? Okay. Das war vor einem Jahr?",
            "start": 1463304,
            "end": 1466408,
            "confidence": 0.5315,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau vor einem Jahr. Beziehungsweise plus zwei Monate, weil die ersten zwei Monate sind kostenlos. Also eigentlich sind es 14 Monate.",
            "start": 1466428,
            "end": 1471473,
            "confidence": 0.7817619047619045,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich kann ja mal ganz kurz sagen, wie ich Copilot verwende. Meistens in sehr, sehr engen Scopes für Pattern Matching. Dafür ist es extrem gut. Also warum soll ich mir die Syntax von dem ForEach in JavaScript überhaupt merken? Wo muss ich das? Hm, vielleicht in meiner Hauptsprache wäre es schon ganz gut. aber in javascript das ist nicht meine hauptsprache da muss ich nicht wissen und es geht natürlich auch manchmal in die komplett falsche richtung also ich kann mich daran ein pull request erinnern das ist zufälligerweise auch bei einem projekt das wir gemeinsam gemacht haben in open podcast und da bin ich ziemlich mal auf die nase geflogen damit weil ich eben gedacht habe ich lasse da jetzt sehr sehr viel auto generieren und wurde da. in die falsche Richtung geführt. Und letztendlich hat der Code überhaupt nicht funktioniert. Und dann war es eigentlich schwieriger, wieder zurückzukommen und zu wissen, was man löschen muss, anstatt einfach das von vornherein gleich selber zu schreiben. Ich sehe beide Seiten, ja.",
            "start": 1472414,
            "end": 1517433,
            "confidence": 0.7503157894736836,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich verwende es auch eher so für kleine Sections, aber es wird besser und besser. Und teilweise anhand von den variablen Namen kann das eigentlich schon ganz gut abschätzen teilweise, was dann in die For Loop reinkommt. Und dann hat man da schon eine Struktur. Es funktioniert erstaunlich gut, ja.",
            "start": 1517473,
            "end": 1531783,
            "confidence": 0.753607843137255,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Andi, hast du noch? Nee, fang du an. Ja, der Andi setzt sich nicht gerade an, also soll ich dich jetzt prompten?",
            "start": 1531843,
            "end": 1539265,
            "confidence": 0.5897272727272728,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir haben über AI gesprochen und du sagst prompten? Ernsthaft? Was für ein flacher Wortwitz. Na gut, aber look back. Ein ganz kurzer Zwischeneinsatz, was natürlich auch mit den LLMs zu tun hat, Large Language Models. Ne? Einen Riesenaufschrei gab's natürlich, als Twitter und Reddit APIs Geld verlangt haben. Ja? Da erinnern wir uns auch alle. Ja? Und warum haben sie's getan? Mit hoher Wahrscheinlichkeit, damit der Content durch Large-Language-Models, durch die Trainingsdaten oder dass deren Content nicht als Trainingsdaten genutzt werden kann. Aber das nur am Rande. Lookback.",
            "start": 1539285,
            "end": 1573107,
            "confidence": 0.7973820224719104,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ... Ah, ich möchte übrigens noch was einwerfen. Klarerweise. Es hängt zwar jetzt nicht direkt zusammen, aber was ich auch herausgefunden habe, ist, dass 22 zum ersten Mal Waymo auf die Straße gegangen ist mit ihren selbstfahrenden Fahrzeugen und das ungefähr auch so in diese Copilot-Zeit mit reinfällt. Also da war nicht nur auf der Coding-Seite viel, sondern auch auf der Straße einiges an Änderungen. Aber Andi, jetzt bitte komm zurück zu deinen Vergangenheitserinnerungen.",
            "start": 1573167,
            "end": 1602005,
            "confidence": 0.8075200000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich glaub, ein Thema, was uns alle irgendwie so ein bisschen beschäftigt hat, ist, ich nenn das mal The Rise and Fall vom Tech-Job-Markt. Weil wir können uns alle noch dran erinnern, während der Covid-Zeit, Ende 2020, 2021 war der Tech-Markt am Boomen. Gefühlt wurden Gehälter gezahlt, ekelhaft. Wirklich da, also ein bisschen überspitzt gesagt, haben Junior-Engineers 80.000, 90.000 Euro gekriegt, weil einfach Geld so günstig war. Und dann ist das ganze Kartenhaus in Quartal 2, Quartal 3 irgendwie zusammengefallen. Und auf einmal hat die Website layoffs.fyi einen richtigen Boom gekriegt, denn allein im Jahr 2022 haben 1000 Firmen 164.000 Mitarbeiter entlassen und im Jahr 2023 eine ähnliche Anzahl an Firmen 250.000 Mitarbeiter. Und das war natürlich schon eine kranke Nummer. Also da hat man schon wirklich gemerkt, okay, der Tech-Markt baut auf, baut auf, baut auf und dann baff. Also da habe ich gedacht, ich meine, jede Woche kam ja, ich glaube mal, irgendwelche News. Microsoft, Facebook hat 10.000, 12.000 Leute entlassen. Und auch hier im Kiosk, im Podcast haben wir ein bisschen darüber gesprochen. Episode 25, Tech-Entlassungswellen, Job-Interview-Skills. Episode 36 sechsstellige it gehälter wie was wo und ob das überhaupt fair ist und ich glaube das hat uns alles schon so ein bisschen. Ja mitgerissen also war schon war schon ich will nicht sagen spannende zeit aber schon eine komische zeit und jetzt ist die frage kommt der jobmarkt nochmal zurück so jetzt gerade ist ein bisschen schwierig ja der effizienz und so. Aber ja, was ich auch ganz interessant fand, ist, dass die ganzen großen US-Tech-Konzerne wie Facebook und so, hat man zumindest mal hier und da gelesen, bei diesen ganzen Entlassungswellen das erste Mal Berührung mit dem europäischen beziehungsweise deutschen Arbeitssystem hatten. Denn in Deutschland ist es halt so, man kann Leute nicht einfach von heute auf morgen einfach so entlassen. Da ist nämlich dann ein Betriebsrat dazwischen und dann ist da vielleicht ein unbefristeter Arbeitsvertrag. Und das ist dann alles nicht ganz so einfach. Und was hat Facebook inzwischen gemacht? Facebook hiert auch wieder, aber Facebook hiert jetzt nicht mehr so viel in diesen Ländern, wo es so hohe Arbeitnehmergesetze gibt. Und das ist natürlich dann auch schon mal eine interessante Beobachtung. Also das hat mich so ein bisschen in den letzten zwei Jahren auch irgendwie ein bisschen näher geprägt, aber betroffen war ich ja nicht.",
            "start": 1602416,
            "end": 1751412,
            "confidence": 0.7868849104859339,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber warst du irgendwie als Lead betroffen bei Sparmaßnahmen?",
            "start": 1752280,
            "end": 1756104,
            "confidence": 0.7756666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Mein aktueller Arbeitgeber hat damals auch Layoffs durchgeführt, aber keiner von meinen Teams war jemals betroffen. Also ich habe noch nie eine Layoff-Runde mitgemacht, wo ich jemanden entlassen musste. Ich habe aber schon zwei Layoffs-Runden mitgemacht.",
            "start": 1756124,
            "end": 1767937,
            "confidence": 0.7785555555555556,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber es scheint, dass uns das beide sehr beschäftigt hat, weil der zweite Punkt ist bei mir genau dasselbe, die ganze Lay-off-Welle. Und was für mich so spannend an der ganzen Entlassungswelle war, und das waren ja wirklich ordentlich an den Entlassungen irgendwie, gut, Twitter ist ein Spezialbereich, nochmal mit 50% Entlassungen, aber 10%, 13% Meta, zum Beispiel 22% Entlassen. Microsoft hat sogar Leute entlassen, und denen geht es ja wirklich gut. Amazon, Google, also alle haben da recht viele Leute entlassen. Und was mich so gewundert hat und vielleicht auch ein bisschen gestört hat, weil ich unter Umständen auch nicht persönlich so betroffen war und so tief drinnen war, diese Wehleidigkeit von der Branche. Es war unglaublich, wie viele Leute auch so im persönlichen Umkreis von mir, ah, jetzt werden da Leute entlassen und die sind alle so arm. Und dann haben mir Leute erklärt von Salesforce, das ist ein Familienvater und der wurde jetzt gefeuert. Und der arme Familienvater, wo ich mir so irgendwie gedacht habe, Junge, du hast wahrscheinlich irgendwie mehrere hunderttausend Euro Jahresgehalt bekommen und spielst bei dem Game mit und warst auch immer froh, die ganzen Bonuszahlungen und Aktien und alles zu bekommen. Und dann ist man so wehleidig, wenn man dann auch gefeuert wird. wenn man dort mitspielt in der Tech-Branche. Also das habe ich irgendwie nicht verstanden. Und ist schon klar, dass das in dem Moment natürlich persönliche Schicksale sind. Aber wenn man das Gesamt sieht, die Leute finden schnell wieder einen Job üblicherweise. Und sogar wenn nicht, wenn du diese Gehälter bekommst und auch mitspielst bei diesem Spiel in dieser Aktienwelt und in der schnellen Wachstumswelt, dann gehört das halt meiner Meinung nach mit zum Spiel. dann kann man da dann auch nicht so wehleidig sein und sagen es ist alles so böse und man wurde dazu.",
            "start": 1768378,
            "end": 1870860,
            "confidence": 0.8077737704918035,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Dass viele von diesen Mitarbeitenden dann auch den goldenen Fallschirm angeboten bekommen haben und haben dann teilweise extrem lange Lohnfortzahlungen bekommen da reden wir dann von drei Monaten.",
            "start": 1870900,
            "end": 1882694,
            "confidence": 0.8186785714285715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vier Monaten, Für Amerika zumindest noch sehr lange. Für Deutschland vielleicht jetzt weniger, aber wenn du zehn Monate bekommst, dann hast du schon auch ein Security-Net.",
            "start": 1882734,
            "end": 1891756,
            "confidence": 0.7260000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja gut, aber der goldene Fallschirm, ich meine, das ist die Art und Weise, wie du in Deutschland Leute entlässt. Du arbeitest Aufhebungsverträge aus und die sehen halt wirklich in der Regel so aus. Du kriegst eine Lohnvorzahlung für über drei, vier Monate. Du unterschreibst, musst nicht zur Arbeit kommen und kriegst vielleicht noch eine Abfindung anhand deiner Betriebsjahre und Co.",
            "start": 1892877,
            "end": 1912885,
            "confidence": 0.8066721311475411,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber auch in Amerika hat es das ja gegeben. Also die großen Firmen haben da ja wirklich mehrere Monate gezahlt noch, was sehr unüblich ist, weil in Amerika kannst du ja wirklich von heute auf morgen einfach kündigen, ohne irgendwas zu machen. Und also das war mehr als fair, meiner Meinung nach, in den meisten Bereichen. Und wie gesagt, wenn man da mitspielt, muss man, glaube ich, auch diesen Teil einfach mitnehmen. Mich hat es gewundert, wie wehleidig teilweise die Leute sind und auch das halt dementsprechend so kommunizieren. Und das hat mir eigentlich etwas gestört. Aber es ist natürlich schon auch ein krasser Move, wenn man sieht, wie stark das in der ganzen Branche gemacht wird und wie viele Auswirkungen das hat dann auf eine Masse an Leuten und also wirklich auch in Europa und überall. Also dass das wirklich große Auswirkungen hat auf die gesamte Branche. Und da hat man auch gesehen, wie unstabil das Ganze Kartenhaus will ich vielleicht nicht sagen, aber zumindest, dass das ganze Haus durchaus nicht so stabil ist und die Tech-Branche auch nicht davor gefeit ist.",
            "start": 1913665,
            "end": 1970724,
            "confidence": 0.8186939890710382,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich weiß gar nicht, ob da Stabilität wirklich eine Rolle spielt, weil im Endeffekt, was ist da passiert? Das Geld war günstig, die großen Tech-Player haben eigentlich alles geheiert, gar nicht vielleicht, weil die diese Engineering-Power brauchten, sondern eigentlich nur, um das Talent wegzuheiern, damit der nächste Competitor es einfach nicht kriegt, weil das Geld grad so günstig war. Deswegen bin ich mir gar nicht sicher, inwieweit das wirklich mit Stabilität zu tun hat, denn all diese Firmen oder ein sehr großer Anteil dieser Firmen, die gibt es ja immer noch. Es wird einfach nur ganz offen und ehrlich vielleicht sogar overhired und das auch mit Absicht.",
            "start": 1970764,
            "end": 2005916,
            "confidence": 0.8382897196261682,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also man sollte vielleicht auch da noch erwähnen, dass diese 10% Layoffs auch einfach nur ein Tropfen auf dem heißen Stein sind. Also es haben ja viele Firmen beispielsweise dann einfach kategorisch auch mal so 10%, die klassischen 10% einfach entlassen. Und da sagt man ja, die haben eher bei sich ein bisschen aufgeräumt. Das war vielleicht gar nicht nötig. Und da haben ja dann super viele Firmen dann auch nachgezogen, weil das eben genau der Moment war, das zu tun. Und es war leichter, das unter den Teppich zu kehren als zu anderen Zeiten vielleicht.",
            "start": 2006437,
            "end": 2038730,
            "confidence": 0.8152604166666665,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn es jeder macht und auch die großen machen, dann kann ich es auch machen, genau.",
            "start": 2038770,
            "end": 2041833,
            "confidence": 0.7336875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Google hat mehr Leute eingestellt, als sie dann danach wieder entlassen haben. Es sind immer noch mehr Leute jetzt bei Google und ich glaube bei Microsoft war es genauso. Kennst die genauen Zahlen nicht, aber die waren sehr erpicht drauf, gute Talente trotzdem zu halten.",
            "start": 2041853,
            "end": 2054362,
            "confidence": 0.7767333333333336,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kommen wir mal weg von diesem traurigen Thema, mal zu etwas Tollem. Und zwar, ich habe mir einen dritten Look-Back-Punkt rausgezogen. Und da habe ich mir, da ich ja ein Open-Source-Fan bin, habe ich mir einfach mal die Top-Repositories, die erfolgreichsten Repositories von 2022 und von 2023 rausgesucht. Und überraschenderweise sind die Listen, die Top 10, fast identisch. Auf Platz 1 Microsoft Visual Studio Code. Finde ich jetzt nicht so überraschend, weil ich glaube, das ist die IDE, die so in den letzten Jahren einfach durch die Decke ging. Ich glaube, so die ersten vier oder fünf Projekte sind alle gleich. Und was man in 2023 gesehen hat, so die unteren fünf, also Platz sechs bis zehn, sind dann alles so AI-Projekte, irgendwelche Large Language Models und so weiter. Aber was mich wirklich überrascht hat, das bringt mich zum Grinsen irgendwie, ist nämlich der Platz vier. Der Platz vier auf beiden Listen. Es sind die Azure-Docs. Die technische Dokumentation von der Cloud von Microsoft. Azure-Docs. Und Wolfgang, eine Schätzfrage, die nicht in die Wertung eingeht, weil ich kenne die Antwort. Was denkst du denn? Wie viele Contributor haben die Azure-Docs?",
            "start": 2054404,
            "end": 2130128,
            "confidence": 0.8081157894736842,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "64.000. Sportlich.",
            "start": 2130138,
            "end": 2133546,
            "confidence": 0.6955,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir reden immer über Dokumentation für den Hyperscaler, für den kleinsten Hyperscaler, möchte ich nur noch mal sagen. Es sind nur 13.000 Kontributoren, aber das ist schon eine Hausnummer, oder? Ich meine, das ist eine Dokumentations-Webseite für Microsoft. Also, das ist schon ... Aber auch da, die Pull-Requests, die sind ganz interessant. Oder die Issues. Die fragen nämlich in den Issues wirklich nach, so was wie, könnt ihr mal bitte die Encryption-Methoden für diesen Disk-Type oder so was mal ein bisschen erläutern. Also, es ist schon sehr interessant, was da wirklich abgeht. Und da muss ich ja schon sagen, wir wissen alle, Microsoft hat einen Mega-Move hingelegt von, uh, das ist Microsoft, die machen ja Windows-Closed-Source. Ja, das war so am Anfang. So die die ansicht von microsoft zu aber eine gute firma da könnte ich mir auch vorstellen zu arbeiten ja also deren deren open source move ich glaube das ungeschlagen in der industrie aber dass die asia docks auf platz vier der beliebtesten repositories 22 und 23 sind hat mich zum grinsen gemacht es ist ja.",
            "start": 2133566,
            "end": 2196970,
            "confidence": 0.7277808988764046,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nicht die beliebtesten sondern die aktivsten oder.",
            "start": 2196990,
            "end": 2198991,
            "confidence": 0.7147142857142857,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die aktivsten in Bezug auf externe Kontributoren. Und man muss zugeben, Home Assistant war auch sehr weit oben und Flutter, das Mobile Framework aus der Sprache Dart.",
            "start": 2199852,
            "end": 2212496,
            "confidence": 0.8275925925925925,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es könnte natürlich sein, dass die Azure-Dokumentation einfach so schlecht ist, dass alle Leute was kontributieren. Und sie ist natürlich überhaupt öffentlich zugänglich, weil ich wüsste nicht, dass AWS oder GCP die Dokumentation auf GitHub hat.",
            "start": 2212536,
            "end": 2223300,
            "confidence": 0.8133333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das weiß ich jetzt nicht, aber das Open-Source-Contributor-Onboarding muss die Azure-Docs ja schon richtig gemacht haben. Also da ist ja völlig egal, ob die dann Kacke ist oder nicht. Punkt ist aber, das Open-Source-Onboarding, da haben sie dann eine ganze Menge richtig gemacht.",
            "start": 2223760,
            "end": 2235980,
            "confidence": 0.7699069767441857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube ganz allgemein, dass die Dokumentation in so einer Form mit der Community zusammen eigentlich einen großen Mehrwert hat. Und meiner Meinung nach hat ja auch BHB da extrem früh damit angefangen und keine Ahnung, ob das andere auch schon gemacht haben. Aber die Kommentare in der BHB-Dokumentation, die du ja schon erwähnt hast mit deinen Schätzungen, ob die Dollar jetzt einfließen oder nicht, die war schon extrem hilfreich. Und wenn ich mir so vorstelle, vor zehn Jahren war das eigentlich nicht so üblich oder vor 20 Jahren. Kommentare zuzulassen in der Dokumentation und wirklich die Community einzubinden. Und ich kann mich erinnern, das ist extrem viel. Das war früher sowas wie Stack Overflow. Du bist auf die PHP-Dokumentation gegangen und hast unten schon Lösungen gehabt, wie du so die gröbsten Probleme mit der Funktion beheben kannst oder klassische Probleme, die auftreten und wie man die umgeht. Also ich habe da schon viel Copy-Paste gemacht. Also mein früheres Stackoverflow sozusagen, die Kommentare. Und insofern, meiner Meinung nach, macht es absolut Sinn, die Community da stärker einzubinden. Und wenn man es dann so offen über Git macht, ist es noch besser. Also man freut sich ja auch immer, wenn da die Community mitarbeitet und es kann ja nur besser werden.",
            "start": 2236440,
            "end": 2302633,
            "confidence": 0.8134142857142854,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wolfgang hast du denn jetzt noch ein Highlight? Sag mal wie ich tatsächlich noch eins. Und zwar hatte ich mir zum Einstieg dieser Geschichte Zitat überlegt im Jeopardy Style und ihr könnt mich stoppen in jedem Moment und könnt dann die Antwort geben.",
            "start": 2303153,
            "end": 2319258,
            "confidence": 0.7834186046511628,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Moment, ist das jetzt was, was in die offizielle Wertung einfließt?",
            "start": 2320919,
            "end": 2323421,
            "confidence": 0.8011818181818181,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist außerhalb der Wertung, sei ganz beruhigt. Aber trotzdem wäre es ganz spannend, wer es als erstes sagt. Also es geht um eine Folge von euch.",
            "start": 2323461,
            "end": 2331468,
            "confidence": 0.7830370370370372,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also nur zur Erklärung. Jeopardy, in dem Sinne, du gibst die Antwort und wir müssen die Frage erraten.",
            "start": 2331508,
            "end": 2336672,
            "confidence": 0.7943888888888889,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau. Okay.",
            "start": 2336712,
            "end": 2338114,
            "confidence": 0.5745,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Diese Cloud-Plattform. wird nicht nur zur Speicherung von Kalenderdaten verwendet, sondern auch für... Stopp. Ja?",
            "start": 2338154,
            "end": 2347596,
            "confidence": 0.8999999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was ist Nextcloud?",
            "start": 2347636,
            "end": 2349138,
            "confidence": 0.5406666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehr gut. Ja, ja, ja.",
            "start": 2349258,
            "end": 2352801,
            "confidence": 0.6866,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich bin ein bisschen enttäuscht. Ja, ja.",
            "start": 2352821,
            "end": 2355003,
            "confidence": 0.7131428571428572,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also die ganze Frage war, diese Cloud-Plattform wird nicht nur zur Speicherung von Kalenderdaten verwendet, sondern auch für diesen Audio-Typ, wie im Fall eines Podcasts, der seine MP3-Dateien sicher aufbaut.",
            "start": 2355043,
            "end": 2365033,
            "confidence": 0.7988333333333331,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Moment, ist das ein Zitat aus unserer Podcast-Episode?",
            "start": 2365453,
            "end": 2367675,
            "confidence": 0.5497500000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nein, kein direktes Zitat. Allerdings hattet ihr mal einen Gast und vielleicht wollt ihr da mal kurz drüber sprechen, wer das war und, Andi, warum du das so schnell wusstest.",
            "start": 2367775,
            "end": 2377422,
            "confidence": 0.6876666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es war Frank Kalicek, der Gründer von NexCloud und einer der originalen Autoren von OwnCloud, der seine eigene Firma geforkt hat auf Basis von Unstimmigkeiten mit Investoren und Co. Und wir waren damals sehr, sehr stolz, dass Frank zugesagt hat, denn ich zumindest schätze ihn ungemein, besonders, das hatten wir damals auch in der Episode erwähnt, wir haben ihn mal auf einem Vortrag in Belgien gesehen, wie er erzählt hat, wie er seine eigene Firma geforkt hat, daraus ein komplettes Open Source Projekt gemacht hat und damit dann auch wirklich Geld verdient und er ist sogar so weit inzwischen, dass Nextcloud in Behörden und nicht nur in Deutschland genutzt wird, sondern in Europa. Und er ist auch sehr viel in dem Bereich von der EU unterwegs. Und diese Person treibt Open Source und dass du die Hoheit über deine eigenen Daten hast, so dermaßen weit nach vorne. Ich krieg grad Gänsehaut, muss ich zugeben, wenn ich das erzähle, weil das ist einfach wow, wow, wow. Also ich find's höchst beachtlich, was diese Person auf die Beine gestellt hat.",
            "start": 2377462,
            "end": 2446520,
            "confidence": 0.8132584269662929,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und das Interessante daran ist ja auch, übrigens Episode 86 ist das, unser Interview mit ihm, dass eigentlich NextCloud im Gegensatz zu OnCloud, das ja die Firma davor war, und OnCloud war mehr Investor-orientiert und da hat es kostenpflichtige Module und so weiter gegeben. Und er hat dann einfach gemerkt, wie das mit Open Source kollidiert, wenn er da eben kostenpflichtige Module auch anbietet und das nicht so ganz klar ist, was ist jetzt Open Source, was nicht, wo contributed man dazu. dass er einfach das gesehen hat und das komplett geändert hat und Nextcloud jetzt wirklich rein Open Source ist. Es gibt keine kostenpflichtigen Module. Jede Contribution ist Open Source. Alles bleibt Open Source. Auch Sie, wenn Sie was entwickeln, ist automatisch alles Open Source. Und es gibt nicht dieses Dual Licensing Modell oder irgendwas, was so üblich ist, sondern es ist wirklich rein Open Source, so wie auch Red Hat zum Beispiel. Und das war eigentlich der große Unterschied zu OnCloud und seine Erkenntnis, die er erlangt hat. Und in dem Vortrag eben in Belgien auf der FOSDEM, wie er das präsentiert hat, eben diese Erkenntnis und was er eben macht, diese neuen Principles dann in der Nextcloud, dass eben alles Open Source sein muss und auch noch andere Dinge eben Community orientiert und so weiter. Die hat ihm dann diese Standing Ovations auch eingebracht in diesem wirklich gerammelt vollen Saal von hunderten Open Source Entwicklern und verdienterweise. Und wie gesagt, wir verwenden es auch, die Nextcloud, ich persönlich sehr stark und ich bin super happy damit.",
            "start": 2446815,
            "end": 2530465,
            "confidence": 0.8055559845559846,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und einer meiner Predictions ist jetzt, solange Frank bei Nextcloud dabei ist, muss die Hölle zufrieren, dass Nextcloud eine Lizenzänderung auf die Business-Source-License oder die Server-Side-Public-License hat, weil das kann er gar nicht. Weil bei Nextcloud gibt es kein Computer-License-Agreement. Er kann alleine oder Er mit seiner Firma kann die Lizenz gar nicht ändern.",
            "start": 2530865,
            "end": 2554536,
            "confidence": 0.8070925925925925,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also es kann die Firma auch selber nicht. Dadurch, dass es nicht existiert, kann das jetzt eigentlich gar nicht mehr so gemacht werden, weil die Lizenz nicht mehr geändert werden kann.",
            "start": 2554556,
            "end": 2562023,
            "confidence": 0.7537419354838708,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und deswegen habe ich jetzt diese Folge ausgewählt. Persönlich fand ich, war das auch ein Highlight. Die Folge, beziehungsweise auch der Talk und auch das Projekt Open Source ist erwachsen und muss jetzt sich überhaupt vor gar keinem mehr verstecken, glaube ich. Wir hatten ja eben auch über Microsoft gesprochen und Open Source ist mittlerweile einfach der Default. Vielleicht einfach auch nochmal ein kleines Highlight von mir. Und ich fand die Episode ziemlich gut.",
            "start": 2562387,
            "end": 2587990,
            "confidence": 0.7640540540540542,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 2588410,
            "end": 2589071,
            "confidence": 0.722,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ganz interessant. Ich hatte ein Feedback bekommen von jemandem, der gar kein Entwickler ist und weit weg und eher so aus dem Wirtschaftsbereich und der hat sich die Episode angehört und der hat gemeint, es klingt schon alles sehr religiös, was jeder so macht im Open Source Bereich. Prinzipien und er hat es ein bisschen eigenartig gefunden, aber ich glaube, wenn man so aus der Wirtschafts-Business-Welt kommt, ist es schon auch schwer verständlich, wie denn Open Source funktioniert und dass man da auch wirklich kostenlos arbeitet. War so eine ganz interessante Erfahrung, mal auch so aus der anderen Welt so ein Feedback zu bekommen, weil für uns ist das ja alles selbstverständlich und wenn man in der Open-Source-Welt ein bisschen unterwegs ist, dann kennt man ja die Leute und die Motivationen, aber Ja, es ist nicht so verständlich natürlich von außen, ... ... warum Leute sich am Abend noch hinsetzen ... ... und dann irgendwas wirklich kostenlos programmieren ... ... und nicht das Business im Kopf haben.",
            "start": 2589111,
            "end": 2638620,
            "confidence": 0.7532874251497005,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Harter Cargo-Kult, den wir hier ausüben, Matthias.",
            "start": 2638660,
            "end": 2641922,
            "confidence": 0.4477142857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, warum tut man sowas? Ist echt eine gute Frage, warum man sich das antut. Gibt's ja tausende Memes.",
            "start": 2642062,
            "end": 2647626,
            "confidence": 0.7376842105263157,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Frage stelle ich mir so oft selbst. Und am Abend entdecke ich mich trotzdem wieder auf der Couch ... ... und denke mir so, ich hab's schon wieder getan.",
            "start": 2647646,
            "end": 2657273,
            "confidence": 0.6562666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, man muss schon fast. Das ist so ähnlich wie Kunst. Man müsste Leuten verbieten, das zu tun. Wie beispielsweise jemand sagt, du kannst nicht mehr Gitarre spielen. Warum, wenn einem das Spaß macht?",
            "start": 2658568,
            "end": 2668091,
            "confidence": 0.7501470588235293,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die dritte Kategorie für die heutige Episode sind Predictions für das kommende Jahr, für 2024. Also, wir versuchen mal, in unsere Glaskugel oder zumindest ich hab hier eine leere Mio-Mate vor mir stehen, was ja dann auch meine eigene Hacker-Glaskugel ist, wenn man so möchte, mit Mate-Date. Aber die Theorie ist wie folgt, Wolfgang und ich predigten zwei oder drei Sachen, die in 24 im kommenden Jahr wahr werden. Und die einzige Regel war, dass es relativ objektiv entscheidbar ist, ob diese Sache eingetreten ist oder nicht. Es muss jetzt keinen harten Datapoint gegeben haben, so nach dem Motto, dieser Graph ist hoch oder runter gegangen, sondern wir dürfen nicht drüber diskutieren, wenn man das so auslegt, dann. Sondern, Man muss sagen, jo, da hast du recht, das stimmt, das ist eingetreten.",
            "start": 2668111,
            "end": 2725262,
            "confidence": 0.8095378787878793,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gibt's da jetzt eigentlich auch einen Wetteinsatz? Also vielleicht wollen wir jetzt gleich was ausmachen für nächstes Jahr. Vielleicht wieder 100 Euro.",
            "start": 2725282,
            "end": 2732525,
            "confidence": 0.7308636363636363,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da wir jedes Jahr auf die FOSDEM fahren, bin ich dafür, dass wir Ende 2024 darüber schauen. Das muss jetzt dann leider heißen, dass wir den Podcast anscheinend noch ein ganzes Jahr machen. Und der Verlierer dann einen Restaurantbesuch in Belgien auf der FOSDEM zahlt dem anderen. So, haben wir alle schönen Sachen miteinander verbunden. Wir verbringen Zeit, wir lernen was auf einer Open-Source-Konferenz. Finde ich besser, als wenn ich jetzt eine Kiste Bier nach Österreich schicke.",
            "start": 2732545,
            "end": 2758913,
            "confidence": 0.781766233766234,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, erst einmal ein Bier ist sowieso das bessere Bier.",
            "start": 2759193,
            "end": 2760755,
            "confidence": 0.3326,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Entschuldigung, hier ist was hochgekommen. Gut, Wolfgang, deine erste Prediction.",
            "start": 2760775,
            "end": 2768705,
            "confidence": 0.568,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Meine erste Prediction, ich habe leider noch nicht so messbare Kriterien gefunden dafür, aber meine erste Prediction ist, dass es einen sehr starken Rückzug aus der Cloud gibt und dass sehr, sehr viele Firmen wieder on-prem gehen, auch mit der Cloud Native Foundation, das Toolset ist jetzt da, man kann wieder im Data Center, kostengünstiger hosten, 37, 36, damit, wie heißen sie?",
            "start": 2769460,
            "end": 2797337,
            "confidence": 0.8338870967741936,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "37 Signals Space Camp.",
            "start": 2797347,
            "end": 2799859,
            "confidence": 0.61625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, 37 Signals Space Camp hat es vorgemacht und die machen das ja immer, wenn sie was machen, mit einem ordentlichen Knall und einer guten Marketing Message, damit das ja alle hören. Und ich glaube, dass da extrem viele das nachmachen werden. Meine Frage ist, wie man das am besten messen kann, wie groß die Firmen sein müssen. Meine Vermutung ist, die ganz die Großen machen es nicht so wie Netflix, weil die haben einfach die guten Verträge und die zahlen sowieso quasi nichts, unter Anführungszeichen, weil die so gute Verträge haben. Aber ich vermute mal so diese Zwischenschicht, so diese Mittelständler im Tech-Bereich, wenn man sie so nennen will, so wie Basecamp, dass die eher wieder auf eine Datacenter-getriebene Strategie zurückgehen. Ich würde mal sagen, irgendwie fünf große von diesen Mittelständlern oder zehn große werden wieder announcen, dass sie zurückgehen ins Datacenter.",
            "start": 2799879,
            "end": 2850632,
            "confidence": 0.8399720279720284,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, ich würde mich auf ein Measurement einlassen von zehn großen, die du dann aber auch belegen kannst mit Quellen.",
            "start": 2851193,
            "end": 2857575,
            "confidence": 0.7087000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, natürlich muss man die belegen. Aber was sind jetzt große, also ich rede nicht von Netflix, sondern eben von diesen dazwischen, zwischen kleinem Startup und großem Netflix, diese Mittelschicht.",
            "start": 2858152,
            "end": 2867857,
            "confidence": 0.7442666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, die müssen schon siebenstellig pro Jahr bei einem Cloud-Provider gelassen haben. Also eine Million muss da schon liegen.",
            "start": 2867897,
            "end": 2872599,
            "confidence": 0.6333684210526315,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, genau. Ja, genau diese von diesen Sprecher. Genau die sagen halt, wir geben, keine Ahnung, eine Million aus und wenn wir das im eigenen Datacenter machen, schaffen wir es um 300.000 oder so. Genau in dieser Größenordnung.",
            "start": 2872619,
            "end": 2883964,
            "confidence": 0.7820526315789477,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, spannend, spannend, spannend, weil der Matthias grinst schon die ganze Zeit, weil er kennt natürlich meine Predictions. Und meine erste Prediction geht in eine ähnliche Richtung. Und zwar, meine Prediction ist, dass die Hyperscaler weiter wachsen. Und weiter wachsen kann man ja ganz einfach messen, indem man sich die Earning Calls anhört. Da kann man ja sehen, wie sie quartalsmäßig im Cloud-Sektor wachsen. Aber dass die einzelnen Cloud-Accounts von den jeweiligen Kunden nicht wachsen, sondern die Hyperscaler werden durch Neukunden wachsen und zwar durch die ganzen Late Adopter, die durch Lift and Shift in die Cloud gehen. Die existierenden Firmen, die bereits in der Cloud gehen, die werden alle kostensensitiver. Das bedeutet, die einzelnen Accountkosten pro Firma werden runtergehen, weil die einzelnen Firmen sich viel mehr darauf stürzen werden, ihre Cloud-Kosten in Anführungszeichen in den Griff zu bekommen. Somit, das Buzzword FinOps wird 2024 durch die Decke gehen, denke ich. FinOps sind einzelne kleine Teams in Firmen, die sich um die Kostenoptimierung kümmern und größere Firmen, die in der Cloud sind und Managed Service nutzen, werden weg davon gehen, den Managed Service bei der Firma zu nutzen und werden mehr Modelle wie Bring Your Own Cloud anwenden. Bring Your Own Cloud, für die Leute, die das nicht kennen, bedeutet zum Beispiel, Wenn du einen Datenbank-as-a-Service-Provider, nehmen wir mal Vercel oder Heroku hast, dann kannst du mit denen sprechen und dann sagt Heroku, ja, wir können deine Datenbank auch bei dir im Cloud-Account launchen. Warum sollte man das machen? relativ einfach, weil dann du als Firma deinen Committed-Use-Discount bei dem Cloud-Provider nutzen kannst, anstatt direkte Kosten an den Database-as-a-Service-Provider abzugeben. Und somit kriegst du auf der einen Seite Ersparnisse durch deine Verhandlungen mit dem Hyperscaler, auf der anderen Seite nutzt du immer noch einen Managed-Service.",
            "start": 2884284,
            "end": 3006112,
            "confidence": 0.8272169491525421,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das heißt, der Output wird nach unten gehen, der Average Revenue per User.",
            "start": 3006568,
            "end": 3010211,
            "confidence": 0.7791538461538463,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ganz genau.",
            "start": 3010251,
            "end": 3012052,
            "confidence": 0.849,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist deine Wette jetzt genau? Um wie viel? Oder nur, dass er nach unten geht?",
            "start": 3012072,
            "end": 3017616,
            "confidence": 0.8431875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Er wird nach unten gehen oder gleich bleiben, aber er wird nicht steigen.",
            "start": 3017656,
            "end": 3021479,
            "confidence": 0.8524615384615384,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und inflationsbereinigt natürlich, das musst du mitrechnen. Bei der aktuellen Inflation ist das immer gar nicht so wenig.",
            "start": 3021539,
            "end": 3027223,
            "confidence": 0.7049444444444444,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, inflationsbereinigt auch noch. Das bedeutet, der Account Value bleibt gleich oder geht nach unten, bleibt aber nicht höher. Die Hyperscaler wachsen trotzdem weiter. Und Achtung! Ich habe diese Prediction aufgestellt, bevor Werner Vogels die diesjährige AWS Reinvent Keynote gehalten hat.",
            "start": 3027543,
            "end": 3045749,
            "confidence": 0.8168536585365853,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man muss dazu sagen, für alle, die sich jetzt fragen, warum Andy Werner so gerne erwähnt. Andy ist ein großer Fanboy von Werner Vogels. War er schon immer. Seit Jahrzehnten sendet er mir jeden Link und wenn der irgendwo einen Wein trinkt und ein Paparazzi ein Bild geschossen hat, bekomme ich das bei WhatsApp. Also Andy ist wirklich ein ordentlicher Fanboy.",
            "start": 3048297,
            "end": 3067153,
            "confidence": 0.7884754098360657,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Dieser Mensch, ja, weiß halt, wie's geht. Aber die Prediction hab ich da vor der AWS-Reinvent-Keynote gestellt, geschrieben. Und was hat Werner Vogels gesagt? Werner Vogels hat in seiner Keynote The Frugal Architect vorgestellt, ist seine Webseite. Und das sind sieben Regeln zu simple laws for building cost-aware, sustainable and modern architectures. Was bedeutet das also? Der CTO von Amazon Web Services sagt eigentlich unterm Strich genau das gleiche wie ich.",
            "start": 3068174,
            "end": 3102839,
            "confidence": 0.7700281690140842,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dann schauen wir mal, ob ihr beide recht habt.",
            "start": 3103140,
            "end": 3105460,
            "confidence": 0.7087777777777777,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Für alle Hörerinnen und Hörer da draußen, wenn ihr in einer Firma seid, die einen Public Cloud Provider nutzen, also einen Hyperscaler, Google Cloud, Amazon Web Service oder Azure, schaut euch mal den frugalen Architekten an, Link in den Show Notes. Das sind sieben Regeln, wie ihr vielleicht den nächsten größeren Impact in eurer Firma machen könnt, indem ihr die Cloud Kosten erstmal ordentlich senkt, ohne Performance einmüssen zu müssen.",
            "start": 3105480,
            "end": 3128945,
            "confidence": 0.7849857142857144,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und Andi ist da ja Spezialist, weil ich kann mich erinnern, schon vor Jahren, wo wir zusammengearbeitet haben, ist er mir schon immer auf den Sack gegangen mit irgendwelchen Messages. Hey, da in unserem AWS-Account, da ist so ein komischer Note, der herumeidelt. Wem gehört denn der? Der hat keinen ordentlichen Tag und wir zahlen da. Und nach der Reihe sind so Messages gekommen, weil Andi hatte da einige Skripts geschrieben. mit seinem Team, die genau das überprüft haben, um Kosten zu sparen in der Cloud. Das war schon vor über fünf Jahren, also du warst schon früh dran.",
            "start": 3129547,
            "end": 3158664,
            "confidence": 0.7615353535353532,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Offen gesprochen, Freunde habe ich mir dadurch nicht gemacht. Aber nun gut, lassen wir das. Kommen wir zur zweiten Prediction, Wolfgang.",
            "start": 3158684,
            "end": 3164366,
            "confidence": 0.5659999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wieder haben wir das Problem mit einer schweren Messbarkeit, aber du bist ja der Spezialist im Sachen Messen, das heißt, du wirst mir da jetzt helfen können. Das ist ein bisschen eine andere Prediction, aber meine Vermutung, Geht wieder in den AI-Bereich hinein, klar. Wie soll's anders sein?",
            "start": 3164406,
            "end": 3178518,
            "confidence": 0.7196530612244898,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich hab nur drauf gewartet. Ich hab auch eine AI-Prediction, aber die hab ich unter Bonus-Counter-Argument gesetzt. Die wollte ich eigentlich nicht rausholen, schauen wir mal.",
            "start": 3178538,
            "end": 3187133,
            "confidence": 0.7343076923076922,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich vermisse ja in der Datenbankwelt, in der ich ja gerne zu Hause bin, irgendwie diese AI. Und die Datenbankleute sind immer sehr langsam. Das ist so das einzige Problem an dieser Prediction. Also Datenbankleute, die sind nicht schnell, auch wenn man jetzt noch schaut, mit was für Tools die arbeiten, mit was für Backtrackern. Die sind immer irgendwie zehn Jahre hinten. Aber ich rechne mal mit dem exponentiellen Wachstum trotzdem. Und ich erwarte mir, dass in irgendeiner Form im nächsten Jahr SQL durch AI ersetzt wird.",
            "start": 3189125,
            "end": 3217619,
            "confidence": 0.8344137931034482,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Kannst du das mal ein bisschen erläutern?",
            "start": 3217919,
            "end": 3220241,
            "confidence": 0.4517142857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist noch so ein bisschen das Problem. Klar, wie soll man die Zukunft vorhersagen? Aber meine Vermutung ist, dass ich in Zukunft nicht mehr SQL schreiben muss, sondern in einer anderen Form irgendwie AI-Anfragen stelle, Prompts, die mir dann automatisiert aus meiner Datenbank, aus meiner SQL-Datenbank, die Daten rausholen, aber eben so AI-wischiwaschi, prompt basiert, keine Hardcore-SQL-Anfragen, sondern dass die AI-Welt und die Datenbank-Welt irgendwie verschwimmen und in den meisten Fällen will man ja vielleicht auch nicht das genaue Ergebnis, also jetzt irgendwie Wenn ich ein Revenue vom letzten Jahr will, dann will ich wahrscheinlich das genaue Ergebnis. Aber wenn es dann in Richtung geht, gib mir einfach irgendwie den Revenue, den ich in Zukunft haben werde. Da kann ich keine SQL Query in dem Sinne schreiben, aber dass ich dann automatisch einfach in der Datenbank ein Modell drin habe, das automatisch meine Daten versteht und mir dann irgendwie ausgibt anhand der letzten Daten, so schaut der Revenue im nächsten Monat aus, im nächsten Jahr und dafür wird es eine spezielle Anfragesprache geben und das Ganze ist dann aber so integriert, dass es wie SQL ist, also wirklich auf niedrigster Ebene, nicht irgendwer baut ein Modell, dass das kann, das ist schon klar, sondern wirklich, dass es in der Datenbank abläuft und wirklich ganz unten in der Datenbank drin ist und in MySQL schon oder in Postgres wahrscheinlich, MySQL wird nicht so schnell sein, einfach mitgeliefert wird.",
            "start": 3220281,
            "end": 3299177,
            "confidence": 0.8000251046025109,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber wie stelle ich mir das vor? Ich mache in meinem Code eine Datenbank-Connection auf zu Postgre. Und da, wo ich dann select Sternchen from table, group by, und da habe ich dann einen Prosa-Textprompt drin?",
            "start": 3299377,
            "end": 3311044,
            "confidence": 0.742027777777778,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Entweder Prosa oder vielleicht irgendeinen anderen Dialekt, der mir dann so schwammige Anfragen auch beantwortet und eben automatisch mein Schema versteht in irgendeiner Form. Vielleicht mir dann auch Tabellen wieder zurückliefert, aber intelligent und automatisch verstanden und vielleicht sogar mit Predictions oder mit Pattern erkennen.",
            "start": 3311084,
            "end": 3328775,
            "confidence": 0.8382444444444446,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist brave. Erst hab ich gedacht, du kommst mit irgendwas so, ja, AI optimiert mal einen SQL-Query, gibt dir alles schon. Aber das ist mutig. Wenn ihr den Matthias grade sehen könntet, wir machen den Podcast ja unter anderem auch mit Video, der hatte grad die Augen zusammengekniffen, und du hast richtig gesehen, ratter, ratter, ratter, und jetzt grade schüttelt er so ein bisschen den Kopf.",
            "start": 3329075,
            "end": 3349822,
            "confidence": 0.7166119402985075,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bin extrem skeptisch, was das angeht. Ich frag mich, wie das in der Praxis funktionieren soll. Weil einfach manche Sachen in ... natürlicher Sprache uneindeutig sind. Und da hättest du ja dann Infrastruktur irgendwo laufen, die fuzzy ist. Also ich kann mir das schwer vorstellen. Ich wüsste auch gar nicht, wie man das quantifizieren soll, Wolfgang. Das wäre vielleicht auch nochmal eine Frage. Aber wenn du die Wette nicht verlieren willst, dann solltest du das vielleicht ein bisschen genauer definieren.",
            "start": 3349842,
            "end": 3374649,
            "confidence": 0.7060500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das ist ein bisschen schwierig. Ich hoffe einfach auf den exponentiellen Wachstum, dass das passiert, weil fuzzy ist das Ganze und so weiter. Ich weiß nicht, wie man es genau definieren kann oder ein Kriterium festlegen kann, aber dass die Datenbanken auf jeden Fall ein AI-artiges Interface anbieten, ohne dass man da irgendwie ein extra Produkt oder so hat. Und dass das wirklich einen großen Change gibt, dass dann plötzlich Leute anfangen, eben statt SQL so Prompts zu schreiben.",
            "start": 3375553,
            "end": 3400869,
            "confidence": 0.8172625000000002,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich nehme diese Prediction an und ich denke, wir müssen sie ein bisschen limitieren. Also das bedeutet, Wir akzeptieren eine solche Funktionalität auf allen Datenbanken, die unter modern-sql.com gelistet sind. Ist das okay?",
            "start": 3402370,
            "end": 3418405,
            "confidence": 0.7476363636363638,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ah, du meinst von den Herstellern.",
            "start": 3419344,
            "end": 3420445,
            "confidence": 0.6555,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, das bedeutet BigQuery, DB2, MariaDB, MySQL, OracleDB, PostgreSQL Server und SQLite.",
            "start": 3420886,
            "end": 3429053,
            "confidence": 0.8073333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Puh, das sind schon die langsamsten, die da am Markt sind eigentlich. Aber ja, also ...",
            "start": 3429393,
            "end": 3434929,
            "confidence": 0.756875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir haben ja von SQL geredet.",
            "start": 3434939,
            "end": 3436020,
            "confidence": 0.8213333333333331,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ja, ja.",
            "start": 3436200,
            "end": 3437080,
            "confidence": 0.48333333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Oder anders, pass auf.",
            "start": 3437100,
            "end": 3437861,
            "confidence": 0.36775,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Frage ist, was ist, wenn's ein Postgres-Plugin gibt? Zählt das dann?",
            "start": 3437901,
            "end": 3441745,
            "confidence": 0.7735,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nein. Ich würde mich auf jede SQL-Datenbank einlassen, die SQL spricht. Unter ganz harten Kriterien würde ich mich teilweise sogar auf einen SQL-ähnlichen Dialekt einlassen, wie zum Beispiel Cassandra Query Language. Ist ja ähnlich.",
            "start": 3442405,
            "end": 3460618,
            "confidence": 0.8256470588235296,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich bin komplett einverstanden damit, weil ich glaube, entweder es passiert und dann wird es exponentiell passieren und es wird sowieso ganz klar sein, dass die Wette gewonnen ist oder die Prediction eingetreten ist oder eben nicht. Ich glaube, dass es relativ klar sein wird. Aber die Limitierungen sind okay.",
            "start": 3461698,
            "end": 3478921,
            "confidence": 0.8465294117647062,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir festigen uns auf einer SQL-Datenbank, richtig?",
            "start": 3478961,
            "end": 3481381,
            "confidence": 0.5778571428571428,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau.",
            "start": 3481421,
            "end": 3482122,
            "confidence": 0.564,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay. Also jetzt, wenn Reddits das macht, dann zählt das nicht. Und das Feature sollte mal in Produktion eingesetzt werden von irgendjemandem. Irgendwer muss dann einen Blogpost geschrieben haben, das läuft in Produktion.",
            "start": 3482142,
            "end": 3490343,
            "confidence": 0.6590303030303032,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jaja, okay.",
            "start": 3490602,
            "end": 3491542,
            "confidence": 0.5105000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "So, weil ich dann denke, ich hab die ganze Geschichte jetzt hier gewonnen.",
            "start": 3492343,
            "end": 3496124,
            "confidence": 0.7090000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, man muss ja da mal ordentlich was vorlegen. Wischiwaschi, Pseudo, irgendwas wachst da um einen halben Prozent.",
            "start": 3496624,
            "end": 3503326,
            "confidence": 0.6828888888888888,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nee, nee, nee, pass auf, ich hab noch zwei Predictions. Und eine ist ... Pass auf, dann hau ich die jetzt raus. Schieß los. Eine große App wird seamable. Also, ich rede von einer großen App wie Slack, Metamost, Teams, ja, oder eine ähnliche App.",
            "start": 3503626,
            "end": 3519492,
            "confidence": 0.6639999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also eine Kommunikations-Messaging-App.",
            "start": 3520033,
            "end": 3522396,
            "confidence": 0.6406666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, die releasen ein Feature, dass man eigene Themes machen kann und irgendjemand baut dann einen ICQ-Theme. Alternativ, ist ja auch so ein Twist, wo du guckst, ob du das annimmst, kann auch sein, dass Spotify's Theme überwirrt und jemand holt Winnipe mit der Spotify-Funktionalität zurück.",
            "start": 3522436,
            "end": 3538315,
            "confidence": 0.6822826086956519,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehr schön. Gefällt mir. Ich find, dass ... ICQ ist naheliegend. Es gibt ja schon Slack-Themes, so Farben zumindest, aber das muss dann schon mehr sein, oder?",
            "start": 3538932,
            "end": 3550963,
            "confidence": 0.7456666666666668,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, ja, schon, also mindestens mit dem EU-Sound. Also, der muss da schon drin sein.",
            "start": 3551163,
            "end": 3556488,
            "confidence": 0.7473333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber das geht jetzt vielleicht schon. Das wär ja unfair, wenn's jetzt schon möglich wär. Es müssen schon mehrere Features, tiefere Integration sein.",
            "start": 3556668,
            "end": 3564035,
            "confidence": 0.7039166666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, ich glaub, ICQ hat ja keine Groupsheds.",
            "start": 3564055,
            "end": 3565616,
            "confidence": 0.614125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, klar. Aber ich sage, du kannst jetzt schon die Farben anpassen in Slack und Sounds kannst du auch anpassen. Also du könntest ja schon so was quasi bauen.",
            "start": 3566379,
            "end": 3573822,
            "confidence": 0.6741724137931036,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es muss schon hart richtig so wie ICQ sein. Und ich schwöre dir, angenommen, das baut jemand und das macht die Runde über Hacker News. Ihr kennt doch, ihr wisst doch, wie es Tech-Leute sind. Ich denke, es wird sehr, sehr stark installiert. Also ich denke nicht, dass das über Dauer genutzt wird. Aber ich denke, es gibt super viele Leute, die das wenigstens einmal ausprobieren.",
            "start": 3573842,
            "end": 3593942,
            "confidence": 0.7919393939393938,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Andi, deine ICQ-Nummer?",
            "start": 3594162,
            "end": 3595803,
            "confidence": 0.7080000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "119282536. Wow.",
            "start": 3595813,
            "end": 3596864,
            "confidence": 0.5165,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Matthias? Matthias ist zu kreativ, der merkt sich keine Nummern. Meine war 45228969.",
            "start": 3598505,
            "end": 3602578,
            "confidence": 0.7480769230769231,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "1197564 oder so.",
            "start": 3602578,
            "end": 3607151,
            "confidence": 0.543,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du kannst irgendwas sagen jetzt. Aber es ist unglaublich, ja.",
            "start": 3607171,
            "end": 3610513,
            "confidence": 0.6386,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Du warst aber früh dran, du hast eine kurze, ne?",
            "start": 3610533,
            "end": 3612054,
            "confidence": 0.46390000000000003,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich hab eine kurze.",
            "start": 3612074,
            "end": 3613135,
            "confidence": 0.5062,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Matthias, würdest du dir das installieren?",
            "start": 3613175,
            "end": 3614615,
            "confidence": 0.41383333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, und ich wollte eigentlich noch was dazu sagen. Nein ist ja also so eine wette da raus zu hauen so von wegen irgendeine große app wird bestimmt sie mögen werden da würde ich als zuhörer bedenken aber eigentlich kann ich zum beispiel zumindest andere color themes installieren zählt das schon.",
            "start": 3614655,
            "end": 3632716,
            "confidence": 0.7156470588235294,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee nee nee nee nee nee nee komm also.",
            "start": 3632956,
            "end": 3634999,
            "confidence": 0.5006666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jaja, ich hab ja gerade gesagt, also es muss schon eine tiefere Integration sein als nur die Farben.",
            "start": 3636380,
            "end": 3640884,
            "confidence": 0.6698333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, da muss ich schon eben würden.",
            "start": 3640924,
            "end": 3642545,
            "confidence": 0.515,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist das dann tief genug für dich? Ja, der Wolfgang muss ja das Essen irgendwann mal zahlen auch dafür.",
            "start": 3642585,
            "end": 3647268,
            "confidence": 0.5713684210526315,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wenn er jetzt verliert, meine ich. Die erste Sache, die ich finde, wenn ich dann nach Google ist, wie kann ich dieses Oh-Oh-ICQ-Sound bei Slack einbauen?",
            "start": 3647549,
            "end": 3656495,
            "confidence": 0.6442962962962964,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Fängt schon an. Richtige Fragen werden gestellt.",
            "start": 3657076,
            "end": 3659538,
            "confidence": 0.6912857142857144,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Tatsächlich hätte ich andere Vorhersagen erwartet. Und eine Kategorie, die ihr einfach komplett.",
            "start": 3660078,
            "end": 3665345,
            "confidence": 0.7999999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ausgelassen habt, die ... Moment, ich hätte noch eine, falls ich ... Hast du auch noch eine?",
            "start": 3665385,
            "end": 3670272,
            "confidence": 0.6146470588235295,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, ja, nein, ich hab keine mehr, aber du darfst.",
            "start": 3670292,
            "end": 3672795,
            "confidence": 0.5347,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, bevor der Matthias jetzt sagt, und zwar, ich hab noch eine zu Open-Source-Projekten.",
            "start": 3672855,
            "end": 3677882,
            "confidence": 0.8010714285714287,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bitte, schieß los.",
            "start": 3678402,
            "end": 3680004,
            "confidence": 0.48100000000000004,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich denke, mehr Open-Source-Projekte werden die Lizenz zur Business-Source-License oder zur Server-Side-Public-License wechseln. Das bedeutet, die werden in die Fußstapfen von Terraform, Elasticsearch, MongoDB oder Redis Modules gleichtun.",
            "start": 3680044,
            "end": 3694581,
            "confidence": 0.8293214285714287,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also gegen die Nextcloud-Richtung in das Dual-Licensing.",
            "start": 3694902,
            "end": 3698728,
            "confidence": 0.7477142857142859,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja. Und nur kurz zur Erklärung, die Business-Source-License ist die, wo Terraform zum Beispiel gewechselt ist. Das bedeutet Leute, die Terraform nutzen, um damit Geld zu verdienen und darauf ihr Produkt bauen. Das können sie nicht mehr mit der Business Source License. Und die Server Side Public License, jetzt muss ich ganz kurz aufpassen, das ist die Lizenz, wo Elasticsearch gewechselt ist und die besagt unter anderem, dass nicht nur die Modifikationen an Elasticsearch dann veröffentlicht werden müssen, sondern der ganze Stack, der Elasticsearch dann betreibt, der muss mit veröffentlicht werden. Und das macht es so uninteressant, warum Amazon zum Beispiel kein Elasticsearch mehr einsetzen kann, weil die dann den kompletten Management-Stack von Amazon, um das Produkt Elasticsearch zu betreiben, mit veröffentlichen würden. Es gibt Kritik, dass das gar nicht rechtlich möglich ist, auf Basis von anderen Lizenzen, aber das sind auf jeden Fall diese beiden Lizenzen, die es eigentlich für Hyperscaler oder für andere Firmen unmöglich machen, damit auch Geld zu verdienen.",
            "start": 3698748,
            "end": 3767530,
            "confidence": 0.8686196319018399,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wie quantifizierst du das? Mehr machen das? Weil, dass es mehr Projekte gibt mit der Lizenz, das ist wahrscheinlich easy klar.",
            "start": 3767570,
            "end": 3773394,
            "confidence": 0.7546818181818181,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, sagen wir fünf Projekte, fünf größere Projekte, die eine gewisse Reichweite haben.",
            "start": 3774074,
            "end": 3780559,
            "confidence": 0.7648461538461538,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist sehr schwammig. Was ist Reichweite?",
            "start": 3781004,
            "end": 3782865,
            "confidence": 0.771625,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, komm, aber du hast ja auch angefangen mit deinem, ich migriere, ich migriere runter auf der Cloud. Ja, was haben wir gesagt? Zehn Firmen haben wir da gesagt? Ja. Ist das richtig?",
            "start": 3783345,
            "end": 3792690,
            "confidence": 0.5277272727272729,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja. Gut, dann, Es ist sowieso, wir müssen das sowieso, wenn wir zwei gegen zwei haben, ist sowieso schwierig, dann mit einer dritten zu kommen. Aber ich bin auch deiner Meinung übrigens, dass das wahrscheinlich passieren wird. Also ich kann mir auch vorstellen, dass das viele Open-Source-Projekte machen, weil das einfach der einzige Ausweg ist, den sie sehen. Leider, muss man dazu sagen. Nextcloud zeigt zwar, dass es auch Alternativen gibt, aber ich glaube, es ist sehr, sehr schwierig, die wirklich zu verfolgen und da auch Geld zu verdienen mit der komplett offenen Variante. Das muss man schon auch sagen. Es ist einfach einfacher, da so die Lizenz rauszuknallen.",
            "start": 3792750,
            "end": 3822942,
            "confidence": 0.8277431192660549,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn du die gleiche Prediction hast, dann ist es ja zwei gegen zwei. Dann haben wir jetzt einmal hier die Cloud-Kosten und die Migration zurück zur On-Premise. Dann haben wir einmal hier deine komischen Prompt-als-SQL-Geschichten da, Echt wir sind finde ich und dann haben wir einmal meine icq oder bin der geschichte aus spotify oder.",
            "start": 3823002,
            "end": 3840987,
            "confidence": 0.7368181818181818,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Brauchen wir eigentlich noch einen tiebreaker weil wenn ihr jetzt beide unvorhersehbarerweise richtig liegt, dann habt ihr beide recht oder vielleicht beide unrecht die nachdem wir uns sehen.",
            "start": 3841027,
            "end": 3851409,
            "confidence": 0.7801785714285716,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wenn es wirklich ist dann kannst du dir matthias in einem jahr noch.",
            "start": 3851429,
            "end": 3856130,
            "confidence": 0.8107142857142856,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Gar nicht nötig weil ich hab nämlich schon eine. Und die ist relativ leicht auch zu entscheiden. Es geht um Programmiersprachen, eine Kategorie, die ihr komplett ausgelassen habt, wo ich sehr enttäuscht bin von euch, weil ihr wisst, ich bin ein großer Fan von Programmiersprachen. Und da hätte ich eine Frage. Ihr sollt vorher sagen, welche Programmiersprache wird im nächsten Jahr am meisten wachsen, an Popularität zunehmen? Wie bestimmt man Popularität, ist jetzt die Frage. Ich würde es bemessen an der Anzahl an ProgrammiererInnen, die diese Sprache benutzen. Es gibt nämlich den State of the Developer Nation und in der 25. Edition im ersten Quartal 2024 werden wir die Antwort erfahren.",
            "start": 3856150,
            "end": 3903233,
            "confidence": 0.8290360360360359,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wir sprechen über die Programmiersprache, die den meisten prozentualen Wachstum hat.",
            "start": 3903293,
            "end": 3907675,
            "confidence": 0.8350833333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Größter Zuwachs an ProgrammiererInnen.",
            "start": 3907695,
            "end": 3910576,
            "confidence": 0.8837499999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Prozentuell oder absolut.",
            "start": 3910876,
            "end": 3912197,
            "confidence": 0.4626666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Prozentual, weil sonst wäre es unfair.",
            "start": 3912237,
            "end": 3914158,
            "confidence": 0.6795,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die die Sprache nutzen, die Frage ist.",
            "start": 3914198,
            "end": 3916239,
            "confidence": 0.8291428571428571,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die die Sprache nutzen, ist das richtig? Ja, natürlich, die Leute die die Sprache nutzen. Die Anzahl der NutzerInnen laut dieser Statistik und zwar der prozentuale Zuwachs.",
            "start": 3916259,
            "end": 3926625,
            "confidence": 0.7336666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie heißt das Ding?",
            "start": 3926885,
            "end": 3928026,
            "confidence": 0.6695,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ne ne ne hör mal auf zu googeln da, du guckst ja schon von den Ergebnissen, lass das mal sein.",
            "start": 3928046,
            "end": 3931968,
            "confidence": 0.5636,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir sehen, dass das nicht aufläuft, das ist ein ganz schlechtes.",
            "start": 3931988,
            "end": 3935190,
            "confidence": 0.3772727272727272,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, nee, du hast die, du hast die gleichen Informationen.",
            "start": 3935877,
            "end": 3937878,
            "confidence": 0.4518,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, du kannst noch Fragen stellen.",
            "start": 3937898,
            "end": 3939198,
            "confidence": 0.5938333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ah, du willst gar nicht, ich weiß ja nicht einmal, was für Programmiersprachen da draußen sind.",
            "start": 3939238,
            "end": 3943739,
            "confidence": 0.45599999999999996,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist Teil der Vorhersage.",
            "start": 3943759,
            "end": 3945359,
            "confidence": 0.6441999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist mein Problem.",
            "start": 3945379,
            "end": 3946320,
            "confidence": 0.4445,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das muss jetzt dein Bauchgefühl dir sagen.",
            "start": 3946340,
            "end": 3948040,
            "confidence": 0.5884285714285714,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also, ich habe eine Antwort.",
            "start": 3948080,
            "end": 3948900,
            "confidence": 0.6656000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay.",
            "start": 3949340,
            "end": 3949780,
            "confidence": 0.525,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe eine Antwort.",
            "start": 3949840,
            "end": 3951141,
            "confidence": 0.67125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Prozentuell.",
            "start": 3951181,
            "end": 3952681,
            "confidence": 0.797,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Prozentual.",
            "start": 3952721,
            "end": 3954241,
            "confidence": 0.723,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Prozentuell. Ja, okay, ja. Ich bin für Rust.",
            "start": 3954261,
            "end": 3956522,
            "confidence": 0.5546249999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich sage JavaScript.",
            "start": 3957655,
            "end": 3958536,
            "confidence": 0.7383333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich lasse das jetzt mal unkommentiert. Ich finde das interessant. Beide Tipps.",
            "start": 3958576,
            "end": 3963539,
            "confidence": 0.7715833333333332,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich denke Rust wird wieder die, also Rust führt seit sechs Jahren oder sowas die Stackoverflow oder die GitHub-Umfrage an in Bezug auf, welche Programmiersprache möchte ich nächstes Jahr lernen.",
            "start": 3963579,
            "end": 3976288,
            "confidence": 0.8577666666666669,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Siehst du das, du hast schon mehr Informationen als ich, du studierst das ja.",
            "start": 3977164,
            "end": 3979885,
            "confidence": 0.5232857142857144,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ne, ich hab mir die Reports mal irgendwann durchgelesen, aber da es ja um die Frage geht, wer die nutzt, und das hatten wir ja auch in der Rust-Episode geklärt, da glaube ich ganz stark, dass es JavaScript ist, weil die Sprache überall in den ganzen Bootcamps und Co. geleert wird, im Browser, also die hat halt, eine unglaubliche Verbreitung und das stimmt.",
            "start": 3979906,
            "end": 4001677,
            "confidence": 0.763285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber prozentual ist es wahrscheinlich hätte jetzt gesagt bei javascript wenn da millionen dazukommen sind es halt trotzdem nur paar prozent.",
            "start": 4001717,
            "end": 4008701,
            "confidence": 0.7375238095238095,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also ja aber schauen wir mal javascript gegen rust.",
            "start": 4008821,
            "end": 4013144,
            "confidence": 0.5423333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Rust ist so wie linux desktop linux auf dem desktop 2024.",
            "start": 4013224,
            "end": 4017116,
            "confidence": 0.7761818181818182,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dieses jahr ist es soweit genau.",
            "start": 4017126,
            "end": 4019688,
            "confidence": 0.7591666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Schön schön dieses Jahr ist das eigentlich.",
            "start": 4020140,
            "end": 4022661,
            "confidence": 0.5551428571428572,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Keine Vorhersage aber egal wir kommen zur letzten finalen Runde. Wir haben jetzt noch vier Audioschnipsel und ich würde euch bitten auch wieder den.",
            "start": 4022721,
            "end": 4033043,
            "confidence": 0.8577083333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Stift zu zücken der Punkte stand nochmal Wolfgang führt mit vier Punkten gegen meine mickrigen zwei Punkte. Hier sind Ellen und Doreen vom Unmuted Podcast und erstmal herzlichen Glückwunsch zu eurer hundertsten Folge. Ich habe dir auch eine kleine Schätzfrage mitgebracht, beziehungsweise euch, Andi und Wolfgang. Und zwar geht es ein bisschen um Frauen in der IT. Und zwar dürft ihr mal schätzen, wie viele Frauen im Alter von 45 Jahren, die einen Hochschulabschluss in der Informationstechnologie gemacht haben, nicht mehr dort tätig sind. Wie viele Frauen mit 45 Jahren steigen aus der IT aus oder sind ausgestiegen?",
            "start": 4033083,
            "end": 4073963,
            "confidence": 0.8274285714285718,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich vermute mal, es ist eine Prozentfrage, oder?",
            "start": 4074283,
            "end": 4077065,
            "confidence": 0.6044999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Boah, was ein Brett. Ich weiß noch nicht mal, wo ich anfangen soll, nachzudenken. Also wir suchen eine Prozentzahl, ist das richtig? Ich finde das schön, dass man dem Wolfgang auch ansieht, dass das auch nicht leicht für ihn ist. Ich bin offen und ehrlich, ich habe einfach nur hart geraten, weil ich keinen Datenpunkt habe, an dem ich mich festklammern könnte.",
            "start": 4077105,
            "end": 4095678,
            "confidence": 0.7583709677419358,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oh, wir sind knapp dran.",
            "start": 4097644,
            "end": 4099866,
            "confidence": 0.695,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ihr habt 60. Ich habe 63,5 und der Wolfgang hat 60 Prozent.",
            "start": 4099906,
            "end": 4105171,
            "confidence": 0.6345,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Meine Theorie ist nämlich, dass Frauen ständig erklärt wird, wie gut sie in Kommunikation sind und darum alle weggedrängt worden sind, irgendwo in was nicht IT-mäßiges.",
            "start": 4105191,
            "end": 4115321,
            "confidence": 0.8374230769230769,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe gar keine Theorie, ich habe einfach gar keine Ahnung. Ich habe blind geraten. Wenn die Studie schon ein bisschen älter ist und ja auch quasi die Frauen schon über 45 Jahre alt sind, würde ich sagen, relativ viele, ehrlich gesagt. Also über 60 Prozent. Sogar noch schlimmer als das sind nämlich mehr als 90 Prozent. Das finde ich schon eine krasse Geschichte und ich glaube, die Gründe dafür sind sehr unterschiedlich. Also sowas wie Elternzeit und dann in so eine schnelllebige Branche zurückfinden, aber auch generell. dass viele Frauen in dem Alter zum Beispiel auch noch keine Role Models hatten. Es sind, glaube ich, viele, viele Aspekte, die da reinfallen. Aber ich habe trotzdem die Hoffnung, dass es sehr viel besser wird. Also ich möchte im Alter von 45 und darüber hinaus immer noch in der IT tätig sein. Mal gucken, wie sich das bewerkstelligen lässt. Ich hoffe, Ihnen auch. Genau, wenn ja, sehr gut. Wenn ihr mehr über die IT als Branche lernen wollt, dann hört doch mal in unsere Folge mit Elka rein, da gehen wir dem nämlich auf den Grund. Und generell sind wir ein Podcast von und mit Frauen aus der IT, damit viel mehr Frauen Role Models haben und nicht alle abhauen, wenn sie 45 werden. Tada!",
            "start": 4115361,
            "end": 4190054,
            "confidence": 0.7964766355140187,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "90 prozent wow es ist echt extrem.",
            "start": 4190064,
            "end": 4199570,
            "confidence": 0.6157142857142858,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Vielen lieben dank für diese frage sehr empfehlenswert der unmute it podcast auch verlinkt in unseren show notes hört doch mal rein. Was ich aber auch spannend fand wir waren alle drei im 60er prozent bereich. Aber das bedeutet ich habe einen punkt aufgeholt drei zu wolfgang vier hallo zusammen hier sind der patrick und die claudia vom wartungsfenster podcast wir sind eingeladen worden eine technische schätzfrage für die hundertste folge vom engineering kiosk zu erstellen, Da machen wir natürlich gerne mit und herzlichen Glückwunsch. Und zwar haben wir uns gefragt, wir fragen euch, was glaubt ihr, wie viele Sicherheitslücken mit einem CVSS von größer neun, also kritisch, in diesem Jahr, was noch läuft, bei der NVD veröffentlicht wurden? Und welchen etwaigen Prozentsatz diese ausmachen von allen reporteten Lücken? Boah. Also, ich hab da, glaub ich, mal vor zwei Jahren nachgeguckt, und es sind immer noch sehr viele SQL-Injections im Umlauf.",
            "start": 4199590,
            "end": 4264429,
            "confidence": 0.8439072847682121,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die sind ja nur neue, oder?",
            "start": 4264449,
            "end": 4266070,
            "confidence": 0.6323333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, ja, in diesem Jahr. 2023, aber trotzdem gibt's ja. Aber höher neun? Boah!",
            "start": 4266110,
            "end": 4272115,
            "confidence": 0.722642857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin ja eigentlich braver Hörer von Wartungsfenster, und ich hab so im Kopf, dass sie das mal erwähnt haben. Aber ich kann mich natürlich nicht mehr an die Zahl erinnern.",
            "start": 4272155,
            "end": 4281082,
            "confidence": 0.6572903225806452,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, ich bin entweder sehr nah dran oder komplett weit weg. Ich hab eher das Gefühl, ich bin komplett weit weg. Aber gut, ich ... Tolle Aussage.",
            "start": 4282367,
            "end": 4289393,
            "confidence": 0.7717037037037038,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "... Ich hab 247 und drei Prozent.",
            "start": 4292686,
            "end": 4296319,
            "confidence": 0.7301428571428571,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ach so, ich hab 4.521 und die Prozentzahl hab ich nicht, die nicht gezählt aktuell. Ich hab 4.521. Das ist 20-fache von mir. Okay.",
            "start": 4296359,
            "end": 4302504,
            "confidence": 0.6212500000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und hier die Auflösungen. 2023 war ein außerordentlich erfolgreiches Jahr im Hinblick auf gefundene Sicherheitslücken, denn das Jahr ist noch nicht ganz rum. Wir schreiben immerhin gerade mal den 1. Dezember 2023. Aber Stand heute wurden insgesamt 25.993 Sicherheitslücken mit einem CVI versehen. Und davon waren, sag und schreibe, 4.131 Sicherheitslücken kritisch. Das heißt, sie hatten einen Signals-Export von 9 bis 10. Und das macht insgesamt 15,89 Prozent aus. Da sag ich nur, herzlichen Glückwunsch. Happy Patching.",
            "start": 4306378,
            "end": 4354074,
            "confidence": 0.810909090909091,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Abgefahren, wie nah ich dran war.",
            "start": 4354134,
            "end": 4355875,
            "confidence": 0.6338333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Danke, Patrick. Oder danke nicht, Patrick. Nicht schlecht, Andi.",
            "start": 4355895,
            "end": 4362248,
            "confidence": 0.7875555555555556,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Pass auf, Wolfgang, mit deinem 200, ganz im Ernst, kannst du nicht richtig liegen, weil diese Datenbank meines Erachtens nach einfach.",
            "start": 4362289,
            "end": 4370816,
            "confidence": 0.7923809523809524,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Alles ... Ja, ja, weil es ist ja das höchste Level. Darum habe ich mir gedacht, okay.",
            "start": 4370876,
            "end": 4375895,
            "confidence": 0.6451764705882352,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, aber wie gesagt, ich weiß jetzt nicht alles, was als neu klassifiziert wird, aber da ja da wirklich jedes Produkt drin ist, ich meine, so eine Remote Code Execution, ist mal schnell geschrieben, ne?",
            "start": 4375935,
            "end": 4388121,
            "confidence": 0.7864285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, ich bin zu naiv, wenn es um Security geht. Ich sehe schon.",
            "start": 4388201,
            "end": 4392243,
            "confidence": 0.6374615384615384,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ah, vielen lieben Dank, Claudia und Patrick. Ihr habt mir den Gleichstand, ihr habt mir zum Gleichstand geholfen. 4 zu 4 steht's.",
            "start": 4392323,
            "end": 4400727,
            "confidence": 0.7245,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und natürlich auch die Hörempfehlung Wartungsfenster. Auch ein super Podcast. Danke dafür.",
            "start": 4401253,
            "end": 4406575,
            "confidence": 0.7951666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "So, Konzentration. Es geht los. Die letzte entscheidende Frage.",
            "start": 4406595,
            "end": 4413337,
            "confidence": 0.8412222222222223,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So macht man das auch immer bei Werbung Millionär, oder? Hallo Freunde vom Engineering-Kiosk und tolle Grüße hier von Roland aus Duisburg. Ich bin QA-Ingenieur und habe zwei passende Fragen für euch. Wie viele Sekunden beträgt die durchschnittliche Ladezeit einer Webseite auf mobilen Geräten im Jahr 2023? Mit deutschem Mobilfunknetz oder mit österreichischem?",
            "start": 4413377,
            "end": 4436796,
            "confidence": 0.7744150943396227,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist ein großer Unterschied, das stimmt.",
            "start": 4436816,
            "end": 4438317,
            "confidence": 0.6217142857142858,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "In Österreich hat man in der Gondel, die durch einen Berg fährt, LTE.",
            "start": 4439269,
            "end": 4444091,
            "confidence": 0.8390000000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist das nicht normal?",
            "start": 4444131,
            "end": 4445551,
            "confidence": 0.5842499999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "In Deutschland hat man in Düsseldorf Edge.",
            "start": 4445591,
            "end": 4449213,
            "confidence": 0.8151428571428573,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Deswegen die ganzen Stahlbauten überall. Die durchschnittliche Ladezeit.",
            "start": 4449253,
            "end": 4454215,
            "confidence": 0.7354999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir machen das arithmetische Mittel, oder?",
            "start": 4454615,
            "end": 4456576,
            "confidence": 0.6338333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Als wenn das jetzt irgendwie einen Ausschlag geben würde. Inklusive Bilder, oder bis man was sieht, oder first bite, oder?",
            "start": 4456616,
            "end": 4463378,
            "confidence": 0.771,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Als wenn das jetzt hier einen Ausschlag geben würde. Komm, mach fertig.",
            "start": 4463418,
            "end": 4467514,
            "confidence": 0.7186666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay.",
            "start": 4467595,
            "end": 4468776,
            "confidence": 0.608,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich bin bei 4,7 Sekunden.",
            "start": 4468816,
            "end": 4471359,
            "confidence": 0.8059999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "37 Sekunden.",
            "start": 4471369,
            "end": 4472060,
            "confidence": 0.5389999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Uh, ich glaub ... Wie oft bin ich? Jetzt bin ich gespannt. 8,6 Sekunden ist die richtige Antwort. Ich hab gewonnen, ich hab gewonnen, ich hab gewonnen, gewonnen, gewonnen!",
            "start": 4472240,
            "end": 4482111,
            "confidence": 0.6616206896551724,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie kannst du denn so oft sein?",
            "start": 4486067,
            "end": 4487087,
            "confidence": 0.6842857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie kaufst du denn auf 30 irgendwas? Ja, hallo?",
            "start": 4487127,
            "end": 4489728,
            "confidence": 0.47022222222222226,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich denke an euch Deutschen. Jedes Mal, wenn ich mit der deutschen Bahn unterwegs bin, ladet da jede Seite 37 Sekunden. Aber es kommt drauf an, ob das First Byte ist oder nicht. First Byte ist sicher schneller. Aber bis so eine Webseite ordentlich geladen.",
            "start": 4489748,
            "end": 4502110,
            "confidence": 0.7649999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ist, bis ich da was sehe ... Gleiche Informationsbasis.",
            "start": 4502150,
            "end": 4504731,
            "confidence": 0.6320000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Rede dich nicht aus. Da hat der Roland nicht so genau definiert, sonst hätte ich gewonnen, eindeutig.",
            "start": 4504851,
            "end": 4509872,
            "confidence": 0.5525294117647059,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber auch wenn du in deiner Schätzung die First Byte angenommen hättest, wärst du ja komplett aufgewiesen.",
            "start": 4509892,
            "end": 4514813,
            "confidence": 0.6294117647058822,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ganz große grüße gehen raus an den roland goller von nevercode alone tv webdeveloper mark open source genauso wie wir.",
            "start": 4516153,
            "end": 4524737,
            "confidence": 0.7474761904761904,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Als ich den als ich den zettel hochgehalten habe gesagt 4,7 sekunden aber dann habe ich mir gedacht wie viele leute gehen auf der webseite und warten sechs sekunden weil sechs sekunden wäre so mein zweiter gest gewesen habe ich gedacht. Ich warte niemals sechs Sekunden da bin ich schon längst wieder weg und deswegen also 30 Sekunden. Wolfgang wann hast du das letzte mal 30 Sekunden auf der Webseite gewartet?",
            "start": 4524777,
            "end": 4547350,
            "confidence": 0.6927183098591548,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Immer wenn ich in der deutschen Bahn sitze.",
            "start": 4547390,
            "end": 4549752,
            "confidence": 0.600875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja das ist korrekt. Ja aber was bedeutet das ich freue mich riesig denn. Der finale Punktestand. Andi, fünf. Wolfgang, vier.",
            "start": 4549792,
            "end": 4559239,
            "confidence": 0.7313333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war eine unglaubliche letzte Runde von dir, Andi. Herzlichen Glückwunsch dazu. Hätte ich niemals geglaubt, dass du das wieder aufholst. Es war nämlich vorher ganz anders gestanden. Du warst zwei Punkte hinten und jetzt bist du einen vorne. Es war aber insgesamt superknapp. Ich wäre meilenweit daneben gelegen bei fast jeder Frage. Und ihr wart wesentlich besser als ich. Das mal dazu.",
            "start": 4559259,
            "end": 4581598,
            "confidence": 0.7984761904761906,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber wahnsinnige Fragen, vielen lieben Dank an alle die da daran teilgenommen haben. Ich wäre auf die Fragen nie im Leben gekommen. Wahnsinn. Und die, ich fand die Fragen waren auch recht divers. Also von Sicherheitslücken über, was mich sehr beeindruckt hat, wie viele Frauen aus der IT raus droppen, das hätte ich glaube ich, das hätte keiner von uns gedacht. Wir waren weit über 30% off. Ja, heute haben wir gelernt, wie viele Services von Google runtergefahren wurden. Also Wahnsinn, Wahnsinn, Wahnsinn. Ich hatte eigentlich gedacht, okay, irgendjemand kommt mit, wie viel Traffic hat der DNSer von Cloudflare dieses Jahr gemacht oder ähnliches. Ich glaube, da hätten wir uns auch um Meilen oder um Terabyte oder um Petabyte verschätzt, aber na gut. Aber Wolfgang, kommen wir zurück zum Wetter. Wohin gehen die 100 Euro?",
            "start": 4582378,
            "end": 4627985,
            "confidence": 0.7337111111111115,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, mein Vorschlag wäre ja gewesen, dass die andere Person dann entscheiden kann über die 100 Euro, aber Andi wollte nicht. Er wollte, dass man das selber entscheidet. Ich habe wieder einmal das Problem gehabt, Ich habe probiert, einen Weg zu finden, sinnvoll zu spenden. Und es ist echt schwierig, weil man einfach keine einfache, coole Möglichkeit hat, irgendwie einfach was zu spenden, wo man sagt, okay, das wird sinnvoll verteilt oder das geht an eine sinnvolle Gruppe. Es ist super schwierig da irgendwas zu finden. Also es gibt ja mittlerweile dieses thanks.dev, das dir automatisch die Dependencies errechnet, sowas was Andi und ich ja auch mal als Projekt geplant hatten, aber aus finanzrechtlichen Gründen dann nie realisieren konnten. Die sind glaube ich in Australien und die analysieren automatisch die Dependencies und man spendet dann zum Beispiel eben die 100 Euro und es wird automatisch verteilt an alle Dependencies. Das wäre eine Möglichkeit, die mir angeschaut habe. Ich bin ehrlich gesagt nicht sehr glücklich mit dem Verteilungen und da wird dann sehr viel gespendet an die Großen, sowas wie Prettier oder so, wo ich mir denke, eigentlich, keine Ahnung, ob ich denen so viel spenden will, die überall eingebunden sind. Schwanke ich noch ein bisschen. Mein zweiter Bereich wäre gewesen, ich wollte eigentlich irgendeine Organisation finden, die sich genau darum kümmert, um irgendwie Open Source, Frauen, irgendwelche Workshops oder so vielleicht für Open Source, primär mit Frauen. Das Einzige, was ich gefunden habe, sind die UN Women nennt sich das von der United Nations, die so Open Source und Education Programme primär in Afrika haben von jungen Frauen von 15 bis 25. Das wäre eine Option. Mir wäre ja viel lieber, irgendeine Gruppe zu haben, die in Deutschland sitzt. Also darum jetzt meine Frage an alle, die jetzt zuhören, wenn ihr noch irgendwie eine sinnvolle Gruppe wisst, dann würde ich es an diese Gruppe spenden und sonst wahrscheinlich an die UN Women, die sich um Open Source und Girls und Education im Software-Engineering-Bereich kümmern.",
            "start": 4628585,
            "end": 4748745,
            "confidence": 0.8057275449101793,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also liebe Hörerinnen und Hörer, falls ihr noch einen guten Vorschlag habt, wo die 100 Euro vom Wolfram hingehen sollen, habt ihr noch Zeit uns das bis zum Ende des Jahres, bis zum 31.12.2023 zukommen zu lassen.",
            "start": 4749528,
            "end": 4760260,
            "confidence": 0.736972972972973,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und ich möchte eigentlich noch ein paar Statistiken loswerden, vielleicht am Ende ein paar Sachen über euch und den Podcast. Eure Topfolge war die Nummer 74, REST, das oft falsch verstandene Architekturparadigma. Es hat scheinbar sehr, sehr viele Leute abgeholt, 144 Prozent häufiger gestreamt als Alle anderen Folgen im Durchschnitt.",
            "start": 4764002,
            "end": 4785851,
            "confidence": 0.76082,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zumindest auf Spotify, also muss man dazu sagen.",
            "start": 4785891,
            "end": 4789072,
            "confidence": 0.6016250000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Obwohl die erst Mitte des Jahres rauskamen im Juni und gegebenenfalls haben wir da so viel Falsches gesagt, dass alle sich die Haare zerrauft haben und den Scheiß nochmal hören mussten. Ich weiß es nicht. Nein, wir haben ein bisschen Kontra bekommen, aber wir haben jetzt nie gesagt bekommen wir waren eine andere sache die eigentlich.",
            "start": 4789112,
            "end": 4806639,
            "confidence": 0.78575,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch ganz interessant von 85 prozent eurer hörer innen haben euch erst 2023 entdeckt es ist immer noch day one ist immer noch, super viel scale ich finde das echt beeindruckend auch die tatsache, wie haben leute angefangen euch zu hören die erste folge da haben die meisten leute mit begonnen mit dieser folge war welches problem löst docker eigentlich, Es ist schlimm.",
            "start": 4806659,
            "end": 4830262,
            "confidence": 0.7862698412698415,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dass so ein Computerbildthema benötigt wird, damit die Leute bei uns einsteigen. Aber ich bin ja froh, dass sie überhaupt uns hören, auch wenn es ein Computerbildthema eigentlich ist, so wie der Andi das immer gern nennt.",
            "start": 4830282,
            "end": 4839183,
            "confidence": 0.8366756756756755,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was ich daran schön finde, ist, dass diese Welches-Problem-löst-Docker-Episode von November 22 ist. Und wir haben den Podcast mit einer sogenannten Evergreen-Strategie aufgesetzt. Mit der These, lass uns mal versuchen, keine News zu behandeln, sondern dass man die Folgen dann später auch noch hören kann. Und wir sehen auch in den Statistiken, in den Hörerstatistiken, dass heute noch Episoden aus den ersten zwei Quartalen 22 gehört werden. Und das find ich unglaublich schön. wir wirklich anscheinend Wissen ins Audioformat auf die Tonspur gebracht haben, was anderthalb Jahre später immer noch gültig ist. Das freut mich schon so ein bisschen.",
            "start": 4839763,
            "end": 4876409,
            "confidence": 0.8339595959595952,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es ist sogar so, dass eigentlich 50 Prozent aller unserer HörerInnen auch alte Episoden, die älter als 60 Tage oder so sind, hören.",
            "start": 4876449,
            "end": 4884380,
            "confidence": 0.7437391304347827,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "An der Stelle gehen auch Grüße raus an die ZuhörerInnen in Brasilien und der Türkei, das sind nämlich Platz 4 und 5. Ihr habt ja scheinbar auch relativ viele Fans und vielleicht Stichwort Fans, ihr habt im letzten Jahr 219% Zuwachs an FollowerInnen und ihr habt 13% mehr Content produziert, also in Minuten.",
            "start": 4884752,
            "end": 4908386,
            "confidence": 0.7902641509433962,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das heißt, Ja, das ist, weil der Andi so viel redet. Das sieht man auch jetzt in den Statistiken, wer mehr spricht. Wir haben ja mittlerweile für alle Episoden ein Transkript. Und Andi hat ein tolles Skript gebaut, um mir zu beweisen, dass ich eigentlich viel mehr rede als er. Und was ist rausgekommen dabei? Andi redet viel mehr als ich.",
            "start": 4909167,
            "end": 4926797,
            "confidence": 0.8105737704918031,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Kurz zum Kontext für alle Hörerinnen und Hörer. Wenn Wolfgang und ich eine Episode aufnehmen...",
            "start": 4926838,
            "end": 4930420,
            "confidence": 0.4501333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Siehst du, jetzt ist es schon wieder soweit zur Erklärung. Und dann fängt Andi Reden an und reden und darum spricht er mehr.",
            "start": 4930440,
            "end": 4936305,
            "confidence": 0.7072608695652172,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Dann meckern wir immer über uns selbst, so nach dem Motto, boah, was war das denn wieder für ein fünf Minuten langer Monolog, und dann, du redest doch viel mehr. Und wir konnten das eine ganze Zeit lang nicht beweisen. Und dank AI haben wir mal gesagt, können wir mal bitte unsere Folgen wirklich Speech-to-Text transkripieren? Und das habe ich dann getan. Und diese AI gibt mir dann auch zurück, welcher Speaker wann gesprochen hat. Und darauf habe ich dann einfach mal berechnet, wer eigentlich so den Hauptredeanteil hat, um zum Beispiel auch zu sehen, wenn wir ein Interview haben, ob dann auch der Gast der Experte am meisten redet. Zum Glück bei allen Interviews war das dann wirklich der Fall. Da hatte dann der Gast so circa so 60 bis 70 Prozent Redeanteil. in einer episode auf diese ganzen 100 stunden wir haben ein bisschen mehr als 100 stunden audio konnte inzwischen produziert was schon eine heftige zahl ist aber über diese 102 episoden habe ich einen redeanteil über 45 prozent und der herr gastler über 41 prozent und somit haben wir leider leider leider bewiesen dass ich Eben.",
            "start": 4936792,
            "end": 5005058,
            "confidence": 0.8206157894736842,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man muss sich das mal vorstellen, bei 100 Stunden, 4%, das sind 4 Stunden, hat der Andi mehr gequasselt als ich. 4 Stunden, Andi. Nimm dir das mal zu Herzen.",
            "start": 5005078,
            "end": 5015946,
            "confidence": 0.7715666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist keine Ausrede, aber man sieht auch bei den Episoden, wer der Content-Lieferant ist. Und da wir öfters mal den Vorwurf bekommen, dass wir sehr im Cloud- und im Infrastrukturbereich unterwegs sind und sehr wenig im Frontend-Bereich, Unsere Fans wissen, wer da in dem Bereich mehr unterwegs ist und wer dann immer Knowledge zieht.",
            "start": 5015966,
            "end": 5035139,
            "confidence": 0.842436363636364,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man sagt ja immer, wenn man sich wirklich gut in dem Thema auskennt, dann kann man sich auch kurz fassen und die kurzen Talks sind die schwierigen. Im Gegensatz, die langen sind ja immer easy. Also bin mir nicht so sicher, ob diese Theorie aufgeht, aber sei mal dahingestellt.",
            "start": 5035179,
            "end": 5048005,
            "confidence": 0.837816326530612,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und auch von meiner Seite natürlich muss ich sagen ihr seid ein tolles Team was sich liebt das neckt sich. Habt ihr euch schon gut gefunden. Denkt macht erst mal weiter so. Bleibt euch ja eh nix anderes übrig. Könnt ja nicht aus eurer Haut aber grundsätzlich würde ich sagen ich spreche für alle. Ich sage ja. Das bereichert schon den Alltag ein bisschen, wenn man euch zuhören kann. Wenn auch nicht immer alles hundertprozentig stimmt, wie der Simon jetzt vielleicht einwerfen würde, aber das meiste ist eigentlich ganz gut recherchiert und ihr macht es ja mit ein bisschen Humor.",
            "start": 5048445,
            "end": 5079153,
            "confidence": 0.7813499999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dafür haben wir ja unsere Community, die sich dann dementsprechend beschweren kann und auch bei uns im Discord uns gerne da das einwerfen kann, wenn wir natürlich irgendein Bullshit erzählen, was ja durchaus passieren kann. Soll ja hin und wieder vorkommen, vor allem, wenn da Andi natürlich spricht.",
            "start": 5079173,
            "end": 5093779,
            "confidence": 0.8089375000000002,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir sind auch nur Menschen und wir machen den Podcast ja auch, damit wir lernen. Deswegen korrigiert uns bitte. Wir sind nicht böse, wir sind eher dankend dafür, weil das zeigt uns eigentlich, wo haben wir unsere Lücken von daher. Aber anscheinend sind wir einigermaßen gut gefahren bisher mit unserem Wissen. Also so richtig falsch kann es auch nicht sein. Matthias, vielen lieben Dank, dass du dir die Zeit genommen hast und auch die Mühe gemacht hast, diese Episode zu moderieren. Vielen lieben Dank, Matthias.",
            "start": 5094242,
            "end": 5122558,
            "confidence": 0.8339294117647056,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Danke auch für die ganze Kommunikation mit den anderen Podcastern. Wir haben natürlich die Fragen nicht gekannt, sonst wäre das nicht so ausgegangen. Sonst hätte ich natürlich gewonnen, eh klar. Also vielen Dank dafür, für die ganze Kommunikation, für das Organisieren von dieser Episode. Danke auch nochmal für die Rust-Episode. Die läuft auch schon ziemlich gut an und hat viele, viele Downloads. Klar, die Hype-Sprache, die ja mich dann auch zum Sieg führen wird, weil Rust wird natürlich eindeutig dann gewinnen in der nächsten Survey. Und vorne sein, vor JavaScript. Und wie gesagt, wer zuletzt lacht, lacht am besten, Andi. Das war jetzt nur der Einstieg, aber die richtigen Wetten und Predictions, da werden wir dann in einem Jahr sehen, wer recht hatte und wer die Zukunft besser prädikten kann.",
            "start": 5122898,
            "end": 5166223,
            "confidence": 0.8214999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "2024 wird auf jeden Fall ein sehr spannendes Jahr. Ich bin sehr gespannt auf die nächsten Episoden und ich freue mich natürlich jetzt schon auf das Abendessen, das einer von euch zahlen wird. Und da bin ich mit Sicherheit auch einfach eingeladen. Das behaupte ich jetzt einfach mal. Die FOSDEM ist Tradition. Immer dran denken, Februar ist FOSDEM-Zeit. In diesem Sinne.",
            "start": 5166233,
            "end": 5184733,
            "confidence": 0.8040491803278693,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, wir freuen uns auch natürlich Leute zu treffen in Brüssel dieses Jahr. Oder, sorry, nächstes Jahr ist das ja. Also nächstes Jahr, Februar, 1.2. glaube ich, um den Dreh dieses Wochenende. Wer dabei ist, lasst uns das wissen im Discord, dann können wir uns auch dort mal physikalisch treffen. Und Matthias ist natürlich auch wie immer dabei.",
            "start": 5185253,
            "end": 5202443,
            "confidence": 0.8007758620689656,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Link wie immer in den Show Notes. Vielen lieben Dank, Wolfgang, für die letzten 100 Episoden. Auf die nächsten 100 Episoden vielen lieben Dank. Der war so ein bisschen abgeklatscht, ne? Ich glaub, das hört man überall.",
            "start": 5203378,
            "end": 5214625,
            "confidence": 0.708054054054054,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, danke, dass du mich ertragen hast. 100 Episoden zum dreistelligen Jubiläum.",
            "start": 5215126,
            "end": 5220109,
            "confidence": 0.734,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich mein, du erfüllst die Stereotypen, ja? Mit ner AI-Prediction und Co.",
            "start": 5220809,
            "end": 5225496,
            "confidence": 0.8001666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber ... Ja, irgendwer muss ja diese Klischees erfüllen. Wenn nicht der Österreicher wär, dann ...",
            "start": 5225536,
            "end": 5231754,
            "confidence": 0.6970625,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das war's von uns. Vielen Dank und bis bald.",
            "start": 5231764,
            "end": 5234648,
            "confidence": 0.8044444444444445,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bye-bye. Ciao.",
            "start": 5234668,
            "end": 5235429,
            "confidence": 0.518,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ciao, ciao.",
            "start": 5235569,
            "end": 5236089,
            "confidence": 0.1695,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7711752442548502,
    "audio_duration": 5242.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}