{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/NdGCBQFNs3xt3TS/download/ep102_quereinstieg.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "d7e2577b-c9db-4157-a31a-688f8d704f0f",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Stell dir mal vor, du hast einen Job und stehst mitten im Berufsleben. Du gehst jede Woche hin, Tag für Tag, aber irgendwie erfüllt dich die Tätigkeit nicht mehr und du hast gar keine Lust mehr auf diesen Job. Du überlegst dir was anderes zu machen, was komplett anderes. Etwas, was dich wieder richtig fordert, wo die intrinsische Motivation der Haupttreiber ist und du Spaß dran hast. Doch irgendwie denkst du, puh, jetzt noch, in meinem Alter, einen anderen Beruf ausüben, alles nochmal neu lernen? Was passiert hier eigentlich? Es könnte gut sein, dass du gerade über einen Quereinstieg in ein anderes Berufsfeld nachdenkst. Und genau das hat Melanie Patrick gemacht. Nach 11 Jahren als Executive Assistant in einer international tätigen Unternehmensberatung ist sie in die Softwareentwicklung gewechselt. Und genau darüber sprechen wir mit Melanie. Wie hat sie das gemacht? Was war ihr Haupttreiber? Welche Herausforderungen hat sie währenddessen gemeistert? Wie hat das persönliche Umfeld reagiert? So wie, ob es eine gute Entscheidung war und was sie anderen Leuten empfehlen würde. Und los geht's! Viel Spaß! In diesem Podcast beschäftigen wir uns immer mal wieder über die Themen Bildung, Ausbildung, wie kommt man eigentlich in diesen Job, Beispiele sind, braucht man einen Doktortitel, um Informatiker zu werden.",
            "start": 4014,
            "end": 73336,
            "confidence": 0.8065072463768114,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Natürlich, unbedingt, ich bin immer der Meinung.",
            "start": 73356,
            "end": 75318,
            "confidence": 0.43914285714285717,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oder reicht es, ein Studienabbrecher zu sein, wie der Wolfgang oder Wolfgangs Professor immer sagt, nämlich nur einen Bachelor-Titel zu haben. Oder einfach nur eine klassische IT-Ausbildung. Aber wir haben einen ganz großen Punkt bisher außen vor gelassen, nicht absichtlich, sondern weil es sich irgendwie noch nie ergeben hat. Und zwar ist das der berühmt-berüchtigte Quereinstieg in die Softwareentwicklung, indem man einfach mal nicht den klassischen Werdegang geht. Und Wolfgang und ich sind diesen Weg nie gegangen. Wir haben leider oder halt auch nicht leider, ich weiß es nicht, eine mehr oder weniger klassische Ausbildung für die Softwareentwicklung, wenn man denn von Softwareentwicklung sprechen kann, was der Wolfgang da vermurkst. Aber wir wollten das Thema trotzdem mal beackern und deswegen haben wir uns heute mal einen Gast mit ins Studio geholt. Hallo Melanie. Hi. Melanie, wer bist du? Du hast deine Wurzeln in München und lebst jetzt im viel schöneren NRW.",
            "start": 75808,
            "end": 134058,
            "confidence": 0.8487814569536424,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Veto, aber egal.",
            "start": 134098,
            "end": 135779,
            "confidence": 0.7383333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hast keine klassische Ausbildung im Bereich Softwareentwicklung, sondern hast die ersten elf Jahre deiner beruflichen Laufbahn zum Teil bei den Big Four, bei den vier größten Wirtschaftsprüfungsgesellschaften oder auch bei den Big Three, bei einer der drei größten Strategieberatungsunternehmen. absolviert kann man sagen und zwar einmal bei KPMG und einmal bei der Boston Consulting Group. Dort warst du im Bereich der Assistenz und der Teamassistenz tätig. Seit Mitte 2012, also knapp elf Jahre, bist du als PHP-Entwicklerin tätig. Das bedeutet natürlich auch, wenn man mit 1 und 1 zusammenzählt, hast du jetzt nicht mit Anfang 20 den Quereinstieg gemacht. Du hältst aber inzwischen sogar Vorträge auf IT-Konferenzen, unter anderem mit einem sehr schönen Thema, wie ich finde, How to Unfuck Git. Ich glaube, jeder Softwareentwickler kämpft zumindest einmal in der Woche mit Git. Und um dich zu entspannen, häkelst du gerne. Ist das richtig?",
            "start": 135819,
            "end": 195372,
            "confidence": 0.8057241379310349,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich häkle und ich stricke total gerne. Und tatsächlich seit der Pandemie stricke ich auch während Videokonferenzen, weil es mir total hilft, zuzuhören.",
            "start": 195652,
            "end": 204599,
            "confidence": 0.8276666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was war das längste Häkel- oder Strickprojekt?",
            "start": 205427,
            "end": 208528,
            "confidence": 0.9257142857142858,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das längste... Was am längsten gedauert hat oder was am größten geworden ist?",
            "start": 208568,
            "end": 214009,
            "confidence": 0.9013076923076924,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ist das nicht dasselbe?",
            "start": 214029,
            "end": 215069,
            "confidence": 0.9065000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein.",
            "start": 215149,
            "end": 217150,
            "confidence": 0.766,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Dann gerne, was am längsten gedauert hat, weil der zeitliche Aspekt spielt bei mir schon so eine Rolle, wie viel Motivation man hat, da immer und immer und wie immer wieder dran zu gehen, um das endlich mal fertig zu machen.",
            "start": 217190,
            "end": 227012,
            "confidence": 0.8567804878048784,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, an einer Jacke habe ich dreiviertel Jahr lang gestrickt.",
            "start": 227272,
            "end": 231953,
            "confidence": 0.848,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Er ist immer noch schneller als die meisten Side Projects von Andi.",
            "start": 232771,
            "end": 235429,
            "confidence": 0.6898333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber neben dem Side Project hab ich ja noch andere Side Projects.",
            "start": 236050,
            "end": 240452,
            "confidence": 0.7973076923076922,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Hast du mehrere Häkel- und Strickprojekte auf einmal?",
            "start": 240492,
            "end": 242953,
            "confidence": 0.4452500000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist in der Häkel- und Strickwelt so. Also, Socken zählen gar nicht als eigenes Projekt. Die laufen eh immer so nebenher. Und dann hat man immer so ein einfaches Projekt, was halt so für Videokonferenzen oder als TV-Meeting bezeichnet wird. Also, was man halt so gut beim Fernsehschauen machen kann. Und dann hat man halt immer noch so was Komplexes. Also, mit zwei verschiedenen Farben oder drei. oder irgendwie ein kompliziertes Lochmuster oder irgendwas, wo man halt so ein bisschen Grips für braucht.",
            "start": 242993,
            "end": 269583,
            "confidence": 0.806658823529412,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich find's jetzt schon geil. TV-Knitting. Den muss ich mir mal, weiß nicht, auf die Füße holen.",
            "start": 269623,
            "end": 274426,
            "confidence": 0.576294117647059,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das hättest du dir erst angewöhnen, Andi, dass du mal was Sinnvolles produzierst, währenddessen du da nur rumsitzt. Aber Projekt ist schon ein super Thema. Ich frage ja in Interviews ganz gern diese Frage, was war dein coolstes Projekt, was du jemals gemacht hast, so um rauszufinden, wo die Person brennt. Jetzt wäre ja meine Frage, wenn ich dich diese Frage stellen würde, was war dein coolstes Projekt? War das vor deinem Quereinstieg oder nach deinem Quereinstieg in die IT?",
            "start": 274446,
            "end": 301300,
            "confidence": 0.7950493827160492,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich würd sagen, tatsächlich war das coolste Projekt, was ich gemacht habe, das war letztes Jahr. Da hab ich bei Trivago das komplette Rechtemanagement aufgeräumt und hab halt in der Datenbank über 1.000 Rechte gelöscht und auch alles an PHP-Uralt-Code und so weiter gelöscht. Also, das hat schon sehr, sehr viel Spaß gemacht, da einfach knallhart Tabula Rasa zu machen und dann auch Stellenweise ging es halt nicht anders zu entwickeln, gucken, wer zuerst schreit. Manchmal ging das halt nicht anders. Aber es haben tatsächlich erstaunlich wenig Leute geschrien. Von daher, das hat echt Spaß gemacht, da mal so richtig durchzuräumen.",
            "start": 302000,
            "end": 345164,
            "confidence": 0.8723762376237624,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin ja froh, dass du jetzt ein Projekt genannt hast, was nach dem Umstieg passiert ist. Aber dann erledigt sich die Frage, ob sich der Umstieg rendiert hat und ob das ein positiver Umstieg war. Dann können wir uns die Frage auf jeden Fall sparen.",
            "start": 346312,
            "end": 359585,
            "confidence": 0.7929782608695654,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, kann ich auf jeden Fall mit Ja beantworten.",
            "start": 360085,
            "end": 362748,
            "confidence": 0.7503333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie lange bist du jetzt eigentlich in der IT, in der ganzen digitalen Welt?",
            "start": 362768,
            "end": 366171,
            "confidence": 0.8290714285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich bin seit zehneinhalb Jahren bei Trivago, davor war ich ein Jahr bei Soprano bzw. Preis24 und davor habe ich ein Jahr Webdesign und Development studiert.",
            "start": 366686,
            "end": 378586,
            "confidence": 0.8309259259259257,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wo hast du denn studiert?",
            "start": 378626,
            "end": 379388,
            "confidence": 0.5674,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das habe ich in München an der SAE studiert. Und zwar der eigentliche Beweggrund war ja mehr oder weniger, dass ich nach elf Jahren Assistenz bei der gleichen Firma, bei BCG, hatte ich halt irgendwie so den Papp auf und dachte, ich brauche endlich mal ein bisschen Abwechslung, ich brauche ein bisschen was für den Kopf. Ich hatte so das Gefühl, ich lerne nichts mehr wirklich Neues dazu. Ich kann den Job ja jetzt eigentlich. Es kommen ein paar technische Änderungen oder so, Es ändert sich ja fundamental nix Neues an dem Job. Ich lern nix Neues. Und ich brauchte einfach was, ja, wo ich wieder was Neues lernen kann. Ich hatte vorher schon so, ja, Wochenendkurse bei der VHS gemacht. Da hab ich mir dann Dreamweaver und Illustrator und diese ganzen Adobe-Tools angetan, jeweils wochenendelang. Ich hab festgestellt, dass Dreamweaver ganz schrecklich ist, obwohl ich noch gar keine Ahnung davon hatte. Ja, und dann habe ich eigentlich mehr oder weniger nach einer Variante gesucht, ein Sabbatical zu machen, wo ich ein Jahr lang mal was komplett anderes mache. Und das war eigentlich die ursprüngliche Idee von dem Ganzen, war ja nur ein Sabbatical machen. Die Idee war ja gar nicht, die Berufssparte zu wechseln. Die Idee war, ich mache das ein Jahr und danach suche ich mir wieder einen Job in einer anderen Firma als Sekretärin.",
            "start": 380059,
            "end": 456112,
            "confidence": 0.8080660792951544,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also die Dreamweaver-Geschichten, die waren dann aber parallel zum Job.",
            "start": 456500,
            "end": 460041,
            "confidence": 0.7263,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die waren noch parallel zum Job. Das war halt noch so nebenbei. Ich habe ja damals auch fotografiert. Ich hatte damals einen Kochblog, den ich regelmäßig geschrieben habe und wollte halt da einfach so in diese kreative, multimediale Welt so ein bisschen mehr einsteigen, meinen Kochblog ein bisschen mehr aufbohren. Und da kam die Idee eigentlich her, mit diesem Webdesign- und Developmentstudium. Und eigentlich war meine Idee ja mehr, oder mein Fokus am Anfang war ja viel mehr auf dem Design-Element. Also ich hab da in dem, das Schöne an der SRE, die, das ist ja School of Audio Engineering eigentlich. Das heißt, du hast am Anfang auch einen Block mit Tontechnik. Du hast Filmtechnik, du hast Fotografie, du hast 3D-Animation am Anfang. Gehst halt erst mal durch alle Felder des Multimedia, bevor du dann in die Programmierung einsteigst. Das war schon so ein ganz cooler Querschnitt eigentlich. Und deswegen hat mich das erst mal viel mehr interessiert.",
            "start": 460081,
            "end": 520870,
            "confidence": 0.8363227848101259,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Dieses SAE-Studium. Gib uns mal ganz kurz bitte einen Überblick darüber. Also ich meine, ist das kostenfrei? Ist das kostenpflichtig? Geht ein Jahr? Was für Voraussetzungen muss man dafür haben? Muss man dafür Abitur haben oder nur Berufserfahrung? Was war damals so der Stand der Dinge, um an diesem Studium teilzuhaben?",
            "start": 520890,
            "end": 540701,
            "confidence": 0.8063529411764705,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, das Setting war damals ... Also, das hat definitiv gekostet. Das hat auch echt nicht wenig gekostet. Dafür warst du mit einem Jahr sozusagen fertig und hattest einen Abschluss der Uni Essex und hattest da ein Diploma. Also, noch nicht mal einen Bachelor, sondern eins drunter. Aber immerhin, du hast nach einem Jahr einen Abschluss. Es hat was gekostet, aber ich hatte einige Kommilitonen, Arbeitsamt die Förderung bekommen bzw. den Berufsumstieg bezahlt bekommen dadurch. Und dann, wie gesagt, das Schöne war halt, dass das einfach nach einem Jahr abgeschlossen ist. Man hätte da auch noch den Bachelor draufsetzen können. Voraussetzungen waren ja ein abgeschlossenes Abitur oder eine abgeschlossene Berufsausbildung und natürlich halt ein gewisses technisches Verständnis, was du halt mitbringen musst. Aber die Anforderungen da waren jetzt nicht so hoch, aber ich meine die Schwelle war halt tatsächlich das Geld aufbringen oder sich mit dem Arbeitsamt herumschlagen.",
            "start": 541022,
            "end": 603933,
            "confidence": 0.8302297297297294,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie bist du denn eigentlich zu BCG gekommen? Bist du da direkt nach dem Abitur oder?",
            "start": 603953,
            "end": 607637,
            "confidence": 0.7134375,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nach dem Abitur habe ich eine Ausbildung zur Europasekretärin in Würzburg gemacht. Also Europasekretärin bedeutet Fremdsprachensekretärin, aber mit drei Fremdsprachen. Also ich spreche noch Englisch, Französisch und Spanisch. Dazu noch Wirtschaftswissen und wirtschaftliche Korrespondenz auf Englisch und Französisch. Also es war schon Auch knackig die zwei Jahre. Danach habe ich ja bei KPMG gearbeitet, das war aber nicht ganz so mein Fall und dann habe ich mich einfach beworben und bin bei BCG gelandet und da hat es mir halt dann auch echt gut gefallen und hat von den Leuten ganz gut gepasst und dann bin ich da ja elf Jahre letztendlich geblieben.",
            "start": 608723,
            "end": 647885,
            "confidence": 0.8491359223300974,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und du hast erwähnt, mit dem Sabbatical, hast du dann ein Sabbatical bekommen oder war das nur so die Idee? Gab es damals überhaupt schon Sabbaticals? Heutzutage sind die ja doch wesentlich beliebter und akzeptierter, würde ich mal sagen, als damals.",
            "start": 648584,
            "end": 661860,
            "confidence": 0.7758780487804879,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Den Begriff gab es schon und den gab es da auch für die Berater, diese Dieses Setting, dass man da eine Zeit lang vorher sich Geld zurücklegen lässt und sich dann nachträglich auszahlen lässt, ich habe tatsächlich gekündigt und meinen Pensionfonds, den meine Firma damals für mich angespart hat, dafür verwendet.",
            "start": 661900,
            "end": 683654,
            "confidence": 0.8783725490196078,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also du hast quasi reinvestiert dann.",
            "start": 684074,
            "end": 685955,
            "confidence": 0.43216666666666664,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja.",
            "start": 685995,
            "end": 686195,
            "confidence": 0.548,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber du hättest auch gar kein Sabbatical machen können, also klassische Zweiklassengesellschaft.",
            "start": 686215,
            "end": 690757,
            "confidence": 0.7073333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das war noch sehr Zweiklassengesellschaft damals. Ich weiß gar nicht, wie das heutzutage wirklich dort ist.",
            "start": 690777,
            "end": 696619,
            "confidence": 0.7312352941176471,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und kannst du mal ganz kurz einen Abriss geben, was das eigentlich heißt, Assistenz, Teamassistenz? Also, welche Aufgaben fallen da rein? Weil ich hab so das Gefühl, das ist dann so wie, ja, vielleicht auch wie DevOps, ja? Oder dass andere Leute und andere Firmen Assistenz anders definieren.",
            "start": 697218,
            "end": 716051,
            "confidence": 0.8396041666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Klar, hängt das natürlich immer zwischen dir und deinem Chef oder deiner Chefin ab, was jeweils der eine oder der andere macht oder selber macht. Aber letztendlich war es so, ich hatte vier Chefs, zwei Teamleiter, zwei Manager. Das heißt, ich habe für die die Outlook-Inboxen gemanagt, ich habe deren Kalender gemanagt, ich habe deren komplette Reisen gemanagt, also Flüge buchen, Hotel buchen, Taxi dazu buchen oder andere Transfers, immer gucken, dass der Mensch von A nach B kommt, gucken, dass ja Unterlagen dabei sind, Korrektur lesen viel, was weiß ich, solche Business Cases zusammenschreiben, viele PowerPoint-Präsentationen erstellen, also du kriegst dann Vorlagen zugeschickt und machst aus dem Handschriftlichen dann eine schicke PowerPoint-Präsentation, die dann jemand anders präsentieren kann. Sehr Wie soll ich sagen, sehr oft sehr stressig, weil dann halt immer irgendwer ankommt um pünktlich 17.30 Uhr, wenn du Feierabend machen willst. Du, wir brauchen aber für morgen um neun noch eine Vorstandspräsentation. Da haben wir aber noch keine Vorlagen erstellt. Kannst du vielleicht länger bleiben? Also das war so ein Standardsatz, würde ich mal sagen. Und ja, viel halt auch so Sachen wie, der eine Chef ruft an, ja, ich bin gerade in Santiago de Chile unterwegs und ich habe mein Portemonnaie im Taxi vergessen. Kannst du irgendwie versuchen, das wiederzubringen? Oder solche Sachen. Du machst dann alles. Events organisieren, Team-Events organisieren. Ich hab auch dieses Strategy-School-Event mitorganisiert. Ein paar Jahre lang. Also, querbeet sehr viel dabei. Sehr, sehr viel halt auf Zuruf. Das heißt, man hat unter Umständen dann auch sehr viel Leerlauf. Hat aber unter Umständen dann auch das Telefon, das alle drei Sekunden klingelt und du gar nicht mehr weißt, wo dir der Kopf steht.",
            "start": 716411,
            "end": 841145,
            "confidence": 0.8345000000000004,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also so, wie man es genau in den Filmen immer sieht. Diese Leute, die alleine nicht mehr lebensfähig sind, sondern nur mehr über ihre Assistenz in irgendeiner Form von Anarchie kommen.",
            "start": 841806,
            "end": 851228,
            "confidence": 0.8177741935483871,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Manchmal schon echt kommt man sich ein bisschen wie Kindergärtnerin vor, ja.",
            "start": 851268,
            "end": 858589,
            "confidence": 0.8098333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es ist immer erstaunlich, wie viele Jobs so ähnlich zu Kindergarten sind oder Kindergärtner. Also vielleicht sind wir das eh alle ein bisschen.",
            "start": 858649,
            "end": 865491,
            "confidence": 0.8016521739130434,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wahrscheinlich schon.",
            "start": 865531,
            "end": 866111,
            "confidence": 0.8075,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe mich gerade eher gefragt, aber gearbeitet haben die Leute schon noch selbst, oder?",
            "start": 866675,
            "end": 870136,
            "confidence": 0.6183333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Leute haben tatsächlich selbst gearbeitet, die haben auch selbst viel gearbeitet. Also deren Arbeitsmodell war ja Montagmorgen irgendwo losfliegen, irgendwo anders hin und dann Donnerstagabend wieder zurückkommen, vielleicht am Freitag im Büro arbeiten. Und diese ganze Reiserei und die ganzen vier Tage sind ja vielleicht nicht zwingend an einem Ort gewesen. Die musste ja auch alles mit organisiert werden.",
            "start": 870156,
            "end": 895081,
            "confidence": 0.8542000000000002,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die die die story mit dem geldbeutel im taxi vergessen es hört sich so ein bisschen an so wie remote debugging ja irgendwie meine großmutter ruft mich an ich hab hier ein problem und du du hängst am hörer und versuchst das problem irgendwie zu lösen um einfach was einfach keine informationen du bist halt nicht.",
            "start": 895849,
            "end": 910900,
            "confidence": 0.7450178571428573,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vor ort, Es ist exakt das gleiche. Tatsächlich ist das Gefühl und die Herangehensweise genau die gleiche, weil du bist erstmal komplett planlos, du hast keine Ahnung, was du jetzt tun sollst und dann fängst du an zu überlegen, ja welches Taxiunternehmen habe ich denn gebucht, ja dann versuche ich da mal anzurufen. Reiche ich da überhaupt wen? Ja, welche Taxi-Nummer bist du eigentlich unterwegs gewesen? Hast du deinen Beleg noch? Belege haben die sich natürlich alle geben lassen, weil es werden ja auch Parkgebühren von 50 Cent abgerechnet. Und dann fängst du halt an, dir so Stückchen für Stückchen die Informationen zusammenzusuchen, um dann zu gucken, ob du irgendwie an diesen Taxifahrer drankommst.",
            "start": 910940,
            "end": 954754,
            "confidence": 0.790166666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also, wenn ich schon so frage, aber gearbeitet haben die Menschen schon noch selbst. Und du hast das da ja bestätigt, dass die konstant gearbeitet haben. Da muss ich vielleicht auch ganz einfach zugeben, die spielen einfach in anderen Ligen als ich. Und vielleicht ist das dann auch gut und notwendig, das kannst du besser beurteilen als ich, dass man dann jemanden hat, der die E-Mail-Inbox managt. Das muss ich zugeben, hört sich für mich ein bisschen fremd an. Aber nun gut, so ist das. Aber das ist auf jeden Fall nicht das Thema, die Assistenz. Und jetzt sagtest du grade, du wolltest ein bisschen mehr für den Kopf. Du hast mir grad die Story erzählt, du hast keine Ahnung, wie man ein verlorenes Portemonnaie aus einem südamerikanischen Taxi herkriegt. Also, sorry, das wär für mich so ... Ja, das ist mal eine Kopfaufgabe. Und jetzt sagst du, du bist in ein einjähriges Studium gegangen, wo es erst mal mit Audioengineering anfängt. Also, wie off kann man sein? Wie weit entfernt geht das hier?",
            "start": 955618,
            "end": 1010741,
            "confidence": 0.7617643678160921,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also tatsächlich nach elf Jahren hast du ja solche Situationen ständig wieder gehabt. Das war ja nicht das erste Mal, dass ein persönlicher Gegenstand im Taxi vergessen worden ist. Das ist nicht das erste Mal gewesen, dass ich dreimal am Tag eine Reise umgebucht habe. dass die am Ende des Tages wieder genauso ausgeschaut hat. Das ist nicht das erste Mal gewesen, dass, was weiß ich, der Flieger nicht geflogen ist und man irgendwas umbuchen muss. Klar, die Situation ist immer irgendwie ein bisschen anders, aber das Grundsätzliche war nicht mehr neu für mich. Und deswegen hatte ich nicht mehr das Gefühl, jetzt tatsächlich noch irgendwas fundamental Neues für diesen Beruf zu lernen.",
            "start": 1011331,
            "end": 1053486,
            "confidence": 0.8623157894736841,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jetzt hattest du gesagt, dass das Studium ging ein Jahr. Was für ein Zeitmodell war das? War das wirklich 40 Stunden die Woche oder war das Abendstudium oder wie kann ich mir das vorstellen?",
            "start": 1054467,
            "end": 1063357,
            "confidence": 0.7515882352941174,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also das war tatsächlich als Vollzeitmodell gedacht. Du hattest am Tag zwei bis drei Stunden Vorlesung. Ich hatte für mich sehr angenehm den Slot am Nachmittag, also so von, ich glaube, zwei bis vier oder zwei bis fünf. Das heißt, du konntest halt dann, dann war sehr viel selber machen auch gefragt. Also selber habe ich dann halt auch meine Mitschriebe aufgearbeitet. Es gab dann natürlich dann auch Hausarbeiten zu machen, die teilweise sehr komplex und umfangreich waren. Da warst du schon Vollzeit beschäftigt. Also das wäre auf keinen Fall gegangen, das noch irgendwie nebenbei zu wuppen. Das glaube ich nicht. Also für mich wäre es auf keinen Fall möglich gewesen.",
            "start": 1063726,
            "end": 1104513,
            "confidence": 0.831162162162162,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und jetzt hatten wir gerade schon gesagt, du hast elf Jahre Berufserfahrung gehabt, als du mit diesem Studium begonnen hast. Das bedeutet ganz offiziell warst du keine 20 mehr. Und was mir dann direkt in den Sinn kommt, ist, man steht ja da mitten im Leben. Und dann gehst du ein Jahr eigentlich wieder zur Schule. Die Finanzierung fand durch einen Pension-Plan statt, die die vorherigen elf Jahre angespart wurde.",
            "start": 1104553,
            "end": 1130684,
            "confidence": 0.7602714285714286,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, ich hab komplett von meinem Ersparten gelebt. Also, das Geld war jetzt nicht so das Problem. Also, klar hab ich jetzt nicht ... meine komplette Rentenvorsorge auf einmal rausgehauen. Also ich hab mir schon hier und da was gegönnt, aber ich hab jetzt nicht das Geld rausgehauen. Aber ich musste mir jetzt auch nicht ständig irgendwie Gedanken machen, wovon lebe ich jetzt? Also das war schon durchdacht von vornherein.",
            "start": 1131284,
            "end": 1155951,
            "confidence": 0.8331857142857143,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber das war immer nur zu dem Zeitpunkt, du wolltest das nur zwischendrin machen, oder?",
            "start": 1155991,
            "end": 1160072,
            "confidence": 0.8382666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich wollte das nur zwischendrin machen. Das war wirklich bis ... Bis ich tatsächlich ganz zum Schluss Best of Class abgeschnitten habe und wirklich ein Kommiliton zu mir gesagt hat, wie du willst in deinen alten Job zurück, bist du verrückt, kam mir dieser Gedanke überhaupt gar nicht. Also das war wirklich für mich so, ja, ja, ich gehe dann eh wieder in meinen Safe Space, in mein Sekretärinnen-Dasein zurück. Ich suche mir halt einen Job in einer anderen Firma. In München gibt es ja mehr als genug. Und der Gedanke vorher kam mir nie, wirklich einen Job als Entwicklerin zu suchen.",
            "start": 1160092,
            "end": 1198977,
            "confidence": 0.8196372549019606,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wann war dann dieser Kipppunkt? War das wirklich, dass dich jemand angesprochen hat? Und war das am Ende dann vom Studium?",
            "start": 1199197,
            "end": 1205218,
            "confidence": 0.8285238095238096,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war dann am Ende, also wirklich Abschlussphase. Also, es war so während der Abschlussarbeit. Also, für die Abschlussarbeit haben wir tatsächlich eine Webseite gemacht. Also, ich hab halt einen Blog gemacht, erstellt, mit Admin-Bereich und allem. Dazu musste man tatsächlich noch ein Werbevideo drehen, das war ganz lustig. Und ja, während dieses ... dieser Endphase, wo wir halt dann auch sehr, sehr viel Zeit zusammen verbracht haben und uns gegenseitig geholfen haben mit, ja, Programmierproblemen oder was weiß ich, so ein Video kannst du ja nicht alleine aufnehmen im Tonstudio und solche Sachen, du brauchst ja immer wen dazu. Da kam das eher, kristallisierte sich das so raus, so, ja, du bist doch gut und so. Und als ich dann wirklich rausstellte, dass ich dann ich glaube, mit 98 Prozent abgeschlossen habe, dieses Studium, war dann so klar, hey, bist du völlig verrückt, in diesen alten Job zurückzugehen? Such dir doch gefälligst was in der Entwicklung. Und tatsächlich, der Sebi sagte dann, hey, ich habe ein Vorstellungsgespräch geführt. Für mich ist das überhaupt nichts, aber ich glaube, die Firma ist genau dein Ding. Und übrigens, nächsten Dienstag hast du da einen Termin. Und das war dann mein erster Job.",
            "start": 1205238,
            "end": 1279783,
            "confidence": 0.7894399999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Glaubst du, dass du das ohne Trigger oder ohne dem Sebi, dem wir ja danken müssen in dem Fall, glaubst du, dass du dann früher oder später trotzdem irgendwie in diese Richtung gerutscht wärst? Oder braucht man auch von außen irgendwie diesen Trigger, diesen Zuruf?",
            "start": 1281595,
            "end": 1296664,
            "confidence": 0.7874222222222221,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du brauchst auf jeden Fall diesen Zuruf oder dieses, wie soll ich das sagen, diese Bestätigung von außen, dass dir jemand anderes das zutraut.",
            "start": 1296704,
            "end": 1307951,
            "confidence": 0.8314583333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber hast du die Art von Bestätigung nicht während des Studiums schon bekommen, indem du gesehen hast, hey, ich bestehe die Klausuren mit einer 1,x oder 2,x Note? Ich meine, du hast ja die Projekte erfolgreich abgeschlossen und das ist ja schon auch irgendwie eine Art, ja vielleicht sogar offiziellere Bestätigung von einem Professor und Co, oder?",
            "start": 1308211,
            "end": 1325283,
            "confidence": 0.8007368421052631,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das schon, aber für mich war das Studium, ich bin das Studium ja ganz anders angegangen, für mich war das ja eher so, Ich mach das jetzt aus Hobby und klar hab ich da Ehrgeiz reingelegt, aber für mich war, wie soll ich das sagen, die Motivation für mich war nicht, dass ich da einen anderen Beruf ergreife, sondern die Motivation war für mich einfach nur, was Neues zu lernen. Und deswegen ist auch dieses Feedback von den Tutoren bei mir gar nicht so angekommen. als, hey, du bist supergut, du kannst das gut, such dir einen Job da drin, sondern, ja, macht mir halt Spaß. Also, das war dann meine innere Reaktion da drauf. Und das kam bei mir im Kopf gar nicht an, hey, du solltest dir einen Job suchen, also während des ganzen Jahres nicht.",
            "start": 1325303,
            "end": 1374802,
            "confidence": 0.8331811594202898,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich frage mich immer, wie sehen das andere Leute, die einen Quereinstieg gemacht haben wie du, denn du hast gerade gesagt, hey, das macht mir Spaß. Und ich frage mich immer wieder, wenn ich mal zwei Schritte zurückgehe vom Computer, dann frage ich mich, wie kann dieser Job überhaupt Spaß machen? Du sitzt da, programmierst acht Stunden am Tag, drückst Compile, der Computer moppert dich an, da fehlt ein Semikolon. Und du freust dich, wenn eine andere Fehlermeldung kommt. Verstehst du? Das ist irgendwie, wenn ich das jetzt so erzähle, dann frage ich mich selbst, wie kann das spaßig sein? Und obendrauf, du erschaffst ja nichts in der realen Welt. Du arbeitest ja komplett theoretisch. Du hast ja nichts später in der Hand. Da steht so ein Schreiner, der hobelt ein Brett ab und nagelt dann irgendwo dran und dann hat er einen Schrank.",
            "start": 1375568,
            "end": 1421415,
            "confidence": 0.7871805555555557,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber als Sekretärin hatte ich das ja genauso wenig. Wenn ich morgens eine Flugverbindung habe, was war das? Innsbruck, Frankfurt, London, Johannesburg und wieder zurück. Und die dreimal am Tag umgebucht habe, dann habe ich am Ende des Tages genau die gleiche Flugverbindung, nur dass sie 3.000 Euro teurer ist. Da habe ich ja am Ende des Tages auch nichts in der Hand zum Anfassen. Aber als Programmierer habe ich trotzdem das Gefühl, dass ich entweder ein Problem gelöst habe, das mich beschäftigt, oder wie gesagt, also diese Erfolgsmeldung, also dieses Erfolgsgefühl, hey, ich habe eine neue Fehlermeldung, das ist ja auch so ein bisschen wie Puzzle lösen oder wie Rätsel lösen für mich.",
            "start": 1421980,
            "end": 1467344,
            "confidence": 0.8486782608695652,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja gut, aber beim Puzzle fehlt ja immer ein Teil. Ja, das ist ja bei der Softwareentwicklung genauso. Auch wenn es so, du bist am Abend durch, möchtest das eigentlich noch abschließen und weißt eigentlich ganz genau, das Beste, was ich jetzt tun kann, ist weg vom Computer, duschen, Sport machen und morgen fällt mir die Lösung ein, habe ich die in fünf Minuten? Nein, du bleibst trotzdem sitzen und suchst irgendwie das fehlende Puzzleteil.",
            "start": 1467644,
            "end": 1488460,
            "confidence": 0.7369999999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, aber ich glaube, da kommt jetzt meine frühere Berufserfahrung zum Vorschein, wo ich dann eben schon genau weiß, nein, jetzt weiß ich genau, es ist Ende Gelände, mein Kopf hat dicht gemacht, ich muss jetzt Pause machen, ich muss jetzt Schluss machen und ich weiß ganz genau, morgen früh habe ich in 15 Minuten die Lösung, weil ich über Nacht geschlafen habe. Aber entweder ist es Berufserfahrung oder Lebenserfahrung, ich weiß es nicht. Aber das ist etwas, was ich definitiv mache, wo ich merke, ich hänge jetzt hier keine Ahnung fest und ich merke, dass ich mich gedanklich nur noch im Kreis drehe, dann weiß ich ganz genau, ich muss jetzt auf irgendeine Weise Cut machen. Und ob das jetzt draußen im Wald spazieren ist oder eine Nacht pennen oder was auch immer ist.",
            "start": 1489405,
            "end": 1534554,
            "confidence": 0.8513333333333328,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Da bist du sehr wahrscheinlich schon viel weiter als alle anderen Informatiker und Informatikerinnen.",
            "start": 1534594,
            "end": 1538777,
            "confidence": 0.7400714285714286,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn wir kurz noch mal zurückgehen zu dem Jobangebot, das du dann bekommen hast, beziehungsweise, wenn ich das richtig verstanden habe, diese Sebi hat für dich den Termin vereinbart.",
            "start": 1540141,
            "end": 1547903,
            "confidence": 0.731896551724138,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja.",
            "start": 1548324,
            "end": 1549604,
            "confidence": 0.844,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie einfach war das für dich, das zu akzeptieren im Sinne von, also nicht die Terminvereinbarung an sich, sondern zu akzeptieren, okay, ich lasse mich da jetzt auf was Neues ein oder ich gehe überhaupt hin zu diesem Interview und vielleicht, ich weiß nicht, man kann sich ja denken, ich bin da irgendwie zu schlecht, ich habe gerade die Ausbildung ausgemacht und so, kann ich da jetzt schon einfach in so ein Interview reingehen?",
            "start": 1549624,
            "end": 1568710,
            "confidence": 0.7377297297297298,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also das war schon hart für mich, das erst mal so selber für mich zu akzeptieren, so wow, jetzt bist du wirklich an einem Punkt, wo du dein Leben einmal komplett umkrempelst. Also vorher war das ja alles irgendwie so ein bisschen Spielerei und Hobby und dann gehe ich wieder zurück in meinen alten Job. Und dann war plötzlich so, okay, jetzt könnte sich dein Leben aber wirklich ändern. Das hat mir schon erstmal so Erzklopfen bereitet und ein, zwei unruhige Nächte, ganz klar. Das Gespräch selber lief dann ganz gut, klar war ich nervös, aber So genau kann ich mich da nicht mehr dran erinnern, aber ich bin ziemlich sicher, dass das Gespräch ganz gut lief. Und klar wusste ich nicht alles, aber woher soll ich auch alles wissen nach einem einjährigen Studium? Und sonst halt nie wirklich viel, klar, was mit Computern gemacht, aber jetzt nie im Computer was drin gemacht sozusagen. Und dann als ich die Zusage bekommen habe, da habe ich wirklich Herzrasen gehabt und bin ganz zittrig geworden. Witzigerweise war ich da auf meiner ersten Entwicklerkonferenz. Da war ich in Warschau auf der Frontiers und das war völlig irre, weil die Leute um mich herum haben das alle gemerkt. dass mit mir gerade irgendwas passiert. War kurz vor der Mittagspause und haben gesagt, komm, wir gehen jetzt nach draußen, was ist los? Und dann haben die mich alle umarmt und dann war ich plötzlich Teil der Familie und beglückwünscht und ich weiß nicht was. Und das war eigentlich der krasseste Moment überhaupt. Also es war nicht die Jobzusage, die mich so in dieser Welt willkommen gefühlt hat lassen, sondern tatsächlich auf dieser Konferenz sein und wirklich, da waren Speaker aus Amerika und was weiß ich nicht alles und die sind alle um mich herum gesessen und die haben mich beglückwünscht und mich in dieser Community sozusagen erst recht willkommen geheißen und das war der Moment, wo ich mir dachte, okay, hier bist du richtig.",
            "start": 1569088,
            "end": 1695654,
            "confidence": 0.8298844984802438,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie hat dein anderes Umfeld reagiert? Also du bist positiv aufgenommen worden, aber dein privates Umfeld, gerade wie du dann gekündigt hast, auch einen stabilen Job aufgegeben hast, war das okay für die Leute? Haben sie dich für verrückt erklärt?",
            "start": 1696272,
            "end": 1711018,
            "confidence": 0.7863499999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich meine, klar, die Eltern haben natürlich gesagt, du bist du wahnsinnig, einen sicheren Job aufzugeben und da hättest du ja noch, was weiß ich, bis zur Rente arbeiten können. Ja, andere Leute im engeren Umfeld haben mir vorgeworfen, ich wäre in der Midlife-Crisis und würde jetzt irgendwelche verrückten Dinge veranstalten. Als ich dann den Job als Programmiererin angefangen habe, hat dann eine ehemalige Arbeitskollegin, die dann selber auch mehr so in die Designschiene gegangen ist, ja, aber ich dachte, du wolltest was Kreatives machen. Worauf ich dann geantwortet habe, du weißt keine Ahnung, wie kreativ du im Programmieren sein musst, weil das einfach wo du ständig dir neue Lösungen ausdenken musst, wie kreativ kann man eigentlich sein? Ja, also da kamen schon von einigen Stellen auch kritische Kommentare und Gegenwind. Durchaus, ja. Aber wie soll ich sagen, ich war mir, also das Sabbatical und den Job kündigen und dass ich danach was Neues finde, das war für mich... Das war für mich nicht, das war nicht risikoreich in dem Sinn sozusagen. Was für mich dann das Risikoreiche gefühlt war, war ja dann tatsächlich in eine neue Sparte gehen und quasi als kompletter Berufsanfänger wieder von vorne anzufangen.",
            "start": 1711718,
            "end": 1787443,
            "confidence": 0.819246231155779,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und jetzt hast du erwähnt, die ist schon relativ viel positiver Wind entgegen geströmt, aber so Quereinsteiger werden ja auch ganz gern belächelt. Hattest du da irgendwie im Interview mal das Gefühl, dass da irgendwer komisch nachgefragt hat? Ich kann mich auch erinnern an meine Zeit, wenn ich dann CV bekommen habe und die irgendeine Wochenendumschulung gehabt haben und sich dann als Entwickler beworben haben. Die sind gar nicht sehr weit gekommen in unserer Pipeline, muss man dazu sagen. Aber da geht es mehr um den Wochenendkurs, also dass es einfach zu wenig ist halt vom Umstieg her. Du hattest ja eine ordentliche einjährige Ausbildung. Aber hattest du da irgendwie Gegenwind von der Richtung, von der Firmenseite?",
            "start": 1788012,
            "end": 1823683,
            "confidence": 0.7964273504273506,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also gar nicht so sehr in Bezug auf das Quereinsteigen. So mehr traue ich mir das Ganze zu, weil ich ja komplett neu in dem Ganzen bin. Also es ging weniger um das Quereinsteigen als um das, du fängst hier als Berufsanfänger in dieser kleinen Firma an und musst jetzt hier quasi alles mitmachen. Traust du dir das zu?",
            "start": 1824308,
            "end": 1846892,
            "confidence": 0.8478983050847461,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also quasi so als Abstieg, das ist ja ein Abstieg für dich.",
            "start": 1848335,
            "end": 1851939,
            "confidence": 0.6461666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, es ist ja ein Abstieg für dich und halt auch gleichzeitig, so viel weißt du ja noch nicht, traust du dir das trotzdem zu? Was ich auch verstehen kann, also hätte ich wahrscheinlich als Recruiter genauso diese Frage gestellt.",
            "start": 1852119,
            "end": 1866032,
            "confidence": 0.8130750000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "War es ein Abstieg für dich?",
            "start": 1866072,
            "end": 1867614,
            "confidence": 0.4801666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Am Anfang war es schon so ein bisschen Abstieg, weil Klar, nach elf Jahren, wenn du in der gleichen Firma bist, hast du ja so ein gewisses Standing und dann kann dir jetzt auch nicht mehr so schnell einer an den Karren fahren. Und wenn du halt dann in einer komplett neuen Firma anfängst und als der Junior, dann bist du halt dann erstmal wieder diejenige, die ständig fragen muss, hey, wie geht denn das? Und so, also das ist schon, ja, da muss man auch mit seinem Selbstbewusstsein mit klarkommen, würde ich mal sagen.",
            "start": 1867654,
            "end": 1899237,
            "confidence": 0.7926842105263159,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber ich meine, das, was du beschreibst in Bezug auf gewisses Standing und Co., das hast du ja auch, wenn du den Job wechselst, also wenn du die Firma wechselst, im selben Job.",
            "start": 1899700,
            "end": 1908646,
            "confidence": 0.7982727272727275,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, es ist ähnlich, aber noch dazu kommt halt, also wenn du aber in der gleichen Sparte wechselst, dann bringst du ja trotzdem dein ganzes Wissen mit. Und ich hatte ja ganz viel Wissen, kann aber 90 Prozent davon jetzt gar nicht mehr gebrauchen.",
            "start": 1909286,
            "end": 1923875,
            "confidence": 0.81575,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und da hebe ich meinen Finger.",
            "start": 1925238,
            "end": 1927501,
            "confidence": 0.9089999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gefühlt, gefühlt.",
            "start": 1927541,
            "end": 1929484,
            "confidence": 0.7475,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Weil wir reden hier von Team-Assistenz und du hast gerade auch sehr, sehr hektische Situationen beschrieben, am Tag dreimal irgendwelche drei, vier Flugrouten zu ändern und was weiß der Geier nicht. Ich meine, da gehört ja schon sehr viel Organisation dazu, sehr viel Zeitmanagement, Priorisierungsmanagement und so weiter und so fort. Du hast gerade gesagt, man könnte das 90% oder du hast das zumindest am Anfang zu 90% nicht gebrauchen können. Jetzt bist du 10 Jahre im Softwareentwicklungsbereich. Siehst du das immer noch so?",
            "start": 1929524,
            "end": 1960535,
            "confidence": 0.8230119047619046,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, auf gar keinen Fall. In der Zwischenzeit versuche ich genau dieses Wissen aus meiner alten Karriere genau anzubringen und den Leuten beizubringen. Ich versuche den Leuten zu sagen, hey, es ist nicht okay, 5000 ungelesene E-Mails in seiner Inbox zu haben. Für dich selber auch nicht okay, ständig irgendwelche Meetings zu verpassen, weil du halt einfach deinen Kalender nicht geregelt kriegst. Es ist nicht okay, sich in irgendeinem Minitask total zu verschanzen für zwei Wochen und dabei gehen die wichtigen Aufgaben den Bach runter. Solche Sachen versuche ich tatsächlich meinen Kollegen gerade irgendwie beizubringen. Hab auch auf der Firmeninternen Konferenz kürzlich darüber genau einen Vortrag gehalten.",
            "start": 1961108,
            "end": 2005988,
            "confidence": 0.8448504672897204,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie hieß der? How to unfuck your life?",
            "start": 2006311,
            "end": 2009574,
            "confidence": 0.45037499999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das hieß Secret Diary of an International Secretary, wo ich quasi so ganz viele Tipps und Tricks aus meinem früheren Berufsleben in das neue Berufsleben rein portiere und versuche, den Leuten beizubringen, eben genau solche Sachen nicht mehr zu machen.",
            "start": 2009634,
            "end": 2027833,
            "confidence": 0.8548999999999998,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was ist dein Lieblingstrick?",
            "start": 2027873,
            "end": 2029615,
            "confidence": 0.773,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mein Lieblingstrick ist tatsächlich nur einen einzigen Kalender für das berufliche und das private gemeinsam zu haben, weil du kannst dir einfach alles nicht merken und du weißt nicht, wie viele Leute schon in Konflikt geraten sind, weil jetzt kann ich ja doch nicht teilnehmen, weil ich habe da einen wichtigen Arzttermin oder wie kriege ich das geregelt? Also der Mensch hat nur eine Timeline und deswegen hat der Mensch auch nur einen Kalender.",
            "start": 2030179,
            "end": 2055398,
            "confidence": 0.8162297297297295,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wobei du schon voraussetzt, dass die Entwicklerin oder der Entwickler überhaupt einen Kalender hat.",
            "start": 2055965,
            "end": 2061012,
            "confidence": 0.7947857142857142,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also jeder, der ein Smartphone hat, hat auch einen Kalender, setze ich jetzt mal voraus.",
            "start": 2061072,
            "end": 2067080,
            "confidence": 0.7664375000000002,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, es scheitert ja oft daran schon, dass man einfach in den Kalender mal reinschaut.",
            "start": 2067100,
            "end": 2071146,
            "confidence": 0.6662666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, das ist aber auch sehr spannend zu sehen, wie sich auch deine Wahrnehmung in Bezug der Non-Engineering-Skills jetzt geändert hat. Aber kommen wir nochmal zum Einstieg. Du bist dann als Junior da eingestiegen und wir haben gerade über das große Wort Rückschritt gesprochen. War das auch finanziell ein Rückschritt damals?",
            "start": 2071693,
            "end": 2091927,
            "confidence": 0.8234313725490197,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bisschen, aber gar nicht mal so sehr, würde ich sagen. Also ja, ich habe im ersten Jahr bisschen weniger verdient als in meinem letzten Jahr als Sekretärin, aber jetzt nicht substanziell weniger. Das waren, keine Ahnung, 3.000, 4.000 Euro im Jahr, das war jetzt nicht so viel weniger. Und in der Zwischenzeit wäre ich im gleichen Job geblieben und Würde jetzt auch noch Vollzeit arbeiten als Entwickler, in der Zwischenzeit verdiene ich eine ganze Ecke mehr.",
            "start": 2092407,
            "end": 2123803,
            "confidence": 0.8567894736842105,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und was für Hürden oder Probleme hast du denn am Anfang gesehen? Also nehmen wir mal ein Beispiel aus meiner beruflichen Laufbahn. Ich kam aus dem Abitur, bin ins Studium gegangen und meine erste Mathe- oder Statistikvorlesung, da hat der Professor einfach mal, ich glaube, meine komplette Schulzeit innerhalb von 30 Minuten abgerattert und hat dann angefangen und ich stand erst mal wie so ein Ochse vor Berg. Und irgendwann kommst du dann halt mal mit einer großen Codebase in Berührung und auch mit Algorithmen und Co. Und dann stellst du dir die Frage, ja, ich hatte das alles mal irgendwie, aber irgendwie ist das hier alles viel komplexer. Also du wirst halt so ein bisschen von, ich sag mal, der Lehre in die Praxis geworfen, ja, und du hast auch vorhin schon Legacy-Code erwähnt. Waren das Hürden für dich, waren das Probleme für dich, als du da angefangen hast, dass das auf einmal eine deutlich größere Codebase war, als du im Studium hattest, oder dass alles deutlich komplexer war, oder warst du so, ach nö, damit habe ich gelernt umzugehen?",
            "start": 2123863,
            "end": 2181728,
            "confidence": 0.765022099447514,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Tatsächlich habe ich gelernt, mit dieser Komplexität umzugehen. Also ich fand das jetzt, das fand ich jetzt nicht, dass das irgendwie overwhelming wäre oder so. Ich meine, klar, weißt du, je größer die Firma ist, desto komplexer sind die Strukturen. Das hat mich jetzt nicht weiter überrascht. Tatsächlich aber, was für mich eine Hürde war, ist, dass ich oft das Gefühl hatte, gar nicht mitreden zu können, weil ich gar nicht weiß, was ein Sortieralgorithmus ist. Ganz ehrlich, ich hab auch noch nie im Job einen gebraucht. Aber da werden ja dann immer Witze drüber gemacht oder man muss irgendwie dann doch wissen oder wir hatten einen Kollegen, der halt permanent mit irgendwelchen wilden Fachbegriffen aus dem Informatikbereich rum sich geschmissen hat. Nicht du, Wolfgang, aber ein anderer österreichischer Kollege. Und da kam ich mir halt dann schon echt oft abgehängt vor, weil ich halt keine Ahnung hatte, wovon redet der? Muss ich das dann wissen? Aber ich hab so was ja im eigentlichen Beruf nie gebraucht. Also in der eigentlichen Programmierung habe ich es nie gebraucht. Ich muss in der eigentlichen Programmierung ja auch nicht rechnen. Ich brauche keine komplexen mathematischen Formeln. Ich brauche keine wilden Sortieralgorithmen. hab ich alles nie gebraucht. Das Problem für mich, die Hürde war, mit den Kollegen zu reden, weil die das entweder als komplettes Basics voraussetzen oder dann eben so tun, ja, aber das hätte man doch eigentlich wissen müssen als Entwickler. Oder dass du halt einfach, ja, in der Mittagspause über die Witze nicht lachen kannst, weil du halt einfach die Begrifflichkeiten nicht verstehst.",
            "start": 2182453,
            "end": 2288968,
            "confidence": 0.8595534351145041,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also du sprichst jetzt von deiner Zeit dann schon als Entwicklerin, oder? Und du bist aber am Anfang, das war ein reiner Webdesign-Job, oder?",
            "start": 2289262,
            "end": 2298544,
            "confidence": 0.7447083333333332,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, der erste Job, der war, da war ich als Frontend-Entwickler eingestellt. Und da habe ich, das war ein Send2-Projekt, da habe ich dann teilweise auch so ein bisschen im PHP mitgemacht, aber mehr, um das Frontend anzupassen, sage ich mal.",
            "start": 2298584,
            "end": 2314548,
            "confidence": 0.8291707317073175,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also du bist, du bist dann so über, das war ein Jahr oder ungefähr am Anfang.",
            "start": 2315517,
            "end": 2319701,
            "confidence": 0.72,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war ein Jahr ungefähr in der ersten Firma.",
            "start": 2319721,
            "end": 2322384,
            "confidence": 0.6775555555555556,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also, du bist innerhalb einem Jahr schon voll in den nächsten Job, in die wirkliche Entwicklerin-Rolle geschafft.",
            "start": 2323232,
            "end": 2330517,
            "confidence": 0.7950000000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja. Ich bin dann wirklich zu Trivago gewechselt, mit dem Ziel, PHP-Entwickler zu werden. Weil ich das gegen Ende bei Soprano gemacht habe. Und dann hatten wir auch nicht mehr die Kapazitäten, mir das alles beizubringen. Und du hast halt gemerkt, die Firma war einfach viel zu klein. können das nicht, dass sie halt einfach eine Person permanent mentoren und fördern, das ist klar.",
            "start": 2330537,
            "end": 2356855,
            "confidence": 0.8575156249999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also ich kann das voll und ganz nachvollziehen, wenn du jetzt denkst, ein Jahr Studium, was in einem ganz anderen Bereich war, mit Audio und Co. und dann Webdesign, dass man dann natürlich irgendwie, wenn man dann voll in die Programmierung schon geht, dass man dann natürlich extreme Probleme hat mit den Begrifflichkeiten und das ist ja immer so ein Bullshit-Bingo, muss man ja ganz ehrlich sagen, die IT-Welt und eine Welt nur von Abkürzungen und irgendwie Fachbegriffen. die teilweise gar nicht so kompliziert sind, aber man muss sich halt wissen. Aber wie bist du dem dann begegnet? Hast du da irgendwie konkret was gemacht oder hast du halt einfach probiert, so schnell wie möglich zu lernen?",
            "start": 2356875,
            "end": 2391380,
            "confidence": 0.7741709401709405,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab tatsächlich am Anfang probiert, so viel wie möglich zu lernen. Hab mir dann auch, was weiß ich, Artikel durchgelesen oder YouTube-Videos angeschaut zu dem Thema, um einfach mal so einen kurzen Abriss zu bekommen. Aber irgendwann nach ein paar Jahren hab ich mir gedacht so, Hey, das ist doch alles irgendwie auch so ein bisschen Macho-Gehabe und ich muss da gar nicht mitmachen. Und wenn ich halt einfach was nicht weiß und es wissen will, dann kann ich die Person auch fragen. Ganz oft hat sich dann nämlich herausgestellt, dass es die Person dann selber auch gar nicht erklären kann.",
            "start": 2391420,
            "end": 2425988,
            "confidence": 0.8386372549019611,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Schön, sehr schön.",
            "start": 2428771,
            "end": 2429632,
            "confidence": 0.4053333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und irgendwann hab ich mir halt dann gedacht, ich muss das alles nicht wissen, um jetzt bei diesen Gesprächen mitzuhalten. Wenn es halt jetzt, was weiß ich, in einem Meeting gehäuft wieder vorkommt, dann lass ich mir den Begriff durchaus erklären. Ich hab auch die Erfahrung gemacht in der Zwischenzeit, dass ich durchaus nicht die Einzige bin, die vielleicht mit einem Begriff nicht was anfangen kann. Kollegen aus dem Ausland, bei denen sieht das Studium vielleicht ganz anders aus, da sieht es viel praktischer aus und nicht so theoretisch, ja, die wissen das auch nicht. Also in der Zwischenzeit bin ich da einfach selbstbewusster geworden und habe gesagt, ja, dann stelle ich die Frage halt einfach, scheint ja irgendwie wichtig zu sein. Und manchmal stellt es sich als wichtig heraus und ganz oft stellt es sich aber auch nur als, ich will mit Fachbegriffen um mich schmeißen heraus.",
            "start": 2430692,
            "end": 2482188,
            "confidence": 0.8409594594594594,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also, wenn ich das jetzt so raushöre, dann sagst du ja eigentlich, dass die Größe der Firma beziehungsweise der explizite Support besonders am Anfang von der Firma essentiell ist, oder? Ja. Wie groß war die erste Firma? Wie viele Mitarbeiter?",
            "start": 2483024,
            "end": 2498661,
            "confidence": 0.830325,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Zehn. Also, ja, das war schon echt nicht groß. Es gab keinen einzigen Frontend-Entwickler. Also, ich war diejenige, die dann das Frontend-Wissen mit in die Firma gebracht hat. Und die haben mir halt einfach gezeigt, wie Git funktioniert, wie Arbeiten auf der Konsole funktioniert, wie WIM funktioniert, wie ich mit dem Zen-Framework irgendwie klarkomme, wie dieses Projekt aufgebaut ist. Ja, aber da waren halt einfach zehn Leute viel zu wenig.",
            "start": 2498721,
            "end": 2527858,
            "confidence": 0.8491857142857141,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wobei man ja, oder meine Meinung zumindest, ich glaube, der Andi sieht das ja ähnlich, dass wenn man in einer kleinen Firma beginnt, da ja durchaus extrem viel lernt, weil man halt alles machen muss und einfach für alles verantwortlich ist und nicht nur in irgendeinem kleinen Team ein Rädchen ist oder so.",
            "start": 2528425,
            "end": 2543989,
            "confidence": 0.7574905660377358,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, natürlich. Also ich habe halt direkt in meinem, ich glaube, im zweiten Monat habe ich direkt die Webseite kaputt gemacht, weil wir mit Wim gearbeitet haben und ich halt dann beim Schließen irgendwas zerschossen habe. ja. Passiert.",
            "start": 2544009,
            "end": 2561356,
            "confidence": 0.7653684210526314,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Mit wem live am Produktionsserver vermutlich, oder?",
            "start": 2561376,
            "end": 2565058,
            "confidence": 0.7894285714285714,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nicht ganz, aber fast.",
            "start": 2565098,
            "end": 2566519,
            "confidence": 0.8485,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, so lernt man.",
            "start": 2566579,
            "end": 2569980,
            "confidence": 0.48375,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja. Also, klar, ich kann ... Ich muss natürlich sagen, ich hab in dieser Firma unheimlich viel gelernt. Ich hab viel gemacht. Ich hab alles Mögliche gemacht. Und ja, es ist eine kleine Firma. Wir sind irgendwann umgezogen. Und ja, wir haben dann auch unsere Schreibtische selber zusammengeschraubt. Du machst halt dann einfach alles. Ganz klar, das hat durchaus seinen Reiz, will ich gar nicht verneinen. Aber nach einem Jahr hast du halt einfach gemerkt, okay, die haben jetzt nicht mehr die Kapazitäten und vielleicht auch nicht mehr den Bock, mir jetzt nochmal was anderes beizubringen. Die haben mich ja als Frontend-Entwickler eingestellt, die wollen jetzt nicht noch einen PHP-Entwickler haben.",
            "start": 2570040,
            "end": 2605685,
            "confidence": 0.7879369369369369,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und dann bist du konkret auf die Suche gegangen, okay, ich will jetzt mehr PHP lernen. Ich hab sein Framework schon irgendwie mitbekommen und will da einfach tiefer einsteigen.",
            "start": 2606219,
            "end": 2614986,
            "confidence": 0.7248275862068966,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 2615006,
            "end": 2615206,
            "confidence": 0.189,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also PHP hatte ich ja auch im Studium schon gelernt. Dann habe ich mich während des Studiums daran erinnert, hey, während der Schule in der neunten Klasse hatte ich, glaube ich, mal Turbo Pascal. Und dann kamen so ein paar grundlegende Konzepte, kamen dann wieder auf. Und dann habe ich bei PHP schon gemerkt, okay, das macht mir Spaß. Und ich habe mich daran erinnert, das hat mir in der neunten Klasse schon Spaß gemacht. Und irgendwie habe ich es komplett vergessen.",
            "start": 2615246,
            "end": 2642141,
            "confidence": 0.8167926829268293,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Andi, wenn wir mal Zeit haben, erklär dir, was Dubo Pascal ist und so den Jüngeren muss man das hier mal erklären.",
            "start": 2642201,
            "end": 2647963,
            "confidence": 0.6435454545454545,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Melanie, du machst jetzt seit zehn Jahren PHP. Was denkst du denn, wie viele Dollarzeichen kommen in der PHP-Dokumentation vor?",
            "start": 2647983,
            "end": 2653105,
            "confidence": 0.6979000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In der PHP-Dokumentation, keine Ahnung. Jedes Mal, wenn eine Variante, also wenn ein Code-Example ist. Aber sonst wahrscheinlich nicht viele.",
            "start": 2653586,
            "end": 2664009,
            "confidence": 0.7450499999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber was schätzt du? Der Andi fragt das jetzt natürlich nur, weil er so gescheitert ist in unserer Jubiläumsfolge, weil er so weit daneben gelegen ist mit der Schätzfrage. Drum will er dich jetzt herausfordern.",
            "start": 2664049,
            "end": 2677152,
            "confidence": 0.7913142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Keine Ahnung, ich sag jetzt mal 200.",
            "start": 2677172,
            "end": 2679335,
            "confidence": 0.5365714285714286,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also ich glaube, du bist immer noch deutlich näher dran als ich. Ich hatte irgendwie, weiß ich nicht, 50 Millionen oder irgendwie. Ich hatte echt viel.",
            "start": 2679345,
            "end": 2685486,
            "confidence": 0.6904999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es sind 60.000 oder so irgendwas in der Größenordnung.",
            "start": 2685506,
            "end": 2688667,
            "confidence": 0.5225555555555556,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, war nur ein kleiner Scherz. In der Tat, in der Episode 100 unserer Jubiläumsfolge haben wir externe Leute gebeten, uns Schätzfragen zu stellen. Und jemand kam mit dieser Frage um die Ecke. Da war ich natürlich völlig überfordert.",
            "start": 2688707,
            "end": 2700250,
            "confidence": 0.795897435897436,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber du machst immer noch php oder?",
            "start": 2701622,
            "end": 2703204,
            "confidence": 0.722857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich mache hauptsächlich immer noch php tatsächlich übrigens tippen lernen mit zehn fingern hilft ungemein. Also das ist auch etwas was man definitiv mitnehmen kann aus anderen berufen. Ja, also die Dollarzeichen und Sonderzeichen, das macht mir nix aus. Ich mach tatsächlich gerne noch PHP in der Zwischenzeit. Guck ich so ein bisschen mehr in Rust rein. Also wir haben auch ein Projekt mit Rust bei uns im Team, das wir betreuen. Aber tatsächlich muss ich sagen, es läuft so verdammt stabil, dass wir dann die Bugs beheben müssen. Deswegen guck ich da auch nicht so häufig rein.",
            "start": 2703524,
            "end": 2738467,
            "confidence": 0.8177448979591836,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Da ist der Hype-Faktor wieder. Wenn wir jetzt mal auf die ganze Zeit gucken, was würdest du sagen, würdest du anders machen mit dem, was du jetzt weißt, wenn du auf den ganzen Umstieg mal zurückblickst?",
            "start": 2738507,
            "end": 2752366,
            "confidence": 0.8115000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder würdest du überhaupt was anders machen?",
            "start": 2752386,
            "end": 2753886,
            "confidence": 0.7305714285714285,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich ... Also, von dem, was ich euch alles grade erzählt habe, würd ich gar nicht so viel anders machen. Was ich vielleicht anders machen würde, ist, also, man soll nicht auf einmal seine Beziehung, seinen Job und ... den Lebensort auf einmal wechseln und das habe ich gemacht, das war vielleicht ein bisschen hart innerhalb von einem Jahr. Ich würde nicht zu viele Komponenten auf einmal ändern, das würde ich im Nachhinein nicht mehr machen, aber gut, es hat sich einfach so ergeben mit der Beziehung, mit der neuen Beziehung hat sich halt auch der neue Lebensort ergeben, deswegen habe ich auch explizit eine Firma im Düsseldorfer Raum gesucht, die mir dann PHP beibringen können. Und bin deswegen aus München weg. Aber ja, das waren vielleicht bisschen viele Dinge auf einmal, die sich geändert haben. Aber ansonsten, dieser ganze, der Karriereweg an sich, da würde ich nix anders machen. Ich hätte mir am Anfang nur mehr Selbstvertrauen in mich selber gewünscht. sozusagen, dass ich doch mehr kann und doch mehr weiß, weil am Anfang wird einem schon so oft das Gefühl gegeben, du bist jetzt hier der Anfänger und du weißt das alles nicht, aber ja, im Endeffekt stellt man dann fest, die anderen wissen auch gar nicht so viel und ich weiß sehr, sehr viele, viele andere Dinge einfach durch elf Jahre Berufserfahrung woanders.",
            "start": 2754747,
            "end": 2836397,
            "confidence": 0.8520840707964605,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und jetzt zurückblickend auf das Ja-Studium, hat dir das geholfen, irgendwie jetzt rein technisch, von dem Wissen, was du dort gelernt hast?",
            "start": 2837109,
            "end": 2845718,
            "confidence": 0.6933181818181817,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, auf jeden Fall. Also der Multimedia-Bereich, das war gar nicht so viel. Klar, war dann viel Photoshop und Illustrator. Das bringt mir jetzt als Programmiererin nicht viel. Hat mir aber in meinem ersten Job enorm viel geholfen. Da hatte ich einen Designer bei der Kundenfirma, der hat mir halt Photoshop-Dateien geschickt. Die musste ich halt dann in Ebenen zerlegen und zerschneiden und gucken, wie ich das ins CSS eingebaut bekomme. Ja, hab ich auf jeden Fall gebraucht. Javascript, CSS, PHP hab ich alles gebraucht. Gut, Actionscript hab ich dann nicht mehr gebraucht. Actionscript hat mir aber dann geholfen, Javascript ein bisschen zu verstehen, weil da einfach ein anderer Professor war, der anders an die Sache rangegangen ist. Ich hab all das, was ich gelernt habe, in irgendeiner Form brauchen können. bisschen Audio-Engineering und bisschen 3D-Animationen mal von weggelassen, aber alle Hauptkurse habe ich alle brauchen können, ja.",
            "start": 2845738,
            "end": 2913198,
            "confidence": 0.8517837837837838,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe gerade so einen kleinen Flashback. Du hast gerade gesagt, ein Photoshop-File und dann die Ebenen slicen. Ich kann das auch noch von den runden Ecken, von den ganzen Boxen, die man damals machen musste.",
            "start": 2914527,
            "end": 2923349,
            "confidence": 0.6954444444444444,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und Tabellen mit den runden Ecken, ja.",
            "start": 2924490,
            "end": 2926450,
            "confidence": 0.744,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wie viel Action-Skript ich auch modifiziert habe wegen irgendwelchen Flash-Sachen.",
            "start": 2926490,
            "end": 2930271,
            "confidence": 0.7372727272727274,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So, jetzt hören wir aber auf, sonst droppen da alle raus, weil die ganzen jungen HörerInnen, die haben ja keine Ahnung mehr, von was wir reden.",
            "start": 2931491,
            "end": 2937413,
            "confidence": 0.6963076923076923,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hast du gesagt, du würdest gar nicht so viel anders machen, aber was denkst du denn aus deiner Erfahrung jetzt? Wer sollte denn einen solchen Umstieg oder Werdegang nicht nachahmen? Oder würdest du einfach blind empfehlen? Das ist der beste Weg. Wir brauchen ITler in Deutschland. Abfahrt.",
            "start": 2938157,
            "end": 2955568,
            "confidence": 0.7817291666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde so einen Weg jemandem nicht empfehlen, der halt gerade mit seinem Job zufrieden ist und sich nicht großartig was anderes für sich wünscht, weil den machst du damit glücklicher und wer nicht glücklicher ist, der bleibt ja auch nicht lange. Das wäre ja vergebene Liebesmüh quasi. Dem würde ich es nicht empfehlen. Ich wüsste nicht, wem ich die IT-Branche nicht empfehlen sollte. Weil, ich meine, allein aufgrund unseres, der Arbeitsweise, wir arbeiten am Computer übers Internet, es ist perfekt geeignet für Homeoffice oder Remote oder für ... für Hybrid-Setting. Das heißt, es ist super für Leute wie mich geeignet, die halt jetzt momentan Teilzeit arbeiten, weil sie ein kleines Kind haben. Dafür ist das ja perfekt geeignet. Welcher Job lässt sich denn noch besser aufteilen? weil ja vorher schon besprochen wird, wie kleinteilig die Aufgaben zerlegt werden, dass du das hin und her schieben kannst, dass du nur Teilzeit arbeitest, dass jemand anders deinen Job übernimmt. Die ganze Struktur von vornherein ist ja darauf ausgelegt, dass du ja jederzeit weg sein kannst. Welche andere Berufssparte macht sich über einen Bussfaktor Gedanken? die sich von vornherein darüber Gedanken machen kann, wer fällt aus? Wie ersetze ich den? Was mache ich denn, wenn nur eine Person dieses Wissen hat? Und deswegen ist das gerade, finde ich, für Mütter, die Teilzeit arbeiten, Perfekt, weil welche andere Berufsparte bietet dir das denn? Sonst hast du ja immer Probleme mit Übergaben. Und wie mache ich denn das? Und du kannst auch nicht Teilzeit arbeiten. Wie willst du denn als Sekretärin Teilzeit arbeiten? Du musst ja für deinen Job Chef den ganzen Tag da sein und so. Von daher, ja, ist das, finde ich, könnte ich im Moment nicht besser aufgehoben sein.",
            "start": 2955608,
            "end": 3075391,
            "confidence": 0.833361111111111,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jetzt, wenn ich mir das so anschaue, das entspricht ja alles dieser Werdegang so extrem dem Klischee, irgendwie Frau, dann Design und man braucht den Weg übers Design zu kommen, um überhaupt dann Entwicklerin zu werden, was ja auch vollkommen okay ist, dieser Werdegang an sich. Aber wenn ich mir jetzt so überlege, gibt es irgendwie eine Möglichkeit, ist natürlich jetzt eine sehr schwere Frage, aber das irgendwie zu überspringen oder schon frühzeitig irgendwie zu merken, man will vielleicht Entwicklerin werden, ohne den, ich will es jetzt nicht Umweg nennen, aber den Weg über das Design zu machen. Könntest du irgendwas feststellen, wo du sagst, okay, eigentlich war ich immer schon interessiert irgendwie an, keine Ahnung, an welcher Art des Jobs oder der Arbeit, dass Entwicklerin eigentlich ein super Job ist?",
            "start": 3076214,
            "end": 3121905,
            "confidence": 0.8106870229007629,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab's ja gerade schon erzählt, in der 9. Klasse hatte ich Turbo Pascal und ich war auch da nachmittags in so einer AG, wo wir halt dann wilde Sachen programmiert haben. Wir haben Mastermind programmiert oder wir haben hier Akkorde mit hier Herzangaben über den Lautsprecher ausgeben lassen und per Zufall dann, ja, bachartige Dinge ausgeben lassen. Wenn mir da jemand gesagt hätte, hey, bleib da mal dran, dir macht das offenbar Spaß und du kannst das ja offensichtlich, weil das war auch da, wo ich dann in dem Jahr Mathe gute Noten hatte.",
            "start": 3122252,
            "end": 3163672,
            "confidence": 0.838557894736842,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also wenn da Sebi zehn Jahre früher gekommen wäre und dir das gesagt hätte, dann hätte das funktioniert.",
            "start": 3164768,
            "end": 3172092,
            "confidence": 0.7945555555555556,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nicht nur zehn Jahre. Nein, wenn der Lehrer damals gesagt hätte, hey, dir liegt das, bleib da mal dran, das wäre, hätte, glaube ich, einen Unterschied gemacht.",
            "start": 3172132,
            "end": 3181457,
            "confidence": 0.8100740740740741,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also auch wieder der Zuspruch von außen, dass jemand das entdeckt, das Potenzial.",
            "start": 3182102,
            "end": 3187826,
            "confidence": 0.7536153846153847,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, weil das war ja auch wieder das bisschen Hobby am Nachmittag. Das war ja nix schulrelevantes oder wichtiges.",
            "start": 3187846,
            "end": 3195371,
            "confidence": 0.8412631578947368,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn ich zurückdenke an mich, bin ich genauso in die ganze IT-Welt gerutscht, auch durch viel Support von außen. Und das scheint halt irgendwie beim Schullernen in der männlichen Form einfach öfter zu passieren, automatisch.",
            "start": 3195411,
            "end": 3209941,
            "confidence": 0.827257142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gab's denn auch irgendwie was, ich sag mal, ein bisschen einschüchterndes von den Medien oder ähnliches? Weil ich mein, auch 2012 gab's schon Meta, also damals noch Facebook und Google und Microsoft und Big Tech und allem drum und dran. Und immer, wenn man jetzt von IT, ich sag mal, liest oder hört, dann ist es halt immer so, oh, die verdienen alle, weiß ich nicht, sechs, sieben, acht, neunstellig gefühlt, arbeiten alle immer nur an der Google-Suche. Also ich mein, war das vielleicht auch alles irgendwie so ein bisschen einschüchternd für dich? Oder hatte ich das einfach komplett kalt gelassen?",
            "start": 3210461,
            "end": 3243644,
            "confidence": 0.7902475247524756,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war einfach viel zu weit weg für mich. Das war so, da komme ich ja nie hin. Also was schon einschüchternd ist, ist der ganze Bewerbungsprozess, der durchaus ganz anders ist als in anderen Jobs. Weil in anderen Jobs gehst du da halt eine Stunde hin oder zwei, dann setzt du dich da vielleicht noch ein bisschen mit an den Schreibtisch und dann ist klar, ob du den Job kriegst oder nicht. Aber dieses Dieser mehrphasige Bewerbungsprozess und du musst dann halt auch noch eine Aufgabe lösen und die möglichst vielleicht noch unter Zeitdruck. Und dann hast du dann auch noch ein Bewerbungsgespräch, wo du dann auch wieder über Dinge ausgequetscht wirst, die du vielleicht dann im Job auch gar nicht brauchen kannst, weil du eine Aufzugsteuerung dir ausdenken sollst, die du aber am Ende in deinem Job ja gar nicht programmierst. Das ist schon beängstigend und, wie soll ich sagen, abschreckend.",
            "start": 3244143,
            "end": 3301496,
            "confidence": 0.8240261437908495,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Du machst ja auch öfters Interviews, meines Wissens, oder?",
            "start": 3301776,
            "end": 3304980,
            "confidence": 0.8027777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Habe ich früher gemacht, ja.",
            "start": 3305020,
            "end": 3306942,
            "confidence": 0.8764,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Hast du das anders gemacht bewusst dann?",
            "start": 3306962,
            "end": 3308724,
            "confidence": 0.6077142857142858,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe die Interviews nicht in erster Linie geführt, aber ich habe dann schon auch öfter versucht, dann das Gespräch in so eine bisschen andere Richtung zu lenken, so ein bisschen so was, hey, du hast gemerkt, dass sich die Backend-Entwickler und die Frontend-Entwickler gar nicht mehr grün sind und sich nur gegenseitig anschuldigen. Was unternimmst du dagegen? Und dann, um einfach auch mal so die Teamplayer-Seite oder die menschliche Seite in dem Ganzen rauszukehren, weil es ist ja der große Mythos, dass hier jetzt alles irgendwie Alleinkämpfer sind und jeder hier für sich vor seinem Computer hängt. Aber ... Es kristallisiert sich ja immer mehr heraus, dass wir alle teamfähig sein müssen und dass wir alle gute Kommunikatoren sein müssen, weil das Ganze sonst einfach vorne und hinten nicht funktioniert. Und ich habe schon versucht, dann einfach auch diese Dinge so ein bisschen aus den Leuten rauszukitzeln. zu gucken, was machst du denn jetzt, wenn solche Probleme auftauchen? Weil es ist ja nicht nur vorm Computer sitzen und irgendwas programmieren, sondern unser Job ist, Probleme zu lösen. Und manchmal lösen wir die mit Code, aber manchmal lösen wir die auch einfach nur, wenn wir mit Leuten reden oder Fragen stellen.",
            "start": 3308764,
            "end": 3379873,
            "confidence": 0.8322985074626863,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, definitiv. Also, das sagen wir ja auch ständig in unserem Podcast. Das ist eine der wichtigsten Fähigkeiten, glaub ich, mittlerweile, die ganze Teamfähigkeit, Kommunikation. Grade in größeren Teams wichtig.",
            "start": 3380740,
            "end": 3393189,
            "confidence": 0.7594666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber es ist doch wie immer so, die Leute, die es brauchten, denken nicht, die bräuchten es und hören deswegen unseren Podcast nicht, zumindest nicht diese Episoden, ja? Also, ich mein, weil die Leute, die es können oder wissen, dass es wichtig ist, die wenden es auch an. Also, es ist so ein bisschen so, weiß ich nicht, so eine Downspirale.",
            "start": 3393250,
            "end": 3409722,
            "confidence": 0.7243606557377051,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn du jetzt schon so Klischees erwähnt hast, dass wir alle im Keller sitzen und die Nerds und die technischen Leute da reinkommen, gibt es sonst noch irgendwie so Klischees, die du vielleicht auch im Vorhinein so hattest von der ganzen IT-Branche oder auch gehört hast, die vielleicht nicht stimmen oder vielleicht auch stimmen, ganz egal?",
            "start": 3410357,
            "end": 3426684,
            "confidence": 0.8129107142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, nee, das war's schon so. Also, dieses Klischee der ungeduschten Kellerkinder, das hält sich immer noch. Dass es alles nur Männer sind, ja, das hält sich auch immer noch. Ich hatte es dann tatsächlich auch auf Konferenzen, wo ich mich mit jemandem unterhalten habe, der gerade einen Vortrag gehalten hatte. Und ich dann angesprochen wurde, und hey, gehörst du zu dem? So, ... Nein, ich gehöre niemanden und ich halte auch gleich einen Talk. Also das ist schon, das kommt schon noch öfter vor, dass du mit anderen Programmierern unterwegs bist, dann als Frau nicht als die Programmiererin wahrgenommen wirst, sondern als die Personaltante oder Keine Ahnung die die halt irgendwie jetzt mitläuft oder sowas und du musst schon ständig irgendwie sagen ich bin die Programmiererin ich weiß wovon ihr redet das ist schon stellenweise etwas müßig ja.",
            "start": 3427276,
            "end": 3486557,
            "confidence": 0.8443669064748198,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist eine harte Nummer also ich weiß gar nicht was ich dazu sagen soll aber das ist wirklich ich hoffe das ändert sich langsam in der Industrie.",
            "start": 3487077,
            "end": 3494484,
            "confidence": 0.745107142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hoffe auch.",
            "start": 3494504,
            "end": 3495045,
            "confidence": 0.6403333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber es braucht schon allein die Lehrer und Lehrerinnen, die das ändern wollen und ändern sollen. Und das braucht natürlich viel, viel Zeit, wenn man da eben von Lehrern in Zukunft erwartet, dass sie eben die richtige Förderung machen bei den richtigen Leuten.",
            "start": 3496449,
            "end": 3509818,
            "confidence": 0.8158837209302326,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, natürlich.",
            "start": 3510093,
            "end": 3511013,
            "confidence": 0.4625,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Melanie, was würdest du denn den Leuten mit an die Hand geben, die sich jetzt nach dem Hören dieses Podcasts darüber denken, hm, ich arbeite nicht in der IT, scheint aber machbar zu sein?",
            "start": 3511033,
            "end": 3520258,
            "confidence": 0.798470588235294,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde auf alle Fälle sagen, hey, sucht euch irgendwie ein Treffen, Meetup oder irgendeine Person, mit der ihr reden könnt, damit ihr auch mal so von dem echten Leben was hört, damit ihr eine Person habt, die euch mal so ein bisschen paar Hinweise in die richtige Richtung geben kann. Hier kannst du was lernen. Hier ist eine Plattform. Hier kannst du dich bewerben. Hier sind ein paar Leute, die ich auch noch kenne. Vielleicht ist das was für dich, was einfach unfassbar hilfreich ist, jemanden zu haben, der einem an der Seite steht. Das muss ja nicht nur eine Person sein, die sagen, hey, geh mal dahin, geh mal dahin, weil ich bin da ja gefühlt mehr oder weniger nur so reingestolpert. Aber wenn jemand das mehr so mit Plan vorhat, dann ist das ja auch sinnvoll, erst mal mit jemandem zu reden, der schon in dem Job ist, da vielleicht schon ein paar Jahre länger arbeitet, und zu fragen so, wie ist denn das im echten Leben eigentlich? Wie sind denn da deine Erfahrungen? Und wie hast du denn angefangen? Und wie könnte ich jetzt sinnvollerweise hier weitermachen oder mich verändern?",
            "start": 3520538,
            "end": 3586130,
            "confidence": 0.8218144329896907,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Sehr schöner, sehr schöner Rat. Auf einem meiner letzten Meetups wurde ich angesprochen von einer jungen Dame, die jetzt ein Praktikum in irgendeiner DevOps-Erteilung in der Gegend macht. Und ihre erste Frage war, was muss ich am meisten lernen? Welchen Tipp würdest du mir jetzt geben, worauf ich mich jetzt fokussiere? Und diese Dame war auch das allererste Mal auf einem Meetup, ... ... sie hat davon irgendwie gehört oder im Internet gefunden, ... ... ist dann einfach mal draufgesprungen ... ... und fand das dann auch super relevant ... ... und war irgendwie total begeistert ... ... und war auch ein bisschen eingeschüchtert ... ... von dem Content, von diesen Themen, ... ... weil sie dachte, wow, ... ... ich habe zwar ein bisschen was verstanden, ... ... aber nicht alles. Und dann kam sie halt zu mir ... ... und hat dann halt gefragt, ... ... ob ich ihr irgendwie Tipps geben kann ... ... und allem drum und dran. Und also das, was du gerade beschrieben hast, ... ... das hat die Frau auch bewiesen, ... ... dieses, ich würde mal sagen, Engagement.",
            "start": 3586769,
            "end": 3633103,
            "confidence": 0.7529516129032255,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ... Ja, es war ja bei mir ja auch so. Ich war auf meiner ersten Konferenz, hat dann dieses Jobangebot bekommen, aber einfach, ja, ein paar Leute kennenzulernen, sich mit denen zu unterhalten, aus allen Sparten, aus allen internationalen, aus allen Ecken der Welt sozusagen. Und egal, ob das jetzt Praktikanten waren oder Speaker waren, die jetzt hier um den ganzen Globus reisen, du kannst dich da ja echt mit allen Leuten unterhalten. Und ich muss sagen, Ich glaube, es gibt auch wenige Branchen, wo die Leute alle so nahbar sind, wo du wirklich hingehen kannst und sagen, hey, ich habe mal eine Frage an dich. Und da einfach den Mut zu haben und den Leuten wirklich Fragen zu stellen, weil in den meisten Fällen, vielleicht hat jemand gerade keine Zeit oder so, Aber in den meisten Fällen wird dir jemand eine Frage beantworten oder dich zumindest irgendwo anders hin verweisen, weil ich habe, ja, es selten erlebt, dass durch die Bank die Leute alle so offen und zugänglich und nahbar sind und egal wie, was für ein Weltklasse Entwicklerruf, die Leute haben, total trotzdem, wie soll ich sagen, demütig quasi fast schon sind und selber sagen, hey, ich weiß ja selber gar nicht alles und hier frag doch mal besser den und den. Und sind dann selber Leute, die Bücher schreiben und um die Welt chatten, um Vorträge und Schulungen zu halten. Und das hat mich tatsächlich eigentlich am meisten an dem ganzen Entwicklerdasein beeindruckt. dass du einfach mit allen Leuten reden kannst und dass viele Leute unfassbar viel wissen, aber selber, ja, selber sich das gar nicht so raushängen lassen, sondern eher sagen, hey, komm, ich bin da gar nicht der Experte für, frag da mal wen anders.",
            "start": 3633143,
            "end": 3743698,
            "confidence": 0.8400240549828174,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber würdest du auch sowas wie dein Studium oder ein Bootcamp oder ähnliches zum Start empfehlen? Oder sagst du, im Nachhinein kriegt man das auch alles so hin mit YouTube und Co.?",
            "start": 3744042,
            "end": 3756068,
            "confidence": 0.8130000000000003,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde auf alle Fälle zumindest irgendwie so ein mehrwöchiges Bootcamp empfehlen, wenn nicht sogar eben sowas, wie ich so ein Studium gemacht habe. Einfach weil letztendlich in Deutschland ist doch alles irgendwie, ist es doch wichtig, irgendwas auf dem Papier stehen zu haben. Und du hast dich halt einfach mehrere Wochen genau mit einem Thema beschäftigt. Und ich glaube, das ist schon wichtig. Und das ist was anderes, als wenn du halt jetzt mal ein Wochenende hier und mal ein Wochenende da machst. Und ich vermute auch, dass es dem Arbeitgeber zeigt, hey, dir ist das schon ernster damit, weil du jetzt einfach mal ein paar Wochen Zeit investiert hast und nicht nur so ein bisschen nebenbei gemacht hast. Klar gibt es da auch bestimmt auch Gute Leute, die das so machen und die sich das selber übers Wochenende irgendwie beibringen können. Ich will gar nicht bestreiten, dass es andere Lerntypen gibt. Ich bin halt der Lerntyp. Ich brauche jemanden, der vor mir steht und mir das erklärt und den ich mit Fragen löchern kann. Wie gesagt, in Deutschland brauchst du halt alles auf Papier und mit Durchschlag. Von daher irgendeine Art von Zertifikat in der Hand zu haben, ist sicher nicht schlecht und würde ich empfehlen.",
            "start": 3756108,
            "end": 3828926,
            "confidence": 0.8225865384615388,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Melanie, vielen, vielen lieben Dank für deine Einblicke. Auch, dass du zum ersten Mal irgendwas Positives im Impostor-Syndrom siehst. Dass alle glauben, sie kennen sich nicht aus in der IT-Welt. Sonst ist es ja nur das Problem. Aber es ist auf jeden Fall ein sehr freundliches Umfeld. Und auch deinen Rat, vielleicht einfach positiv auf Leute einzuwirken. Und manchmal braucht man halt einfach den Trigger von außen. den man bekommt. Und wenn es teilweise nur ein Satz ist, ich kann mich auch erinnern, ich habe einmal den Satz bekommen, Wolfi, du solltest nichts mit Technik machen, sondern mit Menschen. Also es war schon sehr spät, aber auch der Satz hat mich sehr stark getriggert und hat mich zum Nachdenken gebracht. Also es kann wirklich eine Aussage sein, die die einem dann schon viel verändert in seinem Lebenslauf. Vielen Dank nochmal für die ganzen Einblicke und ich hoffe, dass jetzt einige, die zuhören, zumindest in die IT überlegen einzusteigen oder im Idealfall einsteigen. Und wenn es Entwicklerinnen sind, natürlich noch besser, wenn wir da die Quote auch mal in eine sinnvolle Richtung bekommen. Dann waren wir auf jeden Fall sehr erfolgreich.",
            "start": 3829252,
            "end": 3893359,
            "confidence": 0.7992000000000004,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es gibt auf jeden Fall sehr, sehr viele Firmen, die auch sehr, sehr gerne Quereinsteiger einstellen und auch mit ausbilden. Und mit ausbilden meine ich jetzt nicht die ganz klassische Ausbildung, sondern wirklich dann mit hochziehen. Vielleicht auch mal das ein oder andere Akronym erklären und nicht davor zurückschrecken, jemanden an die Hand zu nehmen. Melanie, vielen lieben Dank für diesen Exkurs. Ich habe teilweise gelacht, geweint und geschmunzelt. während dieses podcast gelacht die taxi geschichte geweint die konferenzgeschichte geschmunzelt wieso man einen solch langen flug dreimal pro tag neu bucht und 3000 euro mehr zahlt.",
            "start": 3893748,
            "end": 3934543,
            "confidence": 0.8460208333333329,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber es ist innsbruck drin vorkommen das war wichtig.",
            "start": 3934583,
            "end": 3936444,
            "confidence": 0.6234444444444445,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielen lieben Dank. Wir verlinken natürlich alle Links auch in den Shownotes. Unter anderem die Uni, wo du deine Art Studium gemacht hast. Auch wo man dich kontaktieren kann, falls die ein oder andere Person mal eine Frage hat. Oder vielleicht auch mal, wie du sagtest, einen positiven Anstoß braucht. Oder vielleicht kannst du auch der Sebi für wen anders sein.",
            "start": 3939805,
            "end": 3959933,
            "confidence": 0.8343114754098357,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hoffe doch.",
            "start": 3960133,
            "end": 3961834,
            "confidence": 0.7853333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Sparst du jetzt auf jeden Fall im Podcast, garantiert schon für viele, viele Leute.",
            "start": 3961854,
            "end": 3966516,
            "confidence": 0.5619285714285714,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielen Dank und tschüss, bis bald.",
            "start": 3966556,
            "end": 3968977,
            "confidence": 0.35866666666666663,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Danke euch. Ciao.",
            "start": 3969548,
            "end": 3969869,
            "confidence": 0.081,
            "channel": null,
            "speaker": "C"
        }
    ],
    "confidence": 0.809921162209675,
    "audio_duration": 3977.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}