{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/6fda42f1-0980-42fb-984f-1c85b67436e6/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "3ec6284f-54d5-4ff9-860f-df5deba464f0",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Irgendwann im Leben muss jeder von uns mal etwas vor einer Gruppe von Personen präsentieren. Sei es eine Abschlussarbeit, ein Ergebnis von einem Hackathon, eine Session zum Teilen des eigenen Wissens oder auch das tägliche Stand-Up. Und all diese Präsentationen haben etwas gemeinsam. Du möchtest etwas bei den Zuschauern bewirken, ein gewisses Argument oder eine Nachricht überbringen. Doch wie macht man dies eigentlich richtig? Wie fesseln wir unsere Zuhörer und schaffen richtige Emotionen? Wie verhindert man, dass alle gelangweilt am Handy spielen? Inwieweit kann sogenanntes Storytelling helfen und ab wann ist es einfach mal nicht sinnvoll? Wie lernt man Storytelling eigentlich? Und inwieweit kann die Variation meiner Stimme und meiner Körpersprache beim Präsentieren helfen? Das und noch viel viel mehr besprechen wir in dieser Episode mit unserer Expertin Anna Momba. Los geht's, viel Spaß!",
            "start": 4398,
            "end": 53067,
            "confidence": 0.8214850746268656,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi, du hast ja auch mal studiert, kann ich mich erinnern oder sowas ähnliches zumindestens gemacht. Wie hat das Studium geheißen?",
            "start": 57743,
            "end": 63125,
            "confidence": 0.7854761904761905,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wirtschaftsinformatik, Bachelor of Science im Bereich Wirtschaftsinformatik.",
            "start": 63145,
            "end": 66386,
            "confidence": 0.5734285714285715,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Habt ihr da irgendwas gelernt bezüglich Präsentieren und Kommunikation?",
            "start": 66406,
            "end": 70808,
            "confidence": 0.7942222222222223,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube es war Teil der Vorlesung wissenschaftliches Arbeiten. Aber auch nur, wie man dann seine Bachelor-Arbeit zumindest, ich glaub, nennt sich das beim Bachelor-Arbeiten, verteidigen?",
            "start": 70828,
            "end": 81312,
            "confidence": 0.7666153846153847,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, natürlich.",
            "start": 81352,
            "end": 83752,
            "confidence": 0.428,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, da wurde es so ein bisschen angesprochen. Aber ich glaub, da wurden auch eher auf die Gefahren angesprochen, anstatt wie man's denn machen sollte. Nach dem Motto, sei pünktlich und teilweise bring sogar deinen eigenen Beamer mit, so ähnlich wie damals in der Softwareausbildung.",
            "start": 83792,
            "end": 97057,
            "confidence": 0.7604000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Weil, wenn ich mich zurückerinnere, und ich habe ja sehr viel Zeit an der Uni verbracht, war eine gute Zeit, zweistellige Jahresanzahl auf jeden Fall, mindestens. Und wenn ich mich so zurückerinnere, man macht da eigentlich extrem wenig. Man konzentriert sich auf die Technik und das Einzige, was man so mitbekommt, sind Professorinnen und Professoren, die mehr schlecht als recht präsentieren da in ihren Vorlesungen. Das ist alles, was man irgendwie so mitbekommt. Man arbeitet mit Computern. Später fängt man dann irgendwie einen Job an und maximal, was man so zu tun hat mit Kommunikation, ist, dass man in einem Stand-up so herumsteht in der Früh mit einem Kaffee in der Hand, den Boden starrt und vielleicht mal erwähnt, was man so macht. Und dann wächst man irgendwie und wird vielleicht zum Senior-Entwickler oder Staff-Entwicklerin, vielleicht sogar zum Team-Lead oder Engineering-Manager. Und plötzlich betritt man irgendwie so eine Bühne, man muss da 101 halten, man muss mit Leuten kommunizieren, man steht vielleicht auf einer echten Bühne, macht da einen Vortrag, einen Talk, auf einer Konferenz, macht einen internen Knowledge-Sharing-Vortrag. Und man ist eigentlich nie vorbereitet worden auf das Ganze, wenn man da auf der Bühne steht und vielleicht sogar eine Rolle spielt dann als Leader oder Teamlead. Und genau darum wollen wir uns heute mal dieser ganzen Kommunikationsthematik widmen und wie man auftritt und wie man so mit einer Präsenz auf der Bühne umgeht und wie man die auch verbessern kann. Und wir haben da zwar schon viel gemacht, der Andi und ich, aber wir haben eine absolute Spezialistin in dem Bereich gefunden. die uns da wahrscheinlich viel, viel mehr noch beibringen kann. Und Anna, danke, dass du zu uns ins Podcaststudio gekommen bist.",
            "start": 100133,
            "end": 201011,
            "confidence": 0.8273767605633806,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hallo, ihr beiden. Das ist ja ein cooler Anfang gerade gewesen. Da waren schon, weiß ich nicht, wie viele Punkte drin, auf die ich sofort am liebsten reagiert hätte. Aber ich liebe die Formulierung. Und dann kommt man auf so eine Bühne und der nächste Teil, den du gesagt hast, war zum Beispiel 101. Perfekt. Das ist, wie ich Bühne verstehe.",
            "start": 201031,
            "end": 219975,
            "confidence": 0.7430327868852458,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du arbeitest ja relativ viel mit technischen Leuten auch zusammen, aber natürlich mit Führungskräften. Du bist Trainerin und Coach. Sagt man eigentlich Coachin? Coachin klingt eigenartig.",
            "start": 220938,
            "end": 231409,
            "confidence": 0.7391923076923076,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee, man sagt Coach. Die Coach, wenn du möchtest.",
            "start": 231429,
            "end": 235052,
            "confidence": 0.3671111111111111,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Seit über 20 Jahren auf jeden Fall. Du bist Dozentin auf der Akademie für Publizistik. Du bist ursprünglich Schauspielerin, wenn ich das richtig rausgefunden habe. Ich habe auch ein paar Webseiten gefunden, wo du als Comedian beschrieben wurdest.",
            "start": 235072,
            "end": 249103,
            "confidence": 0.7102894736842106,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das war ein Schwerpunkt, genau. Ich habe ganz viel Comedy gemacht zu der Zeit.",
            "start": 249143,
            "end": 253226,
            "confidence": 0.7824000000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und dein Schwerpunkt ist natürlich Präsentieren, Storytelling, Körpersprache, Auftrittspräsenz, nonverbale Kommunikation, also eigentlich alles, was man nicht über die Audiospur eigentlich kommunizieren kann. Darum wird es jetzt sehr spannend, wie wir das machen. Aber du bist ja auch da Profi, weil du hast einen eigenen Podcast und dein Podcast Exzellent Präsentieren hat über 100 Episoden, das heißt mehr Episoden als wir. Wir haben jetzt bald auch die 100. Episode oder gerade gehabt in dem Fall, wenn die Episode erscheint. Aber du hast immer noch einen Vorsprung.",
            "start": 254185,
            "end": 285131,
            "confidence": 0.8129069767441862,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Einen kleinen, da wir im Moment nicht produzieren, habt ihr eine gute Chance uns zu überholen. Genau.",
            "start": 285151,
            "end": 290813,
            "confidence": 0.6331764705882351,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber um noch bei dem Comedian zu bleiben, ist das eigentlich so die natürliche Strecke, die man einfach macht? Man fängt als Comedian an oder Witzeschreiberin habe ich irgendwo gesehen und man wird dann Führungskraftberaterin. Hängt das irgendwie zusammen?",
            "start": 290853,
            "end": 305840,
            "confidence": 0.8403846153846154,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist eine schöne Frage. Ich glaube, nein. Es gab auch noch so eine Zwischenstation zwischen Schauspielerin, Comedian und Coach, Beraterin. Und das war, ich war Agentin. Also ich habe, als das mal für mich als Schauspielerin und vor allem Comedian sehr gut lief, einen Agenten gehabt, der damals vor eben über 20 Jahren, wie viele andere Agenten, auch einfach ein sehr guter Anrufbeantworter war, aber von Sales keine Ahnung hatte. Der hat mich damals einfach so schlecht begleitet und so schlecht verkauft, dass ich dachte, der kann gar nicht schon lange und habe eine Agentur gegründet. Und da musste ich mich dann damit beschäftigen, okay, jetzt habe ich meine Schauspielis, wie verkaufe ich denn die am besten? Und so Schauspieler, die ja Persönlichkeiten sind, die sich schon gerne in allem wiederfinden möchten. Also es ist sehr schwer, daraus Marken zu machen. Wiedererkennbare Persönlichkeiten. Da hab ich dann eine Methode in Los Angeles kennengelernt, mit der bin ich zurückgekommen von Sam Christensen und hab das mit meinen Schauspielers gemacht. Und das war eigentlich der Anfang. Weil die zu begleiten, da drin, ihr authentisches Selbstmarketing, lange bevor es so was wie Personal Branding, Persönlichkeitsmarke und so überhaupt gab, da hab ich gemerkt, das macht mir totalen Spaß, Menschen zu helfen, entspannt sichtbar zu werden. Also so sichtbar zu werden, wie sie das selber gerne mögen und wie sie es auch selber gut vertreten können. Und da das damals gerade im Kommen war, dass man so Personal Brand auch im Unternehmen bemerkte, dass man das vielleicht brauchen könnte, bin ich halt ziemlich aufgefallen mit dem, was ich da gemacht habe. Und so bin ich nicht Schauspielerin geworden, sondern Beraterin und Coach. Das war der eigentliche Weg nicht. Und ich denke, die Comedy hat mir immer einige Begegnungen vereinfacht, weil Lachen einfach verbindet.",
            "start": 306205,
            "end": 413757,
            "confidence": 0.8021966666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hast schon das böse Wort Selbstmarketing jetzt gesagt. Gerade bei uns, es klingt immer so klischeehaft, aber bei uns Techies ist dieses Wort eigentlich nicht sehr gerne gehört, weil es ja irgendwie sowas Unnatürliches ist und auch wieder in die Richtung geht, eine Rolle zu spielen. Und man will ja eigentlich sich selbst nur spielen oder vielleicht gar nicht spielen, sondern einfach authentisch sein und vielleicht auch nur seine technischen Dinge auf die Straße bringen. Würdest du sagen, es ist was, was jeder braucht heutzutage? Muss man sich einfach damit beschäftigen oder gibt es einen positiveren Ausdruck dazu oder muss man sich einfach damit anfreunden, dass man das machen muss, wenn man es negativ sieht?",
            "start": 413817,
            "end": 448583,
            "confidence": 0.8149913793103447,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nö, man muss es gar nicht. Also ich bin absolut überzeugt davon, dass man überhaupt nichts, was mit großer Sichtbarkeit zu tun hat, machen muss, weil das einfach in jedem Fall für unsere vegetativen, schwieriges Wort in der Schnelle, vegetativen Nervensysteme, eine große herausforderung ist und wenn man das noch nicht trainiert hat wenn man da noch keinen guten umgang mit gefunden hat dann geht das ganz schön ins system und dann ist diese aufregung einfach sehr belastend und nein das muss man überhaupt nicht machen aber es hilft es hilft zum beispiel wenn man dinge umsetzen will wenn man dinge erreichen will wenn man wenn man vielleicht auf einer Mission ist, wenn man wirklich was bewegen will, dann hilft es, wenn man Menschen kennt, wenn Menschen einen kennen und wenn man dann richtig was bewegt hat, ist es auch echt nice, wenn die Leute wissen, dass man es gemacht hat und nicht irgendwelche anderen Leute sich das ans Revier heften können. Und dafür macht es Sinn, sich mit der eigenen Sichtbarkeit zu beschäftigen. Und dann ist Selbstmarketing ein kleiner Part davon. Und also es geht, du hast mehrfach jetzt schon das mit den Rollen spielen und das auch auf die funktionalen Rollen im System bezogen gesagt. Für mich ist die Formulierung sie ausfüllen viel treffender im beruflichen Kontext als es zu spielen. Und wenn ich Werkzeuge habe, mit denen ich das so machen kann, dass ich mich dabei wohlfühle, Und wenn ich dann dabei dafür sorge, dass ich mich selber und das, wofür ich stehen will, so kommuniziere, dass ich mich wohlfühle damit und jeder genau weiß, was er von mir erwarten kann, dann ist das für mich Selbstmarketing, tatsächlich. Selbstmarketing, wir verwechseln das oft mit dem, was so Chakka-Coaches selber machen. Also sich auf die Bühne stellen und sagen, ihr müsst nur, wenn ihr das macht, dann reißt alle die Arme hoch und sagt, ja, ich will, dann wird alles gut. Und das gucken wir uns an und denken, was für ein Bullshit. Weil es ist einfach Bullshit. Und deswegen total berechtigt, zu sagen, das ist übrigens Bullshit. Das ist aber überhaupt nicht Selbstmarketing. Und nur weil, also der Grund, warum wir das verwechseln, das liegt, glaube ich, darin, dass sich sichtbar machen immer mit einem Risiko verbunden ist. Und unser Gehirn, unsere Amygdala, uns da lieber in Sicherheit bringen möchte. Und deswegen erfinden wir diese klitzekleine Ausrede, dass wir Selbstmarketing eine blöde Idee finden. Und dass wir Sichtbarkeit so grenzwertig finden. Weil es ja so wie diese Chaka-Leute oder wie die Gorillas im Unternehmen, die auch nur viel Wind machen und zwar ist viel heißen Wind, ohne viel dahinter. Und dann wissen wir, die, das ist Selbstmarketing. Nee, das ist egozentrisches Verhalten. Und wir verwechseln oder wir legen dann das Wort Selbstmarketing irgendwie da drüber um uns. nicht ins Risiko zu bringen und sichtbar zu machen.",
            "start": 448863,
            "end": 602105,
            "confidence": 0.8206701461377872,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, du hast da wirklich einen Punkt getroffen, dass Selbstmarketing oft mit, ich sag mal, Wichtigtun gleichgesetzt wird. Und dann geht's natürlich auch in die Frage, können das denn nur extrovertierte Leute, ja? Also, es gibt diese Worte, extrovertiert, introvertiert. Das ist jetzt nicht gleichzusetzen mit, ich geh immer nur raus und bin der Sprecher und ich bleibe immer nur mit meinem kleinen Kinderchen allein, sondern da gehört, glaub ich, ein bisschen mehr dazu. Aber meine Frage ist eigentlich, mit dem Selbstmarketing und mit dem vielleicht mehr Kommunizieren, muss das denn immer im öffentlichen Raum passieren? Also dort, wo ganz viele Menschen sind? Weil du hattest ja zum Beispiel gerade das One-on-One auch schon als Bühne bezeichnet. Da frage ich mich, für Leute, die jetzt nicht so die Vorliebe haben, sich vor eine große Menschenmasse zu stellen oder vor mehr als fünf Leute, Kann dieses Selbstmarketing denn auch in irgendeiner Art und Weise im privaten Bereich, beziehungsweise in einem vielleicht sogar geschützteren Bereich stattfinden?",
            "start": 602145,
            "end": 657390,
            "confidence": 0.8153393939393938,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also erstmal ja, klar, auf jeden Fall. Zum Selbstmarketing gehört ganz stark, zum positiven, das ich meine, gehört ganz stark dafür zu sorgen, die Geschichte, die man sich über dich erzählt, in der Hand zu behalten. Also ganz bewusst damit umzugehen, wie du möchtest, wie Menschen dich wahrnehmen. Und das kann man im One-on-One und das kann man im One-to-Two. Und in deinem Team und beim Stand-up morgens. Und wenn ich auf die große Konferenzbühne gehe. Oder wenn ich vom Vorstand meine drei Minuten habe. Egal. Ich kann immer dafür sorgen, dass die Geschichte, die bei mir erzählt wird, dass ich die steuere. Und so meine ich das auch. Also für mich ist jedes Gespräch und jede Begegnung eine Bühne. Im Sinne von, wenn ich etwas erreichen will, macht es einen Sinn, mir vorher klarzumachen, was möchte ich denn erreichen? Für was möchte ich stehen? Für was möchte ich angefragt werden? Bei welchem Thema soll man innerhalb meines Systems, was immer das ist, meine Branche, mein Unternehmen an mich denken und dann tue ich bestimmte Maßnahmen dafür zu sorgen.",
            "start": 658731,
            "end": 717195,
            "confidence": 0.8423631284916202,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Dass das auch passiert. Du hast schon sehr gut ein Stichwort genannt für unser nächstes Thema und zwar die Geschichte, die über mich erzählt wird. Und jetzt weiß ich nicht, ob das unter anderem mit einem Comedy-Background zu tun hat, ja, weil Comedy ist ja auch immer so eine Art Geschichte, aber Geschichte und öffentliche Kommunikation und eine, ich sag mal, eine Nachricht effizient rüberzubringen, hat für mich immer mit viel Kontext zu tun und warum machen wir das und auch mit, ja, vielleicht sogar Analogien und das führt mich dann zu Storytelling. Und storytelling wird immer so als der heilige gral der öffentlichen kommunikation bezeichnet zumindest les ich das immer so.",
            "start": 717215,
            "end": 757269,
            "confidence": 0.8300803571428569,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Oder die Lösung für alles irgendwie teilweise so, mach Storytelling und alles ist irgendwie gelöst.",
            "start": 757815,
            "end": 763557,
            "confidence": 0.6762666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und ich glaube, ganz besonders wenn man öffentliche Vorträge hört, ich denke so an TED Talks und so weiter, da sieht man auch sehr viele Elemente aus dem Storytelling. Kannst du mal ganz kurz zusammenfassen, was aus deiner Sicht a Storytelling ist, wozu das eigentlich gut ist und ob da was dran ist, ob das der heilige Gral ist oder die Lösung für alles.",
            "start": 763597,
            "end": 783985,
            "confidence": 0.8347499999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also, ich glaube, die letzte Frage beantworte ich zuerst. Nee. Also manchmal ist Rechnen wichtiger als Geschichten erzählen. Kommt auf den Kontext an, wie du schon gesagt hast. Der heilige Gralis ist es bestimmt nicht, aber es ist einfach eine super Abkürzung in das Gehirn, die Gehirne meiner Gesprächspartner. Grundsätzlich. Und nicht für alles, sondern für sehr viel, aber nicht für alles. Weil unsere Gehirne sich Fakten erstens nicht so gut merken können und zweitens, wenn wir sie mit Fakten konfrontieren, sofort in die Kritik gehen. Also wenn ich Fakten liefere und Fakten liefere, dann habe ich schon mal Verhältnisse geliefert und Verhältnisse machen, dass unsere Gehirne sagen, ah, ist es jetzt mehr oder weniger, ist es jetzt kontra oder Also unsere Gehirne werden quasi aufgefordert, sich kritisch zu verhalten, wenn ich nur mit Fakten komme. Wenn ich aber überzeugen möchte, wenn ich für mich einnehmen möchte oder für eine Idee einnehmen möchte, wenn ich für etwas werben möchte, wenn ich Weiß, wenn ich die richtige Lösung weiß und einfach nur kein anderer sie bisher kapiert hat, dann ist es nicht clever mit Fakten zu kommen aus diesem eben genannten Punkt, sondern mit Geschichten. Und jetzt komme ich gleich zur ersten Frage, die gestellt ist, was genau ist das? Aber vorher noch, Geschichten machen halt automatisch in den Gehirnen unserer Gesprächspartner, dass Bilder entstehen. Es ist gar nicht möglich, dass das nicht passiert. So schwer wie es ist, die eigene Kritiklust zu unterbinden, wenn wir mit Fakten konfrontiert werden. So schwer ist es, die Bilder zu unterbinden, die entstehen, wenn mir jemand Geschichten liefert. Das ist der Grund, warum das eine hat eine Zugänglichkeit und das andere hat ein Potenzial, sich zu sperren. Ich glaube zwar nicht, dass es der heilige Graal ist, aber es ist eine verdammt gute Methode oder verdammt guter Zugang in die Gehirne meiner Gesprächspartner. Aber was ist das jetzt genau? Und jetzt wird's kompliziert. Wir sind noch nicht bei, wozu ist es ansonsten noch. Weil es ist echt sehr, sehr viel. Und unter Storytelling kann man wahnsinnig viel verstehen. Und gerade letzte Woche war ich Teil eines Story-Posiums, in dem es unter anderem darum ging, mal zu klären. Das finale Panel, was ich ein bisschen mitmoderiert habe, war dann tatsächlich auch eine gewisse Verzweiflung, da wir können das gar nicht genau. Also dann gab es irgendwann Leute, die sagten, können wir nicht einfach Deutsch Geschichte sagen? Ja, können wir. Aber wir haben uns mittlerweile irgendwie alle geeinigt, dass es Storytelling ist, wenn wir kein Märchen erzählen, sondern mit Storytelling-Elementen arbeiten, wie du schon gesagt hast. Analogien, Metaphern, starken Bildern. Oder, und das ist Storytelling für mich ganz stark, Struktur. Also genau zu wissen, ich habe die und die Zeit, ich will das und das erreichen und ich benutze Storytelling-Strukturen, welche auch immer. Ich habe da eine Präferenz, aber am Ende ist es egal, welche auch immer. Ich benutze Storytelling-Strukturen, um eine bestimmte emotionale Reaktion zu triggern. Weil ich will ja was erreichen. Und wir Menschen tun eben leider überhaupt nichts, weil wir Daten und Fakten gehört haben. sondern wir tun es, weil diese Daten und Fakten in uns eine Emotion auslösen. Und wenn sie das nicht tun, lassen sie uns im besten Fall noch kalt, im worst case provozieren sie, dass wir uns mit Widerstand dazu verhalten.",
            "start": 785392,
            "end": 974969,
            "confidence": 0.8026322463768132,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hört man ja ganz oft in unserem Bereich, ja okay, wenn da ein CTO oder CEO auf der Bühne steht, der kann da seine Story erzählen und die Leute mitreißen oder ein TED Talk, kennen wir alle die mitreißenden Storys. Und jetzt komme ich da als kleiner Entwickler oder vielleicht als Wissenschaftler an der Uni und muss da meine Forschungsergebnisse präsentieren und das sind einfach harte Fakten. Also wie komme ich dann zu dieser zu dieser story am ende weil ich will ja meine fakten rüberbringen will erklären was ist die beste software was ist die beste lösung für unser technisches problem aktuell und jetzt muss ich da irgendwie eine story erzählen also da wo wie komme ich da zum storytelling hin weil es immer einfach gesagt ich soll eine story erzählen aber welche story, Es ist.",
            "start": 976168,
            "end": 1021373,
            "confidence": 0.8210000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Auch wieder das, was ich gerade versucht habe, ein bisschen aufzumachen. Was ist denn das jetzt genau? Was ist denn jetzt? Ich soll dann eine Story benutzen. Also vielleicht bedeutet das, wenn ich morgens bei meinen Stand-Ups stehe und ich soll halt sagen, dass wir wirklich schon weit sind und dass wir es fast geschafft haben und das ist jetzt kein Weg mehr, dann ist es vielleicht einfach nur wichtig zu sagen, ein Bild dafür zu finden. Also zum Beispiel zu sagen, wir sind heute übrigens nur zum Kaffeetrinken verabredet, weil es ist schon alles in Sack und Tüten. Das ist auch eine Story. Das ist eine Story, die sich in den Köppen sofort aufmacht. Und das ist ein Beispiel. Oder auch zu sagen, wir kommen hier nicht weiter, weil wir wirklich Hilfe brauchen. Was wollt ihr dann beim Stand-Up? Wollt ihr, dass euch Leute helfen? Dass euch Leute zur Seite springen? Und dann müsst ihr vielleicht eine so große Dringlichkeit durch das Bild, das ihr ins Spiel bringt, schaffen, dass alle sagen, okay, wir lassen unseren Kram links liegen, wir sind für euch da heute. Oder die Woche, oder was immer da besprochen wird. Für wissenschaftliche Kontext ist es ein bisschen komplexer. Kommt wieder auf die Inhalte an. Also wenn es um Mathematiktheorie geht, da hatte ich vor vielen Jahren mal so eine Diskussion mit jemandem, der da auf einem sehr, sehr hohen Level diskutiert hat. Und der hatte ein Argument, was mich wirklich gegen Stories in dem Zusammenhang absolut eingenommen hat. Und das war inklusive nicht nur gegen Stories, sondern auch für vollgepackte Slides. Echt. Mir war deren Vortragsrealität nicht klar. Die ist nämlich, dass Leute hochkonzentriert bestimmten Formeln folgen müssen. Und wenn sie zwei Sekunden abgelenkt sind, was Gehirne normalerweise ständig immer mal wieder tun, brauchen sie eine Möglichkeit, wieder einsteigen zu können. Und wenn du da gerade eine Geschichte platziert hast oder der Slide weitergelaufen ist und ich die letzte gerade nicht mehr sehen kann, also den Anfang der Formel zum Beispiel, das ist blöd. Also das heißt, das ist ein super Beispiel für keine Storys, vollgepackte Slides. Alles, was ich in den meisten Fällen sagen würde, worst case, da macht es totalen Sinn. Wenn ich aber in einem sozialwissenschaftlichen Kontext zum Beispiel unterwegs bin, ist es was anderes. Wenn ich in einem naturwissenschaftlichen Kontext unterwegs bin, finde ich es auch teilweise was anderes, weil Wie mache ich es relevant? Wie sorge ich dafür, dass zum Beispiel auch Studierende verstehen, wozu bestimmte Dinge eingesetzt werden können? Da sind Storys wiederum Gold wert und vielleicht auch weniger überfrachtete Slides. Da kommt jetzt drauf an, ich habe gerade Wissenschaftler im Zusammenhang mit der Kinder-Uni hier in Hamburg begleitet und da ging es unter anderem um schwarze Löcher. Wie erklärt man 12-Jährigen, was ein schwarzes Loch ist? Wenn du auf nichts zurückgreifen kannst, nicht sicher sein kannst, dass sie wissen, also du kannst nicht sagen, es gibt Materie. Du kannst auch nicht mal sagen, wir wissen alle, es gibt Erdanziehung. Du musst das immer erst irgendwie, wir wissen alle, es gibt eine Fliehkraft. So, gehört alles da rein. Und was wir da gemacht haben, ist, wir haben tatsächlich einen Stift genommen und haben den fallen gelassen. Und haben überhaupt nicht über Slides gearbeitet, sondern durch Beweise. Und das ist eine Geschichte. Indem ich einen Stift fallen lasse und sage, warum fällt der Stift? So, zum Beispiel. Schöne Geschichte.",
            "start": 1021413,
            "end": 1198618,
            "confidence": 0.7770913884007028,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich frag mich grad, wie man von fallenden Stiften zu schwarzen Löchern kommt. Also, die Story hätt ich wirklich gern gehört. Aber nee, super. Meine nächste Frage ist eigentlich, weil du sagtest, wenn man über Fakten spricht, dann switcht das Gehirn in so einen kritischen Modus. So nach dem Motto, sind diese Fakten wahr?",
            "start": 1198838,
            "end": 1215976,
            "confidence": 0.7456851851851853,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Nicht automatisch, aber sehr leicht.",
            "start": 1216503,
            "end": 1218446,
            "confidence": 0.8748000000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Oder sehr leicht. Man triggert das so ein bisschen vielleicht sogar. Kann man denn auf der einen Seite Storytelling mit, ich sag mal, faktenbasierten Präsentationen kombinieren? Weiß ich jetzt nicht irgendwie. Wenn man Feedback gibt, dann gibt es ja diese, diese diesen mythos von dem von dem von dem feedback sandwich irgendwie weiß ich nicht ich glaube schlecht gut schlecht gut schlecht gut naja es wird immer dann so dass das gibt es keiner soll es machen und meine frage ist gibt es sowas ähnliches beim storytelling versus fakten oder wie kommen kombiniert man diese eigentlich Nee, gibt es nicht, weil.",
            "start": 1218706,
            "end": 1260388,
            "confidence": 0.7672277227722777,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Gibt zig Lösungen dafür und eine, die vielleicht so eine Hilfestellung ist, die man sich relativ einfach merken kann, ist, dass ich auf der Tonspur was anderes machen kann als auf der visuellen Spur. Das heißt, ich kann Daten und Fakten auf dem Slide zeigen und dazu die umfassende Geschichte platzieren, die die Zuhörenden in das richtige Mindset versetzt, um diese Daten und Fakten auf die richtige Weise zu deuten und vielleicht nicht kontrovers oder so. Also darüber kann ich dafür sorgen. Oder andersrum, ich kann ein emotionales Bild machen und zahlen, das ist aber nicht so einfach. Also das andere ist leichter. Und eben zahlen, Leuten zahlen, um die Ohren hauen. Wo ich es jetzt ausspreche, merke ich, das finde ich eine sehr advanced Lösung, aber die andere Lösung... Fakten und Daten zu visualisieren, am besten auch nicht in puren Zahlen, sondern in Abstraktionen, in Diagrammen, wie auch immer, und dazu dann auf der Tonspur Kontexte zu schaffen, die es mir erleichtern, diese Daten zuzuordnen.",
            "start": 1260428,
            "end": 1318949,
            "confidence": 0.8065421686746986,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, Visualisierung ist ja extrem mächtig, kann man auch sehr negativ einsetzen. Man sieht es gerade bei börsennotierten Unternehmen und so, wie die teilweise mit ihren Zahlen tricksen und wie die die Zahlen visualisieren und wie die Achsen aufgebaut sind. Da gibt es extrem viel, was man auch manipulieren kann im negativen Sinn, aber natürlich auch im positiven Sinn, um irgendwelche Informationen zu übermitteln. Und es ist ganz interessant, wir hatten gerade kürzlich in Episode 97 einen Data Scientist und der hat eben auch gemeint, Die Daten, die man so erhebt, man muss eine Story drum bauen und gerade, wenn man es dann archiviert oder für später in irgendeiner Form aufschreibt, muss man es als Story aufschreiben und nicht als Zahlenwerte, weil die Story bleibt im Kopf und später versteht man auch sehr schnell, wenn man die Story liest, wieder, um was es geht, anstatt nur irgendwelche Daten zu haben. Also er hat das auch sehr stark verknüpft eigentlich und als sehr wichtig empfunden.",
            "start": 1319612,
            "end": 1372804,
            "confidence": 0.8092181818181817,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du hast aber du hast aber auch einen sehr validen punkt angesprochen zwar ist es dass das präsentationsmedium und das merken wir jetzt gerade hier auch ich meine wir nehmen podcast auf wir haben nur die tonspur. Und durch die Tonspur ist man natürlich in einer gewissen Art und Weise, ich sag mal, auch limitiert. Limitiert in Bezug auf die Übertragung von komplexen Fakten. Weil offen gesprochen, das Gehirn ist nicht dafür gebaut, das, was in den ersten zehn Minuten erwähnt wurde, mit allen Zahlen, Daten, Fakten, dann noch mal in Minute 50 rauszuholen. Das ist halt einfach schwierig. Und das merken wir auch bei der Aufnahme von Podcasts immer wieder. jetzt reden wir über storytelling wir kennen bestimmt auch alle den einen oder anderen ted talk und das war der hat mich wirklich mitgerissen und dieser talk ist es ist grandios da glaube ich wirklich dran und jetzt habe ich mir als jahresziel für 2024 das hier gesetzt okay ich möchte da mal ein fuß rein kriegen ich möchte besser werden im storytelling oder auch mal anfangen worauf es eigentlich ankommt leute mitzuziehen und story zu machen kann ich das als faktenbasierter als mensch der nur logisch denkt weil wir softwareentwickler sind oder brauche ich da künstler gene und kreativität also wie kriegt man den fuß in die erste tür um ja sein storytelling zu verbessern vielleicht.",
            "start": 1373665,
            "end": 1454980,
            "confidence": 0.7969210526315795,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also erst mal, meine Erfahrung beim Umgang mit IT-Learn ist, das ist sehr viel Kreativität, die mir da irgendwie um die Ohren fliegt immer wieder. Insofern, das ist vielleicht nicht Künstler-Gene, aber Kreativität. Und was du dafür brauchst, ist genau das, was Storytelling für mich ganz stark ist, neben den Bildern und den, vor allem Bildern und Metaphern, die man schaffen kann, ist es die Struktur. Und die Struktur ist vor allem dafür gut, dass ich weiß, worüber mein Hirn nachdenken kann. Also wenn ich verstanden habe, wie Strukturen funktionieren, wie ich Geschichten in eine sinnvolle, absichtsvolle Struktur gießen kann oder meine Inhalten, Daten in eine gute Struktur gießen kann, dann hat mein Gehirn etwas, worüber es nachdenken kann und eine Ausrichtung. Und wenn Gehirne eine Ausrichtung bekommen, dann legen die los. Also müssen sie schon sehr stumpf sein, damit die dann nicht loslegen und ihnen nichts einfällt. Das heißt, ein ganz wichtiger Punkt ist zu verstehen, welche Storytelling-Struktur funktioniert für mich. Und ich habe halt eine Präferenz. So, mal raus zu Spoilern. Meine Präferenz ist die Storystruktur von Robert McKee, der ein Hollywood-Drehbuchguru war, mittlerweile ein alter Mann. Mittlerweile haben aber auch einige andere clevere Marketingmenschen festgestellt, wie cool diese Struktur ist, und haben daraus eine marketingtaugliche gemacht, die dann da heißt Storynomics. Am Ende ist das wirklich nichts anderes als das, was ich schon viele Jahre mache, davon ausgehend, was Robert McKee eben für Drehbücher gemacht hat. Und das Tolle an der Struktur von dem ist, dass man im Faden die Perspektive wechseln kann, also springen kann zwischen. Ich muss nicht einen Helden nehmen und den so da durchführen durch so eine Heldenreise, was ich irre schwer finde für berufliche Kontexte, weil ich ja meistens nicht einen Helden hab, der eine bestimmte Erfahrung macht, sondern ich hab Sachverhalte und ich hab ein System, mein Unternehmen, ich hab mich, ich hab meine Kollegen, ich hab die Menschen, mit denen ich spreche, ich hab vielleicht meine Kunden. Das ist nicht ein Held. Und Robert McGee hat sich, statt diesem Helden in seiner Entwicklung zu folgen, die einzelnen Knackpunkte sozusagen in der Struktur angeguckt und hat Vergleiche angestellt und geguckt, wo sind die größten Parallelen und was sind das für soziale und erzählerische Mechaniken, die da passieren. Und wenn man diese Mechaniken von Robert McGee, finde ich jedenfalls, verstanden hat, hat man ein mega Werkzeug, um alles wirklich, wie gesagt, bis auf Mathe-Theorie sinnvoll in eine Struktur zu gießen. Und dabei gibt es für mich vielleicht zwei Dinge, die ich einfach schon mal spoilern kann, weil man die in ihre drei, weil die sich so nice ergeben, sozusagen. Die erste Sache ist mit einer, nee, ein Schritt zurück. Es vermischt sich das so ein bisschen, weil, um das gut machen zu können, wenn ich also verstanden habe, wie diese Mechanik in dieser Struktur funktioniert, dann ist es total wichtig, dass ich eine Ausrichtung brauche für die Mechanik. Also ich will ja was erreichen mit dem, was ich da mache, mit dem Gespräch, mit dem 101 oder mit dem Vortrag auf der Konferenz. Habe ich eigentlich eine Absicht? Nicht eigentlich. Ich habe im besten Fall eine Absicht, ansonsten war es Zeitverschwendung. Also ich habe eine Absicht, ich will etwas erreichen. Ich weiß, mit wem habe ich es zu tun und was soll bei denjenigen nachher anders sein als vorher. Wenn ich mir das nicht klar mache, kann ich machen, aber wie gesagt, die Gefahr, dass das dann Zeitverschwendung wird, ist relativ groß. Wenn ich aber weiß, was sich nachher verändern soll, dann habe ich wahrscheinlich sogar eine Ahnung davon, welche Emotion dafür nötig ist, weil wir tun als Menschen überhaupt nichts aus Fakten und Gründen, sondern nur, weil es eine Emotion bei uns getriggert hat. Und wenn ich die Emotion kenne, wenn ich zum Beispiel weiß, es soll Zuversicht für die Lösung in diesem IT-Projekt, ich will da Zuversicht, wir schaffen das schon, es hat jetzt 20 Jahre gedauert, aber wir schaffen das in zwei, jetzt fertig zu machen. Wenn so was vor der Tür stünde, dann wüsste ich, ich muss Zuversicht schaffen bei dem, ich muss das Gefühl triggern, das wird schon, wir schaffen das, zum Beispiel. Wenn ich das weiß, dann könnte ich mich für einen starken Anfang entscheiden. Das wäre zum Beispiel das erste aus seiner Struktur. Nicht lange rumzufackeln, nicht über, schönen guten Tag, mein Name ist Anna Mummer und ich wollte mal über Storytelling reden. Steht übrigens auch auf meiner Slide und von welchem Unternehmen ich bin, steht da auch. Ist also super doppelt gemoppelt, brauche ich überhaupt nicht machen. Und ist unglaublich retardierend und sorgt dafür, dass die Gehirne meiner Gesprächspartner schon machen, ich bin raus. Also fange ich besser wirklich einen Punch in the face an. Das wäre meine erste Empfehlung. Und ich lasse mir dafür nicht viel Zeit und ich will, dass es zügig anschließend zur Sache geht. Starker Anfang, direkt zur Sache, wäre zum Beispiel eine Empfehlung, die man sofort umsetzen kann. Sich grundsätzlich zu entscheiden, mit einem starken Anfang anzufangen, der auf meine Emotionen einzahlt. Also entweder zum Beispiel, was Zuversicht angeht, ein Worst-Case-Szenario platziert, sagt, da dürfen wir auf gar keinen Fall hin. Alle so, ein Schreckstarre schon da, okay. Dann muss ich mit dem Wendepunkt, mit dem nächsten Schritt halt natürlich anfangen zu sagen, hier sind die Lösungen. Wenn ich dann einen anderen wichtigen emotionalen Punkt, es gibt noch andere Schritte dazwischen, aber einen anderen wichtigen Punkt in ungefähr der Mitte meiner Redezeit oder meines Gespräches, weil das funktioniert super auch anzuwenden auf Gespräche, für einen Point of No Return sorge, auch in der Funktion aus seiner Struktur. Also einen Moment, in dem der situative Held, würde ich mal sagen, also eben nicht der eine Held, der durchgeht, sondern der, der jetzt gerade ein Held sein soll, eine Ja-Nein-Entscheidung fällt. Und zwar eine, die man nicht so gut wieder zurücknehmen kann. Das in die Mitte zu packen. Das kann zum Beispiel sein, dass ich meinem Gesprächspartner eine Frage stelle, die ultimativ ist, nur mit Ja und Nein zu beantworten ist. Oder ich erzähle von einem Kunden. Oder ich erzähle, jetzt wenn ich bei der Geschichte, die ich schon angefangen habe, bin, also wir sind schon 20 Jahre dabei, und wir schaffen das jetzt davon, zwei Monate fertig zu kriegen. Und ich habe begonnen mit, guck mal, das passiert, wenn wir es in zwei Monaten nicht machen, nicht fertig kriegen. Und ich habe eine gute Weiterleitung gemacht, die gesagt haben, hier sind wirklich die Potenziale, die wir noch nicht gehoben haben, Und ich schaffe es vielleicht, indem ich von mir selber erzähle, in diesem Fall. Nämlich von dem Moment, wo ich verstanden habe, dass ich mit dieser und dieser Lösung das in zwei Monaten tatsächlich gebacken kriegen kann. Und diesen Moment erzähle, wäre ein Point of No Return, dann ist dieser Ja-Nein in mir passiert. Oder ich erzähle, weil es ist vielleicht auch ein Kundenprojekt, von dem Moment, wo ich einem Mitarbeiter bei dem Kunden davon erzählt habe und der leuchtende Augen bekommen hat, dann ist das die Geschichte. Oder ich frage meine Gesprächspartner. So, bis hierhin sind wir gekommen. Jetzt würde ich einfach gerne wissen, soll ich weitererzählen oder nicht, zum Beispiel. Also ich habe das ganz viel in Pitches. Früher, als ich noch so bei HR-Unternehmen vorbeilaufen musste und irgendwie für meine Ideen werben musste, habe ich das in Pitchen aufgemacht, dass ich dann so eine Lust auf die Arbeit mit dem eigenen Körper gemacht habe, dass ich dann fragen konnte, Darf ich es ihnen mal zeigen? Stehen sie mal mit mir auf. Und mit mir aufzustehen und irgendwelche Atemübungen zu machen, danach ist es total schwer zu sagen, das war übrigens totaler Blödsinn. Wir wollen sie gar nicht. Es ist nur die Frage, wann und wie viel. Aber nicht, ob ich dann einen Job bekomme. Es ist auch immer so gewesen, dass sie nie nicht aufgestanden sind. Das ist natürlich auch ein bisschen gemein.",
            "start": 1456520,
            "end": 1877666,
            "confidence": 0.7833446455505287,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wie schaffst du das zu verhindern, dass bei dem Point of No Return, dass dann womöglich die falsche Option gewählt wird?",
            "start": 1877686,
            "end": 1884248,
            "confidence": 0.6992857142857141,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also erstens, manchmal ist es dann sinnvoll, dann weißt du, woran du bist, dann brauchst du nicht weiterreden. Dann kannst du sagen, okay, dann wissen wir hier, woran wir sind, dann musst du quasi eine B-Lösung vorbereitet haben, wie du da rauskommst aus der Nummer. Wenn du es darauf ankommen lässt, finde ich tatsächlich aber in manchen Entscheidungsprozessen gar nicht falsch, dass ich nicht zu Ende reden muss und dass ich mir nicht, dass ich einen B-Weg habe für, wenn die sagen, wir halten das für eine blöde Idee, wir wollen noch lieber drei Jahre daran rumschrauben, zwei Monate ist nicht drin. Warum auch immer, weil du es nicht bist, weil dieser Anbieter einer ist, mit dem wir auf gar keinen Fall zusammenarbeiten, ist ein Worst Case, werden wir nicht machen. Dann gibt es gute Gründe, die man in dem Moment erfährt und dafür, vielleicht auch schon geahnt hat dann in dem Fall wahrscheinlich, und dafür dann eine zweite Schiene vorbereitet und auf jeden Fall vielleicht im Zweifelsfall für sich selber weiß, okay, ich werde wohl gehen. Option, die dann im Raum steht im Zweifelsfall. Oder, und das hab ich ja gerade eben, weil in der Kürze der Zeit kann ich jetzt nicht jeden einzelnen Part dieser Struktur versuchen zu vermitteln, aber ich hab andere Parts in dieser Struktur davor, die das noch antriggern und noch anheizen können, sozusagen. Genau. Und der dritte wichtige Punkt immer, weil ich den einfach so wichtig finde, weil den auch alle Leute vergessen, so ähnlich wie diesen Anfang, alle ähnlich machen, nicht mit einem guten Call-to-Action rauszugehen. Und ich meine nicht ein Social-Media-Call-to-Action, hier klicken und so weiter, sondern ich meine, sich nochmal klar zu formulieren in der Absicht. Was wünsche ich mir von euch? Was möchte ich, dass jetzt anders wird? Was werde ich persönlich anders machen? Also irgendeine Formulierung zu machen, abzuschließen mit einem Statement sozusagen.",
            "start": 1884667,
            "end": 1974276,
            "confidence": 0.792292993630573,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hattest gerade eine ganz schöne Geschichte aus dem Kapitel Strategie erwähnt. Und zwar, dass man immer in eine Präsentation oder in ein Gespräch gehen sollte mit einer gewissen Absicht. Und dass man sich ganz genau Gedanken darüber machen sollte, was ist denn meine Absicht? Wie transportiere ich die? Und dann hattest du was Schönes gesagt, weil sonst ist es ja Zeitverschwendung. Und ich hab mir, ich stell mir oft die Frage, was ist dieser eine Satz, dieser eine Punkt, den die Leute mit rausnehmen, wenn die alles vergessen von meinem Talk, aber welchen Satz sollen die wirklich behalten? Und eine Strategie, die ich mal gehört hab, die hab ich auch mal angewandt, die schien ganz gut funktioniert zu haben, zumindest in den Gesprächen nach einer Präsentation, war, diesen einen Satz, ich sag mal, mit dem Vorschlaghammer in die Gehirne zu hämmern. über einen über eine länge von 30 35 minuten habe ich diesen satz glaube ich auf sechs slides ich habe die slide sechs mal gehabt in dem ganzen vortrag oder sowas weil das halt ich sag mal so die die kiethese war würdest du würdest du sagen das ist eine gute strategie zumindestens die frage zu stellen vorher was ist das eine womit die leute rausgehen sollen.",
            "start": 1975212,
            "end": 2047097,
            "confidence": 0.8158516746411484,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Für dich jetzt oder auf der slide.",
            "start": 2047137,
            "end": 2048458,
            "confidence": 0.6302857142857142,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "So generell als Vorbereitung zur Strategie, wie transportiere ich meine Message? Weil es gibt ja auch Vorträge, die haben ein anderes Ziel. Es gibt Vorträge zum Beispiel, die sagen, okay, ich verteile Wissen. Andere Leute sollen aware von irgendwas sein. Da bin ich mir nicht sicher, was da jetzt für ein Call-to-Action rauskommen würde. Ja, also erst mal.",
            "start": 2049387,
            "end": 2065792,
            "confidence": 0.5150862068965517,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Der Call to Action ergibt sich immer aus dieser Absicht, die ich am Anfang geklärt habe. Und ich würde die immer klären, grundsätzlich, das spart so viel Zeit. Also wenn ich genau weiß, was ich will, was für meine Gesprächspartner anschließend anders ist als vorher. Und das ist für mich die Fragestellung, die Zauberformel ist wirklich, was soll für die nachher anders sein als vorher, was sollen die anders machen, was soll in deren Leben nachher anders sein. Wenn ich das für mich genau geklärt habe, dann weiß ich schon mal ganz viel darüber, was nicht drin vorkommen muss, weil alles, was nicht darauf einzahlt, kann ich weglassen. Extreme Zeitersparnis. Außerdem mache ich alles, was ich mache, mit Absicht. Was wiederum ganz viel Zeitersparnis für die ganzen Menschen ist, die mir zuhören, die nämlich nicht, wenn es auch nur fünf Minuten ist, aber wenn ich da zwölf Leute habe, die da fünf Minuten mir zuhören, Ihr seid wahrscheinlich besser in Mathe als ich, aber es ist zwölf mal fünf, weißt du? So viele Minuten Zeitverschwendung habe ich gemacht, wenn ich mir nicht überlegt habe, was ich bei denen bewirken will, wenn ich deren Zeit verspendet habe. Da habe ich nicht einmal fünf Minuten verspendet, sondern zwölf mal fünf Minuten. Und das verhindere ich, wenn ich es für sie relevant mache. Was ich verhindere, wenn ich mir überlege, was nachher anders werden soll. Und vielleicht kommt dabei so ein Call-to-Action raus, der sich lohnt, sechsmal auf eine Slide zu packen. Mein Vorschlag wäre immer, variier's, weil Gehirne sind ja kleine Bitches und wenn die Sachen ein paar Mal gesehen haben, dann skippen die das. Also die Gefahr bei sechs Mal dasselbe Slide, wenn du es nicht jedes Mal anders variierst auf der Tonspur und nochmal ein Add-on da drauf packen kannst, der dafür sorgt, dass die Gehirne nicht skippen können, dann skippen sie das. Also insofern, ich würde sagen, ja, Wiederholungen sind super, aber in Variationen. Und so meine ich Call to Action eben nicht. Manchmal ist es tatsächlich, wenn ich Informationen weitergebe, großes Missverständnis. Geht es auch nicht darum, etwas zu liefern? Wenn wir vor anderen Leuten stehen und Präsentationen in welcher Form auch immer machen, ist es kein Lieferdienst. Nicht mal wenn dein Chef zu dir sagt, ich hab ja keine Zeit, kannst du das mal eben schnell machen. Dauert nur zwei Minuten, die Slides sind schon fertig. Nicht mal dann solltest du es als Lieferdienst machen, sondern auch dann solltest du dir überlegen, was will ich hier erreichen. Die zwei Minuten, die sind es wert, weil dann machst du es anders. Und wenn du es nur machst, weil dein Chef es dir gesagt hat und du eben diese zwei Minuten über dich ergehen lässt oder fünf oder drei, weiß ich nicht, dann ist genau das die Wirkung. Du bleibst in Erinnerung, als der Mensch, der es ganz schön hart hat, es über sich hat ergehen lassen, ein Lieferdienst zu sein. kann nie, zu keinem Zeitpunkt in meinen Augen eine Option sein. Das ist einfach, kann, von wegen Gestalte die Story, die man sich über dich erzählt, einfach nicht zielführend. Der macht halt, was der Chef sagt, und das macht er auch noch schlecht. Oder sie. Irgendwie echt eine blöde Option. Das heißt, selbst wenn ich ganz schnell wo einspringen muss, es nicht meine Slides sind, sollte ich mir überlegen, was will ich hier erreichen? Und wenn es ist, ich Will ins Gespräch kommen mit meinem Chef-Chef. Super. Dann ist das eine Absicht, die ich habe. Dann gehe ich da rein, liefere diese Sachen, aber in Wirklichkeit bin ich da, weil ich die ganze Zeit denke, hey, wir müssen mal einen Kaffee trinken gehen. Und weil ich eine Lösung finde in diesem Gespräch dafür, dass wir mal einen Kaffee trinken gehen. So. Zum Beispiel. Schon nicht Zeitverschwendung gewesen für mich und auch nicht für ihn.",
            "start": 2068324,
            "end": 2258170,
            "confidence": 0.7879489164086689,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt sich so zu überlegen, was man eigentlich ändern will oder was die Kernbotschaft ist. Jetzt ganz persönliche Frage, wenn du einen Vortrag machst, überlegst du dir das zuerst oder machst du den Inhalt und überlegst es dir zwischendrin?",
            "start": 2259380,
            "end": 2271922,
            "confidence": 0.7719487179487179,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich setze mich hin und ich frage mich, wer ist es, was will ich da erreichen? Also ich mache eine Zielgruppenanalyse, ich mache die meistens echt gekürzt, manchmal nicht. Also wenn ich die Menschen nicht gut kenne, dann mache ich sie auch ausführlicher. Und dann gehe ich auch los und frage Leute, die diese Leute besser kennen. Wie schätzt du die ein? Wie ticken die? Was sind, also eine Frage, die für mich total wichtig ist, dann ist, wenn die meiner Idee zustimmen, womit bezahlen die das? Weil das ist oft die Frage, die man nicht so, man weiß meistens, was die Leute davon haben, wenn die mitgehen mit der eigenen Idee, aber man macht sich keine Gedanken darüber, was der Preis ist für diejenigen. Und es gibt immer einen. Und wenn es halt ist, sie müssen mir nochmal 15 Minuten zuhören, weil ich das vertiefen darf. das ist ein Preis, 15 Minuten kann in bestimmten Kontexten ein Preis sein, mir darüber wirklich klar zu werden und dann zu überlegen, was möchte ich, was für die nachher anders ist, weil was möchte ich bei denen erreichen, das mache ich bevor ich irgendwas anderes mache, weil das ist der Zeitsparer ever. Also meine Kunden machen das oft nicht vorher, was dann mir ganz viele Stunden Arbeit einbringt, Weil die kommen, wir fangen an, ich stelle diese Frage, die sagen, oh, ja, hab ich ja gar nicht drüber nachgedacht, okay, wenn ich drüber nachdenke, das ist das, das und das und das und das ist es. Und dann gucken sie auf ihre Slides, die sie schon fertig vorbereitet haben, wo sie schon jemanden dran gesetzt haben, und dann, ah, da muss ich ja von vorne anfangen. Genau. Also ja, ich mach das, bevor ich irgendwas mache, weil ich mir das gar nicht leisten kann.",
            "start": 2273007,
            "end": 2349878,
            "confidence": 0.7657251655629136,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber es klingt eigentlich nach viel Arbeit, die man reinstecken muss.",
            "start": 2350178,
            "end": 2353159,
            "confidence": 0.49663636363636365,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das ist ein Irrtum, weil die viele Arbeit entsteht, wenn du es nicht vorher machst. Weil dann musst du es zigmal umarbeiten, dann hast du keine Ausrichtung. Wenn du die Ausrichtung von Anfang an hast, dann hast du nachher nicht so viel gehasst.",
            "start": 2353699,
            "end": 2365572,
            "confidence": 0.7450454545454543,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Mir wurde damals, weil wir haben die Episode mit der Vorlesung wissenschaftliches Arbeiten begonnen, mir wurde damals nahegelegt, wie man wissenschaftlich arbeitet. Und zwar, man sucht sich erst die Quellen, man recherchiert über das Thema, schreibt sich vielleicht so ein paar Sätze raus, die man dann später dann referenziert und so weiter. Aber in meinem Studium sah die Realität ein bisschen anders aus. Viele meiner Kommilitonen, die haben einfach die Arbeit runtergeschrieben und haben sich danach Quellen gesucht, die man so ungefähr danach suchen kann. Und ich habe das Gefühl, wir sprechen jetzt gerade irgendwie genau über das. Korrektes wissenschaftliches Arbeiten ist, Im Präsentationsumfeld, okay, ich überlege mir alles vorher, dann fällt das später leichter, weil im Endeffekt hast du alle Referenzen schon runtergelistet, ein paar Füllwörter und eine Story drüber umbauen. Da sind wir wieder bei der Story. Ist, ich sag mal, leichter in der Bachelorarbeit, als wenn man, ich hab schon alles und muss mir jetzt die Quellen suchen.",
            "start": 2366651,
            "end": 2419135,
            "confidence": 0.7757267080745339,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, absolut. Das ist richtig mühselig, das so rumzumachen und dann musst du dann auch noch an der Struktur rumbauen und dann musst du rückwärts nochmal was anders machen, weil du noch was entdeckt hast, was du vergessen hast, was aber doch total wichtig ist, was meistens nicht unbedingt stimmt, sondern sich nur so anfühlt, weil man orientierungslos ist. So verhalten sich Menschen, wenn sie orientierungslos sind. Wir alle verhalten uns so, wenn wir orientierungslos sind. Mit einer Ausrichtung, mit einer Orientierung sind wir effizienter. Also ich bin so eine Chaotin, ich kann mir gar nicht leisten, das den anderen Weg zu machen. Ich werde nie fertig.",
            "start": 2419732,
            "end": 2452368,
            "confidence": 0.8084953271028037,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also ist das so ein bisschen Selbstschutz auch für dich?",
            "start": 2452408,
            "end": 2454090,
            "confidence": 0.6244,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Absolut, für mich ist das totaler Selbstschutz.",
            "start": 2454110,
            "end": 2455792,
            "confidence": 0.7561428571428571,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hattest grad schon genannt, dass man, wenn man immer dieselbe Nachricht wiederholt, dass sie monoton rüberkommen kann, dass das Gehirn abschaltet. Es sei denn, man variiert was in der Stimme. Und man merkt schon, wie du sprichst, du hast sehr viel Energie in der Stimme. Und wenn ich jetzt an die Stimme denke und das Präsentieren, denke ich auch an den Körper, wie bewege ich mich, Körpersprache und so weiter und so fort. Und wenn du sagen würdest, oder wenn du die Frage gestellt bekommst, Wie viel Prozent von einer erfolgreichen Präsentation macht eigentlich die Stimmlage, die Körpersprache und die, ich sag mal, die Aktivität aus? Weil, Achtung, zur Vorbereitung dieses Podcasts habe ich auch mal in deinen Podcast reingehört. Und ihr habt eine Episode 115 über drei Speaker-No-Gos. Und das erste Speaker-No-Go war, lauft bitte nicht hin und her auf dieser Bühne. Und dieses lauft nicht hin und her auf dieser bühne ist ja für mich auch schon irgendwie eine art ich nenn es mal aktivität das scheint aber jetzt in diesem fall eine negative aktivität zu sein deswegen würde ich gerne von dir wissen was sind was sind positive aktivitäten energie stimme körpersprache und und und und wie viel wie viel prozent macht das eigentlich ist auch aus von einer erfolgreichen präsentation.",
            "start": 2457177,
            "end": 2534510,
            "confidence": 0.8058372093023256,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das mit den Prozenten kann ich dir nicht beantworten, das kann ich jetzt schon sagen. Weil es liegt total wieder an den Kontexten und an der Person. Und es gibt Menschen, die können so spannungsvoll reden, dass da auch nicht viel Energie in der Stimme ist und auch nicht viel Bewegung. Da kannst du einfach nicht weghören und nicht aussteigen. Weil die Geschichte stimmt, weil die Persönlichkeit und ihr Charisma und ihre Präsenz so packend ist. Deswegen, dafür gibt's keine Regeln. Das ist in gewisser Weise dann auch 100% Körperlichkeit, 100% Stimmlichkeit und 100% Inhalt und Strategie. Geht nicht, so viele 100% gibt's nicht, aber so alles zusammen dann 100%. zu diesem tigern was du da gerade beschrieben hast die guten grund warum man tigert wir tigern weil aufregung ist bewegungsenergie aufregung ist stress ein ausdruck von stress und stress ist bewegungsenergie das ist dieses fight and flight wenn wir in bestimmten Hormoncocktail im Körper haben, der mit Stress zu tun hat, dann ist das dafür da, um uns zu bewegen. Deswegen bewegen wir uns ganz viel auf der Bühne. Das Problem ist aber, dass dieselbe Instanz in unserem Gehirn, nämlich die Amygdala, die uns signalisiert, Achtung, wir sind jetzt in einer Stresssituation, wir treten jetzt auf eine Bühne, gefährlich, gefährlich, wir brauchen diese Hormone, die scannt auch unseren Körper. Die scannt den Körper auf Stresssymptome. Das ist wie so ein biologischer Teufelskreislauf. Also du bist aufgeregt, deswegen bewegst du dich ganz viel. Weil du dich ganz viel bewegst, wirst du aufgeregter. Also erstmal ist es für dich nicht gut. Außerdem ist es für deine Gesprächspartner nicht gut. Für die Menschen unten oder vor dir. Weil die versuchen deinen Sinn drin zu erfassen, dass du wie bekloppt von rechts nach links rennst. Das machen wir. Wir vermitteln etwas und wir zwingen Menschen, uns zuzugucken. Das heißt, diese Gehirne von den Menschen, die uns zugucken, die versuchen von dem, was du da gerade lieferst, die versuchen, da den Sinn rauszudestillieren. Und alles, was du machst, zahlt ein auf dieses Ergebnis, das sie versuchen, da rauszudestillieren. Und wenn du von rechts nach links rennst ohne Sinn und Verstand, einfach nur, weil du so viel Energie im Körper hast, was verständlich, aber nicht hilfreich ist, dann denken die da unten darüber nach, warum du rennst. Und die interpretieren deinen Geräne und deinen Inhalt im Zusammenhang mit dem Geräne und das ist meistens sinnlos und führt zu nix. So. Also es ist weder für dich gut, noch für deine Gesprächspartner. Eine Empfehlung wäre, beweg dich mit Absicht. Du kannst eine Bühne, das ist was, was oft unterschätzt wird, die meisten, auch echt die passionierten Speaker, die gehen auf die Bühne, die stehen vorne am Bühnenrand, die erkenne ich meistens daran, dass die fast von der Bühne kippen vorne, weil die so Weil die ran wollen und weil die was zu vermitteln haben, weil die was wollen. Und ich denke immer, schade um den ganzen Rest des Raums. Also weil da ist ja noch eine Riesenbühne. Also wenn man sich so große Veranstaltungen überlegt, da ist eine gigantische Bühne und wo kleben die Arme an der Kante und da ist dann gar kein Bewegungsraum mehr. Also meine erste Empfehlung wäre, benutzt die ganze Bühne, benutzt den ganzen Raum. Benutzt das auch in virtuellen Präsentationen oder Vorträgen. Benutzt den ganzen Raum. Es ist auch ein dreidimensionaler Raum und kein Foto, sondern ein Ort, der oben, unten, vorne, hinten hat. Und wenn man auf einer Bühne ist, dann kann man ganz bewusst Raumanker benutzen. Also zum Beispiel, der Klassiker ist immer zu sagen, also wir könnten jetzt das hier machen und dann zeigt man nach rechts oder man geht nach rechts an einen Punkt. Oder wir machen das und gucken auf die andere Seite. Und ich finde, wir sollten beides machen, dann stellt man sich in die Mitte. So, das ist jetzt ganz billig. Es geht natürlich raffinierter, je nachdem, was man bewirken will und wie man dadurch die Art und Weise, wie man sich auf der Bühne bewegt, Einfluss drauf nehmen will. In jedem Fall ist sich bewegen unglaublich angenehm für unsere zuschauenden Gehirne. Gestik ebenfalls. Wir interpretieren Inhalte absolut nicht alleine durch die Sounds, die in unserem Ohr wieder zu Worten und Inhalten zurückverarbeitet werden, sondern immer durch den Gesamteindruck. Das heißt, das, was uns die Hände, die Mimik und die Bewegung im Raum bietet, ist immer Teil dessen, wie wir Verstehen, wirklich inhaltlich verstehen, was uns gerade gesagt wird. Und das wieder auch in einem Eins-zu-Eins-Gespräch, genauso wie wenn du auf der Bühne bist. Und dann noch ein Vorteil, wenn du dich halt auf die Bühne stellst und den ganzen Raum einnimmst, dann sieht es nämlich so aus, als wenn die Bühne dir gehört, als wenn du dich wohlfühlst auf der Bühne. Anders als wenn du an der Kante stehst, dann merkt man halt, na, da ist ein Drang, da muss was raus. Aber in der Mitte des Raumes, wenn du an der Bühne stehst und diese Bühne mit deiner Gegenwart ausfüllst, also Präsenz hast, dann siehst du super, super souverän aus. Einfach nur, du kannst innen drin brodeln. Einfach nur, weil du ruhig in der Mitte dieser Bühne stehst. Und das führt dann dazu, dass dein Amygdala denkt, oh, ist ja alles gar nicht so schlimm und runterfährt. Also nicht die Amygdala, sondern dann der Hypothalamus, der halt dann halt auf mit dem Cortisol geschieße. Genau. Also man kann darüber, dass man sich auf der Bühne so verhält, wie man es auch täte, wenn man sich, weiß ich nicht, so eine neue Wohnung, bei der man so überlegt, Könnte ich hier wohnen oder nicht? Da bewegt man sich auch nicht am Rand der Wände, sondern stellt sich in die Mitte und fühlt diesen Ort. Man kriegt so ein Gespür, da ist das Fenster, da ist der Kücheneingang und so, weil man genau das auch auf der Bühne macht. Guck mal da vorne links, da sitzt eine Gruppe von Freundinnen, da hinten rechts, da und hinter mir der Techniker, dem habe ich gerade noch die Hand geschüttelt. Wenn das alles da sein kann und ich das alles wahrnehme, dann fühle ich mich wohler und meine Amygdala hört auf Alarm zu schlagen.",
            "start": 2535192,
            "end": 2861091,
            "confidence": 0.7820433944069428,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich habe ein ganz interessantes Zitat von dir gefunden. Ich hoffe, es ist von dir. Dass du Menschen helfen willst, sichtbar zu sein und sich dabei gleichzeitig sauwohl zu fühlen.",
            "start": 2861460,
            "end": 2870743,
            "confidence": 0.8292666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das von mir.",
            "start": 2870883,
            "end": 2873383,
            "confidence": 0.732,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es ist ja genau das eigentlich auf der Bühne. Aber was mache ich denn, wenn ich absolut nervös bin? Plane ich einfach das im Vorhinein, was ich wirklich dann schrittweise mache auf der Bühne? Weil wenn ich super nervös bin oder irgendwie Angst habe, mich dahinter am Pult verstecke, dann komme ich ja gar nicht in die Situation, in den Raum zu treten. Also wie schaffe ich es, diesen Schritt zu machen in die Mitte?",
            "start": 2873443,
            "end": 2894046,
            "confidence": 0.7867866666666665,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also erstmal, dass ich tatsächlich verstehe, jedes Verhalten von mir, das ich tue, weil ich in Panik bin, sorgt dafür, dass ich mehr Panik bekomme. Und wenn ich genug Panik hergestellt habe, oder nicht verhindert habe, muss man vielleicht ehrlicherweise sagen, dann kann das dazu führen, dass mein Hirn sich ausschaltet. Also die Teile in meinem Gehirn, mit denen ich Zusammenhänge verstehen kann, neue Gedanken haben kann, der frontale Kortex, der wird bei einem bestimmten Pegel von Cortisol ausgeschaltet, weil der braucht so viel Energie, so viel Energie können wir nicht verschwenden. wenn wir in Panik sind. Wir müssen ja wegrennen oder zuschlagen können. Also wird der ausgeschaltet. Und was wir dann richtig gut können, ist alles, was wir schon hunderttausend Mal gemacht haben. Sich zum Beispiel am Pult festhalten. Sich am Pult festhalten signalisiert aber meine Amygdala, dass ich echt Probleme habe, weil ich verstecke mich ja scheinbar hinter was. Also nicht zielführend. Deswegen stimmt das, was du gerade gesagt hast. Das hilft dann da nur zu proben. Also so viel, wie sich wirklich zu überlegen, wie möchte ich etwas ausdrücken, wo möchte ich mich bewegen und das vorher gemacht zu haben. Sich am Pult festhalten, in Panik zu sein, zu sagen, aber die Anna hat gesagt, ich soll in die Mitte der Bühne gehen. Auf den Gedanken wirst du nicht mehr kommen, weil das wird dir dein Gehirn nicht zur Verfügung stellen. Das wird sagen, halt dich fest, red schneller und guck, dass du da runterkommst. So, das wird da passieren. Wenn du das nicht möchtest, aber wenn du wirklich eine Performance hinlegen willst, die einen Eindruck macht und auch inhaltlich bewirkt, was du erreichen willst. Dann hilft es nichts in der Vorbereitung. Proben macht einen großen Unterschied. Und Selbstregulation, also Selbstmanagement zu trainieren, auch. Und das ist dann übrigens was, was dir so oder so im Leben hilft. Also zu verstehen, wie du mit einer tiefen Bauchatmung, nicht nur zu verstehen, sondern trainiert zu haben, dass du mit tiefer Bauchatmung auf Stress reagierst. Das hilft dann auch, wenn du gerade, weiß ich nicht, Kindergartenkinder hast und man morgens aus dem Haus will und eigentlich weiß man, man hat gleich ein Gespräch mit seinen Mitarbeitern. Willst du deinem Montags-Stand-up? Weißt jetzt schon, dass man zu spät kommt, weil alle schreien und mit Schuhen werfen. So, das ist dann der Moment, wo man die Fassung verliert und zurückschreit und alle weinen irgendwann und man kommt trotzdem nicht rechtzeitig aus der Tür. Da könnte es helfen, wenn man sich selber gut regulieren kann. und nicht in Panik verfällt. Diese Selbstregulation zu trainieren, die einem hilft, auf der Bühne entspannter zu sein, hilft in so vielen Lebenssituationen. Kinderhunde und Pferde sind da extrem gute Trainingspartner für. Nicht erst die Bühnensituation. Der wichtigste Punkt dabei ist tatsächlich, darauf zu achten, dass man länger ausatmet als einatmet. Wenn man es hinkriegt, bei der Einatmung die Bauchmuskulatur zu entspannen, unter Stress haben wir eine sehr angespannte Bauchmuskulatur, Und zu lernen, die zu entspannen, einfach weil wir es wollen, also nicht rausdrücken, weil dann ist die Muskulatur auch wieder angespannt, sondern wirklich die Bauchmuskulatur fallen zu lassen, kann ein Weg sein, wie man extrem schnell wieder Zugriff auch auf den frontalen Cortex bekommt, wenn man das Cortisol ratzfatz runterfahren kann.",
            "start": 2894484,
            "end": 3067756,
            "confidence": 0.7869284403669733,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Meiner Erfahrung nach hilft es auch extrem, einfach diese äußeren Einflüsse, die es gibt auf der Bühne und gerade zum Beispiel so ein Klassiker ist, der Laptop ist irgendwo an dieses Kabel gebunden und er steht dann in irgendeinem dummen Eck und man ist dann gezwungen, irgendwie so in diesem Eck zu stehen oder so. Also alles, was man irgendwie so im Vorhinein schon checken kann, verhindern kann. Vielleicht schaffe ich es irgendwie, dieses Kabel zu verlängern oder dieses Pult umzustellen, damit ich eben das machen kann, wie ich will. Und das nimmt mir dann auch irgendwie die Nervosität, wenn ich das im Vorhinein schon hier zurechtrichte, anstatt dann in eine Situation zu kommen, die ich eigentlich gar nicht haben wollte. Und die wollte ich eigentlich nach vorne gehen, kann aber nicht, weil der Laptop hinten steht. Oder weil, keine Ahnung, weil die Bühne so und so gestaltet ist. Also da kann man, glaube ich, im Vorhinein schon auch einiges sich überlegen oder halt einfach dann durchziehen. Keine Angst zu haben, mal das Boot umzuschieben oder den Laptop umzustellen.",
            "start": 3068438,
            "end": 3119405,
            "confidence": 0.8062793296089387,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Zweifelsfall sogar hands on in der Situation.",
            "start": 3119445,
            "end": 3121907,
            "confidence": 0.8177142857142857,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, genau.",
            "start": 3122248,
            "end": 3123229,
            "confidence": 0.55,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Wäre eh meine Empfehlung. Wenn ich irgendwo spreche, dann nicht nur die Bühne mir bewusst zu machen, sondern auch den Raum. Auf Konferenzen kann das bedeuten. Und auf Messen. Hör dir mal an, wie sich das in der letzten Reihe anhört. Es gibt so Veranstaltungsorte, wo ich sagen würde, das ist eine Erfahrung wert. Da weißt du genau, wie wenige Menschen wirklich verstehen können, was du sagst. Da guckst du dann den Vorrednern zu und denkst, krass, ich hab kein Wort. Abgefahren. Wenn die dann auch noch schnell reden und nicht senden wirklich, es gibt so Messen, da bist du lost, wenn du das nicht tust. Und dann einmal in dem Raum zu stehen und zu hören, ah, guck mal, so schlecht ist der Sound hier. Alter Verwalter, mach das du auf der Bühne dich ganz anders verhalten wirst, zum Beispiel. Also auch sich den Raum wirklich zu eigen machen, absolut gute Idee.",
            "start": 3124129,
            "end": 3174391,
            "confidence": 0.7740324675324673,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wie stehst du eigentlich zu Mikrofonen, wenn wir gerade bei Stimme und Atmung und so weiter sind?",
            "start": 3174411,
            "end": 3179674,
            "confidence": 0.7251764705882353,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es gibt Kontexte, da kannst du nicht drauf verzichten. Und dann gibt es Kontexte, wo ich es nicht verstehe. Also kleiner Raum, pickepackevoll mit Menschen und kräftige Stimme, das muss man abmessen. Das ist dann halt oft so, dass Unternehmen sagen, wir machen das ja per se, damit nicht einer geoutet wird. Ja, dann ist das so. Das ist dann zum Beispiel ein guter Grund, ein Mikrofon zu benutzen. Wenn es einfach dann darunter vielleicht nicht so gut trainierte Stimmen gibt oder höhere Stimmen gibt, dann kommst du halt mit einer sonorentiefen Stimme easy durch. Aber wenn du eine kleine, zarte, hohe Stimme hast, dann ist es halt schwieriger und dann ist es schön, wenn du verstärkt wirst. Und dann ist das oft der Grund, warum Leute verstärkt werden. Aber mit Mikrofon muss man sprechen lernen.",
            "start": 3179995,
            "end": 3220703,
            "confidence": 0.7137941176470586,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich habe gerade kürzlich auch einen Vortrag gehalten und da wurde halt jedem dieses Mikrofon in die Hand gedrückt und das hat halt jeder verwendet, aber es war einfach nicht nötig und ich habe es dann abgelehnt oder gefragt, ob die Leute mich hören und so weiter. Aber das ist natürlich auch, man muss das dann eben auch wieder so einen externen Einfluss einfach ablehnen, sich trauen, überhaupt es zu machen.",
            "start": 3220723,
            "end": 3240365,
            "confidence": 0.7562083333333329,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn du den Raum so füllen konntest, ist das die beste Idee ever gewesen, weil der Veranstalter kann es nicht machen. Der Veranstalter kann es aus den Gründen, die ich gerade gesagt habe, nicht machen. Sonst würde sozusagen, wenn dann der eine fragen muss, kann ich mal ein Mikrofon haben, weil man hört mich so schlecht, das ist überhaupt nicht gut. Aber wenn du sagst, ich will mich gerne bewegen, ich lege das Ding weg.",
            "start": 3240385,
            "end": 3259735,
            "confidence": 0.7958,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist kein Problem. Ich persönlich höre lieber zu ohne Mikrofon, weil es doch irgendwie blechern ist oder je nach Soundanlage. Klar, wenn ich in einem Stadion spreche, ist es was anderes, aber in normalen Räumen ist es, wenn es möglich ist, normalerweise für mich persönlich zumindest angenehmer.",
            "start": 3260095,
            "end": 3275662,
            "confidence": 0.7163541666666666,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es ist aber auch eine schwierige Geschichte mit oder ohne Mikrofon in kleinen Räumen, weil meine Erfahrung ist, auch in etwas größeren Meetingräumen, wo 20 Leute drin sitzen, da ist es nie ganz leise. Wenn der Speaker oder die Speakerin dann schon deutlich lauter sprechen muss, das raubt enorm Energie über 40 Minuten, zum Beispiel wenn man jetzt Vortrag über 40 Minuten hält. Und wenn man dann am Anfang fragt, kann mich jeder hören, dann erwartet man ja eigentlich, dass jeder so mutig ist und sagt, nein, ich kann dich nicht hören. Und nicht jeder ist so komfortabel und meldet sich in einer größeren Gruppe. All das habe ich auch schon erlebt. Aber ich verstehe das, mit dem Mikrofon hat man zu nah, dann schnauft man da rein, dann hat man es zu weit weg, dann ist es keine Verstärkung und so weiter.",
            "start": 3277493,
            "end": 3322864,
            "confidence": 0.7875874125874126,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das ist noch ein Punkt, wenn du das Mikrofon, wenn du ein Headset hast, ist das das eine. Da würde ich einfach sagen, da muss man einfach durch, das ist dann auch ein Prozess. Aber ein Handmikrofon zu verweigern, weil ich es besser alleine kann, kann ich sogar verstehen. Weil ein Handmikrofon ist einfach eine Beschränkung. Da muss ich im Worst Case sagen, dass ich das ganz nahe halten muss die ganze Zeit, dann sieht man mein Gesicht nicht wirklich. Ein Headset ist was anderes, oder ein Anschlagmikrofon, als ein Handmikrofon, finde ich. Also beim Headset würde ich sagen, leg's an. Aber Handmikrofon kann man ablegen.",
            "start": 3322904,
            "end": 3357337,
            "confidence": 0.7387735849056604,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hattest gerade sehr, sehr gute Tipps gegeben, so nach dem Motto, schau dir doch mal den Raum an, wo du präsentierst, setz dich mal in die letzte Reihe, hört man dich ja gut und so weiter und so fort. Und meiner Erfahrung nach bin ich da voll bei dir. Das ist alles sehr, sehr wertvoll. Zur Vorbereitung muss man aber auch sagen, es ist sehr schwierig, sich auf den Raum vorzubereiten. Denn natürlich kann ich den Vortrag üben in einem Meetingraum vor meinen Arbeitskollegen oder Ähnliches oder jetzt in einem Remote-Setup. Aber wenn man dann auf einer Bühne in einem alten Theater steht, wo die Scheinwerfer auf dich gerichtet sind und man das Publikum nicht sehen kann, weil es eine große Bühne ist, weil man wird geblendet. Man sieht keinen, man sieht nicht, ob die Leute lachen, ob die schlafen, ob die am Handy spielen. Und all das hat ja einen Effekt auch auf deine Performance. Und das stell ich mir dann schon irgendwie schwierig vor. Zumindest war das bei mir immer so schwierig. Und manche Entwicklerkonferenzen, auch wenn es kleinere Konferenzen sind mit 400 Leuten, die buchen sich dann schon mal alte Theater oder ähnliches. Und wups, hat man auf einmal eine Riesenbühne, die man dann füllen muss. Wie, würdest du sagen, kann man sich auf so was vorbereiten? Oder ist das einfach nur, nee, das ist dann dieses Go-out-of-your-comfort-zone, da muss man dann leider durch.",
            "start": 3357761,
            "end": 3428838,
            "confidence": 0.7929369747899153,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Nee, da kann man sich drauf vorbereiten. Und trotzdem, an einem bestimmten Punkt ist es out of the comfort zone und es gilt, an irgendeinem Punkt zu springen und das Risiko einzugehen. Aber man kann sich anfangen, also erstmal besser darauf vorbereiten. Der erste Punkt ist wieder meine Selbstregulation, meine Selbststeuerung. Je besser ich das kann, desto eher habe ich im Griff, was mit mir gerade passiert. Das andere ist, wenn die lachen, hörst du das. Du hast gesagt, du weißt nicht, ob die lachen. Doch, das weißt du und das trifft auch genau einen anderen Punkt. Ja, es gibt Theater oder Messebeleuchtung, die macht, dass du nichts siehst. Aber du spürst immer. Und das, was wir oft unter Stress machen, ist, wir steigen halt aus unseren Sinnen aus. Das ist das, was passiert, wenn wir im Stress sind. Wiederum die Sinne anzuschalten, hilft, wie gesagt, deinem System, fake it till you make it, zu signalisieren, ist gar nicht so schlimm. Du kannst spüren, ob die gerade bei dir sind oder nicht. Es macht was mit dir, was in dem Raum passiert. Ob da eine Stecknadel fallen, hören möglich ist oder ob die tatsächlich alle kruscheln, das kriegst du mit. Und du kannst sogar die Ecke lokalisieren, wo das gekruschelt ist. Und du solltest dir eh diesen Raum nicht nur angucken, weil es gut ist, mal gehört zu haben, bis wohin musst du eigentlich kommen, sondern weil du ihn dir dann vorstellen kannst, gerade wenn du ihn auf der Bühne nicht mehr sehen kannst. Wenn du da hinten gesessen hast und vielleicht neben jemandem, den du dir einmal ganz kurz angeguckt hast, dann kannst du anschließend in deiner Vorstellung mit dieser einen Person sprechen. Oder immer wieder zurückkommen zu dieser einen Person und deine Ansprache an das Publikum. Und der tolle Effekt ist, dadurch fühlen sich alle angesprochen, die da unten sitzen. Auch alle, die zwischen dir und da sind. Es ist auch eine Technik, die man großartig mit der Webcam trainieren kann. Also während man reinguckt, einfach an eine Person denken und diese Person ansprechen und an die Person die Sendung rausschicken und eben nicht nur so platt diese Webcam eben nicht aus dem Blick verlieren, sondern jemanden meinen, wenn ich in diese Webcam gucke. Und genauso auf der Bühne. Jemanden im Kopf haben, mit dem ich gerade rede. Oder eine Gruppe von Menschen, vielleicht platziert man einen rechts, einen links und einen hinten und hat dann Menschen, mit denen man sprechen kann. Das gibt dir Sicherheit, also deinem Unbewussten, deinem vegetativen Nervensystem und dem Publikum das schräge Gefühl, klar, der hat mit mir gesprochen. Also auf jeden Fall, der hat mich sehen können. Die wissen ja nicht, dass du sie nicht sehen kannst. Die können dich mega gut sehen. Deswegen ist die Assoziation für die Gehirne unten gar nicht, dass du die vielleicht nicht sehen könntest, außer du fängst an, deine Augen zu verdecken und zu versuchen, durchzugucken. Ansonsten schnallen die das unten nicht. Die haben nicht die ganze Zeit im Kopf, dass du sie nicht sehen kannst, sondern die fühlen sich angeguckt und angesprochen, weil das in deinem Kopf passiert. Dazu haben wir eine Großhirnrinde, mit der können wir uns Dinge vorstellen, die wir nicht sehen können.",
            "start": 3429393,
            "end": 3593705,
            "confidence": 0.7565962962962967,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Schwieriger wird's dann virtuell natürlich, wenn man auf der virtuellen Bühne steht. Da hast du halt weniger Feedback.",
            "start": 3594043,
            "end": 3599231,
            "confidence": 0.7599444444444443,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du kannst dich nicht spüren, wie auf der richtigen Bühne, da hast du recht. Also auf der richtigen Bühne kannst du den Raum fühlen und die Menschen in diesem Raum und sogar so weit, dass deine Hormonproduktion sich dem anpasst. Also nach einem richtig erfolgreichen Vortrag gehst du runter und bist wie im Rausch. Da hast du so viel Oxy und du hast nicht ein Auge gesehen, du hast niemanden angefasst und du bist geflutet mit Dopamin und Oxytocin. Warum? Weil du dich so toll verbunden hast mit diesen ganzen Menschen, die du nicht sehen konntest. Das ist sehr schwer digital, virtuell, da hast du recht. Das passiert nicht unbedingt virtuell. Aber du kannst es über die Großhirnrinde zumindest ansatzweise herstellen. Also darüber, dass du in Kontakt trittst mit den Menschen. Und du die meinst, weil du an sie denkst, weil du sie präsent hast, während du sprichst. Das macht, dass sich Leute angesprochen und gemeint fühlen. Und hast du wieder den One-to-many-Popstar-Effekt. Genauso wie wenn du auf der Bühne stehst und ein Menschen im Kopf hast. Oder zwei, ne? Zwei, die du meinst. Und 400 fühlen sich gemeint. Virtuell genauso. Ich denke an euch beide. Und alle anderen, die jetzt vielleicht ein Clip sehen, könnten sich gemeint fühlen, weil ich da so hingucke und euch halt wirklich meine. der anweisung folge dass man mir gesagt hat du musst immer in den kleinen schwarzen punkt kommen. Weil das gibt auch so einen starren blick also wenn ich dich nicht meine gerade in der webcam dann steht so ein starrer blick der nicht mehr lebendig ist.",
            "start": 3599522,
            "end": 3685177,
            "confidence": 0.7771924528301889,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "All das was du gerade beschrieben hast dass du alles ausschüttest und und und da voll auf. drogen bist auf deinen eigenen drogen sozusagen kann ich wirklich bestätigen ich war mal in griechenland hatte da die ehre in einem alten theater zu sprechen da wo ich dann auch keinen vom publikum gesehen habe da war das auch wirklich so mit so einer die sitzreihe ging so nach oben und mich in so einem alten griechischen theater in tessaloniki und ich muss zugeben nach dem talk in der regel bin ich so einer der trinkt abends nur ein bier ich glaube ich war um 18 uhr im bett ich war im hotel weil ich einfach durch diese ganze meine Körperdroge, die ich dann halt komplett ausgestellt habe. Ich war einfach so müde, ich war so durch. Und ich muss auch zugeben, ich erinnere mich nicht mehr an die halbe Stunde nach dem Talk. Also ich werde mich womit vor Wahrscheinlichkeit unterhalten haben mit irgendwem, der noch Fragen hatte oder sowas. Aber es war dann so ich sag mal runterkommen ja vielleicht also also das.",
            "start": 3685217,
            "end": 3733238,
            "confidence": 0.7378415300546443,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Runterkommen kann sogar wie ein cold turkey sich anfühlen.",
            "start": 3733278,
            "end": 3736201,
            "confidence": 0.7308888888888889,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Was ist ein cold turkey?",
            "start": 3736221,
            "end": 3737002,
            "confidence": 0.6536000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also wenn du wie ein entzug also dass du wirklich dass du auch denkst oh jetzt werde ich gerade ganz traurig und leer und ah jetzt habe ich das Gefühl bin am wasser gebaut wegen was bitte noch mal war doch total toll.",
            "start": 3737042,
            "end": 3748032,
            "confidence": 0.620953488372093,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Warum ist es jetzt vorbei?",
            "start": 3748072,
            "end": 3750414,
            "confidence": 0.699,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, und das Gefühl, das will ich wiederhaben, das will ich wiederhaben. Das gehört in diesen Bereich nicht alles, was du fühlst und denkst. Es gibt ein paar Dinge, die sind einfach nur chemisch. Da passiert einfach was mit den Hormonen in deinem System und du musst nicht alles glauben, was da passiert. Wichtig ist es aber wahrzunehmen. Also zu merken, jetzt fällt das ab. Manchmal kann das so rasant sein, dieser Abfall. Du hast eben noch diesen Rausch gehabt und zack, ist es vorbei. Das ist wie so ein Schock und dann fühlt sich das vielleicht auch wirklich leer an. Und in jedem Fall, das, was du gerade beschrieben hast, ist es wahnsinnig anstrengend. Also, von Theaterpremieren sagt man, das, was im Körper so abgeht, ist ungefähr so hart und belastend wie beim Start einer Mondrakete. Da ist der Körper richtig, richtig am Arbeiten. Und es gibt Menschen, die gehen danach erst recht feiern. Es gibt Menschen, die nachher erst mal schlafen.",
            "start": 3751465,
            "end": 3806183,
            "confidence": 0.7543435582822083,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich habe mal einen Trick gehört, und zwar, wie man eigentlich so einen Vortrag vorbereitet. Und zwar, natürlich weiß man, man muss in zwei Monaten einen Vortrag halten, und man fängt schon zu überlegen. Man spielt im Kopf so ein bisschen die Story durch, man denkt sich aus, okay, was ist meine Key-Message, wie versuche ich nicht zu überziehen und so weiter und so fort. Und ich habe mal irgendwo einen Trick gelesen oder mir erzählt, und zwar, Schreib mal einen Blogpost über das Thema, was du machen möchtest. Du musst den Blogpost gar nicht veröffentlichen, sondern du schreibst das einfach in Prosatext runter, weil wenn du schreibst, dann denkst du darüber viel detaillierter nach und in deinem Blogpost hast du einen roten Faden. Und damit der Blogpost natürlich auch Sinn macht für den Leser und für die Leserinnen. Und wenn der Blogpost dann da ist, dann fange an, den Talk zu machen. Und dann wirklich, ich sag mal, deine Slides nicht als 20 Bullet Points zu haben, sondern als unterstützendes Medium. Und dass du dann auf der Audio-Tonspur den richtigen Content lieferst. Hast du die Theorie schon mal gehört? Oder was hältst du von der Theorie?",
            "start": 3807550,
            "end": 3869221,
            "confidence": 0.7849187817258885,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich kann die erstmal nachvollziehen. Ich kann nachvollziehen, dass ich schreibenderweise in eine Auseinandersetzung mit meinem Thema komme, die, wenn ich einfach nur so vor mich hindenke, da komme ich nicht annähernd in diese Tiefe der Auseinandersetzung. Und gleichzeitig, wer schreibt einen Blogpost und macht sich keine strukturellen Gedanken? Also das ist auch schade, auch das ist Zeitverschwendung. Die Grundidee, sich schreibend etwas zu nähern, finde ich super, aber wenn die Absicht wirklich ist zu sagen, und es sollen Menschen nachher lesen, ich benutze beim Blockpost dieselbe Struktur.",
            "start": 3869882,
            "end": 3904796,
            "confidence": 0.7997500000000002,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das meinte ich ja genau, dass du den Blockpost eigentlich...",
            "start": 3905357,
            "end": 3907677,
            "confidence": 0.6927,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber dann brauchst du den auch nicht. Wollte ich damit sagen. Also, wenn du eh weißt, was du erreichen willst, und wenn du weißt, welche Struktur du benutzen willst, dann kannst du einen Blogpost und den Vortrag schreiben und deinen Vortrag auch als Blogpost rausbringen. Aber du brauchst es nicht füreinander.",
            "start": 3907697,
            "end": 3921763,
            "confidence": 0.7405098039215686,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, du argumentierst also eigentlich, dass es grad, ich sag mal, ein zusätzlicher Schritt ist, den du eigentlich auf, ich sag mal, Effizienzbasis weglassen kannst.",
            "start": 3921803,
            "end": 3929986,
            "confidence": 0.7975999999999998,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau.",
            "start": 3930026,
            "end": 3930666,
            "confidence": 0.378,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vielleicht, ich muss auch zugeben, ich hab's lange gemacht in diesem Vortrag in Griechenland, muss ich zugeben, Es kann natürlich auch sein, dass ich noch nicht genau wusste, worüber ich dann im Detail wirklich, was meine Key-Message ist und dann den Blog-Post nicht als Ausrede genutzt habe, aber als Mittel zur Findung oder ähnliches.",
            "start": 3930686,
            "end": 3946375,
            "confidence": 0.7636666666666665,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau. Und so kann ich es auch verstehen, also quasi, also es gibt so Kreativitätstechniken, die mit kreativem Schreiben zusammenhängen, also dass du dich zum Beispiel jeden Morgen hinsetzt und zu einem bestimmten Thema Sachen schreibst oder überhaupt zu dir und deinem Leben und worüber du gerade so nachdenkst. Drei Seiten schreibst, bummst, und morgen machst du weiter, und morgen machst du weiter, und also immer nur drei Seiten. Das kann man für eine Auseinandersetzung wie die super gut benutzen. Und ob du die nun mit der, also mein Gefühl ist so, also ob du dann da auf dem Blogpost hinarbeitest oder auf dem Vortrag, das ist für mich so, dem kann ich nicht folgen. Dem grundsätzlich sich schriftlich mit Dingen auseinanderzusetzen ist, hat eine andere Tiefe. Und dem kann ich total folgen.",
            "start": 3946395,
            "end": 3983390,
            "confidence": 0.7676315789473684,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, Blockpost meinte ich halt, deswegen sagte ich auch den Zusatz, der muss ja noch niemals veröffentlicht werden. Das geht ja eigentlich in diese kreative Schreibrichtung, so nach dem Motto, dass du deinen Kopf einfach auf Papier bringst und dich dann näherst, drüber iterierst und Co. Aber ja, du hast einen validen Punkt. Eigentlich, wenn du Klarheit hast über die Nachricht, die du vermitteln möchtest, dann bräuchte man den Blockpost mit hoher Wahrscheinlichkeit nicht.",
            "start": 3983728,
            "end": 4007551,
            "confidence": 0.8014459459459458,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und ich würde tatsächlich eher empfehlen, wenn du merkst, du kommst an die Message nicht ran und du weißt nicht so genau, worüber du schreiben sollst, dann such dir lieber jemanden zum Sparren, weil es geht schneller. Also diese Kreativtechniken mit Schreiben, damit die effektiv sind, musst du sehr kontinuierlich an diesen Methoden arbeiten. Dein Hirn muss geprimed sein, diese Prozesse zu durchlaufen, weil erst mal läuft es ins Leere. Du schreibst und blubberst dir einen abschriftlich und das kostet einfach irre viel. Also eine Effizienz ist dabei für mich Nicht unbedingt relevant, ich finde die ziemlich wichtig in dem Zusammenhang. Ich habe früher sehr viel mit diesen Techniken gearbeitet. Und wenn man richtig gut im Training ist, mega Werkzeug. So schnell, so effektiv. Aber du musst es regelmäßig und kontinuierlich machen. Und wenn du es nicht mehr tust, ich tue es nicht mehr, Da seier ich aber rum, wenn ich das probiere, da kommt nix bei raus. Und da hab ich lieber, dass ich mir jemanden schnappe und sag, du, hier, ich hab diese und diese Sache, das sind die und die Leute. Und wenn diejenigen nicht genau wissen, worüber sie mit mir dabei reden sollen, dann benutze ich die. Du kannst mal bitte mit mir zusammen überlegen, wer das genau ist. Also ich hab jetzt im Netz festgestellt und so weiter. Und dann fangen die auch an und man sagen sie, aber ich hab so und so über die rausgefunden. Ah, okay. Und wenn ich weiß, mit wem ich rede, dann entsteht meistens auch relativ schnell ein, wenn ich mir alles wünschen dürfte. Ich hätte gern, dass sie nachher das und das. Und so kann ich mich, glaube ich, zügiger einem Ergebnis nähern.",
            "start": 4008531,
            "end": 4088384,
            "confidence": 0.7334385964912284,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also egal, ob schreibend oder nur so vorbereitend mit einem Sparing-Partner, man überlegt sich die Message auf jeden Fall, entwickelt dann eine Story und probiert, möglichst sicher auf der Bühne zu sein. Und du hast ja auch diese drei Punkte erwähnt von dem, wie heißt der gute Kerl aus Mac... Robert McKee? Genau. Und der letzte Teil war ja die Schlussmessage, was du am Schluss noch mitteilen willst. Also frage ich dich ganz konkret, was würdest du unseren HörerInnen noch mitgeben wollen zum Abschluss?",
            "start": 4088424,
            "end": 4121718,
            "confidence": 0.8127023809523806,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Vorbereitung. Sich die Zeit nehmen, wirklich strategisch darüber nachzudenken, was will ich erreichen, mit wem habe ich es zu tun, und das immer. Wann immer ich vor Leuten stehe, egal wie klein oder groß die Gruppe ist, und auch bei dem einen oder anderen eins zu eins, weil ich selten in ein Gespräch gehe, ohne was erreichen zu wollen, und jedes Mal macht es einen Sinn, sich kurz zu überlegen, was will ich hier erreichen, mit wem habe ich es zu tun, was soll nachher anders sein, welche Emotion ist dafür wichtig, Und wenn man so ein bisschen angefangen hat, so zu trainieren, diese Fragen zu stellen, dann macht das Gehirn ganz von alleine. Ah, du kannst die Geschichte erzählen. Ah, diese Fakten und Daten zahlen darauf ein. Ah, den Podcast muss ich nochmal reinhören, weil da ist was dazu gesagt worden und so weiter. Das machen Gehirne einfach. Also vorher nachdenken kostet nachher weniger Zeit.",
            "start": 4122720,
            "end": 4169743,
            "confidence": 0.8041410256410259,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist so einfach gesagt und wir müssen uns immer wieder daran erinnern. Aber nein, du hast recht und deswegen habe ich dir nochmal zu danken. Vielen lieben Dank, Anna, für diese Stunde reinste Weisheiten und das bringt mich auch wirklich jetzt gerade zum Nachdenken, so nach dem Motto, weil ich habe nächste Woche wieder eine Präsentation und habe ich mich genug vorbereitet? Muss ich nochmal was reinstecken? Welche Punkte habe ich jetzt noch nicht? drin, die du dir erwähnt hast. Vielen lieben Dank, dass du mein Gehirn auf jeden Fall zum Arbeiten gebracht hast. Ich hoffe, von den Hörerinnen und Hörern konnten auch einige Punkte mitgenommen werden.",
            "start": 4170072,
            "end": 4203492,
            "confidence": 0.8065462962962963,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und wer nicht genug hat, der kann natürlich in euren Podcast reinhören, ihn exzellent präsentieren. Ihr habt gerade ganz frisch eine neue Episode veröffentlicht, wo es genau um diese digitale Welt geht, präsentieren in Teams. Aber wie gesagt, es gibt über 100, ich glaube 120 Episoden oder sowas in der Richtung. Also man kann da wirklich tief in die Materie eintauchen und die Evergreen Episoden da alle nachhören.",
            "start": 4203552,
            "end": 4225207,
            "confidence": 0.7979558823529412,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, das wäre auch meine Empfehlung. Wir haben eine Liste mit so Evergreens, wo dann so tagesaktuelle oder Blubber-Sachen rausgefallen sind und nur die Sachen, die auch noch jetzt eine Relevanz haben, in der Liste drin sind.",
            "start": 4225227,
            "end": 4235857,
            "confidence": 0.7397297297297297,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und ich glaube, wer noch mehr Hilfe möchte, ich glaube, dich kann man zu diesen ganzen Themen auch offiziell buchen und Geld ausgeben, ist das richtig?",
            "start": 4236657,
            "end": 4243366,
            "confidence": 0.793576923076923,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Absolut, sehr gerne. Und finden tut man mich dann am einfachsten über LinkedIn.",
            "start": 4243386,
            "end": 4248492,
            "confidence": 0.7788461538461539,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wir verlinken deine ganzen Webseiten natürlich auch und die Projekte. Ich glaube, ihr habt jetzt auch einen neuen Videokurs, der gerade veröffentlicht wurde.",
            "start": 4248737,
            "end": 4256559,
            "confidence": 0.8152608695652173,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, der wurde gerade veröffentlicht. Wir haben einen neuen Videokurs zum Thema Präsentieren in Microsoft Teams. Welche Tricks gibt es da? Und natürlich geht es da ganz viel auch um Strategie und Storytelling. Da gehe ich ein bisschen tiefer auf Robert McGee ein und da kann man sich sozusagen da noch ein bisschen durcharbeiten.",
            "start": 4256599,
            "end": 4273503,
            "confidence": 0.7139259259259261,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Alle Links sind natürlich wie immer unten in den Showns verfügbar. Vielen lieben Dank, Anna. Danke für deine Zeit und ich wünsche dir noch einen schönen Tag.",
            "start": 4274376,
            "end": 4281949,
            "confidence": 0.7648518518518519,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Es war mir ein Vergnügen.",
            "start": 4282329,
            "end": 4283511,
            "confidence": 0.4088,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Tschüss. Tschüss.",
            "start": 4283531,
            "end": 4284953,
            "confidence": 0.38,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Vielen Dank. Ciao.",
            "start": 4285013,
            "end": 4286155,
            "confidence": 0.5506666666666667,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.783717825499326,
    "audio_duration": 4291.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}