{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/ba617374-c9e2-4ccb-9cd5-a90cda8b62a7/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62bousb57j-c750-4a18-ba3c-e5904830e7ce",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zu einer neuen Episode des Engineering Kiosks. Wir besprechen heute, wie wir neue Firmen und Jobs finden, was uns dabei wichtig ist und wie man das vor und während dem Interview herausfinden kann. Und als kleines Extra gibt es viele Traktorengeschichten von Andi.",
            "start": 4378,
            "end": 20502,
            "confidence": 0.8663409090909088,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Neuer Abend, neuer Aufnahmetermin, neue Episode vom Engineering Kiosk. Hallo Wolfgang.",
            "start": 25600,
            "end": 30425,
            "confidence": 0.6671818181818181,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Schönen guten Abend.",
            "start": 30465,
            "end": 31626,
            "confidence": 0.5676666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie geht's dir heute? Wie war deine Woche? Bist du wieder zurück?",
            "start": 31646,
            "end": 35009,
            "confidence": 0.7278333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aktuell wieder in Amsterdam. Keine Berge mehr um mich herum. Darum haben wir jetzt auch wieder Zeit für das Podcast.",
            "start": 35049,
            "end": 41334,
            "confidence": 0.66885,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Schlägt sich also jetzt mehr mit Touristen wieder rum.",
            "start": 41354,
            "end": 43596,
            "confidence": 0.5967777777777777,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 43636,
            "end": 43796,
            "confidence": 0.317,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Letzte Episode war zum Thema One-on-ones und ich hatte das Gefühl, die hat eingeschlagen. Wir haben eine kleine Umfrage auf Reddit gemacht, in einem Subreddit, der nennt sich de-edv.",
            "start": 45044,
            "end": 56691,
            "confidence": 0.8211034482758622,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist, glaube ich, das einzige deutsche Subreddit oder eines der wenigen. Da merkt man schon, wie englisch fokussiert alles ist, vor allem auf Reddit und auch in der Techblase. Aber wir haben dort eine Umfrage gestartet und hatten 640 Votes, also wirklich hammermäßiges Ergebnis. Hätte ich mir nie gedacht, dass wir so viele Rückmeldungen bekommen. Und zwar haben wir einfach gefragt, wer von euch hat in seinem IT-Job regelmäßig 101s Und wir hatten drei Auswahlmöglichkeiten. Einmal nie oder nur Statusupdates, was ja dann meiner Meinung nach keine 101 sind. Zweite Option war ein bis zweimal pro Jahr oder ein bis zweimal pro Monat. Also sehr regelmäßig würde ich sagen. Und wir haben zwei Drittel bei nie oder nur Statusupdates beziehungsweise ein bis zweimal pro Jahr. Ich glaube das ist sogar gesetzlich vorgeschrieben oder so Mitarbeitergespräch einmal im Jahr oder?",
            "start": 58045,
            "end": 109118,
            "confidence": 0.7945428571428569,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich kenne keine deutsche Regelung, die das vorschreibt.",
            "start": 109764,
            "end": 113046,
            "confidence": 0.8481111111111113,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, vielleicht ist es so in Kollektivvereinbarungen in Österreich gibt es die. Ich glaube, ihr habt es in Deutschland ja was ähnliches. Auf jeden Fall 188 Leute von den 639 Votes haben gesagt, ein bis zwei Mal pro Monat, also sprich regelmäßig, alle zwei Wochen. Es ist extrem wenig, meiner Meinung nach. Also ich hätte mir eigentlich nicht gedacht, dass es so wenig ist.",
            "start": 113106,
            "end": 132976,
            "confidence": 0.7450625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin ein bisschen enttäuscht, muss ich zugeben. weil das bedeutet auch dass ungefähr ein drittel nie oder nur status updates hat und das zeigt mir auch dass da noch sehr sehr viel luft nach oben ist meines erachtens nach Das glaube ich auch, ja.",
            "start": 133576,
            "end": 146983,
            "confidence": 0.754066666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und es war auch eine Diskussion mit einigen Kommentaren darunter. Wir verlinken natürlich das Subreddit nochmal gerne, beziehungsweise den Thread im Subreddit. Und was einige gesagt haben und was man auch sonst immer wieder hört, ist, man braucht ja keine 101s, weil man ja sowieso jederzeit mit dem Chef oder mit dem Team sprechen kann. Und wir haben so eine gute Atmosphäre, da kann man jederzeit drüber sprechen.",
            "start": 147003,
            "end": 171889,
            "confidence": 0.8075294117647057,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Immer wenn ich gesagt habe, man kann sich eh jederzeit melden, sprich mich einfach an, die Leute haben es immer auf die lange Bank geschoben, die haben es immer dann zur Seite gelegt, ah nicht jetzt, mach ich gleich, mach ich morgen oder wann auch immer, dann kam es eher seltener zu dem Gespräch.",
            "start": 172333,
            "end": 184881,
            "confidence": 0.788962962962963,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube auch ganz viele Leute haben gar nicht dieses Selbstvertrauen, gerade wenn sie neu in dem Job sind oder vielleicht ein bisschen jünger oder weniger. Erfahrung haben in dem Bereich, dass die dann wirklich zu dem schwer beschäftigten Chef hingehen und sagen, hilf mir mal bitte bei meiner Weiterentwicklung in der Firma oder so. Ich glaube, dass wenige glauben, dass das ein wichtiges Thema ist und dass man da jetzt den Chef stören darf und vielleicht ein Meeting aufsetzen. Also das wäre gut natürlich, wenn das Leute haben. Aber ich habe auch die Erfahrung gemacht, dass das eher funktioniert, wenn man einfach einen fixen Termin im Kalender hat, wo man sich trifft, wo man sich zusammensetzt. Und dann, wenn man schon mal zusammensitzt, dann spricht man auch einfach über Dinge, wo man sonst vielleicht gar nicht drüber sprechen würde oder die man sonst einfach rausschieben würde, weil die sind ja jetzt nicht so wichtig. Und auf Dauer können die dann aber sehr, sehr wichtig werden und das fällt natürlich, wenn man solche Gespräche nicht hat.",
            "start": 185481,
            "end": 236570,
            "confidence": 0.8114829545454547,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hast gerade einen lustigen Punkt angesprochen und zwar der schwer beschäftigte Chef, dass man ihn nicht stören möchte mit seinen Problemen. Wenn du dir das mal auf der Zunge zergehen lässt, ist es ja eigentlich so, er ist dein Vorgesetzter, er möchte, dass du gut performst, das bedeutet also auch, dass ich würde sagen mal, Die Hälfte, wenn nicht sogar mehr, seines Arbeitsalltages müsste sich eigentlich um dich und sein Team drehen. Das bedeutet eigentlich, dass du ihm oder ihr natürlich schon so ein bisschen die Richtung gibst, womit er natürlich auch beschäftigt sein sollte. Wenn er sich natürlich nicht mit dem Team beschäftigt, dann muss ich mich ein bisschen fragen, wie managt denn euer Vorgesetzter euer Team?",
            "start": 236590,
            "end": 278400,
            "confidence": 0.7904453781512603,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube, man muss auch von dem Gedanken wegkommen, dass man seinem Team einfach da irgendwelche Aufgaben gibt und dann wird delivered. Und auch wenn man jetzt jemand im Team ist, dass man einfach sagt, okay, es ist nicht so, dass ich nur deliveren kann und wenn ich eine Frage habe, dann kann ich niemanden fragen oder wenn ich ein Problem habe oder wenn ich mich auch selber weiterentwickeln will. Ich glaube, da muss einfach der Chef oder die Chefin einfach dementsprechend auch da sein und im Idealfall das von sich aus natürlich selber anbieten. Aber wie die Umfrage einfach zeigt, ist das selten der Fall. Und das finde ich sehr schade. Und ich glaube auch, dass solche Aussagen wie, wir haben eine gute Team-Atmosphäre und bei uns wäre das sowieso ständig möglich, aber um dieses Wäre geht es eben nicht genau. Wenn man das nicht wirklich fixiert hat, dann ist es einfach schwierig. Ich glaube, man kann sich das auch so überlegen, wenn man zum Beispiel in seinem Freundeskreis Leute selten trifft, weil man einfach nie was ausmacht. Klar hat man eine gute Atmosphäre, aber wenn man die Leute einfach selten trifft, dann wird die Atmosphäre oder die Beziehung nicht mehr so gut sein. Also man muss da einfach auch regelmäßig mal Leute treffen, um irgendwo eine Freundschaft zum Beispiel aufrechtzuhalten. Und so sehe das im Businessleben halt auch. Man muss daran einfach arbeiten und kann nicht einfach diese ganzen Sachen, die rund um die Technik sind, nicht einfach immer weiter schieben.",
            "start": 278560,
            "end": 356403,
            "confidence": 0.8081220472440944,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich finde so Aussagen, wir brauchen keine One-on-ones, wir haben ja eine gute Beziehung miteinander und ein vertrauensvolles Verhältnis mit dem Team und jeder kennt sich, finde ich immer sehr schwierig, weil diese Aussagen sagen für mich auch nicht aus, ob alle Leute ihr volles Potenzial ausschöpfen.",
            "start": 356423,
            "end": 372231,
            "confidence": 0.7803191489361702,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nur weil, wenn die Chance vorhanden ist, dass man es nutzen könnte oder die Teamatmosphäre das erlaubt, heißt es ja noch lange nicht, dass es alle machen im Team.",
            "start": 372569,
            "end": 381556,
            "confidence": 0.8542758620689656,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich sage nicht immer, dass jeder im Team High Performer sein muss und bis ans Limit gehen muss, das sage ich nicht, aber ich sage auch, dass es, wenn man Sachen anspricht im Job, ich möchte eine Zertifizierung machen oder ähnliches.",
            "start": 381596,
            "end": 393906,
            "confidence": 0.789658536585366,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Warum? Zum Gaia willst du eine Zertifizierung machen? Macht man das heutzutage noch? Ich habe gedacht, das ist nur so etwas Amerikanisches.",
            "start": 393946,
            "end": 400731,
            "confidence": 0.6150000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, also wenn man aus dem Agenturumfeld ist, ist sowas recht wichtig, dass du so und so viele Entwickler mit einer Zertifizierung in der Programmiersprache hast. Damals, 2013, war das noch recht wichtig, dass du zum Beispiel eine PHP-Zertifizierung von SEND hattest, damit du zum Beispiel Webseitenprojekte von irgendwelchen Behörden machen konntest.",
            "start": 401195,
            "end": 420707,
            "confidence": 0.7853846153846153,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, also wir driften ab, aber wenn wir zurückkommen in Zertifizierungen, wenn man Zertifizierungen machen will, du kannst dich sicher noch erinnern, was für einen Punkt du machen wolltest, Andi?",
            "start": 420727,
            "end": 429933,
            "confidence": 0.6907000000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nur wenn das Vertrauensverhältnis im Team gut ist, heißt das nicht, dass jeder wirklich das erreicht oder den Support von seinem Arbeitgeber oder von seiner Vorgesetzten bekommt, den er bekommen könnte. Und Zertifizierung ist nur ein Beispiel, ein Konferenzbesuch ist ein anderes Beispiel. Oder ihr wollt ein Fachbuch lesen, 30, 40 Euro von einem Fachbuch, also da sagen die meisten Chefs nicht nein und bestellen euch das über Firmenkosten, weil im Endeffekt ist das Weiterbildung für euch. Das sind so kleine Dinge, wo ich denke, das Vertrauensverhältnis im Team, da bin ich mir nicht ganz sicher, ob es dann immer zu diesem Punkt kommt.",
            "start": 430765,
            "end": 469819,
            "confidence": 0.7878749999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oder auch so ganz klassisch kleinere Probleme, wo man einfach irgendwo im Team Probleme sieht oder vielleicht ein Problem mit einer Person hat und man weiß nicht weiter, dann ist es meistens nicht so eklatant, dass man wirklich sagt, okay, mache jetzt ein Meeting aus oder ich gehe jetzt zu meiner Chefin und frage, wie könnte ich denn das lösen? Ich brauche da vielleicht ein paar Tipps. Das machen die wenigsten und wenn man halt fixen Termin hat, dann kann man einfach sagen, okay, ich habe dieses Problem mit meiner Kollegin im Team und irgendwie haben wir da ein Kommunikationsproblem. Hast du vielleicht ein paar Tipps, wie das angehen könnte? Also solche Dinge sind, glaube ich, einfach extrem wichtig und die passieren sonst nicht. Also Da würde ich auch nochmal wirklich probieren, sowas zu etablieren im Team, wenn es möglich ist, oder einmal den Chef fragen oder vielleicht auch darauf hinweisen, könnte man nicht einmal One-on-ones machen, weil ich glaube, dass die wirklich extrem zielführend sind und einem viel bringen.",
            "start": 470168,
            "end": 522631,
            "confidence": 0.7656235294117644,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, kommen wir nochmal zurück zur Reddit-Umfrage. Ich habe gerade mal die Prozentzahl ausgerechnet. Also 199 Leute stimmen, das sind 31% von der Umfrage. 31% haben keine One-on-ones und oder nur Status-Updates. Jetzt redest du die ganze Zeit von One-on-ones und dass die wichtig sind. Wenn du dir jetzt einen neuen Arbeitgeber suchen würdest, ist das ein K.O.-Kriterium für dich? Wie wichtig sind diese für dich, Wolfgang?",
            "start": 522993,
            "end": 546760,
            "confidence": 0.7327761194029854,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube, es wäre jetzt kein K.O.-Kriterium, aber meiner Meinung nach zeigt es auch, wie weit eine Firma schon ist. Da reden wir jetzt nicht über ein Mini-Startup mit zehn Leuten, aber wenn eine Firma eine gewisse Größe erreicht hat, dann erwarte man auch, dass sie sich vielleicht über solche Dinge schon mal Gedanken gemacht hat oder vielleicht auch HR-Leute dafür hat oder die Leads, wenn sie gut sind, sich schon mal Gedanken darüber gemacht haben. Und wenn ich dann im Interview zum Beispiel so eine Frage stelle, ob es sowas gibt oder wie die Zusammenarbeit ist zum Beispiel, da sieht man dann schon, wie professionell einfach jemand ist, also sei es jetzt der Lead oder die Firma an sich. Und ich glaube, das wäre für mich schon ausschlaggebend, um festzustellen, wie weit ist eine Firma eigentlich schon in diesem Prozess, sind die dann dort schon angelangt, dass das in der Struktur irgendwo Fuß gefasst hat und dass es da One-on-ones zum Beispiel gibt oder auch andere Prozesse. Und so könnte ich für mich zumindest feststellen, ist die Firma schon so weit, wenn ich in so einem Umfeld arbeiten möchte, ist die Firma schon so weit, dass das für mich okay ist. Wenn ich jetzt in ein Startup gehen würde, wäre das sicher anders, da hätte ich glaube ich nicht die gleichen Voraussetzungen, weil wenn es ein kleines, junges Unternehmen ist, dann gehe ich nicht davon aus, dass die schon solche Gedanken gemacht haben und da Strukturen implementiert haben. Wäre natürlich auch cool, aber würde ich mir jetzt ehrlich gesagt nie erwarten.",
            "start": 547040,
            "end": 629463,
            "confidence": 0.7827262357414447,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nach der nach der Folge hatten wir auch genau diese Diskussion und ich verstehe sie eigentlich nicht. Ich weiß gar nicht. Du hast das gerade auch angesprochen. Wenn du eine Firma hast mit zehn Personen, dann sagst du Okay, vielleicht gibt's da noch keine. Aber das macht die ja nicht unwichtiger. Und in meiner meiner Ansicht nach nicht an der Anzahl der Mitarbeiter, die eine Firma hatte. Klar, in einer größeren Firma wird das gegebenenfalls mehr Struktur und mehr von der Personalabteilung getrieben. Aber wie wir in letzter Folge ja festgestellt haben, machen wir One-on-ones ja eigentlich recht gleich. Das bedeutet ein wiederholendes Meeting, irgendwie so ein Word-Dokument oder Google-Doc-Dokument und Abfahrt. Und meines Erachtens ist die Anzahl der Mitarbeiter pro Firma kein Kriterium dafür, ob man One-on-ones haben sollte oder nicht.",
            "start": 629896,
            "end": 673348,
            "confidence": 0.7670075757575756,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da gebe dir da gebe dir vollkommen recht also das sollte eigentlich kein unterschied sein und 101 sind wichtig aber ich würde mir vielleicht von einer kleineren firma das nicht erwarten dass es da strukturen schon gibt die festgeschrieben sind dass man sowas machen sollte dass es da vielleicht prozesse gibt wenn das erfahrene leute sind und ich glaube da sieht man halt auch ist ein lied erfahren oder nicht dass er solche strukturen hat man muss natürlich auch Dazu sagen, es kann natürlich auch ein Lead unter Umständen, gerade wenn er jetzt weniger Erfahrung hat in internationalen größeren Firmen, dass er diese Begrifflichkeiten gar nicht kennt, aber trotzdem ähnliche Strukturen hat in seinem Team zum Beispiel. Also da muss man dann natürlich auch checken, okay, macht er sowas und nennt es vielleicht nicht 101, sondern eben Schufix Mitarbeitergespräch oder sonstige Dinge oder wir treffen uns zum Kaffee einmal die Woche.",
            "start": 673593,
            "end": 720630,
            "confidence": 0.8042913907284766,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, jetzt hast du gesagt, okay, das könnte, gegebenenfalls ist das von der Firma nicht strukturiert vorgegeben, aber vielleicht hat der Lead Erfahrung. Und wie findest du heraus, ob der Lead Erfahrung hat? Also ich meine, liest du das zwischen den Zeilen, wenn du mit dem sprichst oder mit ihr sprichst oder was ist so deine Strategie?",
            "start": 721058,
            "end": 736427,
            "confidence": 0.7268421052631578,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich würde grundsätzlich mal fragen, wie einfach die Arbeit gemacht wird, wie man zusammenarbeitet im Team, was es da für Meetings gibt, gibt es da Strukturen? Da spielen ja dann auch so Sachen wie Scrum und so weiter eine Rolle. Also wie ist einfach die Zusammenarbeit zwischen allen Beteiligten? Was ist die Aufgabe von dem Lead? Ich glaube, auch da kann man fragen, wie viele Leute hat der Lead überhaupt und wie ist sein Engagement im Team oder was macht er im Team? Ich habe ja zum Beispiel mal so ein Riesenteam gehabt oder viel zu viele Leute und eigentlich war mein Hauptteil dann One-on-ones oder mit den Leuten reden. Also ich war dann natürlich absolut nicht mehr in der Technik involviert und das würde ich dann natürlich als Antwort auch sagen, dass ich zum Beispiel im Tagesgeschäft nicht mehr involviert bin, sondern mehr auf dieser One-on-one Ebene im Coaching-Bereich. Und wenn es was technisches gibt, bin ich natürlich da, aber primär ist das meine Aufgabe. Und solche Sachen helfen halt einem dann einfach, die Firma einzuschätzen, wie die jeweiligen Leute zusammenarbeiten. Ich glaube, das ist wichtig und das kann man auch in einem Interview fragen und sollte man vielleicht auch fragen, wenn einem das wichtig ist.",
            "start": 737296,
            "end": 803591,
            "confidence": 0.8048173076923077,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du fragst also in Interviews, welche Meetings und Teammeetings sie haben?",
            "start": 804011,
            "end": 809012,
            "confidence": 0.49354545454545456,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du nie die Frage bekommen in einem Interview?",
            "start": 809052,
            "end": 810972,
            "confidence": 0.665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe die Frage nie gestellt, nee.",
            "start": 811502,
            "end": 813543,
            "confidence": 0.837,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und als Lied auch nie bekommen.",
            "start": 813583,
            "end": 815264,
            "confidence": 0.7805,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Glaube nicht, nee. Also ich meine, was erwartest du dir dann hier so ab? Provokativ-Meeting, Daily-Stand-Up oder was ist denn eine coole und was ist denn eine schlechte Antwort jetzt auf diese Frage?",
            "start": 815284,
            "end": 825048,
            "confidence": 0.6540606060606061,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, es gibt nicht immer coole und schlechte Antworten. Aber was ich definitiv gefragt worden bin, wie ist denn die Zusammenarbeit im Team?",
            "start": 826088,
            "end": 833852,
            "confidence": 0.7613749999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist ja was anderes, als welche Meetings habt ihr denn?",
            "start": 833872,
            "end": 836533,
            "confidence": 0.6644545454545455,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, aber das geht in die Richtung, weil wenn man dann sagt, okay, man arbeitet zusammen in Scrum, man hat D&D-Meetings oder man hat irgendwie Retrospectives oder teilweise bekommt man dann die Frage, okay, habt ihr denn auch Retrospectives oder wie ist unsere Zusammenarbeit, wie arbeiten wir da täglich zusammen? Weil es geht ja auch darum, hast du so einen Micro-Manager zum Beispiel, der dir täglich deine Aufgaben gibt und dir vorgibt, wie deine Klassen zu benennen sind oder ob dir gewisse Freiheiten gibt, der Lead. Und ich glaube, solche Sachen sind einfach wichtig, dass man die nachfragt. Das ist nicht, dass ich jetzt zehn Einzelfragen stelle, wie schaut das aus, wie schaut das aus, wie schaut das aus, aber in einem offenen Gespräch einfach am Ende vom Interview, wie ist denn die Zusammenarbeit, kann man da schon so ein paar Fragen einwerfen, wenn man sie nicht eh automatisch raushört.",
            "start": 836760,
            "end": 879160,
            "confidence": 0.7443066666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja okay, wenn man die Frage halt deutlich oberflächlicher stellt, dann ist das natürlich, dann ist die Antwort natürlich auch komplett offen und kann in jede Richtung gehen.",
            "start": 879881,
            "end": 888990,
            "confidence": 0.7576428571428572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und man kann auch solche Sachen fragen, wie sind denn die Weiterentwicklungsmöglichkeiten in der Firma? Was wird denn getan für Weiterentwicklung? Was gibt es da in diesem Bereich? Und da findet man dann auch recht schnell raus. Bei vielen Firmen gibt es einen Coach zum Beispiel oder so eine Vertrauensperson, die auch coacht oder solche Seniors oder sowas wird es ja teilweise genannt, die dann halt in irgendeiner Form Coaching machen. Da weiß man dann natürlich auch schon, dass das in der Firma wichtig ist und dass es da Möglichkeiten gibt und ich glaube das zeichnet dann schon die Firma auch aus.",
            "start": 889545,
            "end": 920777,
            "confidence": 0.7963529411764705,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, die Frage habe ich öfters bekommen, welche Weiterentwicklungsmöglichkeiten gibt es aber.",
            "start": 921679,
            "end": 925103,
            "confidence": 0.6294166666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du da mal geantwortet, ich entwickle dich weiter in One-on-ones?",
            "start": 925891,
            "end": 929412,
            "confidence": 0.7432727272727273,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, deswegen grinse ich gerade so ein bisschen. Ich habe nie One-on-ones auf diese Frage gegeben. Warum, kann ich mir jetzt gerade selbst nicht beantworten. Standardantwort war immer, klar, halt die Benefits, die man so hat. Konferenzbudgets, interne Weiterentwicklung, Leadership-Programme und so weiter und so fort. Also all das, was die Firma dann halt dann immer als Benefits auch hat.",
            "start": 929432,
            "end": 953678,
            "confidence": 0.7204333333333337,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also, was ich hin und wieder schon gesagt habe, ist, dass wir eben einfach nicht so eng zusammenarbeiten, dass das ja sehr selbstständiges Arbeiten zum Beispiel ist, weil es eben so ein großes Team war von über 20 Leuten und wir uns dann halt einfach regelmäßig einmal wöchentlich zusammensetzen und dann Dinge besprechen. Also, da habe ich es über Umwegen natürlich sozusagen erwähnt. Aber es stimmt schon, eigentlich sollte man bei Weiterentwicklung 101 vielleicht genauso erwähnen, weil so eine Coaching-Session, wenn man das extern bucht, kann es auch ziemlich teuer sein.",
            "start": 954852,
            "end": 983852,
            "confidence": 0.7617912087912089,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vielleicht hatte ich da einfach mal so Pferdeklappen auf und hab das einfach nur als Standard in der Industrie gesehen. Aber wie mir diese Reddit-Umfrage zeigt, war ich in meiner Bubble. Danke, Reddit.",
            "start": 984477,
            "end": 996788,
            "confidence": 0.8533333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt, Andi, du hast ja gerade einen neuen Job und hast eben auch neue Jobs gesucht davor. Gehe mal davon aus, dass dir nicht jemand deinen Arbeitsvertrag vor die Tür gelegt hat, ohne dass du Bescheid wusstest. War dir das wichtig, wie du neue Firmen gesucht hast? Hast du auf sowas geschaut oder hast du angenommen, das muss sowieso bestehen?",
            "start": 996809,
            "end": 1016162,
            "confidence": 0.7512500000000004,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe es angenommen, dass es fast überall gang und gäbe ist. Und wenn es nicht in der neuen Firma wäre, hätte ich es eingeführt mit meinem Vorgesetzten. Weil ich denke, diese Art von One-on-One zum Beispiel oder Konferenzbudgets oder Lehrgänge oder Zertifizierung oder ähnliches, das sind meines Erachtens nach Kleine schrauben und einfache dinge die man in der firma ändern kann ja das ist so du endest ja keine riesen prozesse sondern du entwickelst deine mitarbeiter weiter und wenn die sich wirklich, wenn die die wertschätzung fühlen dann bleiben die auch länger und du qualifizierst sie auch besser also ich meine ich bin jetzt engineering manager im bereich reliability engineering das bedeutet, Ich würde ja jetzt kein kein keine weiterentwicklung zum sternekoch machen also und das von der firma bezahlen lassen also dass die art von von trainings und ähnliches die ich dann natürlich anfragen würde wären schon in irgendeiner art und weise für meinen job. Und könnte ich dann auch im täglichen Doing mehr oder weniger anwenden, ja?",
            "start": 1016903,
            "end": 1076412,
            "confidence": 0.7998647058823528,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist sicher ein guter Punkt, dass man da einiges ändern kann. Und gerade solche Dinge sind ja sehr, sehr einfach zu ändern, wie du richtig gesagt hast. Das ist ein Meeting, das man da vielleicht einführt. Und wenn man da eine flexible Person hat gegenüber, sollte das eigentlich kein Problem sein. Man muss halt vielleicht rausfinden, ist die Person gegenüber flexibel oder gibt es da eine Grundeinstellung? Weil es gibt auch so Leute, die die Einstellung einfach haben, wir zahlen da ja Gehalt, also mach gefälligst, es muss reichen. Solche Leute, sowas musst du halt davor rausfinden. Ich glaube, so eine Grundtendenz findet man im Interview hoffentlich raus. Aber ich bleibe jetzt auf dieser Frage oben sitzen. Du bist jetzt wieder ausgewichen. Wie hast du denn die Firma gefunden? Also wie bist du vorgegangen? Ich will jetzt deinen strukturierten Approach haben, dein Excel-Sheet, wo du alle Firmen abgearbeitet hast und bewertet hast.",
            "start": 1076452,
            "end": 1123350,
            "confidence": 0.7808300653594772,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bei der Firma, bei der ich jetzt gelandet bin, da wurde ich via Active Sourcing angeschrieben. Das bedeutet, Inhouse-Rekruter haben mich angeschrieben.",
            "start": 1123370,
            "end": 1131156,
            "confidence": 0.7872727272727272,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "War das die einzige Firma oder hast du mehrere?",
            "start": 1131196,
            "end": 1133218,
            "confidence": 0.6932222222222222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee die ganze story ist ein bisschen anders und zwar habe ich am anfang also die ganze interview zeit ging so circa ein jahr lang. Das hört sich total lang an ist auch lang und am anfang wollte ich gar nicht irgendwie weg von trivago sondern ich wollte eigentlich nur mal wieder ein paar interviews führen um mal zu gucken okay wie ist denn der markt so und wie ist wie fühlt sich es an mal wieder auf der anderen seite vom tisch zu sitzen. Also habe ich einfach mal angefangen, dem einen oder anderen Recruiter, der mich angeschrieben hat, zu antworten. Das waren alles Firmen, wo ich jetzt eigentlich vom Anschreiben her sagen würde, okay, das ist jetzt vielleicht nicht der Arbeitsplatz, den ich gerne machen würde. Also ziemlich viele JavaScript-Jobs dabei, PHP, teilweise ein Großkonzern. Also irgendwas hat da immer nicht gepasst. Auf jeden Fall habe ich dann trotzdem mal hier und da die Interviews gemacht.",
            "start": 1134006,
            "end": 1183837,
            "confidence": 0.7891582278481015,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Pei, wäre das ja ideal JavaScript, dass du mal eine ordentliche Sprache lernst. Aber okay, du hast trotzdem die Interviews gemacht, ja?",
            "start": 1184753,
            "end": 1191173,
            "confidence": 0.6494545454545454,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, primär mit dem Interesse, dass ich halt mal ein bisschen sicherer werde in der Beantwortung von Fragen. Wo siehst du dich in fünf Jahren? Warum möchtest du die Stelle wechseln? Wie sieht dein perfekter Arbeitsalltag aus? Was erwartest du von der Firma, von deinem Vorgesetzten?",
            "start": 1191870,
            "end": 1211774,
            "confidence": 0.8044565217391306,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "101 zum Beispiel.",
            "start": 1211784,
            "end": 1213835,
            "confidence": 0.5453333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, 101 wäre eine mögliche Antwort. Und genau, so hat sich das halt so mal hier und da entwickelt. Und dann habe ich mal zum Beispiel den ein oder anderen Take-Home-Test bekommen. War auch mal ganz interessant, wie andere Leute Coding-Skills evaluieren. Und ich muss zugeben, da wollte ich es mir auch ein bisschen selbst beweisen. Ja, kann ich es noch? Dann habe ich den gemacht.",
            "start": 1213975,
            "end": 1233167,
            "confidence": 0.741712121212121,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie waren die Rückmeldungen? Bist du überall weitergekommen oder hast du auch mal Probleme gehabt?",
            "start": 1233828,
            "end": 1239812,
            "confidence": 0.6566666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe auch Probleme gehabt und ich habe Absagen bekommen und das hat mir mal wieder die Augen geöffnet weil am Anfang habe ich gedacht ey cool ich bin da ne bin da ne coole Sau ist es hier walk in the park. Ich gehe da jetzt so durch und danach habe ich auch Absagen bekommen und natürlich erfährst du nie den wirklichen Grund, warum, weil das ist ja in Deutschland ein bisschen schwierig. Aber das hat mir ein bisschen die Augen geöffnet, dass es halt nicht so einfach ist. Und das ist natürlich auch mal wieder, am Anfang war ich ein bisschen bedrückt, aber nach einem Tag fand ich es eigentlich sehr positiv.",
            "start": 1240386,
            "end": 1272380,
            "confidence": 0.7531842105263156,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Inwiefern positiv? Wenn man abgelehnt wird, wie kann man da positiv gestimmt dann sein?",
            "start": 1272400,
            "end": 1276683,
            "confidence": 0.7344285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja also das war ja jetzt wie gesagt die interviews habe ich ja primär für den trainings weg gemacht aber es zeigt mir auch okay ja vielleicht bin ich einfach auch nicht so gut ja vielleicht hatte ich eine falsche selbst einschätzung von mir einfach mal ein bisschen wieder auf den boden kommen und das finde ich sehr positiv.",
            "start": 1277110,
            "end": 1297467,
            "confidence": 0.7782542372881358,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei man dazu sagen muss, es gibt so viele Gründe, warum man abgelehnt wird. Also ich glaube, man darf das auch nicht immer auf sich selber beziehen, weil es muss halt einfach stimmen. Es muss die richtige Position sein, es muss der richtige Chef sein, es muss der richtige Zeitpunkt sein, man muss gut drauf sein, es muss halt alles stimmen. Es kann sein, dass man abgelehnt wird und ein halbes Jahr später bei derselben Firma angenommen wird. Also das kann sehr gut sein, weil es halt einfach andere Leute sind, anderes Team, anderer Schwerpunkt vielleicht. Die Firmen finden einen vielleicht sogar super, aber sie suchen halt einfach ein bisschen was anderes oder in einer anderen Richtung. Also man darf sich da auch überhaupt nicht einschüchtern lassen, glaube ich.",
            "start": 1297707,
            "end": 1335746,
            "confidence": 0.7965503875968992,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es hat auf jeden Fall ein bisschen Selbstreflexion getriggert, was sehr positiv war, auch für die zukünftigen Interviews. Und auf der anderen Seite muss man natürlich auch sagen, Interviews zu machen ist auch eine ganze Menge Glück. Mit wem sprichst du da? Wie ist deine Tagesform? Wenn du schlecht geschlafen hast oder gerade Streit hattest mit deiner Partnerin oder mit deinem Partner, dann bist du ganz anders drauf, dann kannst du dich nicht konzentrieren. Und das weiß der andere in der Regel nicht. Wenn du jetzt jemanden gegenüber sitzen hast, der sein zweites Interview gerade macht, der völlig untrainiert ist, und dann noch in dem Glauben ist, okay, ich frage jetzt nur genau das ab, was ich auch weiß, und wenn die andere Person das nicht weiß, dann lass ich den durchfallen. Das ist halt eine reine Glückssache, wer da sitzt. Und das bedeutet natürlich dann auch, Auch wenn du eine Absage kriegst, heißt das nicht, dass du schlecht im Interview performt hast. Natürlich ist ein guter Interviewprozess über mehrere Personen verteilt und da gibt es dann sehr erfahrene Leute, die ein Vetorecht haben und so weiter und so fort. Und wenn man sogar strukturierte Interviews führt, dann sind die sogar über Kandidaten hinweg vergleichbar. Aber da geht es dann schon in größere Firmen, die sich sehr tief damit auseinandersetzen und einen sehr strukturierten Interviewprozess haben.",
            "start": 1336052,
            "end": 1411191,
            "confidence": 0.7976681415929203,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das ist übrigens auch ein sehr guter Punkt. Man kann auch beim Interviewprozess schon sehen, wie strukturiert eine Firma ist oder wie gut eine Firma aufgestellt ist. Und ich glaube, das ist auch ein wichtiger Punkt, den ihr jetzt sicher betrachten würdet, wenn da absolutes Chaos herrscht in dem ganzen Prozess mit den Interviews, mit den Terminen zum Beispiel und wie die Leads drauf sind und so weiter. Also wenn ich da irgendwie spüre, das ist absolutes Chaos, dann muss ich mir vielleicht auch überlegen, ist das der richtige Arbeitsplatz, kann ich mit dem Chaos umgehen, weil wenn der in dem ganzen Recruiting-Prozess drin ist, dann ist er höchstwahrscheinlich auch im Rest der Firma irgendwo präsent. Und ich glaube, das ist ein Punkt, den man sich auch vielleicht mitnehmen kann, aus dem ganzen Prozess ist die Firma was für mich.",
            "start": 1411644,
            "end": 1453790,
            "confidence": 0.77706338028169,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Beim Interviewprozess habe ich dann aber auf jeden Fall die Chance auch genutzt ein bisschen was über die anderen Firmen zu erfragen, wie machen die irgendwas, welche Technologien nutzen die ein, welche größte Herausforderung haben die gerade, wie sieht die Engineering Kultur bei denen aus und so weiter und so fort.",
            "start": 1454065,
            "end": 1467696,
            "confidence": 0.7914509803921568,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also das war eigentlich nur Wirtschaftsspionage.",
            "start": 1467736,
            "end": 1469157,
            "confidence": 0.4585000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein das jetzt nicht aber es war mal interessant zu sehen okay was machen andere so und ich meine diese art von von interviews kann man ja auch dafür nutzen um mal zu gucken okay macht man in der eigenen firma in der man da gerade arbeitet immer noch das richtige ist man auf dem richtigen track oder hängt man schon wieder hinten dran. Naja, wie dem auch sei. Nach einer Zeit hab ich dann irgendwann gesagt, hey cool, jetzt hab ich mir so ein paar Traininginterviews gemacht und ich hab auch ein paar Angebote gekriegt, die hab ich dann aber dankend abgelehnt, weil irgendwas wirklich nicht gepasst hat. Entweder war das so eine Sache, die waren in Hamburg und die wollten dann halt, dass man drei Tage vor Ort ist und ich wohne halt nicht in Hamburg.",
            "start": 1469517,
            "end": 1508445,
            "confidence": 0.7592391304347824,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wäre eine sehr schöne Stadt, Andi. Wäre eine Chance gewesen. Das ist eine Chance, sehen sollen, mal endlich aus diesem Ruhrpott rauszukommen.",
            "start": 1508465,
            "end": 1515087,
            "confidence": 0.6915,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hab ja schon mal gesagt, Duisburg muss man wollen und ich will Duisburg, verstehst du? Ja. Weißt du eigentlich, was ein, mach mal ein bisschen Völkerverständigung, mal zwischendurch. Weißt du, was ein Motec ist?",
            "start": 1515574,
            "end": 1526503,
            "confidence": 0.6709142857142856,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ein was?",
            "start": 1526543,
            "end": 1527324,
            "confidence": 0.8345,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ein Motec.",
            "start": 1527364,
            "end": 1528765,
            "confidence": 0.7045,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich kenn nur ein Rattrack.",
            "start": 1528805,
            "end": 1530686,
            "confidence": 0.5896000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ein Motec ist ein Hammer. Gib mir mal den Motec.",
            "start": 1530746,
            "end": 1533188,
            "confidence": 0.6237,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay. Rattrack ist dafür ein Pistengerät.",
            "start": 1533248,
            "end": 1536731,
            "confidence": 0.6291666666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Pistenraupe.",
            "start": 1536771,
            "end": 1537312,
            "confidence": 0.477,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ein was? Rattrack. Eine Pistenraupe, die den Schnee glattpresst.",
            "start": 1537352,
            "end": 1541495,
            "confidence": 0.6864444444444443,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Na gut, so was haben wir hier auf dem Flachland nicht. Na ja, Interviews. Irgendwann hab ich dann mal angefangen, okay, meinen Lebenslauf hatte ich ja already. Dann hab ich mich mal bei Firmen beworben, wo ich sag, da hab ich Interesse dran an der Industrie.",
            "start": 1541819,
            "end": 1556926,
            "confidence": 0.6540434782608695,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie bist du denn auf die Firmen dann überhaupt gekommen? Wenn du sagst, okay, Firmen, auf die stehe ich voll. Wie kommst du zu diesen Firmen? Hast du da eine Liste an Firmen ständig bereit? Oder wie machst du das?",
            "start": 1556946,
            "end": 1566850,
            "confidence": 0.6912499999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee für die für die eine firma von der ich jetzt spreche das war da war ein bisschen research notwendig und zwar ist die story gefolgt ich mag große landmaschinen traktoren mähdrescher und so weiter das finde ich richtig geil und irgendwann habe ich mal auf hacker news eine meldung gesehen dass john deere das ist ein amerikanischer trecker hersteller und landmaschinen hersteller.",
            "start": 1567637,
            "end": 1586702,
            "confidence": 0.7398253968253969,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und der jetzt Panzer neuerdings abschleppt?",
            "start": 1586822,
            "end": 1588663,
            "confidence": 0.4038333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, lernt man auf Twitter. Auf jeden Fall hat John Deere den Bauern verboten, das Recht auf eigene Reparaturen durchzuführen, weil die großen Maschinen so viel Technik drin haben, dass eine falsche Reparatur lebensgefährlich sein kann. Also wenn da jetzt irgendein Bauer, der kein technisches Verständnis hat, einen Mähdrescher rumfuhr, dann erlischt wohl die Garantie von einem John Deere. Weil wenn ein Mähdrescher halt steil geht, dann den kriegst du halt auch nicht so schnell gestoppt.",
            "start": 1589124,
            "end": 1615885,
            "confidence": 0.7487631578947367,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man könnte ja sagen die wollen einfach mehr geld verdienen aber ich lasse dir mal deine geschichte ja.",
            "start": 1616425,
            "end": 1619748,
            "confidence": 0.5439999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So auf jeden fall habe ich dann mal ein bisschen recherchiert wer stellt eigentlich trecker her und wer schreibt eigentlich die software für die ganzen trecker mähdrescher und so weiter und so fort und dann bin ich, auf folgendes gestoßen dass es eigentlich nur zwei firmen weltweit gibt die die software für diese ganzen großen landmaschinen machen die eine sitzt in amerika und die andere sitzt in china, Und irgendwie musst du amerikanischer staatsbürger oder chinesischer staatsbürger sein um halt an dieser software mit entwickeln zu können ich das aber schade. Dann habe ich mir geguckt okay wo sind denn die produktionsstätten von diesen ganzen trickern und mähdreschern leider auch nicht hier in der gegend und dann bin ich auf einen hersteller gestoßen der nennt sich class der sitzt oben bei bielefeld. Und dann war ich im Zoo, guck rechts ins Löwengehege und dann steht da ein Glasradlader. Ich sag so, das kann doch nicht sein. So, super, hab ich mich da beworben, hatte auch ein Interview mit denen und die haben Infrastruktur technisch auch ziemlich heißen Scheiß gemacht. Also die haben Leute gesucht für deren Infrastruktur, die die Data Science Prozesse und Machine Learnings und so weiter skalieren. Die machen ziemlich harten Kram da, also wirklich so mit Kafka.",
            "start": 1620429,
            "end": 1687927,
            "confidence": 0.7877523809523812,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was verwenden die das?",
            "start": 1688047,
            "end": 1688927,
            "confidence": 0.62925,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die analysieren die ganzen Daten von den Maschinen, um vorausschauend, okay, da wird eine Reparatur fällig und so weiter.",
            "start": 1689808,
            "end": 1697971,
            "confidence": 0.8094736842105263,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Predictive Maintenance.",
            "start": 1698011,
            "end": 1699432,
            "confidence": 0.5880000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, genau. Das ist einer der Haupt-Use-Cases im Agrartech-Bereich, wenn es um Data Science in Landmaschinen geht. Auf jeden Fall haben die jemanden gesucht, der die Infrastruktur umhält. Die machen ziemlich heißen Kram schon. Die haben Kafka im Einsatz und Kubernetes und so weiter und so fort. Und naja, auf jeden Fall hat es dann am Ende nicht gepasst, weil ja, kulturtechnisch haben mir da ein paar Sachen nicht so gefallen. Und ich glaube, wir sind auch so nicht zusammengekommen, weil die konstant jemanden im Büro haben wollten zu dieser Zeitpunkt.",
            "start": 1699452,
            "end": 1727348,
            "confidence": 0.7787802197802196,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, also das heißt, ich schaue mal einfach, welche Industrien interessieren mich persönlich, oder? Wo habe ich Spaß dran? Wo könnt ihr da was verbinden zwischen IT und der eigentlichen Industrie, wenn ich die richtig verstehe?",
            "start": 1727368,
            "end": 1740338,
            "confidence": 0.73475,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ein ganz guter tipp ist okay für welches themenfeld hast du denn hast du denn interesse also was was interessiert dich so also ich gucke jetzt hier raus aus dem fenster und da gucke ich auf ganz viele felder, ich finde halt einfach landmaschinen geil ich finde wenn man wenn man was fällt geht finde ich einfach wow wow ja kann ich mir die ganzen tag neben stelle wie so ein dreijähriger jung. Wenn du halt gerne gerne sport machst ja dann zum beispiel irgendwie ausdauersport triathlon warum watscht man nicht mal mit mica timing mica timing ist einer der größten firmen für zeitmessung auf sport events ja die haben auch eine riesen maschinerie und software dahinter oder wenn man ja wenn man im bereich klettersport ist wolfgang jetzt.",
            "start": 1741247,
            "end": 1782862,
            "confidence": 0.7575193798449612,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bist du gefragt Keine Ahnung, ob es da große IT im Hintergrund gibt, aber es gibt sicher auch große Firmen oder es gibt E-Commerce in der Kletterbranche oder Outdoor-Branche. Es ist sehr groß im E-Commerce-Bereich. Könnte man vielleicht auch irgendwas dazu finden.",
            "start": 1782902,
            "end": 1798791,
            "confidence": 0.7749285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hab halt was gesucht, wo ich wirklich für ein Themenfeld, wo ich Passion für hab. Und dann hab ich halt Agrartech, so nennt sich die Szenerie. Und da bin ich mit dem Offensichtlichen gestartet. Was ich aber eigentlich gesucht hab, waren so die kleinen Hidden Champions. Wenn man über Agrartech spricht, dann hat man in der Regel nicht Predictive Maintenance im Sinn, sondern ... selbstfahrende trekker oder iot in gewächshäusern oder ähnliches und jetzt ist die frage wie findet man diese firmen und da habe ich noch eine lustige story und zwar bin ich in dem club. Und wir waren auf kegeltour und ein paar jungs von uns sind zum rewe gelaufen also wir hatten irgendwie so ein airbnb und dann mal ein wochenende da.",
            "start": 1799191,
            "end": 1840272,
            "confidence": 0.7718492063492065,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ein bisschen also kegelt kegeltour heißt man geht fahrt irgendwo anders hin zum saufen seht es richtig kegelt man da auch oder.",
            "start": 1840312,
            "end": 1846457,
            "confidence": 0.7514090909090908,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir hatten mal eine ganze zeit lang eine regel dass man auf der kegel tour dass wir da auch eine kegelbahn haben für einen abend ja aber für letzten kegeltour war es nicht der fall.",
            "start": 1847265,
            "end": 1854567,
            "confidence": 0.7585142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay also ihr stellt da neun bierflaschen auf und dann wird gekegelt.",
            "start": 1854887,
            "end": 1857828,
            "confidence": 0.6305833333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ne ne ne wir gehen da schon in die kneipe und buchen uns da ein ja und naja die die die jungs sind auf jeden fall irgendwie zum rewe oder zum edeka und haben nahrungsmittel geholt und dann kommen die mit einer tracker zeitschrift zurück haben die mir als geck gekauft. So hier an die du stehst immer auf trecker ok, wo hab ich mir die auf der kegeltour ein bisschen durchgeguckt hab mir die eingepackt und zu hause beim frühstück hab ich da mal wirklich durch und da habe ich mir glaube ich zehn firmen rausgeschrieben die wirklich geilen scheiß machen im bereich agrar tech und die sitzen das sind das sind irgendwie vier fünf firmen die sitzen direkt hinter der holländischen grenze die machen wirklich die haben so einen, so so so einen kleinen trecker der fliegt dann schon mal komplett um und und solche geschichten und das sind alles so kleine start-ups die haben gerade ein paar millionen eingesammelt und, bauen jetzt prototypen für wirklich den kannst du mit der fernsteuerung machen mit einer app und du packst ausfeld einmal per gps ausmessen und dann dann fliegt das alleine um.",
            "start": 1857908,
            "end": 1908037,
            "confidence": 0.691554404145078,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und du hättest aber holländischer staatsbürger sein müssen um dort zu arbeiten.",
            "start": 1908077,
            "end": 1911499,
            "confidence": 0.6518333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee nee nee nee nee also ich da habe ich mich jetzt nicht beworben ja ich muss aber zugeben die habe ich mir rausgeschrieben. Ja und die die beobachte ich auf jeden fall also diese kleinen diese kleinen die kleinen hidden champions da also falls du eine industrie hast in der du in der du mal fuß fassen möchtest oder passion hast. Geh einfach mal an den hauptbahnhof geh in zeitschriftenladen und kauf dir mal ein oder zwei zeitschriften zu diesem thema weil in der regel findest du da firmen artikel oder ähnliches und die google sie dann mal und so weiter und da so ist so eigentlich die manuelle recherche wenn du so möchtest.",
            "start": 1911519,
            "end": 1942767,
            "confidence": 0.7507913043478258,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt bist du ja großer Fan von, dass man sein Produkt lieben muss von der Firma und in dem Fall bei deinen Traktoren, heißt das übrigens auf österreichisch, gibt es Traktor im Hochdeutsch auch oder?",
            "start": 1943522,
            "end": 1955070,
            "confidence": 0.7918857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja Traktor oder Trecker.",
            "start": 1955251,
            "end": 1957272,
            "confidence": 0.62225,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, gibt es bei euch auch. Also du musst Traktor Fan sein, damit du dort arbeiten kannst und du, ich kenne dich ja, du bist ja eher auf der Seite, dass man eben sein Produkt liebt, wenn man auch als ITler dort arbeitet. Wenn man sein Produkt nicht liebt, wie finde ich dann Firmen, wenn es mir egal ist, für was für Produkt ich wirklich arbeite, sondern ich will einfach, keine Ahnung, ich bin Kafka Fan und will irgendwas cooles mit Kafka machen.",
            "start": 1957372,
            "end": 1980263,
            "confidence": 0.724698795180723,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich muss zugeben, die Produktliebe war noch nie da, also die war noch nicht direkt von Anfang an da, die hat sich auch erst entwickelt. Damals, 2013, als ich zu Trivago gekommen bin, Da habe ich jetzt nicht so von der Hotelpreis Suchmaschine geschwärmt wie ich jetzt von Trecker schwärme, da war es dann eher die Möglichkeit mal was anderes zu machen mit talentierten Leuten zu arbeiten. Wie man jetzt zum Beispiel, zurück zu deiner Frage, wie man jetzt. Firmen findet, die zum Beispiel eine spezifische Technologie einsetzen. Da gibt es jetzt meines Erachtens nach mehrere Wege. Man kann sich zum Beispiel, wenn man sich vorstellen kann, im Consultant-Bereich zu arbeiten. Es gibt sehr, sehr viele IT-Consultant-Buden in letzter Zeit. Die Lloyd, einer der größten, glaube ich. Dann kann man sich da auch sehr, sehr gut als Kafka-Experte irgendwie platzieren. Und dann sieht man auf jeden Fall eine ganze Menge Firmen, die Probleme mit Kafka haben. Bei Kafka kann man natürlich auch ganz speziell sich direkt bei Confluent bewerben, die Firma hinter Kafka, die das primär entwickelt haben. Oder man kann einfach mal schauen, okay, wenn man sich wirklich auf die Technologie spezialisieren möchte, wer ist denn wirklich ein Riesennutzer von Kafka? Und fällt mir jetzt aus dem Stehgreif mal so LinkedIn ein, die halt sehr, sehr viel damit machen. Das sind halt so die Bereiche, wo ich mich mal umgucken würde, wenn ich auf eine Technologie gehen würde. Jetzt ist aber die frage ob das so ein intelligenter weg wäre weil technologien sind sehr sehr schnelllebig und klar von kafka weg migrieren dass das dauert bestimmt eine zeit ist aber nicht unmöglich wenn eine neue technologie auf den markt kommt die vielleicht irgendwie leichter zu betreiben ist oder kafka ist ja schon bist. Wenn einem die Technologie jetzt selbst so nicht wichtig ist und man zum Beispiel einfach nur in einem Startup arbeiten möchte, dann gibt es da natürlich auch sehr, sehr viele Möglichkeiten. Man kann natürlich auf lokale Startup-Events gehen. Man kann seine favorisierten Inkubatoren einfach mal durchschauen. Y Combinator ist einer der größten in Amerika. Gibt aber auch ganz viele Venture Capitalists in Europa. Einfach mal auf die Webseite gehen, welche Firmen sponsoren die so. Oder man geht einfach mal auf crunchbase oder techcrunch.com. Das sind eigentlich Webseiten mit digitalen Newspaper, digitalen Zeitungen. Und da kann man natürlich auch schauen, wer in letzter Zeit Seed-Funding bekommen hat, Serie A, Serie B, Serie C, also Venture Capital groß eingesammelt hat. Weil immer wenn Startups Venture Capital einsammeln, dann heißt das auch, dass die gerade sehr, sehr viel Geld haben, um ihr Business zu wachsen, wachsen zu lassen, um neue, fähige Leute einzustellen. Und das sind dann, da kriegt man natürlich auch eine ganze Menge an interessanten Firmen mit, weil die entwickeln Geschäftsmodelle, die es auf der einen Seite vielleicht noch nicht gibt. Neue Technologien entwerfen die gerade oder ähnliches. Ist auf jeden Fall auch eine Möglichkeit. Hast du sowas schon mal gemacht, Wolfgang?",
            "start": 1980584,
            "end": 2156353,
            "confidence": 0.8108444444444451,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich bin ja grundsätzlich sehr interessiert, wenn es um Startups geht und ich höre natürlich auch einiges an Podcasts und lese auch so Newsletters und so. Insofern bin ich da eh relativ gut informiert, aber es gibt natürlich auch noch zusätzlich Webseiten oder wenn man einfach mal die Google Startup Listen, Startup Maps oder solche Dinge eingibt, findet man da auch recht gute Listen, wo man dann einfach mal durchklicken kann und Was mir dann noch jetzt wichtig wäre, persönlich, wäre vielleicht nicht, dass das Startup super klein ist. Ich meine, es kann natürlich auch super interessant sein, mit drei Leuten oder so. Aber ich würde eher in Richtung, je nachdem, wie viel Erfahrung man schon hat und was man natürlich genau will, aber ich persönlich würde jetzt vielleicht eher in Richtung Scale-Ups gehen, sprich Startups, die es schon länger gibt, die schon ein paar Fundingrunden hinter sich haben und die auch eine gewisse Anzahl an Mitarbeitern haben. Weil jetzt in einer Firma mit zehn Leuten zum Beispiel ist halt die Frage, ob es da jetzt zum Beispiel eine gewisse Lead- oder Engineering-Manager-Rolle gibt, die jetzt mir Spaß machen würde. Keine Ahnung. Da würde ich dann eher andere Rolle sehen, wo ich mich zum Beispiel sehen würde in so einem kleinen Unternehmen. Also auch da, Startups gehen bis zu 1.000 Leute oder 2.000 Leute. Das war immer, mir hat das immer sehr amüsiert, dass Trivago sich eigentlich immer Startup genannt hat, sogar bis 1.800 Leute gehabt hat. Also es gibt alle Größen von Startups und da würde ich mir einfach ein bisschen genauer anschauen, wie weit ist das Startup schon und was will ich persönlich? Will ich einfach lernen? Will ich möglichst viel Impact haben, zum Beispiel in einem kleinen Startup, oder geht es mir darum, dass ich eine gewisse Sicherheit habe, dass das nicht morgen pleite geht, vielleicht dieses Startup, dann muss ich vielleicht ein bisschen in Richtung größeres Startup gehen. Also da muss man sich halt überlegen, was man wirklich will.",
            "start": 2157398,
            "end": 2257814,
            "confidence": 0.74875748502994,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich finde, man sollte sich auch fragen, wie flexibel man ist. In einem Start-up ist es oft chaotisch. Man hat keine Prozesse in einem Scale-up. Also in einem Start-up, was schnell wächst und schnell wachsen, meine ich 20, 30 neue Leute pro Monat einstellen. Da überleben auch Prozesse, die es vielleicht schon gibt, überleben einfach nicht lange. In etablierten Firmen, Konzernen dreht sich das Rad etwas langsamer. Könnte dann auch simple Projekte ein paar Monate dauern. Also da da muss man sich einfach mal in sich gehen und einfach mal fragen was man möchte ja also ich finde es total super ich bin kein prozess mensch ich hasse prozesse deswegen finde ich mich eigentlich im chaos recht wohl und fokussiere mich darauf das problem zu lösen deswegen wäre so ein konzern für mich eigentlich nichts ich höre immer nur ich habe noch nie in einem konzern gearbeitet ich höre immer nur dass da sehr viel politik ist, Da kann ich nichts mit anfangen, aber die Frage sollte man sich schon beantworten, weil sonst wird man in einem Startup auf jeden Fall nicht glücklich, wenn man eine stabile Arbeitsumgebung haben möchte mit sehr vielen Prozessen, wo alles geregelt ist, weil das hat man in der Regel bei Startups nicht.",
            "start": 2258617,
            "end": 2324272,
            "confidence": 0.796096153846154,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Natürlich kann man gewisse Sachen im Vorhinein herausfinden, aber im Detail, würdest du im Interview irgendwie sowas fragen oder probieren herauszufinden, wie chaotisch Firma ist?",
            "start": 2324312,
            "end": 2333799,
            "confidence": 0.78428,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich will jetzt nicht fragen, wie chaotisch die Firma ist, sondern was sind gerade so die größten Herausforderungen und dann zwei, drei Areale vorgeben. Ist Technologie eine Herausforderung? Ist Governance eine Herausforderung? Ist Product-Market-Fit noch eine Herausforderung? Und da merkt man das schon. Aber es kommt auch ganz drauf an, in welchem Bereich man unterwegs ist. Nehmen wir mal als Beispiel, wenn man jetzt ein Cloud-Provider ist, ein neues Startup, was eine neue Cloud macht, dann kommt man recht schnell an Bereiche wie Zertifizierungen, ISO-Zertifizierungen oder Ähnliches, damit andere Firmen dich auch nutzen. Und wenn du in so einem Bereich bist, dann kommst du sehr schnell in die Ecke, wo sehr, sehr viele Prozesse oder essentielle Prozesse sehr früh eingeführt werden. Wenn es jetzt jedoch eine Webseite ist, ein Marktplatz zum Beispiel, dann sind solche Zertifizierungsprozesse in der Regel nicht so schnell notwendig. Also es kommt immer ganz drauf an, in welchem Bereich man ist. Wenn man jetzt eine Neobank machen möchte, Trade Republic, N26, die werden auch gewisse Bereiche haben, die sehr, sehr stark reguliert sind, weil die gewisse Kontrollen erfüllen müssen. Also es kommt dann ganz drauf an, wo man da arbeitet.",
            "start": 2334312,
            "end": 2411066,
            "confidence": 0.7808298969072167,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt haben wir besprochen, wie man Firmen findet. Eine ganz gute Taktik im IT-Umfeld ist auch, dass man sich einfach finden lässt. Du hast es schon erwähnt, Active Sourcing und du bist auch active gesourced worden. Ich habe da auch eine nette Geschichte. Einmal ist ein Mitarbeiter zu mir gekommen, in einem 101 übrigens. Und hat mir halt gesagt, er will kündigen, er will weg von der Firma und er will unbedingt nach Berlin. Und die haben dann natürlich auch als Lead unterstützt. Finde ich es auch sehr wichtig, dass man das möglichst gut macht, coacht in dem Bereich und einfach dieser Person einen guten Austritt ermöglicht aus der Firma. Ich glaube, das ist im Sinne von allen. Und er hat mich gefragt, wie kann ich mich am besten bewerben bei dieser Firma. Und ich habe ihm gesagt, schalte auf LinkedIn einfach mal ein, du suchst nach, du bist offen, du suchst nach neuen Stellen und warte mal einfach ab. Und ich glaube, zwei Wochen später ist er zu mir gekommen und hat gesagt, die haben mich jetzt kontaktiert. Und er hat einfach nichts machen müssen. Und ich glaube, das ist auch eine Möglichkeit und wir sind in dieser privilegierten Situation, haben wir ja schon öfter besprochen, dass der Arbeitsmarkt so schwierig ist aktuell, dass die Firmen einen wirklich suchen. Das heißt, man kann auch wirklich mal checken, wer kommt auf mich zu? Sind da interessante Firmen dabei? Und auf dem Weg dann jeweils weitermachen. Und wenn natürlich der Recruiter auf einen zukommt, ist es meistens auch leichter, dann weiterzumachen, als wenn man sich natürlich erstmal bewerben muss.",
            "start": 2411086,
            "end": 2491333,
            "confidence": 0.7782462686567163,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da kommen auch ganz einfach Anfragen, mit denen man zum Beispiel nie gerechnet hätte. Also bei der aktuellen Firma, die mich angeschrieben hat und bei der ich dann jetzt auch angefangen habe, ich wollte eigentlich gar nicht mehr. Ich hatte gesagt, komm, legst du die Interviewsache jetzt mal zur Seite. Aber da habe ich dann doch noch das Interview gemacht und die Leute haben mich überzeugt. Sie haben mir sehr respektvoll meine Grenzen gezeigt. mir wirklich gezeigt, dass ich bei denen noch eine ganze Menge lernen kann und so bin ich dann da auch reingerutscht. Also einfach mal offen sein für sowas, einfach mal freundlich antworten. Was ich immer mache oder was ich eine ganze Zeit lang gemacht habe, immer wenn Recruiter mich angeschrieben haben, Die wollen dich oft in ein Telefonat verwickeln. Was ich recht dreist mache ist, ich habe drei, vier Fragen, die ich immer sofort zurückschicke, um die ganze Sache ein bisschen produktiver zu machen. Die eine Frage ist, wie sieht der Gehaltsrahmen für die Stelle aus? Weil in der Regel wollen wir uns nicht verschlechtern. Die zweite Frage ist, wenn die Firma nicht genannt wird, welche Firma das ist. Weil ich bin fest davon überzeugt, wenn der Rekruter seinen Job gut macht, dann bewerbe ich mich nicht bei der Firma direkt, sondern gehe immer noch über ihn. Weil ich muss ja einen Vertrauensvorschuss geben in der Hinsicht. Und da denke ich auch, dass der Rekruter auch einen Vertrauensvorschuss geben kann. Wenn es um eine Teamleiterstelle geht, dann frage ich oft in der Regel, wie groß ist das Team und an welchem Standort sitzen die oder ist Homeoffice möglich oder ähnliches. Also die vierte Frage kommt immer ganz auf die originale Nachricht des Recruiters an. Und dann schreibe ich immer darunter, hey, bitte beantworte mir doch erst kurz diese Fragen, weil ich denke, dass die Antwort darüber entscheidet, ob wir telefonieren oder nicht. Sehr, sehr, sehr viele Firmen sind da ausgeschieden oder sehr viele Rekruter. Mit denen habe ich dann nie telefoniert. Wie zum Beispiel, ich weiß, ich will nicht umziehen. Ich möchte hier in Duisburg bleiben. Und dann war eine Killerfrage für mich immer, ob ein Umzug erforderlich ist, also ob Relocation required ist. Und da werden super viele Anfragen einfach rausgekegelt. Und ihr werdet überrascht sein, wenn ihr so ein bisschen dreist auftretet. Ihr bekommt die Antworten. Und das spart euch sehr, sehr viel Zeit.",
            "start": 2491847,
            "end": 2623865,
            "confidence": 0.8114649999999988,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kann ich also auch nur empfehlen, weil sonst sitzt man die ganze Zeit an einem Telefon und dann hat man immer schon irgendwie einen Slot und bis man da einen Termin vereinbart hat und dann hat man eine halbe Stunde geblockt und muss mit dem telefonieren und dann stellt sich nach einer halben Stunde raus, dass da eh irgendwas nicht stimmt. Also da würde ich auch immer sehr aufpassen, Informationen einfordern. Es gibt meiner Meinung nach auch den Unterschied zwischen externen Recruitern und internen. Erfahrungsgemäß sind die internen wesentlich besser und es funktioniert üblicherweise besser, also dass man wirklich einen Recruiter hat, der bei der jeweiligen Firma arbeitet, weil externe Recruiter sind ganz oft nicht exklusiv. Die waren einfach angestellt, damit sie Leute für mehrere Firmen organisieren und die wissen dann auch üblicherweise gar nicht Bescheid über die Stelle. Wenn man dann nachfragt, sagen sie, ja keine Ahnung und das müsste man erst besprechen und so weiter. Das ist im Prinzip nur so eine Die probieren eigentlich nur so irgendwie die Leute an Land zu ziehen. Und da ist ehrlich gesagt auch selten was rausgekommen bei diesen externen. Also da würde ich auch wirklich aufpassen. Und dass man sich da nicht immer bauchgebinselt fühlt, sobald ein Recruiter was schreibt und irgendwas vom Himmel verspricht, irgendwelche Gehälter, sondern wirklich konkret nachfragen, wie der Andi gesagt hat. Und dann kann man wirklich dann ein Telefonat machen, wenn man die grundsätzlichen Sachen abgeklärt hat, die man im Asynchronfall auch abklären kann mit ein paar Fragen.",
            "start": 2624137,
            "end": 2700272,
            "confidence": 0.7646587301587303,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber bei externen Recruitern muss ich jetzt nochmal eine Lanze brechen. Also es gibt auch sehr sehr gute. Also es gibt nicht nur schlechte externe Recruiter und Personalvermittlungsfirmen. Es gibt auch sehr sehr gute. Die machen einen richtig richtig guten Job.",
            "start": 2700688,
            "end": 2711799,
            "confidence": 0.798073170731707,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die sind aber dann ganz oft auch exklusiv für diese Firma. Das heißt die haben dann diese Stelle exklusiv. Die kann gar nirgends anders beworben werden durch andere Recruiter. Also da sieht man meistens den Unterschied ob die exklusiv sind.",
            "start": 2711839,
            "end": 2723870,
            "confidence": 0.7983250000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich kann euch nur den Tipp geben, lasst euch mal auf solche Leute ein. Sprecht einfach mit denen. Hat mir bisher nicht geschadet. Auch wenn die ab und zu ein bisschen nervig rüber klingen, können sie doch sehr sehr sinnvoll sein und euch auch helfen und ab und zu auch einen deutlich besseren Zugang zu den Firmen geben.",
            "start": 2724284,
            "end": 2739692,
            "confidence": 0.7434999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist auch so, ich habe schon Recruiter gehabt, die einen dann wirklich coachen, sogar für Interviews oder probieren dir zusätzliche Informationen zu geben. Also es kann schon auch sehr hilfreich sein, aber wie gesagt, es sind dann meistens eher Stellen, die schwieriger zu besetzen sind, wo es dann exklusive Recruiter gibt und die probieren dann auch wirklich dich zu unterstützen, dass sie da wirklich einen guten Match für die Firma an Land ziehen.",
            "start": 2740550,
            "end": 2764414,
            "confidence": 0.8033243243243241,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Generell empfehle ich auch, macht euch mal bitte Gedanken, was ihr vom neuen Arbeitgeber erwartet oder unter welchen Rahmenbedingungen ihr arbeiten wollt. Mit Rahmenbedingungen meine ich zum Beispiel, wollt ihr Remote First sein, also wollt ihr kontinuierlich von zu Hause arbeiten oder wollt ihr mal ins Büro gehen. Wenn ihr ins Büro gehen wollt, wollt ihr fünf Tage die Woche ins Büro gehen oder wollt ihr eine Home Office Möglichkeit haben. Wie sieht es mit dem Gehalt aus? Was sind eure Gehaltsrahmen, in denen ihr arbeiten könnt, was ihr verdienen wollt? Wollt ihr viel Basisgehalt? Wollt ihr variablen Anteil anhand eurer Ziele? Also ist wie wichtig euch sowas? Wollt ihr Firmenanteile, Equity? Gibt es auch inzwischen viele europäische Firmen, die in die Richtung gehen. Was wichtig ist, ein Teil von der Firma zu besitzen. Wenn euch das mehr motiviert, macht euch die Gedanken und stellt diese Frage auch direkt an den Recruitern. Ist im Gehalt Equity mit dabei? Das macht die ganze Sache auch deutlich produktiver und kegelt viele Firmen raus. Wollt ihr einen hohen Reiseanteil? Wollt ihr gar keinen Reiseanteil? Das entscheidet zum Beispiel die Richtung, ob ihr im Bereich Consulting geht, was sehr, sehr toll sein kann, weil man sehr, sehr viele verschiedene Firmen sieht, sehr, sehr viele verschiedene Projekte. Also man sieht unglaublich viele Industrien. Also macht euch da ein paar Gedanken in den Richtungen und dann formuliert eure Fragen dahingehend.",
            "start": 2764887,
            "end": 2843994,
            "confidence": 0.7809700854700855,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was, glaube ich, ganz wichtig ist, ist auch, dass man sich überlegt, was sind wirkliche Knockout-Kriterien. Also was will ich auf keinen Fall und was ist variabel? Zum Beispiel Gehalt will ja irgendwo variabel sein, was ich mir so vorstelle und was in so einem Rahmen ist und was aber ein Knockout-Kriterium ist, wie viel ich mindestens haben will. Und dann würde ich versuchen, diese Knockout-Fragen im Vorhinein zu klären, möglichst früh im Prozess. Und dann die anderen, wo man einigermaßen flexibel ist, die eher in Richtung Ende des Prozesses verschieben, weil da hat man dann einfach schon mehr gelernt über die Firma, wie ist die Firma, hat man coole Kollegen, Kolleginnen, die im Interview waren, wie schaut das Ganze aus, dieses Team. Vielleicht hat man dann schon mehr Bezug zur Firma und am Ende kann man dann immer noch über den genauen preis natürlich verhandeln oder übers gehalt oder equity oder wie sowas dann die zusammenarbeit ausschaut ist man da wie viel tage muss man wirklich dann im büro sein wenn man natürlich wie gesagt auf keinen fall ins büro will und nur remote muss man das abklären aber wenn es halt jetzt irgendein hybrid modell ist wie viel tage oder solche sachen die kann man dann üblicherweise recht recht gut auch am ende vielleicht noch verhandeln unter umständen ein.",
            "start": 2844054,
            "end": 2912464,
            "confidence": 0.8286334841628958,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Zusatz noch zum thema gehalt und geld eine warnung und zwar Macht euch Gedanken was ihr verdienen wollt was ihr wo ihr wo ihr sagt okay damit bin ich zufrieden ihr werdet immer immer immer jemanden finden der mehr geld zahlt es gibt immer jemanden der mehr zahlt als das was ihr aktuell verdient. die frage ist nur zu welchen umständen ja umso mehr man verdient umso höher sind auch die anforderungen also es gibt ich habe ich habe bekannte die haben neuen job die verdienen ein unglaublich schweine geld haben aber zwei bis dreimal pro jahr performance reviews ja und. Das kann dann natürlich dann auch nach hinten losgehen ja also wie viel stress wollte ich euch machen macht euch bitte gedanken wie viel geld für euch genug ist ein ein leitsatz von mir war mal ich möchte so viel verdienen dass ich heute abend nicht drüber nachdenken kann ob ich meine frau ins kino einladen kann. Das war oder ist immer noch so ein Leitsatz für mich und wie gesagt macht euch da nicht kaputt und jagt jedem Euro oder Dollar hinterher, denn der Markt ist gerade sehr, sehr gut für erfahrene Entwickler und viele Firmen zahlen auch sehr, sehr viel Geld. Liegt aber auch daran, dass die Firmen gerade auch sehr günstig an Geld kommen. Die wirtschaftliche Lage kann sich jederzeit ändern.",
            "start": 2912504,
            "end": 2992119,
            "confidence": 0.834102222222222,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und sie erwarten sich vor allem dann unter Umständen eine ordentliche Leistung. Also gerade gut bezahlte Jobs, da geht es dann vielleicht auch darum, 60 Stunden zu arbeiten, statt 40, all in. Und das ist vielleicht okay, wenn es jemand will. Es ist vollkommen in Ordnung, je nachdem, wo man sich auch gerade befindet in seinem Leben, ist es vielleicht wichtiger oder weniger wichtig. Aber solche Sachen sind, glaube ich, auch definitiv wichtig abzuklären. Und ich kenne in meinem Freundeskreis immer mehr Leute, die auf 30 Stunden reduzieren, also 80 Prozent stellen. Und wenn man dann in einem Interview sitzt und man fragt mal so, wie schaut es eigentlich aus, so 30 Stunden Woche ging das? Und der Gegenüber sagt dann so, wir sind eigentlich mehr so von 60 ausgegangen, weil wir haben ein paar wichtige Projekte jetzt. Und das ist kein Wunder eine Geschichte. Das ist wirklich eine Geschichte, die passiert ist. dann weiß man halt auch, mit was man zu tun hat. Und wenn man das im Interview nicht abklärt, dann gibt es da sicher später Probleme. Also solche Sachen halt auch dementsprechend abklären, klarerweise. Aber weil wir jetzt schon so oft das Geld erwähnen, ich glaube für mich zumindest ist es auch immer wichtig, dass das einfach ein gutes Team ist, dass es eine gute Teamatmosphäre ist, talentierte Leute im Team sind, von denen man was auch lernen kann und wo einfach die Atmosphäre stimmt. Mir persönlich ist es zum Beispiel wesentlich wichtiger als irgendein Gehalt, solange das Gehalt in einem sinnvollen Rahmen ist, wie der Andi das schon gesagt hat. Und ich glaube, das muss man sich halt auch überlegen, weil wenn man jetzt vielleicht das Geld hat, um die Freundin ins Kino einzuladen, aber jeden Tag acht Stunden Probleme hat in der Firma und die Teamatmosphäre nicht passt, dann hilft es halt auch wenig weiter. Also ich glaube, da muss man schon alles abwägen. Und wie gesagt, wir sind in dieser grandiosen Situation in der IT, dass es so viele Arbeitsplätze gibt, dass man das machen kann. Viele Angehörige haben nicht die Möglichkeit, dass sie wirklich eine Checkliste machen können und wirklich alles abhaken. Ist das in Ordnung? Ist das, was mir Spaß macht? Ist das ein tolles Produkt? Passen da alle Umgebungsvariablen sozusagen? Und dann kommt am Ende also wirklich irgendwo was raus nach dieser Checkliste, wo man dann weiß, okay, will man bei der Firma anfangen oder nicht.",
            "start": 2992159,
            "end": 3118370,
            "confidence": 0.7911333333333342,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt bei meinem neuen Job hatte ich ein sehr hohes Kriterium, und zwar wollte ich mal mit Leuten arbeiten, die auf der einen Seite mehr Erfahrung als ich haben, und mit mehr Erfahrung meine ich wirklich 15, 20, 25 Jahre Erfahrung in der Softwareentwicklung. Und weil ich mich einfach weiter im Bereich Softwareentwicklung entwickeln wollte, Engineering Management, dann wollte ich mit einem interessanten Produkt arbeiten, also das Produkt, was die Firma entwickelt, verbessert jetzt vielleicht nicht die welt ja wir heilen kein krebs oder ähnliches aber ich kann mich auf jeden fall sehr sehr stark damit identifizieren und das ist auf jeden fall eine gute sache und ich muss zugeben deswegen habe ich auch sehr sehr viele interviews mit mit denen geführt und habe dann noch fragt hey kann ich noch ein paar leute aus dem team kennenlernen und so weiter Und die Zeit war gut investierte Zeit, weil es hat sich bestätigt, dass das enorm talentierte Menschen sind, mit denen ich arbeite, von denen ich sehr, sehr, sehr viel lernen kann. Ziemlich viele Leute haben in der Firma, in der ich jetzt arbeite, Erfahrungen, weil die kommen von Heroku, von Google, von Microsoft und so weiter. Da haben die natürlich ganz andere Welten gesehen. Gibt dann natürlich auch ein paar negative Teile. Aber die gibt es ja in jedem Arbeitgeber. Also ich meine, Jobwechsel bedeutet immer noch, du tauschst nur ein Problemset mit einem anderen und die Frage für dich ist, mit welchem Problemset kannst du hier leben. Also von daher, kein Arbeitgeber ist 100% perfekt. Von daher, macht euch Gedanken, was euch wichtig ist, was ihr gerade vermisst und was ihr wirklich wollt und welche Probleme ihr dann gegebenenfalls auch akzeptieren könnt.",
            "start": 3118767,
            "end": 3214136,
            "confidence": 0.7956654929577465,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und vielleicht noch abschließend, solltet ihr eine Zusage bekommen oder ein Angebot bekommen, wartet vielleicht mit der Zusage nochmal ab. Normalerweise haben die Firmen auch die Zeit, wenn ihr jetzt parallel in mehreren Prozessen seid, kann man auch abklären einfach mit den Firmen, wie schnell muss das gehen. Natürlich wird jede Firma Druck machen, dass ihr möglichst schnell zusagt, aber man kann das normalerweise auch rauszögern, dass man da wirklich dann vielleicht ein paar Prozesse abwartet. Man kann das auch am Anfang schon kommunizieren, gerade die größeren Firmen. suchen so dringend Leute, dass das auch kein Problem ist, wenn das ganze ein Monat länger dauert unter Umständen üblicherweise. Und dann kann man das dementsprechend auch vergleichen, Angebote vergleichen, was will man wirklich machen und wo will man dann wirklich anfangen.",
            "start": 3215075,
            "end": 3256613,
            "confidence": 0.8154461538461536,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war's von uns für heute. Lasst uns doch mal bitte wissen, wie ihr zu diesen Themen steht. Interessieren euch diese Themen oder wollt ihr einfach nur mehr Storys von meinem Kegel-Grupp hören? Einfach gerne per Twitter oder per E-Mail und dann schauen wir mal, worüber die nächsten Episoden so gehen.",
            "start": 3256653,
            "end": 3274655,
            "confidence": 0.781156862745098,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hätte noch eine abschließende Frage, Andi. Wie viele Interviews hast du geführt, um den neuen Job zu finden?",
            "start": 3274715,
            "end": 3283141,
            "confidence": 0.8133684210526315,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Über den Zeitraum von einem Jahr waren das circa 20 bis 25. Bis ich wirklich den Job hatte, den ich jetzt habe, wo ich wirklich jetzt sage, nach ein paar Wochen, ich habe das Gefühl, ich bin am richtigen Platz. Ich muss aber auch ein bisschen zu meiner Verteidigung sagen, dass sich der das ziel des interviewing über die zeit auch ja geändert hat aber ich muss zugeben es war sehr zeitintensiv ich habe auch viele sachen nach dem ersten interview schon abgebrochen ja dreiviertelstunde interview und dann habe ich den ganzen prozess abgebrochen weil ja, ich wurde auch abgebrochen teilweise also von.",
            "start": 3283682,
            "end": 3321810,
            "confidence": 0.8124854368932041,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Daher, Ja, ich finde das 20 jetzt nicht so schlimm oder so hoch, überhaupt nicht.",
            "start": 3321830,
            "end": 3326312,
            "confidence": 0.6314000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich finde schon sehr viel und das ist schon ein sehr sehr großes Zeitcommitment, aber ich wollte halt das Richtige finden, wo ich mich wohlfühle, weil ich persönlich bin kein Jobhopper. Ich habe nicht vor, in anderthalb Jahren wieder woanders zu sein, sondern ich habe vor, wirklich ein Produkt mit aufzubauen, mit einem coolen Team, die Firma nach vorne zu bringen. Und deswegen nehme ich mir auch meine Zeit, dann das Richtige zu finden, wo ich auch das Gefühl habe, die Engineering-Kultur stimmt auch. Die haben auch alle Bock. Und nicht so, das haben wir schon immer so gemacht, sondern die wollen was Cooles betreiben. Und das hatte ich bei den Jungs und Mädels.",
            "start": 3326712,
            "end": 3359387,
            "confidence": 0.7982192982456137,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, dann wäre meine Frage jetzt an alle Zuhörer und Zuhörerinnen. Wie viele Interviews ihr grundsätzlich so macht, bevor ihr einen neuen Job anfangt? Und falls ihr mit dem Job zufrieden wart, was da eure durchschnittliche Anzahl ist, dann an Interviews, die ihr führen müsst. um zu einem Job zu kommen, der euch wirklich zufrieden stellt. Vielleicht könnt ihr uns das auf Twitter schreiben, gerade als Information. Ist, glaube ich, sehr interessant. Twitter-Engineering-Kiosk mit dem Username ENG-Kiosk. Ich kenne auch jemanden, der sieht das Ganze fast als Side-Projects und macht einfach gerne so Coding-Challenges von Firmen und Interviews und macht das einfach als Fortbildung und so kriegt man auch kleine Projekte, die man dann umsetzen muss und macht das halt einfach als Teil eines Side-Projects, sozusagen das Interviewing. Keine Ahnung, wie lange man das wirklich machen kann, aber man kann es ja auch mal so ansetzen, um einfach so nebenbei hin und wieder einfach mal ein Interview zu machen und vielleicht ist dann einfach was Gutes dabei.",
            "start": 3359427,
            "end": 3418402,
            "confidence": 0.7709520958083831,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jeder hat andere Hobbys. Lasst uns mal wissen, wie eure Interviewerfahrungen so sind. Lasst uns mal wissen, was die Killer Kriterien und K.O. Kriterien für euch sind. Welche Fragen ihr stellt, um all das herauszufinden. Und ansonsten... Vielen Dank, dass ihr wieder bei dabei wart.",
            "start": 3419461,
            "end": 3436729,
            "confidence": 0.7918222222222225,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Für unsere Zuhörerinnen, die kein Twitter verwenden, soll es ja auch geben. E-Mail-Adresse stetisch at engineeringkiosk.dev sind wir natürlich auch immer zu reichen. Wir freuen uns auch über jede Zusendung, egal was es ist. Feedback, kritisches Feedback natürlich besonders, aber auch sonst irgendwelche Informationen. Wir nehmen auch gerne Sachen wieder in die nächsten Episoden mit auf. Schreibt einfach kurz dazu, ob wir auch euren Namen nennen dürfen oder nicht. oder was für einen Namen wir nennen dürfen und dann werden wir das auch dementsprechend in den Episoden einbauen.",
            "start": 3436749,
            "end": 3469396,
            "confidence": 0.8131022727272726,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wie immer, falls ihr noch eine spezifische Frage habt, die ihr nicht in der Öffentlichkeit stellen wollt, schreibt sie uns gerne per E-Mail und wir beantworten sie auch gerne privat, auch wenn ihr mal einen Call mit uns haben wollt, gar kein Problem, einfach kurz schreiben, wir sind gerne für solche Themen da.",
            "start": 3469436,
            "end": 3484962,
            "confidence": 0.7302592592592595,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann hören wir uns hoffentlich nächste Woche und bis dahin. Wir haben eigentlich nie so einen Abschlusssatz, ich glaube wir brauchen so einen Abschlusssatz.",
            "start": 3485002,
            "end": 3491445,
            "confidence": 0.6452916666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vielleicht können wir das mal so etablieren, dass jeder in jeder Episode mal eine Floskel mitbringt. Du eine österreichische Floskel als Abschluss und ich so ein bisschen. Keine Ahnung hast du mal eine österreichische Floskel für heute, dann nächstes mal bringe ich eine Floskel aus dem Pott mit. So ein bisschen Völkerverständigung.",
            "start": 3492197,
            "end": 3510890,
            "confidence": 0.6944423076923079,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ist eine gute Idee. Also die typische österreichische Floskel, die mir einfallen würde zum Abschluss ist, geh scheißen.",
            "start": 3512075,
            "end": 3519966,
            "confidence": 0.6577894736842106,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Klingt total negativ. Wolfgang, geh scheißen.",
            "start": 3519986,
            "end": 3523310,
            "confidence": 0.4923333333333333,
            "channel": null,
            "speaker": "B"
        }
    ],
    "confidence": 0.7773895440616598,
    "audio_duration": 3531.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}