{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/BkiMSSDQjw7f8AB/download/ep110_okr.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "735d79d3-b151-4031-afc9-ef50e3682d82",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Google, Adobe und die Gates Foundation schwören auf Objective und Key Results, abgekürzt OKRs. Eine Methode für die Zielsetzung, die Teams beim Festlegen messbarer Ziele unterstützen sollen. Doch was ist wirklich dran am Hype? Ist es wirklich so gut wie geschnitten Brot? Wir sind der Sache auf den Grund gegangen und haben mit Marco Alberti von Murakami über das Thema gesprochen. Mit seinem Unternehmen berät er Firmen jeglicher Größe zum Thema Vision, Mission und Zielsetzung durch OKRs und hat dabei schon eine ganze Menge gesehen. Mit ihm klären wir, was OKRs eigentlich sind. Wie das Ganze zu anderen agilen Methoden wie Scrum und Kanban steht, wie OKRs ein Unternehmen verändern können, ob die AI zur Erstellung von Zielsetzungen hilfreich ist, was gute und schlechte Objectives sind, ob individuell personenbezogene Ziele in Software-Teams Sinn machen und vieles mehr. Wir springen direkt rein. Bis gleich.",
            "start": 4624,
            "end": 56498,
            "confidence": 0.8319020979020975,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Heute sprechen wir wieder mal über ein agiles Thema. Wir hatten ja kürzlich gerade in der Episode 108 über agiles Projektmanagement gesprochen und heute wollen wir mal über ein sehr bekanntes agiles Modell, OKRs, sprechen. Andy Grove hat es ja in den 70er Jahren so mehr oder weniger erfunden, wie er damals bei Intel war. John Doerr oder Doerr, ich weiß gar nicht, wie man eigentlich wirklich ausspricht, hat er mit seinem Buch Measure What Matters das Ganze dann sehr groß gemacht, so in den Ende 2000er Jahren. Es ist eigentlich auch ein sehr berühmtes Framework, weil Google setzt drauf, Adobe setzt drauf, die Gates Foundation rettet die Welt damit und es geht sogar so weit ins Detail, dass manche Leute ihr privates Leben mit OKRs managen, ihr persönliches Leben damit in den Griff bekommen. Und nachdem ich persönlich mein Leben noch nicht mit OKRs manage, haben wir uns heute einen absoluten Spezialisten eingeladen. Ich würde fast sagen der Mr. OKR von Deutschland, Marco Alberti von Murakami.",
            "start": 62423,
            "end": 124075,
            "confidence": 0.8140778443113772,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hallo, ganz herzlichen Dank für die Einladung. Freue mich sehr.",
            "start": 124095,
            "end": 127559,
            "confidence": 0.5164,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also vielleicht kurz zur Erklärung, warum Mr. OKR. Also du hast eine eigene Agentur namens Murakami und ihr macht vor allem OKR-Beratung und du bist selber OKR-Coach. Du hast auch einen eigenen Podcast. Ich persönlich höre den sehr gerne und darum bist du für mich so der Mr. OKR.",
            "start": 127619,
            "end": 146735,
            "confidence": 0.8190204081632653,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das freut mich.",
            "start": 146755,
            "end": 147236,
            "confidence": 0.24133333333333332,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Weil du ja auch dort nicht nur die klassischen OKR Themen behandelst, sondern eben auch alles rundherum von Vision, Strategie, Leadership Themen, auch die ganzen neuen Arbeitswelt Themen. Du hast super coole Gäste. Und was für mich auch immer super spannend ist, sind diese EMA-Sessions, also Ask Me Anything, wo du wirklich Themen aus der Praxis behandelst, also Fragen bekommst aus der Praxis und diese, ich würde mal sagen, sehr eloquent beantwortest in deinem Stil. Und zu deinem Podcast habe ich auch noch herausgefunden, der ja mittlerweile höchstwahrscheinlich sehr bekannt ist und sehr weit verbreitet ist, Böse stimmen oder manche stimmen zum beispiel der philip glöckler von den doppelgängern behauptet ja du bist dann erst erfolgreich geworden wie er dich gezwungen hat dass du das cover endest von deinem podcast. Stimmt es oder warst du davor auch schon berühmt.",
            "start": 147496,
            "end": 201719,
            "confidence": 0.8141007194244605,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also grundsätzlich ist erfolg immer ein dehnbarer begriff im vergleich zu philips podcast ist meiner eine kleine nummer. deswegen würde ich dann immer nur sehr begrenzt von erfolgreich sprechen aber er hat auf jeden fall mich mehrmals genötigt das dann auch wirklich, zu tun und irgendwann habe ich gedacht so naja vielleicht macht es ja doch einen unterschied so richtig habe ich das nicht gemerkt aber es sieht viel besser aus als vorher weil es vorher einfach, ehrlicherweise nur ein foto war weil ich gedacht habe so ich muss jetzt hier in diesen quadrat da irgendwas reinladen und dann habe ich halt das foto reingeladen und auch nie wieder angefasst seitdem er mich dann genötigt hat habe ich gedacht okay gut dann mache ich es mal richtig und frage meine kollegen die grafiker ob sie das mal irgendwie in die hand nehmen können und seitdem sieht es 1 1 professioneller aus und kommt auch besser an glaube ich.",
            "start": 201759,
            "end": 251490,
            "confidence": 0.793006329113924,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jedes Mal, wenn ich das Cover sehe, muss ich auf jeden Fall an diese Geschichte denken und an Philipp. Vielleicht ist es mehr Marketing für ihn eigentlich gewesen am Ende. Aber wie der Mach sei. Andi ist übrigens auch noch da, aber der hat absolut fast keine Stimme heute. Aber du darfst trotzdem mal Hallo sagen, Andi.",
            "start": 252385,
            "end": 268910,
            "confidence": 0.7800350877192982,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, dass wir am Nachmittag aufnehmen, kommt mir sehr zugute, weil morgens bin ich wie so ein langsamer Diesel mit meiner Stimme. Die hat ja immer so ein paar Ausfälle. Ihr kennt das, wenn man sich von einem heftigen Schnupfen erholt. dass man dann morgens immer ein bisschen husten muss und dann die Stimme halt nach den ersten zwei, drei Litern Tee irgendwie aufgewärmt werden muss. Deswegen halte ich mich hier heute mal ein bisschen zurück und entschuldige mich für die Audioqualität meiner Stimme.",
            "start": 268930,
            "end": 291038,
            "confidence": 0.6933928571428573,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber haben wir eigentlich bei der Vorstellung irgendwas vergessen oder?",
            "start": 291078,
            "end": 294179,
            "confidence": 0.8870000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee, also mit dem Intro kann man nichts vergessen haben, weil da fühle ich mich natürlich stark geehrt. Und deswegen würde ich da nichts weiter hinzufügen. Also freut mich sehr, dass ich mich eingeladen habe.",
            "start": 294239,
            "end": 308345,
            "confidence": 0.7562857142857142,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, freut uns natürlich auch und dann können wir jetzt mal tief in die ganze OKA-Ecke einsteigen. Wir haben auch ein paar Fragen vorbereitet und auch ein paar Fragen bekommen von Freunden, primär aus der ganzen IT-Welt, die versuchen wir dir natürlich auch weiterzugeben, nachdem du da vielleicht dann auch ein bisschen Licht ins Dunkle bringen kannst. Aber fangen wir mal an. Ganz vorne an beim Thema. Und zwar, wir sind ja in der IT-Welt eigentlich mittlerweile mit dem agilen Scrum-Modell, würde ich mal fast sagen, verheiratet. Also das ist ja fast schon in jeder kleinen bis großen Firma irgendwie zu Hause. Jeder kennt dieses Scrum-Modell oder vielleicht auch mal Kanban. Also warum braucht es jetzt noch irgendwie noch so ein agiles Ding? Ändert das irgendwas an Scrum? Soll OKR Scrum ersetzen? Also warum brauche ich Scrum oder was ist Scrum? Und wie steht es denn jetzt zur aktuellen agilen Welt für mich als Softwareentwickler oder Entwicklerin in meinem Scrum-Team?",
            "start": 309048,
            "end": 365426,
            "confidence": 0.8219187500000003,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Von Scrum habe ich nur begrenzt Ahnung. Also alles, was ich da in dem Kontext sage, könnte auch falsch sein. Von daher korrigiert ihr mich gerne, wenn ich da auf einem falschen Pfad unterwegs bin. Aus meiner Perspektive ändert das an Scrum gar nichts, weil wir glauben an eine Koexistenz von den beiden Themen. Wenn man die Frage stellt, was ist OKR und wozu könnte ich das brauchen, dann ist OKR so eine Art Scrum of Scrum, könnte man wahrscheinlich sagen. Also es ist eine Business-Agilität, die über die Grenzen eines Teams hinaus eben die ganzen Bausteine zusammenpuzzelt. die voneinander abhängig sind und die ganz oft dafür verantwortlich sind, dass ein Scrum-Team in dem Scrum-Team entweder nicht vorankommt oder dass zu viele Leute an dem Scrum-Team ziehen. Und wenn ich das gut orchestriere über die Grenzen von Teams hinaus und auf das globale Optimum optimiere, das kann Scrum in der normalen Iteration ja eigentlich nicht, weil es sich innerhalb des Teams bewegt und nicht über die Ebenen nach oben optimieren kann. So kann man sich OKRs dann vorstellen als das Framework, was die globale Optimierung vornimmt, nämlich die Ressourcen so zu orchestrieren, dass wir die Dinge machen, die uns ganzheitlich am ehesten nach vorne bringen. Und das ist natürlich auch das Auflösen von Ressourcenengpässen unter Trade-offs. Und dafür ist OKAS durchaus hilfreich. Und das ändert dann vielleicht im positiven Sinne die Arbeit von Scrum-Teams, weil sie deutlich klarer wissen, was so in den nächsten drei Monaten ist und dass sie sich da auch ein Stück weit darauf verlassen können, dass unterwegs nicht jemand kommt und sagt, hey, mein Team da drüben braucht jetzt aber ganz dringend das, müsst ihr in euren nächsten Sprint einpriorisieren. Das heißt, die Themen auf so einer Drei-Monats-Scheibe sind relativ gut sortiert und dann hat man den Zeitraum Ruhe, dann in den Sprint-Iterationen seine Ziele zu verfolgen.",
            "start": 365466,
            "end": 479997,
            "confidence": 0.8331672025723471,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Heißt das, dass Agilität in dem Fall drei Monate Agilität bedeutet? Also unter drei Monaten kann ich nicht agil sein und nur auf drei Monate bezogen.",
            "start": 480037,
            "end": 488601,
            "confidence": 0.8460769230769232,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das habe ich nicht gesagt. ein relativ gutes Verhältnis hast. Also die Zeit, die du ins Plan steckst und die Treffsicherheit der Themen, die sich um dich herum verändern wird, lässt sich okay gut vorhersagen, dass man sagt, okay, dafür machen wir mal drei Monate eine Planung und handeln aus, wer macht was und wer braucht was von wem und so, damit das dann irgendwie aufkommt. Kürzer ist der Aufwand, also der Prozess hat schon einen gewissen Aufwand, diese Trade-off-Entscheidung zu treffen und hier die Verhandlungen über Prioritäten zu führen. Deswegen wäre es in einem wöchentlichen oder zweiwöchentlichen Intervall wahrscheinlich nicht zielführend und würde sich unter Ressourcenbetrachtung nicht so wirklich rechnen. Auf der anderen Seite ist es so, dass du, wenn du unterwegs was triffst, natürlich ändern kannst. Also du machst ja nicht drei Monate lang dein OKR-Set und dann redest du mit niemandem mehr, sondern es gibt ja regelmäßig stattfindende Meetings einmal die Woche. Und wenn ihr jetzt in eurem Team feststellen würdet, oh, die Rahmenbedingungen haben sich verändert oder da ist irgendwas ganz Wildes eingetreten oder wir haben eine Megachance, wenn wir die jetzt nicht nutzen, dann geht uns wirklich was verloren, dann müssen wir darüber diskutieren, Wollen wir das machen? Und was wollen wir dafür nicht mehr machen? Und das wird dann diskutiert und dann nimmt man das eine rein und das andere aber auch raus. Und dadurch bleibt es unter dem Quartal trotzdem agil in dem Fall. Also es bleibt trotzdem beweglich, aber es ist nicht so, dass wir das nicht dauernd haben, sondern das muss sich schon lohnen. Also da muss schon wirklich eine Megachance kommen oder da muss schon wirklich was schieflaufen, was wirklich unvorhersehbar war und was einen relevanten Impact hat.",
            "start": 489000,
            "end": 604796,
            "confidence": 0.8256736111111116,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wir ernähren uns dem ganzen Thema jetzt von der Seite, die die meisten Softwareentwicklerinnen auch schon kennen. Scrum, Agilität, agiles Manifesto. Und ich mag den Begriff, den du genannt hast, Treffsicherheit. Und du hast ja auch beschrieben, dass auch wenn es drei Monate ein etwas längerer Zeitraum ist, dass man agil bleiben sollte und sich gegebenenfalls auch, okay, man kann ja Ziel auch ändern. Jetzt hattest du auch schon das Wort OKRs genannt und ich frage mich jetzt die ganze Zeit, OKR klingt für eine Abkürzung, wie würdest du OKRs definieren oder was ist OKR, wofür steht das und was ist deine Dokumentation, sag ich schon, Definition eigentlich davon?",
            "start": 605083,
            "end": 643696,
            "confidence": 0.7820917431192662,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich habe mich schon ganz lange nicht mehr beantwortet die Frage, deswegen muss ich fast schon wieder darüber nachdenken. Also OKR steht für Objectives and Key Results, also Ziele und Kernergebnisse, wenn man es mal so runterbrechen würde. Und da fängt schon an interpretationswürdig zu sein bei den Zielen. Das, was man als Ziel versteht, wird oftmals als KPI eigentlich beschrieben und andersrum. Da muss man schon mal erstmal sehen, was verstehen wir denn eigentlich auf so einer Drei-Monats-Scheibe eigentlich als Ziel und wir glauben, Es muss ein Outcome sein, der dann am Ende auf irgendwelche KPIs wirkt, aber er sollte kein KPI sein. Das heißt Umsatz steigern ist in unserer Welt kein wirkliches Ziel im Sinne eines Objectives, sondern wäre eine komische Formulierung. Da fängt es schon an interpretationswürdig zu werden, weil du musst sehr stark herausfinden, Was willst du eigentlich? Also was soll eigentlich rauskommen? Und die Key Results, die dieses Objective beschreiben oder treiben und in unserer Welt eher treiben als beschreiben, stellen aus meiner Perspektive die Hypothesen dar, die die größtmögliche Wahrscheinlichkeit haben, dass das Objective Wirklichkeit wird. Das heißt, und da unterscheiden sich die Ansätze, das Buch, was ihr vorhin kurz vorgestellt habt, Da ist dieser S measured by, das beschreibt das Key Result eher das Objective. Das habe ich in der Version zwar getestet. Meiner Meinung nach kam das Buch auch ein paar Jahre später raus, weil als ich damit angefangen habe, gab es das Buch noch nicht. Das heißt, ich würde sagen, es ist irgendwie deutlich hinter 2013.",
            "start": 643776,
            "end": 737141,
            "confidence": 0.8038,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, es ist 2018 oder so, oder 2017.",
            "start": 737151,
            "end": 740461,
            "confidence": 0.6331249999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, irgendwie, aber auf jeden Fall nach 13 oder so. Weil als wir angefangen haben, uns damit zu beschäftigen, gab es keine, keine richtige Dokumentation, deswegen war vieles Trial and Error und dieses Ziel wird beschrieben durch seine Key Results, hat in der Praxis nicht so wirklich viel geholfen, wenn du dein Ziel sehr sauber beschrieben hast. Wenn du dein Ziel beschreibst, wir wollen Umsatz steigern und dann sagst du im Key Result wie viel, dann macht das schon irgendwie Sinn und dann ist das auch messbar, aber das ist unterkomplex. Was wir versuchen herauszufinden ist, was sind Ursache-Wirk-Beziehungen zwischen dem Objective und den KPIs und den Key Results und dem Objective. Und das ist ein hart analytischer Prozess, der rausfindet, wo drauf setze ich denn jetzt meine Kraft, damit ich das, was ich wirklich, wirklich erreichen will, auch erreiche und dann schaue ich mal, wozu das führt. War jetzt wahrscheinlich eine ziemlich wirre Antwort für eine einfache Frage.",
            "start": 740471,
            "end": 794107,
            "confidence": 0.7756226415094344,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nee, passt mir sehr gut. Ich hab grad mal nachgeguckt, die Buchedition, die ich hab, die ist von 2017. Und ich glaub, du hattest grad 2018 genannt. Und du hattest auch grad gesagt, dass du mit der, ich sag mal, Definition oder mit den Beispielen, die im Buch genannt sind, nicht immer ganz d'accord bist. Im Buch wird, glaub ich, das Beispiel.",
            "start": 794747,
            "end": 813251,
            "confidence": 0.7305806451612903,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genommen ... Glaube nie.",
            "start": 813291,
            "end": 815652,
            "confidence": 0.6315000000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Oder noch besser. Im Buch wird, glaub ich, das Beispiel genommen als Objective vom CEO, eines football teams ich glaube den superbowl zu gewinnen ich glaube das ist das beispiel was da durchs buch getrieben wird hattest hättest du denn mal ein praktisches beispiel was eine objective ist mit den zugehörigen key.",
            "start": 815692,
            "end": 834238,
            "confidence": 0.861403846153846,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Results Ja, also ich sag dir ganz kurz, warum ich bestimmte Sachen schwierig finde und Sportanalogien sind per se immer schwierig, weil sie per Definition kompetitiv sind und ein abgeschlossenes Spielfeld beschreiben mit einem klar definierten Ziel. Also es gibt schon das Ziel, dass man das gewinnen kann und jemand definiert die Regeln. Das ist nicht komplex, das ist nur gegen die anderen sich durchsetzen. Das hat mit der Realität eines Unternehmens leider erstaunlich wenig zu tun, weil im Unternehmen hast du niemanden, der sagt, ja jetzt hat hier einer gewonnen und es gibt auch kein richtig oder falsch und es gibt auch kein klar definiertes Spielfeld und es gibt auch keine Regeln und das Spiel endet auch nicht. Also es gibt sehr viele Sachen, die mit Sportanalogien nicht zu vergleichen oder zu beschreiben sind. wenn man sich Unternehmen irgendwie anguckt. Deswegen allein, also ich verstehe das, dass man ein einfaches Beispiel braucht, aber diese Sportanalogien sind immer schwierig, weil sie per Definition allein auf Kompetitiveness ausgelegt sind und da kann man anders drauf schauen. Das ist mal so das eine Ding. Ich habe ein handfestes Beispiel, was jetzt auch nicht aus dem Unternehmenskontext ist, aber um das Modell zu verdeutlichen, wenn du sagst, hey, ich will im Sommer wieder in meine Badehose passen, und das ist irgendwie jetzt bei mir gar nicht so unwahrscheinlich, dass man das Ziel irgendwie selbst verfolgt, dann könnte man ja jetzt sagen, in dieser S-measured-by-Logik, ja, okay, wie viel willst du denn abgenommen haben? Und jetzt sieht man aber das Abnehmen, also das Kilogrammen und Abnehmen nicht kausal ist für's in die Badehose passen, sondern eher indikativ. Also die Frage ist, habe ich auf der Waage fünf Kilo weniger als vorher, ist nicht kausal dafür, dass ich in die Badehose passe, sondern zeigt nur die Wahrscheinlichkeit so, wenn ich sie jetzt wirklich anprobiere, dann passt sie auch. Das heißt, ich weiß nicht, worauf ich wette, sondern ich beschreibe was, was ich quasi oben qualitativ beschreibe, mit einer Metrik, damit ich dann das Passen in die Badehose auch irgendwie messen kann. Halte ich für, also kann man machen. Was ich für spannender halte, ist die Frage, was steigert denn jetzt die Wahrscheinlichkeit, dass wir am Ende in die Badehose passen? Und dann könnten wir uns darüber Gedanken machen, wenn man so klassische Theorien anschaut, weniger oder was anderes essen, mehr bewegen. Und dann kommt schon so, ah ja genau, ich gehe siebenmal die Woche ins Fitnessstudio. Das ist für mich zu tief, das ist auf der Task-Ebene. Also du kannst auch schwimmen gehen und du kannst auch radfahren gehen oder du kannst auch so das sind ja ganz unterschiedliche möglichkeiten ein result herzustellen aber und das ja in der softwareentwicklung gerade auch wichtig wir wollen ja die lösung nicht vorgeben aber ich will das result determiniert haben das heißt was ich nicht will dass leute das was irgendwas anderes liefern sie sollen schon das liefern was wir brauchen aber wie sie es liefern das muss ja offen bleiben und demzufolge heißt es auch dass ich nicht sagen kann G5 mal ins Fitnessstudio, sondern ich muss sagen, was soll denn das gebracht haben und das würde man als Result wahrscheinlich sehen. Ich habe meinen aktiven Kalorienverbrauch um 800 Kilokalorien im Durchschnitt am Tag gesteigert. Kann ja auch mal zwei Tage Pause machen, aber so im Durchschnitt muss ich irgendwie gucken, dass das hochgeht und auf der anderen Seite könnte ich sagen, okay, ich habe so und so viel weniger Gramm Kohlenhydrate gegessen oder ich habe meinen Kalorienintake reduziert oder so. Und damit habe ich unterschiedliche Treiber, die voneinander völlig unabhängig sind. Also du kannst dich mehr bewegen und null an deiner Ernährung machen und andersrum, aber du kannst dich auch mehr bewegen und was an deiner Ernährung machen. Beides steigert irgendwie die Chance, dass es am Ende mit der Badehose klappt. Das ist die Logik hinter diesem kausalen Treibermodell. Vielleicht verdeutlicht das das ein bisschen besser.",
            "start": 834278,
            "end": 1048767,
            "confidence": 0.7939409090909099,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn du dieses Ziel setzt und es vergleichst mit einem Unternehmen, wo werden denn die Ziele gesetzt? Setzen diese OKRs die Chefinitäten in irgendeiner Form? Ich in meinem Team? Auf welchen Ebenen werden OKRs gesetzt? Wie spielt das zusammen? Wie kommen diese OKRs zu mir, weil Ziele hat man ja früher auch schon irgendwo gehabt, meistens.",
            "start": 1048807,
            "end": 1073250,
            "confidence": 0.8619821428571426,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das stimmt. Und ich werde oft gefragt, was unterscheidet denn OKRs von Management by Objectives? Das ist ja alles das Gleiche. Und das glaube ich nicht, nach langem drüber nachdenken. Ich glaube schon, dass dieses kausale Auseinandersetzen damit, das ist neu, das gab es in der Zielwelt irgendwie nicht. Irgendjemand hat gesagt, hey, wenn wir oben 10 Millionen Umsatz brauchen, dann ist jetzt die österreichische Tochter, die muss das machen und dafür muss das Team Sales das machen und das Marketing Team das und der Channel so das. Also eine große Zahl wurde einfach in kleinere Zahlen runtergebrochen und dann haben wir gesagt, so jetzt habt ihr alle eure Objectives und dann passt der lang. Das hat aber relativ wenig damit zu tun, dass das in Komplexität auch funktionieren kann. Und da ist meiner Meinung nach der entscheidende Unterschied. Dadurch, dass du Hypothesen formulierst, worauf du setzt, dieses Ziel zu erreichen, haben wir beide eine gewisse Verbindlichkeit. Also wenn wir über deine Ziele diskutieren, bevor du anfängst zu arbeiten, Sagen du und ich, ja, ich glaube schon, die Nummer, wenn wir den Energieverbrauch ein bisschen steigern und wenn wir dafür sorgen, dass wir ein bisschen weniger Kalorien als sonst zu uns nehmen, haben wir die wichtigsten Treiber adressiert und wenn wir das konsequent verfolgen, dann wird es auch klappen. Danach kann keiner sagen, ja, Gut, das mit dem Mehrbewegen, da hat jetzt keiner, also hat einfach nicht geklappt und über Mehrbewegen habe ich nicht nachgedacht. Das heißt, wir haben eine Verbindlichkeit in dem Ziel, bevor irgendjemand anfängt zu arbeiten und du und ich können da drauf gucken und sagen, das ist die beste Hypothese, die wir Stand heute beide kennen. Wenn das jetzt deine Ziele wären und ich Vorgesetzter wäre und ich würde deine Hypothesen für Quatsch halten oder bessere kennen, dann müsste ich sie dir sagen, bevor du anfängst zu arbeiten. Wenn ich das aber nicht tue, ist es offensichtlich so, dass wir beide keine besseren haben. Also glauben wir, dass das der beste Plan ist, den wir hatten und den verfolgen wir dann konsequent.",
            "start": 1073290,
            "end": 1182099,
            "confidence": 0.8183208092485555,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt aber, jeder in der gesamten Firma macht seine persönlichen OKRs und bespricht es dann mit der Vorgesetzten?",
            "start": 1182350,
            "end": 1189975,
            "confidence": 0.898842105263158,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich würde noch einen Winkelschluss zurück machen und deine Ursprungsfrage versuchen zu beantworten. Es gibt Ziele auf jeder Ebene, also CEO hat das Company Set, dann darunter sind vielleicht, weiß ich nicht, Abteilungsleiterinnen oder Teamleiter, die haben auch OKR-Sets und darunter gibt es vielleicht dann Wenn es Abteilungen gibt, dann gibt es vielleicht noch Teams und unter den Teams kommen Leute. Ob jetzt jeder auf persönlicher Ebene ein OKR-Set braucht, ist sehr abhängig davon, was die jeweilige Situation ist. Also Mitarbeitende an Maschinen brauchen auf keinen Fall ein OKR-Set, weil das kein komplexes Umfeld ist und weil die repetitiv wiederholbar das gleiche machen. Scrum-Teams brauchen auch kein persönliches OKR-Set, weil die haben ja Scrum. Also wenn ich da anfange dann Scrum zu nehmen und persönliche OKR-Sets, dann kommt es ja irgendwie zu Verwirbelungen, weil man hat ja irgendwie gesagt, man macht bei dem Team-Sprint mit, aber gleichzeitig hat man ganz persönliche Ziele und das kann man ja gar nicht runterbrechen, da müsstest du ja schon die ganzen Sprints geplant haben, also irgendwie passt das nicht zusammen. Und deswegen sagen wir, wenn ein Scrum Team existiert, dann hört das bei dem Team auf und geht nicht auf persönliche Ebene runter. So hängt das zusammen. Jeder macht seine OKAs, aber, und jetzt kommt der spannende Punkt, Aus der Perspektive, wir kennen die Vision, wir kennen die Strategie, ich weiß wie viele Ressourcen ich habe und ich versuche in die sinnvollste Richtung zu spielen für das nächst höhere globale Optimum. Also wenn ich Teil des Leadership Teams zum Beispiel bin, dann muss ich natürlich versuchen zu antizipieren mit den Ressourcen die ich verantworte, was ist denn jetzt genau die nächst sinnvollen Ziele für die nächsten drei Monate. die ich verantworte, aber ich muss trotzdem schon darüber nachdenken, dass die in das Puzzle passen und gleichzeitig denken idealerweise meine Kolleginnen und Kollegen um mich rum auch über das gleiche nach, sodass wir eine Gesamtpyramide haben, die dann zu der Idee des Company Sets, die zum Beispiel eine CEO aufstellt, irgendwie passt. Dann kann man es ein bisschen fein justieren und dann passt die Pyramide für ein Quartal.",
            "start": 1189995,
            "end": 1314562,
            "confidence": 0.8198215297450431,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt, es ist so baumförmig aufgebaut, also ganz oben steht CEO, Ziel, Objective und dann geht es nach unten bis zu meinem Team.",
            "start": 1315256,
            "end": 1323941,
            "confidence": 0.8492083333333332,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, Company Ziel würde ich sagen, also es ist nicht sein persönliches Set, aber er verantwortet die Gesamtziele von der Company, er oder sie.",
            "start": 1323981,
            "end": 1331285,
            "confidence": 0.6582500000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt aber, ich als Team muss zuerst mal die Objectives und Key Results von einer Ebene über mir kennen, damit ich überhaupt dann etwas machen kann oder agieren kann.",
            "start": 1331345,
            "end": 1341290,
            "confidence": 0.8703333333333334,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das glauben wir nicht. Deswegen ist unser Prozess andersrum. Wir sagen, es ist ein Gegenstromprinzip. Und ich würde behaupten, wenn wir regelmäßig reden, wenn du die Visionen kennst, wenn du die Strategien kennst, wenn du weißt, wie viele Leute du verlässlich hast, Und wenn du, wie gesagt, in diesem Diskurs über wo wollen wir denn eigentlich hin stark involviert bist, dann würde ich schon erwarten, dass man das antizipieren kann, wo man denn dann als nächstes hinspielen würde, weil man ja die Probleme, an denen man arbeitet, am besten kennt. Und deswegen ist unser Prozess von unten nach oben und gipfelt dann darin, dass von oben jemand denkt, also von der Strategie aus abgeleitet, Ziellevel denkt von da aus und alle anderen denken von unten aus und dann trifft es in einem Workshop aufeinander und wir gucken, wo passt denn das Puzzle nicht zusammen und was ist denn die Ursache dafür. Weil dann habe ich zwei Effekte. Ich habe Risk Mitigation. Mehrere Leute denken aus unterschiedlichen Perspektiven über den gleichen Sachverhalt nach. Wenn die zu einer ähnlichen Lösung kommen, ist die Wahrscheinlichkeit relativ hoch, dass die Richtung stimmt. Wenn die zu unterschiedlichen Lösungen kommen, dann muss ich mich fragen, woher kommt das?",
            "start": 1341850,
            "end": 1406653,
            "confidence": 0.8453712871287132,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das setzt aber schon voraus, dass du eine Strategie auf Firmenebene hast.",
            "start": 1406693,
            "end": 1410277,
            "confidence": 0.7699166666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wollte ich gerade sagen. Könnte sein, dass es gar keine Strategie gibt. Wenn ich sage, ich kann dir keine Strategie sagen, dann kannst du natürlich die Frage auch nicht beantworten, was mache ich als nächstes, um weiter in der Strategie voranzukommen. Das ist so.",
            "start": 1410837,
            "end": 1422542,
            "confidence": 0.7591590909090908,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber jetzt ist es ja so, dass Strategien bzw. Firmenstrategien oft für ein, drei, fünf oder mehr Jahre angesetzt werden. Und, ok Ars, ich glaube du hattest gerade einen Zeitraum für drei Monate genannt. Ist das der Standardzeitraum? Sind wir da fest drauf genagelt oder können wir auch sagen, ok wir versuchen, oder sagst du drei Monate hat sich empirisch bewiesen wegen der Treffsicherheit und des Verändernden der Umgebung?",
            "start": 1422582,
            "end": 1446915,
            "confidence": 0.7970289855072463,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Empirisch ist schwierig, aber über den, also es gibt auch Leute, die machen vier Monate, aber bei vier Monaten hast du halt einen Monat mehr das Risiko, in die falsche Richtung zu laufen. Also wir haben bis jetzt sehr gute Erfahrungen mit den drei Monaten gemacht, weil das Risk-Return-Verhältnis und das Verhältnis zwischen Treffsicherheit und Planungsaufwand am besten war. Kann man aber auch kürzer und kann man auch länger machen, aber empfehlen würde ich es nicht so. Und die Strategien in unserer Welt haben eine Laufzeit oder eine Blickrichtung von 12 bis 24 Monaten, sind aber quasi rollierend. So ein bisschen wie wenn du dir vorstellst einen Scheinwerfer vorm Auto, der guckt auch immer, keine Ahnung wie viel Meter so ein Scheinwerfer geht, aber der guckt auch immer ein paar Meter nach vorne und wenn du in die nächste Kurve fährst, dann guckt er da auch wieder ein paar Meter nach vorne. So ist das für uns in den Strategien. Also du kommst nie zu dem Punkt, dass die Strategien kurz vorm Ablaufen sind, weil sie rollierend überdacht werden sollten.",
            "start": 1447287,
            "end": 1502987,
            "confidence": 0.7458388888888889,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hattest jetzt aber auch schon das Wort Planungsaufwand genannt und wenn du jetzt sagst, okay, wenn die Strategie und die Richtung des Unternehmens klar ist, dann können wir die ganze Sache auch bottom-up machen. Die Teams designen ihre Objectives und Key-Results und irgendwann treffen die sich, unterhalten sich und dann geht das eine Ebene höher und so weiter und so fort. Was ist denn aus deiner Erfahrung so ein realistischer Planungsaufwand? Von was redet man da? Wir sprechen ja jetzt nicht hier von einem Zwei-Stunden-Meeting.",
            "start": 1503027,
            "end": 1525688,
            "confidence": 0.7196511627906976,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ne, auf Top-Level, also die oberste Ebene reden wir von zwei Tagen, idealerweise Off-Site, also nicht im Büro und dauernd kommt jemand rein und sagt, hey, hast du noch mal fünf Minuten, sondern halt wirklich fokussiert, vorbereitet. Da bringt jeder jedes OKR-Set mit und das hat dann durch die Organisation natürlich ein bisschen Herleitungsaufwand, der ist aber verhältnismäßig überschaubar, da würde ich sagen, sind wenige Stunden pro Team, die da rein fließen müssen, um das zu orchestrieren. Dann wird es oben zwei Tage verhandelt und zusammengebaut und wir rücken die großen Themen glatt. Also die, die dann sozusagen wieder runterkaskadieren und dann muss natürlich jedes Team nochmal sehen, wie passt das jetzt für mein Team, von dem was von oben sich möglicherweise verändert hat und die individuellen Herausforderungen, die wir in dem team haben vielleicht haben wir was wo die company sagt jetzt nicht irgendwie mein mein ultra fokus aber das team sagt das muss man auf jeden fall machen weil wenn wir den server jetzt nicht updaten dann haben wir morgen riesen sicherheitsrisiko also lass mal machen.",
            "start": 1526160,
            "end": 1590115,
            "confidence": 0.811101123595506,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hattest schon ein schönes stichwort genannt server updaten und zwar gibt es ja in jeder unternehmung ich nenne es mal die supporting functions. HR, Finance und Co.",
            "start": 1590456,
            "end": 1600366,
            "confidence": 0.6277857142857144,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Manche sagen auch Marketing, da muss ich mal lachen.",
            "start": 1600386,
            "end": 1603228,
            "confidence": 0.36733333333333335,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nee, nee, um Gottes Willen. Ich rede wirklich das, was ein deutsches Unternehmen oder ein europäisches Unternehmen braucht, um einfach betrieben zu werden. Und es gibt auch im IT-Bereich Leute oder Abteilungen, die werden der Sorte Keep the Lights On zugeordnet. Die sind da, um alles am Fliegen zu halten, aber die bringen jetzt nicht beziehungsweise tragen nicht mit großen projekten innovations projekten am kernprodukt bei sie die halten.",
            "start": 1603268,
            "end": 1626958,
            "confidence": 0.8382318840579713,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die ganze it change und it run so von der.",
            "start": 1626978,
            "end": 1629044,
            "confidence": 0.5467000000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, zum Beispiel. Der klassische Betrieb, Operations oder ähnliches. Meine Frage ist jetzt, da eine Strategie in einer Unternehmung ja meist irgendwie auf Wachstum und Profitabilität ausgelegt ist, inwieweit können denn Supporting Functions, HR, Finance und Co., an der globalen Strategie auch, ich sag mal, teilnehmen, dass wir alle am selben Ziel, ich sag mal, ziehen? Und auch, ist das für die nicht immer eine deutlich schwierige Geschichte, Objectives zu finden, die mit der Wachstumstrategie des Unternehmens mit einhergehen?",
            "start": 1629821,
            "end": 1659298,
            "confidence": 0.7982911392405067,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Oder siehst du das wie deine Fließband Mitarbeiter, die keine OKS brauchen?",
            "start": 1659862,
            "end": 1666627,
            "confidence": 0.7775,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee, also da muss man schon auch stark unterscheiden und da muss man immer so die Frage stellen. Die Lieblingsfrage ist ja, was mache ich jetzt mit der Buchhaltung? I don't care. Also es ist nicht, weil man für den Job keine Wertschätzung empfindet, sondern es ist, weil es einfach ein nicht komplexes Umfeld ist, für den es nicht nur Regeln, sondern sogar Gesetze gibt. Und dann muss man halt sehen, okay, wie schaffe ich es in dem gesetzten Umfeld, wo sich Regeln auch ändern, in einer annehmbaren Zeit, ohne Fehler und relativ schnell, die Dinger in das System zu kriegen, möglichst automatisiert, möglichst fehlerfrei. So, das bleibt die Aufgabe. Daran ändert sich wahrscheinlich relativ wenig. Da ist wenig Komplexität im Sinne von, da muss man erstmal rausfinden, wie es geht. Auf der anderen Seite gibt es in der Finance-Abteilung natürlich irgendwie Controlling und Leute, die sich mit Zahlen extrem gut auskennen und Leute, die Geschäftsmodelle extrem gut verstehen. Leute, die wissen, an welcher Stelle sollten wir investieren, weil das lohnt sich vielleicht und vielleicht an welcher Stelle auch nicht. Wenn die aber quasi entkoppelt ihre Überlegungen machen von allen anderen, dann sagt ein Businessplan ja super, wir investieren hier und wir machen da. Und Entwicklerinnen und Entwickler denken so, nee, also wir machen da drüben was ganz anderes und jemand anders will wieder was anderes machen und so wird ja selten ein Schuh draus. Deswegen versuchen wir sowohl auf dem Strategie-Layer als auch eben auf dem OKA-Layer diese inhaltlichen Fragen zu diskutieren. Wo macht es denn Sinn zu investieren? Wie viel muss man denn investieren? Und das ist dann eher eine Gemeinschaftsübung zwischen jemand aus dem Finance Department, der möglicherweise die Systeme bereitstellt, der klar macht, wo planen wir, wie kommen wir an die Daten ran, vielleicht haben die die Daten und andere haben gar nicht die Daten und so weiter und so fort. Dadurch wird es dann schon so ein Shared Effort und dann kann man hinten raus deutlich besser davon ausgehen, dass es so ein Gesamtkunstwerk ist, wo alle auch wirklich dahinter stehen.",
            "start": 1666687,
            "end": 1783531,
            "confidence": 0.8138323699421968,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt aber, es betrifft eigentlich auch mehr diese Bereiche, die einer Veränderung unterzogen sind. Also mein Tagesgeschäft ist in gewisser Weise immer ausgeklammert, das, was sowieso mitläuft, oder?",
            "start": 1783571,
            "end": 1795859,
            "confidence": 0.8736896551724137,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nein, es ist nicht. Da müssen wir sehr stark unterscheiden. Was soll denn dieses sagenumwogene Tagesgeschäft sein? Also ich fülle eine Spesenquittung aus, ich mache meine E-Mails, das ist überhaupt kein Ziel, sondern das musst du halt machen. Wenn du aber allerdings sagst, und da finde ich die größte Absurdität drin, ja ich bin Marketing zum Beispiel, mein Tagesgeschäft ist, ich bringe halt Leute irgendwie hier ran, ich mache immer Kampagnen, und das hat nichts mit meiner OKRs zu tun. hat also quasi respektive nichts mit Zielen zu tun, das fände ich schon stark verwunderlich. So, was dann irgendwie läuft, ja, wir haben ja unsere KPIs, wir wissen ja irgendwie, wie der Hase läuft, dann merkst du aber, vor allem dann, wenn es nicht so gut läuft, ja, so richtige Hypothesen gibt es nicht. Und wenn wir dann in drei Monaten da stehen und sagen, hey, die KPIs, die sind im Keller, was war denn jetzt der Grund? Dann wird es, ja, puh, wir haben viele Sachen probiert, hat alles nicht funktioniert. Und dann bist du ja an so einem Punkt, dann kriegst du es nicht mehr eingefangen. Wenn du aber dieses Tagesgeschäft nicht als irgendwie so eine Wolke, die immer eh irgendwie passiert, verstehst, sondern als, das kann ich auch als Ziel formulieren. Und wenn ich die KPIs schon kenne, weil das sind zum Beispiel E-Commerceler, dass die mehr Traffic brauchen, mehr Warenkörbe, dass der Preis im Warenkorb hoch muss, dass die Conversion hoch muss. Das wissen wir ja schon so und dass die irgendwie so weit hoch wie möglich, das ist ja auch keine neue Erkenntnis. Das heißt, mir das als Ziel zu geben, ist zwar interessant, hilft mir aber nicht. Sondern die Frage ist, inhaltliche Ziele zu definieren, wo wir sagen, was ist ein Kanal, den wir noch nicht kannten, wie schaffen wir es, dass aus einem Newsletter, der total Sales und Gutschein getrieben ist, irgendwie Storytelling wird und es die Leute wirklich interessiert, was man ihnen schickt und so. Und das sind Hypothesen, die wir ins Rennen schicken, um dann zu gucken, ändert sich was an den KPIs. oder nicht. Und dann wissen wir, in der Richtung geht es irgendwie weiter und in der vielleicht auch nicht. Und dadurch macht es schon extrem viel Sinn, dieses Tagesgeschäft aufzusplitten und eben als Ziel zu formulieren, weil es hat ja Ressourcenbedarf. Und die anderen, diese Change Themen, die haben auch Ressourcenbedarf und die stehen eben im klaren Wettbewerb zu den Ressourcen, die das Tagesgeschäft sonst so klamm und heimlich auffrisst und dann am Ende einer sagt, ja zu den OKRs bin ich gar nicht gekommen und das ist ja irgendwie der schlechteste Punkt.",
            "start": 1795899,
            "end": 1935009,
            "confidence": 0.7924292134831467,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt wenn ich das so höre, ich muss jetzt mein Tagesgeschäft umformulieren in Ziele und ich habe da irgendwelche Workshops, um gemeinsam die Ziele zu definieren und dann kommen noch meine MitarbeiterInnen von unten und sagen mir als CEO jetzt, was ich zu tun habe, so in der Richtung, Das ist ja extrem große Veränderung. Also warum sollte ich als Firma jetzt überhaupt OKRs einführen, weil ich habe ja früher auch einfach meine Sales Ziele definiert und es hat auch irgendwie funktioniert. Also warum muss ich mich jetzt auseinandersetzen mit so viel Veränderung plötzlich? Und Transparenz womöglich.",
            "start": 1935029,
            "end": 1967078,
            "confidence": 0.8039072164948449,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich sag nicht, dass jemand sich damit auseinandersetzen wollt, aber solltest du in deinem Unternehmen feststellen, dass das mit den Zählzielen irgendwie nicht mehr so richtig aufgeht und dass die Leute nicht mehr so richtig happy sind mit dem und dass da irgendwie mehr Reibung bei entsteht als es vielleicht früher der Fall war? Was daran liegen könnte, dass die Welt um uns rum komplexer geworden ist, dann bedient sich ja irgendwie der Gedanke in einer ganz interessanten Antwortkiste zu sagen so, vielleicht gucke ich dann nach dem Tool, was mir in dieser Unsicherheit ein bisschen Orientierung geben kann. Und nichts anderes ist es. Wir versuchen zu steuern in Unsicherheit. Leute sagen in komplexen Debatten auch oft, naja, wie soll man denn Entscheidungen treffen? Wir kennen die Zukunft ja nicht. Ja, das ist halt Management. Du musst Entscheidungen treffen, obwohl du die Zukunft nicht kennst. Sonst wäre es ja witzlos. Also wenn ich einfach oben hinschreibe, so jetzt macht ihr alle eure, hier sind eure Ziele und ihr erfüllt ja alle und dann gehe ich ins Schwimmbad derweil. Das würde ich ja auch machen. Habe ich nur selten funktionieren sehen. Und weil es so selten funktioniert und man wahrscheinlich irgendwo in der Organisation Schmerzen empfindet, könnte man drüber nachdenken, wie könnte das besser gehen und da könnte OKRs eine Antwort sein.",
            "start": 1967098,
            "end": 2031719,
            "confidence": 0.7808280542986428,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt gibt es aber natürlich auch andere Modelle neben OKRs. Du hattest schon Management by Objectives genannt. Was bei uns in der Firma gerade sehr aktuell ist, sind V2MOMS, ist glaube ich von Salesforce. Vision, Values, Methods, Obstacles, Measures. Was spricht denn jetzt für OKRs im Gegenzug zu diesen anderen Modellen? Weil im Endeffekt ist das eine ganz klare Definition von Zielen über einen Zeitraum mit der Möglichkeit diese zu ändern, falls die Umgebung sich ändert. Und du sagtest natürlich auch, die gibt dir Sicherheit.",
            "start": 2031759,
            "end": 2062728,
            "confidence": 0.7851764705882353,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Naja, also ich habe keine Ahnung von all den anderen Modellen. Das ist mir auch begegnet, habe ich mir auch mal durchgelesen. Irgendwann kam ich zu, okay, an der und der Stelle finde ich es nicht so toll, weiß ich aber auch nicht mehr genau, an welcher Stelle das war. Ist mir aber auch gar nicht so wichtig, weil ich habe ja gar kein Wettbewerbsding für, okay, er muss besser sein als die anderen, sondern ich versuche, ein relevantes Problem zu lösen. Was ich noch nie vorher gesehen habe, ist, dass diese Hypothesen getriebene, was ist jetzt die Ursache von dem, was ich eigentlich erreichen will und worauf setze ich denn, wenn ich vielleicht 20 Ursachen habe und gar nicht so viel Energie? Was sind die relevantesten Ursachen? Wie komme ich auf die drei, vier Dinger, die ich mit der Energie, die ich habe, wirklich umsetzen kann und alles andere lasse ich weg? Und diesen quasi kausal Zusammenhang und hypothesengetriebenen Forschungskarakter, habe ich bei allen anderen Dinger nicht gesehen. Die sind BWL-alike. Cool, wenn du da sein willst, in fünf Jahren musst du da sein, in zwei Jahren und hier musst du in einem Jahr sein und damit wir das in einem Jahr hinkriegen, müsst ihr das und das bis da. Das ist alles retrograde Planung. Davon halte ich nur begrenzt, weil sie hat noch nie so richtig gestimmt. Also früher vielleicht mehr als heute, aber so richtig gestimmt hat sie noch nicht. Und dass ja irgendwie der Erkenntnisgewinn von Wasserfall funktioniert, aus den Gründen nicht so doll, Und die anderen Planungsmodelle funktionieren aus den Gründen auch nur begrenzt so. Und dann ist OKA eine quasi potenzielle Antwort. Ich habe kein sophisticatedres Modell bis jetzt gefunden, aber wenn ich eins finde, nehme ich das.",
            "start": 2062768,
            "end": 2154437,
            "confidence": 0.8016496598639455,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich musste gerade so super stark grinsen, weil du hattest gerade mehr oder weniger den ganz klassisch deutschen Businessplan beschrieben. In drei Jahren bin ich da, in fünf Jahren bin ich da. Und es ist immer so schön, besonders wenn man irgendwie so Serien wie Hülle der Löwen guckt und ähnliches, da ist es so, in fünf Jahren sind wir da.",
            "start": 2154737,
            "end": 2169341,
            "confidence": 0.7278196721311475,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber ich bin ja Startup-Investor, also und ich kenne die Geschichten sehr gut und in jedem Businessplan, den du siehst, weil es in der Startup-Welt so ist, ist am Ende so ein Hockeystick. Zack, hinten raus, also lange passiert nichts, weil ja, muss man das testen und market fit und weißt ja geil, wie das alles heißt. Und hinten kommt der Hockeystick. Wenn wir es mal rausgefunden haben, dann geht es richtig ab. Es hat noch nie gestimmt. Entweder zog es vorher an oder es zog auch nie an oder irgendwann einer hat den Hockeystick verkehrt rumgehalten. Also das heißt selbst wenn du aus dieser Finanzperspektive drauf guckst, weißt du ja, dass der Plan nicht stimmt. Und das Relevanteste an der Planung ist zu verstehen, welche Treiber hat das Unternehmen und wie glauben wir können wir die beeinflussen und was kostet es die Treiber zu beeinflussen. Das ist der relevante Teil der Planung und deswegen guckst du als Investor auch darauf, wie gut kann das Team planen, weil das heißt schon, Wie gut kennt das Team sein Business Modell, aber davon ausgehen, dass es stimmt, würde ich nicht.",
            "start": 2170421,
            "end": 2225978,
            "confidence": 0.7799361702127665,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hast du Startups erwähnt und davor auch ganz kurz die Autoindustrie. Und die Autoindustrie ist ja für mich so das Sinnbild des Wasserfalls, würde ich fast mal so sagen. Siehst du da grundsätzlich auch einen, ein Anwendungsgebiet für OKRs oder ist das so eine Industrie, wo du sagst, okay, da gibt es unser Fließband, das ist einfach Wasserfall und das wird Wasserfall.",
            "start": 2226018,
            "end": 2247074,
            "confidence": 0.7916984126984129,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Bis zum Fließband passiert ja da ganz viel. Also bis du an einem Fließband bist, sind ja eine Menge Etagen oben drüber, also wenn man das jetzt mal so strukturell betrachten mag. ja ich habe vor acht jahren angefangen automobiler dabei irgendwie zu beraten begleiten sich der sache zu nähern und ja die machen alle irgendwie sowas okay also da haben es dann anders genannt oder so aber gibt dir ein anderes beispiel was ein bisschen plakativer ist ein atomkraftwerk bauzeit auch nicht drei monaten und da wird auch nicht so schnell mal agil irgendwie MVPs umgebaut mal gucken ob der Reaktor hält und wenn er nicht hält dann bauen wir nochmal neu die Nummer läuft halt nicht so richtig gut deswegen muss man natürlich auch extrem stark gucken in welchem Umfeld ist man unterwegs so und dann muss man sich vor allem die Frage stellen, Wie agilisiere ich denn mein Geschäftsmodell? Und nicht nur, wie lasse ich denn alles bleiben, so wie es ist und versuche das zu steuern. Das ist ja ungefähr so, wie wenn du, und nicht so, dass man das nicht oft sehen würde, du verkaufst ein Festpreis-Software-Produkt und dann kommt irgendeiner auf die Idee, ja cool, wir nehmen jetzt OK aus, um das zu deliveren. Klappt ja super. Aber dann hast du halt irgendwie schon ein paar Flöcke in den Boden gerammt, die an der Stelle nicht hingehören und am Ende trifft es trotzdem nicht. Dann kann aber auch ein agiles System ja nichts dafür.",
            "start": 2247094,
            "end": 2324977,
            "confidence": 0.7809839999999998,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich glaube auch ganz allgemein, die Bauindustrie ist da ja sicher einfach, ja, du hast langsamere Industrien, da musst du einfach anders arbeiten, aber du hast ja auch eine Planungsphase und die ist ja, die könnte ja auch dann wesentlich agiler sein als die Umsetzungsphase, oder?",
            "start": 2325284,
            "end": 2341038,
            "confidence": 0.7650425531914892,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist das eine und du kannst natürlich schon auch anfangen darüber nachzudenken wie kannst du dein modell agilisieren also kannst in so wie man das in anderen industrien auch macht also die die schon weiter vorne sind kannst den schnitt stellen denken kannst sagen okay wir bauen jetzt nur einen kleinen teil. Und der muss mit den und den und den Schnittstellen an andere Teile passen und den kann ich dann dafür hernehmen oder dafür hernehmen. Oder wenn du dir so die Verlagswelt anguckst, da war ja auch immer so, können wir nicht ändern, ich habe schon ein Jahr lang im Voraus alle TV-Spots gekauft oder so eine Sache. Dann denkst du, ja, okay, aber dann, wenn das schon so ist, dann kann ich ja gar nichts ändern, außer das, was ich da ausstrahle, und vielleicht funktioniert der ganze Kanal nicht. Dann aber hinzugehen und zu sagen, wie schaffe ich es denn, dass sich da die Realität ändert? Und dann könnte man hingehen und sagen, schau, ich kaufe eine Option, also ich gebe dir... die Garantie, dass wenn ich alles kaufe, kaufe ich es zu Listenpreisen, solange bis ich eine bestimmte Menge erreicht habe. Und wenn ich eine bestimmte Menge erreicht habe, gibst du mir einen bestimmten Kickback wieder zurück. Aber ich garantiere dir nicht die Abnahmen. Ich sage dir nur, wenn ich viel nehme, wird es billiger und dann aber auch erst, wenn ich viel genommen habe. Und so kann man natürlich auch Vertragsgestaltungen irgendwie agilisieren, blödes Wort, aber zu versuchen alles ein bisschen die realität um dich rum zu verändern dass ja die idee von dem framework und nicht zu sagen ja die realität bleibt so wie sie ist jetzt muss ich sie nur steuern.",
            "start": 2341578,
            "end": 2426767,
            "confidence": 0.7850520833333332,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und und hast du da erfahrung dass das auch wirklich funktioniert dass jetzt einkäufer und verkäufer sich auf sowas wirklich einlassen weil ich habe auch so einblicke in manche einkäufer leben und das ist extrem.",
            "start": 2426827,
            "end": 2439232,
            "confidence": 0.7924000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja das ist extrem aber dann zum beispiel wenn ich der einkäufer bin dann machst du halt mit mir kein deal da endet die geschichte.",
            "start": 2439613,
            "end": 2444755,
            "confidence": 0.6615999999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber also kennst du kennst du konkret irgendwelche firmen die da erfolgreich wir haben.",
            "start": 2445373,
            "end": 2449800,
            "confidence": 0.8052142857142857,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das wir haben das gemacht weil das weil das irgendwie. Weil das anders nicht mehr funktioniert weil woher soll ich denn wissen ob tv und der sender irgendwie für ein produkt was wir noch nie hatten total super funktioniert. Aber wenn es gut funktioniert, bin ich bereit zu skalieren. Wenn es nicht funktioniert ist, dann macht man TikTok oder weiß der gar was. Und das muss man natürlich ändern. Und das ist genauso wie bei agiler Softwareentwicklung. Du musst halt auch Tage verkaufen und nicht quasi ein fertiges Produkt, weil da müsstest du so viel Sicherheitsmarge einrechnen, dass wenn du dich verkalkuliert hast, dass es dann trotzdem irgendwie sich ausgeht. Und das ist auch nicht der effizienteste Weg. Und da sehe ich schon, dass es sich langsam ändert, aber jetzt nicht drastisch schnell.",
            "start": 2449840,
            "end": 2494697,
            "confidence": 0.7914661654135341,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich finde es spannend, euch zu lauschen. Because, wollte ich gerade schon sagen. Entschuldigung, ich rede im Job so viel Englisch deswegen. Weil so wie ihr über die Autoindustrie sprecht, haben wir glaube ich alle vor zehn Jahren über die Fashion-Industrie gesprochen. Und jetzt kommen Unternehmen wie Shein und Temu und allem drum und dran und machen eigentlich genau das, was ihr gerade fragt. Okay, kann man eigentlich Agilität in der Autoindustrie verwirklichen und ja vielleicht reden wir in 10 15 jahren auch über weiß ich nicht.",
            "start": 2494977,
            "end": 2519696,
            "confidence": 0.7651149425287358,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Na ist ja schon ist ja schon mit ppe plattformen und so die sind ja schon irgendwie deutlich modularisiert und was du dann oben dafür eine blechkiste drauf setzt das ist wahrscheinlich zwar immer noch eine menge design aber unten drunter fährt wahrscheinlich schon relativ viel standardisiert in der gegend rum und wenn du das, Wenn du das lernst, wie du so Sachen irgendwie anders machen kannst, um dein Geschäftsmodell schneller und anpassbarer zu machen, dann gewinnst du natürlich.",
            "start": 2520597,
            "end": 2547743,
            "confidence": 0.7828227848101261,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber die Konversation hat mich auf zwei sehr interessante Fragen gebracht. Und zwar geht es da auch ein bisschen um die Messbarkeit von OKRs. Du hattest initial auch schon das Wort, KPIs genannt. Das verbinde ich in meinem Kopf immer mit irgendwelchen Graphen, die nach oben oder nach unten gehen oder halt Kennzahlen. Und wenn man mal nach OKRs googelt, dann kommt man relativ schnell auf das OKR Playbook von Google. Und da steht unter anderem drin, dass OKRs groß und ambitious und aggressiv definiert werden sollten. Und dass es nicht erwartet ist, alle Ziele, alle Objectives zu erfüllen, sondern dass die Erreichung, ich sag mal, prozentual gemessen wird und dann einer, ich sag mal, einer Ampel zugewiesen wird. Dass wenn man sagt, okay, man erreicht bis 30 Prozent, dann ist das Ziel nicht erreicht. Wenn man 40 bis 60 Prozent erreicht, dann ist das als gelb markiert. Und wenn man 70 bis 100 Prozent, dann ist das als grün markiert. Und wenn man immer auf diesen Webseiten schaut, dann heißt es auch überall, okay, wenn du eine Objective 100 Prozent triffst, wenn du die erfüllst, war sie nicht aggressiv, nicht ambitioniert genug. Wie siehst du das?",
            "start": 2547803,
            "end": 2616543,
            "confidence": 0.8083908629441625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Gefährliches Feld. Also erstens mal misst du ja nicht das Objective, sondern die Key Results. Und den mathematischen Winkelschluss habe ich nie verstanden. Das ist ein nicht normierter, nicht gewichteter Durchschnitt. Wenn du berechnest, dass du die Zielerreichung eines Objectives am Durchschnitt der nicht gewichteten, nicht normierten Key Results bemisst, dann hast du irgendeinen Obstsalat berechnet, aber nichts, was irgendwas über das Objective aussagt. würde jeder Mathematiker sich wahrscheinlich im Kopf greifen und sagen, was rechnet ihr da aus? Die Zahl ist eine Zahl, aber mehr auch nicht. Und deswegen glaube ich da schon mal nicht dran. Der andere Teil, wenn du wirklich auf die Key Results im Einzelnen guckst, also es hat zwei Sachen. Man muss verstehen, was das eigentlich will. Da steckt ja diese sagenumwobene Moonshot-Logik dahinter. Man muss verstehen was das eigentlich will und man braucht einen kulturellen Rahmen in dem das funktioniert. Gehen wir mal rein in was will das eigentlich. Es provoziert dich ausgetretene Pfade zu verlassen. Es geht ja nicht darum eine 10% inkrementelle Verbesserung hinzukriegen, sondern du wirst ja provoziert ein 10 mal so gutes Ergebnis zu liefern. Wenn du sagst, 10% würde ich schon hinkriegen, dann muss ich mich ein bisschen mehr anstrengen, dann führt das in die sichere Überarbeitung. Das soll es ja genau nicht. Sondern wenn du sagst, ich muss ein 10-mal so gutes Ergebnis produzieren, dann ist per Definition wahrscheinlich der Weg, den du kennst, nicht der richtige. Weil wenn er der richtige wäre, wärst du da schon. Oder du hättest extrem faul im Gras gelegen. Aber wenn der Weg schon gut beschritten ist, dann führt er dich nicht zu einem 10-mal so hohen Ergebnis. Das heißt, du musst, thinking outside the box, wie es immer so schön heißt in dem Kontext, du musst halt anfangen, darüber nachzudenken, ey, warte mal, was kann ich ein ganz anderes machen, was einen viel größeren Hebel drauf hat, damit das Ergebnis quasi provoziert wird. Und da ist eine Menge Scham drin. Wenn ich dieses Ambitious Goals Setting ohne dieses Wissen und ohne die Kultur, auf die wir gleich kommen, anwende, dann führe ich die Leute reihenweise in die Überforderung. Und das ist leider das, was zusehend passiert, dass Leute das Framework mäßig bis halb verstehen, um dann zu sagen, ja klar, ambitionierte Goals, wenn du ein Ziel erreichst, dann hast du dich nicht angestrengt, jetzt müssen wir mal ein bisschen mehr machen. Also, banaler als, jetzt müssen wir die Leute ein bisschen mehr triezen, geht's ja nicht so. Also, klar, gibt auch Leute, die brauchen Trieze rein, aber dann ist ja auch die Frage, habe ich die Leute, die ich haben will? Das ist nochmal eine andere Frage. Also, zum einen verstehen, da steckt die Provokation drin, sich massiv damit auseinanderzusetzen, und die Dinge, die ich tue, wirklich die schlauesten sind, um das Ergebnis massiv zu verändern. Und das andere, und das ist ein deutsches Kulturthema, ist, ah ja, wenn ich meine Ziele nicht 100% erreicht habe, dann war ich nicht gut. Also ich muss, das muss bei mir alles auf grün sein, sonst, nee, sonst ertrage ich das nicht. Und das ist natürlich in einem komplexen Ding, wo du sagst, hey, jetzt, also, bleiben wir nochmal bei dem Beispiel von ganz am Anfang. Das ist zwar banal, aber wenn du das noch nie gemacht hast, kannst du jetzt zwar sagen, super, ich esse zum Beispiel keine Kohlenhydrate mehr und damit glaube ich, dass ich fünf Kilo abnehme. Aber du weißt es nicht, weil du kannst aktiv nicht abnehmen. Du kannst nur Dinge dafür tun und dann kannst du zugucken, ob du abnimmst oder nicht. Aber du kannst nicht aktiv abnehmen. Es ist kein aktiver Prozess, wie bei vielen Sachen im Unternehmen auch. Du kannst Dinge machen und dann kannst du gucken, ob sich der Zeiger bewegt oder nicht. Und das heißt, wenn ich unterschiedliche Dinge mache, von denen ich nicht 100% beweisen kann, dass es eine Ursache-Wirk-Beziehung hat, kann ich nur Sachen machen und hoffen, dass sich der Zeiger in die richtige Richtung bewegt. Und was damit so ein bisschen herschwingt ist, was ist mit meiner Leistung und das Ohnmachtsgefühl, dass wenn du es nur ganz stark versuchst, muss sich der Zeiger bewegen. Das stimmt halt nur nicht.",
            "start": 2617398,
            "end": 2845012,
            "confidence": 0.7785077793493643,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber jetzt in der Realität in Firmen, weil du gesagt hast, du brauchst die richtige Kultur dafür, dass das eben nicht passiert, aber in der Realität hast du die Kultur ja gar nicht.",
            "start": 2845519,
            "end": 2854282,
            "confidence": 0.7733030303030303,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Manchmal, manchmal nicht.",
            "start": 2854322,
            "end": 2855702,
            "confidence": 0.6223333333333333,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt, du müsstest aber auch parallel zu den OKRs auch sicherstellen, dass du die richtige Kultur hast oder änderst womöglich.",
            "start": 2855762,
            "end": 2862884,
            "confidence": 0.8516190476190476,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Meiner Meinung nach ist die Einführung von OKRs in einem Umfeld, wo es nicht passt, ein Change-Prozess und OKRs ist der gute Leader des Change-Prozesses, also weil an dem wird klar, ah, hier haben wir irgendwie die falsche, wer hat hier ein Problem mit 70% ist gut genug, ja, ich, ok, ok, erklär mal. Und dadurch führst du ja schon eine kulturelle Veränderung ein, dass du mit den Leuten darüber diskutierst, ob sie die bestimmten Annahmen von dem Framework irgendwie teilen, ob sie da irgendwie Berührungsängste haben oder so. Das heißt, das ist in einer Kultur, wo das nicht schon gegeben ist, ist das auf jeden Fall ein Change-Prozess, der auf jeden Fall durch OKRs ausgelöst und auch nicht gesteuert, aber zumindest mal hält die Leute verantwortlich dafür, weil er zeigt dir alle drei Monate wieder, wo es klemmt. Klemmt es an der Struktur, klemmt es am Leadership, klemmt es an Und wie du vorhin gesagt hast, ja, wir haben gar keine Strategien. Gut, dann kommst du jedes Quartal wieder aufs Neue zum Punkt, wo jemand sagt, ja hey, aber der Typ in dem Online-Kurs hat gesagt, wir sollen uns an den Strategien ausrichten, wir haben aber gar keine, was machen wir denn jetzt? So, und das sind ja, das ist ja ein repetitives Ding und da ist das mit dem Tropfen und dem Stein ganz heilsam. Auf der anderen Seite muss man natürlich gucken, muss man möglicherweise den Change-Prozess auch begleiten, weil Change ist immer eine schwierige Sache und Leute wollen sich per Definition ja gar nicht verändern, weil das ist irgendwie unbequem. Und vielleicht muss ich einzelnen Teams, einzelnen Leuten Hilfestellungen an die Hand geben, dass ihnen diese Veränderung leichter fällt, damit sie dann in der Kultur und in einem Mindset, das ist eher ein Mindset-Thema, irgendwie ankommen, dass sie sich in OKRs auch wohlfühlen, weil wenn wir das, was wir vorhin gesagt haben, haben, dann habe ich ja eine brutale Sicherheit, dass du mir nicht am Ende andrehst, ja, was hast du denn da gemacht, das ist ja völliger Quatsch, kam ja gar nicht raus, was wir wollten. Und ich so, ja, weiß ich, kam nicht raus, aber das, was ich gemacht habe, waren die besten Wetten, die wir haben und ich habe mich jede Woche erstaunlich gut darum gekümmert. Du hattest keine bessere. Wenn du es besser weißt, hier ist der Schlüssel, mach es nächstes Mal selbst. Ah, nee, so habe ich es gar nicht gemeint. Und da brauchst du auch keine angst davor haben weil du hast ja also ich hatte dir ja die chance gegeben deine besseren hypothesen ins rennen zu werfen aber wenn du keine hast dann darfst du dich danach auch nicht beklagen dass wir die verfolgt haben auf die wir beide geguckt haben und gesagt haben, Das ist das Beste, was wir haben.",
            "start": 2863724,
            "end": 3006090,
            "confidence": 0.7644385593220344,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hast du schon kurz erwähnt, wenn das nicht funktioniert, dann läuft es oder laufen alle in Richtung Burnout und machst du nur alles kaputt.",
            "start": 3006110,
            "end": 3013732,
            "confidence": 0.76116,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nicht, wenn es nicht funktioniert, wenn man es verkehrt.",
            "start": 3013752,
            "end": 3016333,
            "confidence": 0.7559999999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, also wenn man die ambitionierten Ziele falsch versteht oder im falschen Wesen versteht. Jetzt haben wir ja auch diese Entwicklung mit der nächsten Generation, sind wir bei Gen Z, Gen C? Ich habe es schon vergessen. Auf jeden Fall, wir sind jetzt nicht mehr in der Work-Hard-Play-Hard-Richtung, die jetzt vielleicht eher in unserem Alterskreis so üblich war oder vielleicht auch immer noch ist und auch in der Start-Up-Welt eher gerne so als das Ziel oder die Methode angesehen wird.",
            "start": 3016373,
            "end": 3045793,
            "confidence": 0.8177749999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die gute alte Hustle-Culture.",
            "start": 3045833,
            "end": 3047134,
            "confidence": 0.7082499999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau. Siehst du da jetzt auch, was du jetzt so mitbekommen hast in den Firmen, sind der OKRs eher hilfreich oder ist so ein Modell bei der jüngeren Generation eher, wird es eher schlecht aufgenommen und geht dann in eine falsche Richtung oder finden die sich dann wieder in so einem Modell?",
            "start": 3047498,
            "end": 3066363,
            "confidence": 0.74575,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt muss man wahrscheinlich zur Beobachtung deklarierend hinzufügen, dass ich ja meistens mit den oberen beiden Management eben arbeite. Das heißt, da ist die Verbreitung von BerufseinsteigerInnen begrenzt, so sage ich es mal. Ich sehe aber schon, dass es den Leuten extrem hilft, den klaren Rahmen zu setzen zwischen was wollen wir eigentlich wirklich erreichen und glaube ich da dran und finde ich das auch gut und optimieren wir hier auf die richtigen Sachen und das glaube ich schon, dass das extrem hilft und da wird natürlich diese Purpose-Orientierung, wie auch immer man das auslegt, deutlich stärker und das kann schon auch auf die Ziele abfärben, aber das Framework als solches würde ich nicht sagen, dass es halt störend empfunden wird.",
            "start": 3066483,
            "end": 3114167,
            "confidence": 0.8475371900826446,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich könnte mir sogar vorstellen, dass das Framework als solches eher hilfreich ist, all mit diesen Elementen, die du auch genannt hattest. Der aktuelle Ansatz funktioniert nicht mehr. Ich muss mir was Neues überlegen. Also wirklich, ich sag mal, eine sinnstiftende Arbeit anstatt immer diese repetitive Arbeit. Und, ah, Software habe ich schon entwickelt. Okay, vielleicht muss ich schneller Software entwickeln. Ja, ich kann schneller tippen oder ich kann jetzt AI nehmen oder ähnliches.",
            "start": 3114727,
            "end": 3137638,
            "confidence": 0.795635135135135,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Oder andere halt vielleicht. Welche, die jemand benutzen kann oder benutzt, macht meistens mehr Sinn.",
            "start": 3137678,
            "end": 3142820,
            "confidence": 0.6728,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Kommen wir nochmal ganz kurz auf die neue Generation und auch die technischen Hilfsmittel. Jetzt gibt es ja Chat-GPT und allem drum und dran. Ich habe davon gehört. Und ich gehe stark davon aus, du hast es sogar benutzt. Und meine nächste Frage ist, kamen schon Leute auf dich zu und sagten, kann ich nicht meine Strategie in Chat-GPT schmeißen und sagen, generier mir meine Objectives?",
            "start": 3143218,
            "end": 3163501,
            "confidence": 0.738727272727273,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kannste. Kannst mal gucken, was bei rauskommt. Also scheitert schon, wie wir lustigerweise vorhin gesagt haben, meistens am Input. Also was soll ich denn da reinwerfen, weil so Strategien habe ich irgendwie eine Menge PowerPoint, aber so richtig krassen Prompt Input kriegst du damit nicht hin. Das sagt schon viel über die Strategie aus. Und das ist also ein Phänomen, was deutlich verbreiteter ist, als man denkt. Ich habe sehr viel Zeit darin investiert, herauszufinden, wie man dem Ding beibringt, Feedback zu Strategien zu geben, gute Strategien zu machen, Feedback zu OKRs zu geben. Ich bin gnadenlos gescheitert am, mach aus einem OKR ein besseres, oder mach mir aus einer Rahmenbedingung ein gutes OKR-Set. Warum? Weil es ist kein linguistisches Problem, sondern das ist ein stark logisches, mit Abhängigkeiten von welcher Treiber hat so ein Modell, was ist die Umgebungsbedingung, wo drauf setze ich, wie viel Energie braucht das? So viel Kontext habe ich noch nicht geschafft, so ein Ding mitzugeben. um dann zu einem richtig guten oder auch nur ansatzweise guten ergebnis zu kommen und dieses macht die strategien besser ist ja auch eine inhaltliche frage also wo willst du hin spielen das kein sprachliches ding und soweit ich das verstehe wie das funktioniert ist es ja es guckt in einem sprachlichen kontext so hey strategien habe ich da hinten in der ecke irgendwie schon mal gesehen, Da ist ein ganzer Haufen von den Strategien. Jetzt gucke ich mal, was bei diesem Muster, was ich hier finde, irgendwie ähnlich ist. Nehme ich mal die Sachen, die ich da hinten in dem Muster gefunden habe und adaptiere das mal darauf. Was kriegst du damit nicht? Innovation.",
            "start": 3163561,
            "end": 3261273,
            "confidence": 0.7886811594202904,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also AI-Engineers werden mich jetzt wahrscheinlich hauen, aber so wie ich das auch alles verstehe, ich bin kein AI-Engineer. Im Endeffekt, sehr simplifiziert gesagt, rät das Modell.",
            "start": 3261573,
            "end": 3270622,
            "confidence": 0.842962962962963,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Den nächsten wahrscheinlich den wahrscheinlich nächsten schritt so und der kann also der wahrscheinlich der nächste schritt kann ja schon sein, sachen die man in einer vergleichbaren zielgruppe relativ häufig hat auftreten sehen in so einer situation mit so einer heißt aber trotzdem noch nicht dass du auf die, 112. Strategie, die vor dir noch niemand hatte, irgendwie kommst, das ist unwahrscheinlich. Und die Komplexität, also wie gesagt, ich sage nicht, dass das mit AI nicht geht, auch in absehbarer Zeit. Ich habe nur keine Ahnung wie.",
            "start": 3270822,
            "end": 3300682,
            "confidence": 0.7859885057471266,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Man sagt ja auch immer, es ist gutes Mittelmaß, was dort rauskommt. Und die Frage ist halt, willst du nur Mittelmaß für dein Unternehmen haben?",
            "start": 3300722,
            "end": 3308948,
            "confidence": 0.8245600000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja ein bisschen was also ich habe eine große sympathie dafür und wir unterstützen unsere unsere strategie prozesse auch also langsam mit alldings um um halt eine große anzahl an, Input mitzunehmen. Dafür finde ich es extrem spannend. Also mittlerweile kann ich Leute in Prozesse einbinden, die ich aus Kapazitätsgründen vorher gar nicht einbinden konnte. Das macht AI möglich. Jetzt dann am Ende zu sagen, cool, dann mach doch direkt auch gleich die Strategie draus und wir machen das so, da habe ich noch ein bisschen Angst vor.",
            "start": 3309328,
            "end": 3339717,
            "confidence": 0.7924659090909091,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und wie sieht es bei Key Results aus? Es gibt ja diese ganzen Eigenschaften, was ein Key Result sein soll, messbar und so weiter. Dass man da irgendwie Feedback bekommt, dass man sagt, es ist ein sinnvolles Key Result oder es ist vielleicht nicht messbar oder formuliert es eher in die oder die Richtung. Es gibt ja so Tools online recht viel.",
            "start": 3339917,
            "end": 3356670,
            "confidence": 0.7836774193548387,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir haben, oder das habe ich sogar selber gebaut, einen eigenen Chatbot auf unserer Webseite. Wenn du ihn nett fragst, gibt er dir sogar Feedback. Wenn du ihn blöd oder nicht blöd, wenn du ihn komisch fragst, sagt er, du musst einen Berater anrufen. Aber wenn du den Prompt findest, den er irgendwie versteht, dann gibt er dir sogar recht ausführliches Feedback dazu. Das halte ich für vertretbar okay. Aber er gibt dir eher formal-juristische Antworten. Wie dir ein Anwalt sagt, das können Sie so oder so formulieren, das wird vor Gericht standhalten oder nicht. Aber ob du jetzt ein Haus oder ein Auto gekauft hast, Ist dem Anwalt egal. Der sagt, mit dem Vertrag haben sie den Gegenstand gekauft. Wahrscheinlich sicher oder unsicher. Aber was du jetzt damit kaufst, sagt der Anwalt. Punkt. Sie sind ja, also das ist nicht mein Ding. So ungefähr ist das wahrscheinlich da auch.",
            "start": 3356970,
            "end": 3401014,
            "confidence": 0.7650200000000004,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Immer wenn ich über Ziele nachdenke, dann kommt bei mir auch die Frage, wie sollten diese Ziele definiert werden, weil in der Realität gibt es Abhängigkeiten. Und du sagtest auch schon gerade, wie zum Beispiel bei den Vertragspartnern, ambitionierte Ziele, da kann es auch sein, dass du deine Realität drumherum mal ändern solltest, also dafür kämpfen solltest. Meine Frage ist eigentlich, macht es Sinn, Ziele, Key Results, Objectives zu definieren, die einen mittelmäßigen bis großen Anteil von Faktoren haben, die gar nicht unter meiner Kontrolle sind? Weil Abhängigkeiten in der Realität existieren. Klar, also ich rede jetzt nicht von Corona oder von dem Schiff, ein Schiff stellt sich im Suezkanal quer. Von sowas rede ich nicht.",
            "start": 3401285,
            "end": 3442509,
            "confidence": 0.8001637931034483,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Definier mal Abhängigkeit. Also ist es innerhalb deines Unternehmens oder außerhalb deines Unternehmens?",
            "start": 3442529,
            "end": 3447130,
            "confidence": 0.6857692307692308,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Innerhalb meines Unternehmens würde ich schon fast argumentieren, auf Basis unserer vorherigen Konversation, da das allein stattgefunden hat.",
            "start": 3447750,
            "end": 3454677,
            "confidence": 0.8365555555555555,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das ist gelöst. Du versprichst deinen Teil und ich verspreche meinen und Wolfgang einen anderen und dann sagen wir so, ah ja ok, jetzt legen wir mal die Sachen nebeneinander und vorausgesetzt wir erreichen alle das, was wir versprochen haben, dann passen die Bausteine zusammen und dafür brauche ich von dir das und du von mir das und irgendwann sagen wir halt stopp. A, B und C geht nicht, wollen wir jetzt A und C machen oder B und C oder doch D, dann haben wir das mal ausgekartelt und dann sind diese Abhängigkeiten weg.",
            "start": 3454697,
            "end": 3482704,
            "confidence": 0.7699894736842106,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber die Abhängigkeiten sind ja nicht weg, sondern du hast ja nur diskutiert, verhandelt, weil das andere Team, wenn das zu langsam ist, dann bin ja trotzdem irgendwie geblockt.",
            "start": 3482744,
            "end": 3493133,
            "confidence": 0.8069310344827586,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Natürlich. Aber schau dir die Realität heute an. Du hast nicht gesagt, ich kann wirklich nur A und B machen und mehr nicht, sondern du hast heute Anforderungen von A bis F und niemand sagt, lass das mal liegen, damit A und B wirklich passiert. Wir haben die Wahrscheinlichkeit deutlich gesteigert, dass das Team liefern kann, weil wir C bis F per Definition gesagt haben, das ist wahrscheinlich sinnvoll, nur nicht jetzt. Niemand fängt an, daran zu arbeiten. Das ist ja schon mal ein eklatanter Unterschied zu der Situation, wie es sonst so läuft.",
            "start": 3493193,
            "end": 3527599,
            "confidence": 0.8595425531914898,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich habe in letzter Zeit von verschiedensten Ecken eigentlich gehört, dass man vielleicht so wieder ein bisschen weggeht von diesen Zielen, die man nur selbst in der Hand hat, weil man sich irgendwie Innovation wegnimmt dadurch, dass man sich immer begrenzt auf nur seinen Rahmen, den man unter Kontrolle hat. Wie siehst du das?",
            "start": 3528120,
            "end": 3546486,
            "confidence": 0.8557407407407406,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also ich würde schon sagen, alles, was du im Unternehmen nicht verantwortest, weil du nicht die Leute hast, die das können, würde ich sagen, ist nicht dein Bereich. Also musst du dir, musst du die Leute fragen, die das machen können und die die Leute haben. Alles andere, was in deinem Bereich ist, unterliegt immer einer Unsicherheit. Also lass mal vereinfachen und wir gehen ins Marketing. Der Kunde ist leider nicht von mir zu beeinflussen.",
            "start": 3546546,
            "end": 3568963,
            "confidence": 0.7154933333333334,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Kurze Frage, also jetzt als Marketing Noob, ist das nicht eigentlich das Ziel von Marketing?",
            "start": 3568983,
            "end": 3573888,
            "confidence": 0.7608000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die manipulation von leuten also diese person.",
            "start": 3574381,
            "end": 3577884,
            "confidence": 0.771,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Zu bewegen ein produkt zu kaufen zum.",
            "start": 3577924,
            "end": 3579605,
            "confidence": 0.834,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Beispiel ja ja natürlich aber ich kann es versuchen wenn du sagst kein bock, oder gerade kein geld oder irgendwie meine bitcoin investitionen die liefen nicht so wie gedacht das ist jetzt gerade irgendwie weg oder inflation oder was auch immer, kann ich nichts machen also ja ich kann versuchen rauszufinden was wird dich am wahrscheinlichsten dazu bewegen dass du sagst ja will ich will unbedingt aber wenn es nicht machst entzieht sich das leider meinem einflussbereich. Ja und das ist in allen fällen so und dann wenn jemand sagt ja also sales oder marketing ja ich kann das kann ich jetzt nicht verantworten dass ein kunde kommt tatsächlich so nicht aber das ist schon unser ziel was du verantwortest, dass wir alles dafür tun dass er kommt und damit ist der rahmen also ja ich nehme diese sachen die ich nicht beeinflussen kann im außen, die muss ich ja schon in mein Ziel irgendwie einbeziehen, weil was sollte ich denn sonst sagen? Sonst kann ich nur sagen, ich kann mich nur auf den Input im Bescheid anzeigen. Das wäre ein komisches Ziel.",
            "start": 3579625,
            "end": 3638074,
            "confidence": 0.8029344262295076,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn jetzt einer unserer Hörer und Hörerinnen diese Episode hört und denkt, hört sich eigentlich alles ganz logisch an und ich schlage das meinem Chef mal vor, dann stelle ich mir die Frage, ganz viele Firmen haben versucht SAP einzuführen und sind gescheitert, weil.",
            "start": 3638094,
            "end": 3654568,
            "confidence": 0.8139090909090907,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hey, OKRs mit SAP zu vergleichen ist jetzt wirklich ein harter Schritt.",
            "start": 3655008,
            "end": 3659311,
            "confidence": 0.6824166666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Moment, Moment, ich komme darauf, warum ich den Vergleich ziehe. Und zwar sagt man bei SAP, du sollst SAP nicht an dein Unternehmen anpassen, du sollst nämlich dein Unternehmen und deine Workflows innerhalb des Unternehmens an SAP anpassen.",
            "start": 3660352,
            "end": 3671758,
            "confidence": 0.7987368421052632,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, würde ich auch sagen. Klingt und macht Sinn für Standard Software.",
            "start": 3671978,
            "end": 3674980,
            "confidence": 0.49183333333333334,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Meine Frage ist eigentlich, was muss denn eigentlich im Unternehmen angepasst sein, um sich mit OKRs mal auseinanderzusetzen? Ist zu schwach genannt, sondern um als Ziel zu haben, das einzuführen. Also was muss gegeben sein? Welche Strukturen? Wir hatten auch schon von Transparenz gesprochen, von Zielen und Co. Es ist ja, ich sag mal, ab und zu im guten klassischen deutschen Mittelstand nicht immer gegeben. Deswegen meine Frage, was muss im Unternehmen angepasst werden?",
            "start": 3676228,
            "end": 3702736,
            "confidence": 0.8320405405405407,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also angepasst würde ich immer sagen, abhängig davon, was man vorfindet. Also was braucht man? Eine Vision, eine Mission, eine Strategie. Dann brauche ich sowas wie ein Wertelayer, der irgendwie die Kultur beschreibt, dass sich die Leute darauf zurückberufen können, so wollen wir nicht miteinander umgehen, so wollen wir nicht mit Partnern umgehen, so wollen wir nicht mit Kunden umgehen. Das nennen wir so den, den Hygiene-Layer, das wäre ganz gut, wenn der irgendwie auch beschrieben wäre. Und dann brauchst du so ein bisschen entweder die richtige Kultur oder die passende Kultur, richtige ist schon ein schwieriger Begriff, aber die passende Kultur, wo man natürlich diese Experimentierfreude hat, wo man offen ist zu sagen, ja okay, wir müssen es ausprobieren und dann werden wir sehen, was dabei rauskommt. Und wenn ich die noch nicht habe, dann wäre hilfreich, wenn ich ein bisschen Neugierde mitbringen würde, also zu sagen, okay, klingt nach einer spannenden neuen Welt. Das haben wahrscheinlich schon vor mir Leute gemacht, also vielleicht können wir uns da mal drauf einlassen und ich bin bereit, mich auf den Weg zu machen. und sehe dann ein bisschen, was mich unterwegs da erwartet. Diese Veränderungsbereitschaft oder Neugier, die wäre natürlich hilfreich. Und wenn du sie nicht im ganzen Team hast, dann hast du sie idealerweise bei 51 Prozent und vor allen Dingen bei den Leuten, die am Ende final auch Entscheidungen treffen und beeinflussen können. Sonst wird es mühsam. Ich sage nicht, dass es nicht geht und nichts bringt, aber sonst wird es echt anstrengend, immer wieder gegen relevante Widerstände zu arbeiten. Das ist hochgradig frustrierend.",
            "start": 3703053,
            "end": 3791193,
            "confidence": 0.7953433962264151,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt, wenn ich das richtig raushöre, dann kann ich auch nicht OKRs jetzt nur in meinem Team zum Beispiel einführen, sondern.",
            "start": 3791745,
            "end": 3798910,
            "confidence": 0.8235454545454547,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Kannst du schon, optimiert halt nur was anderes. Also worüber wir ja nachdenken und was OKRs werden soll, ist die Optimierung des globalen Optimums. Also alle Ressourcen des Unternehmens arbeiten auf den Themen, die uns als Gesamtunternehmen in Richtung der Strategien, die wir wollen, am weitesten nach vorne bringen. Wenn das Gesamtunternehmen nicht mitmacht, geht das nicht. Und dann kannst du noch sagen, dann optimiere ich mein lokales Optimum. Das heißt, wie optimiere ich, dass die Ressourcen, die ich in meinem Team habe, so irgendwie zu dem passt, was ich da oben vorfinde. Weil du findest da oben ja dann keine übergeordneten Objectives und Key Results. Vielleicht findest du Strategien, vielleicht auch nicht. Vielleicht findest du einen Businessplan. Da musst du dich dann relativ gut selbst einnorden und gucken, wonach optimiere ich denn mein lokales Optimum eigentlich. Und das kann sein, dass du eine Sache optimierst und zwei Teams weiter jemand auf was ganz anderes. Und das kriegst du halt dann nicht raus. Und dadurch wird das auch mit der Abstimmung der Ressourcen untereinander wieder schwierig, weil vielleicht das Team, das die ganze Zeit Anforderungen an dich da reinpingt, die machen gar nicht mit.",
            "start": 3798930,
            "end": 3864714,
            "confidence": 0.8018969072164953,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt, in der Idealwelt kommt es von ganz oben, von der Spitze im Idealfall?",
            "start": 3865534,
            "end": 3870639,
            "confidence": 0.8140000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, oder zumindest mal in der Endausbaustufe steuern wir das ganze Unternehmen damit, weil es die Idee ist, dass wir Businessagilität haben und das heißt, man muss schon das Business damit steuern und nicht nur Teilideen davon. Und wenn ich weiterhin sage, ja, wir haben ja unseren Businessplan und den gilt es zu erreichen, egal, Also alles andere interessiert mich nicht, der ist zwölf Monate alt, aber wir müssen es trotzdem hinkriegen. Dann ist ja die Grundannahme von Agilität schon in Frage zu stellen.",
            "start": 3870879,
            "end": 3895787,
            "confidence": 0.7972976190476192,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also Visionen statt Businessplan in dem Fall.",
            "start": 3895827,
            "end": 3897469,
            "confidence": 0.5252857142857142,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn wir schauen, dass die Vision nicht ist, wir sind Marktführer, wir machen 200 Millionen Umsatz oder wir sind stärker als alle anderen, sondern dass die Vision ist, wir haben ein relevantes Problem, was viele Leute haben gut gelöst, dann hat man nämlich erstaunlicherweise ein Business. Wenn das im Zentrum der Betrachtung steht und in der Mission runtergebrochen wird, was sind die relevanten Teile, die wir brauchen, um das Problem gut und zuverlässig schnell und günstig oder was auch immer da die determinanten sind zu lösen dann habe ich schon extrem viel von dem nordstern in die richtige ecke des spielfelds gelegt wenn da selbstreflektive ziele drin sind also wir sind besser als die anderen wir sind groß wir sind erfolgreich dann weiß halt niemand wie machen wir das und unten denkt mal irgendeiner jemand über den kunden nach und da fängt dann die ganze pyramide schon an kopf zu stehen und deswegen finde ich muss man damit anfangen.",
            "start": 3897753,
            "end": 3950516,
            "confidence": 0.8466792452830187,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Einer meiner vorherigen Vorgesetzten, ich war immer im operativen Betrieb von Infrastruktur und so weiter tätig, der sagte immer, wer Visionen hat, soll zum Arzt gehen.",
            "start": 3951369,
            "end": 3959792,
            "confidence": 0.8406538461538463,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber es heißt ja, habe ich jetzt gelernt, Visionen. Und wenn man eine Vision hat, muss man nicht zum Arzt vielleicht.",
            "start": 3960031,
            "end": 3966617,
            "confidence": 0.4954761904761905,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Oh, harter Konter.",
            "start": 3966677,
            "end": 3968098,
            "confidence": 0.7856666666666667,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Sehr gut.",
            "start": 3968138,
            "end": 3968979,
            "confidence": 0.923,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist einer der besten Konter, die ich je gehört habe dazu. Aber ich stelle mir jetzt gerade so die Frage, okay, meine Firma hat eine Strategie. Meine Firma hat vielleicht jetzt noch keine Vision und Mission. Wie kann ich denn als einfacher Mitarbeiter, ich meine, ich weiß nicht, ob es sich jeder traut, aber man kann jetzt nicht zum Chef und zur Chefin gehen und sagen, Hey, sorry Emma, okay Ars, ich habe gehört in dem Podcast, wir brauchen eine Vision, vorher geht das nicht.",
            "start": 3968999,
            "end": 3991557,
            "confidence": 0.6955930232558141,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Warum denn nicht?",
            "start": 3991878,
            "end": 3993039,
            "confidence": 0.4713333333333334,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich finde das sogar gut, sendet alle diese Episode zu euren Chefinitäten, das ist perfekt.",
            "start": 3993059,
            "end": 3997202,
            "confidence": 0.6392666666666666,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Absolut. Also die Frage ist ja immer, was soll denn passieren? Also wenn du glaubst, wenn du die Annahme hast, dass es stimmt, dass es danach besser wird als es vorher ist, dann ist es ja nicht nur dein Eigeninteresse, sondern dann funktioniert das Unternehmen ja besser, die Zusammenarbeit wird besser. Also irgendwie alle haben mehr Spaß und es kommt mehr dabei raus. Das ist ja die Hypothese. Und wenn du sagst, ich habe was gefunden, was wir noch nicht haben, was, wenn wir es hätten, wahrscheinlich uns weiter nach vorne bringt, aber ich traue mich nicht zu sagen, muss man sich ja schon mal über die Kultur vielleicht so ein Fragezeichen machen oder sich selbst die Frage stellen, was habe ich denn zu verlieren eigentlich?",
            "start": 3997222,
            "end": 4030623,
            "confidence": 0.7689365079365077,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also ich meine, die psychologische Sicherheit wird dann mit hoher Wahrscheinlichkeit nicht gegeben sein, aber offengesprochen ist das natürlich auch die Realität in vielen Firmen.",
            "start": 4030963,
            "end": 4037949,
            "confidence": 0.6712,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Auf jeden Fall, aber so, und jetzt kannst du dir die Frage stellen, der einzige limitierende Faktor in deinem Leben ist Zeit. Wie viel deiner Zeit wirst du damit verbringen, in einem Umfeld rumzuwurschteln, wo du denkst, ich hab zwar ganz geile Ideen, aber ich kann sie nicht sagen. Oder eure Zielgruppe hat zufällig ziemlich brauchbare Skills.",
            "start": 4037989,
            "end": 4055865,
            "confidence": 0.7505964912280703,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ganz zufällig ja.",
            "start": 4056185,
            "end": 4058126,
            "confidence": 0.19000000000000003,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und wenn man dann irgendwie sagt so, naja gut, irgendwie mit dem was ich kann, werde ich wahrscheinlich nicht stark unter der Brücke enden und wenn ich hier in dem Umfeld mit den Sachen, die ich voller Überzeugung mir überlege, und das heißt ja nicht, dass sofort passieren muss und das alles richtig ist, aber man kann ja mal drüber reden, wenn ich das nicht hinkriege, kann ich mir schon die Frage stellen, ist meine Zeit irgendwie woanders vielleicht besser eingebracht?",
            "start": 4058166,
            "end": 4080923,
            "confidence": 0.7907160493827162,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die ganze Sache, die Einführung von OKRs oder, wenn wir früher anfangen, die Definition einer Vision und Mission, ist ja alles ein Change-Prozess. Das hattest du ja auch schon vorhin erwähnt. Meine Frage wäre jetzt hier, wenn ich als Geschäftsführer jetzt ein Gespräch hätte mit einer Mitarbeiterin, okay, wir brauchen eine Vision, dann beschäftige ich mich natürlich erstmal damit, was ist das und so weiter, dann fahre ich erstmal in Urlaub, dann denke ich darüber nach und das, ne? Und all sowas. Ich meine, wie lange würdest du denn aus deiner Erfahrung auch vielleicht sagen, die einführung von okas braucht zeit reden wir jetzt hier von nach zwei quartalen läuft das oder würdest du sagen gegebenermaßen wir haben eine strategie wir haben eine vision wir haben eine mission nach einem jahr sollte das laufen nach vier quartaten eine.",
            "start": 4081323,
            "end": 4122837,
            "confidence": 0.7614927536231885,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Klassische software entwickler antwort kann ich dir nicht genau sagen, It depends. I don't know, also it depends. Was ich dir genau sagen kann ist, wie lange dauert es von einem weißen Blatt zu einem Visionsvorschlag zu kommen, der belastbar ist? Zwei Tage.",
            "start": 4122877,
            "end": 4140272,
            "confidence": 0.6863255813953487,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Zwei Tage? Du meinst das Offside jetzt?",
            "start": 4140292,
            "end": 4142474,
            "confidence": 0.5932857142857142,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, das ist ein anderes Offside, aber zwei Tage. Und das kann ich dir mit ziemlicher Treffsicherheit sagen, weil ich es schon so oft gemacht habe, dass ich relativ konfident damit bin, dass man nach zwei Tagen da rausgeht und sagt, okay, das beschreibt das, was wir hier in dem Unternehmen machen und vorhaben und gut finden, irgendwie ganz okay. Also vielleicht ist es noch nicht druckreif und vielleicht kann man auch über das eine oder andere Wort feilen und an der Formulierung noch ein bisschen rumschnippeln und vielleicht ändert man es auch in einem halben oder zwei Jahren nochmal, aber okay, it's pretty good.",
            "start": 4143175,
            "end": 4172000,
            "confidence": 0.7207619047619053,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Inwieweit würdest du denn sagen, dass bei der Definition von einer Vision externer Input, also jemand, der vielleicht gar nicht wirklich Steak im Business hat, der da sitzt und sagen kann, ist das wirklich so? Also der dich challengen. Wie essentiell ist das für sowas?",
            "start": 4172680,
            "end": 4190464,
            "confidence": 0.8018222222222224,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich werde immer gefragt, kann man Visionen auch ohne Berater entwickeln? Dann sage ich ja, wenn man es kann, schon. Ich weiß es nicht, es kommt auf die Leute an, wenn die irgendwie ein starkes Verständnis von, wie tickt so eine Vision, ist es nicht wir, ist es das, wie ich die Welt sehen will, in der ich mich bewege, wenn das schon alles vorhanden ist und man dann über Worte feilt und irgendwie sich rechts und links reibt, weil der eine ein bisschen mehr weiter links will und der andere, dann finde ich, geht es super ohne externen Input. Wenn drei Leute dabei sind, die sagen, naja, Damals wollten wir der größte Bremsenhersteller werden, jetzt wollen wir der größte whatever, you name it, und fertig ist der Lack. Dann brauchst du vielleicht schon jemanden, der sagt, ja, kannst du so machen, aber richtig geil wird's nicht. Geh mal auf die Straße, sag das Leuten und sag, haben sie Bock für mich zu arbeiten? Und du wirst feststellen, so haaa. Nö, da möchte ich doch woanders mit. So, und da musst du dich so ein bisschen selbst einsortieren, wie ist die Teamstruktur und auf was für Leute trifft man dann. Aber grundsätzlich, also Reflektionsraum hilft immer. Ich sage aber nie, man braucht für alles einen Berater. Brauchst du halt nicht. Aber wenn es schnell gehen muss und passen soll, hilft es halt manchmal.",
            "start": 4190504,
            "end": 4262662,
            "confidence": 0.7615064377682409,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also das ist damit jetzt schon das Wahlversprechen von euch, oder? Von Murakami, von dir und deinen, ich glaube zwölf Leute seid ihr, oder? Wenn man euch bucht, zwei Tage gibt es eine Vision.",
            "start": 4263002,
            "end": 4272281,
            "confidence": 0.7736176470588234,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Zwei Tage gibt es eine Vision, zwei Tage gibt es Strategien. Das ist nicht zu verwechseln mit, hey, wir sind eine Horde McKinseys und friemeln irgendwie sehr tief in deinem Geschäftsmodell rum und sagen dir, wie du es machen sollst, sondern wir haben einen Prozess entwickelt, der das Wissen in dem Unternehmen versucht, quasi rauszutauchen und da ein paar Trade-offs sicher zu machen und dann sicher auch eine Perspektive hat, wie man Trade-offs entscheiden kann. Und das ist je nach Komplexitätsgrad natürlich. Mit multinationalen Konzernen tut sich der Prozess ein bisschen schwierig, da gibt es andere. Aber da kannst du auch in so einem Zwei-Tage-Strategie-Retreat, nennen wir das, kannst du auch extrem viele Karten sortieren, die eine Entscheidung treffen, die darunter 1000 Entscheidungen überflüssig machen. Und das ist ja der große Wert von Strategie. Da kann man dann noch extrem viel tiefer rein und kann das irgendwie alles aufbereiten und so, gar keine Frage. Und Research muss man auch manchmal machen. Aber so eine gute Ausgangsbasis kriegt man auch damit ziemlich sicher ein.",
            "start": 4272969,
            "end": 4327705,
            "confidence": 0.7736531791907512,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also dass du nicht auf McKinsey-Ebene agierst, glaube ich, hat man jetzt mitbekommen. Zumindest wenn Leute bis jetzt durchgehalten haben in dieser Episode.",
            "start": 4328066,
            "end": 4336260,
            "confidence": 0.7423913043478261,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hoffe, wir haben sie nicht gelangweilt.",
            "start": 4336300,
            "end": 4337502,
            "confidence": 0.8094285714285715,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "War super spannend. Jetzt, du in deinem Podcast fragst deine Gäste ja, die immer auch super interessant sind. Du hattest gerade in der letzten Episode, die hat mir auch super gut gefallen, mit Ulrike Herrmann über den Kapitalismus. Also es geht wirklich sehr weit in deinen Podcast-Episoden und deinen Gästen. Jetzt du fragst immer am Ende, was die Gäste für ein Buch empfehlen können oder für ein Podcast. Podcast kannst du ja sicher deinen eigenen empfehlen, aber den haben wir jetzt eh schon empfohlen.",
            "start": 4338599,
            "end": 4362294,
            "confidence": 0.725761904761905,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Würde ich nicht machen, aber ja.",
            "start": 4362334,
            "end": 4363135,
            "confidence": 0.168,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber wenn sich jetzt Leute auch in dem ganzen Bereich OKRs weiterbilden wollen, jetzt hast du schon gesagt, das eigentliche Buch da, wie heißt es, genau, kannst du jetzt nicht so empfehlen, habe ich jetzt so durch die Blume irgendwie herausgehört, wenn du jetzt was empfehlen wollen würdest in dem Bereich, damit sich jemand vorbereiten kann, um dann zu seiner Chefin zu gehen und zu sagen, hey, lass uns doch OKRs einführen, was würdest du denn empfehlen?",
            "start": 4363735,
            "end": 4388329,
            "confidence": 0.7552077922077924,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das klingt jetzt blöd. So richtig kann ich keins von OKR-Büchern empfehlen, weil es nicht meiner Gedankenwelt entspricht. Und ich habe es noch nicht geschafft, mein eigenes Buch. Wir bauen gerade so einen kleineren Guide. Wir haben so einen T3N-Guide. Also bei T3N gibt es so einen OKR-Guide von uns. Da findet man viel zu dieser Überlegung des Frameworks. Und ich sage nicht, dass die anderen nicht gut sind. Ich sage nur, die entsprechen nicht meiner Gedankenwelt und deswegen würde ich sie persönlich nicht empfehlen. Man kann aber dadurch sicher ein gutes Bild zu anderen Gedankenwelten in dem Thema kriegen. Wenn man mehr zu meinem Ansatz verstehen will, dann bietet sich unser Online-Kurs an. Das kann man dann in zwei bis vier Stunden irgendwie machen und dann hat man wirklich die komplette Theorie mit Workbook und so mal durchlaufen, um dann zu wissen, Was heißt denn das dann operativ alles? Das hielt ich für den besseren Weg, um so dieses Basiswissen zu vermitteln, weil wir das auch machen, wenn wir in Unternehmen OKRs ausrollen, um sicherzustellen, dass alle Mitarbeitenden das gleiche Bild davon haben und jedem ein Buch zu geben, hey, lies mal. Da fand ich die Eintrittswahrscheinlichkeit ein bisschen gering. Jemandem zu sagen, hier sind irgendwie zwei bis vier Stunden Video je nach Ausführung. Schau dir das bitte mal an, bevor es losgeht. Das funktioniert ziemlich zuverlässig mit ein bisschen Nachdruck oder nicht Nachdruck, sondern mit Nachhalten sozusagen. Von daher ist das unser Weg. Und das wäre der erste Touchpoint, den ich wahrscheinlich empfehlen würde.",
            "start": 4388978,
            "end": 4478811,
            "confidence": 0.82540234375,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und sonst kann man euch ja durchaus kontaktieren, um noch mehr Leistungen zu bekommen. Jetzt meine Frage noch, hast du sonst irgendwie eine Empfehlung, jetzt abseits der OKRs, was dich aktuell beschäftigt, irgendeine Empfehlung?",
            "start": 4479131,
            "end": 4491000,
            "confidence": 0.8428529411764706,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was mich aktuell beschäftigt? Das ist die Frage, ob wir noch, wie viel Zeit wir noch haben.",
            "start": 4491040,
            "end": 4495843,
            "confidence": 0.5828235294117646,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du darfst nur ein Buch nennen.",
            "start": 4495883,
            "end": 4497244,
            "confidence": 0.7673333333333333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nur ein Buch? Oh, okay. Ich habe die vier Bände der Philosophiegeschichte von Precht gelesen. Gilt das als ein Buch?",
            "start": 4497304,
            "end": 4505050,
            "confidence": 0.7002999999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das geht sicher als ein buch als klingt klingt eher älter wenn du was.",
            "start": 4505827,
            "end": 4509250,
            "confidence": 0.7627142857142858,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee das ist der vierte band ist letztes diesen letztes jahr im oktober oder so. Also es ist in der tat nicht älter was ich auch das hat zwar ein zweites buch aber ich sehr gerne mag es der hat der hat ein extrem gutes buch geschrieben finde ich und da kommt man auch sehr gut in seine denkwelt irgendwie rein.",
            "start": 4509891,
            "end": 4531210,
            "confidence": 0.7850819672131149,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es ist principles.",
            "start": 4531573,
            "end": 4532033,
            "confidence": 0.15933333333333333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Principles, genau. Das würde ich auch, ja.",
            "start": 4532073,
            "end": 4536637,
            "confidence": 0.4952857142857142,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay.",
            "start": 4536657,
            "end": 4536997,
            "confidence": 0.406,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hatte Erfahrung mit, es wurden mal OKRs eingeführt. Ich habe das Measure What Matters Buch gelesen, unter anderem auch zur Vorbereitung für den Podcast, aber auch, weil ich immer irgendwie in Organisationen lande, die sich an OKRs versuchen. Und ich hatte immer so viele Fragen. Und im Internet, wenn man diese Fragen googelt, dann habe ich immer das Gefühl, die plappern immer das Buch nach. Also die erklären die Frage mit der eigenen, also die versuchen die Frage zu beantworten mit der eigenen Frage. Und da stehe ich da immer so, hä? Du hast jetzt gerade einfach mal gesagt, dass mit den ambitionierten Zielen und dass man die dann jetzt gar nicht komplett erreichen kann und Burnout und so weiter. Also du hast mir endlich mal Antworten auf meine Fragen gegeben.",
            "start": 4537017,
            "end": 4571457,
            "confidence": 0.7789772727272725,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das freut mich.",
            "start": 4572058,
            "end": 4572838,
            "confidence": 0.413,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Deswegen möchte ich dir danken für diese fast anderthalb Stunden, die du mit uns verbracht hast. Das respektiere ich sehr und sage auch vielen, vielen lieben Dank. Also mein Verständnis von OKR hast du auf jeden Fall gestärkt. Du hast einen nachhaltigen Effekt zumindest bei mir ausgelöst. An alle anderen natürlich, an alle Hörerinnen und Hörer, Wir haben alle Links, die wir erwähnt haben, von der Murakami-Agentur, über den Podcast, über die Bücher, die ernannt wurden, Management by Objectives, das Google-OKR-Playbook, der agile Führungs- mit OKR-Guide von Tetra N, der Online-Kurs, aber auch die Buchempfehlungen sind alle in den Shownotes, falls ihr also etwas Geld bei Murakami ausgeben wollt. Ich denke, da wird kaum Nein gesagt. Wir wehren uns nicht. Und da bekommt ihr natürlich deutlich spezifischere Antworten auf eure Fragen, als wir das hier im Podcast behandeln konnten. Vielen lieben Dank, Marco. Es hat mir sehr viel Freude bereitet. Ich hoffe, du hast auch etwas Freude gehabt und nimmst mir den Vergleich mit SAP und OKAS nicht liebe.",
            "start": 4572878,
            "end": 4639385,
            "confidence": 0.8147218934911239,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich hatte auf jeden Fall viel Freude. Also mir hat es großen Spaß gemacht und ich finde, Wir haben sehr spannende Punkte, die vielleicht für die einen Zuhörerinnen und Zuhörer auch spannend sein könnten, beleuchtet. Also von daher vielen, vielen Dank für die guten Gesprächsführungen auch. Also mir hat es Spaß gemacht.",
            "start": 4639425,
            "end": 4654077,
            "confidence": 0.7313846153846153,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vielen, vielen Dank. Es waren, glaube ich, super viele interessante Dinge dabei. Und sonst kann ich eben deinen Podcast nur empfehlen. Da kommen noch wesentlich mehr Fragen aus der Praxis immer auch mit rein und auch Dinge wie die Zukunft so. Ja, was uns so erwartet in der Zukunft mit sehr interessanten Gesprächspartnern. Also vielen Dank auch für deinen Podcast und auch für diese Episode.",
            "start": 4655042,
            "end": 4674457,
            "confidence": 0.8186615384615382,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Danke dir.",
            "start": 4674497,
            "end": 4676038,
            "confidence": 0.558,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Tschüss zusammen. Ciao.",
            "start": 4676058,
            "end": 4676799,
            "confidence": 0.17266666666666666,
            "speaker": "C",
            "channel": null
        }
    ],
    "confidence": 0.789521565836298,
    "audio_duration": 4683.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}