{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/wfFmoMqismBH74k/download/ep112_enginering_pendel.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "12bacd9d-db04-467b-83a8-a0ddf8e0d1af",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Wenn man mal Manager war und so Teamverantwortung hatte und dann wieder IC wird, ... ... man hat immer noch diese Denkweise, dieses Mindset von einem Manager. Man weiß, okay, mein Manager, der ist auch nicht allwissend, weil ich war es als Manager auch nicht. Wenn ein Engineer zum Manager kommt und sagt, ich habe da so und so ein Problem, dann hat der Manager nicht die Antwort parat, weil er meistens auch nicht, er steckt ja nicht so tief drin wie der Engineer in der Regel. Er kann oft nur helfen, dem Engineer die Lösung selber zu finden. Und wenn du das als Engineer weißt, dann sparst du dir manchmal den Schritt, ... zu deinem Manager zu gehen und den um die Lösung anzubetteln quasi, ... ... sondern du weißt, okay, der ist auch nicht schlauer als ich oder allwissend, ... ... dann probiere ich erstmal selber eine Entscheidung zu fällen und eine Lösung zu finden.",
            "start": 2483,
            "end": 58083,
            "confidence": 0.8272165605095535,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wenn der Wechsel vom Software-Engineer zur Managerin eine Beförderung ist, ist dann der Wechsel vom Manager-Dasein zurück zum Hands-on-Software-Engineer eine Dekretierung? Und was ist, wenn man dann später womöglich nochmal wieder Engineering-Manager wird? Was soll dieses Hin und Her? In der Branche hat sich dafür ein Begriff etabliert, das Engineering Manager Pendulum. Aber ist das gesund und das Herumgehobse denn akzeptiert in der Branche? In dieser Episode sprechen wir mit Tom Bartel, der diesen Wechsel schon mehrfach und auf verschiedenen Ebenen durchgeführt hat. Wir sprechen über die initialen Gedanken zum Pendeln und wie diese entstanden sind. wie sein Umfeld und das eigene Unternehmen darauf reagiert haben, wie schwierig es eigentlich ist, andere Perspektiven und Flughöhen in der täglichen Arbeit anzupassen, welche Vorteile die Pendelbewegung haben kann und natürlich, was Tom Leuten raten würde, die ebenfalls darüber nachdenken, herum zu pendeln. Also pendeln wir einfach mal direkt drauf los. Viel Spaß! Ihr habt wieder mal das große Vergnügen, wirklich neben Andi zu sitzen. Also das haben wir, oder haben wir das überhaupt schon mal geschafft?",
            "start": 61948,
            "end": 135344,
            "confidence": 0.8365919540229884,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir haben schon mal eine Podcast-Ausnahme in persona gemacht. Das ist korrekt, ja. Ganz am Anfang, ich glaube Episode 1 oder 2. Aber ob ich das als erfolgreiche Podcast-Episode bezeichnen würde, weiß ich jetzt gerade auch nicht mehr. Aber zumindest nicht in den letzten anderthalb Jahren.",
            "start": 135364,
            "end": 148350,
            "confidence": 0.7844130434782606,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und nachdem wir nebeneinander sitzen, sprechen wir heute mal über ein Thema, was uns beide stark betrifft. Und zwar, wir sind ja beide so eher aus der Engineering-Manager-Ecke. Und wenn man sich das so überlegt, heutzutage, oder vielleicht nicht heutzutage, was man damals so gesagt hat, man wird irgendwie Softwareentwickler, bildet sich dann weiter, irgendwann übernimmt man dann ein Team, das ist der große Schritt, wenn man so ein Team übernimmt, dann befördert wird und wirklich zum Engineering-Manager wird. Und normalerweise geht man dann die Karriere weiter, weiter und weiter, so wie es halt in den 60er Jahren so der Standard war. Und wenn man das aber heute sich anschaut und zum Beispiel auf Andis Karriere schaut, Andi hat sich dann wieder zurückentwickelt. Und ob das wirklich eine Zurückentwicklung ist, werden wir noch klären. Aber wir haben jemanden heute zu Gast, der nämlich noch mehr Wechsel durchgeführt hat, vom Individual Contributor, also vom ganz normalen Entwickler, zum Lead, zurück, dann wieder zum Lead und wieder zurück und jetzt ganz neu sogar auf Director Level, also Lead von Leads. Also den absoluten Spezialisten, würde ich mal sagen, im Herumspringen. Und genau darüber werden wir heute mal sprechen, wie das mit diesem Herumspringen so ist, ob man das darf, ob man das soll und wie viel Sinn das Ganze macht. Willkommen Tom.",
            "start": 149168,
            "end": 226212,
            "confidence": 0.8311909090909092,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also Wolfgang, so wie du es gerade beschrieben hast, hört sich das an, als würde der Tom Stellen wechseln, wie Unterhosen. Und das macht mir ein bisschen Angst. Ne, aber in der Tat. Wir sprechen heute über das sogenannte Engineering Management Pendulum. Das Engineering Manager Pendel lässt sich vor allem innerhalb von größeren Unternehmen mit moderner Firmenkultur umsetzen. So eine Kultur findest du auch bei unserem Episodensponsor Eurowings Digital. Auch dort hat es bereits Pendelbewegungen von MitarbeiterInnen gegeben. Eine hundertprozentige Tochter von Eurowings, die aber eigenständig und in eigenen Büroräumlichkeiten eine Startup-Atmosphäre lebt. Mit einem internationalen Team bestehend aus über 40 Nationen und Englisch als Firmensprache wird dort unter anderem mit Java im Backend, Vue.js im Frontend und Kotlin sowie Swift für die Mobile-Apps gearbeitet. Fürs Data Crunching werden Python, Scala und die Databricks Plattform verwendet. Im Hybrid Setup oder Fully Remote genießt man trotz Startup Setup auch die vielen Fluggesellschafts-Benefits wie Standby-Fliegen und Jahresurlaubsflug. Das ist mal was anderes als der Standard Obstkorb. Interesse geweckt, um in einem modernen Team abzuheben? Alle Informationen zu den offenen Positionen findest du unter engineeringkeyers.dev slash eurowings oder, wer zu faul zum Tippen ist, natürlich auch in den Shownotes. Bei der Vorbereitung habe ich mich natürlich die Frage gestellt, wer ist eigentlich Tom? Und wenn man die Recherche beginnt, beginnt man heutzutage wo? Viele Leute sehr wahrscheinlich bei JGPT, ich bei Google. Wenn man nämlich den Namen Tom Bartel bei Google eingibt, dann habe ich natürlich mich gefragt, welcher ist denn jetzt der wahre Tom, mit dem ich das Interview führe? Du bist, glaube ich, kein Facharzt für physikalische und rehabilitative Medizin aus Hamburg.",
            "start": 227003,
            "end": 327171,
            "confidence": 0.8100147601476014,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Sehr weit, ich weiß nicht.",
            "start": 327591,
            "end": 328351,
            "confidence": 0.267,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du bist auch kein Keramik-Künstler aus Cleveland, Ohio?",
            "start": 328988,
            "end": 331829,
            "confidence": 0.7608750000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Sicher nicht.",
            "start": 331869,
            "end": 333110,
            "confidence": 0.8445,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Spielst du denn Fußball bei Posterium United Dortmund in der Kreisliga C Dortmund 6?",
            "start": 333150,
            "end": 338543,
            "confidence": 0.8062857142857143,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nee.",
            "start": 338553,
            "end": 340373,
            "confidence": 0.784,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Dann wirst du sehr wahrscheinlich der Mensch sein, der sich selbst als Softwareentwickler, Engineering-Manager, Speaker und Human-Communication-Geek bezeichnet, denn du bloggst regelmäßig über diese Themen wie Software-Management, People-Management und Communication. Und du bist auch sehr in der Lehre zu Hause, nämlich hast du einen Udemy-Kurs zum Thema Dein Einstieg in Node.js professionell und komplett aufgenommen, den du sogar noch, ich glaube, Mitte letzten Jahres aktualisiert hast.",
            "start": 340413,
            "end": 368974,
            "confidence": 0.8283181818181814,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, mini bisschen. Ich habe ein paar Kommentare beantwortet.",
            "start": 368994,
            "end": 372978,
            "confidence": 0.7107777777777778,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aktualisierung ist Aktualisierung. Und du hast im Oktober 2022 einen neuen Grill gekauft und hast dich dann über Twitter bei Burnhard Grill über die Verpackung der Kleinteile beschwert.",
            "start": 373478,
            "end": 384869,
            "confidence": 0.8277857142857145,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und ich würde gerne wissen, wie erfolgreich war deine Beschwerde? Ich habe keine Antwort bekommen, glaube ich. Oder vielleicht habe ich auch nur nicht nachgeguckt.",
            "start": 384909,
            "end": 393496,
            "confidence": 0.78156,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wir sollten das retweeten. Vielleicht haben wir mehr Power.",
            "start": 394297,
            "end": 396719,
            "confidence": 0.6124444444444445,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Mit eurer Reichweite, ja, vielleicht wird das was. Es war eine große Verpackungsflut, sagen wir so, und ich fand es ein bisschen übertrieben.",
            "start": 397860,
            "end": 405184,
            "confidence": 0.7108695652173914,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich hoffe denn, aber deine Essenszubereitung auf diesem Grill ist erfolgreich?",
            "start": 405224,
            "end": 409606,
            "confidence": 0.8521818181818183,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die ist tadellos, ja. Also der Grill ist sehr gut. Aber zum Thema regelmäßig bloggen, es ist weniger regelmäßig geworden. Ich glaube, mein letzter Post liegt auch schon zwei oder drei Jahre zurück.",
            "start": 409626,
            "end": 421952,
            "confidence": 0.7748787878787878,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber so ähnlich wie unsere Episoden machst du ja so Evergreen-Posts und darum haben wir die auch extrem oft erwähnt. Also ich glaube alle, die uns regelmäßig zuhören, die müssten eigentlich schon mindestens fünfmal mit einem Link konfrontiert worden sein von dir, weil du natürlich auch über deine Reisen gebloggt hast und wir die ja natürlich immer gern referenzieren, weil es einfach super Blogartikel sind, die da Bisschen Insights geben, die man sonst eigentlich ganz selten findet online. Und der Andi hat schon angesprochen, wir sprechen über dieses Pendulum. Ihr habt übrigens nachgeschaut, Andi, weil wir sind ja ein deutscher Podcast. Was das auf Deutsch heißt, das heißt Pendel. Also das Engineering Manager Pendel.",
            "start": 422672,
            "end": 464673,
            "confidence": 0.7630263157894739,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Heißt das bei euch auch Pendel?",
            "start": 464713,
            "end": 466213,
            "confidence": 0.5451666666666667,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "In Österreich heißt es auch Pendel, ja. Also so international ist dieses Wort, ja.",
            "start": 466253,
            "end": 470355,
            "confidence": 0.7839285714285715,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Muss man ja immer sicher gehen auch. Könnte ja auch anders heißen.",
            "start": 470375,
            "end": 474176,
            "confidence": 0.43575,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Der Dom kommt ja übrigens fast aus meiner Heimat. Schwarzwald ist ja quasi fast direkt in Österreich.",
            "start": 474890,
            "end": 482685,
            "confidence": 0.8647647058823529,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist ein Katzensprung, ja.",
            "start": 482705,
            "end": 483987,
            "confidence": 0.44139999999999996,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau. Aber bevor wir in dieses Thema einsteigen oder vielleicht zum Einstieg in dieses Thema, Andi, erklär mal du, wie du dieses Pendel verstehst, das Engineering-Kiosk-Pendel und woher dieses eigentlich kommt.",
            "start": 484007,
            "end": 495338,
            "confidence": 0.8268387096774193,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das Engineering-Kiosk-Pendel?",
            "start": 495798,
            "end": 498500,
            "confidence": 0.6035,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das kenne ich jetzt auch nicht.",
            "start": 498540,
            "end": 499641,
            "confidence": 0.8471666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das mache ich heute Abend. Ich bin heute Abend von Mönchengladbach nach Duisburg gependelt zum Engineering-Kiosk und danach pendel ich wieder von Duisburg nach Mönchengladbach zurück.",
            "start": 500262,
            "end": 511370,
            "confidence": 0.8025000000000002,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Erstmal willkommen in einer der schönsten Städte Duisburgs.",
            "start": 511835,
            "end": 513918,
            "confidence": 0.43574999999999997,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Auf jeden Fall.",
            "start": 513957,
            "end": 514839,
            "confidence": 0.329,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und wir haben österreichisches Bier, also es kann nichts besser werden.",
            "start": 514919,
            "end": 517441,
            "confidence": 0.6803636363636364,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das ist die perfekte Kombi.",
            "start": 517702,
            "end": 519644,
            "confidence": 0.4703333333333333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Nein, was ist das Engineering Management Pendulum? Pendel, Entschuldigung, wir sind ein deutschsprachiger Software Engineering Podcast. Was ist das Engineering Manager Pendel? Und zwar ist meine simplifizierte Beschreibung so, dass wenn man Software Engineer ist oder ein sogenannter IC Individual Contributor, das ist für mich die Bezeichnung, jemand der die wahre Arbeit macht, der wirklich Hands-on macht, der den Profit für die Firma wirklich mit der Schaufel aus der Miene rausträgt, Und dann vielleicht in irgendeine Managementrolle wechselt, dass man dort nicht gefangen ist, sondern dass man vielleicht sogar auch wieder, Achtung, zurückpendeln kann zum Individual Contributor. Und dass man sagt, okay, vielleicht war das Management nix für mich, vielleicht möchte ich diese Rolle nicht. Aber vielleicht sagt man auch, hey, nach 25 Jahren im Management möchte ich mal wieder an die Front, dass das nämlich keine Schande ist. Also ein Pendel, dass man hin und her pendeln kann.",
            "start": 519664,
            "end": 575831,
            "confidence": 0.8310201342281878,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Über dein erstes Pendel oder deine erste Pendelbewegung haben wir schon mal in irgendeiner Episode gesprochen, die wir gerne dann unten in den Show Notes verlinken, ich habe sie leider vergessen. Aber Tom, wann war denn deine erste Pendelbewegung und warum hast du dich überhaupt entschieden, da wieder in irgendeiner Form aus deiner Engineering-Manager-Rolle zurückzukehren in die normale Welt, unter Anführungszeichen?",
            "start": 576841,
            "end": 599976,
            "confidence": 0.7611639344262292,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, also das Engineering Manager bin ich geworden in einer Phase, wo Trivago, wo ich da gearbeitet habe, wo gerade viele Leute eingestellt hat. Ich bin schon direkt mit sieben Direct Reports eingestiegen, also sieben, die mir zugeordnet waren. sieben engineers und das ist dann rasant angewachsen auf 10 auf 12 auf 15 bis auf 20 und kannst dir vorstellen wenn du people management machst für 20 leute da bleibt dann nicht mehr viel von der technik übrig Und ja, da war ich aber halt noch Anfang 30 sowas. Und dann mit Anfang 30 als Softwareentwickler zu sagen, okay, das war's jetzt für mich mit der Technik, das ist irgendwie, ist ein bisschen erschreckend, weil du wirst natürlich schwächer, was die technischen Fähigkeiten betrifft. Du bist nicht mehr, hast keine Zeit, dich bei allem auf dem Laufenden zu halten. Du hast keine Übungen im Programmieren mehr, so wie vorher. ... dann stellt man sich irgendwann die Frage, ... ... okay, wenn ich jetzt mal doch die Firma wechsle, ... ... was ja durchaus vorkommt, ... ... was kann ich dann eigentlich vorweisen ... ... so als Fähigkeiten? Mein Status als Experte ... ... in irgendeiner Technik, ... ... der wird immer schwächer ... ... und das ist dann irgendwann auch kein ... ... Verkaufsargument mehr in einem Vorstellungsgespräch ... ... und wenn ich dann sage, ... ... ja, ich habe aber People Management ... ... für 20 Leute gemacht, ... ... dann beeindruckt das halt einen potenziellen ... zukünftigen Arbeitgeber vielleicht nur bedingt. Und deshalb habe ich schon den Gedanken gehabt, okay, nochmal zurück in eine andere Rolle wäre auf jeden Fall gut. Und da gab es dann halt mal wieder eine Umstrukturierung, wie das immer auch mal wieder vorkommt. Und dann habe ich die Gelegenheit genutzt und bin wieder in eine IC-Rolle zurückgegangen.",
            "start": 600151,
            "end": 717133,
            "confidence": 0.7842105263157894,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "So wie sich das jetzt bei dir anhört, beschreibst du das an einen Engineering Manager, keine Qualitäten hat, nichts an den Tisch bringt und dass man solche Leute auf keinen Fall einstellen sollte. Ist das so?",
            "start": 717568,
            "end": 728458,
            "confidence": 0.8229444444444444,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nee, das ist auf jeden Fall nicht so. Aber ich glaube, das war bei mir halt ein bisschen extrem mit dem Zuschnitt von der Rolle mit 20 Direct Reports. Also das würde ich auch nicht mehr machen wollen, ganz ehrlich. Und ich würde es auch von keinem anderen verlangen wollen, weil das ist einfach eine recht einseitige Rolle. Du bist dann irgendwann nur noch am Gespräche führen und Konflikte schlichten und zu vermitteln und so. Und die meisten Firmen, wenn die einen Engineering Manager einstellen, dann wollen sie halt beides so ein bisschen. Ja, die wollen People-Skills und die Kommunikations-Skills, Soft-Skills und dergleichen. Aber sie wollen auch technisches Verständnis, technische Fähigkeiten, so dass du halt auch den Leuten, die du managst, dann musst du ja auch Führung geben und du musst dafür sorgen, dass die besser werden und so weiter.",
            "start": 729603,
            "end": 783794,
            "confidence": 0.8127142857142862,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber du hattest Spaß als Engineering Manager?",
            "start": 784494,
            "end": 787276,
            "confidence": 0.8245714285714286,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hatte Spaß und ich habe im Moment auch immer noch Spaß. Nur in dieser speziellen Rolle mit 20 Direct Reports, das ist ein bisschen viel. Das hätte ich nicht noch ewig weitermachen können.",
            "start": 787316,
            "end": 800063,
            "confidence": 0.8069411764705883,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber du hättest es ja auch reduzieren können. Also wir waren ja mal sogar gemeinsam eigentlich Peers und du hattest 20 Leute und ich hatte 20 Leute, die zusammen in Teams gearbeitet haben. Ich kenne den Schmerz, aber man könnte ja auch sagen, ich reduziere einfach oder baue da neue Strukturen ein oder mache sowas.",
            "start": 800083,
            "end": 818262,
            "confidence": 0.7711090909090906,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn dein Chef da mitmacht, dann ja, aber das ist nicht immer der Fall. Also ich habe es später auch noch erlebt, in der gleichen Firma, gleiche Abteilung, da wurde es wieder so gemacht, als dann mit einer Umstrukturierung noch mal ein bisschen andere Strukturen eingebaut worden sind, aber da hatten die Engineering Manager auch wieder zwölf oder fünfzehn oder so Leute unter sich und dann hast du eine ähnliche Situation.",
            "start": 818302,
            "end": 845610,
            "confidence": 0.8075070422535212,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und wie viele Leute haben gesagt, du spinnst doch, da wieder jetzt von deinem guten Engineering-Manager Boston zu gehen?",
            "start": 846292,
            "end": 854265,
            "confidence": 0.8356842105263159,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Mir ins Gesicht gesagt hat es keiner. Ich weiß nicht, wie viele es gedacht haben, aber die, ja. Ist dann halt so. Also ich finde, das muss drin sein. Und bei einer Firma wie Trivago war es zum Glück drin. Und das war kein Problem für mich. Und ich glaube, auch für die, mit denen ich dann gearbeitet habe, war es keins.",
            "start": 854285,
            "end": 876804,
            "confidence": 0.8514999999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du hattest gerade aber gesagt, du hattest so ein bisschen Angst, okay, du verlierst deine technischen Fähigkeiten. Das hat sich so ein bisschen angehört, so auf FOMO, bin ich überhaupt noch hire-bar, kann ich überhaupt noch mitreden. Auf die zweite Nachfrage hattest du dann gesagt, wenn jemand einen Engineering Manager einstellt, dann erwarte man technisches Verständnis. Und dann bist du wieder zurück zur Individual Contributor-Rolle gewechselt. Und jetzt wäre meine Frage, hast du dann gemerkt, wie weit du von der Technik weg bist? Oder hast du dir das alles nur eingebildet und hast gesagt, okay, so viel hat sich unten drunter eigentlich gar nicht geändert und die Skills habe ich eigentlich alle noch?",
            "start": 877024,
            "end": 910369,
            "confidence": 0.7461061946902655,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, also ich meine, ein bisschen aufholen musste ich schon. Einfach so Day-to-Day-Routinen, so Alltags... Abläufe, wie genau machen wir das und das im Prozess. Aber klar, es gibt auch Grundlagen, die ändern sich nicht. Was jetzt eine gute Struktur von Code ist oder wie man Funktionalitäten aufteilt in verschiedene Funktionen, das ist immer noch gleich. Und das verlernt man auch nicht, das ist gut. Aber, ja, ich meine, gerade so in dem Bereich, wo ich meistens tätig war, im Web-Bereich, da verändert sich halt schon viel mit Standards, was HTML, CSS, JavaScript betrifft. Und da muss man schon dann mal ein bisschen aufholen zumindest. Und vielleicht hat man es irgendwo schon mal gelesen, aber man hat es noch nicht so ... benutzt selber was schreiben, ... ... ist ja auch nochmal was anderes, ... ... als in einem Blogartikel ... ... darüber zu lesen und ... ... ein bisschen was aufzuholen war das schon.",
            "start": 910629,
            "end": 971254,
            "confidence": 0.804864516129032,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Der Wolfgang hatte gerade gefragt, ... ... wie andere Leute reagiert haben, ... ... als du für dich entschieden hast, ... ... dass du von einer Managementposition ... ... wieder zurück in eine Softwareentwicklungsposition ... ... gewechselt bist. Meine Frage war eigentlich, ... ... oder wäre eigentlich, ... ... wie hat denn dein Umfeld außerhalb ... ... deiner Arbeit selbst reagiert? Weil du wirst Freunde haben, ... ... die vielleicht in einem Konzern arbeiten, ...",
            "start": 971294,
            "end": 990392,
            "confidence": 0.7123466666666667,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nee, habe ich leider nicht. Beziehungsweise mein Bruder vielleicht. Aber da gab es eigentlich keine so riesen Diskussionen. Ich habe das auch nicht an die große Glocke gehängt. Viele verstehen auch nicht so genau, was ein Informatiker macht und ein Softwareentwickler.",
            "start": 990402,
            "end": 1007380,
            "confidence": 0.7685365853658537,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Druckerbeheben an Weihnachten?",
            "start": 1007988,
            "end": 1009430,
            "confidence": 0.644,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, zum Beispiel. Oder früher war's, ich hab ein Problem mit meinem CD-Brenner, ne? Aber ne, da hab ich keine großartigen Diskussionen geführt.",
            "start": 1009630,
            "end": 1020021,
            "confidence": 0.8315217391304346,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Okay, wenn's nicht dein direktes Umfeld war, dann ist natürlich die nächste Frage, was hat denn die LinkedIn-Bubble gesagt? Weil die feiern ja eigentlich nur, wenn du einen Schritt nach oben gehst, einen weiteren Schritt auf der Leiter.",
            "start": 1020061,
            "end": 1030932,
            "confidence": 0.803921052631579,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, auch da muss ich dich leider enttäuschen. Ich bin nicht so der LinkedIn-Poster und generell Social Media, das ist mehr so für mich, ich habe da immer einen großen inneren Widerstand und bin da nicht so aktiv. Ich hatte ein paar Gespräche mit Kollegen, die haben mich halt so gefragt, wie und warum. denen habe ich das erklärt, dass ich halt wieder mehr Hands-on mal eine Zeit lang sein will und die haben das halt als Fakt hingenommen und relativ problemlos akzeptiert und da auch nichts anstößiges oder irgendwie das als eine Niederlage gesehen oder so oder als ein Step-Down.",
            "start": 1031833,
            "end": 1073738,
            "confidence": 0.8323069306930694,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber wie war denn dein Mindset von Beginn an? Also ich meine, als ich in die Berufswelt kam, da war das natürlich, oh wow, diese Karriereleiter. Die muss man nach oben und man kann nicht zurück.",
            "start": 1074198,
            "end": 1084230,
            "confidence": 0.7964166666666664,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und jetzt bist du beim Podcast.",
            "start": 1084547,
            "end": 1086169,
            "confidence": 0.4076666666666666,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und jetzt mache ich einen Podcast mit einem Österreicher. Ich weiß auch nicht, wo ich im Internet falsch abgewogen bin. Aber hat sich dein Mindset, also war dein Mindset von Anfang an so offen oder hast du gesagt, ne Andi, auch ich habe mich entwickelt und musste mich mit dem Gedanken anfreunden und allem drum und dran. Ich meine, irgendwann bist du ja auch mal in die Berufswelt gestartet und ich sage mal, du bist jetzt auch keine 18, sondern vielleicht gerade 22. Das bedeutet, du hast natürlich auch schon ein gewisses Mindset, was von deinen Eltern vorgelebt wurde und allem drum und dran.",
            "start": 1086229,
            "end": 1114792,
            "confidence": 0.693326923076923,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich war nie so der Karriere-Typ. Ich wollte coden. Also ich habe immer schon Software-Entwicklung geliebt. Ich habe es geliebt, Code zu schreiben. Ich habe damals meinen Job gewechselt, weil ich in meinem vorigen Job nicht genug gecodet habe. Das war so IT-Consulting und da haben wir auch Software geschrieben. Aber es war halt nur so ein Bruchteil von meiner Zeit und das war mir zu wenig. Deshalb bin ich zu Trivago gegangen, um da wieder mehr zu coden. Das hat ein paar Monate funktioniert. Aber weil wir da so gewachsen sind, weil irgendwie Strukturen her mussten. Du bist damals auch dann Team Lead geworden, Andi. Und ich eben auch. Oder zuerst so Lead Developer, so eine informelle Funktion und dann Richtiger. ... People Manager, Engineering Manager ... ... mit Personalverantwortung ... ... und ja, ich bin da ... ... ich bin gefragt worden ... ... und ich habe es mir vorstellen können, ... ... ich habe das gemacht ... ... und zu meiner Überraschung ... ... hat es mir auch Spaß gemacht. Also ... ... das weg vom reinen Coden ... ... hin zu ein bisschen ... ... mehr auch Kommunikation, Koordination ... ... für Leute da sein, die ... ... einzuweisen und ein bisschen Führung ... ... zu geben, das ... war, fand ich gut.",
            "start": 1115832,
            "end": 1197404,
            "confidence": 0.8020504587155967,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber als du von der Position wieder runter wolltest, das war deine Entscheidung, da wurdest du jetzt nicht gefragt, wie initial für den Engineering Management Job.",
            "start": 1197444,
            "end": 1205630,
            "confidence": 0.7958846153846154,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Doch, auch, aber ich war auch sehr froh, dass es passiert ist, weil ich weiß nicht, wie lange ich das sonst noch weitergemacht hätte.",
            "start": 1205670,
            "end": 1214458,
            "confidence": 0.8370833333333332,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber Moment mal, wenn jetzt zu mir jemand ankommen würde, ich wäre Engineering Manager und mich fragt jemand, möchtest du wieder als Individual Computer arbeiten? Dann wäre meine erste Gegenfrage, was habe ich falsch gemacht und wieso stimmt meine Performance nicht oder also dann fange ich an, oh was ist denn hier los, sitze ich auf einem Jumpseat?",
            "start": 1214498,
            "end": 1230946,
            "confidence": 0.7761379310344827,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das war so ein spezielles Thema, also erstens hatten wir eine Umstrukturierung intern und zweitens, ich war im Engineering Recruiting. ... sehr aktiv halt, weil wir damals so sehr gewachsen sind. Ich habe da, ... ... ich weiß nicht, 2016 oder so, oder 2015, ... ... habe ich glaube ich 16, 17 Leute ... ... mit ins Team aufgenommen von außen ... ... und eben auch entsprechend ... ... Dutzende oder über 100 Interviews geführt wahrscheinlich. Und Tech Recruiting war damals ganz heiß. Also das war ein sehr, ... ... ist ja immer noch ein umkämpfter Markt, ... ... aber das war auch ... Das war damals aus firmenstrategischer Sicht ein sehr heißes Thema. Da hat sogar der CEO selber drauf geschaut und der hat mich gefragt, ob ich mir vorstellen könnte, meine Erfahrung im Tech Recruiting in die Personalabteilung einzubringen. Und dann haben wir da zunächst versucht, eine spezielle Stelle für mich zu definieren, wo ich dann mit dem Talent Acquisition Team zusammengearbeitet habe. Das hat nicht so gut funktioniert und deshalb bin ich dann bald weiter in...",
            "start": 1230986,
            "end": 1301172,
            "confidence": 0.7899273743016763,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das heißt aber, da bist du wirklich auch ganz vom Coding weg?",
            "start": 1301212,
            "end": 1304055,
            "confidence": 0.7685,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Da bin ich zunächst ganz vom Coding weg, ja.",
            "start": 1304333,
            "end": 1306354,
            "confidence": 0.8103333333333332,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "In eine Product Owner Rolle, wenn ich das richtig empfehle.",
            "start": 1306374,
            "end": 1309335,
            "confidence": 0.6333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das war es dann letzten Endes, genau. Wir haben da so ein paar Eigenentwicklungen fürs Talent Recruiting und speziell auch technisches Recruiting gehabt. Und die Produkte habe ich dann mitverantwortet als Product Owner.",
            "start": 1309355,
            "end": 1323902,
            "confidence": 0.8343030303030304,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das zeigt schon eine gewisse Flexibilität, würde ich mal sagen, oder? Weil man komplett aus dem Coding-Teil aussteigt. Ich meine, wir haben beide viel Recruiting gemacht und man hat da ja auch Spaß dran, aber mit den meisten, mit denen ich gesprochen habe, war das halt so eine nette Nebenbeschäftigung, hin und wieder mal ein Interview zu führen. Aber das jetzt Fulltime zu machen, ist ja doch noch ein ganz anderer Schritt. Hat dir dann am Ende irgendwas geholfen, diese Erfahrung jetzt komplett woanders zu sein?",
            "start": 1324465,
            "end": 1350722,
            "confidence": 0.7801627906976745,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, würde ich schon sagen, weil man hat halt nochmal einen ganz anderen Blick auf Dinge. Also ich war dann als Product Owner mit dem Produkt beschäftigt, habe quasi mit einem Entwicklerteam, ich habe sozusagen die Seiten gewechselt und habe Entwickler mit denen diskutiert, welche Features wir bauen sollen und mit den Designern die Ideation gemacht und so weiter.",
            "start": 1351605,
            "end": 1377043,
            "confidence": 0.8346610169491527,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Warst du da irgendwie dann akzeptierter bei den Engineers dadurch?",
            "start": 1378194,
            "end": 1381675,
            "confidence": 0.7227999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Total, ja, total. Also mit denen hat es von Anfang an gepasst und das war sogar remote. Also das Entwicklerteam saß in Palma, ich saß in Düsseldorf und das hat super geklappt. Ich bin super mit denen ausgekommen, die sind super mit mir ausgekommen. Ich habe nur eins auf die Finger gekriegt, als ich irgendwann mal ein Code-Review gemacht habe und in GitHub irgendwie dann oder in der Code-Verwaltung LooksGoodToMe abgelassen habe. Und dann ist sofort einer von den Engineering-Managern gekommen und hat gesagt, ey, bitte Produktmanager halten sich da zurück. Die nehmen nicht an Code-Reviews teil. Und das musste ich dann auch akzeptieren.",
            "start": 1381716,
            "end": 1423666,
            "confidence": 0.8088173076923078,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Würdest du das heutzutage so unterschreiben?",
            "start": 1424166,
            "end": 1425947,
            "confidence": 0.7083333333333334,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich weiß nicht, also wenn der Produktmanager Ahnung von Code hat, dann würde ich da jetzt keine so strikte Trennlinie ziehen.",
            "start": 1425987,
            "end": 1434693,
            "confidence": 0.8023333333333333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also kannst du dir vorstellen, dass ein Produktmanager den kompletten architekturellen Kontext der Applikation im Kopf hat, um einem Pull-Request zu sagen, looks good to me?",
            "start": 1435133,
            "end": 1443898,
            "confidence": 0.6384230769230768,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "In der Regel nicht. Aber ich weiß nicht mehr, was das für ein PR war. Vielleicht war es auch nur etwas Kleines oder so. Man muss auch sagen, klar hat man einen Interessenskonflikt als Produktmanager. Du willst in der Regel als Produktmanager das Zeug schnell raushaben, dass es live geht. Und das kann zu Lasten der Qualität gehen.",
            "start": 1444352,
            "end": 1463556,
            "confidence": 0.7619310344827588,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und von der anderen Seite ein gewisses Konflikt, dass du zu nett zu den Entwicklern bist, weil du sie zu sehr verstehst und zu wenig das Product im Kopf hast?",
            "start": 1463996,
            "end": 1473298,
            "confidence": 0.8291000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist auch was, was man im Kopf haben muss. Ich denke, ich habe da eine gute Balance gefunden. Also ich habe denen jetzt auch nicht alle Zeit der Welt zugestanden, wenn sie irgendwas komplett neu schreiben wollten oder mal experimentieren mit irgendeiner neuen Bibliothek, nur einfach, weil es interessant klingt oder so. Also ich habe da schon geguckt, dass wir auf der Spur bleiben. Aber ich habe, glaube ich, schon auch gut einschätzen können, Wenn jetzt was wirklich nötig ist und wenn die die Zeit brauchen, um sich einzuarbeiten in irgendwas, dann hat man da vielleicht schon mehr Verständnis, wenn man selber auch einen technischen Hintergrund hat.",
            "start": 1473933,
            "end": 1512545,
            "confidence": 0.8464166666666663,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also wir haben ja jetzt 2024, das ist ja jetzt schon eine Zeit her, aber ich kann mich erinnern, damals war das eigentlich schon, wie ich gehört habe, du wechselst, war das schon irgendwie was Neues. Also sogar damals in der hippen, coolen, modernen, flexiblen Firma war das schon was Neues. Und du bist ja mittlerweile nicht der Einzige, es gibt ja da zum Beispiel von Mitchell Hashimoto von HashiCorp, dem Gründer. Das war 2021, dass der zurückgetreten ist aus dem C-Level und Individual Contributor ist, der halt geschrieben hat, man soll das tun, was man liebt und nicht was von einem erwartet wird. Aber das war 2021. Und es gibt da den berühmten Artikel eben oder beziehungsweise den Artikel, der meines Wissens zumindestens den Term geprägt hat von diesem Engineering Manager Pendulum oder Pendel von der Charity Mayers, der war 2017 und dein Artikel, war von 2018 in deinem Blog, also es dürfte alles um den Dreh gewesen sein, aber es war schon sehr sehr früh, also es war jetzt definitiv kein Standard-Move, würde ich mal sagen, oder? Oder hast du in deiner Umgebung irgendwie Leute ähnliche Schritte machen gesehen?",
            "start": 1513178,
            "end": 1584686,
            "confidence": 0.7885078534031416,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee, ich kann mich auch an den Fall von einem Kollegen erinnern, auch bei Trivago, der wurde 14, 15 oder so, Engineering Manager, und hat nach einem halben Jahr oder so gemerkt, er wollte das nicht mehr weitermachen, sah sich aber, also er hat es für sich nicht als Option gesehen, jetzt in derselben Firma wieder Individual Contributor zu werden. Er hätte das, ich weiß nicht, ob er es als Gesichtsverlust oder sonst was wahrgenommen hätte, oder hätte Angst gehabt, dass die anderen das so sehen. Aber da hat dann wirklich die Firma gewechselt deshalb und ist wieder Entwickler geworden woanders dann. Und das finde ich halt schon schade. Also ich habe da immer Vertrauen gehabt eigentlich, dass das jetzt nicht, dass man da ein Ansehen verliert, wenn man jetzt in eine Einzel-Contributor-Rolle wieder zurück wechselt. Ich habe die Gefahr nie gesehen.",
            "start": 1584906,
            "end": 1641563,
            "confidence": 0.8144295774647887,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber ich glaube das ist auch ganz stark abhängig von der Firmenkultur, also wenn man jetzt mal andere Podcasts hört, zum Beispiel gibt es den Podcast Minimal Empires von Sumit Kumar und er hatte auch mal eine Karriere im Daimler Konzern und er spricht auch immer über die Daimler Karriereleiter. Ich habe noch nie für Daimler gearbeitet, aber es klingt so, als wäre das, was du gerade gesagt hast, den Schritt zurück, in einer solchen Konzernstruktur jetzt nicht wirklich offen, beziehungsweise wo Leute links und rechts sagen, hm, hat der keinen guten Job gemacht. Also und von der traditionellen Bildung, die ich habe, von dem traditionellen deutschen Arbeitsumfeld, Vielleicht auch aus der Duisburger Stahlindustrie und Kohleindustrie, ich weiß es jetzt gerade nicht. Auf jeden Fall ist es da wirklich, ich sag mal, so der Standardprozess, okay, du versuchst die Karriereleiter nach oben zu gehen, bist vielleicht nicht glücklich und dass du dann, ich sag mal, einen Neubeginn in einer anderen Firma startest. Also die Flexibilität, dass das wirklich, ich sag mal, willkommen ist, könnte ich mir schon, also stelle ich mir zumindest vor, dass das sehr selten ist.",
            "start": 1641943,
            "end": 1700445,
            "confidence": 0.7672872340425535,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Möglich. Ich habe da wenig Erfahrung mit anderen Firmen, aber ich würde mir wünschen, dass es heutzutage zumindest in vielen IT- oder IT-nahen Firmen eigentlich kein Problem mehr ist.",
            "start": 1700926,
            "end": 1713000,
            "confidence": 0.8094482758620691,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was würdest denn du sagen als Hiringmanager jetzt, wenn du ein CV bekommen würdest? Und da sieht man Entwickler, Engineeringmanager, dann HR, Productowner, dann wieder JavaScript-Entwickler, dann wieder Lead und das womöglich bei immer bei anderen Firmen. Würdest du dann dir denken, oh der springt oder würdest du das positiv empfinden?",
            "start": 1713493,
            "end": 1735703,
            "confidence": 0.773313725490196,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube, das würde ich erstmal neutral sehen. Kommt halt ein bisschen auf die zeitlichen Abstände an. Wenn es jetzt alle zwei Monate was anderes ist, dann wird es mir schon ein bisschen komisch vorkommen. Aber ich würde den Bewerber oder die Bewerberin dann halt fragen, wie das kam. Manchmal gibt es gute Gründe, vielleicht in einem Start-up, da muss ja jeder mal alles machen. Da kann das schnell passieren, dass man so eine Rolle wechselt und dann zeugt das ja auch von der Einsatzbereitschaft von der Person eventuell, von der Flexibilität und dann kann es auch was Positives sein. Und ich hatte das schon. Also ich hatte schon Bewerber, die sind vom Entwickler dann in eine Produktrolle gegangen und dann irgendwie wieder zurück. Und in dem Fall war das wirklich, weil es halt betriebliche Veränderungen gab und es musste halt jemand den Job machen und sie haben den gemacht.",
            "start": 1736241,
            "end": 1788616,
            "confidence": 0.8258200000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hat dir jemand diese Flexibilität gedankt?",
            "start": 1788636,
            "end": 1790757,
            "confidence": 0.6878333333333333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Oh, da muss ich nachdenken. Ich weiß es nicht mehr. Ich kann mich jetzt nicht ausdrückliches Dankeschön erinnern, aber es war auf jeden Fall, wo ich dann wieder zurück bin, weil, auch wieder Beispiel, ich bin dann wieder in die Entwicklungsabteilung zurück.",
            "start": 1791835,
            "end": 1812342,
            "confidence": 0.8290476190476189,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Dann als IC oder als Lead?",
            "start": 1812822,
            "end": 1814884,
            "confidence": 0.6291666666666668,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Als IC zunächst, für ein paar Monate dann wieder als Lead. Und da hat sich dann der CEO schon bedankt, auch für meine Flexibilität, weil da hatten wir gerade ein Problem mit Entwicklern, hatten wir zu wenig Kapazität. Von dem her, ja, also kurze Antwort, ja.",
            "start": 1814944,
            "end": 1832517,
            "confidence": 0.7483260869565218,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Sprechen wir mal ganz kurz über die Zeit, da wo du wieder vor dem Computer saßt und eine IDE offen hattest. Wie war die erste Woche? Wenn ich das richtig in deinem Lebenslauf entlebne, ... ... warst du knapp vier Jahre weg vom Code.",
            "start": 1832537,
            "end": 1846476,
            "confidence": 0.693909090909091,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vom täglichen Coding auf jeden Fall. Ich habe so ein bisschen Nebenprojekte gemacht, ... ... nebenher mit Coding. Aber so im alltäglichen Coding, ... ... ja ein paar Sachen muss man halt mal nachfragen. Wie macht man dies, wie macht man jenes? Aber so schlimm war es nicht. Also man hatte das Verständnis für Code ja immer noch. Die meiste Zeit verbringst du ja damit, Code zu lesen. Als Entwickler liest du viel mehr Code, als dass du Code schreibst. Und das kriegst du auch dann noch hin, wenn du nicht jede CSS-Property genau kennst, die da verwendet wird. Dann weißt du auch, wo du das nachschauen kannst und so. Von dem her war ich wahrscheinlich nicht genauso produktiv und schnell wie andere, aber ich bin vorangekommen.",
            "start": 1846516,
            "end": 1894495,
            "confidence": 0.8032519685039372,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich habe ja auch mal das Pendulum mitgemacht. Das bedeutet, ich hatte auch eine Engineering-Management-Rolle, war auf Director-Level und irgendwann war ich wieder Individual-Contributor. Und ich gebe zu, meine erste Woche, da habe ich festgestellt, wie sich mein Hirn in der Management-Rolle umfunktioniert hat. Weil auf einmal sitzt du wieder mehrere Stunden vor der IDI. Du musst wieder einen sehr großen Kontext in deinem Kopf behalten, in sehr kurzer Zeit. Diese Callstacks und allem drum und dran. Und ich war effektiv knallhart müde in der ersten Woche oder vielleicht sogar in den ersten zwei Wochen, weil ich das, ich hab das Gefühl gehabt, mein Hirn muss sich neu verkabeln. Und ich wurde knallhart wieder daran erinnert, warum das mit dem Programmieren immer alles so lange dauert. Kommt jetzt bekannt vor.",
            "start": 1894895,
            "end": 1937620,
            "confidence": 0.7506461538461537,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist manchmal gut, die Erfahrung zu machen. Ja, es ist auf jeden Fall eine ganz andere Belastung. Also als Engineering Manager, da hast du mehr, du triffst andere Entscheidungen. Als Entwickler musst du auch dauernd Entscheidungen treffen. Nenne ich diese Variable? Wie nenne ich diese Funktion? Wo packe ich die Funktionalität hin? Welche Datenstruktur verwende ich? Und so weiter. Dutzende, hunderte Entscheidungen jeden Tag. Und das ist ermüdend. Auf jeden Fall stimme ich dir hundertprozentig zu. Und wenn du nicht aufpasst und ein paar Pausen machst ab und zu, kann es schon sein, dass du drei Stunden am Stück am Rechner sitzt und dich intensiv reindenkst, ohne auch nur einmal aufzustehen vom Computer. Und als Engineering Manager, da hast du halt ein bisschen mehr Unterbrechungen und du hast hier ein Meeting, da ein Einzelgespräch, dann musst du irgendwie was schreiben oder Tasks erstellen oder Listen durchgehen und irgendwas überprüfen und so weiter. Das ist auch ermüdend manchmal. Aber die Gespräche zwischendurch, die lockern es irgendwie auf. Also das ist was anderes.",
            "start": 1938026,
            "end": 2010003,
            "confidence": 0.7829767441860461,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi, es ist jetzt dein Einsatz für deinen Lieblings-Blog-Post von Paul Graham.",
            "start": 2010063,
            "end": 2014744,
            "confidence": 0.7135833333333333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Oh ja, ein wundervolles Beispiel hast du gerade genannt für Maker-Schedule, Manager-Schedule von Paul Graham. Verlinken wir natürlich auch. Immer noch einer meiner Top-Blog-Posts.",
            "start": 2014824,
            "end": 2025846,
            "confidence": 0.7086250000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, wir verlinken den jetzt schon bald in jeder zweiten Episode. Ist wirklich, glaube ich, dein Lieblings-Artikel von heute.",
            "start": 2025906,
            "end": 2030567,
            "confidence": 0.59355,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, aber ich glaube, Paul Graham bietet keine Affiliate-Links an.",
            "start": 2030587,
            "end": 2033508,
            "confidence": 0.4949,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aus gutem Grund.",
            "start": 2033548,
            "end": 2034108,
            "confidence": 0.6856666666666666,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber wenn wir gerade bei Blogartikel sind, kann ich gleich einen Satz zitieren aus dem Charity Mayers Blogpost. Und zwar, keine Ahnung, ob der von ihr kommt oder vielleicht so ein allgemeines Saying auch in der Industrie ist, aber dieses wird fast Sprichwort sagen. besagt, dass man eigentlich der beste Engineering Manager ist, wenn man gerade so zwei Jahre weg ist vom Code. Also man gelernt hat, wie man Engineering Manager ist, aber doch noch die Nähe zu dem Code hat. Und der beste Individual Contributor oder der beste Developer ist der, der Management-Erfahrung hat. Könnt ihr das nachvollziehen beide oder bestätigen?",
            "start": 2035029,
            "end": 2071329,
            "confidence": 0.8095588235294121,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich komme zuerst zum zweiten Teil. Also ich denke, wenn man mal Manager war und so Teamverantwortung hatte und dann wieder IC wird, man hat immer noch diese Denkweise, dieses Mindset von einem Manager. Man weiß, okay, mein Manager, der ist auch nicht allwissend, weil ich war es als Manager auch nicht. Wenn ein Engineer zum Manager kommt und sagt, ich habe da so und so ein Problem, dann hat der Manager nicht die Antwort parat, weil er meistens auch nicht, er steckt ja nicht so tief drin wie der Engineer in der Regel. Er kann oft nur helfen, dem Engineer die Lösung selber zu finden. Und wenn du das als Engineer weißt, dann sparst du dir manchmal den Schritt, ... zu deinem Manager zu gehen ... ... und den um die Lösung anzubetteln quasi, ... ... sondern du weißt, okay, ... ... der ist auch nicht schlauer als ich ... ... oder allwissend, ... ... dann probiere ich erst mal selber ... ... eine Entscheidung zu fällen ... ... und eine Lösung zu finden ... ... und das erhöht ... ... ganz enorm deine Selbstständigkeit, ... ... glaube ich, als IC ... ... und es entlastet halt wiederum ... ... deinen Manager dann. Und das ... ... macht dich zu einem wertvolleren IC, ... ... das denke ich schon.",
            "start": 2071389,
            "end": 2146177,
            "confidence": 0.7906000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und die andere Richtung?",
            "start": 2146217,
            "end": 2146938,
            "confidence": 0.5,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die andere Richtung ist auch wichtig. Wenn du Manager wirst, dann solltest du Empathie haben können für deine Entwickler. Du solltest wissen, was für Probleme, was für Schwierigkeiten die im Alltag bewältigen müssen. Andi hat es vorhin gesagt, du weißt dann mal wieder, warum dauert Softwareentwicklung manchmal so verdammt lange, obwohl es so von außen betrachtet eigentlich straightforward aussieht. Und das hast du, diese Fähigkeit oder dieses Wissen und das Gefühl hast du natürlich am stärksten, wenn du gerade erst den Übergang gemacht hast, vom IC, vom Entwickler zum Manager. Dann ist das noch frisch in deinem Kopf und du weißt, wie haarig manche Probleme sind, wie was für Schwierigkeiten in der Codebase lauern, dass dieses Thema immer heikel ist und so weiter. Und mit der Zeit, wenn es dumm läuft, verliert sich das halt so mit der Zeit ein bisschen.",
            "start": 2147661,
            "end": 2201157,
            "confidence": 0.843418439716312,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber diese Weisheit sagt dann ja auch, dass du nach zwei Jahren quasi schlechter wirst, wenn man das eigentlich richtig weiter befolgt, das Ganze.",
            "start": 2201357,
            "end": 2207843,
            "confidence": 0.8399166666666668,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich denke, das ist ein bisschen überspitzt formuliert. Du wirst vielleicht in der Hinsicht schlechter, dass du vielleicht ein bisschen weniger Verständnis hast für manche Sachen, die dann länger dauern. Aber du gewinnst ja auch in anderer Hinsicht dazu an Erfahrung als Manager generell. Du hast mehr schwierige Gespräche zum Beispiel bewältigt oder mehr Umstrukturierungen in der Organisation navigiert und deine Leute beruhigt dabei und Führung gegeben. Das kann dann das so ein bisschen kompensieren, denke ich mal.",
            "start": 2208023,
            "end": 2244445,
            "confidence": 0.8226794871794871,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also das Ganze ist ja die Argumentation für dieses Pendel, dass ich eigentlich auch wieder zurückgehen kann und wieder zum Engineering Manager und wieder zum IC und hin und her wechsel, dann bin ich eigentlich immer in diesem Optimum drinnen. Ich bin vielleicht zwei Jahre weg von der Engineering-Rolle und dann bin ich aber auch wieder ein guter Engineer, weil ich eben diese Management-Erfahrung habe. Jetzt, wenn man das konsequent fortführen würde, würde das ja heißen, dass man das fast machen muss und dass es zum Beispiel auch keine guten Manager gibt, die keinen Engineering-Background haben und gar keine guten Engineers geben kann, die keine Management-Erfahrung haben. Andi schnauft schon seit drei Minuten, der will sowieso dringend was loswerden.",
            "start": 2244740,
            "end": 2283645,
            "confidence": 0.8185042016806718,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also ich könnte dazu gerade nochmal sagen, ich denke, dass ... spiegelt halt den speziellen ... ... Werdegang von Charity Majors auch wieder, ... ... die das so gemacht hat. Sie beschreibt ja in dem Text auch, ... ... dass sie, sie wird halt immer unruhig, ... ... wenn sie ... ... dann so in einem Startup ... ... den Textwerk aufgebaut hat, ... ... dann das Team aufgebaut hat und dann ... ... hat sie irgendwann das Gefühl, ... ... oh, ich weiß, was ich hier tue, ... ... ich bin in ruhigem Fahrwasser, relativ gesehen. Jetzt werde ich unruhig. Das ist immer ein Zeichen für sie, ... ... dass es Zeit wird, was Neues zu tun.",
            "start": 2283685,
            "end": 2316536,
            "confidence": 0.7807457627118644,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also wenn es langweilig wird eigentlich. Oder wenn man sich wohl fühlt eigentlich.",
            "start": 2316856,
            "end": 2320521,
            "confidence": 0.700923076923077,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Sie hat so das Gefühl, ja ich weiß was ich hier tue, alles geht so mehr oder weniger seinen geregelten Gang. Aber ich glaube das ist halt individuell verschieden auch. Das ist bei ihr, sie wird dann halt ruhelos, rastlos und muss zur nächsten Station. Aber das hat ja vielleicht nicht jeder und das ist auch nicht in jeder Firma so möglich. Ich denke, wenn du halt im Konzern bist oder so, dann gibt es dann halt da noch weitere Level, wie du aufsteigen kannst als technischer Manager. Und das bringt ja dann auch wieder was Neues mit sich, wenn du vom Line Manager zum Director wirst oder dann noch weiter höher aufsteigst zu irgendwelchen Abteilungsleiter oder Divisionsposten oder sonst was und deshalb bist du nicht automatisch ein schlechter Manager glaube ich, wenn du nicht zwischendurch mal wieder ein Jahr als IC machst.",
            "start": 2320541,
            "end": 2374263,
            "confidence": 0.8147152777777773,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber kannst du guter Manager sein ohne technischen Background?",
            "start": 2374303,
            "end": 2377785,
            "confidence": 0.7597777777777778,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, ich glaube schon. Also ich habe zum Beispiel eine, meine Vorgesetzte in der Zeit, als ich Produktmanager war, die war auch eine sehr gute Managerin und die hatte keinen technischen Background. Und ich denke, dass es möglich ist.",
            "start": 2378367,
            "end": 2394119,
            "confidence": 0.8277435897435896,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber die war keine Managerin von Engineers?",
            "start": 2394139,
            "end": 2397942,
            "confidence": 0.7694285714285715,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nicht direkt, aber sie war für den Output von den Engineers verantwortlich.",
            "start": 2398002,
            "end": 2402085,
            "confidence": 0.8431666666666665,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kennst du irgendwelche Direct-Manager von wirklich Entwicklerteams, die gut waren?",
            "start": 2402440,
            "end": 2408985,
            "confidence": 0.7701999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Da muss ich überlegen.",
            "start": 2409045,
            "end": 2410927,
            "confidence": 0.85575,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi, kennst du welche?",
            "start": 2410967,
            "end": 2412708,
            "confidence": 0.56725,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich habe jetzt keinen direkten Namen zur Hand, aber ich denke wirklich, dass... Du.",
            "start": 2412748,
            "end": 2415570,
            "confidence": 0.7002857142857143,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Musst mir auch keinen Namen sagen, ob du jemand mal kennengelernt hast, oder?",
            "start": 2415591,
            "end": 2418713,
            "confidence": 0.7024615384615385,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hatte mal einen Vorgesetzten, er hatte... Als IC? Genau, ich war IC und hatte einen Manager und er war kein Software-Ingenieur oder ähnliches und er war ein enorm guter, ich würde sagen, General Manager. Und ich würde so weit gehen, dass jeder gute Manager auch Domänen fremder Teams leiten kann. Weil bei gutem Management, natürlich muss man sich in die Fachdomäne, was manage ich denn hier schon, was sind die Business-Kriterien und als Manager, das muss man alles auf dem Zettel haben und das kann jeder gute Manager sich drauf schaffen. Aber das tun auch Manager, die jetzt von Coca-Cola nach Apple wechseln. Ja, Apple hat nichts mit Softdrinks zu tun, aber sie werden es trotzdem hinkriegen, wie das Hardware-Business läuft. Also von daher, deswegen denke ich, Fachdomäne ist nicht notwendig, sondern da kommt wirklich dann das Key-Kriterium vom Management. Leute führen, Kommunikation, den richtigen Leuten vertrauen, Chancen geben, aber auch einen Rahmen setzen und Co. Also ich denke, das ist möglich. Und ich kenne auch einen und ich würde auch mal so geführt, Ich war auch ehrlich, am Anfang hatte ich sehr starke Skepsis. Was soll der mir hier erzählen? Aber der hat mich auch nie gefragt, ob ich da ein Heck einbauen kann oder ähnliches.",
            "start": 2419169,
            "end": 2491373,
            "confidence": 0.8191875000000002,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich denke, wenn man direkt Entwickler unter sich hat, ist es schon ein großer Vorteil selber auch zu können, was die können, oder zumindest theoretisch. Weil Untersuchungen zufolge steigert das erstens die Zufriedenheit der Leute selber. Wenn die wissen, mein Manager kann das tun, was ich tue, dann Das erhöht in der Regel ihre Zufriedenheit, weil dann haben sie keinen Druck, sich irgendwie zu rechtfertigen, wenn was länger dauert, weil der Manager eben intuitiv versteht, warum das jetzt komplex ist. Und idealerweise sollte der Manager halt auch daran arbeiten, seine Leute besser zu machen. Und wenn du einen Entwickler besser machen willst, dann solltest du idealerweise auch ein bisschen was technisches Verständnis haben.",
            "start": 2491701,
            "end": 2537724,
            "confidence": 0.8478407079646022,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube, der zweite Punkt, den du ernannt hast, ist super wichtig und ein General Manager wird damit Schwierigkeiten haben. Aber ich muss auch sagen, dass ein fachfremder Manager einfach den riesen Vorteil hat, dass er niemals die Grenzen überschreitet und niemals sagt, ... Bau das so oder niemals in Pull-Requests gucken wird. Das bedeutet, das ist halt ein riesen Vorteil ... ... und auch ein Nachteil von Leuten, die ... ... sich mit Code auskennen. Man kann mal relativ schnell die Grenze überschreiten ... ... und somit in das Territorium ... ... der Individual Contributor gehen. Und dann ... ... kommt auch das böse Wort ... ... böse Wort Micromanagement vielleicht irgendwann auf den Tisch ... ... und allem drum und dran.",
            "start": 2538104,
            "end": 2578177,
            "confidence": 0.7841138211382113,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es kann ja auch positiv sein, wenn du das verstehst und ... ... dich vielleicht Leute auch fragen, wie würdest du es machen ... ... oder mit dir diskutieren. Aber ich glaube, man müsste dann halt eine andere Person finden, die das, den Teil ersetzt.",
            "start": 2578197,
            "end": 2589144,
            "confidence": 0.7190222222222221,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es kann positiv sein, aber ich würde das auf einem anderen Level deklarieren. Und zwar, du musst schon verstehen als Manager, was deine Leute von dir wollen, aber das würde ich als Bullshit-Filter irgendwie deklarieren.",
            "start": 2589164,
            "end": 2603137,
            "confidence": 0.8495714285714285,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich wollte auch sagen, was du gesagt hast, Wolfi, es kommt dann halt aufs Umfeld auch an. Wenn jetzt der direkte Manager diese Funktion nicht übernehmen kann, dann gibt es vielleicht einen Staff-Engineer oder sowas, einen hohen, hochrangigen, technischen Spezialisten, der halt dann das Training mit übernehmen kann, die Weiterbildung von den Leuten. Feedback geben zu deren Coach, gucken, dass die Richtlinien eingehalten werden und so weiter. Und am besten ist halt, wenn der Staff-Engineer und der People-Manager, der Engineering-Manager sich dann auch austauschen entsprechend.",
            "start": 2604458,
            "end": 2640889,
            "confidence": 0.8396823529411765,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also ich denke mir auch damals, wie wir da 20 Leute unter uns gehabt haben, 20 Reports, da macht man kaum mehr irgendwas Technisches. Vielleicht hat man den Vorteil, dass man in den ganzen One-on-Ones super schnell versteht, wo das Problem ist und vielleicht dann schneller reagieren kann als jemand anderer. Aber was willst du mit 20 Reports noch irgendwie in den technischen Details drin sein oder verstehen können, was da die Teams im Detail machen oder auch helfen können, ist dann schon sehr, sehr schwierig.",
            "start": 2641572,
            "end": 2666536,
            "confidence": 0.7748372093023256,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, richtig.",
            "start": 2666680,
            "end": 2668481,
            "confidence": 0.3525,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hast du schon mal als Engineering Manager Leute geleitet, die bei dem Pendel aktiv waren? Das bedeutet, hast du schon mal Leute geleitet, die mal Engineering Manager waren und zurück zu IC gependelt sind? Ja.",
            "start": 2668521,
            "end": 2683528,
            "confidence": 0.8916857142857143,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, hatte ich.",
            "start": 2683809,
            "end": 2685149,
            "confidence": 0.625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was würdest du sagen, welche Skills hatten diese Leute gegenüber Leuten, die noch keine Leadrolle hatten, die das Pendel noch nicht durchlaufen haben?",
            "start": 2685209,
            "end": 2694694,
            "confidence": 0.8399130434782609,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich würde sagen, tendenziell haben die einen größeren Fokus auf Value Creation. Also, dass wirklich was hinten dabei rauskommt für ein Business Value. Nicht einfach nur, okay, ich programmier hier was und es funktioniert jetzt vielleicht nicht so perfekt, aber es hat halt seine Eigenheiten, es ist aber ein schöner Code und ich lass das jetzt so, sondern die haben manchmal mehr den Fokus halt drauf auf dem Ergebnis, weil manche Entwickler haben das nicht immer.",
            "start": 2695286,
            "end": 2731224,
            "confidence": 0.8222763157894732,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das, was ich mal festgestellt habe, ich habe das Gefühl, die sind bessere ICs, weil die deine Probleme verstehen. Und zwar deine tägliche Arbeit als Manager, Konflikte lösen, sich mit Politik rumschlagen vielleicht sogar, auch mal ein Argument mit gegen einen anderen Team zu verlieren, Oder vielleicht so ganz simple Dinge, dass du als Manager im Teammeeting einfach nur Engagement haben möchtest, dass Leute dabei sind, dass du da keinen Monolog hältst. Und da habe ich immer das Gefühl, diese ICs, die mal Manager waren, die wissen um deine Probleme und deswegen sind das bessere ICs, weil die dich implizit immer so ein bisschen unterstützen. Die wissen, dass du willst, dass andere Leute ihren Senf dazugeben.",
            "start": 2731264,
            "end": 2774073,
            "confidence": 0.8520689655172416,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich glaube, da hast du einen guten Punkt, dass man als Engineering Manager halt nicht immer die ganze Show alleine moderieren will, Teammeetings. Ich weiß noch am Anfang, ich habe die auch gehasst wie die Pest, immer wenn es still ist, musst du derjenige sein, der irgendwas sagt. Und das Ganze am Laufen hält, damit nicht diese sehr unangenehme Stille 10 Sekunden, 20 Sekunden dauert oder sowas. Und ja, da ist glaube ich was dran, dass die Leute, die schon mal selber in der Position waren, dass die dann eher aus ihrer Komfortzone kommen und auch was dazu beitragen.",
            "start": 2775118,
            "end": 2811640,
            "confidence": 0.8021799999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Geht dir das mit dem ganzen Recruiting jetzt auch so, dass du die Welt besser verstehst oder besser nachvollziehen kannst, was deren Probleme sind, weil du dort gearbeitet hast?",
            "start": 2811660,
            "end": 2819927,
            "confidence": 0.8183793103448275,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was die Probleme der Recruiter sind?",
            "start": 2819967,
            "end": 2821689,
            "confidence": 0.6808333333333333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ganze HR und du hast ja dann doch viel mitbekommen wahrscheinlich.",
            "start": 2822232,
            "end": 2826214,
            "confidence": 0.5974166666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja doch, denke ich schon. Also sogar auch schon dadurch, dass ich nur in der Nähe von den Teams saß und das so ein bisschen mit einem Ohr mitbekommen habe und die Recruiterinnen waren es meistens, so in der Küche getroffen habe und so. Ja, schon, ich glaube, schon allein dadurch hat man ein bisschen besseres Gefühl dafür.",
            "start": 2826234,
            "end": 2846621,
            "confidence": 0.8047758620689653,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hast du dann jetzt auch vor, durch die Design- und Data Science Teams zu pendeln?",
            "start": 2846641,
            "end": 2849562,
            "confidence": 0.6582,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Bis jetzt nicht, aber man weiß ja nie.",
            "start": 2850232,
            "end": 2853315,
            "confidence": 0.713875,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber mir ist das damals auch so gegangen, also wie einmal beim Patrick gesessen bin, den wir auch interviewt haben in Episode 88, der damals Business Partner war. Und ich bin ja mal neben dem gesessen in seinem Office, weil die waren ja sogar in einem anderen Gebäude, wie er da mit der Ausländerbehörde oder irgendwas telefoniert hat. Diese paar Minuten haben mir alleine so gezeigt, wie schlimm dieser Beruf ist, für mich zumindest, und was da alles geleistet werden muss und was man da machen muss. Man hat also wirklich so wenig Einblick.",
            "start": 2853355,
            "end": 2880710,
            "confidence": 0.8007340425531917,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Man gewinnt eine andere Wertschätzung nochmal.",
            "start": 2881615,
            "end": 2883416,
            "confidence": 0.5361666666666667,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau, genau. Also ich glaube, so ein Einblick ist ganz, ganz wichtig und mir ist es persönlich auch da zum Beispiel mit der Universität immer so gegangen, weil ich habe halt dann erlebt, wie schlecht diese Welt teilweise gesehen wird unter Leuten, die nicht an der Uni waren und wie abschätzig sich da halt teilweise auch Leute äußern und so weiter. Also umso mehr man halt andere Welten kennt, umso eher versteht man die halt alle und ich glaube, dass das ein großer Vorteil ist, auch wenn das oft nicht so gesehen wird. Und da kann ich dir auch gleich nochmal Danke sagen, weil du warst in meinem Interview damals bei Trivago, wie ich mich beworben habe. Und du hast sehr wohl irgendwie den Sinn darin gesehen, dass ich auf der Universität und so weiter zum Beispiel Erfahrung hatte mit Leadership und so weiter, obwohl es ja offensichtlich eigentlich nicht der Fall ist, weil ihr habt damals noch nie irgendwie ein klassisches Team geleitet oder so. Klar, im Freelancing-Bereich und an der Uni und du hast die Studenten und alles, was da mitspielt. Aber daraus dann zu sehen, dass das in irgendeiner Form Leadership-Erfahrung ist, bin ich mir nicht sicher, ob das so viele machen würden. Und ich habe ja mal das zufällige Glück gehabt, damals hat es ja kein GDPA gegeben, deine Comments über mich zu finden. Von dem Interview und da ist es ja drinnen gestanden. Also da war ich ja sehr positiv überrascht. Nebenbei negative Dinge, die du auch gefunden hast.",
            "start": 2883456,
            "end": 2964217,
            "confidence": 0.7938858267716533,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also eigentlich möchtest du gerade sagen, der Tom ist dafür verantwortlich, dass diese Scheiße hier gerade existiert.",
            "start": 2964257,
            "end": 2969140,
            "confidence": 0.7428235294117647,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja genau.",
            "start": 2969160,
            "end": 2971182,
            "confidence": 0.399,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und er hat Sinn in dem, was du getan hast gesehen.",
            "start": 2971242,
            "end": 2974144,
            "confidence": 0.832090909090909,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ist in dem Kommentar damals zumindest gestanden, ja.",
            "start": 2974485,
            "end": 2977286,
            "confidence": 0.701125,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, ich war betrunken an dem Tag, keine Ahnung, nichts dafür.",
            "start": 2977326,
            "end": 2980708,
            "confidence": 0.5655454545454546,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich habe so viele Fragen, Tom. So viele Fragen.",
            "start": 2980728,
            "end": 2983610,
            "confidence": 0.7727777777777778,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, ich muss sofort weg. Aber du hast, Wolfi, vorhin gefragt, was denn mir das gebracht hat, so mit diesem Wechsel zu Product Management und so weiter. Eins wollte ich noch hinzufügen, sofern das in derselben Firma ist, es ist auch extrem hilfreich, das Netzwerk, das man da bei aufbaut. Du hast dann, ich war in einer komplett anderen Abteilung, komplett andere Funktionen, komplett andere Leute um mich rum. Aber du hast natürlich immer noch gute Verbindungen jetzt so bei mir eben in die Webentwicklung. Und wenn du da mal Infos brauchst oder irgendwas erledigt haben möchtest oder so, oder du brauchst irgendwie Feedback über irgendein Projekt, was jetzt die Personalabteilung plant, dann hast du da sofort die passenden Leute. weil du die alle kennst oder du kannst fragen, wer da passen würde und so weiter. Und umgekehrt, wenn jemand von deinen alten Kumpels in der Entwicklungsabteilung was von der Personalabteilung will, dann fragen sie dich und dann läuft halt viel Kommunikation durch dich und da kriegst du auch extrem viel mit. Und das hat mir auch beim Nach-Mein-Wechsel-Zurück auch oft geholfen, vor allem wenn es um Recruiting ging.",
            "start": 2984190,
            "end": 3056362,
            "confidence": 0.8018789473684208,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du sprichst hier vom berühmt-berüchtigten kurzen Dienstweg, oder?",
            "start": 3057017,
            "end": 3059999,
            "confidence": 0.61775,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ganz genau, ja. So Hinterzimmer-Kanäle und so. Die sind halt oft viel effizienter als irgendwelche offiziellen Kanäle. Oder in manchen Fällen gibt es auch gar keine offiziellen Kanäle. Und dann ist es halt in einer Firma von ein paar hundert Leuten nicht ganz unwichtig, wen du kennst.",
            "start": 3060039,
            "end": 3077232,
            "confidence": 0.8000638297872339,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also nimm dir ein Beispiel, Andi. Wechsle jetzt mal ins Design. Werde Designer, damit du mal eine andere Welt kennenlernst und da auch endlich Kontakte hin hast. Weil immer, wenn wir irgendwen suchen, der Design macht, haben wir keine Kontakte.",
            "start": 3077490,
            "end": 3088621,
            "confidence": 0.7606250000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hatte gerade schon so ein bisschen Angst, dass du sagst, nimm mir mal ein Beispiel, Sinn in meiner Arbeit zu sehen. Ne, Wolfgang, da sehe ich keinen Sinn.",
            "start": 3088641,
            "end": 3097289,
            "confidence": 0.6562413793103448,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das habe ich schon lange aufgegeben.",
            "start": 3097309,
            "end": 3098690,
            "confidence": 0.42483333333333334,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wenn ich mir dein Lebenslauf so ansehe.",
            "start": 3098710,
            "end": 3100992,
            "confidence": 0.7291428571428572,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ihr habt meinen Lebenslauf?",
            "start": 3101032,
            "end": 3101733,
            "confidence": 0.26775000000000004,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Natürlich, das Internet. Dann bist du jetzt wieder vier Jahre in einer Lead-Position und laut dem Pattern deines Lebenslaufes wäre es mal wieder Zeit für ein Pendel. Könntest du dir das nochmal vorstellen?",
            "start": 3102490,
            "end": 3113882,
            "confidence": 0.7576666666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die Frage habe ich mir vorhin selber gestellt, ja.",
            "start": 3113902,
            "end": 3117265,
            "confidence": 0.7725555555555557,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber du bist ja jetzt Director, oder? Also du bist ja jetzt Lead von Leads.",
            "start": 3117285,
            "end": 3120929,
            "confidence": 0.6262666666666666,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich bin Lead von Leads seit August. Das ist jetzt eben nochmal eine Änderung. Das ist eine coole Abwechslung.",
            "start": 3121389,
            "end": 3130513,
            "confidence": 0.7816842105263158,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Eine Flughöhe höher.",
            "start": 3130533,
            "end": 3132314,
            "confidence": 0.4403333333333334,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, wenn man so will.",
            "start": 3132374,
            "end": 3133254,
            "confidence": 0.614,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber jetzt bist du ja noch weiter weg vom eigentlichen Coding.",
            "start": 3133274,
            "end": 3136435,
            "confidence": 0.6058181818181819,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sozusagen, ja. Aber ich muss sagen, davor hatte ich auch schon wieder, ich glaube, acht oder neun Direct Reports. Da war auch schon so langsam nicht mehr viel mit Hands-on. Von dem her ist der Unterschied gar nicht so groß. Ich mache immer noch relativ viele Code Reviews und das ist zumindest ein Weg, mit Code in Kontakt zu bleiben. So bleibe ich ein bisschen verbunden.",
            "start": 3136515,
            "end": 3162290,
            "confidence": 0.8331363636363638,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Moment, aber ist es deine Aufgabe als Director, Code Reviews zu machen?",
            "start": 3162310,
            "end": 3165932,
            "confidence": 0.5915833333333332,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das weiß ich nicht, das definiere ich ja letzten Endes selber und ich finde das einen guten Weg, nicht zu weit abzuheben und dann halt komplett distanziert zu werden von den Engineers.",
            "start": 3166623,
            "end": 3181413,
            "confidence": 0.8524375,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber wie verhinderst du, dass es dann kein Micromanagement wird, dass sie sagen, der da oben will jetzt auch noch unseren Code reviewen?",
            "start": 3181753,
            "end": 3189099,
            "confidence": 0.8292173913043479,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich mache meistens nur, konzentriere mich auf gewisse Sachen. Also ich mache jetzt zum Beispiel nicht tiefgreifende Architecture Reviews oder sowas. Was mir wichtig ist, ist, dass Sachen gründlich sind, dass die Funktionalitäten sinnvoll aufgeteilt sind, dass zum Beispiel nicht eine Funktion auf 300 Seilen alles Mögliche macht, sondern dass das sinnvoll in kleine, kohärente, zusammenhängende Stücke aufgeteilt ist, dass das Naming stimmt. dass Konventionen eingehalten werden, solche Sachen. Und ich glaube, wenn die Leute wissen oder wenn die sehen, da steckt jemand Zeit da rein, mehr Feedback zu geben, wenn das halt auf eine wertschätzende Art passiert und man schreibt nicht einfach nur, this is wrong oder this is right oder irgendwie sowas, dann nehmen die das auch an und wissen das auch zu schätzen, dass halt jemand, der jetzt so in der Rangordnung über ihnen steht, zwei Level, dass der sich die Zeit nimmt und Feedback gibt, weil letzten Endes will jeder Feedback haben und braucht jeder Feedback. Und wenn man die sehen, man investiert ja auch da Zeit rein, denen Anregungen zum Lernen zu geben.",
            "start": 3189179,
            "end": 3265594,
            "confidence": 0.848662921348315,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Da muss ich mal ganz, ganz hart mit dir sein. Also ich denke, du hast nichts in Code Reviews zu verlieren. Ich finde das sehr beachtlich.",
            "start": 3266314,
            "end": 3272059,
            "confidence": 0.8186538461538462,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Zu verlieren.",
            "start": 3272219,
            "end": 3273220,
            "confidence": 0.61,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Zu suchen, zu verlieren. Ich denke, du hast nichts in Code Reviews zu suchen, weil ich stimme dir zu, all das, was du wegen Code Struktur gesagt hast. Aber ich denke, deine Aufgabe auch schon als Engineering Manager ist es, die Leute unter dir zu enablen, darauf zu achten, anstatt dass du in Code Reviews springst. Weil im Endeffekt bist du auch schon als Engineering Manager auf einer Flughöhe und als Director nochmal eine Flughöhe höher, der mehr Guidance und Richtung vorgeben sollte und jemand anders soll die Straße bauen. Und das ist meine harte Meinung, weil ich denk mir so, Ich bin jetzt Software-Ingenieur.",
            "start": 3273260,
            "end": 3308607,
            "confidence": 0.7971047619047616,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, der Andi hat viel gelitten schon darunter.",
            "start": 3308627,
            "end": 3311328,
            "confidence": 0.6635555555555555,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, vielleicht auch, aber ich bin Software-Ingenieur. Und dann kommt mein Chef-Chef in den Code-Review. Ich bin mir nicht sicher, wie wohl ich mich damit fühle, auch wenn ich gerade dem Team neu gejoint bin und dich noch nicht kenne.",
            "start": 3311488,
            "end": 3322433,
            "confidence": 0.8025249999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber vielleicht gerade nochmal als Kontextfrage, wie viele ICs sind dann wirklich unter dir?",
            "start": 3323228,
            "end": 3328970,
            "confidence": 0.8227142857142856,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "22.",
            "start": 3328980,
            "end": 3330320,
            "confidence": 0.5,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also eigentlich das, was du früher schon als Direct ICs gehabt hast.",
            "start": 3330330,
            "end": 3335572,
            "confidence": 0.7359999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sozusagen. Sieben Engineering Manager und 22 ICs. Ja, Andi, ich verstehe deine Position. Ich denke, das ist auch immer ein bisschen vom Umfeld abhängig. Vielleicht ist es bei mir auch nur übergangsweise noch so, dass ich das mache. Ich bin in der Position jetzt seit einem halben Jahr ungefähr. Kann sein, dass ich das in Zukunft sein lasse. Im Moment, glaube ich, ist es noch Gut, weil wir auch so mit Codereviews so ein bisschen am struggeln sind noch, das alles am Laufen zu halten und ja, sodass die zeitnah gemacht werden. Aber ja, werde ich mal drüber nachdenken.",
            "start": 3335612,
            "end": 3377635,
            "confidence": 0.8356262626262623,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Springst du da eigentlich einfach rein? Also nimmst du dir da einfach um PR?",
            "start": 3377655,
            "end": 3382040,
            "confidence": 0.6441428571428572,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee, ich werde angefragt. Also wir haben da auf GitHub eine automatische Verteilung und da stehe ich halt, bin in dem Team mit drin von Entwicklern, die an der Codebase arbeiten und entsprechend werde ich zufällig in Code Reviews mit reingezogen und Ja, ich werde mich mal umhören.",
            "start": 3382060,
            "end": 3402340,
            "confidence": 0.7777708333333333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das hört sich aber eher so nach Altlast an für mich. Das hört sich an, dein Name steht noch in einem Code-Owners-File oder ist noch in irgendeinem GitHub-Engineering-Team zugeordnet, wo dann das Round-Robin-Feature aktiviert ist. Also ich sehe das so. Ich denke, wenn du wirklich von den Entwicklern angefragt wirst, weil du das Billing-Feature geschrieben hast, Dann denke ich, ist das was anderes. Wenn sie deinen Input wirklich ziehen, dann bin ich bei dir, dann soll man da reingehen. Wenn du aber auch durch ein Round-Robin-Verfahren dann da reingeholt wirst, dann habe ich immer so das Gefühl, hm, weiß ich nicht. Ich glaube, was sinnvoll ist, wenn ihr wirklich dann, ich sag mal, Code-Probleme habt und so weiter, dass du dir jetzt zwar die Code-Reviews anschaust, Aber niemals öffentlich in Pull-Requestern da irgendwas machst und das dann vielleicht mit deinen Leads in One-on-Ones besprichst. Weil dann hast du nämlich eine Faktenbasis, eine Datenbasis und dann andere Leute enables. Ich bin aber auch ganz ehrlich, das ist eine Meinung von vielen. Ich sag nicht, du machst das falsch. Du hast gerade gesagt, dass Henk von der Umgebung abhängt. Ich glaub dir sogar und das ist super. Ich denk mir halt nur immer, was ist, wenn ich die Firma wechseln würde, ich kenn dich nicht, ich komme in dein Team, mache ein Pull-Request, ich wäre vielleicht am Anfang ein bisschen beängstigt, wenn du als Director mir Feedback geben würdest, auch wenn das Feedback valide ist und gut ist, versteh mich nicht falsch, ich würde mich trotzdem fragen, was ist das hier, warum springt mein Chef-Chef in meinen Code-Reviews rum? Das ist so das Gefühl, was ich, glaube ich, haben würde.",
            "start": 3402460,
            "end": 3489432,
            "confidence": 0.7689316546762592,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es gibt ja, oder es hat, der ist leider schon verstorben, ein bekannter Journalist in Österreich, der mal gesagt hat, die Geheimwaffe jedes Journalisten ist das Archiv. Und wir haben ja alle Folgen transkribiert. Und da gibt es in Folge 60, wo wir über On Call gesprochen haben, habe ich die gefragt, Andi, was haltest du von Engineering Managern in On Call? Und du hast gesagt, du bist ein riesengroßer Fan davon, weil man nicht den Kontakt verliert und weil man näher am Geschehen ist.",
            "start": 3489472,
            "end": 3516332,
            "confidence": 0.7846235294117645,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, Engineering Manager, aber Director ist ja immer noch eine Höhe darüber. Als Engineering Manager... Ja, wobei es ja.",
            "start": 3517205,
            "end": 3523887,
            "confidence": 0.6477368421052633,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ein sehr kleines Team vom Tom, muss man auch sagen, jetzt für einen Director sonst.",
            "start": 3523907,
            "end": 3527528,
            "confidence": 0.7338666666666664,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Mit 22 Leuten finde ich, das ist nicht ein kleines Team.",
            "start": 3527568,
            "end": 3529769,
            "confidence": 0.7475454545454544,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, das haben wir beide früher jeweils einzeln gehabt.",
            "start": 3529989,
            "end": 3532330,
            "confidence": 0.746111111111111,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, nur weil ihr früher schlechte Strukturen hattet, heißt das nicht, dass das ein kleines Team ist.",
            "start": 3532350,
            "end": 3537512,
            "confidence": 0.7642352941176472,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, als Engineering Manager ist es okay.",
            "start": 3537552,
            "end": 3539872,
            "confidence": 0.5431428571428571,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber... Also, ich bin inzwischen... Können wir mal ganz kurz sagen, wann wurde Folge 60 aufgenommen? Auch 2024 ist nicht das Jahr des Linux-Desktops.",
            "start": 3539932,
            "end": 3549097,
            "confidence": 0.6353333333333334,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Hey, scrollen muss ich immer noch in Linux auch. 28. Februar 23, also genau vor einem Jahr.",
            "start": 3549117,
            "end": 3555481,
            "confidence": 0.7215294117647059,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau vor einem Jahr. Ich bin immer noch der Meinung, dass Engineering-Manager Verantwortung dafür übernehmen sollen, was das Software-Engineering-Team und das Ops-Team und das Reliability-Engineering-Team leistet. Das bedeutet, komplett hands-off ist schwierig. Ich bin nicht mehr der Meinung, dass Engineering Manager bei mehr als drei bis vier Direct Reports hands-on sein sollten und coden sollten. On-Call und ich sag mal völlig Operations ist dann auch eine schwierige Geschichte. Das bedeutet, ich kann auch meine Meinung ändern.",
            "start": 3555501,
            "end": 3588943,
            "confidence": 0.8302763157894739,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt bei, also das Google-Modell, wo jeder Engineering Manager auch hands-on sein muss, findest du nicht gut oder fast jeder eigentlich.",
            "start": 3588983,
            "end": 3596008,
            "confidence": 0.7235454545454545,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Da würde ich dann jetzt gerne die Wunderwaffe vom Tom nehmen und sagen, das Umfeld ist wichtig, denn nennen wir mal im Operations-Bereich eine standardisierte Infrastruktur mit Runbooks und allem drum und dran, dann könnte ich sogar jeden von euch sofort on Call setzen. Und es läuft.",
            "start": 3596493,
            "end": 3614444,
            "confidence": 0.859127659574468,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das glaube ich nicht.",
            "start": 3614504,
            "end": 3615184,
            "confidence": 0.30725,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber es kommt auf die... Ja, solange.",
            "start": 3616655,
            "end": 3618616,
            "confidence": 0.7548571428571428,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Kein Inzident ist, ist ja kein Problem.",
            "start": 3618656,
            "end": 3621857,
            "confidence": 0.4634285714285714,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es kommt dann wirklich darauf an, wie erwachsen ist die Infrastruktur und wie erwachsen sind die Operations und die Toolings. Scheiß Antwort, aber it depends.",
            "start": 3621897,
            "end": 3629679,
            "confidence": 0.7915999999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber dieses Argument nahe dran zu sein, finde ich schon eigentlich ganz gut. Die Frage ist immer, wie viel Zeit benötigt das? Und Code Reviews, keine Ahnung, wie viel Zeit investierst du in Code Reviews, würdest du sagen?",
            "start": 3629719,
            "end": 3640642,
            "confidence": 0.7543421052631578,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Pro Woche vielleicht so fünf Stunden oder so. Und ich meine, Andi hat schon einen Punkt. Ich könnte die Reviews auch machen, ohne zu kommentieren. Mir das einfach nur so anschauen und mich da durchklicken. Ja, könnte ich auch machen. Also ich mache das schon auch für mich, um halt an der Technik ein bisschen dran zu bleiben, zu sehen, was in der Codebase vor sich geht. Aber dann denkt man sich auch wieder, Ja, ich habe da aber eine bessere Lösung und das sollte anders gemacht werden.",
            "start": 3641002,
            "end": 3669541,
            "confidence": 0.7776363636363637,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber in Schluss daraus zu ziehen, was vielleicht das Problem ist, zum Beispiel, wenn jetzt du sagst, okay, es wäre schöner, Clean Code verbreiteter zu haben und dann vielleicht auch zu reagieren und da irgendwie was Richtung.",
            "start": 3669561,
            "end": 3680993,
            "confidence": 0.7608648648648648,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja klar, man macht sich ein Bild daran, was sind häufige Fehler oder Auffälligkeiten, die in unserer Codebase zu Problemen führen über die Zeit. Und dann überlegt man sich mit dem Team, was könnte man als Gegenmaßnahme machen, brauchen wir spezielle Trainings, sollten wir uns mal gemeinsam irgendwelche Videokurse anschauen oder sonst was. Dafür finde ich es auf jeden Fall wichtig, dass ich auch als Director in den Code reinschaue. Ob das jetzt mit Kommentaren ist oder ohne, da kann man drüber streiten, ja.",
            "start": 3681713,
            "end": 3715457,
            "confidence": 0.8094285714285713,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Völlig valide Punkte, völlig valide Punkte. Doch ich denke halt, dass du als Engineering Manager A, Multiplikator bist und das bedeutet, das ganze Team educaten solltest und in der Regel passiert das nicht durch Kommentare in einem Pull-Request. weil das meist eine 1 zu 1, 1 zu 2 Kommunikation ist. Auf Director-Ebene wird das Multiplikator-Dasein sogar noch gesteigert, weil du einen deutlich größeren Hebel hast durch die Strategie und Co. Das ist das, was ich denke. Die zweite Geschichte ist, ich bin Hardliner, dass ein Lehrer immer dafür sorgen sollte, dass die Schüler und Schülerinnen besser werden als der Lehrer und dass du ein Team so aufbauen solltest, dass du gar nicht mehr benötigt wirst. Und umso mehr du aktiv im Hands und im Operations involviert bist und nicht der Bittsteller bist, in welche Richtung wir gehen, desto weniger erfüllst du diesen Job, denke ich. Weil die Schülerinnen und Schüler in diesem Sinnbild, was ich hier gerade male, sollen intrinsisch darauf kommen. Die sollen das selbst machen, ohne dass man immer gesagt, ah, da war aber, da hast du das Naming, war wir da nicht. ordentlich gemacht, was eh subjektiv ist. Das ist dann was anderes.",
            "start": 3715477,
            "end": 3786102,
            "confidence": 0.7985867346938775,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber glaubst du dann, dass das Pendel negativ das Ganze beeinflusst, dass man schlechter loslassen kann, weil man ja quasi nicht nur in eine Richtung wächst, sondern immer wieder mal zurück und hin und her und irgendwie immer mehr involviert ist? Ohne jetzt zu sagen, dass der Andi recht hat, weil ich glaube, es ist gar nicht so einfach.",
            "start": 3786142,
            "end": 3803234,
            "confidence": 0.7973728813559322,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es kann schon sein, dass man aufpassen muss, in welcher Rolle man gerade ist. Das schreibt Charity in ihrem Artikel ja auch. Man kann immer eines gut machen und in einem besser werden, aber nicht in beiden gleichzeitig. Das würde dann mehr Andis Positionen untermauern, dass man sich darauf konzentrieren soll, Okay, wenn man Engineering Manager ist, dann baue ich ein Team auf, trainiere das Team, gucke, dass das Team besser wird, mache mich selber überflüssig. Wenn ich Engineer bin, dann arbeite ich an der Technik und am Code und dann müssen mich auch Kommunikation und Planung und Strategie und People Management nicht groß interessieren.",
            "start": 3804274,
            "end": 3850452,
            "confidence": 0.8472380952380951,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also meine Meinung dazu ist, dass Code Reviews, glaube ich, noch am besten geeignet sind, weil man den Kontakt nicht verliert und auch keine Abhängigkeit aufbaut, weil wenn du jetzt keine Code Reviews mehr machst, dann passiert nichts.",
            "start": 3851131,
            "end": 3863662,
            "confidence": 0.8105263157894737,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, wird keiner groß merken.",
            "start": 3864122,
            "end": 3865223,
            "confidence": 0.2886,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau. Und es gibt ja keinen Prozess, dass irgendwas durch dich durchgehen muss. Also auch da blockt man eigentlich wenig. Also ich sehe das auch schon eher so, dass man den Kontakt nicht verliert. Und gleich wie man Skip-Level-Meetings macht, also wenn der Chef-Chef mit einem IC oder so, also in deinem Fall als Director eben jetzt mit einem IC ein Meeting hat, das wäre sowas ähnlich wie Code-Review. Man schaut mal rein und solange das zeitlich geht, finde ich das eigentlich ganz in Ordnung. Aber es ist natürlich, Sobald sich Leute beschweren anfangen, dann wird es sicher ein Problem. Aber jetzt nur mal, um den Kontakt zu halten. Und ich glaube, es wäre für mich, wenn ich es sehen würde, da schaut jemand auch in meinen Code rein, der viel Erfahrung hat, der mir vielleicht eine Hilfestellung gibt, wo ich dann auch zu dem gehen kann und sagen, hey, wir haben im Team dieses Problem. Also wo ich auch irgendwie einen Kontakt zu dem nach oben habe, vom IC-Level aus. Finde ich nicht grundsätzlich so schlecht.",
            "start": 3865964,
            "end": 3918705,
            "confidence": 0.7747853107344631,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube, der Tom hat gerade den Key-Satz gesagt, dass es zwei verschiedene Jobs sind. Vom Software-Engineer zum Engineering-Manager. Ist keine Promotion, sagt man so schön. Man sagt ja immer so schön, es ist ein Karrierewechsel.",
            "start": 3919260,
            "end": 3931910,
            "confidence": 0.8281666666666667,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es ist eine ganz andere Position, ja.",
            "start": 3931930,
            "end": 3934132,
            "confidence": 0.5148571428571429,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und in dem Charity Mayers Artikel, der ist auch in den Show Notes verlinkt, da steht auch drin, dass wenn du das machst, dass du vom Senior Engineer in einen Junior Engineering Manager wechselst, weil das ist eine andere Profession, man braucht andere Skills. Und ich glaube, es ist wichtig, bei diesem Pendel im Sinn zu haben, in welcher Rolle bin ich gerade, welchen Hut trage ich gerade. Ich vergleiche das immer so mit DevOps. Ja, wir wissen alle, es ist kein Job, es ist eine Kultur. Developer und Operations müssen zusammenarbeiten. Aber es gibt immer noch DevOps-Engineers inzwischen. Und bei einer DevOps-Engineer-Rolle mag ich gern zu fragen, okay, das sind zwei Jobs, Softwareentwickler und Operations-Systemadministrator, in einer Person. Das funktioniert einfach nicht. Du kannst nicht zweimal 100 Prozent den Job haben. Da frage ich immer, okay, du hast zwei Mützen und du musst 100 Prozent. Welche Mütze trägst du denn öfter? Wie viel Prozent? Weil im Endeffekt ist es ja auch das. Ich glaube es ist sehr schwierig diese Grenzen nicht kontinuierlich zu überschreiten und auch diese, ich habe das Wort Flughöhen schon sehr oft erwähnt, ich mag das sehr eigentlich, weil man halt über nicht den Detaillevel nachdenkt, sondern wirklich dann über was bringt denn jetzt uns als Gruppe weiter und nicht mich jetzt gerade in diesem Pull Request und was bringt uns als Organisation weiter und all sowas.",
            "start": 3934688,
            "end": 4007577,
            "confidence": 0.7683203463203467,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Deswegen, Aber jetzt den Unterschied zwischen Entwicklerin und Engineering Manager, der ist ja klar. Also da gibt's, das ist eine andere Position und keine Beförderung. Ich glaube, da sind wir uns ja alle einig. Aber von Engineering Manager auf Director-Ebene, das ist ja eine sehr ähnliche Rolle. Das ist ja nur ein kleiner Schritt weiter. Du brauchst da ähnliche Skills, die du schon auf der Engineering-Manager-Ebene gelernt hast, brauchst du dann im nächsten Schritt ja auch wieder und entwickelst weiter. Also das ist ja eher dieselbe Richtung, als wie wenn du jetzt von der IC-Seite kommst zu einem Engineering-Manager. Andi schüttelt schon den Kopf.",
            "start": 4007597,
            "end": 4047554,
            "confidence": 0.7849134615384614,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich frage mich, wo bin ich hier gelandet?",
            "start": 4047634,
            "end": 4048835,
            "confidence": 0.313625,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das fragst du dich ja erst jetzt nach 100 Episoden.",
            "start": 4050397,
            "end": 4052960,
            "confidence": 0.35050000000000003,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, es ist derselbe Track. Also Engineering Manager und dann Engineering Director.",
            "start": 4052980,
            "end": 4058325,
            "confidence": 0.6068333333333333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also das ist keine Karriere wechseln. Das stimmt schon. Das ist jetzt die klassische Treppe und Leiter hoch. Das ist richtig. Aber ich würde schon sagen, dass du dich nochmal mehr vom Hands-on entkoppeln solltest.",
            "start": 4058365,
            "end": 4070978,
            "confidence": 0.7845714285714284,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das stimmt schon, aber du hast natürlich genauso 101s, du versuchst deine Leute weiterzubringen, du shapest die Kultur, du machst das richtige Environment, dass alle gut arbeiten können und das machst du halt an einem Level höher. Klar bist du noch weiter weg, aber es ist dieselbe Idee, würde ich mal sagen, und dieselbe Richtung und Skills auch.",
            "start": 4071602,
            "end": 4092423,
            "confidence": 0.7712068965517245,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber da gibt's jetzt auch wieder alle Strömungen, ne? Also du hast das ganze Meinungsspektrum. Es gibt auch viele, die schreiben, na, man soll immer noch coden, selber auch. Natürlich an nix Zeitkritischem und so, weil man halt öfter unterbrochen wird als Engineering Manager und als Director wahrscheinlich sowieso.",
            "start": 4093149,
            "end": 4109564,
            "confidence": 0.803061224489796,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Am besten in deiner Freizeit einfach.",
            "start": 4109859,
            "end": 4111442,
            "confidence": 0.4326666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, genau, in der Freizeit. Aber dass man irgendwie sowas auch noch seine vier Stunden Maker-Time pro Woche reserviert oder so, gibt es auch viele, die das sagen. Also vielleicht gibt es nicht die eine richtige Antwort. Vielleicht kommt es auf den eigenen Charakter, die eigenen Stärken und auch auf das Umfeld halt an.",
            "start": 4111462,
            "end": 4130580,
            "confidence": 0.8228703703703703,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also ich glaube, dass es einfach wichtig ist, dass es nicht die Micro-Management ausartet. Und das würde ich bei Code Reviews auf keinen Fall sehen.",
            "start": 4131027,
            "end": 4137468,
            "confidence": 0.6395999999999998,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also da sind wir uns, glaube ich, alle einig. Ich glaube, wir sollten, wenn du eine Lead-Position hast, dann versuch halt einfach nicht besser zu sein als die Leute, die den realen Job machen. Versuch denen zu vertrauen. Und wenn du denkst, die machen es nicht zu deinem qualitativen Anspruch, ... dann sag nicht, wie sie es tun sollen, sondern ... ... verfalle in eine Coaching-Rolle und versuche, ... ... dass diese Personen selbst darauf kommen. Wenn wir uns auf sowas einigen, dann sind wir alle d'accord ... ... und ich glaube auch, ... ... Größe der Firma spielt eine große Rolle, ... ... inwieweit ein Director-Level ausgelebt wird. Umfeld, dynamisches Umfeld, ... ... finanzielles Umfeld der Firma, ... ... wie stabil ist das oder wie hektisch ist das. Also ich glaube, ... ... da kommen viele It-Depends zusammen, das ist richtig.",
            "start": 4137948,
            "end": 4179853,
            "confidence": 0.7716760563380282,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wo ich großen Wert drauf lege in den Code Reviews, also ich lobe auch viel. Man kritisiert ja nicht nur oder gibt Anregungen, wie man was anders und besser machen kann, sondern es ist in einem Code Review auch wichtig, dass wenn man was Gutes sieht, dass man es auch benennt. Das vergessen viele.",
            "start": 4180212,
            "end": 4197130,
            "confidence": 0.8071851851851853,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hast du da mal ein Beispiel? Ich stell mir gerade vor, du kommst in einen Code Review und so. Geiles Observer-Pattern. Finde ich geil.",
            "start": 4197150,
            "end": 4203054,
            "confidence": 0.3785416666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "So noch nie gesehen. Ne, wenn jemand zum Beispiel Boy Scout-mäßig was aufräumt. Wenn irgendwas angefasst und gerade gezogen wird, was jetzt eigentlich gar nicht Thema war. Und es ist klar, wenn es jetzt nicht gerade 50 Dateien bedeutet anzufassen, aber wenn irgendwas mit relativ wenig Aufwand vereinheitlicht werden kann. Zum Beispiel eine Funktion, einen Namen verbessert oder irgendwas an eine Konvention angepasst wird, die sich mittlerweile geändert hat. Dann sage ich auch, cool, great Boy Scouting oder irgend sowas und noch ein entsprechendes Emoji nebendran. Und da, denke ich, hilft mir dann meine Director-Rolle schon wieder, weil wenn du halt so ein Lob Dann von deinem Chef-Chef bekommst, dann denke ich, motiviert das auch ein bisschen.",
            "start": 4203074,
            "end": 4251663,
            "confidence": 0.7945811965811962,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und es gibt ja eigentlich Leading by Example. Man könnte das ja auch so argumentieren, wenn du das deinen Engineering-Managern beibringen willst, dann musst du das ja selber mal vorzeigen.",
            "start": 4251843,
            "end": 4260506,
            "confidence": 0.7151666666666666,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und den Engineers auch.",
            "start": 4260526,
            "end": 4261447,
            "confidence": 0.34750000000000003,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und den Engineers natürlich.",
            "start": 4261507,
            "end": 4262307,
            "confidence": 0.28500000000000003,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es gibt ja keinen Grund, warum die Engineers das nicht machen sollten.",
            "start": 4262347,
            "end": 4265128,
            "confidence": 0.47174999999999995,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "So, Andi, jetzt.",
            "start": 4265168,
            "end": 4265808,
            "confidence": 0.6863333333333334,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also beim Tom muss ich sagen, Kudos, du hast einen sehr guten Punkt gebracht, warum Director in Code Reviews sein sollten und da bin ich d'accord. So habe ich das noch nicht gesehen, danke dafür. Beim Leading by Example beim Wolfgang war ich wieder vorne und hinten nicht dabei. Aber ich würde mich interessieren, welches Emoji packst du dann da hin?",
            "start": 4266549,
            "end": 4284174,
            "confidence": 0.7547377049180329,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Klatschende Hände.",
            "start": 4284635,
            "end": 4285616,
            "confidence": 0.8,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Achso, ich dachte irgendwie so ein Vater mit so einem Keks oder so. Die verkaufen ja auf Kekse irgendwie.",
            "start": 4285656,
            "end": 4290160,
            "confidence": 0.4116842105263158,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, nee, nee, kenne ich nicht.",
            "start": 4290200,
            "end": 4291561,
            "confidence": 0.30383333333333334,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Pauli bekommt ein Keks. Was war jetzt das Leading by Example Problem? Ja, ich denke, ich denke man... Kassettenaussagen ist schlecht, du musst schon mit einer Argumentation kommen.",
            "start": 4291601,
            "end": 4299148,
            "confidence": 0.6295714285714284,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jaja, okay. Also nur weil ich meine Leute dafür enablen möchte, Public Speaking zu machen, heißt das nicht, dass ich ein guter Speaker sein muss. Ja? Also Leading by Example ist eine tolle Geschichte, aber ich denke nicht... Ja, du.",
            "start": 4299388,
            "end": 4311738,
            "confidence": 0.74685,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Solltest nicht leaden, wo du keine Ahnung hast oder es selber nicht gut machen kannst. Aber wenn du es gut machen kannst, warum nicht? Dann kannst du ja auch als Public Speaker zeigen, wie es geht.",
            "start": 4311758,
            "end": 4319724,
            "confidence": 0.6731944444444445,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja ja richtig aber vielleicht ist der Tom ja auch nur von sich überzeugt, dass er denkt er hatte gerade da tolles Boyscouting entdeckt aber er hat's gar nicht, weil das war ein realer Buck und man könnte auch argumentieren und ich sehe auch schon die Kommentare von dieser Podcast Episode, dass Leute sagen, ja pass mal auf aber wenn du ein Feature entwickelt hast und dann noch in dem PR ein Comment fürs Boyscouting machst, nee nee das sollte ein eigener PR sein, die Argumentation könnte man auch auspacken also von daher. Ich bin nicht so ganz der Freund von immer leading by example, deswegen lasse ich Wolfgangs Punkt nicht so gelten, mit dem Loben, dass das viel zu selten in Pull Request stattfindet. Also die Kultur, Kudos, bitte weiterführen und auch bitte in weiteren Firmen in deiner Zukunft integrieren, weil ich denke, darüber sprechen wir alle viel zu selten und ich habe auch seltenst sowas mal miterlebt.",
            "start": 4320506,
            "end": 4367355,
            "confidence": 0.7856163522012576,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, loben und auch mal Dankeschön sagen, wenn jemand was besonders schön macht und besonders gründlich.",
            "start": 4367680,
            "end": 4374484,
            "confidence": 0.7315625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kommen wir mal ein bisschen weg von diesem Micro-Management-Thema und was ein Director tun sollte und was nicht. Wieder hin zum Pendel. Und zwar, jetzt stell dir mal vor, jemand hört diese Episode.",
            "start": 4374504,
            "end": 4384711,
            "confidence": 0.738909090909091,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Hört da wirklich jemand zu?",
            "start": 4385231,
            "end": 4386232,
            "confidence": 0.6304000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hier hört, glaube ich, hoffentlich jemand zu. Wir sprechen immer in so einem Void, aber ab und zu kommt mal was zurück.",
            "start": 4386792,
            "end": 4392078,
            "confidence": 0.4598636363636364,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wir waren gerade in Brüssel und haben die Leute wirklich getroffen. Es gibt wirklich Leute aus Mensch und Blut. Wie nennt man das? Aus Fleisch und Blut. Ihr als Vegetarier habt da Probleme damit. Es gibt sie wirklich.",
            "start": 4392118,
            "end": 4406715,
            "confidence": 0.651105263157895,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die Person hört diese Episode und fragt sich, hm, von diesem Pendel hab ich noch nie gehört und ich hab das noch nie so gesehen, dass das kein Rückschritt ist, sondern vielleicht einfach wieder zurück zu dem, was ich liebe. Jetzt hattest du den großen Luxus, dass deine Umgebung sehr supportive da war. Das ist aber ja nicht überall so und deswegen, welchen Tipp würdest du mal einer Person geben, wenn er oder sie darüber nachdenkt, zu pendeln? Das bedeutet, man ist in einer Liedrolle und hey, ich liebe Coding wieder, weil.",
            "start": 4407440,
            "end": 4434519,
            "confidence": 0.7816956521739131,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also zurückpendeln in dem Fall. Zurückpendeln.",
            "start": 4434955,
            "end": 4439119,
            "confidence": 0.7671666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Am allerbesten ist es, glaube ich, wenn die Bedenken schon vorher da sind und thematisiert werden können. Also bevor man in der Engineering Manager Stelle ... gebeten wird. Das gibt es ja manchmal auch. Es gibt keinen, der das machen will. Und dann werden Leute aktiv gefragt. Und dass man dann sagt, ja ... ... ich würde es mal ausprobieren, ... ... aber ich hätte gerne erst mal so eine Art ... ... Probezeit auf sechs Monate. Nach sechs Monaten ... ... möchte ich dann die Option haben, ... ... wieder zurückzugehen in meine alte Rolle. Wenn ich merke, das ist nichts für mich. Das kann man wirklich nicht unbedingt vorher wissen. Und da hilft es, wenn der Manager halt da unterstützend ist und einem zugesteht und einen da nicht verheizen will und unglücklich in der Position festhalten und so weiter.",
            "start": 4439160,
            "end": 4492787,
            "confidence": 0.8280212765957446,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ist jetzt sechs Monate, was du für sinnvoller achtest, war das eine random number?",
            "start": 4492807,
            "end": 4497570,
            "confidence": 0.7977857142857142,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das würde ich mal als Minimum sagen, weil wenn man jetzt nach einem Monat sagt, das gefällt mir aber alles nicht, dann ist es vielleicht ein bisschen verfrüht. Dann hat man das noch nicht hat man sich noch nicht richtig drauf eingelassen, glaube ich. Nach sechs Monaten hat man dann schon so langsam eine Ahnung, wie der Job abläuft. Besser ist vielleicht noch ein Jahr, aber so die Zeitspanne sollte es schon sein. Also am besten ist es, wenn schon vorher so eine Vereinbarung da ist. Wenn das nicht der Fall ist, dann trotzdem muss man sich ja früher oder später jemandem anvertrauen, ob das denkbar wäre, wie sieht das mein Manager, mein Mentor, irgendjemanden, zu dem man Vertrauen hat in der Firma. Und ich glaube, wichtig ist es halt, mindestens mal einen Unterstützer zu haben bei der Sache. Und wenn man den gar nicht findet, dann wird es schwierig, denke ich.",
            "start": 4497650,
            "end": 4547907,
            "confidence": 0.8324210526315788,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Würdest du denn sagen, dass so Überlegungen auch valide sind, dass man nicht in sein vorheriges Team zurückgeht, sondern vielleicht innerhalb der Organisation in ein anderes Team geht und ich sag mal einen Neustart macht?",
            "start": 4548207,
            "end": 4561680,
            "confidence": 0.7823714285714285,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist auf jeden Fall denkbar. Ich glaube, die Frage ist, ist das vorherige Team das, das ich auch gemanagt habe? Ich glaube, schwieriger ist es, in das Team zu wechseln, das man bis eben noch gemanagt hat selber. Das könnte vielleicht, ich weiß nicht, wenn es da ... Vielleicht gab es mal irgendwelche Auseinandersetzungen, wo man dann als Manager für eine Seite Partei ergreifen musste oder so, und dann wird man wieder ... normaler Kollege oder Kollegin, sag ich mal, in dem Team. Vielleicht ist da dann noch ein bisschen Animosität übrig von der einen oder anderen Seite. Das könnte eventuell schwierig sein. Ansonsten, wenn es das vorherige Team war, das man aber in der Zwischenzeit nicht gemanagt hat, dann sollte es ja im Prinzip kein Problem sein. Aber kann sein, je nachdem, wie da die personellen Strukturen sind, dann ist es vielleicht auch sinnvoll, ein anderes Team zu wechseln und da neu anzufangen.",
            "start": 4562540,
            "end": 4618991,
            "confidence": 0.8520387096774193,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber die Empfehlung ist grundsätzlich erstmal Firmen intern zu bleiben, oder?",
            "start": 4619011,
            "end": 4623092,
            "confidence": 0.8428181818181819,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Sehe ich nicht zwingend so. Es kann manches leichter machen, zum Beispiel den Wechsel zurück macht es wahrscheinlich leichter in der gleichen Firma, falls es dann doch nichts ist. Aber ansonsten hat es auch ein paar Vorteile in eine andere Firma zu gehen, denke ich. Weil man halt nicht belastet ist durch vorher, oh hey, wir waren immer gute Kumpels und wir gehen am Wochenende zusammen feiern, jetzt bin ich aber dein Boss. Das kann auch für Probleme sorgen und das hast du halt in einer fremden Firma tendenziell nicht.",
            "start": 4623152,
            "end": 4653834,
            "confidence": 0.8140444444444442,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Meine Empfehlung für die Trial-Phase im Engineering-Management ist eigentlich immer ein Jahr. Und der Grund ist relativ einfach, weil innerhalb eines Jahres hat man dann einmal den kompletten Life-Cycle durch.",
            "start": 4654094,
            "end": 4665356,
            "confidence": 0.8246666666666668,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Machst du alles mal mit, ja.",
            "start": 4665396,
            "end": 4666516,
            "confidence": 0.6121666666666666,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Recruiting, Gehaltsverhandlungen, Performance-Review und so weiter. Und vielleicht mag es besonders in den ersten zwei, drei Monaten schmerzhaft sein, aber dazu haben wir auch schon einige Episoden gemacht. Meine Frage, wir reden die ganze Zeit vom Pendulum, ich bin Individual Contributor. werde Managerin und pendel wieder zurück als Individual Contributor. Es gibt aber auch Leute, die kommen aus dem Consulting oder direkt auch von der Uni und steigen dann direkt in eine Managementrolle ein. Vielleicht sogar haben sie ein MBA oder ähnliches. Ist dir schon mal ein Fall auf den Tisch gekommen, wo jemand direkt in eine Managementposition eingestiegen ist und will dann in eine Software Engineering Position pendeln?",
            "start": 4666556,
            "end": 4710957,
            "confidence": 0.8133302752293576,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aus dem Management.",
            "start": 4711497,
            "end": 4712879,
            "confidence": 0.7876666666666666,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also eigentlich, man startet das Pendel, weil irgendwo muss man ja starten, aber man startet halt nicht klassisch von Software-Ingenieur zum Manager, sondern von Manager auf Basis der akademischen Ausbildung als individueller Contributor. Und muss jetzt auch nicht Software-Ingenieur, kann auch Designer, Produktmanager.",
            "start": 4712899,
            "end": 4728580,
            "confidence": 0.7864186046511629,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wir leben ja mittlerweile im Zeitalter der Bootcamps. Viele IT-Spezialisten haben keine klassische Ausbildung oder IT-Studium oder sowas, sondern die haben ein einjähriges Bootcamp oder sowas durchlaufen und sind quasi Quereinsteiger ins Software Engineering. Und das habe ich schon mehrfach erlebt jetzt, dass die zum Beispiel aus dem Wirtschaftsbereich kommen, haben Bachelor of Economics oder irgendwas, sind dann ein, zwei Jahre im Beruf gewesen, haben gemerkt, das ist jetzt nicht so das, was sie bis Lebensende machen wollen und die haben dann umgesattelt auf Software Engineering. Das habe ich zum Beispiel schon erlebt. Ich bin jetzt aber nicht sicher, doch in einem Fall weiß ich, dass der auch so eine Art Management-Position hatte und der ist dann jetzt halt Individual Contributor als Software-Engineer. Gibt's auf jeden Fall, denke ich.",
            "start": 4729055,
            "end": 4782558,
            "confidence": 0.8117751937984496,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich meine, das Too-Long-Didn't-Read von dieser Episode ist ja schon so ein bisschen, dass man mit dem Engineering-Management-Pendulum so ein bisschen alte Zöpfe abschneidet. So die ganzen alten Konzernstrukturen, es geht nur nach oben und ich hoffe, dass dies auch in unserer Gesellschaft auch so ankommt, auch wenn die Generation Z natürlich auch von Boomern erzogen wird, denen das auch so in die Wiege gelegt wurde.",
            "start": 4782598,
            "end": 4805614,
            "confidence": 0.805818181818182,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Man könnte ja fast sagen, Tom, du warst ein Thought Leader, wie das so schön da drauf liegt.",
            "start": 4805654,
            "end": 4809237,
            "confidence": 0.6281666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und freiwillig. Aber ich glaube auch, dass das eine gesunde Entwicklung ist insgesamt, dass man wegkommt von diesem Up or Out. Entweder wirst du befördert oder du musst irgendwann die Firma wechseln. Das nimmt auch so ein bisschen Druck raus und es ist ja irgendwo auch dämlich, wenn eine Firma die Leute unter Druck setzt und mit Gesichtsverlust bedroht, ob jetzt ausdrücklich oder nur implizit, die Rolle nicht mehr machen wollen, weil die haben ja wertvolles Wissen angesammelt über ihre Zeit in der Firma. Und wenn die raus durch die Tür gehen, dann hast du auch einen gehörigen Wissensverlust und Qualitätsverlust. Dann behalte ich die doch lieber in der Firma und die werden wieder IC. Also da haben alle was davon letzten Endes.",
            "start": 4811239,
            "end": 4860230,
            "confidence": 0.8346260162601625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich denke auch, dass man den möglichen Nachteil, dass das komisch auf dem eigenen Lebenslauf aussieht, so ein bisschen umschiffen kann, sofern man denn von Großkonzernen noch die Möglichkeit kriegt, sich im Interview zu beweisen. Denn ich denke immer, beziehungsweise habe ich die Erfahrung auch selbst gemacht, Sobald man immer eine Story parat hat, warum man diesen Wechsel gemacht hat und valide Gründe hat und valide Gründe sind auch, ich liebe die Technik einfach und ich bin anscheinend auch nicht so schlecht da drin und ich kann mich davon nicht lösen.",
            "start": 4860250,
            "end": 4888725,
            "confidence": 0.7908131868131871,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube es ist auch akzeptiert worden langsam, dass man das einfach ausprobieren muss und viele finden einfach raus und dass das nichts für sie ist. Und ganz viele würden es nicht machen, wenn sie den Schritt gar nicht zurück machen dürfen.",
            "start": 4888765,
            "end": 4901993,
            "confidence": 0.8176428571428571,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, ich hoffe, das ist inzwischen auch bei Tregema angekommen, wo Wolfgang Gruppe jetzt endlich abgedankt hat.",
            "start": 4902033,
            "end": 4907757,
            "confidence": 0.8512941176470586,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Was heißt endlich? Du zitierst ihn immer so gerne.",
            "start": 4908778,
            "end": 4910879,
            "confidence": 0.6937777777777777,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, aber ist er schon Hardliner in Bezug von 1960 Arbeitsregeln. Von daher, also ich glaube, wenn du mit ihm und dem Engineering Manager Pendulum sprichst, dann sagt er, bist du deppert?",
            "start": 4910919,
            "end": 4922627,
            "confidence": 0.72553125,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber zumindestens in der IT hoffen wir mal, dass es angekommen ist in irgendeiner Form.",
            "start": 4923207,
            "end": 4926790,
            "confidence": 0.6258666666666668,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und auf dem Arbeitsmarkt sieht es ja auch so aus, dass die Firmen sich die Leute im Moment nicht gerade aussuchen können. Die Verhandlungsmacht liegt eher bei den Arbeitnehmern, bei den Entwicklern. Von dem her dürfte das noch weniger ein Problem sein eigentlich.",
            "start": 4927593,
            "end": 4942680,
            "confidence": 0.8409534883720933,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Tom, vielen lieben Dank, dass du den weiten, weiten Weg in die schönste Stadt des Ruhrgebiets nach Duisburg auf dich genommen hast.",
            "start": 4942700,
            "end": 4950443,
            "confidence": 0.7328636363636363,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du beendest jetzt schon, weil dein Hund ständig im Hintergrund schon jaulen beginnt.",
            "start": 4950987,
            "end": 4955454,
            "confidence": 0.8036153846153847,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also genau, der hat sich zwischenzeitlich die Pfoten gelegt, der hat gerade mal eine Runde gejault und naja gut, dann nehmen wir den Podcast halt.",
            "start": 4955534,
            "end": 4962985,
            "confidence": 0.5574799999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also falls jemand die Hintergrundgeräusche hört.",
            "start": 4963025,
            "end": 4964968,
            "confidence": 0.5931666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich danke euch, hat sehr viel Spaß gemacht und ich habe den Weg gerne auf mich genommen. Und ja, bis zum nächsten Mal.",
            "start": 4965869,
            "end": 4972612,
            "confidence": 0.8517391304347824,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wir verlinken natürlich die Kontaktdaten auch in den Show Notes, falls wer mal First-Hand-Experience von Tom erfahren möchte. Ich glaube, wenn ihr ihm eine Nachricht schreibt, ich glaube so lieb ist er, dass er dann auch mal antwortet.",
            "start": 4972632,
            "end": 4985979,
            "confidence": 0.5897631578947368,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und sonst, dein Blog ist sehr zu empfehlen.",
            "start": 4986019,
            "end": 4988860,
            "confidence": 0.822875,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Auch wenn er langsam in die Jahre kommt.",
            "start": 4988900,
            "end": 4990901,
            "confidence": 0.76275,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, wir sind Evergreens. Kann man wirklich immer wieder lesen, gar keine Frage.",
            "start": 4991473,
            "end": 4995135,
            "confidence": 0.7549230769230769,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich sage immer wieder, einmal alle zwei Jahre ist auch regelmäßig.",
            "start": 4995155,
            "end": 4997455,
            "confidence": 0.8244545454545456,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Richtig, ja. Vielleicht sollte ich mich daran halten. Vielen Dank, Tom.",
            "start": 4998096,
            "end": 5004098,
            "confidence": 0.5604545454545454,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Tschüss.",
            "start": 5004618,
            "end": 5004938,
            "confidence": 0.37,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Danke euch. Danke, ciao.",
            "start": 5004958,
            "end": 5007900,
            "confidence": 0.41300000000000003,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und nicht vergessen, wer mal pendeln will oder sonst eine neue Herausforderung sucht in einem internationalen Team, schaut mal bei unserem Episodensponsor Eurowings digital vorbei. Link in den Show Notes.",
            "start": 5007940,
            "end": 5018324,
            "confidence": 0.8268333333333332,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.786716731405553,
    "audio_duration": 5018.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}