{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/7Z37qNazwy68zf4/download/ep113_brag_documents.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "speech_model": null,
    "id": "0b36d2e1-08f9-4284-9c71-aa73088e7058",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Und ich hatte in letzter Zeit auch ein Case, wo einer meiner Mitarbeiter eine Beförderung bekommen hat. Es ging von einem Senior Engineer auf Staff Engineer und das Breakdocument war es dann im Endeffekt. Das war der Kicker.",
            "start": 989,
            "end": 14334,
            "confidence": 0.7778684210526315,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das Problem ist halt ein menschliches Problem, dass wir nur eine gewisse Erinnerungsfähigkeit haben. Und diese lauten Persönlichkeiten, die halt jeden Tag irgendwas rausbusaunen, das bleibt dann halt eher vielleicht im Kopf hängen. Wenn dann eine Managerin entscheiden muss, wer wird befördert, wer bekommt ein Projekt, wer hat gute Arbeit gemacht oder einfach sich nur erinnert, was hat der Andi denn im letzten Monat so gemacht, dann bleibt halt genau das im Kopf, was da ständig rausbusaunt wurde.",
            "start": 16033,
            "end": 45027,
            "confidence": 0.8588461538461538,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Willkommen zu einer neuen Episode vom Engineering-Kiosk. Jeder kennt es. Du willst einen Bug im Code fixen, doch bevor du an der entsprechenden Stelle ankommst, fällst du über 5 weitere Fehler, die erstmal zur Seite geräumt werden müssen. Und dann da drüben, der Typo in der Readme. Und irgendwie fehlt der Build mit den Unit-Tests auch wieder. Okay, alles behoben. Weiter geht's mit dem eigentlichen Bug. All das nennt man Glue Work oder unsichtbare Arbeit. Denn jeder fragt sich nur noch, warum dauert der Bugfix einen eigentlich so lange? Und oft wird diese Arbeit nicht wertgeschätzt, weil sie eben nicht gesehen wird. Was hilft da? Kommunikation und brutales Marketing. Und darüber sprechen wir in dieser Episode. Wie macht man diese Arbeit sichtbar gegenüber seiner Vorgesetzten? Wie viel Kommunikation ist angebracht? Und ist das nicht eigentlich die Aufgabe des Managers, all das auf dem Schirm zu haben, so dass ich gar nicht kommunizieren muss? Das und noch viel mehr gibt es in dieser Episode. Viel.",
            "start": 49027,
            "end": 102013,
            "confidence": 0.8075426829268292,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Spaß! Andi, würdest du dich als laut oder leise bezeichnen?",
            "start": 104015,
            "end": 110581,
            "confidence": 0.7340000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Stimmtechnisch in der Regel spreche ich sehr laut. Wenn du eher vom Kommunikativen ausgehst in Bezug auf erhebe ich oft meine Stimme und bin ich oft präsent, denke ich, ich bin eher der lautere Typ.",
            "start": 111094,
            "end": 123559,
            "confidence": 0.7950285714285714,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kannst du es nachvollziehen, dass diese leisen Typen von Personen sich vielleicht hin und wieder mal beschweren, dass eigentlich immer nur die Lauten befördert werden und die Lauten immer das Ansehen bekommen und den Dank und alles was es so gibt rundherum?",
            "start": 123579,
            "end": 138325,
            "confidence": 0.8066904761904761,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Kann ich verstehen. Und ich denke, viele Laute, inklusive mir, sollten sich auch des Öfteren mal zurückhalten. Denn einer der größten Skills ist, einfach mal die Fresse zu halten und zuzuhören.",
            "start": 138725,
            "end": 149274,
            "confidence": 0.8358387096774194,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Diese Selbsterkenntnis, die werden wir jetzt aufschreiben. Die werd ich in Zukunft mal wieder vorspielen. Die werd ich als Einspieler, als Standard-Einspieler einfach immer mit reinnehmen.",
            "start": 149314,
            "end": 157521,
            "confidence": 0.6998076923076924,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist leichter gesagt als getan und ich glaube, ich hoffe, ich spreche für alle lauten Leute, die das genauso sehen und ich hoffe, ich bin damit nicht alleine, dass das wirklich gar nicht so einfach ist, sich zurückzunehmen. Aber, um die Perspektive mal zu wechseln, laute Leute exposen sich auch mehr. Das bedeutet, sie sind auch deutlich angreifbarer und sagen vielleicht auch öfter mal was, wo man einfach mal die Fresse halten sollte. das könnte natürlich dann auch zum schaden der eigenen reputation führen also es ist auch nicht immer positiv laut zu sein und präsent zu sein kannst du das nachvollziehen.",
            "start": 157941,
            "end": 192370,
            "confidence": 0.8692330097087375,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also für mich klingt so ein bisschen nach ausrede fast dass man sich da ja dass das nicht nur gute seiten hat ich kann es grundsätzlich nachvollziehen aber ich glaube es, hat in der Realität eigentlich wenig verbundene Downsides damit, wenn man lauter ist.",
            "start": 192410,
            "end": 206882,
            "confidence": 0.7564090909090911,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, im Endeffekt denke ich, laute Leute müssen damit leben, dass sie auch mal Gegenwehr bekommen. Und ich denke, sie sollten auch Gegenwehr bekommen. Denn wenn laute Leute immer nur Ja und Amen und immer nur gehört werden und alles ist tutti, dann ist da auch was falsch. Aber ich kann verstehen, warum laute Leute präsenter sind, beziehungsweise präsenter in den Köpfen anderer, das kann ich verstehen, als das, als die stille Person nebenan, die oft nur dabei ist.",
            "start": 207363,
            "end": 233020,
            "confidence": 0.8520886075949367,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Glaubst du, dass du nur an diese Position gekommen bist, wo du jetzt bist, weil du laut warst und darum immer befordert wurdest?",
            "start": 233353,
            "end": 239839,
            "confidence": 0.8316086956521739,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn ich immer befordert würde, wäre ich kein Engineering Manager, sondern irgendwie Director, Vice President, Senior Vice President oder ähnliches. Aber ich bin ja mal vom Director Level runtergegangen, weil das zu weit weg von der Technik war und ich da mehr Bock habe, meine Hände dreckig zu machen. Also ist die Antwort Nein, denke ich nicht.",
            "start": 239879,
            "end": 257414,
            "confidence": 0.809701754385965,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also du warst zu wenig laut quasi?",
            "start": 257454,
            "end": 259075,
            "confidence": 0.7431428571428571,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Auf dem Director-Level waren schon sehr viele laute Leute. Selbst für mein Loudness-Level, ist das ein Wort? Ich weiß es nicht, war das schon echt laut da. Da haben schon sehr viele Leute ihre Stimme erhoben, um ihre Stimme zu erheben.",
            "start": 260027,
            "end": 274050,
            "confidence": 0.7811219512195122,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt ist es ja so, dass gerade bei uns in unserer Bubble, in der Techie-Bubble, dieses ganze Marketing und das Lautsein und ich verkaufe mich und ich sag, was ich Tolles gemacht habe, ja eigentlich ... sehr, sehr unbeliebt ist, würde ich mal sagen. Und vor allem auch, wenn es dann Leute gibt, die das machen, eben die laut sind, dann sind die meistens nicht sehr beliebt, vor allem bei denen, die halt leiser sind, weil die einfach mehr Aufmerksamkeit bekommen. Jetzt ist halt die Frage, kann man trotzdem irgendwie was erreichen oder wie kann ich mich trotzdem durchschlagen durch diese Welt, wenn ich selber jetzt weniger laut bin, wenn wir mal bei dem Vote bleiben wollen?",
            "start": 274090,
            "end": 308987,
            "confidence": 0.8389401709401705,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube, du hast das böse Wort schon genannt, Marketing. Ich meine, das Marketing, was man draußen in der Welt findet, ist zu 60% Lüge. Also ich meine, wir schreiben auf Süßigkeiten zuckerfrei drauf, weil das laut Gesetz unter einem Schwellenwert von Zucker beinhaltet. Es ist aber nicht zuckerfrei. Das ist genauso wie alkoholfrei, hat immer noch Alkohol und wenn du in den Kasten alkoholfreies Bier trinkst, darfst du auch kein Auto mehr fahren.",
            "start": 309337,
            "end": 331795,
            "confidence": 0.7661216216216215,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das heißt, die lauten Leute erzählen nur Lügen. Das heißt, du hast dich gerade kategorisiert in laut. Das heißt, du lügst die ganze Zeit nur herum. Sei das richtig?",
            "start": 332485,
            "end": 339296,
            "confidence": 0.7735172413793103,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich sage nur, dass du das böse Wort Marketing verwendet hast und ich denke, dass aus diesem Grund auch das Wort Selbstmarketing negativ behaftet ist, weil wir es aus allen Industrien nicht anerkennen. Ich denke aber, einen gewissen prozentualen Anteil in Kommunikation über seine Arbeit zu stecken, dass man sagt, hey, ich habe was gemacht und das ist cool, schaut doch mal hier. Das halte ich schon für sinnvoll. Aber jetzt hast du die Frage gestellt, muss man dafür immer laut sein? Nein, muss man nicht. Aber ich denke auch, dass wenn man ein bisschen mehr in seine Kommunikation von seiner Arbeit investiert, dass man dann den Erfolg abhängiger von sich selbst macht.",
            "start": 339336,
            "end": 380124,
            "confidence": 0.8490619469026552,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube das Grundproblem ist ja, und ich will jetzt gar nicht sagen, dass die ganzen Manager und Managerinnen sich immer auf die Lauten fokussieren und dass die glauben was die alles erzählen, Aber ich glaube, das Problem ist halt ein menschliches Problem, dass wir nur eine gewisse Erinnerungsfähigkeit haben. Man erinnert sich halt nur an den kleinen Bruchteil. Und diese lauten Persönlichkeiten, die halt jeden Tag irgendwas rausbusaunen, das bleibt dann halt eher vielleicht im Kopf hängen. Und wenn es dann später um eine Entscheidung geht, wenn dann eine Managerin, eine Chefin entscheiden muss, wer wird befördert, wer bekommt ein Projekt, wer hat gute Arbeit gemacht oder einfach sich nur erinnert, was hat Person XY, was hat der Andi denn im letzten Monat so gemacht, dann bleibt halt genau das im Kopf, was da ständig rausposaunt wurde und vielleicht hundertmal irgendwo erwähnt wurde, man merkt sich halt 10% oder 5%, Aber man merkt sich dann immerhin noch diese 5% von diesen 100 Marketing-Messages, wenn man es mal so definieren will. Und eine andere Person, die halt leise ist und wenig kommuniziert, da sind es dann natürlich 5% von ganz wenig Nachrichten, Marketing-Messages. Und damit fällt man halt einfach aus diesem limitierten Memory im Kopf einfach hinten raus. Und das ist, glaube ich, das Grundproblem, was wir Menschen haben und was man halt in irgendeiner Form adressieren muss, wenn man sich trotzdem irgendwie durchsetzen will.",
            "start": 380164,
            "end": 469799,
            "confidence": 0.8285063829787235,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Erinnerung ist wirklich ein Problem und da stimme ich dir zu. Die klassische Testfrage, die ich immer stelle, was hattest du vor drei Tagen zum Abendessen?",
            "start": 469839,
            "end": 476921,
            "confidence": 0.8085769230769232,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Fleisch bei dir, das ist relativ einfach.",
            "start": 476981,
            "end": 478921,
            "confidence": 0.6164285714285713,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich habe dich ja gefragt.",
            "start": 478941,
            "end": 479702,
            "confidence": 0.6768,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ich kann mich wirklich noch mal daran erinnern. Drei Tage ist schon schwierig herauszufinden, was das für ein Wochentag war.",
            "start": 480082,
            "end": 484723,
            "confidence": 0.6012380952380951,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und jetzt erwartest du natürlich von deiner Vorgesetzten, dass die sich an deine Arbeit erinnert. Und Achtung, deine Vorgesetzte hat fünf- oder sechsmal den Wolfgang, ja?",
            "start": 485055,
            "end": 495478,
            "confidence": 0.8793076923076922,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Oder 20-mal womöglich.",
            "start": 495538,
            "end": 497218,
            "confidence": 0.548,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Oder 20-mal. Kurzum, Erinnerung ist ein Riesenproblem, das ist richtig. Aber du erwartest ja jetzt gerade von jemand anderem, dass sie sich an deine Arbeit erinnert. Aber du selbst schaffst es ja noch nichtmals, was du letzte Woche, letzten Monat, letztes Quartal, letztes halbe Jahr gemacht hast. Und jetzt kommt das worauf ich gerade hinaus wollte ist dass wenn du laut bist und laut heißt nicht mit einem megafon rumrennen sondern es kann auch in geschriebener art und weise sein oder oder oder in form von präsentation oder was weiß der geil nicht, dass du dich dann nicht nur abhängig von deiner vorgesetzten machst sondern, Vielleicht auch noch von anderen Leuten, weil wenn deine Vorgesetze sich nicht mehr dran erinnern können, dann können aber andere Leute sagen, hey, der Wolfgang, da war doch was, der hat doch so ein cooles Projekt gemacht. Und dann sagt deine Vorgesetzte, ah, stimmt ja. Und das meinte ich mit, dass die Lauten sich nicht nur abhängig von ihrer Vorgesetzten machen, sondern dass sie mehr ihren Erfolg in die eigene Hand nehmen, indem sie ihre Nachricht weiter und breiter verteilen.",
            "start": 497258,
            "end": 558970,
            "confidence": 0.8194702702702706,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber jetzt ist es ja genau so, dass die Leute, die das machen, denen wird mir oft die Prahlerei vor. Der prahlt da ständig, wie toll seine Projekte sind. Und man selbst denkt sich ja, ich bin ja kein Marketingmensch, ich bin ein Techie, ich will da ja nicht herumprahlen mit meiner Arbeit. Ist ja auch cool eigentlich, dass das Leute gar nicht so auf dem Trip sind. Aber was macht man dann?",
            "start": 559510,
            "end": 579043,
            "confidence": 0.8022191780821913,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es gibt ein ganz ganz ganz tollen Artikel von einem ich glaube er ist der Loper Advocate der nennt sich SWIX, den verlinken wir auch in den Shownotes. Der Artikel heißt How to create luck, also wie erstelle ich Glück. Und da spricht er eigentlich genau über das, was wir gerade sprechen. Dass du die Oberfläche zum Glück auffangen, durch die Kommunikation deiner Arbeit und das, was du machst, eigentlich erhöhst oder verbreiterst, indem du mehr über deine Arbeit und das, was du machst, kommunizierst.",
            "start": 580225,
            "end": 610738,
            "confidence": 0.8157764705882355,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also in einem Satz zusammengefasst, protokollier deine Arbeit und sprich darüber. Bring's nach außen. Aber wie macht man das, dass es keine Prallerei wird?",
            "start": 610778,
            "end": 619123,
            "confidence": 0.8312916666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hast du dich eigentlich schon mal gefragt, was man benötigt, um 40 Millionen Fluggäste abzufertigen? Natürlich ein Brack-Dokument. Ist doch logisch, oder? Aber unser Episodensponsor Eurowings Digital geht noch wesentlich weiter und baut auf eine moderne Tech-Kultur, die deine persönliche und professionelle Weiterentwicklung in den Vordergrund rückt. Eine offene und ehrliche Kommunikation im Team aus über 40 Nationen ermöglicht so eine gute und Startup-ähnliche Zusammenarbeit in einem Team von über 250 Personen. Mit den Technologien von Java, Kotlin und Swift über Vue.js bis hin zu Python, Scala und dem AEM, Adobe Experience Manager für alle, die es nicht wissen, werden so mehrere Millionen Unique User pro Monat bedient. Wenn auch du in einem Startup in einer soliden Finanzierung durch die Eurowings Mutter arbeiten möchtest, findest du alle Infos zu den offenen Positionen unter engineeringkios.dev slash Eurowings und für alle die zu faul zum tippen sind natürlich auch in den Journals. Und weiter geht's.",
            "start": 620564,
            "end": 678531,
            "confidence": 0.826078431372549,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also in einem Satz zusammengefasst, protokollier deine Arbeit und sprich darüber. Bring es nach außen. Aber wie macht man das, dass es keine Prallerei wird?",
            "start": 678571,
            "end": 686879,
            "confidence": 0.8015199999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also das Too-Long-Didn't-Read ist halt, übertreibt nicht, bleibt bei den Fakten, bleibt objektiv und das war's. Sag halt nicht, dass es zuckerfrei ist, wenn es Zucker enthält.",
            "start": 687254,
            "end": 696041,
            "confidence": 0.7792592592592592,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber warum muss ich denn das überhaupt als Entwickler, als Wolfgang jetzt machen? Ich hab da meine Git-Commits. Ein Manager wird wohl sehen, was ich da ständig mach. Du als Manager, Andi, du bist doch Manager. Du wirst es doch sehen.",
            "start": 696902,
            "end": 709271,
            "confidence": 0.7802439024390244,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du forderst mich ja grad auf, Lines of Code als dein Performance-Measurement zu nehmen.",
            "start": 709371,
            "end": 714275,
            "confidence": 0.7027142857142857,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, du kannst ja auch schauen, was ich gelöscht habe im Git. Ist ja auch eine Contribution.",
            "start": 714987,
            "end": 719692,
            "confidence": 0.7215882352941178,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, ja, trotzdem aber. Ist das ein guter Performance-Key-Indikator, deine Lines of Code? Edit und delete.",
            "start": 719752,
            "end": 725578,
            "confidence": 0.7137500000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Überprüfst du das eigentlich bei deinen Leuten?",
            "start": 725618,
            "end": 727260,
            "confidence": 0.7042857142857144,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ach, um Gottes Willen.",
            "start": 727620,
            "end": 728341,
            "confidence": 0.36675,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Okay, dann bin ich froh.",
            "start": 728842,
            "end": 729582,
            "confidence": 0.2604,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was man aber schon auch an Git-Pull-Requests überprüfen kann, und mit überprüfen hört sich schlimm an, sondern eher, um ein Gefühl dafür zu kriegen, wie viel Glue-Work macht diese Person eigentlich.",
            "start": 730495,
            "end": 744223,
            "confidence": 0.8254193548387094,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kannst du kurz Glue-Work erklären, was du darunter verstehst?",
            "start": 744243,
            "end": 746704,
            "confidence": 0.7097777777777777,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, Gluework ist all das, was eigentlich nicht so wirklich in einem Scope ist, aber was dir grad so ein bisschen auffällt. Ne Kollegin anblocken, nen Unit-Test fixen, der grad irgendwie fehlschlägt. Oder vielleicht kleines Support-Tooling bauen, damit wir im Team drei Stunden die Woche sparen können. Oder, oder, oder. All diese kleine Arbeit, die uns alle aufhält, um unsere eigentliche Arbeit zu machen. dependencies updaten weil wir dann einen back nicht mehr haben oder oder oder alles dieses man müsste mal oder vielleicht auch so ein bisschen diese fahrtfinder regel ich komme auf einen platz und ich sehe zu dass ich diesen platz besser verlasse als ich ihn betreten habe aber all diese all diese all diese glue work diese kleberarbeit die dafür da ist und ja vielleicht auch unsichtbar ist für viele leute und wenn man findest du findest.",
            "start": 746930,
            "end": 795324,
            "confidence": 0.8205744680851063,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du dir jetzt wichtig oder unwichtig Ah.",
            "start": 795344,
            "end": 797166,
            "confidence": 0.5688571428571428,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die ist essenziell, die muss da sein. Ich denke aber auch, dass diese Klebearbeit von jedem gemacht werden sollte und nicht immer nur von einer Person.",
            "start": 797186,
            "end": 804792,
            "confidence": 0.8623846153846154,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und sie steht halt nicht im GIT genau, diese Arbeit. Das ist das große Problem. Dass sie gemacht wurde, steht eben nicht in der GIT-History.",
            "start": 804852,
            "end": 813179,
            "confidence": 0.74292,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich denke, dass es öfter mal auch im GIT steht. So ist das nicht. Aber die meiste Arbeit ist halt dann keine Codeweit, genau.",
            "start": 813199,
            "end": 820985,
            "confidence": 0.8318750000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt sind wir schon wieder bei dem Punkt, dass das dann ja unsichtbare Arbeit ist. Also wenn sie nirgends steht oder nur in irgendeinem Kommentar am Rande steht, aber nicht einer Person zugeordnet ist, im Git, in der Git-History jetzt zum Beispiel, dann ist das schon wieder Arbeit, die nirgends protokolliert ist und die vielleicht auch keiner mitbekommt. Die Person selbst vielleicht, der mal geholfen hat, aber meine Managerin, mein Manager sieht es natürlich nicht. Und das ist natürlich dann schon ein Problem, wenn es wieder darum geht, um irgendwie eine Person zu bewerten oder auch wenn es Peer Reviews gibt. Man sieht natürlich nicht die gesamte Arbeit, die da irgendwo gemacht wird. Eine Person hat nie den gesamten Überblick, was denn eine andere Person macht. Und da muss man, glaube ich, ansetzen, dass man dieses Informationsproblem, das man da hat, löst. Und da geht es gar nicht um Marketing oder übertreiben oder prahlen, sondern einfach diese Information zu liefern an die Stellen, die sie benötigen. Man kann es wirklich eigentlich sehr sehr technisch sehen, wenn man will.",
            "start": 822001,
            "end": 876427,
            "confidence": 0.8262303370786521,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es gibt ja immer noch diesen Mythos, dass ein Softwareentwickler mit einem 40 Stunden Arbeitsalltag 40 Stunden Software schreibt. Ich glaube jeder, der schon mal ein paar Jahre in dem Beruf ist, weiß, dass dies leider leider leider nicht der Fall ist. Und Grund ist unter anderem, Zum Beispiel die Notwendigkeit von dieser unsichtbaren Arbeit, damit man überhaupt Teamarbeit ermöglichen kann. Ich helfe dir, das Development-Setup aufzusetzen. Ich meine, im Endeffekt hast du damit sehr wertvolle Arbeit gemacht. Du warst ein Multiplikator. Ich, Andi, habe dir, Wolfgang, geholfen, dass du ein Entwickler-Setup jetzt hast und jetzt auch entwickeln kannst. Also eigentlich habe ich durch meine Glue-Arbeit unsere Performance um 100 Prozent gesteigert. Weil du kannst ja jetzt auch coden.",
            "start": 876467,
            "end": 915067,
            "confidence": 0.7753529411764704,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber wenn wir jetzt zurückkommen zum Protokolliere, die Arbeit und Rede darüber, was würdest du empfehlen, eben genau diese Dinge zu kommunizieren? Wie würdest du das machen, dass du eben genau jetzt jemandem geholfen hast oder da irgendwas aufgelöst hast mit einer Glue Work?",
            "start": 915607,
            "end": 928835,
            "confidence": 0.8098636363636362,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt kommt wieder eines meiner Lieblingsthemen. Ich würde es aufschreiben. Ich würde mir einfach... Ach, was sage ich hier? Ich würde nicht... Ich mache das ja gerade sogar. Das ist ja genau das, was ich jeden Freitag mache. Jeden Freitag poppt bei mir ein Reminder auf. Füll mal dein Brack-Document. Und was ich da mache, ist relativ einfach. Ich habe ein Google-Doc. Da steht die Überschrift. im monat und darunter stehen bullet points was ich diese woche gemacht habe in bezug auf impactfull work da steht es nicht ich habe am meeting a teilgenommen ich habe im meeting b teilgenommen sondern ich habe fünf bewerbungsinterviews geführt also die ich sag mal großen highlights all das.",
            "start": 929585,
            "end": 965720,
            "confidence": 0.8027652173913044,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was man nicht sieht Und was machst du damit, Depp?",
            "start": 965740,
            "end": 968022,
            "confidence": 0.7036,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das sammle ich. Das sammle ich bis zur nächsten Performance Review. Das sammle ich bis zu meinem nächsten One-on-One. Das sammle ich für den nächsten Promotion Case. Also, wenn ich mich für eine Beförderung bewerbe oder Ähnliches. Damit ich auch Zahlen, Daten, Fakten, ZDF, ohne GEMA-Gebühren, vorliefern kann. Und ja, vielleicht auch Selbstmarketing ohne Bullshit. machen kann.",
            "start": 968042,
            "end": 994794,
            "confidence": 0.8567368421052631,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt hast du schon erwähnt, das ist ein Bragg-Dokument. Das ist auch wieder so etwas Typisches. Das kann, glaube ich, nur aus dem amerikanischen Raum kommen, weil wenn man das hier eins zu eins übersetzt, ist es ja Prahlerei und ein Prahlerei-Dokument. Du würdest es im Deutschen nie so nennen. Das funktioniert, glaube ich, nur in der amerikanischen Kultur. Und ich glaube, in der deutschen Kultur ist es ja eher eben sehr negativ angesehen, bei den Techies noch viel mehr. Und man wird es nie zum Prahlen verwenden oder das so nennen. Aber im Prinzip ist es ein Activity Log, wie es auch andere nennen, bei dir jetzt auch eher, oder? Du schreibst auf, was hast du gemacht in der Woche, einfach so, um dich nicht daran erinnern zu müssen, beziehungsweise das speichern zu müssen im Kopf und dann wahrscheinlich wieder vergessen.",
            "start": 994834,
            "end": 1037671,
            "confidence": 0.7718873239436616,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also ja und nein. Ich mach's so ein bisschen zweistufig. Ich mach's jede Woche, mach ich so ein Activity Log. Kannst dir vorstellen wie so ein Git Commit Log eigentlich. Einfach ein paar Bullet Points und es kostet mich wirklich nicht mehr als 10 Minuten. Am Freitag setze ich mich hin, mach einfach mal kurz meinen Kalender auf. Okay, womit habe ich meine Zeit verbracht? Erinnere mich. Okay, was habe ich die letzten 5 Tage gemacht? Und schreib da irgendwie die Highlevel-Punkte hin. Irgendwann kommt der Tag der Performance Review, der Feedback Cycles, des Peer Reviews, egal wie es bei euch in der Firma heißt. Ihr werdet in irgendeiner Art und Weise an irgendwas bewertet, ob ihr eure Ziele erreicht habt, ob es eine Gehaltserhöhung gibt, dass ihr Feedback von eurer Vorgesetzten bekommt oder oder oder. Zur Vorbereitung dessen, da transformiere ich meinen Activity-Log in ein Brack-Document. Und ich meine, was ist ein Brack-Document? Ein Brack-Document ist eigentlich nur ein geordnetes Activity-Log, wo ich meine Aktivitäten in Kategorien einsortiere. Wie zum Beispiel Collaboration und Mentorship. Ich habe dir geholfen, das Dev-Setup aufzubauen. Design und Documentation. Ich habe drei Design-Documents gebaut und die komplette Dokumentation über unser internes Kafka-Setup geschrieben company building ja ich habe eine kleine konferenz organisiert projekte an diesen projekten war ich beteiligt und das habe ich gemacht also eigentlich ich nehme meine meine activity lockpunkte und verschiebe sie in kategorien mehr.",
            "start": 1038412,
            "end": 1115401,
            "confidence": 0.7707179487179484,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ist es eigentlich nicht Ja, ich sehe das auch so mehrstufig. Also ich persönlich mache zum Beispiel Time Tracking rein für mich und auch als Selbstständiger braucht man es einfach teilweise zum Verrechnen, damit man weiß, wie viele Stunden hat man wirklich an einem Projekt gesessen. Das wäre so das Activity Log für mich, also was habe ich gemacht, was ich dann eben sogar sekundengenau quasi habe im Großen und Ganzen. Die nächste Stufe wäre dann so eine Zusammenfassung, wie du es jetzt nennst, im Breakdocument, in Kategorien. Das bezieht sich dann auch auf einen größeren Zeitraum. Also Activity Log ist vielleicht noch täglich oder wöchentlich und das Breakdocument ist dann vielleicht monatlich oder überhaupt jährlich. Und dann gibt es meiner Meinung nach noch eine dritte Stufe, dass es sogar noch mal zeitlich auf eine höhere Ebene kommt. Wenn ich dann nämlich zum Beispiel das Ganze in meinem Lebenslauf verwende, was habe ich denn für Projekte gemacht in meinem bisherigen Arbeitsleben? Was habe ich denn da erreicht? Dann kann ich da auch wieder das Aggregieren zu den wichtigsten Projekten, die ich gemacht habe und die ganzen Dinge auch in meinen Lebenslauf übernehmen. Also ich kann diese ganzen Informationen nicht nur für den aktuellen Job gebrauchen, sondern auch für die Zukunft, für den zukünftigen Job. Ich kann es auf mein LinkedIn-Profil packen. Ich kann vielleicht auch, wenn ich irgendwas Cooles erreicht habe, das dann verwenden, wenn ich einen Blogartikel schreibe oder wenn ich zu einer Konferenz gehe für irgendwelche Storys, die ich erzählen will, dann kann ich vielleicht über ein gewisses Projekt reden, dann hilft mir so ein Activity Log eben auch. Also umso mehr man da protokolliert, umso einfacher ist es dann natürlich, eben sich zu erinnern und diese Informationen zu verwerten, die man dann eben genau für so einen cooles Storytelling auf der Bühne eben auch verwenden kann und das einem auch selber hilft, man sich nicht daran erinnern muss. Also es ist nicht nur, um jetzt die Managerin zu überzeugen, befördert zu werden, sondern man kann es eben auch selber gut verwenden.",
            "start": 1115421,
            "end": 1222760,
            "confidence": 0.8047500000000005,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und einen wichtigen Punkt aber hast du da, glaube ich, ein bisschen übersprungen. Du sagst, man kann das auch in seinem Lebenslauf verwenden. Das ist ein unglaublich guter Punkt, aber ich denke schon, dass man da ein bisschen drauf achten muss, wer liest das dann am Ende. Besonders, es ist ja schon ein Unterschied, wenn meine Vorgesetzte das liest und das wirklich den kompletten internen Firmenkontext hat oder auf meinem Lebenslauf jemand Externes, der gar nicht in der Firma oder in den Projekten involviert war. Besonders im Lebenslauf oder ähnliches spielen natürlich Fakten eine Rolle. Was hat dieses Projekt für ein Business Impact gehabt? Also da muss man ja schon ein bisschen was von den Metrics verstehen und auch die mit reinrechnen.",
            "start": 1223305,
            "end": 1260555,
            "confidence": 0.8332213114754098,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube, dass das gar nicht unbedingt für Externe nur der Fall ist, auch intern. Wenn du ein Projektdokument hast in der Firma und das veröffentlichst in der Firma, dann musst du wahrscheinlich auch Kontext liefern. Weil vielleicht in einem Projekt, wenn das andere lesen, die auch in dem Projekt sind, die haben den Kontext. Aber sobald es ein bisschen außerhalb vom Team ist oder vielleicht sogar im Team, wenn es da Leute gibt, die an einem anderen Projekt arbeiten, dann musst du da schon den Kontext geben. Also dieser Kontext ist, glaube ich, auch im internen Umfeld durchaus wichtig, um das einfach besser zu verstehen und auch, ob das Sinn gemacht hat, was du da gearbeitet hast.",
            "start": 1261599,
            "end": 1295443,
            "confidence": 0.8082711864406781,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das hört sich aber so an, als ist dein Brack-Document company-wide public.",
            "start": 1295463,
            "end": 1299007,
            "confidence": 0.7376666666666667,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kann es natürlich sein. Also ich glaube, je nach Firmenkultur und wie sicher du dir bist, dass du das veröffentlichen willst, kannst du das, glaube ich, durchaus machen. Viele Firmen haben ja dann auch eigene Evaluation Frameworks und vielleicht Personal OKRs oder sowas. Das geht ja auch schwer in die Richtung. Und dafür kannst du es natürlich auch verwenden, aber da ist natürlich ein Filter dazwischen. Also ich würde jetzt nicht unbedingt meinen Activity Log public setzen, aber diese aggregierte Form von meinem Activity Log, was habe ich im letzten Monat erreicht, welchen Teams habe ich geholfen, was habe ich in den jeweiligen Projekten weitergebracht, wo habe ich vielleicht auch Clue-Work gemacht, wo habe ich irgendeinen Prozess verbessert und auch das Resultat, wenn man dann gemerkt hat, oh, wir sind jetzt 30 Prozent schneller beim Deployment, weil wir da irgendwas im Prozess geändert haben, dann kann man das natürlich sehr wohl da reinschreiben. Und wenn man das aggregiert, ist das meiner Meinung nach überhaupt kein Problem, wenn man das auch firmenweit public macht.",
            "start": 1300027,
            "end": 1351788,
            "confidence": 0.7723005780346824,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich wünschte, die Firmenkultur wäre überall so. Meine Erfahrung ist, es ist nicht so. Und deswegen würde ich sehr, sehr vorsichtig sein, auch mein aggregiertes Brack-Dokument zu teilen. Denn es geht nicht darum, Arbeit von anderen für sich zu claimen. Es geht aber darum, dass es manchmal auch zu politischen Dingen führen kann, dass jemand denkt, er hätte mehr in einem Projekt kontributiert, als es wirklich hat. Es kann, glaub ich, zu sehr vielen Stimmungsschwankungen kommen, wenn das komplett öffentlich ist. Deswegen, ich wünschte, jeder hat so eine Kultur. Aber es ist einfach nicht so, die Realität ist anders.",
            "start": 1352422,
            "end": 1391362,
            "confidence": 0.8376363636363641,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ihr habt ja eine sehr radikale Ansicht, die wird ja auch Gehälter gerne einfach gläsern, überall sehen. Weil meiner Meinung nach ist es genau der Hintergrund von dem Ganzen. Wenn ich mein Gehalt nicht rechtfertigen kann, dann ist irgendwas falsch.",
            "start": 1391402,
            "end": 1404653,
            "confidence": 0.8008500000000002,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist korrekt, aber du redest ja hier in einer Epcoters-Episode zum Thema Selbstmarketing und von lauten Leuten. Und es ging ja um die Frage, wie können leise Leute denn für ihre Arbeit gerade stehen und rechtfertigen und auch gefeiert werden und das bekommen, was sie verdienen. Und dazu gehört leider auch nun mal, stolz darauf zu sein, was ich getan hab, und sich sicher zu sein, dass das wert ist. Und dann ein Brack-Document, ich sag mal, im kleinen, psychologischen Safe-Space zu erstellen, Finde ich ist ein sehr guter Start, aber durch deine Schrei nach Transparenz, was ich auch befürworte, verstehe mich bitte nicht falsch, ist es halt, machst du es den leisen Leuten, die noch nicht so viel Erfahrung haben, natürlich auch unglaublich schwer und baust gegebenenfalls sogar Druck auf.",
            "start": 1405462,
            "end": 1448743,
            "confidence": 0.8426969696969694,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Schrei nach Transparenz, das sollten wir auf dem T-Shirt drucken.",
            "start": 1448763,
            "end": 1451745,
            "confidence": 0.6991999999999998,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "So wie Legacy verdient das Geld, Schrei nach Transparenz, also ich glaube die Anzahl der Sprüche wächst was.",
            "start": 1452546,
            "end": 1456728,
            "confidence": 0.6837222222222222,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber da stimme ich dir natürlich vollkommen zu, wenn man mal beginnt mit so einem Document, mit so einem Black-Document. Das ist übrigens, keine Ahnung, wer es genau erfunden hat, aber Julia Evans hat sehr früh einen Blogartikel darüber geschrieben oder hat zumindest diesen Term gecoint.",
            "start": 1457760,
            "end": 1471749,
            "confidence": 0.7554565217391304,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaub, sie ... Also, auch von Amerikanern hör ich immer wieder, dass sie das Thema zumindest im ersten Wurf so manifestiert hat. Also, ich sag nicht, dass Julia Evans den ... Sie hat es verbreitet, sagen wir's mal so. Das ist schon in der Industrie recht angenommen.",
            "start": 1471789,
            "end": 1489081,
            "confidence": 0.7737083333333333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Verlinken wir natürlich auch den Blogartikel. Und wenn man mit sowas beginnt, dann sollte man das natürlich, wie du sagst, im Safe Space mal veröffentlichen oder halt also im Team oder anfangs nur mit dem Manager unter Umständen. Teilst du das eigentlich mit deinem Manager?",
            "start": 1489101,
            "end": 1504440,
            "confidence": 0.8103999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ah ja, hundertprozentig, also mit deinem Vorgesetzten oder Vorgesetzten. Dieses Brack-Document, meines Erachtens nach, ist eigentlich nicht für dich. Dieses Brack-Document ist für die Person, die über deinen Erfolg in der Unternehmung entscheidet.",
            "start": 1504893,
            "end": 1519612,
            "confidence": 0.8123636363636363,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber hast du das jetzt proaktiv geteilt oder machst du ein reporting, wie funktioniert das?",
            "start": 1520112,
            "end": 1524975,
            "confidence": 0.6882666666666668,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich mache meinen Activity Log und irgendwann frage ich nach Feedback oder zwei, drei, vier Tage vor dem One-on-One drücke ich einfach auf Google Docs und dann Share und dann lade ich meine Vorgesetzte oder meine Vorgesetzten dazu ein oder Wenn ich weiß, in einem Monat stehen wieder Gehaltsverhandlungen an, dann teile ich das auch proaktiv, damit ich sicher gehen kann, dass ich fair behandelt werde. Damit ich sicher gehen kann, dass meine Managerin, mein Manager genau weiß, was ich getan habe. Damit ich sicher gehen kann, wo es eine Kursänderung gab und warum ich meine Projekte nicht erfüllt habe. wo ich was frühzeitig eskaliert habe und auf Hilfe gewartet habe, weil etwas seitwärts ging und nicht nach vorne und Co. Also, es ist für mich eine Art Sicherungsnetz. Und man nennt mich zwar Schisser, das ist mir vielleicht völlig egal. Ich denke einfach nur, ich packe hier Arbeit rein, 40 Stunden, und dann möchte ich auch, dass die sichtbar ist. Und ich kann hier nicht erwarten, dass meine Vorgesetzte, meine Vorgesetzte dieselbe Sichtbarkeit haben wie ich auf mein Leben, auf mein Arbeitsleben. Und deswegen, ja, dieses Black-Document ist primär für andere. grafiken von grafana rein mit screenshots und so weiter damit man sieht was für ein impact meine arbeit hatte und als.",
            "start": 1525015,
            "end": 1595138,
            "confidence": 0.8346572769953053,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Nächsten schritt meiner meinung nach kann man dann durchaus auch das zusätzlich noch man muss ja nicht wirklich das dokument scheren aber man kann dann zusätzlich auch informationen rausnehmen und die auf anderen kanälen spielen sei es jetzt auch in einem slack team channel Einfach zu sagen, diese Woche sind diese Key-Sachen basiert, muss man auch nicht direkt auf sich zuordnen, aber ist ja auch eine gewisse Kommunikation oder Selbstmarketing im weitesten Sinne natürlich, aber auch einfach Informationen für die anderen. Was ist weitergegangen bei dem Projekt? Was haben wir erreicht? Was habe ich gemacht diesbezüglich oder wir? Ganz wichtig, meiner Meinung nach, auch zu unterscheiden, vielleicht mal andere zu loben. Also ist es nur an mir gehangen oder waren da auch andere mit dabei? Weil sonst kann man da sehr schnell sehr unbeliebt werden, würde ich mal sagen, wenn man da immer ich, ich, ich schreibt. Also auch da an die anderen denken. Und vielleicht dann geht es auch so weit, dass man einfach gemeinsam irgendeinen Erfolg feiert und halt dementsprechend auch das Team herausgreift, Leute lobt. Und da schwimmt man ja dann selbst auch mit. Also wenn man das vorantreibt, ich glaube, das ist extrem wichtig, für eine gute Kultur und eine ganz einfache Form, wie man diese Dinge auch noch zusätzlich kommuniziert. Und da haben wir ja den Vorteil in der Tech-Welt, dass wir die richtigen Prozesse dafür haben. Weil wenn wir jetzt zum Beispiel in Scrum arbeiten und ein Stand-up haben, dann ist da ja schon das Format geschaffen, wo man solche Dinge teilen kann. Und es gibt ja nichts Schlimmeres als ein Stand-Up, wo jeder sagt, ich habe an Ticket X gearbeitet und am Vortag war es auch schon Ticket X und die ganze Woche sagt man, ja, ich habe an diesem Ticket gearbeitet und das ist es. Also man hat da die Möglichkeit, ein paar Zusatzinfos zu geben. Und ich glaube, das ist eine super einfache Möglichkeit, wenn man sich da im Vorfeld einfach zwei Sätze überlegt, kann man da schon sinnvolles Selbstmarketing betreiben. Und das hören die richtigen Leute, das hören genau die Leute, die es hören müssen. Da ist auch meistens die Managerin dabei, da sind Peers dabei und das ist eigentlich die einfachste Form, um diese Informationen mal weiterzubringen. Aber dazu brauche ich natürlich dieses Activity Log wieder, wo ich einfach nachschauen kann, was habe ich denn gestern gemacht, was habe ich die letzten zwei, drei Tage gemacht, je nachdem, wie oft die Stand-Ups sind, damit ich diese Informationen an der Hand habe und sofort eben auch teilen kann in meinem Slack-Channel oder in einem Stand-Up.",
            "start": 1595178,
            "end": 1728036,
            "confidence": 0.821110344827586,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Über seine Arbeit zu sprechen und die Kommunikation danach zu machen, das ist der große Unterschied einfach nur von Leuten, zu denen man vielleicht auch aufguckt. Meines Erachtens nach ist die Arbeit, die ihr ins Projekt gesteckt habt, das ist der harte Teil. Man hat 80, 90 Prozent der ganzen Sache durch. Man ist fertig. Bringt das nur in ein anderes kleines Format, teilt es im internen Slack. Wir zum Beispiel haben einen kleinen Channel, der nennt sich Product Announcements. Und da posten Leute immer so small wins oder das, was sie gerade geschickt haben rein.",
            "start": 1728397,
            "end": 1762298,
            "confidence": 0.8212604166666669,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und ich glaube, ganz wichtig ist da zu erwähnen, das heißt zwar Product Updates, das heißt aber nicht, dass nur die Product People dafür verantwortlich sind. Ich glaube, das ist ein großer Fehler zu glauben und das glauben viele, sondern es sind wirklich alle dafür verantwortlich.",
            "start": 1762338,
            "end": 1774545,
            "confidence": 0.8220434782608694,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und wenn man mal darüber nachdenkt, ihr müsst, in Anführungszeichen, nur noch ein bisschen kommunizieren. Den harten Teil, die etliche Monate Schweiß habt ihr da reingesteckt. Es gilt jetzt nur noch zu sagen, das haben wir gemacht, das war der Impact-Buff. Und oft verstehe ich das nicht, warum die das nicht machen. Wolfgang, erklär mir das mal bitte. Das schwierige Teil ist rum, du musst nur noch die zwei kleinen Schritte gehen. Also, ich sag jetzt nur noch, es ist hart, ich weiß, aber es gehört zum Prozess. Es ist Teil davon.",
            "start": 1775196,
            "end": 1808407,
            "confidence": 0.8062391304347827,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, was man halt sehr oft hört, ist zum Beispiel, da ist mein Manager verantwortlich. Der muss das ja mitbekommen. Und ich hab ja gute Arbeit geleistet. Das heißt, gute Arbeit spricht sich rum. Da brauch ich selber nichts mehr machen.",
            "start": 1808987,
            "end": 1821512,
            "confidence": 0.8168536585365858,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also, leider, ich wünschte, es wär anders. Ich wünschte, das wär wahr. Aber leider haben die Vorgesetzten sehr, sehr viel auf dem Schirm und da geht sehr viel durch. Auf der anderen Seite muss ich auch zugeben, der Manager ist nicht euer Babysitter oder Kindergärtner. Das bedeutet, er ist nicht da, um gefeiert zu werden oder um alles zu kommunizieren. Er mag zwar, du meinst, dass er.",
            "start": 1821552,
            "end": 1845071,
            "confidence": 0.830716417910448,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andere Leute feiert, nicht sich selber feiert.",
            "start": 1845111,
            "end": 1846632,
            "confidence": 0.4675714285714285,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Naja, also manche Manager sehen es halt schon so, okay, wenn mein Team gute Arbeit gemacht hat, dann habe ich gute Arbeit gemacht und deswegen feiere ich mich, ja. Also das gibt's ja halt leider auch. Aber ich denke eher... Ist ja auch.",
            "start": 1847174,
            "end": 1857288,
            "confidence": 0.7555813953488374,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Okay, dass es sich mitfeiert zumindest, aber es ist halt doch dann die Arbeit der anderen, ja.",
            "start": 1857368,
            "end": 1862575,
            "confidence": 0.6541764705882351,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, es ist die Arbeit der anderen, aber ich würde mir wünschen, dass in vielen Firmen der Manager nicht nur das einzige Sprachrohr des Teams ist, sondern dass die Leute halt eigenständig sind. Im besten Falle gibt es keinen Manager fürs Team. Im besten Falle ist das Team so erwachsen, dass der Manager gar nicht mehr benötigt wird.",
            "start": 1863115,
            "end": 1877389,
            "confidence": 0.8069137931034482,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also meiner Meinung nach sollte der Manager die Managerin schon auch darauf achten und das ist schon auch der Job von denen, dass die alle mitbekommen und Das ist halt deren Job und Aufgabe, genau zu evaluieren, was die Leute machen. Meiner Meinung nach kann sich der Manager nicht rausreden, nur weil mir nicht proaktiv ein Black-Document geliefert wird, brauch ich nicht beurteilen, warum die Leute in dem Team sind und was die machen. Ich glaub, das ist schon die Aufgabe von einem guten Engineering-Manager, sich darum zu kümmern.",
            "start": 1877429,
            "end": 1909877,
            "confidence": 0.8358651685393259,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Moment, ich rede darüber, dass der Manager die leute in abeln sollen und vielleicht auch unter die arme greift und hilft dass sie ihre arbeit selbst kommunizieren und nicht immer nur der manager weil aber.",
            "start": 1909937,
            "end": 1923995,
            "confidence": 0.8835142857142855,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wie viel wie viel manager von dir haben das gemacht mit dir ich wünschte mehr aber, Das ist, glaube ich, das Problem. Man erwartet sich das von den Managern und ich glaube, es ist auch deren Aufgabe, aber in der Realität ist es halt so, dass man nicht immer die besten Leute hat oder die denken an was anderes, die haben den Fokus woanders, vergessen es teilweise auch und ich glaube, da ist es halt dann wichtig, dass man es einfach selber in die Hand nimmt. Man kann sich nicht darauf verlassen, auch wenn es so sein sollte, aber am einfachsten ist einfach, wenn man es für sich selber macht, die Vorteile auch für sich selber nutzt und man kann dann auch noch den die Chefin entlasten, wenn man es positiv formulieren will oder ihre Aufgaben machen, aber dass man das von sich aus dann dementsprechend auch kommuniziert und weiterleitet. Und wie gesagt, es sind ja auch die Team-Kolleginnen im Team, andere Teams, die man auch informieren sollte und deren Aufgabe ist es natürlich sicher nicht, sich darum zu kümmern, was hat denn da Andi oder der Wolfi gerade gemacht in dem anderen Team.",
            "start": 1924015,
            "end": 1982586,
            "confidence": 0.8218762886597938,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Man muss aber auch sagen, was ich öfters mal mache, ist, ich formuliere Texte und mein Vorgesetzter postet die. Und der Hintergrund ist ganz einfach, dass ich diese Nachricht gerne kommunizieren wollen würde, aber durch das Posten meines Vorgesetzten hat die Nachricht mehr Gewicht als ich. Also ich würde mal fast sagen, ich würde mir wünschen, dass Manager es nicht posten müssten, aber je nach Nachricht und je nach Product Announcement etc., ist ja ab und zu auch mal vielleicht was Kritisches, kann das Posten durch eines Managers natürlich auch ein anderes Gewicht haben. Aber im Endeffekt steht für eure Arbeit ein und ich denke, Solange man bei den Fakten bleibt, beim Impact bleibt, die richtigen Metriken zur Hand hat, oder, oder, oder, dann kann man da auch ein bisschen braggen, ein bisschen prahlen. Weil, wenn man gute Arbeit gemacht hat, dann kann man da auch stolz drauf sein. Und wenn der Graph nach oben ging, oder der Exception Graph vom Neos auch nach unten, dann ist das leider ein richtig, richtig schöner Win. Und da könnt ihr stolz drauf sein. Deswegen. Für mehr Bragging. Nicht amerikanisches Bragging, alles ist awesome. Aber seid stolz auf das, was ihr geleistet habt, sofern ihr bei den Fakten bleibt.",
            "start": 1983062,
            "end": 2053574,
            "confidence": 0.7969174757281552,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Man kann es ja auch ganz deutsch formulieren, es ist nur Protokollieren der harten Arbeit. Es ist einfach nur ein Protokoll und es muss gar nicht eine Lüge sein, wie du auch das gerne nennst, das Marketing, sondern es geht einfach darum, zu kommunizieren, was man gemacht hat. Es muss keine Übertreibung sein und es muss auch keine Prahlerei in dem sein. Es reicht ja auch schon wirklich zu sagen, was gemacht wurde. Und was du schon richtig erwähnt hast, und da sind wir schon ein bisschen bei dem Punkt, wie man denn so Project Documents aufsetzt, ist, dass man eben nicht nur sagt, was man gemacht hat, sondern auch, was war das Ziel vom Projekt, also wie ist man dort hingekommen, was man gemacht hat, was war der Grund, warum man das gemacht hat und auch das Resultat, was du gesagt hast, wir sind besser geworden, wir haben da den Graphen, der nach oben gegangen ist. dass man einfach auch zeigt, das hat auch etwas bewirkt. Ich habe diese Glue-Work gemacht, ich habe unseren Prozess verbessert, ich habe unsere Deployment-Pipeline verbessert und wir sind jetzt super happy, weil wir jetzt schneller deployen können, weil wir schneller was ausprobieren können. Und davor war das wirklich ein harter Pain und das hat uns jetzt alle glücklicher gemacht im Team. Also diese Information, die da rundherum liegt, der Kontext, der ist einfach wichtig, dass man den auch in so ein Brack-Document mit reinnimmt. Weil eben, wenn jemand da von außen kommt, das liest, der denkt sich dann natürlich, warum hat er jetzt da irgendwas geändert in unserer Pipeline, in der Pipeline? War das überhaupt ein Problem? Warum hat man das gemacht? Hat sich da überhaupt was verändert? Oder war der nur super interessiert an der Technologie, die er da jetzt neu reingebracht hat? Und war die eigentlich für die Fisch? Oder war das wirklich etwas, was Sinn gemacht hat? Und das muss man halt auch da mit reinbringen. damit das externe Leute verstehen. Und dann ist man schon sehr nahe am Blockartikel, muss man sagen. Also noch ein Step mehr und man ist beim Blockartikel.",
            "start": 2053922,
            "end": 2156518,
            "confidence": 0.8328271954674216,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber ihr merkt schon eigentlich, das was der Wolfgang gerade gesagt hat, was war das Ziel von dem Projekt, warum war die Arbeit wichtig, was ist das Resultat. Ihr merkt schon, dass das eigentliche Brack-Document schon vor der Arbeit anfängt. Denn die Klarheit zu haben, welches Problem wir hier eigentlich lösen und warum wir dieses Projekt überhaupt machen, fängt halt ganz vorne beim Projekt Kickoff an und nicht erst später. Und das schützt euch auch so ein bisschen, wie soll man sagen, sich Projekten hinzugeben, die nur gemacht werden, weil man technisch verliebt ist. Ich habe auf Hacker News diese Datenbank gefunden, die muss jetzt mal in Produktion, weil ich Hype Driven Development mache oder ähnliches. Also es werden leider immer noch und ich schließe mich da nicht aus ich bin auch so einer ich mache viele dinge der technik wegen im endeffekt haben die aber produktmäßig oder businessmäßig oder zumindestens für das ziel auf das ich hinarbeite relativ wenig einfluss und Dann ist es natürlich ein bisschen schwierig. Also wovon rede ich hier? Denkt zwei, drei Minuten nach. Warum mache ich dieses Projekt? Und was hat das für einen Impact? Und nicht, ich habe die zyklomatische Komplexität dieser Methode von 10 auf 9 reduziert. Und die Methode wird einmal im Jahr geändert. Also das ist dann ein bisschen vielleicht technisch irrelevant oder beziehungsweise business irrelevant. Fokussiert euch auf das Wesentliche. Und wir reden hier die ganze Zeit immer nur von Resultaten, von objektiven Measurements. Das ist natürlich nicht immer möglich, weil wir einen kreativen Beruf haben. Ich hab technische Schulden reduziert, mag ein schöner Impact sein, aber ist auch irgendwie so eine Never-Ending-Story. Ich kann mich ja den ganzen Tag damit beschäftigen, technische Schulden zu reduzieren. Womöglich schaffe ich dann auch mehr technische Schulden, als ich reduziere. Aber es ist halt schwer messbar. Deswegen versucht halt irgendwie, ja, vielleicht auch eine kleine Story drumherum zu bauen, warum technische Schulden in dieser Komponente reduziert werden sollen.",
            "start": 2156558,
            "end": 2267821,
            "confidence": 0.8242208588957057,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das ist halt dann eine gewisse Arbeit und diese Arbeit wird bei klassischen Projekten, jetzt wenn ein Feature XY dazukommt, wird das meistens von Produktleuten übernommen, weil die bewerben dann auch dieses Feature, die sagen, wir haben eine tolle Arbeit gemacht. Also da kümmern sich die ganzen Product Owner darum. Aber wenn es dann auf die technischen Seite geht, Wenn ich irgendwo meine Code-Qualität verändert habe, wenn ich da irgendwo was an meinem internen Deployment-Prozess geändert habe, wenn ich unseren On-Call verbessert habe durch irgendeine Software, wenn ich irgendwo was refactored habe oder wenn ich irgendwo etwas fürs Team gemacht habe oder ein Team-Event organisiert habe, dann sind es Dinge, die nicht automatisch so leicht verkauft werden können. Und ich sage jetzt bewusst verkauft, weil wir da wieder beim Marketing sind. Aber sobald ich mir überlege, warum habe ich das eigentlich gemacht, Und was war das Resultat? Habe im Prinzip schon genau das, was normalerweise die Product-Leute bei den Features machen. Habe ich dasselbe auf der technischen Seite. Und dann ist es relativ easy, auch eben diese Glue-Work, diese sonst unsichtbare Arbeit, aber die extrem viel Zeit kostet und auch sehr wertvoll ist, dass man die auch dementsprechend protokolliert und dann auch wieder kommuniziert und den Mehrwert herausstreicht. Also das ist dann sehr schnell gemacht, wenn man sich diese Dinge einmal überlegt. Und die kann man ja auch im Team unter Umständen sich überlegen. Also man muss das ja nicht immer alleine machen und mit der Zeit wird man da dann auch besser, das dementsprechend unter Anfangszeichen zu verkaufen.",
            "start": 2268455,
            "end": 2351827,
            "confidence": 0.8247258687258691,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir sprechen jetzt hier schon 30, 40, 45 Minuten darüber, aber im Endeffekt, also mich kostet es 5 Minuten pro Woche meinen Activity Log zu befüllen, jeden Freitag poppt so ein kleiner Kalendertermin auf. Wenn es dann zur Performance-Review-Season oder ähnliches kommt, wo ich dann den zweiten Step mache, das Activity-Log in ein Brack-Dokument überführen, offengesprochen, das dauert schon eine Stunde oder zwei, so ist das nicht. Aber wir beschreiben das Thema gerade so hochkomplex. Natürlich fließt da viel Gedankenarbeit rein, aber im Endeffekt ist der, ich nenne mal, Stundensatz, den man dafür bekommt, sehr, sehr hoch, wenn das Resultat, das Activity-Log, das Brack-Dokument zu einer Gehaltserhöhung führt.",
            "start": 2351847,
            "end": 2392077,
            "confidence": 0.7858240740740743,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Von daher ...",
            "start": 2392117,
            "end": 2394565,
            "confidence": 0.7639999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "So, Marketing, BWL, du hast doch gar kein Wirtschaftsinformatikstudium besucht, Wolfgang. Aber du bist Freelancer. Meine Frage ist eigentlich, wir sprechen hier die ganze Zeit über ein Thema, was für dich als Freelancer ja eigentlich gar keine Relevanz hat. Wie sieht dein Brack-Dokument aus?",
            "start": 2394575,
            "end": 2407922,
            "confidence": 0.6687500000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ich muss ja dann irgendwie die Rechnung stellen am Ende. Also ich muss in die Rechnung reinschreiben, was ich gemacht habe. Da muss ich mindestens reinschreiben, an was ich gearbeitet habe oder welche Meetings ich gehabt habe. Also ich muss das eigentlich noch viel detaillierter beschreiben, um am Ende eine Rechnung stellen zu können, als wie jemand, der sowieso für die Arbeit immer bezahlt wird.",
            "start": 2408312,
            "end": 2424535,
            "confidence": 0.787560606060606,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist natürlich eine schöne Sache. Mein Brack Documents sind meine Rechnung. Aber über einen Vorteil von Brack Documents haben wir noch gar nicht gesprochen. Und zwar ist das nämlich, wenn wir jetzt mal bei WWL bleiben, der Zinseszins sozusagen. Und zwar, wenn man nämlich mehrere Brack-Documents über mehrere Jahre hat und da irgendwann mal wie in so einem Buch drin schmökert, dann kann man nämlich Muster erkennen. Dann kann man vielleicht auch mal sehen, oh, wie hab ich mich denn weiterentwickelt seit meinem ersten Brack-Document vor fünf Jahren. Und das kann ja auch über Arbeitgeber hinweg passieren. Ich meine, die BRAC-Documents, ist jetzt eine gute Frage. Kann man die über Arbeitgeber hinweg nutzen? Sind das Informationen, die in der Firma bleiben sollten? Also, hoffentlich habt ihr in dem BRAC-Document keine Namen drin, sondern immer nur drei Interviews oder Ähnliches, also keine Firmengeheimnisse. Dann könnt ihr die natürlich auch irgendwie mit nach Hause nehmen, gefühlt, oder per E-Mail versenden oder wo auch immer.",
            "start": 2424936,
            "end": 2483259,
            "confidence": 0.8212760736196317,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wo kein kläger da kein richter das.",
            "start": 2483519,
            "end": 2487222,
            "confidence": 0.39171428571428574,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hast du jetzt nicht gesagt seht halt zu dass da keine firmenintern drin sind so dass es jetzt nicht irgendwie als intellectual property gilt oder sowas aber dann kann man natürlich auch mal ein bisschen bisschen reflection machen man kann stolz sein man kann sagen wow ich habe mich in den letzten fünf jahren wirklich entwickelt man kann muster erkennen bin ich irgendwie dauerhaft im securitybereich unterwegs oder im bereich lokalisierung oder oder oder, Und diese Muster erkennt man gegebenenfalls nicht so direkt ohne Brack-Dokument, aber das ist natürlich auch immer wieder schön.",
            "start": 2487262,
            "end": 2516724,
            "confidence": 0.7990967741935483,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Es sind auch so Dinge wie, wenn du da zum Beispiel siehst, dass du extrem viel Glue-Work immer machst, dass du dich um Team-Events kümmerst, dass das deine Stärken sind, wenn sich das halt herausstellt, du machst da ganz viel in diesem Bereich, dann kannst du dir natürlich auch überlegen, bin ich im richtigen Job oder sollte ich vielleicht was anderes machen? Bin ich besser geeignet vielleicht auch für eine Team-Lead? Positionen, wo man viel mehr von diesem von dieser Glue-Work eigentlich machen muss. Also es können auch so Indikatoren sein, die einem selbst helfen, sich weiterzuentwickeln oder die eigenen Stärken herauszufinden. Und es gibt ja auch immer diese klassische Frage, wo sind deine Stärken und deine Schwächen bei Interviews, obwohl das natürlich Bullshit-Frage ist eigentlich. Aber da Da eignet sich sowas natürlich auch super gut, wenn man das einmal JettGPT zuwirft und sagt, filter mir da raus, was meine Kernkompetenzen sind, dann sollte das JettGPT eigentlich ganz gut hinbekommen und vielleicht kommt da am Ende was raus, was man selber gar nicht erwartet hat.",
            "start": 2516764,
            "end": 2569839,
            "confidence": 0.8103885714285717,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "In der Hoffnung, dass du deine Kernkompetenzen sehr oft im Brack-Document erwähnt hast, denn JettGPT rät ja auch mehr oder weniger die die Ergebnisse, ja, mehr oder weniger, weil deswegen ist JGPT mit Fakten leider nicht so gut und deswegen funktioniert es halt, JGPT und Mathe ist nicht so gut, deswegen hoffen wir mal, dass du deine Stärken sehr oft in deinem Bracket-Dokument erwähnt hast.",
            "start": 2569899,
            "end": 2590669,
            "confidence": 0.8204,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, aber ich glaube, genau darum geht's. Ihr erwähnt ja vielleicht, was ich mache. Und dann, ein LLM kann da extrem gut sein, im Rausextrahieren, was da dahintersteckt, weil das ja eine sprachliche Sache ist. Und genau das kann man dann mit diesen Project Documents eben auch machen. Wenn man sieht, dass man da gewisse Dinge macht, wie anderen Leuten weiterhelfen, Team-Events organisieren, Knowledge-Sharing, dass man dann vielleicht solche Kompetenzen hat, die eben sehr gut geeignet sind, auch in eine Lead-Rolle zu gehen. Wenn man eher auf der technischen Seite Sachen sieht, dann kann man sie vielleicht eher in die andere Richtung entwickeln.",
            "start": 2591493,
            "end": 2625969,
            "confidence": 0.8129320388349511,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "In der Hoffnung, dass dein Activity-Log mit Aktivitäten gefüllt ist, die du gerne machst und nicht, die du machst, weil es einer machen muss.",
            "start": 2626009,
            "end": 2631835,
            "confidence": 0.8149166666666666,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das stimmt natürlich. Also beurteilen muss man es ja immer noch selbst. Und man muss auch dazu sagen, shit in, shit out. Also wenn das Activity Log schlecht ist und schlecht gepflegt ist, dann wird auch der Output schlecht sein, den man da rausholen kann. Also auch da sind wir wieder, Activity Log möglichst sinnvoll aufschreiben und erfassen. Dann bekomme ich im Nachhinein auch mehr Daten raus. Und es ist ja mittlerweile gerade durch die LLMs jetzt auch eigentlich eine super Zeit, diese Dinge auszuwerten, weil früher hat man das ja nicht in irgendeiner strukturierten Form oder so gehabt. Man hat das in irgendein Dokument, in Plaintext, in einen Marktanfall geworfen. Und jetzt hat man aber die Möglichkeit, das wirklich sinnvoll auszuwerten, weil ja ich sagen kann, nehme mir diese 20 Dateien und probiere einfach mal, was rauszufinden. Also es ist extrem spannend, glaube ich, jetzt diese unstrukturierten Daten, wenn man das in der Vergangenheit schon gemacht hat, auch wirklich zu verwenden.",
            "start": 2632727,
            "end": 2681858,
            "confidence": 0.7923086419753084,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und passt ein bisschen auf mit der Granularität. Packt da jetzt nicht jeden Commit rein, sondern eigentlich nur so und so viele Interviews geführt, eine Schulung zu dem Bereich X übernommen. Also macht's relativ high-level, denn über ein Jahr oder ein halbes Jahr, wenn ihr das jede Woche ein paar Minuten macht, da kommt schon eine ganze Menge zusammen. Und im Endeffekt alle Bullet-Points, die da zusammenkommen, die müsst ihr am Ende des Jahres oder zur Performance-Season halt schon ... oder zum Feedback-Gespräch schon noch mal durchackern. Und dann könnt ihr es selbst nicht mehr lesen. Habt diesen Commit gemacht, habt diesen Commit gemacht. Ich packe da immer noch eine ganze Menge Links hin von Dokumenten, die ich geschrieben habe für Prozessänderungen oder ähnliches. Dann verlinke ich das Dokument noch oder wenn ich eine Präsentation vorbereitet habe. Das hilft dann schon nochmal, um wirklich dann auch bei den Fakten zu bleiben, aber werde nicht ganz granular, nicht ganz kleingeteiligt.",
            "start": 2682095,
            "end": 2729062,
            "confidence": 0.7435974842767297,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wobei ich persönlich bin schon ein Fan von täglichen Activity Logs, weil es einfach einfacher ist, auch sich zu erinnern, wenn man einfach jeden Tag ein, zwei, drei Zeilen hinschreibt, aber auch auf einem Abstraktionslevel, das eben verwertbar ist, nicht irgendeine Ticketnummer, sondern halt nur, hat man Development gemacht, ist man in Meetings gesessen, hat man anderen Teams geholfen, was für Projekte, einfach so auf ganz high Level, da was reinschreibt und dann kann man das auch relativ schnell wieder zusammenfassen. Und wie gesagt, LLMs fassen dir das heutzutage eh alles zusammen. Dann brauchst du das gar nicht mehr selber machen, kannst auch mehr Textinput haben. Aber jetzt haben wir schon gehört, wie die einfache Variante ist von dem Ganzen. Also schreibt es in irgendein Markdown-File. Ist das die beste Variante anzufangen? Gibt es irgendwie andere Formen? Gibt es Systeme dafür? Klar, es gibt für alle Systeme. Vermute ich mal eine App, eine Activity-Log-App oder was würdest du empfehlen?",
            "start": 2729102,
            "end": 2778896,
            "confidence": 0.7606729559748426,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also ich mach immer noch ein Google Doc, ja, also irgendwie ein Dokument, mach ein Pages-Dokument auf dem Mac oder ein Open-Office-Dokument auf und legt einfach los. Es gibt natürlich auch sowas wie bragdocs.com, das ist irgendein Service von irgendjemandem, der hat Text-Areas auf einer Webseite gepackt und hat ein Template rumgeschraubt, dann könnt ihr es da abspeichern. Es gibt ein Notion-Template, was ihr euch runterladen könnt, das verlinken wir auch in den Show Notes. Und der Blog-Post von Julia Ebens hat auch ein paar Hat auch ein Template, was ganz gut ist. Im Endeffekt, machen wir uns nichts vor, es ist ein Dokument, verkompliziert es nicht. Haltet es einfach, weil ihr müsst da kein komplettes System drum bauen, weil dann ist das ja wieder ein eigenes Projekt, was ihr wieder braggen müsst. Ihr wollt euch ja auf was anderes fokussieren. Textfile, Markdown, privates Githubreden, völlig egal.",
            "start": 2779495,
            "end": 2827193,
            "confidence": 0.745959183673469,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also ich hoffe ja, dass alle irgendwie so ein System haben, wo sie ihre Notizen, ihre Notes ablegen und die wird einfach mit diesem System starten, was es auch immer ist. Und wenn es das nicht gibt, einfach ein Markdown-File lokal in einem Folder, da kann man auch schnell dann ein Skript drüber laufen lassen, um irgendwas zu merchen oder zusammenfassen.",
            "start": 2827834,
            "end": 2844717,
            "confidence": 0.8043278688524589,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es reicht auch vielleicht eine Excel-Tabelle und dann habt ihr in Spalte A die Aktivität, in Spalte B eine Kategorie wie Interview, Dokumentation oder ähnliches. Und wenn ihr so kleinteilig werden wollt, dann könnt ihr sogar noch die Stundenanzahl dahinter schreiben und dann könnt ihr auswerten, hey, pass mal auf, ich hab 33% meiner Zeit in Dokumentation verbracht oder ähnliches. Also wenn ihr das machen wollt, ich mache es nicht. Ich habe einfach eine Überschrift, ein Monat und das Jahr und dann ein paar Bullet Points und ich mache das monatlich. Also ich dokumentiere das Activity Log zwar jede Woche, aber es sind Monatsblöcke und dann setze ich mich später einmal hin und mache das zwei Stunden in ein ordentliches Format. Das ist alles. Also verkompliziert das nicht.",
            "start": 2845327,
            "end": 2881882,
            "confidence": 0.736765625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also fünf Minuten Return on Investment, sehr, sehr viel. Können wir also nur jedem empfehlen. Sieht das richtig, Andi?",
            "start": 2882489,
            "end": 2888833,
            "confidence": 0.7115263157894736,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hundertprozentig. Und ich hatte in letzter Zeit auch ein Case, wo einer meiner Mitarbeiter eine Beförderung bekommen hat. Und als ich vor anderthalb Jahren angefangen habe, mit dieser Person zu arbeiten, habe ich diese Person gebeten, ein Brack-Document zu erstellen. Also eigentlich das, was wir hier gerade besprochen haben. Und als es dann so Richtung Beförderung ging, Richtung Promotion-Komitee, weil wir mussten dann auch vorweisen, warum soll die Person befördert werden, was hatte die Person für einen Impact und so weiter, von welches Level auf welches Level. Es ging von einem Senior-Engineer auf Staff-Engineer, also schon gar nicht so klein. Und das Brack-Dokument war es dann im Endeffekt. Das war der Kicker. Wir haben das Activity Log von den letzten anderthalb Jahren genommen. Ich hab ein paar Tipps gegeben, ich hab ein bisschen Guidance gegeben. Das Brack-Dokument wurde primär von der Person selbst erstellt. Ich hab das Format hier und da ein bisschen noch angepasst, damit es, ich sag mal, Management, Director und Executive-kompatibel war. Ein paar Informationen rausgestrichen, da, wo ich denke, die sind zu detailliert. Ein paar Informationen hinzugefügt, ein paar Nachfragen gestellt. Und dann ging das ins Komitee, und das Ergebnis war positiv. Also im Endeffekt ... hat ein Brack-Document die Beförderung eines meiner Teammitglieder gesichert, und ohne das Activity Log hätten wir bestimmt 50 Prozent vergessen.",
            "start": 2888853,
            "end": 2965625,
            "confidence": 0.8056545454545454,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Entweder vergessen, oder es wäre verdammt viel Aufwand gewesen, das wieder zu rekonstruieren, weil da musst du irgendwie in die Vergangenheit gehen und dir irgendwas ... Keine Ahnung, woher du's überhaupt siehst. Also, das ist ja so schnell mal dahergesagt. Ich hab das auch öfters erlebt in meiner Karriere, wo's dann so irgendwie geheißen hat, dieses Team ... Ist die Frage, sollen wir mit dem weitermachen? Wolfi, fass mal zusammen, was ihr so in den letzten Monaten oder so gemacht habt. Dann stehst du da und kannst dir die Informationen irgendwo holen. Wenn du das sauber schon in einem Black-Document mitprotokolliert hast, super easy. Einmal zusammenfassen, that's it.",
            "start": 2965685,
            "end": 2999092,
            "confidence": 0.7561296296296296,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und wenn du jetzt Team-Lead bist oder Tag-Lead, das ist ein super One-on-One-Thema. Sprech doch einfach mal mit deinen Peers drüber. Habt ihr sowas? Fangt sowas mal an. Und wenn wir schon an Return on Investment sprechen, also ist es das wert? Wie gesagt, die Person ist jetzt Staff-Engineer, vom Senior-Level ins Staff-Engineer-Level gekommen. Karrieretechnisch war das ein sehr, sehr guter Return-On-Investment, jetzt nicht nur wegen den Gehaltsbändern und ähnliches, sondern auch in Zukunft, wenn die Person den Arbeitgeber wechselt. Denn oft bleibt man auf dem Level und seltenst gibt es ein Down-Leveling zurück zum Senior-Engineer. Denn wie wir auch schon mal in der anderen Episode, die wir auch in den Show-Notes verlinken, festgestellt haben, die Aktivitäten eines Staff-Engineers sind deutlich anders als die eines Senior-Engineers.",
            "start": 2999427,
            "end": 3045737,
            "confidence": 0.7895555555555558,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und diese Frage, was hast du denn in letzter Zeit so gemacht oder in deinem Leben so gemacht, die bekommt man halt sehr oft. Die bekommt man bei einer Beförderung, die bekommt man, wenn man eine neue Firma sucht, einen neuen Arbeitgeber, einen neuen Job, auch einen internen Wechsel in der Firma. Diese Frage wird man immer bekommen. Also umso besser man das pflegt, umso mehr kann man dann da rausziehen. Und ich pflege auch so eine Projektliste für mich, einfach um zu wissen, was ich denn so gemacht habe an Technologien. Ist hin und wieder auch einfach nett, darin zu schmökern, wie der Andi das gemeint hat, wenn man mal sieht, was vor 20 Jahren für Technologien irgendwie in waren und was man da dann so für Blödsinn eigentlich gemacht hat.",
            "start": 3046403,
            "end": 3081168,
            "confidence": 0.7832954545454547,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und das Lustige, so ein Brack-Dokument kann perfekt sein, um sich auf Interviews vorzubereiten. Denn das, was der Wolfgang gerade gesagt hat, zu wissen, was man getan hat, ist key. Und da geht's nicht nur darum, es wirklich zu wissen, sondern es auch parat zu haben. Die Souveränität bei der Kommunikation in Interviews ist einer der key Faktoren, die in die Evaluierung deiner Skills einfließt. Wenn du da erst sitzt, zehn Minuten überlegen musst und dann so ein bisschen rumstammelst, ach ja, und dann war das das, dann klingt das eher so, als hättet ihr ungeordnete Gedanken. Wenn du aber direkt loslegst, mit Klarheit und Präzision auch antwortest, dann kommt das ganz anders rüber in dem Interview, als wenn ihr euch da offengesprochen einzurechtstammelt. Also, die paar Minuten investiert, denke ich, karrieretechnisch eins der besten Aktivitäten, die ihr tun könnt. Wolfgang, für heute schreiben wir dann in unser Brack-Dokument neue Podcast-Episode aufgenommen?",
            "start": 3081208,
            "end": 3134731,
            "confidence": 0.800625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Mit einem Impact, dass wir hunderttausende Leute dazu gebracht haben, dass sie ein besseres Arbeitsleben führen, genau.",
            "start": 3134751,
            "end": 3141925,
            "confidence": 0.8311176470588236,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Dann würde ich sagen, haben wir unseren Arbeitsauftrag, sei ein Multiplikator, doch wieder erfüllt. Und wenn ihr denkt, andere Leute sollten damit auch mal anfangen, habt ihr jetzt hier die Möglichkeit. Schnappt euch einfach diese Podcast-Episode, schmeißt sie in euer WhatsApp, Signal, Telegram, Facebook, TikTok, Slack, Microsoft Teams oder wo auch immer und sagt, hey, pass mal auf, was hältst du davon, sollen wir das mal machen. Und wenn du denkst, du brauchst doch noch ein bisschen Support, Dann nimm die Podcast Episode, schmeiß es an deine Managerin und an deinen Manager und sag, hör dir das mal an, damit möchte ich im nächsten 101 mit dir drüber sprechen.",
            "start": 3142220,
            "end": 3177852,
            "confidence": 0.7244954128440372,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und wer ganz passiv Multiplicator sein will, ihr könnt auch einfach unsere Episode bewerten auf Spotify, Apple. Da wirft ihr einfach mal den Algorithmus so ein Stück Fleisch hin und der kann das dann weiter bearbeiten. Also man kann auch passiv Multiplicator sein.",
            "start": 3178147,
            "end": 3191911,
            "confidence": 0.802906976744186,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Falls ihr noch weitere Fragen zum Bragg-Dokument habt, Wolfgang und ich und auch ganz viele andere, vor denen ich weiß, die machen auch Bragg-Dokuments, sind in unserer Discord-Community. Schaut da einfach mal rein, stellt die Frage und wir sind dann auch da. Ansonsten wünschen wir euch viel Erfolg beim Braggen.",
            "start": 3191951,
            "end": 3207715,
            "confidence": 0.7795800000000003,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das hättest du jetzt nicht dazu sagen sollen, dass wir auch dort sind in der Community. Kommt ja niemand.",
            "start": 3208232,
            "end": 3211994,
            "confidence": 0.721,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ansonsten wünsche ich euch viel Spaß beim Braggen.",
            "start": 3212615,
            "end": 3215276,
            "confidence": 0.6906249999999998,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Bis bald. Bye bye. Ciao. Und nicht vergessen, wenn du einmal Bragg-Documents in einem modernen, offenen und internationalen Umfeld ausprobieren willst, dann schau bei Eurowings digital vorbei. Link findest du in den Shownotes.",
            "start": 3215296,
            "end": 3230245,
            "confidence": 0.7812424242424242,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.801739777709797,
    "audio_duration": 3232.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}