{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/EPmSPtRZbQ9Z2cp/download/ep114_sales_engineering.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "speech_model": null,
    "id": "e6bc04ac-a5dd-4533-940a-55e9fdb53588",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Also ich weiß noch, wie ich in die Rolle gekommen bin. Da hat mich ein Sales-Kollege gefragt, ob ich Sales-Engineer werden will. Da hab ich gesagt, na ja, um Himmels Willen, nie im Leben. Ein halbes Jahr später wollte ich die Rolle wechseln. Ich wollte Integration Architect woanders werden. Und so nach einem Job und dann fragt eine Rekruterin, ob ich nicht Sales-Engineer werden will. Ich so, keine Ahnung, was ist das? Was macht man da? Und irgendwie, ja, nicht so richtig. Er hat gesagt, ja, okay, wir suchen eh erfahrene Leute, also erfahrene Profis suchen wir eigentlich. Ich so, was? Stopp. Ich bin ein erfahrener Profi, also was genau muss ich jetzt machen? Und dann war ich bei MuseSoft auf einmal Sales Engineer und war in dieser Rolle als Techniker und im Sales. Und so, ich bin ins kalte Wasser letztendlich gesprungen, ohne genau zu wissen, was die Rolle bedeutet.",
            "start": 2020,
            "end": 43159,
            "confidence": 0.679430463576159,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Im Software Engineering gibt es viele Vorurteile gegen die Sales-Funktion. Doch wenn wir uns mal ehrlich sind, die Sales-Abteilung bringt die Kunden, die wiederum das Geld in die Firma bringen. Kurzum, durch die Sales-Arbeit haben wir alle einen Job. Und wenn wir das mal weiterdenken, Was wäre denn, wenn wir mit unserem Engineering-Know-How an diesem Hebel etwas bewirken können? Genau darum geht es in der Funktion des Sales Engineers. In dieser Episode sprechen wir mit Patrick Bissang, dem Social Sales Engineer, und bringen etwas Licht ins Dunkle. Was ist denn Sales Engineering? Sind dies zwei Jobs in einer Person? Wie technisch muss ein Sales Engineer eigentlich sein? Und wie sieht denn überhaupt so ein Sales-Prozess in der Tech-Welt aus? Welche Firmen brauchen denn so eine Rolle und welche Skills sind gefragt für diese Rolle? Starten wir direkt los ins Interview mit Patrick.",
            "start": 48235,
            "end": 98609,
            "confidence": 0.8407253521126754,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Viel Spaß!",
            "start": 98629,
            "end": 99030,
            "confidence": 0.7515000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Vor einigen Monaten haben wir eine Podcast-Episode mit Martin Donath aufgenommen. Martin hat es geschafft mit Open Source seinen Lebensunterhalt zu verdienen und er hat unter anderem mal eine User-Umfrage gemacht und dabei hat er festgestellt, dass es einen Job gibt, den er noch gar nicht kennt und zwar den Technical Writer. Warum erzähle ich euch das? Vor kurzem war ich auf der Suche nach Sales-Content. Und zwar wollte ich mich im Bereich Sales ein bisschen weiterbilden. Und was ich dann immer in der Regel mache ist, ich google Sales for Engineering. Irgendwie jemanden, der mir den Job des Sales-Menschen aus einer Perspektive eines Software-Engineers erklärt. Weil ich denke, ich komme aus der Ecke und verstehe es dann besser. Und weil ich denke, dann wird ziemlich viel Blabla einfach weggenommen. Und dann habe ich so gegoogelt und dann bin ich auch auf einen neuen Job gestoßen, den ich noch nicht kannte und zwar auf den Job des sogenannten Sales Engineers. Ich hatte ganz viele Fragezeichen im Kopf, aber in der zweiten Google-Suche kam dann ein Name immer mal wieder auf und auch kurze Zeit später poppte der immer und immer und immer wieder bei mir auf LinkedIn auf und zwar ist das Patrick Pissang. Und Patrick Pissang ist der Social Sales Engineer und Weil ich ganz viele Fragen habe, haben wir uns diesmal Patrick Pissang in den Podcast eingeladen. Deswegen, hallo Patrick.",
            "start": 106798,
            "end": 181612,
            "confidence": 0.8131465517241382,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Hallo Andi, hallo Wolfgang.",
            "start": 181652,
            "end": 183173,
            "confidence": 0.46799999999999997,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Lass mich mal ganz kurz ein paar Worte über dich verlieren. Und zwar, du lebst im Allgäu, du hast ein Informatikstudium an der TU München abgeschlossen mit einem Nebenfach Theoretische Medizin.",
            "start": 183193,
            "end": 194701,
            "confidence": 0.822709677419355,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Oh, wo hast du das denn ausgegraben? Wahnsinn.",
            "start": 195421,
            "end": 197983,
            "confidence": 0.39799999999999996,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube, von deiner Amazon-Biografie. Du bist seit über 16 Jahren in der Tech-Industrie unterwegs. Und zwar hast du bei IBM, bei MuleSoft und nach später auch ganz kurze Zeit bei Salesforce gearbeitet. Und zwar immer nur in Rollen, die, ich würde fast sagen, einen hohen Anteil an Kommunikation haben. Zum Beispiel als Senior Integration Architect oder als Principal Solutions Consultant. Du bist mehrfacher Buchautor, dreimal über dein Lieblingsthema Sales Engineering und einmal im Sci-Fi Bereich über ein Buch, was nur für ITler und Fans der griechischen Mythologie ist. Ich hatte sehr viel Spaß, das Abstract zu lesen.",
            "start": 198683,
            "end": 236471,
            "confidence": 0.8296020408163267,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Moment, du hast nicht das gesamte Buch gelesen, Andi. Ich hab noch nicht das ganze Buch gelesen.",
            "start": 236511,
            "end": 240532,
            "confidence": 0.5593529411764706,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du bist seit knapp sechs Jahren selbstständig, und zwar im Bereich Coaching für B2B-Sales-Engineering-Teams und natürlich auch für individuelle Sales-Engineers und bietest dort auch im Bereich Training an. Und du hast eine Sales-Engineering-Map gemacht, die die Welt vom Sales-Engineering mit dem Mittel einer Herr-der-Ringe-Karte vermittelt. Was ist das?",
            "start": 243971,
            "end": 269413,
            "confidence": 0.8546041666666665,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also, danke für die Einführung. Das klingt echt gut. Ich halt's mal in die Kamera. Ich mach auch so was. Was du da gesehen hast, ist mein erstes Fantasy-Buch mit meinem Clannamen. Aber ich schreib mittlerweile seit fünf Jahren Romane. Also, Lit-RPG ist das. Kennst du das? Wer Gamer ist, muss Lit-RPG kennen. Lit-RPG ist im Prinzip Rollenspiel im Buch. Also, ganz normaler Fantasy-Roman. Aber du hast die Stats hier drin. Du hast im Prinzip ein Hardcore-Magie-System. Du hast hier starke Lebensenergie und auch von den Gegnern, man wird gewürfelt. oder es werden Proben gerollt, ja. Und deswegen habe ich auch die Map für Sales Engineering, weil ich habe den Sohn des Org-Shamans, so heißt es. Ich schreibe unter Lev Marshall, das ist mein Name. Da habe ich eine Map gemacht, also die Karte zu dem Buch im Prinzip, zu der Story. Und im selben Moment habe ich mir Gedanken darüber gemacht, weil was ist passiert? Anfang Corona, ganz extrem sind auf einmal Softwarelösungen hochgeschossen im Bereich Sales Engineering. Das gab es vorher nicht. Also Sales Engineering ist der beste Job der Welt, den keiner kennt. Das ist so ein bisschen seltsam, der Term, und da ist immer mehr passiert, und ich hatte es auf einer Slide, ich wollte ein Webinar machen, und dann dachte ich, das ist so langweilig, es war alles so im Kreis angeordnet, nebenbei hatte ich das Buch, und dann dachte ich so, hm. Ich mache eh gerade die Karte für das Buch, also mache ich das für Sales Engineering. Und dann habe ich angefangen, die Applikationen da draufzubauen, da habe ich so Bereiche gemacht, so irgendwie, ich weiß jetzt gar nicht richtig ein, aber für AFPs so Bereiche und dann High Peaks of AFP und so, dann habe ich das halt so benannt. Und das kam extrem gut an und dann fast zwei Jahre lang, jeden Monat eine neue Version rausgebracht. Weil neue Communities entstanden sind, neue Applikationen entstanden sind. Ich hab da einen Buchautor mit reingenommen. Gibt's auch einige, also nicht so viele, aber es gibt schon ein paar im Sales Engineering. Trainings, Communities, Podcasts, ja. Und so ist das gewachsen.",
            "start": 269913,
            "end": 380490,
            "confidence": 0.6865966386554622,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber kann man sich das so vorstellen, weil du sagtest gerade, im Buch werden irgendwie so Punkte zahlen und so. Stärken und so weiter beschrieben. Kann man sich so ähnlich vorstellen wie dieses Warhammer, was man da auf dem Brett spielt?",
            "start": 380530,
            "end": 390540,
            "confidence": 0.8043658536585365,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du kannst es dir vorstellen wie World of Warcraft, wo du die Konsolen oder Terminal-Ausgaben hast. Ihr habt ja Linux oder Terminal Clients. Du siehst im Prinzip das Terminal. Und im Buch kann man sich ... Ich kann mich als Autor austoben, weil ich dann halt ... Ich kann ... keine Ahnung, Konsolenausgaben, Exceptions, Codeteile. So was sieht man dann halt, und es ist alles Teil der Story. Der Aufsetzer von der Story geht um Lena, sie ist ein NSC. Sie wird als NSC in den Spielen geführt. Ein NSC hat keinen Lockout-Button. Jetzt muss sie versuchen, das Spiel zu hacken, obwohl sie kein Gamer ist. Sie versucht, dann Exploits zu finden, rauszukommen. Das heißt, mal andere Spieler killen. Die versuchen, den Support zu erreichen. Das ist extrem spannendes Genre.",
            "start": 390620,
            "end": 431867,
            "confidence": 0.6898076923076926,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Schon ein bisschen nerdy, oder?",
            "start": 431887,
            "end": 432707,
            "confidence": 0.24219999999999997,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die kurze Antwort ist oh ja.",
            "start": 436007,
            "end": 437728,
            "confidence": 0.5603333333333332,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Lass uns mal ins Thema Sales und Sales Engineering einsteigen und zwar. Open Source, Open Source, freie Software, freie Software.",
            "start": 437748,
            "end": 454717,
            "confidence": 0.7703,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Danke Andi für die Einleitung. Aber es ist wieder soweit. Unser Episodensponsor bietet 50.000 Euro Förderung über das Media Tech Lab Programm für dein Open Source Projekt. Arbeite dabei sechs Monate alleine fulltime oder zu zweit im Team in Teilzeit an deiner Projektidee für die Medienbranche. Ich habe das selber schon gemacht und habe mit der Förderung einer Analytics-Software im Podcast-Bereich umgesetzt. Und es war wirklich genial. Coole Leute zum Austauschen und ein gutes Netzwerk in die Medienwelt, damit das Projekt auch schon die erste Anwendung findet und dann auch wirklich eingesetzt wird. Und das Themenfeld für die Projekte ist super breit. Alles was die Medienbranche weiterbringt, egal ob AI, UI oder Infrastrukturthemen. Alles ist möglich. Reiche einfach deine Idee bis zum 31. März ein. Eine kurze Projektbeschreibung reicht und wir sprechen wirklich von kurz, keinen Achtseiter. Und den Link zum Einreicheformular und natürlich auch mehr Informationen zu Media Lab Bayern und deren Förderprogrammen findest du in den Shownotes oder einfach unter dem Link engineeringkiosk.dev slash medialab. Und jetzt geht's zurück zum Sales Engineering.",
            "start": 454757,
            "end": 521038,
            "confidence": 0.8526034482758617,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Immer wenn ich das Wort Sales höre, kriege ich so ein bisschen so die Nackenhaare stellen sich auf, aber im negativen Sinne, weil irgendwie hat dieses Wort ja schon sehr viele Vorurteile und zwar ist meine, ich sag mal ein bisschen überspitzte Erfahrung, immer wenn ich dann mit irgendwelchen Sales Leuten spreche, die reden sehr viel, sagen aber nicht sehr viel. So, das ist die eine Baustelle. Also ich krieg halt ziemlich viel Fluff mit. Und die beschreiben das immer im, ich sag mal, so High-Level-Term, dass ich sag, okay, aber was ist denn jetzt? Lass uns doch mal Tacheles reden. Wie funktioniert das denn? Was kostet das denn jetzt? Und ich will jetzt einfach die Fakten. So wie der klassische Ingenieur, das ist schneller, aha, interessiert mich nicht, mach mal einen Benchmark. Sondern wo sind jetzt die Daten, die Fakten? Das ist die eine Geschichte und die andere Geschichte, weil da so viel Füllwörter reinkommen, weil da so viel gesagt wird, ohne viel zu sagen. Und wenn man dann auch noch ein bisschen die Art und Weise der Kompensation, also wie viele Leute im Sales Geld verdienen, im Hinterkopf hat, dann hat das immer so einen Fadenbeigeschmack, denn auf Basis von Provision, Verkaufen. Und da stellt man sich immer die Frage, wollen die mein Bestes? Lösen die wirklich mein Problem?",
            "start": 522398,
            "end": 592700,
            "confidence": 0.7761357466063346,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das sind so die Vorurteile, die ich.",
            "start": 592740,
            "end": 594121,
            "confidence": 0.6122857142857143,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Immer so im Kopf habe, wenn ich von Sales rede. Und deswegen habe ich auch so eine kleine Abneigung zu Versicherungsvertretern. Weil die poppen immer so wie Pilze aus dem Boden. Meine Frage an dich ist, kannst du das verstehen? Und wie oft wirst du mit solchen Vorurteilen konfrontiert?",
            "start": 594141,
            "end": 608708,
            "confidence": 0.7604285714285715,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich verstehe das total. War meine dunkle Seite der Macht genauso. Ich war Integration-Architekt, ich war Produktmanager. Ja, hatte wenig mit Kunden in dem Sinne zu tun, also tief und langfristig. Vor allem hat der Sales immer Sachen verkauft, die gar nicht zum Produkt gepasst haben. Also meine Metapher ist der Baustellenzugang. Also wir hatten, ich weiß noch, wir hatten eine Lieferantenmanagementsoftware, die letztendlich bei einem großen deutschen Energieprovider dann als Zugangssoftware genutzt wurde zu den Baustellen. Absurd, abstrus, aber es wurde verkauft. funktioniert also ich verstehe das total dass der sales so gesehen wird ja aber ich habe meine meinung auch ändern dürfen.",
            "start": 608748,
            "end": 649792,
            "confidence": 0.7787211538461538,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also ich ich meine du bist hier um uns vom gegenteil zu überzeugen ich.",
            "start": 649832,
            "end": 653015,
            "confidence": 0.7471428571428572,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Glaube das geht nicht.",
            "start": 653035,
            "end": 653655,
            "confidence": 0.85275,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Warum glaubst du das geht nicht überzeugen.",
            "start": 656257,
            "end": 658139,
            "confidence": 0.6458571428571428,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Müsst ihr euch selbst ich glaube der einzige weg wenn du überzeugt werden möchtest ist man mit dem sales zu arbeiten und vielleicht mal ein deal zu verkaufen. Also warum sage ich das? Es gibt ja verschiedene Sales-Rollen. Die Sales-Rolle, die du vielleicht meinst, ist so der Account-Executive. Derjenige, der von der Projekt- oder fachlichen Seite den Deal führt, oder der die Beziehungen herstellt, der initial auf den anderen zugeht, und dann auch immer die Gespräche organisiert, oder vielleicht nochmal euch mit dazu nimmt und sagt, hey Andi, wir haben ja echt anstrengende Kunden, der muss genau wissen, wie das funktioniert, komm doch mal mit. Und du sagst, ach Gott, keine Zeit, ich muss doch hier mein Zeug coden, oder was auch immer. Aber jedenfalls hat man häufig keinen Bock, wenn man im Backend arbeitet, auf einen Kunden zu sehen. So zumindest nach meiner Erfahrung. Also es stört immer ein bisschen. Man fühlt sich reingezogen vielleicht.",
            "start": 658159,
            "end": 709821,
            "confidence": 0.7539551282051281,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "In meinem Job muss ich ab und zu auch in Kundencalls. Meist in Situationen, wo es dann nicht so schön ist, weil ich bin im Site-Reliability-Engineering-Bereich und oft, wenn man mit mir spricht, dann ist halt oft nichts Gutes.",
            "start": 710782,
            "end": 722205,
            "confidence": 0.804,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vorher passiert es ist noch mal fies also du wirst du kommst halt nur ins gespräch wenn es irgendwie schief läuft.",
            "start": 722820,
            "end": 728802,
            "confidence": 0.6317619047619046,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Da ist gemein ja gut man kriegt aber natürlich schon hier und da mal später ein dankeschön und das ist dann positiv umso mehr die details man man raus gibt aber was ich was ich sagen muss bezüglich man wird aus dem becker immer so in den sales calls reingezogen macht das ungern ja tut man weil man hat man halt höchsten respekt weil man hat halt keinen kontext vorher man weiß halt nicht Was wurde denn bereits an den Kunden kommuniziert? Weil ich habe ja alle inner Details aus meiner Organisation. Ich habe ja, ich weiß nicht genau, ich wurde nie geschult. Was darf ich sagen? Was darf ich nicht sagen? Und da ist natürlich ein sehr hoher Respekt, dass man dann die Kundenbeziehung vielleicht sogar beschädigen könnte, weil man ein bisschen zu viel ins Detail genommen hat.",
            "start": 728822,
            "end": 765098,
            "confidence": 0.7800503597122304,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ist richtig und deswegen brauchst du auch Sales Engineers, also jemand mit deinem Wissen und Sales Wissen.",
            "start": 765539,
            "end": 771950,
            "confidence": 0.7150000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Da bist du direkt bei der nächsten Frage. Sales und Engineering passt in meinem Kopf seltenst zusammen. Besonders, weil auch viele Engineers, ich sag mal, ihre Arbeit und ihre Arbeitsleistung durch Open Source for free einfach auf den Markt stellen, GitHub und Co. Deswegen meine Frage an dich, wie würdest du den ersten Paragraf bei Wikipedia zum Artikel Sales Engineering formulieren?",
            "start": 771970,
            "end": 795979,
            "confidence": 0.8169999999999998,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich bin Autor, ich bräuchte da jetzt mehrere Iterationen, um das gut zu machen. Ich würde aber anfangen damit, das sind zwei Kernthemen. Erstens, du hast das Herz eines Engineers und die Seele eines Verkäufers. Also Sales klingt netter im Englischen. Lassen wir mal nicht Verkäufer, sondern eines Sales. Zweitens, du bist die Person im Deal, die der Kunde wirklich treffen will.",
            "start": 796279,
            "end": 818143,
            "confidence": 0.7676774193548391,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wenn du jetzt sagst Seele und Herz, was ist dann der wichtiger oder vielleicht nicht der wichtigere Teil, aber der schwergewichtigere Teil? Ist es mehr Sales, mehr Engineering? Und vielleicht auch, woher kommen die Leute? Also kommen die Leute eher von der Sales-Seite oder von der Engineering-Seite? Oder ist es überhaupt möglich, von der einen oder anderen Seite zu kommen?",
            "start": 818403,
            "end": 836766,
            "confidence": 0.8220833333333336,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sales Engineering ist eine Karriere, basierend auf einer Karriere. Also im besten Fall hast du eine Karriere im Backend gemacht, die dir tiefstes, extremstes Projektwissen und technisches Wissen liefert. Weil erst dann bist du eigentlich in der Lage, verlässlich und auch authentisch zu verkaufen. Du musst dem Kunden sagen können oder zeigen können, dass du extreme Projekterfahrungen hast, dass du schon mal durch die tiefsten Täler gegangen bist und diese Anekdoten mitzunehmen. Das ist alles wichtig im Verkaufsprozess und als Sales Engineer. Also ich würde sagen, der Einstieg aus Sales Seite ist da möglich, wo es rein fachlich ist. Sagen wir mal, du verkaufst Finanzsoftware. Dann könntest du fachlich dich so upgraden, dass du sagst, okay, ich könnte das auch beraten im Verkauf. Willst du technisch, also glaube ich nicht, dass du von Zählseite kommen kannst, dann müsstest du schon Jahre nachholen, selber coden, vielleicht lesen, Zertifikate, Schulungen machen und so weiter. Also da ist schon der Punkt, dass du am besten wirklich viel Projekterfahrung hast, IT-Erfahrung hast. Technologieerfahrung hast und dann in Sales Engineering gehst und dann die zweite Karriere im Prinzip anstrebst im Sales Engineering.",
            "start": 836986,
            "end": 907893,
            "confidence": 0.7565080213903737,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Heißt das eigentlich, dass das jetzt diese Position, die du zuerst erwähnt hast in deinem Beispiel, dass man da den Engineer hinein holt in so ein Verkaufsgespräch, der dann total unglücklich ist, weil er da aus seiner Coding-Welt herausgerissen wird, ist das dann Sales Engineer genauso so ein Engineer, der aber nicht aus dem Code herausgerissen wird, sondern Spaß daran hat?",
            "start": 908233,
            "end": 927267,
            "confidence": 0.7596557377049181,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Exakt. Ich glaube, das Beispiel ist schlechte Mathematik. Ich habe das gestern gelesen, das hat mich inspiriert. Einmal 10 ist gleich 10 mal 1. Das ist in der Mathematik. Es ist aber ein Unterschied, ob ich jetzt sane Engineers in meiner Company habe, die einmal zum Kunden gehen und versuchen, den Kunden zu überzeugen, einen Deal zu unterschreiben. Dann werden sie sehr konservativ sein, weil sie haben Respekt, so wie Andi das eben gesagt hat. Aber habe ich einen Engineer, der versucht, zehn Kunden zu akquirieren und mitzugehen, wird der seine Möglichkeiten ändern. Also er wird sagen, okay, bestimmte Sachen können schiefgehen, vielleicht verliere ich zwei, macht nichts. Aber ich werde kreativ und ich werde mir psychologische Mittel vielleicht aneignen und ich werde auf eine bestimmte Art und Weise vielleicht das Tool vorstellen, sodass es maximal positiv auf den Kundencase passt. Ich werde Ausschnitte liefern, nicht alles. Also ich gehe nicht die Hafenrundfahrt, so sagt man das bei uns, wenn man eine Demo macht, die Hafenrundfahrt, alles. Ich konzentriere mich auf den richtigen Container, der in deinem Haare steht. Und den mache ich auch noch mit Storytelling-Elementen so interessant, dass der Kunde sagt, krass, genau das brauchst du.",
            "start": 927999,
            "end": 990155,
            "confidence": 0.7305909090909094,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich kenn den Term wie großer Hafenrundfahrt, nur beim Arzt. Und das ist dann meist nicht gut. Weil das dann halt so unangenehme Untersuchungen sind. Aber mein Vergleich zu, wenn ich den Jobtitel Sales Engineer hör, ich vergleich das immer wie mit DevOps. Ja, wir wissen, DevOps ist keine Position, sondern eine Kultur, aber die Industrie nutzt das inzwischen als Position und wir haben DevOps-Engineers. Und DevOps, ja, du bist Entwickler und du bist Operations, also Systemadministrator. Und dann packst du zwei Jobs in einen Menschen. Das funktioniert ja eigentlich nicht, weil irgendwie hat man immer nur zwei Hüte auf. Und die Frage ist halt nur, welchen Hut hast du länger auf? Den Systemadministrator oder den Entwicklungshut? Aber Punkt ist, du kannst nicht beide Jobs in der gleichen Perfektion machen, als wenn eine Person nur einen Job macht. Und wenn ich jetzt Sales Engineer höre, ist das Irgendwie was ähnliches, also du bist Software-Ingenieur, du hast auch gerade gesagt, dass deine Karriere, auf einer Karriere, wahrscheinlich dann als Backend-Entwickler oder Projekt-, oder Programmierer im Allgemeinen oder Programmiererin. Und du hast dann schon ein paar Jahre, weiß ich nicht, so sechs, sieben, acht, zehn Jahre programmiert, Software entwickelt, vielleicht warst du Tech-Lead oder Engineering-Manager oder ähnliches. Aber im Endeffekt kannst du ja nie so gut im Sales werden wie ein Mensch, der das schon zehn Jahre lang gemacht hat. ohne dann zum Beispiel schwächer im Engineering zu werden, oder?",
            "start": 991628,
            "end": 1069624,
            "confidence": 0.7343361344537819,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du wirst schwächer im Engineering, natürlich. Sobald du in die Rolle gehst, hast du nicht mehr die Zeit, regelmäßig zu programmieren, zu entwickeln. Das müsstest du daheim an der Zeit machen. Wahrscheinlich, ja. Das ist auch mein Gefühl. Deswegen sage ich, je tiefer das Wissen ist, je besser. Du wirst ständig aktuell gehalten, aber häufig auf Produktentwicklung. Wenn du mehr wissen willst, warum jetzt neue Teile im Produkt sind, was der Entwickler natürlich weiß, aber was der Sales Engineer, was ihm vielleicht nicht mehr bewusst ist, weil du vielleicht auch den Zugang verlierst auf der tieftechnischen Ebene. Aber da gibt es auch Schwankungen. Es gibt Sales Engineers, die wollen per Definition technisch bleiben. Und damit, wie du schon sagst, sind sie vielleicht nicht die stärksten auf der Vertriebsseite, vor allem wenn es darum geht, proaktiv auf andere zuzugehen, vielleicht auch den Raum zu lesen, vielleicht auch über LinkedIn sich die Menschen zu recherchieren, die mit drin sind und sich zu überlegen, wie hole ich jetzt auch persönlich Leute rein, was ja eh ein Thema ist, denke ich. Also die meisten Sales Engineers sind introvertiert, nach meiner Erfahrung. Das heißt, es ist eh schon schwieriger, auf andere zuzugehen, da vielleicht auch offen zu sein und vielleicht ein kleines Risiko einzugehen in der Kommunikation.",
            "start": 1069644,
            "end": 1139328,
            "confidence": 0.7308349056603775,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wie passt das denn zusammen, dass deine Erfahrungen nach die meisten Sales Engineers introvertiert sind? Also meine Definition von introvertiert, und Psychologen werden mich jetzt sehr wahrscheinlich in der Luft zerreißen, ist, du bist nicht sehr, ja, ich beschreibe jetzt das eine Buzzword mit dem anderen Buzzword, ich weiß, aber nicht sehr outgoing. Du stellst dich nicht gerne irgendwie in den Mittelpunkt, du bist nicht gerne auf der Bühne. Das ist so meine Definition von introvertiert.",
            "start": 1139788,
            "end": 1164345,
            "confidence": 0.7660921052631579,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich bin da ja ganz anderer Meinung, weil die offizielle, oder ich weiß nicht, ob es die offizielle Definition ist, aber es gibt diese Definition, dass introvertiert ja nur bedeutet, dass du eher Energie verlierst, wenn du mit Menschen zusammen bist und auf der Bühne stehst. Aber es gibt ja auch ganz viele große Leute, die auf der Bühne stehen, die alle introvertiert sind. Dein großes Idol zum Beispiel, wo mir der Name gerade wieder nicht einfällt, wie heißt der?",
            "start": 1164729,
            "end": 1189887,
            "confidence": 0.788175,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Simon Simek.",
            "start": 1189927,
            "end": 1190608,
            "confidence": 0.6435,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, Simon Sinek, danke, ist ja auch klassischer Intro-Wort.",
            "start": 1190928,
            "end": 1194651,
            "confidence": 0.6765555555555555,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Guy Kawasaki, Bill Gates, auch so, ja, genau.",
            "start": 1195411,
            "end": 1198373,
            "confidence": 0.571625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das heißt ja noch lange nicht, dass man nicht auf der Bühne stehen darf.",
            "start": 1198413,
            "end": 1201095,
            "confidence": 0.7635714285714287,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Okay, fair enough, finde ich gut. Das bedeutet aber auch dann, wenn du Energie verlierst, wenn du auf der Bühne stehst, im Mittelpunkt stehst und so weiter, das bedeutet, dass deine Anzahl an Sales Engineering Calls per Day halt auch hart limitiert ist, oder? Also ich meine, nach zwei ist Schluss.",
            "start": 1201135,
            "end": 1216206,
            "confidence": 0.7506470588235297,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es gibt ein extrem interessantes Buch, heißt Quiet. Quiet, the power of quiet people. Irgendwie so. Ich verliere gerade den Titel. Vielleicht kann man im Nachhinein recherchieren. Aber das ist ein extrem interessanter Read, genau darüber, was du sagst, Wolfgang, ist absolut korrekt. Also sie beschreibt es als Batterie. Du bist eine Batterie und wenn introvertierte Leute mit anderen Menschen agieren, wird sie entladen. Aber du brauchst den introvertierten Anteil, weil es macht dich zu einem extrem guten Negotiator. So sagt sie es auch. Also du kannst durch diese zurückhaltende Art, durch die extrem reflektierte Art, durch die extrem vorbereitete Art und Weise, sehr viel gewinnen. Und das ist ein Riesenpunkt dabei. Und es gibt sowas wie einen Vertrag mit dir selbst. Das heißt, es gibt eine bestimmte Anzahl an Energie, die du in dir hast, mit der du Calls extrem outgoing machen kannst. Du wirkst wie ein Extrovert. Sieht man auch auf den Livestreams jetzt sowas, was wir machen. Ich bin introvertiert, definitiv. Aber ich hab diese Energie. Und man kann sie auch lernen. Das baut sich auch auf. Es ist tatsächlich auch eine Art Muskel. Je mehr man sich dem stellt, umso besser wirst du. Dauert leicht Jahre, aber da baut sich schon was auf.",
            "start": 1217106,
            "end": 1286690,
            "confidence": 0.72795652173913,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Eine Frage auch noch, weil der Andi gemeint hat, man hat dann weniger Sales Calls zur Verfügung. Ich denke da jetzt immer an Cold Calling und solche Dinge, aber macht das dann der Sales Engineer überhaupt oder ist der sowieso dann wesentlich später eingepumpt?",
            "start": 1286751,
            "end": 1300457,
            "confidence": 0.7559090909090912,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wesentlich später. Genau, wichtiger Punkt. Also typischerweise, du hast erst den BDR, also den Business Developer. Das sind häufig junge Leute, die machen den Cold Call und die gehen auf Masse. Alles, was die wollen, ist Termine mit potenziellen Kunden. Dann kommt der Account Executive. Das ist der typische Verkäufer. Also die managen die Beziehungen, die setzen die Calls auf, die wollen den Deal auch reinholen, die machen am Ende die Verhandlungen. Was viele nicht sehen, auch die Sales Engineers übrigens nicht, ist, wie wichtig diese Rolle ist, weil sie diese Zurückweisung aufnimmt. Also Account Executives, Verkäufer, haben sehr stark damit zu kämpfen, dass sie zurückgewiesen werden an jeglichen Stellen. Ein Deal ist nie fest. Also nur weil du jetzt an einen Termin kommst, heißt das nicht, dass der Deal drin ist oder dass das schon ein Kunde ist. Das ist alles noch sehr wackelig. Und die haben das zu managen. Und das ist nicht leicht und das geht auch tatsächlich an die Substanz. Deswegen ist diese Rolle so wichtig und deswegen sind es auch ganz bestimmte Typen von Menschen, die das tun.",
            "start": 1300929,
            "end": 1357282,
            "confidence": 0.7807868852459012,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Werdest du diese Person, die wir so als technische Leute kennen, als die Sales-Person? Werdest du diese Hauptperson, die da im Titel drinnen steckt?",
            "start": 1358637,
            "end": 1367500,
            "confidence": 0.7742916666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Und mit der Person, mit der bildet jetzt der Sales-Engineer immer ein Team. Also ein Deal wird immer im Team bearbeitet. Account Executive plus der Sales-Engineer. Und dann gibt es auch Rollen rundherum. Also vielleicht ist Engineering tatsächlich mit Teil, um mal in den Call gezogen zu werden für wirklich tieftechnische Workshops oder Ähnliches. Oder mal Lösungsideen. oder Produktmanagement ist mal dabei, Customer Success, also je nachdem, was der Kunde dann benötigt. Aber Account Executive und Sales Engineer planen das. Jetzt gibt es die Sales Engineer, die sagen, ich bin Techie und da möchte ich auch bleiben. Die würden bei der Deal-Strategie nicht mitmachen. Dann gibt es aber die Account Executive und Sales Engineer, die sagen, ich möchte den Deal mitgestalten, weil ich möchte auch in einer Rolle sein, wo ich Verantwortung trage und wo ich Kontrolle einfach habe. Und die würden ein bisschen mehr in den Sales Motion mit reingehen und sagen, okay, der Kunde möchte eigentlich das und das, lasst es uns so vorgehen. Ich würde vorschlagen, erst ein POC, dann eine Demo oder erst eine Discovery Session oder wir machen ein Workshop. Also Discovery ist, und das ist eines der großen Skills eines Sales-Ingenieurs, der wirklich guten, die können Discovery machen. Discovery bedeutet in einem Gespräch die Probleme des Kunden herausfiltern, und zwar nicht allein auf technischer Ebene, zwar mit dem technischen Wissen im Background, aber auf fachlicher Ebene, auf Business-Ebene. Und das macht ein Sales Engineer aus. Er versteht den Kunden implizit, also auch die technischen Probleme, die technischen Voraussetzungen, kann aber durch insightful questions, also Fragen, die auch Wissen beinhalten, sozusagen, den Kunden abholen, ihm Mehrwert geben und auch die Informationen rausziehen, die ein Verkaufsteam benötigt, um Software so teuer wie möglich zu verkaufen. Damit hat Engineers, Produktmanagement, Customer Success, damit die alle bezahlt werden. können, damit ihr eure Subscription habt.",
            "start": 1367520,
            "end": 1472108,
            "confidence": 0.7279348534201951,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt ist dieser Begriff Sales Engineering zumindest für mich relativ neu, aber was ich natürlich schon kenne und in der Vergangenheit oft gehört habe, ist dieses Solution Architect oder passt jetzt nicht ganz so rein, Technical Account Manager, die waren aber auch irgendwie mit den Kunden immer in Kontakt und dann diese Developer Advocates, die natürlich auch in irgendeiner Form da mitspielen. Wie grenzt sich das Ganze zu den Begriffen ab oder gibt es da auch Überschneidungen?",
            "start": 1472148,
            "end": 1496213,
            "confidence": 0.8202467532467531,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Absolut, gibt es und die werden auch nicht einheitlich benutzt. Also die Rolle Sales Engineer ist Solution Consultant, also wenn du das liest, Solution Consultant, Customer Engineer, Solution Architect, Sales Consultant, Pre-Sales. Solution Architect ist definitiv auch dabei. Es ist häufig aber auch als Post-Sale-Rolle verwendet. Also Post-Sale bedeutet nach dem Verkauf auf dem Kunden, genauso wie der Technical Account Manager, der ja eine Kundenbeziehung ist. Also da gibt es nicht mehr einen Deal, da ist ein abgeschlossener Kunde. Und der Pre-Sales oder Sales Engineer, der Solution Consultant, ist dafür da, einen Kunden zu gewinnen. Also da ist dann eine ganz klare Verkaufsabsicht mit einem noch nicht gewonnenen Kunden, mit einem Prospector.",
            "start": 1496693,
            "end": 1538752,
            "confidence": 0.7577410714285714,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also es ist immer pre-sales eigentlich, also davon kann man mal ausgehen von der Abklausung her.",
            "start": 1539168,
            "end": 1543714,
            "confidence": 0.7291249999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, genau.",
            "start": 1543754,
            "end": 1545035,
            "confidence": 0.546,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und ein Developer Advocate wäre dann noch früher in dem Fall.",
            "start": 1545075,
            "end": 1549560,
            "confidence": 0.7566363636363637,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube Developer Advocate würde ich tatsächlich ins Marketing stecken und nicht ins Sales. Mein Gefühl.",
            "start": 1549601,
            "end": 1554727,
            "confidence": 0.7612500000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Da sind auch zumindest bei mir in der Firma die Developer Advocates aufgehangen und in der Marketingorganisation. Weil mein Verständnis von Developer Advocate ist, dass die, ich sag mal, den Need von unten triggern. Ja, da ist der Motto halt, ja, die advokaten den Developer, aber in der Regel, also die sagen, okay, die schaffen ein Gefühl, dass Amazon Web Services der einzige Hyperscaler ist. Und dass man jetzt für alles Amazon nutzen muss. Unabhängig davon, ob das jetzt wahr oder nicht wahr ist. Unabhängig davon, ob On-Premise-Infrastruktur auch Value hat.",
            "start": 1555427,
            "end": 1589298,
            "confidence": 0.7684065934065933,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also Corporate Influencer quasi, was der neue Hype Begriff ist.",
            "start": 1589958,
            "end": 1594723,
            "confidence": 0.6632,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Influencer ist glaube ich, ja vielleicht ist das eigentlich der bessere Begriff, aber ich meine im Endeffekt die Developer selbst, also und Patrick die Frage geht an dich, die Developer selbst sind ja nicht die Entscheider später, die sind ja nicht die den Vertrag dann unterschreiben von den Kunden, mit denen du dich ja unterhältst oder doch?",
            "start": 1594763,
            "end": 1610420,
            "confidence": 0.7212280701754384,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ganz wichtiger Punkt, genau. Also du als Sales Engineer hast das Problem fast, dass du erst mit Entwicklern in Kontakt kommst. Obwohl die Entwickler nie entscheiden werden. Die haben einfach Bock auf das Tool. Jetzt ist es deine Rolle, Multi-Level-Selling zu betreiben. Das heißt, du musst auf andere Ebenen dich in der Hierarchie des Unternehmens des Kunden nach oben arbeiten zum Entscheider. Und das ist nicht so trivial. Da braucht es schon Balls. Ja, ich sag's mal Englisch. Manchmal um danach zu fragen oder um entsprechend was voranzubringen, um das nächste Level zu erreichen. Da ist aber der Account Executive häufig auch sehr stark. Also mit einem guten Account Executive muss ein Sales Engineer nicht so viel tun, außer vielleicht mal jemanden anzuschreiben oder anzurufen. Wenn beide unerfahren sind, wird es halt schwieriger, aber dann werden sie wahrscheinlich auch mutiger und risikobereiter. Also Sales ist ganz viel Chaos letztendlich. Und als Sales Engineer hast du die Freiheit, extrem kreativ zu sein im Verkaufsprozess, was deine Software angeht. Auch mal eine andere Geschichte darüber zu erzählen, sie in anderen Use Cases zu präsentieren. Das ist schon unglaublich spannend und auch befriedigend, was man tatsächlich machen kann. Das ist schon geil. Also ich finde es sehr cool. Ich muss aber auch sagen, ich war nie ein Admin-Typ. Also was mich immer bei Aufgaben genervt hat im Backend war, sobald ich was cooles entwickelt, entworfen hatte und das war fertig, wollte ich es abgeben und das nächste machen. Also ich bin nicht der Admin. Ich mag das nicht maintainen, ich mag das nicht weiterführen, das funktioniert, ist gut, passt, nächster, nächstes Thema. Und genauso ist es auch als Sales Engineer. Kunden abgeschlossen, nächster Kunde, neue Herausforderung, neues komplexes Problem.",
            "start": 1611217,
            "end": 1713777,
            "confidence": 0.7629265734265734,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du hattest schon den Begriff Pre-Sales genannt und wenn du jetzt sagst, okay, wenn der Deal abgeschlossen ist, dann sprichst du zum nächsten Kunden. Aber wenn es Pre-Sale gibt, gibt es glaube ich auch Post-Sales, oder?",
            "start": 1713817,
            "end": 1726306,
            "confidence": 0.7132777777777778,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau so ist es, ja.",
            "start": 1726346,
            "end": 1727648,
            "confidence": 0.6866000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und was ist das? Also wieso ist ein Sales Engineer nicht im Post-Sales? Weil im Endeffekt bringst du ja technische Expertise an den Kunden und der muss ja irgendwie, ich sag mal, auf gut Deutsch betüttelt werden.",
            "start": 1727728,
            "end": 1739224,
            "confidence": 0.7617027027027028,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau das ist aber eher admin tätigkeit also das konsistente beraten ist doch schon eher eine andere fähigkeit als ein kreatives verkaufen also wenn wenn ich weiß das ist mein kunde habe ich ein anderes gefühl als wenn ich weiß, Okay, das ist noch ein Deal, der ist überhaupt nicht sicher. Und ho, da ist der Wettbewerb. Und die hauen auch rein. Die bringen auch ihre Value Proposition mit. Die machen vielleicht uns sogar schlecht. Dann brauchst du da andere Fähigkeiten und auch anderes Vorgehen. Und du bist schneller und du bist vielleicht nicht so... Ja, vielleicht ist es eher so Chachivity-mäßig. Du bist vielleicht eher plausibel als hundertprozentig korrekt. Um zu einem Punkt zu kommen, wo der Kunde sagt, okay, lasst uns jetzt das mal im Detail besprechen.",
            "start": 1739508,
            "end": 1780905,
            "confidence": 0.7608759689922484,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Chat-GPT als plausibel zu bezeichnen, finde ich auch mutig. Aber okay, lass ich durchgehen.",
            "start": 1782047,
            "end": 1787009,
            "confidence": 0.7942857142857142,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das Ziel ist von dem Tool halt, plausibel zu sein und nicht korrekt. Also nur als Vergleich. Vielleicht macht's auch keinen Sinn. Keine Ahnung.",
            "start": 1787589,
            "end": 1794971,
            "confidence": 0.6294583333333333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt hast du schon sehr viele verschiedene Rollen genannt. Und das klingt für mich, als wenn sich das nur ganz große Firmen leisten können, überhaupt das Ganze so aufzuteilen und so viele Rollen in dem Prozess zu haben. Bedeutet es, diese Rolle gibt es nur wirklich in großen Konzernen und Unternehmen oder gibt es diese Rollen auch im kleinen Startup?",
            "start": 1795011,
            "end": 1817043,
            "confidence": 0.8741833333333333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also es hat schon Grund, du hast es ja gesagt, dass du vorher die Rolle noch nicht gehört hast. Ich habe jetzt ein Buch gelesen von 1940, hieß Sales Engineering, extrem spannend.",
            "start": 1817083,
            "end": 1826812,
            "confidence": 0.6596562500000002,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das macht mir gerade extrem schlecht, wenn ich den Begriff erst jetzt gehört habe, obwohl es seit 1940 ist.",
            "start": 1827927,
            "end": 1833155,
            "confidence": 0.7207368421052633,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, da gab es das erste Buch, war aber eher im Manufacturing-Bereich unterwegs, beschreibt aber die Rolle extrem gut. Also damals gab es nur den Sales Engineer, nicht mal den Account Executive. Also hat dann wirklich eine Person das technische Vision über die Maschine gehabt und über den Markt, ist zum Kunden gegangen, hat die verkauft. Das Coole ist, dass da drin immer noch die Weisheiten, die damals galten, heute noch gelten. Ein Sales Engineer bringt Business Mehrwert. Ganz häufig habe ich Leute auch in meinen Trainings, die halten sich an ihrem Wissen fest. Also bedeutet, sie glauben, dass ihr Mehrwert oder ihr Wert generell am fachlichen Wissen oder am technischen Wissen hängt, was nicht der Fall ist. Es geht immer um die Person, das fachliche Wissen ist wichtig, aber der Mehrwert bist du als Person und wie du auch auftrittst. Also stationär ändert sich ein bisschen was auch in deiner Außenwirkung, möchte ich sagen.",
            "start": 1833175,
            "end": 1885058,
            "confidence": 0.750258064516129,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Nur nochmal, um das klarzustellen in Bezug auf welche, welche Firmen benötigen Sales Engineers. Also ich meine, es ist ja, es ist ja, wenn ich jetzt ein Spotify Abonnement abschließe, als Privatperson, da quatscht ja keiner mit mir.",
            "start": 1885378,
            "end": 1896535,
            "confidence": 0.6863421052631579,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja genau. Ich glaube, du bringst es gerade auf den Punkt. Erklärungsbedürftige, komplexe Software braucht Sales-Engineers und in kleineren Unternehmen glaube ich, das weiß ich noch aus meiner Vergangenheit, ich war System-Engineer bei einer relativ kleinen Firma. Wir waren im Prinzip Professional Services, Customer Success, wenn man es heute aufteilen würde, wir waren alles an der Rolle und Sales-Engineer. Das heißt, wenn es ein Kundenthema gab, sind wir mitgegangen, wenn es die Datenbank bei Siemens zum Mikro dann gab, bin ich halt hingegangen und habe es gemacht. Und heute ist es immer mehr klar, dass es die Rolle gibt, und das meinte ich halt, da war auch mein Gedankengang vorhin, die Rolle ist neu, in dem Sinne, dass es vor allem auch in Deutschland nicht viele kennen. International gesehen hat sie, glaube ich, mehr Ansehen und auch die Bedeutung ist klarer, also auch der Mehrwert der Rolle ist klarer. Vielleicht ist das in unserem deutschen ingenieursgetriebenen E, wo viele Ingenieurs in den Firmen sitzen. Vielleicht wird der Mehrwert nicht so gesehen von dem Vertriebs, also von von noch einer Vertriebsrolle.",
            "start": 1896855,
            "end": 1954216,
            "confidence": 0.7309722222222218,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich weiß es nicht.",
            "start": 1954236,
            "end": 1954797,
            "confidence": 0.59625,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das wäre schon eine Frage, die ich mir eigentlich für später aufgehalten habe, aber sie passt gerade so gut. Ist jetzt das dann eigentlich ein Abstieg für mich als Engineer? Also du sagst jetzt, da ist natürlich viel Mehrwert dahinter, aber ich könnte mir vorstellen, dass ganz viele EntwicklerInnen sagen, ja, das ist ja ein Abstieg, wenn ich jetzt Sales mache. Sales ist ja böse, wie der Andi zuerst erwähnt hat. Und Sales sind die, die irgendwas verkaufen, was ich dann programmieren muss, obwohl es das noch gar nicht gegeben hat und die haben es schon verkauft und solche Dinge. Und jetzt mache ich plötzlich als Entwickler in Sales oder gehe auf die böse Seite der Macht. Also ist das ein Abstieg deiner Meinung oder ist es ein Aufstieg oder ist es ein Umstieg und für wen ist das vielleicht auch etwas?",
            "start": 1955289,
            "end": 1996029,
            "confidence": 0.7805281690140843,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also, wie man es bewertet, kann ich keinem vorschreiben. Ich würde halt sagen, schaut es euch mal an. Also geht mal mit in einen Deal oder versucht mal zu verstehen, wie schwierig es ist, eure Software zu verkaufen. Aus meiner Erfahrung, also wie gesagt, ich war Produktmanager, Integrationarchitekt. Aus meiner Erfahrung habe ich den Markt nie so genau gekannt wie als Sales Engineer. Ich habe gar nicht gewusst, wo die Schmerzen im Detail liegen und ich wollte es mir auch gar nicht anhören, weil das ja Arbeit bedeutet. Oh, meine coole Idee kommt, will keiner kaufen. Blöd, ne? Aber ich bin doch so genial. Das ist gerade das Produktmanager. Das ist echt eine Falle, glaube ich, in die man treten kann. Also, ich glaube nicht, dass es ein Abstieg ist. Also, ich würde das überhaupt null werten. Und ich glaube, das ist auch das Wichtige. Die Bewertung sottet heraus. Jede Rolle hat seine Relevanz. Und der Sales bezahlt den Backend. Immer. Wenn die Zahlen vorne nicht stimmen, kannst du so gut sein, wie du willst als Entwickler. Wenn du nichts entwickelst, was auf den Markt passt, was die Kunden haben wollen, wird es nicht lange funktionieren. Und der Vorteil ist aber, wenn du sagst, okay, ich bin jetzt Entwickler schon 15 Jahre lang, 20 Jahre lang und irgendwie habe ich meinen Peak erreicht und ich brauche neue Herausforderungen, also im Sinne von, ich möchte nicht mehr nur der Admin sein, dann ist Sales Engineering wirklich was für dich, weil es ist gehaltlich auf jeden Fall ein Anstieg und es ist auch, was deine Skills und Fähigkeiten betrifft, wirst du dich extrem erweitern müssen. Eine Area of Control, oder deine Komfortzone musst du erweitern. Anders funktioniert es nicht. Häufig, also gerade wenn man mit Menschen umgeht und vielleicht auch ein bisschen pushy sein muss in gewissen Situationen, muss man auch ändern, wie man denkt und wie man vielleicht auch über das ganze Thema denkt. Also vielleicht auch ganzheitlich. Wie funktioniert eigentlich so ein Unternehmen? Woher kommt eigentlich das Geld, das monatlich aufs Konto fließt, worüber ich mir eher keine Gedanken mache?",
            "start": 1996430,
            "end": 2101042,
            "confidence": 0.7366400000000002,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube, du hast einen Key-Satz gerade gesagt, und zwar, der Sales bezahlt die Produktentwicklung, oder das Backend hast du, glaube ich, gesagt. Und ich glaube, wenn man sich das mal vor Augen führt, ist es ja wirklich so, man kann eigentlich als Entwickler dann gar kein Sales hassen, weil im Endeffekt sorgen die ja, also das Team dafür, dass ich einen Job habe. Also, wenn man das mal ganz brachial runterbricht.",
            "start": 2102470,
            "end": 2124044,
            "confidence": 0.7838333333333332,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Man kann nicht die Leute hassen, aber du kannst natürlich trotzdem die Rolle oder also die ... die Tätigkeit hassen als Entwickler. Und da stellt sich für mich ja auch die Frage, wie schaffe ich es denn, mich da irgendwie dafür zu interessieren? Weil es ist ja oft so, dass sich die Entwickler so abschotten und so wenig, ich meine, das sprechen wir in fast jeder Episode an, wie schwierig Kommunikation ist in der ganzen IT-Welt und in Entwicklerteams. Und das ist ja eine absolute Kommunikationsrolle, würde ich mal sagen. Also wie schafft man es denn, dann die EntwicklerInnen überhaupt in die Richtung zu pushen? Wenn du jetzt auch sagst, okay, man muss seine Komfortzone erweitern oder herausgehen aus seiner komfortzone aber wie wie schafft man denn das die leute dann zu motivieren sich das überhaupt mal anzuschauen wie du jetzt gemeint hast schaut es euch mal einfach an.",
            "start": 2124084,
            "end": 2170747,
            "confidence": 0.796912751677852,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja hassen ist ein krasser begriff ja es ist ja fast sozusagen ja keine ahnung ich gehe ins fitnessstudio ich liebe trainieren aber ich hasse essen. Weil ich brauche die Nahrung ja, anders funktioniert es ja nicht und also finde ich es sehr hart.",
            "start": 2170787,
            "end": 2190205,
            "confidence": 0.6731818181818182,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Naja der Unterschied ist, essen muss ich selber und Sales muss ich nicht selber machen, das machen ja diese anderen Sales Leute.",
            "start": 2190245,
            "end": 2196407,
            "confidence": 0.7681363636363637,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Offen gesprochen ich gehe ins Fitnessstudio um mehr essen zu können, also das ist eher so meine Gedanke.",
            "start": 2196427,
            "end": 2201729,
            "confidence": 0.7272777777777778,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also ich glaube, das ist ganz viel Verständnis und auch mal eine Ebene höher gehen. Ich würde den Leuten einfach raten, geht mal mit, also geht mehr zu Kunden. Und vor allem, wenn ihr schon, es gibt ja auch Developer-Konferenzen, da auf eine Bühne zu gehen ist Sales. Das ist eine Sales-Engineering-Aufgabe letztendlich. Ich könnte mir vorstellen, dass es Entwickler gibt, die sagen, warum stehe ich denn nicht auf der Bühne? Warum steht denn da der Sales Engineer? Ja, warum? Weil er Kommunikation liebt, weil er vielleicht auch die Leute liebt, weil er die Herausforderungen mag. Das heißt aber nicht, dass das ein Entwickler nicht könnte. Also ich glaube, es wäre sogar richtig cool, wenn viel mehr Entwickler auf der Bühne stehen würden. Und das ist ein erster Schritt, wo man halt sehen kann, okay, Cool, das macht ja Spaß. Ich kann mit meinem Wissen punkten, ich kann es darstellen, ich kann ein bisschen... Also ich glaube, die sprechen mich danach vielleicht sogar an und fanden es cool. Und danke für den Mehrwert, das wusste ich noch nicht. Das sind ja alles so Aspekte, also die Motivation, also der Appetit kommt beim Essen, ne? Genau das selbe wahrscheinlich hier. Wenn du erstmal anfängst und siehst, was es bedeutet, dein Tool zu pitchen, dein Wissen, das du hast, mit einzubringen und in die komplexe Kundenumgebung direkt einzubringen, das kann schon süchtig machen.",
            "start": 2202709,
            "end": 2269446,
            "confidence": 0.736580086580086,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du sprichst einen super Punkt an, du hast das ja auch schon erwähnt. Sales Engineering ist eine Karriere on top deiner vorhandenen Karriere und du hattest auch schon das Element erwähnt, aus seiner Komfortzone rauszugehen. Ich habe ich habe zwei Erfahrungen gemacht und zwar natürlich habe ich auch mal was versucht zu verkaufen also ob ich erfolgreich war oder nicht weiß ich jetzt auch nicht so ganz also den einen oder anderen deal habe ich abgeschlossen aber ich habe auch ziemlich viel Gegenwind bekommen und Ablehnung so wie du schon sagtest und ich war dann auch schon immer ein bisschen down weil ich habe das echt persönlich genommen sollte ich natürlich nicht aber. Der Punkt ist, ein Learning, was ich gemacht habe, ich habe immer gedacht, ich kannte das Problem der gegenüberliegenden Person. Und dann wurde ich aber fast immer irgendwie vom Gegenteil überzeugt. Das ist die eine Geschichte, das fand ich sehr, sehr faszinierend. Und die zweite Geschichte ist, weil du die Komfortzone erwähnt hattest, immer wenn man aus der Komfortzone rausgeht, fühlt sich das kacke an, weil man weiß nicht, wie man hier navigiert, man fühlt sich an wie der Junior. Aber es ist ja noch nie was schlimmes passiert. Also irgendwie ist immer dann ein Vorteil später rausgesprungen. Entweder habe ich was gelernt oder mir ist was bewusst geworden oder ähnliches. Aber es wird halt nie leichter. Also ich kann jeden Tag meine Komfortzone verlassen, aber es ist jeden Tag erneut schwierig. Und ich glaube, das ist schon eine hohe Barriere, finde ich. Besonders wenn du jetzt sagst, okay, das ist eine Karriere on top auf deiner karriere das bedeutet ja nicht dass das dass ich die karriereleiter hoch gehe sondern einen anderen karrierepfad einschlagen also wirklich wie vom entwickler zum engineering manager das keine promotion sondern dass eine karriere wechseln was natürlich schon schon eine harte nummer eine hohe barriere oder.",
            "start": 2269606,
            "end": 2368792,
            "confidence": 0.760003174603175,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ja genau, weil du mehr Skills benötigst, als du sie vorher hattest. Also du kannst deine Skills wieder vertiefen im Engineering-Bereich. Oder wie du schon sagst, also du musst ein bisschen loslassen, lernst aber neue Sachen, die du dann wieder vertiefen darfst. Und damit wirst du auf deiner ganzen Palette der persönlichen oder Soft-Skills weitest du dich extrem halt aus. Und natürlich auch fachlich. Also du verstehst auch, du musst dann auch verstehen, wie kunden unternehmen funktionieren und und ab dem punkt schon allein wirst du verstehen warum es keinen sinn macht den sales zu hassen als wer kennt aber ich habe ich habe genau dasselbe gedacht ich ich doch definitiv dass die dunkelheit der macht was verkaufen die da was soll das ja wir haben das ganz anders gedacht und ich habe nicht verstanden wie wichtig der kunde ist und sein problem und das zu verstehen und wie du schon sagst ist annahmen sind sind das schlimmste was ich machen kann also wenn ich zuvoreingenommen bin über das problem dass der kunde hat, Da gibt es verschiedene Abwandlungen. Es gibt visionsbasierte Pitches, wo ich als Sales Engineer versuche, den Kunden aufzuteilen, wo er hin kann mit unserer High-End- oder neuesten Lösungen, die es gibt. Beispiel SalesForce Ende der 90er, 1999. als die halt CRM in the Cloud. Die waren ja wie Piraten, die haben Siebel fast wegargumentiert, dass die schlecht seien. Also Daten gehören nicht ins Datencenter, sondern in die Cloud. Das waren so die ersten, die das wirklich gemacht haben. Und das ist so visionsbasiert Pitchen oder auch neues Problem im Markt finden. Und das ist auch eine Stärke des Sales Engineers oder der richtig guten. Die finden auch Probleme, die der Kunde nicht kannte. Also unnoticed needs sind das im Prinzip. Also Dinge, die der Kunde nicht wusste, dass er sie braucht.",
            "start": 2369833,
            "end": 2476055,
            "confidence": 0.7636764705882356,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt hattest du ja schon gesagt, dass die Rolle ja auch für introvertierte Leute etwas ist, weil das gegebenenfalls ein Vorteil bei der Verhandlung sein kann und durch vielleicht ja ich sag mal durch die durch die längeren Pausen vielleicht auch einen gewissen Druck auf den Kunden aufbaut, ich weiß es nicht, vielleicht bin da jetzt nicht so drin in den Sales-Taktiken. Was würdest du denn sagen wäre denn der erste Schritt, wenn ich jetzt diesen Podcast höre und du hast mich jetzt überzeugt, da mal tiefer rein zu gucken, was was mache ich dann? Wo kriege ich mehr Informationen? Was würdest du sagen, ist nämlich der stereotypenhafte Karrierepfad von einer Softwareentwicklerin zum Sales Engineer?",
            "start": 2477560,
            "end": 2515765,
            "confidence": 0.7494782608695649,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Gute Frage. Informationen gibt es mittlerweile viele. Also es gibt die Pre-Sales Collective zum Beispiel als freie Organisation. Auf LinkedIn gibt es, also wenn ich zum Beispiel mir connectest auf LinkedIn, einfach gerne anfragen bin da, kein Problem, dann gibt es mehr Gurus da draußen. Viel passiert im amerikanischen Markt. Da gibt es Sales-Engineering-Gurus, ja, die haben große Namen. Und hier im Deutschen gibt's noch den Jan und den Tim, Tim Bronne, Jan und Erik Jank sind die beiden noch. Und mich fast nur noch. Also ich glaub, da sind wir so ziemlich allein noch im deutschen Markt, aber ich glaub, das kommt noch, das wird noch wachsen. Wo find ich, genau, das sind Personen, die man suchen kann, die man ansprechen kann. Ich hab ein Buch über Sales-Engineering, das zwar in Englisch geschrieben ist, das Social Sales Engineer, aber es hat zwei Teile. Und zwar hat's noch Story-Anteil. wo versucht habe die gefühle die da so kommen wenn man mit der rolle beginnt oder vielleicht außen geht mit kunden interagiert also dieses gefühl das mache ich alles richtig oder, bin ich gut genug dafür darf ich das das ist damit drin und, Und glaub beleuchtet ganz gut, was die Rolle auch bedeutet, emotional. Also ich weiß noch, wie ich in die Rolle gekommen bin. Ich war bei IBM, da hat mich ein Sales-Kollege gefragt, ob ich Sales-Ingenieur werden will. Da hab ich gesagt, na ja, um Himmels willen, lieben, lieben. Ein halbes Jahr später wollte ich die Rolle wechseln. Ich wollte Integration-Architekt woanders werden. Und er sucht einen Job und dann fragt eine Rekruterin, ob ich nicht Sales Engineer werden will, bei einem Startup. Das war Muse of damals, irgendwie 20 Leute. Ich so, keine Ahnung, was ist das? Was macht man da? Und irgendwie, ja, nicht so richtig. Er hat gesagt, ja, okay, wir suchen eh erfahrene Leute, also erfahrene Profis suchen wir eigentlich. Ich so, was? Stopp. Ich bin ein erfahrener Profi, also was genau muss ich jetzt machen? Ja, ja, komm. Und dann war ich bei MuseSoft auf einmal Sales Engineer und war in dieser Rolle als Techniker und im Sales. Und so, ich bin ins kalte Wasser letztendlich gesprungen, ohne genau zu wissen, was die Rolle bedeutet. Aber es ist eine gute Möglichkeit, um das zu lernen. Ja, also das ging dann relativ schnell.",
            "start": 2516693,
            "end": 2642580,
            "confidence": 0.7288663239074555,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt hattest du schon gesagt, da gibt es natürlich auch Coaches und Gurus und so weiter und so fort. Immer wenn ich sowas höre, dann denke ich immer an so YouTuber, so komm in diese Gruppe, damit du dir einen Ferrari kaufen kannst. Ich meine, da ist ja schon ziemlich viel Müll im Markt, würde ich mal sagen. Besonders im Verkauf und vielleicht kommt daher auch diese Vorurteile, die ich genannt habe. Deswegen ist es natürlich schwierig, wenn man jetzt noch gar nicht mit dem Thema in Berührung kam, ich sag mal, Qualitatives von Quantitativen zu unterscheiden, wenn man so möchte. Hast du da einen Tipp für uns, wie man wirklich sagen könnte, okay, also müssen wir jetzt alle dein Buch kaufen und alles andere ist es dann jetzt nicht, oder?",
            "start": 2643761,
            "end": 2683147,
            "confidence": 0.765206106870229,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nein, nein, wie gesagt, es gibt eine große freie Community, die Pre-Sales Collective. Das ist auch ein guter Startpunkt. Ist eine US-basierte Community letztendlich, die aber auch über einen Slack-Channel funktioniert und da gibt es auch eine deutsche Subgroup. Wer in München ist, wir haben einen Sales Engineering Stammtisch jeden Monat, wo wir uns treffen. Das ist ganz cool.",
            "start": 2683688,
            "end": 2703567,
            "confidence": 0.7428474576271186,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Darf man da als Entwickler auch vorbeischauen?",
            "start": 2704438,
            "end": 2706019,
            "confidence": 0.28314285714285714,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Na klar. Jeder will kommen. Jeder ist willkommen. Es geht ja darum, Kontakte zu knüpfen. Es geht darum, die Rolle kennenzulernen. Und die meisten, tatsächlich die meisten Sales Engineers, kommen aus einer Entwickler, Backend, Projektmanager, Architektenrolle. Und sind dann im Unternehmen meistens organisch gewachsen. Wir brauchen jemanden im Vertrieb. Kannst du uns aushelfen? Und dann, okay, willst du nicht da öfter bleiben? Willst du das nicht häufiger machen? So steht das Schritt für Schritt. Und dann hast du die rolle inne ja es ist es ist es ist auch keine magie letztendlich ist es tatsächlich einfach einfach in anführungszeichen natürlich.",
            "start": 2706039,
            "end": 2740639,
            "confidence": 0.7575699999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das bedeutet aber auch wenn ich das jetzt alles so richtig verstehe und wir hatten auch schon über die vorherigen erfahrungen von backen entwicklern angesprochen das ist jetzt keine rolle für für den junior ja also man man muss schon ich sag mal so 5 6 8 jahre wirklich da sein und da gibt es ja keine klassischen Ausbildungspfade wie die deutsche Berufsausbildung und so weiter. Weil du gesagt hast, das ist irgendwie eine neue Rolle, die aus Amerika rüber schwappt. Also das ist halt schon wirklich was für, ja nicht für Berufseinsteiger, ne?",
            "start": 2741740,
            "end": 2767198,
            "confidence": 0.788585106382979,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich würde es nicht unbedingt raten, sagen wir es mal so. Also die Sales Forwarders oder SAP als Organisation, die bilden die Rolle aus. Da kannst du von der Uni kommen und das machen. dann wirst du aber auch mehr auf dem Produkt geschult. Und ich glaube, der Mehrwert ist, wenn du Erfahrung mitbringst. Das merkt ein Kunde einfach. Wenn du ein Projekt gemacht hast und darüber Anekdoten erzählen kannst, während du dein neues Produkt verkaufst, ist es viel glaubhafter, deine Wahrscheinlichkeit, da wirklich zu helfen, steigt. Als wenn du ohne Vorwissen, ohne Projektwissen, ohne mal etwas anders gemacht zu haben, direkt in die Rolle reingehst. Aber für die Unternehmen funktioniert's. Salesforce, wie gesagt, macht's. SAP macht's. Ich glaub, Oracle. Die bilden alle junge Sales Engineers oder Solution Architects oder Customer Engineers aus. Wie wertvoll das letztendlich ist, also das ist dann die Falle, also im Bereich selbst, da sagt man halt, du bist ein Demo-Monkey, wenn du eigentlich nur reingerufen wirst, um die Software zu demonstrieren, also eine sprechende Datenbank sozusagen, oder sprechende Dokumentation, mehr bist du dann am Ende nicht, und das möchtest du nicht. Also in dem Fall hast du wenig Kontrolle, und ich glaube, es ist auch nicht so erfüllend. Aber es gibt Leute, die das auch mögen, sagen, okay, ich bin da, um die Software zu demonstrieren, und das war's. Das kann man ausbilden.",
            "start": 2767238,
            "end": 2840996,
            "confidence": 0.6867467248908297,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Gut, aber so, wie ich dich jetzt verstehe, hast du es ja selbst in der Hand, ob du der Demo-Monkey bist oder ob du wirklich Value lieferst, ne, im Storytelling und im, ich sag mal, technischen Tiefenwissen und so weiter. Du sagst ja schon, du hast sehr viel Freiheiten in dem Job. Kommt auch auf deine Counterparts an. Moment, Account Executives und Business Development Representative, weil ich musste nämlich nachgucken, was, wofür BDR, wofür das A steht. Finde das auch immer schön. Also entweder sind das alles immer englische Terms oder ich habe meine Bingo-Karte voll. Aber ... Nee, Wahnsinn. Also irgendwie habe ich ... ... gerade Lust mehr auf Kommunikation ... ... und auf mehr Sales Engineering, ... ... aber das heißt jetzt nicht, ... ... dass ich jetzt sofort wechseln werde, ... ... aber ich finde es faszinierend.",
            "start": 2841773,
            "end": 2884434,
            "confidence": 0.7141785714285716,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Andi, du darfst weiterhin ... ... unseren Sales machen ... ... für die Werbung im Podcast. Gar kein Problem. Aber das Problem, ... ... was ja auch viele wahrscheinlich kennen, ... ... ist von Side-Projects. Wir als EntwicklerInnen, ... ... wir machen irgendein Side-Project, ... ... ein tolles Produkt ... ... und wenn es dann an Sales geht, ... ... dann merkt man erst, ... ... wie schwierig das Ganze ist ... ... und wenn man eben den Kunden verstehen muss. Da verschrecken ja auch viele zurück, was für mich jetzt wieder ganz charmant klingt, dass ich ja in so einem Umfeld, wo es so eine Rolle gibt, eigentlich gut aufgehoben bin, weil ich eben irgendjemanden habe, der mir den Cold Call macht. Den muss ich ja dann gar nicht selber machen. Also ich kann mir dann eigentlich auf den besseren Teil vielleicht, wenn ich es so sehen will, konzentrieren, fokussieren. auf den technischeren Teil und aber dann trotzdem eben diese generalistische Rolle eigentlich ausfüllen kann. Also so Kunden verstehen, irgendwie die Probleme verstehen, Lösungen dafür zu finden, die Connections zu machen, Connecting the Dots. Also was eigentlich recht viele machen wollen und vielleicht, wenn das Level einfach zu technisch ist, weil man da einfach zu sehr in der Technik dann irgendwie drinnen hängt, dann könnte das eigentlich eine gute Alternative sein. Ich könnte mir das gerade vorstellen für Generalisten, die einfach gerne so, wie du auch erwähnt hast, wenn sie was abgeschlossen haben, können sie zum nächsten Projekt weiterspringen. Wenn man das gerne macht, dann könnte ich mir das eigentlich gut vorstellen, in so eine Rolle zu schlüpfen.",
            "start": 2884454,
            "end": 2968452,
            "confidence": 0.7921412639405201,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Absolut. Also du nutzt dein Wissen als Asset nochmal auf eine andere Weise. Also du diversifizierst sozusagen deinen eigenen Wert. Also dein Wissen ist natürlich auch dein Coding, dein Projekt, das Produkt. Dein Wissen ist aber auch, wie verkaufst du, also wie bringst du, indem du es weitergibst, vielleicht noch veränderst, und dafür als Sales Engineer bezahlt wirst. Und dann gibt es noch einen Tipp vielleicht, und das Thema Muse, auf den ich hatte extrem Glück, muss man sagen, dass das funktioniert hat, weil wir sind tatsächlich IPO gegangen, also wir sind an die Börse gegangen in New York, das ist ja das Ziel der meisten Startups, und das hat für uns tatsächlich funktioniert. Und wir wurden dann von Salesforce gekauft, deswegen war ich auch bei Salesforce. Der Punkt ist, was du machen kannst als Sales Engineer, was du bekommst, sind Optionen am Unternehmen. Und das ist eine mega, mega Möglichkeit, um sich auch finanziell unabhängig zu machen. Und das relativ schnell. Das wirst du als Entwickler so nicht schaffen. Das heißt, du bekommst Anteile am Unternehmen, wenn du zum Beispiel in ein Startup gehst. Okay, hier hast du ein paar tausend Optionen. Wenn dann irgendwann in fünf Jahren wir in die Börse gehen, kannst du die verkaufen. Ich glaube, im Backend ist das nicht so typisch. In der Sales-Rolle eher schon.",
            "start": 2969192,
            "end": 3044549,
            "confidence": 0.7489234234234237,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Der Equity-Anteil auch bei Softwareentwicklern, er wird mehr im deutschen Raum. Ich bin bei dir. Im Dachsektor ist es noch nicht so angekommen. Und bei dem guten deutschen Mittelstand wird es wahrscheinlich auch schwierig mit Anteilen an der Firma. Aber bei, ich sag mal, eher Start-up-Intrepreneuren und US-geführten Firmen ist das auch für Entwicklerrollen mehr und mehr klar. Bei Big Tech sowieso, Google, Microsoft und Co. kriegen auch Software-Engineers Anteile. Aber du hast schon recht, im Bereich Softwareentwicklung ist es noch nicht so weit verbreitet, dass du selbst einen Teil von Equity kriegst. Da kommen wir mal zu einem gewissen Punkt, und zwar geht es nämlich ja auch um Geld. Und zwar hattest du mal in einem anderen Podcast gesagt, auch, dass es eine Karriere on top deiner Karriere ist, aber dass es auch finanziell spannend sein kann. Equity ist natürlich eine Variante, da muss man aber auch sagen, auch eine risikobehaftete, weil das kann ja auch einfach nichts wert sein. Also jetzt gerade zum Beispiel, Die IPO Fenster sind jetzt gerade nicht wirklich gegeben in der Weltwirtschaft, zumindest aktuell. Man hofft, dass es glaube ich dieses Jahr wieder zu ein paar IPOs kommt, weil ein paar Startups in den Startlöchern stehen. Aber das heißt ja, also entweder musst du sehr lange bei einer Firma bleiben, also 5, 8, 10 Jahre. Ja oder es passiert einfach nicht und die die firma übernimmt sich oder oder oder ist ja kein garant dass man wenn man anteile kriegt dass diese dann auch wirklich zu einem liquidität event führen deswegen mal kommen wir mal aufs base gehalt oder auf die auf die commission die man vielleicht kriegt weiß ich nicht wie sieht das denn finanziell aus in der rolle.",
            "start": 3044569,
            "end": 3144595,
            "confidence": 0.795783216783217,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also aus meiner Erfahrung extrem gut. Also bei mir ist es ja auch schon ein paar Jahre her. Was war es denn damit? Als ich bei Musesoft angefangen hatte, ich war vorher kein Sales Engineer, habe ich glaube ich 80.000 Euro Base bekommen. Also 80.000 Euro Grundgehalt plus, also ich sage es einfach mal offen, was das damals war, ist ja eh egal. Ich arbeite ja dann nicht mehr. Beziehungsweise ist die Rolle komplett eine andere und die Firma gibt es ja auch gar nicht mehr in dem Sinne. Genau das war für dachte ich war auch der einzige in dach war tatsächlich der einzige ich habe noch einen account executive kollegen ansonsten habe ich um ganz europa gearbeitet dass es viel auch reise mit dabei ist es viel das sind natürlich auch benefits die manche leute echt mögen dass man auch einfach unterwegs sein kann und bei kunden vor ort. Und mit dem Base-Gehalt gibt es dann auch eine Commission, wie du es schon gesagt hast. Also es gibt häufig einen Team-Anteil und einen persönlichen, individuellen Anteil. Ich glaube, am Ende war ich bei 120.000 mit Commission, als ich eingestiegen bin. Und das ist mal ein gutes Gehalt. Und das ist über die Jahre auch, ich würde sagen, fast stark gestiegen. Es hängt von deinem Erfolg ab. Ich glaube, ich hatte manchmal Monate, ja, ich glaube, ein Jahr waren wir bei 250.000 oder so, wenn du gut erfolgreich bist.",
            "start": 3145135,
            "end": 3217824,
            "confidence": 0.6911000000000002,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich würde nicht sagen, dass es ein gutes Gehalt ist, ich würde sagen, es ist ein exzellentes Gehalt, aber schon eine sportliche Zahl, denke ich mal.",
            "start": 3217864,
            "end": 3224870,
            "confidence": 0.6526153846153846,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Heute am Einstieg bist du, ich kenne es aus dem UK-Markt, wenn du anfängst, bist du bei 60.000 Pfund, das sind wahrscheinlich um die 70.000 Euro oder sowas. Ich weiß es relativ genau, weil wir in unserer Academy gerade viele Ukaler haben. Da sind es um die 60.000, glaube ich.",
            "start": 3224890,
            "end": 3242663,
            "confidence": 0.6989200000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber das ist natürlich auch schon eine hohe Summe. Klar, wenn man jetzt gerade sich eine Penthouse-Wohnung in München kaufen möchte, dann kommt man da sehr wahrscheinlich nicht weit. Aber ich meine, sechsstellig zu verdienen oder zumindest die Möglichkeit zu haben, es ist ja nicht immer nur abhängig von dir, sondern auch vom Team und Co. Aber sofern die natürlich auch einen finanziellen Incentive haben, ist das schon... Kennst du dieses Emoji mit diesem Exploding Head? Das ist schon sehr viel Geld, denke ich.",
            "start": 3243729,
            "end": 3271497,
            "confidence": 0.7320357142857145,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es ist viel Geld für einen extrem stressigen Job, weil, wie gesagt, es geht halt gegen die Natur der meisten Engineers. Das ständig nach außen Gehende, es ist auch viel Last-Minute, man darf das echt nicht unterbewerten. Es ist viel Last-Minute, es ist viel, viel Arbeit, es ist auch über Stunden ohne Ende, weil wenn du im Flugzeug sitzt oder im Zug, dann geht halt nix anderes, ja? Und du wirst viel reisen, du wirst für Kunden vielleicht nachts noch was vorbereiten müssen, weil der AI angerufen hat, morgen ist der Call vorgezogen, weil der Entscheider morgen nur kann, ja? Und dann musst du. Also, du wirst schon auch dafür bezahlt. Also, du bist im Sales, das ist ständig Stress.",
            "start": 3272315,
            "end": 3312994,
            "confidence": 0.7881083333333334,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Fairer Punkt, find ich auch super, dass du das erwähnst, aber ich seh es relativ realistisch. Und zwar, man kann ja nicht erwarten, dass man die Möglichkeit hat, auf eine sechsstellige Summe pro Jahr Und dann 32 Stunden ohne Überstunden. Also du kriegst halt sehr viel Geld, weil du halt sehr viel leistest. Und da muss man ganz einfach auf dem Boden bleiben. Und wenn man das nicht möchte, wenn man das nicht bereit ist, dann denke ich, dann sollte man vielleicht seine eigenen Ambitionen ein bisschen runterschrauben. Oder, weiß ich nicht, vielleicht selbst SpaceX gründen oder ähnliches. Aber da reden wir dann auch nicht über Überstunden.",
            "start": 3313014,
            "end": 3347232,
            "confidence": 0.7832336448598132,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn du da nicht durch diese Schmerzgrenze, durch diese Mauer gehst, Um dich zu verändern, dann wirst du es nicht schaffen, wirst auch kein Sales Engineer bleiben, weil das Unternehmen wird dich nur behalten, wenn du Mehrwert lieferst.",
            "start": 3347272,
            "end": 3361197,
            "confidence": 0.7419210526315789,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Immer wenn ich als Ingenieur neues Tool testen möchte, dann gehe ich in die Trial Period und deswegen frage ich dich jetzt mal nach einer Art Trial Period für Sales Engineers. Ich möchte vielleicht auch intern mehr Exposure zu Sales und Sales Engineering in meiner Organisation haben. Und wie kann ich vielleicht auch das Bedürfnis bei der Sales Abteilung wecken, dass die mich mal mitnehmen?",
            "start": 3361237,
            "end": 3386896,
            "confidence": 0.7757692307692307,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, anbieten ist da genug, weil aus meiner Erfahrung haben wir Engineers immer betteln müssen, dass sie mitkommen. Komm, wir hätten dich gerne mal beim Kunden. Oder halt auch für Proof of Concept mal zu sagen, ich bin, ich stelle mich zur Verfügung, also Manager abklären, ob das zeitlich geht, aber ich stelle mich zur Verfügung, um da mal mitzuwirken. Vielleicht auch, hoffentlich ist der Kunde auch mit dabei, sodass man gemeinsam mit dem Kunden arbeiten kann. Was auch cool ist, ist Desk Research. Bedeutet, wenn ihr seht, dass euer Sales Team mit einem Unternehmen arbeitet, das ihr spannend findet. Blizzard, wenn ich Gamer bin. Ah, geil, wir haben Blizzard vielleicht als Kunden. Dann kann ich doch mal überlegen, okay, aus meiner Sicht, wie würde ich das Blizzard verkaufen? Und dann gucke ich doch mal, welchen Trends ist Blizzard ausgesetzt. Also Desk Research, eine Methode nennt sich die Big Three. Und die drei großen Punkte sind, drei Industry Trends, die Blizzard gerade vor sich hat. Okay, bitte nicht Chat-Jibbiti nutzen, sondern wirklich recherchieren, ja. Dann die drei Zielsetzungen, die Blizzard eigentlich sich selbst setzt, um mit diesen Trends umzugehen. Also was macht Blizzard, um jetzt mit der Affiziation oder sowas umzugehen oder mit Corona damals oder mit, kann ja alles sein, kann Gefahr sein, kann eine Möglichkeit sein, ja. Und dann auf den drei Zielsetzungen, die Blizzard hat, jetzt gehst du in das Produkt und schaust, okay, wie kann mein Produkt diese Zielsetzungen unterstützen? Und dann bist du schon an dem Punkt, wo du eigentlich überlegen musst als Software-Engineer oder als Entwicklerin, Was liefert mein Produkt eigentlich? Was würde ich tun, um es anzubieten? Und wenn du da eine geile Idee hast, geh zum Account Executive, geh zum Sales Engineer und sag, hey, mir fiel da was auf. Wie wär's denn, habt ihr mal überlegt, unser Produkt so und so zu anzubieten? Ich hab da gesehen, bei Blizzard gab's den Post auf LinkedIn oder am Blog, ich hab das gesehen, die hatten das Problem mit Kafka, das hat nicht funktioniert irgendwie und ich hab da eine Lösung tatsächlich. Oder ich weiß, wie wir das in China aufsetzen, weil irgendwie gibt's ja mal ein Thema, dass in China irgendwas nicht so gut funktioniert oder nicht überall verfügbar ist. Also wenn du da als Ingenieur das siehst, geil, hau da rein, biete dich an. Das Sales Team wird das annehmen, bin ich mir sicher. Vielleicht nicht in jeder Opportunity, aber Stück für Stück sich da bekannt zu machen, macht auf jeden Fall Sinn.",
            "start": 3387637,
            "end": 3524905,
            "confidence": 0.7477843601895736,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ganz allgemein ja sinnvoll ist, und das besprechen wir ja relativ oft, dass es sinnvoll ist für einen selbst als Entwickler, Entwicklerin, einfach mal die andere Seite zu verstehen. Und üblicherweise sprechen wir da halt eher so von Product oder Testing oder solche Dinge und Sales wird halt ganz oft ausgeklammert. Aber was wir natürlich auch immer sagen ist, man soll den Kunden verstehen und was gibt es eigentlich besseres als den Kunden zu verstehen, wenn man mal in Sales Gesprächen mit dabei ist und dort mit reingeht. Also ich glaube, das vergisst man sehr oft und ich habe das auch selber erlebt, wenn man mal in so einem Sales Gespräch drin ist. Das ist eine andere Welt und klar, am Anfang ist das ganz was Neues, aber es ist meiner Meinung nach auch eine interessante Welt und da mal näher rein zu blicken, das kann einem einfach, auch wenn man dann gar nicht in Sales reingeht schlussendlich, aber es kann einem so auch schon viel helfen, die ganze andere Rolle zu verstehen und die Zusammenarbeit zu verstehen und im Idealfall oder für dich jetzt vielleicht im Idealfall, findet man das Ganze auch interessant und springt dann in die ganze Sales-Ecke weiter und tiefer rein.",
            "start": 3526286,
            "end": 3586403,
            "confidence": 0.8151073170731704,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Vor allem ist, wie gesagt, es ist eine andere Energie auch in dem Raum. Also wenn man einmal im Sales-Gespräch gesessen hat, weiß man, okay, da herrscht einfach eine andere Atmosphäre, ein anderer Druck, eine andere Energie. Das ist, wo bin ich jetzt? Wie manage ich das? Und das zu lernen, wie man das auch gestaltet, das ist eigentlich so der größte Punkt. Und viel kommt mit Erfahrung auch einfach. Das kann man tatsächlich ganz schwer selbst lernen. Ein anderer Tipp wäre vielleicht noch, nehmt euch Bücher. Es gibt entweder eine Biografie über jemanden, der ein Startup aufgebaut hat oder halt Bücher über Sales Engineering. Legst du mal rein und quatscht den Solution Architect Sales Engineer an und sagt mal, hey, zeig mir mal, was du so machst. Mach mal das CRM auf, also das Customer Relationship Management System und zeig mir mal so einen Account. Was machen wir da? Was sind so die täglichen Doings, die du da hast? Der Sales Engineer freut sich, weil jeder, also nur aus der Sicht, jeder Entwickler, den der Sales Engineer zum Freund hat, ist ein Gewinn. Weil der Sales Engineer ganz oft, krass, der Kunde fragt das, ich kann's nicht beantworten, ich find's im Tool nicht, warum ist da ein Bug, kann man das konfigurieren, was ist das Thema? Und je mehr Zugang ich als Sales Engineer hab ins Backend, umso wertvoller und schneller bin ich. Und das müsst ihr auch verstehen als engineers ihr seid ihr seid der heilige graal des wissens der orga was ich brauche um zu verkaufen und dann möchte ich halt auch hören hey patrick geile idee hab ich noch gar nicht so gesehen. Ich schaue nur ob es geht und nicht ah nee so ist es nicht gedacht.",
            "start": 3586683,
            "end": 3678185,
            "confidence": 0.7329931506849314,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Der gute alte kurze dienstweg.",
            "start": 3678205,
            "end": 3679746,
            "confidence": 0.9092,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Der seltsame und das sieht man dann wenn man es tut software wird nie so verkauft wie sie gedacht ist außer selten vielleicht auch schon also ganz selten.",
            "start": 3681480,
            "end": 3692210,
            "confidence": 0.815857142857143,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Dann verwendet wie sie gedacht wird also wie gesagt da sind viele schritte dazwischen.",
            "start": 3692230,
            "end": 3697275,
            "confidence": 0.7757857142857143,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau das ist es und dieses verständnis kommt aber erst wenn man wirklich mal mit kunden gearbeitet hat und auch die eigene software beim kunden implementiert oder verkauft, Oder die Probleme sieht, wo man halt sagt, okay, ich muss jetzt hier ein Kompromiss machen. Die Software kann nicht so verwendet werden, weil die Organisation des Kunden gar nicht damit, die können das so nicht abbilden. Oder halt die Vorbedingungen, die es gibt, die sind halt einfach da und der Invest des Kunden wäre zu groß, um die zu ändern. Das heißt, unser Produkt muss in Einschränkungen vielleicht funktionieren oder auf dem Henkebein. Erstmal, ja, bis das langfristig umgesetzt wird. Gibt ja verschiedene Möglichkeiten. Aber das führt dann halt zu den Anekdoten im Backend, wie, okay, was haben die denn da verkauft? Das kann ja gar nicht funktionieren. Performanceprobleme, 400.000 Tabellen in einer Datenbank, wie soll das gehen? Aber das entscheidet halt der Kunde und der Deal. Da ist schon eine menschliche Entscheidung dahinter und das ist häufig ein Grund dahinter, den man aber vielleicht erst mal nicht sieht. Und diese Offenheit erst mal zu entwickeln, zu sagen, okay, mir will keiner was Böses, also vor allem auch nicht der Sales, wenn die Produkte nicht ganz genau so eingesetzt werden, wie das Backend denkt, dass sie gebaut oder beabsichtigt sind. Ein letzter Punkt wäre noch das LinkedIn-Profil. Und ich weiß, dass da viel im Kopf auch abgeht. Trau mich nicht. Oder was denken die Kollegen, wenn ich das mache? Oder ja, was habe ich schon zu sagen? Das höre ich schon ganz oft. Auch ein Punkt, den ich tatsächlich auch trainiere. Aber es ist extrem wichtig, wenn man sich in der Rolle differenzieren möchte, also in der Sales-Engineering-Rolle, wenn ihr könnt als Engineers, fangt an, ein Profil aufzubauen. Also schreibt Blogposts, verlinkt sie in LinkedIn und macht ein bisschen Werbung dafür. Also das hättet ihr eigentlich, wie gesagt, einen eigenen Podcast, wie ihr habt. Ihr müsst dafür Werbung machen, ihr müsst damit rausgehen. Es funktioniert besser, wenn ich eine Audience habe, die mich das zeigen kann. Warum sage ich das? Sales Engineers sind introvertiert. Häufig. Nicht alle, tatsächlich. Aber einen Großteil. Und wenn ich zum Beispiel ein neues Produkt-Update oder eine neue Info einfach über mein Feed draufgeben kann, wo Prospects oder Connected andere Leute das sehen, dann muss ich nicht anrufen, ich muss keine E-Mails schreiben, ich muss diese Energie nicht geben, die ich normalerweise geben müsste. Und es baut mein Brand auf und das ist letztendlich unglaublich wichtig, weil du im Wettbewerb stehen wirst mit anderen Sales Engineers. Also wenn ihr mit Ivan irgendwo beim Kunden seid, dann gibt es bestimmt auch noch Google Cloud daneben oder was auch immer oder Kafka Confluent. Und Confluent ist zum Beispiel ein Beispiel. Da arbeitet jemand, heißt Kai Wehner, also ein Phänomen auch im Integrationsbereich. Ich habe ja in Integration gearbeitet. Und 2014 bis 2015 habe ich nicht kapiert, warum ich in Kundengesprächen eigentlich schlecht abschneide. Bis ich herausgefunden habe, dass Kai Wehner, der war bei Tipco zu der Zeit, unglaubliches LinkedIn-Profil, also mega International Speaker, Author, alles mit dabei, irgendwie 5.000, 6.000 Follower. Und ich bin mir relativ sicher, dass in einigen Deals der Kunde auch mal geschaut hat, okay, wer kommt da? Und wenn du dann siehst, ja, Patrick da mit 200 Followern, kein gescheites Profilbild, kein Hintergrundbild und daneben Kai Shining, also wem schenke ich erstmal meinen Vertrauen? Wer hat einen Vorteil? Also, wenn ihr könnt und ihr die Rolle im Blick habt, baut ein Branding auf. Es muss jetzt nicht tausendvoller sein, darum geht's nicht, aber Inhalte sind wichtig. Vielleicht was Provokantes, was mit Einsicht, wo neue Informationen drin sind, vielleicht was Witziges, vielleicht ein Video, wo man euch sieht, sodass man eine Connection aufbauen kann. Je eher ihr damit anfangt, umso besser.",
            "start": 3697315,
            "end": 3914948,
            "confidence": 0.7532267716535437,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und es ist ja, glaube ich, ganz allgemein auch sinnvoll, sowas zu haben. Also egal, in welche Richtung man dann schlussendlich geht. Ich glaube, das ist einfach ein guter Schritt, den man mal machen kann, den man ausprobieren kann, wo man sehr viel eigentlich Kontakt hat mit diesem in der Öffentlichkeit sich zeigen und sich zu öffnen, egal, es ist Berwick Speaking, LinkedIn oder sonst wo. Und das wäre halt dann ein Weg, den man dann weiter verfolgen könnte und dann irgendwann beim Sales Engineering ankommt. Ideal und da ist kein Investment verloren, würde ich mal sagen. Das ist auf jeden Fall super learning, dass man da mitbekommt.",
            "start": 3915922,
            "end": 3947968,
            "confidence": 0.7668425925925928,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Man muss ja auch mal sagen, man fühlt sich auch als Kunde natürlich auch wichtig, wenn eine High-Profile-Person dann sich die Zeit nimmt und allen beruht dran. Klar, man möchte was verkaufen, ich verstehe das, aber wenn dann jetzt der CTO oder wer auch immer da auch kommt, da muss man natürlich, das ist dann schon ja vielleicht so eine gewisse Präsenz auch.",
            "start": 3948008,
            "end": 3964232,
            "confidence": 0.7809365079365083,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja und ich meine, das baut man nicht in einem jahr auf deswegen sage ich eher je besser ich glaube kaya doch mit seinem blog begonnen mit ich weiß es nicht genau aber das sind zumindest mindestens zehn jahre aufwand die da drin stecken sicher.",
            "start": 3964372,
            "end": 3980406,
            "confidence": 0.7565555555555556,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Patrick vielen lieben dank du hast mir auf jeden fall so ein bisschen die vorurteile von sales weggenommen und, Einige Sachen, die du erzählt hast, kann ich auch wirklich nachvollziehen. Und diese Rolle war mir gar nicht bewusst, und ich wusste nicht, was dahintersteckt. Oder ich wusste auch keine Argumente, warum ich als Backend-Software-Engineer in diese Rolle einsteigen sollte. Aber du hast mir auf jeden Fall eine neue Welt gezeigt. Ich bin die Tür rechts noch nie gegangen. Faszinierend. Falls man noch mehr über das Thema wissen möchte, da kann man Geld beim Patrick dafür ausgeben. Also entweder direkt, indem man ein Coaching bucht oder einfach mal eine Session mit dir bucht, aber auch indirekt. Sind Buch-Sales indirekter Geld auszugeben? Ich glaube schon. Und zwar kann man eins der drei oder vielleicht auch vier Bücher von Patrick kaufen. Verlinken wir alles. in den Shownotes. Social Engineer ist das letzte Buch, was du geschrieben hast, glaube ich, von 2021. Ist das richtig? Aber man kann, wenn man auf Videokurse steht, natürlich auch auf Udemy gehen, da hast du nämlich ebenfalls einen Videokurs veröffentlicht. Wie man Patrick kontaktieren kann, auch wieder in den Shownotes. Schreibt ihn ruhig auf LinkedIn an. Er ist da sehr, sehr responsive und wird sich natürlich auch mal auf eure Meinungen freuen. Wolfgang. Wie ist deine Meinung über Sales und Sales Engineering jetzt?",
            "start": 3980426,
            "end": 4062413,
            "confidence": 0.7977288888888882,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich habe gemerkt, wie viel eigentlich, wenn man selbstständig ist, was ich ja bin, wie viel da eigentlich in den ganzen Sales-Style mit reinfließt und dass das eigentlich Sales Engineering ist und vielleicht für Leute, die auch nicht unbedingt sofort selbstständig werden wollen, sondern vielleicht dasselbe Gefühl haben wollen in der Anstellung, ist vielleicht Sales Engineering auch ein guter Guter Job. Also ich glaube, ich sehe da viel Potenzial eigentlich für diese Rolle und ich kann mir auch viele Engineers darin gut vorstellen, also auch die ich so in meiner Laufbahn irgendwie kennengelernt habe. Und darum vielen Dank auch von meiner Seite, um mal dieses komplett andere Gebiet zu öffnen für uns und für unsere Hörerinnen. Hat auf jeden Fall viel Spaß gemacht, vielen Dank.",
            "start": 4062453,
            "end": 4102823,
            "confidence": 0.7781031746031749,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Gerne. Hat mir auch Spaß gemacht. Es ist mir eine Ehre auch da zu sein. Das ist cool. War ein schöner Podcast.",
            "start": 4103497,
            "end": 4108863,
            "confidence": 0.5958636363636362,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das war's für uns von heute bis später.",
            "start": 4108883,
            "end": 4111265,
            "confidence": 0.70575,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Tschüss zusammen.",
            "start": 4111365,
            "end": 4112645,
            "confidence": 0.424,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ciao. Ciao.",
            "start": 4112706,
            "end": 4115908,
            "confidence": 0.6765,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und nicht vergessen, 50.000 Euro Förderung für dein Open Source Projekt in der Medienbranche. Mehr Informationen gibt's in den Show Notes.",
            "start": 4115948,
            "end": 4123716,
            "confidence": 0.7560952380952382,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.754082801518701,
    "audio_duration": 4124.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}