{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/ZKrRAEjWSHeCf8c/download/ep_unmuteit_jobsuche.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 4,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "speech_model": null,
  "id": "4dda557a-189d-4882-bb6b-e0590b327fd7",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Irgendwann kommt der Zeitpunkt, da denken viele von uns, soll ich mir mal was Neues suchen? Ein Tapetenwechsel im Job könnte mir doch mal richtig guttun. Oder das könnte mein nächster Schritt in meiner Karriere sein. Aber die Jobsuche kann anstrengend sein. Im Internet liest man viele Do's and Don'ts. Verwirrung kommt schnell auf, was nun der richtige Weg ist. Genau deswegen sind Erfahrungen von anderen so wichtig. Und genau darum geht es in dieser Podcast Episode. Zu Gast sind Doreen und Ellen vom Unmute It Podcast. Beide haben vor kurzem ihren Arbeitgeber gewechselt und erzählen von ihrer Herangehensweise und ihren Erfahrungen bei der Jobsuche. Wir sprechen über Jobhopping und wann es Zeit ist, sich einen neuen Job zu suchen, wie und wo man nach neuen Arbeitgebern sucht, wie wichtig das eigene Netzwerk und Vitamin B ist, worauf es bei der richtigen Firma ankommt, was Red Flags und Warnsignale sind, über den Interviewprozess, wie viel Glück involviert ist und wie man mit Misserfolgen umgeht. Viel Spaß bei diesem Podcast-Crossover.",
      "start": 4375,
      "end": 65251,
      "confidence": 0.8631715976331358,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Andi, wie viele Episoden haben wir jetzt schon hinter uns?",
      "start": 69804,
      "end": 72888,
      "confidence": 0.7506,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "115, 120, irgendwie sowas.",
      "start": 72898,
      "end": 77394,
      "confidence": 0.66675,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und weißt du, was das größte Problem daran ist?",
      "start": 77434,
      "end": 79517,
      "confidence": 0.737111111111111,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn ich jetzt fies wäre, würde ich sagen, dich jede Woche erneut zu sehen, aber...",
      "start": 79537,
      "end": 83542,
      "confidence": 0.8474666666666667,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Abgesehen davon.",
      "start": 83582,
      "end": 84763,
      "confidence": 0.7735,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wir sind oft alleine.",
      "start": 84783,
      "end": 85624,
      "confidence": 0.9045,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau. Und das große Problem ist, wenn wir alleine sind, dass wir immer miteinander sprechen und mittlerweile fast schon immer am selben Gleis sind mit unserer Meinung. Ist dir das schon mal aufgefallen? Das werden jetzt viele wahrscheinlich nicht verstehen, weil die immer glauben, wir zanken uns ja und sind immer anderer Meinung. Aber eigentlich haben wir eine sehr eingespielte Meinung. Und das ist ein großes Problem, da in unserer Blase zu sein. Und darum machen wir ja unsere, ich würde schon fast sagen, unsere Serie Engineering Kiosk und Friends mit befreundeten Podcasts, um aus dieser Bubble auszubrechen, weil deine Meinung kenne ich ja schon und deine ist leider viel zu ähnlich zu meiner und ich bin ja großer Fan von Diversität und anderen Meinungen, obwohl wir vielleicht in der gleichen Industrie sind, aber gibt es ja trotzdem ganz viele Meinungen. Und darum haben wir jetzt wieder mal eine Engineering-Kiosk & Friends-Episode mit einem unserer Lieblings-Podcasts. Und zwar Unmute IT. Richtig, IT, nicht IT. Habe ich das richtig im Kopf. Mit Dodo und Elton. Willkommen.",
      "start": 86908,
      "end": 148226,
      "confidence": 0.818788571428571,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Vielen lieben Dank. Ich finde es ganz süß, dass ihr es auch befreundeter Podcast nennt, weil so bezeichne ich euch auch immer. Wir freuen uns sehr, dass ihr uns eingeladen habt.",
      "start": 148880,
      "end": 158788,
      "confidence": 0.7322903225806451,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, vielen lieben Dank. Ich freue mich auch generell darauf, jetzt hier irgendwie zu fit mal eine Folge aufzunehmen.",
      "start": 159148,
      "end": 164172,
      "confidence": 0.7772105263157896,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Bevor ich euch vorstelle, warum UnmuteIT und nicht UnmuteIT?",
      "start": 164192,
      "end": 167935,
      "confidence": 0.8425555555555555,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist ein bisschen ein Wortspiel, also un-mute-it, weil es, wenn du es schnell sprichst, klingt wie un-muted, also mit e-d, und un-mute, also, und es soll aber trotzdem irgendwo einen IT-Bezug haben, deshalb un-mute-it geschrieben, aber es klingt eben wie un-muted.",
      "start": 169562,
      "end": 188713,
      "confidence": 0.7586428571428572,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wir haben letztens darüber gesprochen, dass wir aber oft auch quasi un-mute-it sagen, einfach nur, weil es, dann finden Leute uns leichter und sonst ist das irgendwie schwieriger.",
      "start": 188753,
      "end": 198418,
      "confidence": 0.7633571428571427,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Jaja, das klassische SEO-Problem. Aber ich freue mich natürlich auch sehr, dass ihr euch die Zeit genommen habt, bei uns im Podcast hier aufzutauchen. Hallo Dodo, hallo Elden. Ihr beide seid die Hosts von Unmute It, dem Podcast von und über Frauen aus der IT.",
      "start": 198863,
      "end": 219922,
      "confidence": 0.8386666666666667,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Musste ich einmal direkt korrigieren, von und mit Frauen aus der IT. Es ist nicht nur über Frauen in der IT, es ist mit Frauen in der IT. Unser Podcast soll eine Plattform für Frauen-Sternchen sein, um ein Sprachrohr zu bieten.",
      "start": 219942,
      "end": 237242,
      "confidence": 0.8360487804878051,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das ist wundervoll, weil diesen Text habe ich nämlich kopiert von euch.",
      "start": 238383,
      "end": 242707,
      "confidence": 0.7981666666666666,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist mein Fehler, ich glaube, ihr habt das ausgebessert. Wir hatten in der Vorbesprechung ja schon mal so die Diskussion, ob das mit, über, von, für Frauen ist. Und die hatte das scheinbar falsch im Kopf. Also ist in dem Fall mein Fehler.",
      "start": 244168,
      "end": 257807,
      "confidence": 0.7545681818181819,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also, ich habe den Text kopiert von podcast.de. Da gibt es auf der rechten Seite eine Beschreibung von euch. Und da steht wirklich der Podcast von und mit Frauen aus der IT. Vielen Dank, Wolfgang, für dieses Fettnäpfchen. Wie dem auch sei, ihr releast alle zwei Wochen eine Folge. Und euch findet man natürlich überall da, wo es Podcasts gibt. Aber warum macht ihr zusammen einen Podcast? Wie habt ihr euch kennengelernt? Nach einer intensiven LinkedIn-Recherche habe ich festgestellt, ihr habt 2018 bis 2020 bei demselben Arbeitgeber gearbeitet. Und ich gehe stark davon aus, dass ihr euch da kennengelernt habt.",
      "start": 258548,
      "end": 292595,
      "confidence": 0.7450800000000001,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist richtig.",
      "start": 292635,
      "end": 293395,
      "confidence": 0.4303333333333333,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Dodo, du arbeitest inzwischen als ... Oder du kommst aus dem Bereich Data Science und arbeitest inzwischen als Machine Learning Ops Engineer. ML Ops Engineer. Heißt ML Ops Engineer Machine Learning Ops Engineer?",
      "start": 295260,
      "end": 308171,
      "confidence": 0.7131515151515151,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich würde sagen, ist richtig so. Ist ein fancy Wort für Data Engineering. Ich mach nämlich aktuell gar kein Machine Learning und hab auch schon länger keins mehr gesehen.",
      "start": 308532,
      "end": 317560,
      "confidence": 0.7620999999999998,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Und das tust du seit August, also knapp acht Monate, bei der Firma 1,5 Grad. Elton, du bist Senior Software Engineer und, Achtung, bist seit zwei Monaten bei der Firma 1,5 Grad.",
      "start": 318127,
      "end": 332656,
      "confidence": 0.8248125000000001,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist auch richtig.",
      "start": 332676,
      "end": 334657,
      "confidence": 0.739,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was euch zu den perfekten Kandidaten macht über das Thema, was wir heute besprechen wollen. Und zwar Jobsuche, Firma finden, einen neuen Arbeitgeber finden, et cetera.",
      "start": 334697,
      "end": 346845,
      "confidence": 0.8537692307692308,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Vor allem bin ich auch froh, mal jemanden zu haben, mit dem man darüber diskutieren kann, was denn wichtig ist, wenn man einen Job sucht, die ideale Firma, weil Andi schaut ja immer nur aufs Geld und das ist das Wichtigste für ihn, dass wir da mal eine andere Meinung auch reinbekommen.",
      "start": 347545,
      "end": 360843,
      "confidence": 0.7483653846153846,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sehr gerne, deswegen sind wir hier.",
      "start": 361464,
      "end": 362626,
      "confidence": 0.31449999999999995,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ihr wart ja vor kurzem in der, kann man Sachlage sagen, ich glaube schon, ihr seid ja gerade in der Situation gewesen, wo ihr euch auf Jobsuche begeben habt. Deswegen fangen wir mal ganz vorne an, nämlich bei dem Samen, der irgendwann gepflanzt wurde, ich muss mir was Neues suchen. Ab wann hat es bei dir angefangen, Dodo, dass du darüber nachgedacht hast, vielleicht sollte ich mich mal umschauen.",
      "start": 441477,
      "end": 465133,
      "confidence": 0.7732173913043477,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich habe in meinem bisherigen Berufsleben hauptsächlich in Start-ups gearbeitet. Und wie das in Start-ups so ist, ist manchmal mehr und manchmal weniger Geld da. Und in meinem letzten Start-up war dann ab einem bestimmten Zeitpunkt auch weniger Geld da. Und dann haben sie meinen Kollegen entlassen und noch so ein paar andere Kolleginnen. Dann war das Geld so knapp, dass sie angefangen haben, die Firma zu verkaufen. Dann war halt irgendwie Schluss mit allen Projekten, mit allem, was man so machen wollte. Es war quasi alles darauf ausgelegt, die Firma zu verkaufen. Sie wurde auch erfolgreich verkauft. Und ich war dann auch alleine in meinem Team. Und irgendwie war das nicht mehr das, was ich wollte. Und auch so, sie haben das halt an eine indische Advertising-Technology-Firma verkauft. Und das war jetzt nicht, also Werbung ist jetzt nicht direkt das, was ich mein Leben lang machen möchte. Dann hatte ich so ein bisschen geguckt und mich auch bei mehreren Sachen beworben. Ich war dann in einem Bewerbungsprozess von Google und das wurde aber dann nichts, weil Google auch Layoffs hatte. Der Mensch, der mich bei Google interviewt hat, meinte dann aber so, hey, ist jetzt hier nichts geworden, aber ich kenne dann so eine andere Firma, hättest du nicht da Interesse? Und dann habe ich mit der CTO von 1,5 Grad gesprochen und war so, ja, ist cool. Ich will irgendwie eh nicht mehr da bleiben, wo ich bin. Und dann ging das sehr schnell tatsächlich.",
      "start": 465962,
      "end": 540078,
      "confidence": 0.7819068825910932,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Du wurdest also wirklich von Google direkt weitergeleitet.",
      "start": 540618,
      "end": 542979,
      "confidence": 0.7494999999999999,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau.",
      "start": 543419,
      "end": 546981,
      "confidence": 0.6015,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ist auch das erste Mal, dass ich so eine Story höre. Das bedeutet aber auch, dass deine vorherige Firma beziehungsweise mehr oder weniger von der sogenannten Lay-Off-Geschichte betroffen war, richtig?",
      "start": 547021,
      "end": 556306,
      "confidence": 0.7430333333333331,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, genau.",
      "start": 556746,
      "end": 558126,
      "confidence": 0.45099999999999996,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "War das dann schon für dich klar, dass du da was anderes willst im Sinne von Produkt, dass das auf jeden Fall irgendwie ein anderes Produkt sein muss oder irgendein Produkt, was dir besser gefällt als jetzt Werbung?",
      "start": 558146,
      "end": 569892,
      "confidence": 0.7993157894736841,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Tatsächlich, als ich da angefangen habe, fand ich das Produkt ganz cool. Daran, woran ich hauptsächlich gearbeitet habe, war das Einbauen von so Umfragen in Onlinezeitungen. Also ich habe dann quasi Maschinenlernen gemacht und man konnte auch relativ viel mit dem Text machen. Also dann irgendwie so Vektorsuchen zu machen, Ähnlichkeiten erkennen. Dann haben wir so ein kleines Optimierungsmodell da drauf gesetzt. Und die Arbeit an sich war sehr, sehr vielfältig. Und dadurch, dass das Produkt an sich relativ klein war, konnte man quasi End-zu-End alles Wir hatten irgendwie so fünf Modelle, die unterschiedliche Sachen optimiert haben, die wir immer wieder angepasst haben. Und die Arbeit an sich hat sehr, sehr, sehr viel Spaß gemacht. Ich glaube, womit ich mich dann nicht so engagieren konnte, ist, dass quasi mein Aufgabenbereich dann kleiner geworden wäre im Endeffekt, weil je mehr man quasi so Performance-Marketing macht, desto weniger wird halt in-house, da sitzt dann so eine Data Scientist da und darf irgendwelche kleinen Modelle da deployen. Sondern es war halt schon viel auch darauf ausgelegt, diese journalistischen Umfragen irgendwie besser auszuspielen. Und ich habe da total viel gelernt, vor allem, weil wir quasi diese Machine Learning Pipeline End-zu-End irgendwie betreut haben. und man dann die Freiheit hatte, da alles einzubauen, was man wollte. Aber jetzt quasi, wenn du immer mehr Werbung ausspielst und das immer mehr irgendwie quantifizierst und auch so, dass dann Leute das selber buchen können, dann habe ich damit ja wenig zu tun. Und dann ist auch quasi für mich nicht mehr oder habe ich nicht mehr gesehen, wo mein Entwicklungspotenzial ist. Und deswegen bin ich eigentlich gegangen. Also ich hatte, ich wusste nicht mehr, was ich da lernen soll und wie ich mich da weiterentwickeln kann. Und dann wollte ich woanders hin.",
      "start": 570747,
      "end": 660882,
      "confidence": 0.7819285714285708,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Elton, du warst bei deiner vorherigen Firma auch ein bisschen länger als drei Jahre. Ab wann war bei dir der Zeitpunkt, wo du gesagt hast, drei Jahre sind jetzt, waren drei schöne Jahre, aber schauen wir mal woanders, wo es auch schön ist.",
      "start": 661327,
      "end": 676002,
      "confidence": 0.7412558139534883,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich kann da direkt an den Punkt anknüpfen, den Doreen hatte, nämlich was für mich entscheidend ist, wie sieht meine Lernkurve aus? Also drei Jahre sind für mich, ich bin eine sehr treue Seele, eigentlich schon relativ kurz. Also ich war bei Jobless vorher fünf Jahre oder knappe fünf Jahre, je nachdem ob man Werkstudentin damit rein zählt. Bei beiden Jobs war für mich die Suche nach mal wieder dieser Lernkurve einen steileren Anstieg verpassen der Grund. Also bei Joblift war es damals, es ist immer so gewesen, dass ich immer noch viel gelernt habe, aber eben nicht in dem Maße, den mir ein Jobwechsel geben würde, also so ein bisschen die Suche nach tatsächlich technisch mehr lernen, die mir dann gesagt hat, okay, ich suche mir jetzt ein neues Umfeld, in dem ich wieder neue Impulse kriegen kann.",
      "start": 676430,
      "end": 725900,
      "confidence": 0.8023956834532375,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber oft hat man ja solche Herausforderungen ja auch, wenn man, ich sag mal, das Team innerhalb der Firma wechselt, ja, wenn man zum Beispiel mal das Produkt wechselt, wenn, sofern es dann eine größere Firma ist, ja, vorausgesetzt, Genau, da hätte.",
      "start": 725920,
      "end": 739749,
      "confidence": 0.8135238095238095,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich jetzt direkt mal eingehakt, weil Joblift hatte nicht so viele Techies, das heißt, Team wechseln wäre schon gegangen, aber das wäre jetzt auch nicht der Bereich gewesen, in dem ich mehr lernen wollte. Also bei Joblift war es am Anfang vor allem, okay, mal raus aus diesem Meta-Suchmaschinenumfeld und wirklich auch technologische Entscheidungen treffen, weil natürlich technologisch, ja, wir haben eine Microservices-Landschaft gehabt und das war schon alles sehr Komfortzone für mich, also alles, was wir da genutzt haben. Und auch sehr gesettelt im Sinne von, wenn man neuen Microservice baut, dann nimmt man eher das, was es da halt schon gibt. Wegen Technologie-Pluralismus vermeiden und so. Und halt auch die Job-Domäne, in der ich dann ja schon ewig unterwegs war. Was auch so ein bisschen bedeutet hat, also das ist auch der Grund dafür, warum ich dann in eine Firma gegangen bin von Produktentwicklung zu Projektentwicklung. Um eben innerhalb derselben Firma die Domäne wechseln zu können. Also ein Projekt in Domäne Finance, das nächste Projekt dann in der Domäne VR zum Beispiel. Das war dann ein bisschen mein Fokus. und ein bisschen mehr grüne Wiese und prototypische Entwicklung, die ich dann bei Orbit vor allem mitgenommen habe.",
      "start": 739769,
      "end": 808594,
      "confidence": 0.8155778894472364,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber es war immer dasselbe Team, oder war das Team dann auch unterschiedlich, je nach Projekt?",
      "start": 809055,
      "end": 814378,
      "confidence": 0.4863125,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Es war nicht immer dasselbe Team, aber die Arbeitsweise schon. Also Orbit arbeitet nicht so, dass es Body-Leasing-mäßig die einzelnen Personen verkauft, sondern Orbit verkauft schon die Arbeitsweise auch mit. Also es war immer ein cross-funktionales Team, aber die einzelnen Personen wurden dann, je nachdem, Was für ein Projekt es dann auch war, zusammengeschmissen, in sinnvoller Weise natürlich. Zusammengeschmissen klingt jetzt so salopp.",
      "start": 814418,
      "end": 836754,
      "confidence": 0.7769523809523812,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Da kann ich mitfühlen. Nach zwei Jahren mit dem Andi hätte ich auch gern mal wieder einen Wechsel. Aber um nochmal zurückzukommen auf deine drei und fünf Jahre, weil du gesagt hast, du bist eine treue Seele und drei Jahre sind eigentlich zu wenig. Gibt es für dich irgendwie ein Limit oder irgendwas, wo du sagst, okay, eigentlich sollte man schon ein paar Jahre bei einer Firma bleiben?",
      "start": 836774,
      "end": 856667,
      "confidence": 0.7562058823529414,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich würde jetzt nicht sagen, dass es da eine Regel gibt. Es kommt vielleicht ein bisschen darauf an, wenn ich jetzt eine Aussicht von, ich bin bei einer Firma und gucke mir den CV von einer Person an, dann werde ich schon ein bisschen, mir fällt gerade das deutsche Wort für suspicious nicht ein, schon ein bisschen...",
      "start": 858006,
      "end": 874603,
      "confidence": 0.7544912280701754,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Stutzig.",
      "start": 874623,
      "end": 875564,
      "confidence": 0.702,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Stutzig, danke.",
      "start": 875604,
      "end": 876845,
      "confidence": 0.81,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich musste auch googeln.",
      "start": 876905,
      "end": 877766,
      "confidence": 0.5435000000000001,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Dann werde ich stutzig, wenn das eine Person ist, die innerhalb der letzten drei Jahre dreimal den Job gewechselt hat. Also stutzig im Sinne von, ist das eine Person, die wir in unserem Team brauchen? Weil häufig, zumindest war das bei den Firmen so, für die ich gearbeitet habe, sucht man da schon auch noch Personen, die man nicht gerade erst anlernt und dann sind sie wieder weg. Aber ich bleibe jetzt auch nicht bei einer Firma. Ich glaube, das ist dann das Gefährliche, wenn man bei einer Firma bleibt, nur um mindestens ein, zwei Jahre da abzusitzen. Das stelle ich mir äußerst frustrierend vor.",
      "start": 880409,
      "end": 910553,
      "confidence": 0.8234571428571429,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe vor kurzem mit jemandem gesprochen, der ist Engineering Manager oder Director Level, also Manager von Manager. Und da fiel so das Wort Mindestverweilzeit. Wie lange muss man mindestens in einer Rolle bleiben, sodass es auf dem CV nicht so aussieht, als hätte man keinen guten Job gemacht. Und da wurde so der wert von zwei jahren genannt zumindest im engineering management bereich oder director bereich ob das jetzt war es oder nicht kann ich gar nicht sagen klingt aber ein bisschen plausibel weil du hast ja gerade auch gesagt okay jemanden der ich sag mal schnelles job hopping macht zwei drei vier mal da kann man auch suspicious werden ich nutze jetzt auch mal das englische wort Und okay, sich dann überlegt, okay, springt der dann sofort wieder weiter, wenn diese Person gerade geonboardet wurde. Deswegen, wenn man den CV sieht, nimmt man ja schon eine Art wertende Haltung ein, wenn ich das jetzt gerade richtig verstanden habe, oder?",
      "start": 911332,
      "end": 963719,
      "confidence": 0.7932360248447204,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Schon, also man versucht ja schon zu, ich meine Entwicklerinnenzeit ist teuer, man versucht schon ja diese Leute zu interviewen, wo man denkt, okay, das könnte potenziell passen. Nichtsdestotrotz würde ich meinem Gegenüber, also ich persönlich, ich würde die Person, die wir einladen, dann fragen, hey, was ist denn da passiert? Also gerade wenn das so eine Station ist, die nur ein Jahr lang war, gibt es wahrscheinlich einen Grund dafür, wenn die anderen länger waren.",
      "start": 963739,
      "end": 985949,
      "confidence": 0.7656710526315792,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Würdet ihr, wenn ihr jetzt nach sechs Monaten die Firma verlässt, statt dem Step im CV irgendwie Weltreise oder so reinschreiben? Glaubt ihr, dass das besser wäre?",
      "start": 985989,
      "end": 995177,
      "confidence": 0.7767037037037038,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich würde es nicht machen. Ich würde vielleicht maximal sagen, wenn das jetzt so eine kurze Geschichte ist von in der Probezeit rausgeflogen, dann würde ich dazu, also vielleicht würde ich dann eine Erklärung in meinen CV direkt mit reinschreiben. So ein Zusatz von, passte beidseitig nicht oder so. Ich meine, auf dem CV kann man ja auch ein bisschen was erklären.",
      "start": 995725,
      "end": 1015573,
      "confidence": 0.7329193548387097,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Würde ich auch machen. Es kommt ein bisschen darauf an. Ich finde, wenn es jetzt nur so zwei Monate ist und dann man feststellt, das ist wirklich überhaupt nicht das, was ich mir vorgestellt habe oder von der anderen Seite auch, dann kann man vielleicht das irgendwie weglassen, gerade wenn das jetzt zwei Stationen oder so zurückliegt. Aber sonst sechs Monate würde ich drin lassen. Und meistens gibt es ja dann auch einen guten Grund, warum das nicht gepasst hat. Und dann ist das ja auch eine relevante Information für das Unternehmen und für die Person, wo ich mich bewerbe, finde ich.",
      "start": 1016250,
      "end": 1043738,
      "confidence": 0.8225588235294116,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Jetzt sprechen wir über eine Mindestverwaltzeit, über die kurze Zeit. Da gibt es auch das andere Extrem, man ist zu lang bei einer Firma. Was würdet ihr sagen, ab wann ist man zu lang bei einem Arbeitgeber? Gibt es überhaupt zu lang? Dodo, die Frage geht vielleicht an dich.",
      "start": 1044586,
      "end": 1057343,
      "confidence": 0.7586326530612245,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich finde, es gibt zu lange. Ich werde auch immer suspicious, wenn Leute zu lang irgendwo sind.",
      "start": 1057675,
      "end": 1062898,
      "confidence": 0.7877647058823529,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Echt?",
      "start": 1063318,
      "end": 1064179,
      "confidence": 0.703,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, weil für mich ein Jobwechsel auch immer damit einhergeht, dass man viele neue Sachen lernt und auch viele neue Sachen gesehen hat. Also jetzt auch irgendwie in unserem Bereich verschiedene Technologien, verschiedene Architekturen. Wenn man dann jetzt neun Jahre zum Beispiel bei einer Firma war, dann hat man ja auch viel dasselbe gesehen. Und natürlich kann man dann in größeren Firmen auch irgendwie wechseln und da auch neue Sachen sehen. Aber vielleicht hat man das auch nicht gemacht. Vielleicht hat man es sich da sehr bequem gemacht. Und dann bin ich immer so, das ist eine Person, die sehr bequem ist.",
      "start": 1064219,
      "end": 1094678,
      "confidence": 0.7394117647058822,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber kommt das nicht total drauf an? Also so die Standardantwort? Ja, natürlich. Ich meine, das ist ja wie, wenn du... Machen wir mal eine Dating-Analogie. Du fängst an, dich zu daten, und die eine Person kommt halt aus einer Langzeitbeziehung von zehn Jahren, und die andere Person wiederum hatte irgendwie, weiß nicht, drei Beziehungen, die alle drei Jahre waren, und dann wieder eine. mit so On-Off-Beziehungen oder so. Ich finde, es kommt immer voll auf den Kontext und vor allem auf den Charakter der Person an. Deswegen ist es mir persönlich nicht so ein wichtiges Kriterium.",
      "start": 1094698,
      "end": 1125446,
      "confidence": 0.7526185567010308,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also meiner Meinung nach muss man das halt auch dementsprechend im CV reinschreiben, weil das beste Beispiel hatten wir in Episode 12 mit dem Don Bartel über das Manager-Pendulum, der wirklich Product Owner war, in HR gegangen ist, Manager war, jetzt ist er Director und immer in derselben Firma. Aber der hat einfach so viele Jobs durchgemacht und bei einer großen Firma geht das halt auch, dass er zu mir zumindest mal gesagt hat, er hat immer was Neues gelernt und Dann ist es meiner Meinung nach vollkommen okay, aber dann sind es halt ganz viele Positionen innerhalb der Firma, und dann wechselst du ja auch deine Position sozusagen.",
      "start": 1126308,
      "end": 1163180,
      "confidence": 0.8363394495412846,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das, was der Wolfgang gesagt hat, da wurde ich explizit darauf angesprochen, als ich zu meiner aktuellen Firma gewechselt bin. Ich war neun Jahre bei meinem vorherigen Arbeitgeber, und dann wurde ich zum Interview eingeladen, und einer der ersten Fragen war, bist du vielleicht nicht ein bisschen eingerostet nach neun Jahren? Also, salopp gesprochen, ja? Also, wurde ein bisschen durch die Blume gefragt, aber im Endeffekt wurde das gefragt. Und da musste ich halt auch ich sag mal mehr oder weniger erklären dass ich innerhalb der neun jahre verschiedene positionen hatte damit ich halt nicht so ich sag mal stur war und oder so eingefahren und das muss ich zugeben ist eine faire frage wenn ich neun jahre lang einen und denselben job gemacht habe, in derselben position ich sag mal ohne eine mögliche beförderung unabhängig davon ob ich eine beförderung anstrebe oder nicht sondern wirklich ich mache neun jahre lang projektentwicklung keine ahnung gibt es neun reaktion neun jahre ich weiß es gerade nicht aber ihr wisst was ich meine dann muss man halt schon fragen okay wie dynamisch ist die person denn ja in einem neuen umfeld aber ich denke als ich das dann erklären konnte war alles auch super Andere story ist ich hatte mal ein interview und dann hatte ich ein interview partner das war mit einem großkonzern einer der größten konzerne ich glaube deutschlands der sogenannten schwarzgruppe.",
      "start": 1163200,
      "end": 1237612,
      "confidence": 0.7983965517241385,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und da wurde ... Andi blämt die Schwarzgruppe, glaub ich, jetzt. Nein! Wir warten nur noch auf den Sponsorauftrag, dass wir mal Möwung machen können.",
      "start": 1239764,
      "end": 1249571,
      "confidence": 0.7241200000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die Schwarzgruppe, ich hab enormen Respekt vor dieser Firma. Wahnsinn, was die alles machen, strategisch und so weiter. Und das war die erste Firma, wo ich festgestellt hab, die haben eine eigene Top-Level-Domain. Punkt Schwarz gibt's, es gibt aber auch Punkt Audi und Punkt Aldi. Wie dem auch sei. Da wurde mir gesagt, wenn man 20 Jahre dabei ist, kriegt man ein oder zwei zusätzliche Urlaubstage. Also, das sind halt auch Incentives, ja? Und ... jetzt weiß ich nicht, ob man auf diese Incentives gehen sollte, aber das hat mich dann zum Grimsen gebracht. Auf jeden Fall war die Person dann da, ich glaub, 20 Jahre. Und da ich auch so ähnlich wie du, Dodo, sehr viel in Startups gearbeitet habe, kommt mir das halt völlig surreal vor. Also, 20 Jahre in einer Firma, ich weiß nicht, nichts für mich, glaub ich.",
      "start": 1249591,
      "end": 1294268,
      "confidence": 0.7668169014084507,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das gab es früher in Österreich übrigens auch, dass man nach 20 Jahren automatisch die sechste Urlaubswoche bekommen hat, staatlich irgendwie. Das war geregelt so. Mittlerweile bekommen es, glaube ich, alle nach einer gewissen Jahresanzahl. Also ihr lebt im falschen Land.",
      "start": 1294991,
      "end": 1306766,
      "confidence": 0.7861463414634147,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich kriege auch jedes Jahr einen Urlaubstag mehr. Also nur maximal, also ich habe jetzt 27 und kriege dann maximal 30, aber auch jedes Jahr einen mehr.",
      "start": 1308227,
      "end": 1317413,
      "confidence": 0.8002222222222222,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aha, warum ist das bei mir nicht so? Muss ich meinen Vertrag nochmal genauer lesen?",
      "start": 1317493,
      "end": 1321455,
      "confidence": 0.7386666666666667,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du hast auch sechs Monate Kündigungsfrist, das finde ich auch absurd.",
      "start": 1321475,
      "end": 1325277,
      "confidence": 0.739,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ja, es ist schon recht heftig.",
      "start": 1325317,
      "end": 1326578,
      "confidence": 0.7400000000000001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, gehen wir mal weg von der Mindestverweildauer oder der vielleicht Maximalverweildauer. Gut, Maximalverweildauer ist halt das Leben dann irgendwann. Gut, das können wir dann wahrscheinlich nicht beeinflussen. Aber jetzt stellen wir uns mal vor, wir haben uns alle den Entschluss gefasst. Okay, ich such mir was Neues. Ich muss mal raus aus meinem Hamsterrad. Wie strukturiert geht ihr vor? Was ist der erste Schritt, den ihr macht? Macht ihr LinkedIn auf und schreitet in die Welt? Liebe Damen und Herren, ich suche etwas Neues. Oder Elton, was hast du gemacht?",
      "start": 1327336,
      "end": 1359488,
      "confidence": 0.7432527472527469,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ehrlich gesagt, nein. Ich nutze dafür bisher noch nicht LinkedIn. Also bei meinem ersten Jobwechsel war es so, dass ich eben den ... wusste, dass jemand, den ich von vorher kannte, eine eigene Firma gegründet hat. Das heißt, ich hab ihm geschrieben, wie sieht's eigentlich aus? Also, ganz klassisch übers Netzwerk. Bei dem zweiten Ding war LinkedIn schon involviert, weil ich eine LinkedIn-Nachricht bekommen hab von einer, die in der Personalabteilung bei Orbit gearbeitet hat. Also, sie hat mich wirklich selbst angeschrieben. Und solche Nachrichten beantworte ich generell immer. Also, Recruiter- und Headhunter-Nachrichten ignoriere ich schlichtweg. Wenn mir jemand schreibt, von der Firma und selbst dort arbeitet, schreibe ich auf jeden Fall definitiv immer zurück. Und das war dann meine direkte Anlaufstelle, als ich dann gedacht habe, okay, jetzt muss ich mal von Jobnift wechseln. Projektentwicklung wäre was für mich, da kenne ich doch auch jemanden. Und jetzt bei der letzten Jobsuche war es schon auch so, dass mir so ein paar Firmen über die Tech-Community in Hamburg in Erinnerung geblieben sind, positiv. Und bei denen habe ich dann direkt als allererstes angeklopft.",
      "start": 1360369,
      "end": 1429654,
      "confidence": 0.8056902173913043,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Warum sind dir die positiv in Erinnerung gewesen?",
      "start": 1429674,
      "end": 1432296,
      "confidence": 0.76475,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die eine Firma, weil sie auch sehr viel Community-Events für Frauen in der IT organisiert. Das heißt, darüber habe ich die überhaupt kennengelernt. Es war eine schöne Atmosphäre in der Firma und es klang spannend. Das war das erste Ding. Und das zweite Ding, da kannte ich die Firma über Doreen und wusste ein bisschen was. Und da war es eher so der Purpose, der hinter der Firma und dem Produkt stand. Und darauf hatte ich Bock.",
      "start": 1432866,
      "end": 1461888,
      "confidence": 0.8324415584415584,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das heißt aber, es war immer so irgendwie Öffentlichkeitsarbeit, Außenwirksamkeit von der Firma in der Community eigentlich.",
      "start": 1462776,
      "end": 1469438,
      "confidence": 0.9167058823529413,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja. Oder über Leute, die ich kannte, die bei den Firmen waren.",
      "start": 1469918,
      "end": 1473518,
      "confidence": 0.7998333333333333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was ja auch in gewisser Weise dann Außenwirksamkeit ist in dem Sinne.",
      "start": 1473558,
      "end": 1477759,
      "confidence": 0.8271666666666667,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau.",
      "start": 1478620,
      "end": 1479660,
      "confidence": 0.537,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube, das Fachwort ist Employer Branding hier in dem Punkt. Von daher, falls ihr das mal gehört habt. Wir hatten auch gerade schon den Punkt Rekruter und LinkedIn. Ich glaube, Ellen, du hast die Unterscheidung gemacht bei Rekrutern. Firmeninternen Rekrutern antwortest du und Firmenexternen, also ich sage mal Headhunter, Agencies und Co., die ignorierst du komplett. Und meine Frage ist, warum?",
      "start": 1479700,
      "end": 1506490,
      "confidence": 0.7586935483870966,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich hab das Gefühl, dass Personen, die bei einer Firma arbeiten und aktiv auf Sourcing gehen, sich mehr mit mir auseinandergesetzt haben. Also, wie häufig hab ich von Headhuntern Herr Schwathau bekommen? Ja, ihr CV und ihre Java-Kenntnisse.",
      "start": 1507443,
      "end": 1522648,
      "confidence": 0.8250526315789473,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das Herr ist von so vielen Frauen. Es ist unglaublich. Es hat, glaub ich, wirklich jede Frau schon mal die Erfahrung gemacht in der IT. Es ist wirklich schrecklich.",
      "start": 1522668,
      "end": 1530430,
      "confidence": 0.6532758620689656,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, und dann können die Personen mich gar nicht richtig angeguckt haben. Und jetzt haben leider alle Recruiter, die eventuell einen guten Job haben, das nachsehen, weil erst mal bin ich auch nicht auf Recruiter angewiesen gewesen bisher. Und wenn ich aber sage, okay, jemand von der Firma hat sich tatsächlich die Mühe gemacht, mein Profil anzugucken und zu sagen, hey, die würde in meine Firma passen, nicht weil sie einen Bonus von 20.000 bekommen, wenn ich da anfange, sondern weil sie eben jemanden sucht für die eigene Firma, dann, finde ich, hat das wenigstens eine Antwort verdient.",
      "start": 1530592,
      "end": 1560382,
      "confidence": 0.807316326530612,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Doro, hast du auch so eine Unterscheidung?",
      "start": 1560629,
      "end": 1563090,
      "confidence": 0.2527142857142857,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nicht ganz so hart. Also ich würde sagen, ich antworte so Rekruterinnen auch eher nicht. Aber es kommt auch oft die Nachricht an. Also es gibt definitiv Nachrichten, die auch, sie darf nicht zu lang sein, aber auch nicht zu kurz, nicht zu reißerisch. Und dann muss ich schon das Gefühl haben, dass die Stelle zum Beispiel total auf mich passt. Und manchmal gibt's ja schon irgendwie, dass ich eine Nachricht bekomme, wo ich mir denke, okay, die Stelle ist irgendwie total interessant. Und dann antworte ich da meistens schon drauf. Und am liebsten will ich dann erst die Stellenbeschreibung sehen, bevor man irgendwie telefonieren muss oder so. Weil dann kann ich schon mal so ein bisschen gucken, okay, würde das wirklich passen? Weil ich habe die Erfahrung gemacht, dass wenn man dann mit denen telefoniert oder sich die Stellenausschreibung tatsächlich mal anguckt, dass es dann wirklich im seltensten Fall passt. Und dann will ich nicht eine halbe Stunde mit irgendeiner fremden Person telefonieren.",
      "start": 1563130,
      "end": 1616726,
      "confidence": 0.7999999999999999,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber es ist sowieso unglaublich, wie wenig diese Leute einfach die Profile anschauen, weil da stehen dann irgendwelche Technologien drinnen. Keine Ahnung, woher sie da diesen Match haben von irgendeiner Technologie, wo ich garantiert nichts in meinem Profil drin habe. Also da denke ich mir dann auch immer, so eine gewisse grundsätzliche Recherche könnte ja schon drin sein, den Namen und das Profil so grundsätzlich zu matchen. Aber es ist ein super Tipp, Dodo, was du gesagt hast, mit der Stellenausschreibung nachfragen, weil die wenigsten, vor allem wenn sie nicht exklusiv sind für eine Position, geben dir die Stellenausschreibung, sondern wollen unbedingt telefonieren und das ist eigentlich ein No-Go. Es kostet dir extrem viel Zeit und also wenn die Selbstvertrauen haben, dann können sie auch die Stellenbeschreibung schicken. Oder wenn sie exklusiv sind, ist ja auch nochmal was anderes, weil viele Firmen leisten sich halt einen exklusiven Recruiter, Recruiterin, Und dann kommst du natürlich nur zu dieser Stelle über diese Person, dann ist es natürlich was anderes. Aber die bemühen sich dann meistens auch.",
      "start": 1617405,
      "end": 1674451,
      "confidence": 0.831275862068966,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn ich euch jetzt aber so zuhöre, dann habt ihr mit den klassischen Online-Plattformen, wie zum beispiel step stone oder joblift wollte ich gerade auch eigentlich gar nicht so viel erfahrung oder interesse oder warum lasst ihr als user also ich meine joblift habt ihr ja gemacht wenn ihr so wollt also warum warum ist das.",
      "start": 1674471,
      "end": 1703443,
      "confidence": 0.7782142857142856,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nicht euer, Stimmt gar nicht tatsächlich für mich. Ich hab meinen zweiten, also den Job davor, hab ich einfach über Indeed gefunden. Und ich mag tatsächlich auch Stellenausschreibungen total gerne. Weil man kann eigentlich auch immer ganz gut filtern und dann kann ich auch nach dem suchen, was ich will und kann man auch mal irgendwie nebenher machen und geht eben ein bisschen schneller. Deswegen, ich bin da eigentlich schon ein Fan von. Und manchmal bin ich dann, also sowas wie tatsächlich ein Coverletter schreiben, mach ich dann nie. Das heißt, wenn ich das irgendwie Wenn ich das angeben muss, dann bin ich da sowieso schon raus. Aber ich mag Stellenausschreibungen und ich mag auch so Meta-Suchmaschinen.",
      "start": 1703463,
      "end": 1740469,
      "confidence": 0.73,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ich bin tatsächlich immer eher über die Firma gegangen. Also ich glaube, meine Frage ist nicht, gar nicht so sehr passt der Job zu mir, sondern passt die Firma zu mir und wenn die Firma und ich passen, dann findet sich eine Stelle. Also ich bin da so ein bisschen andersrum unterwegs.",
      "start": 1740529,
      "end": 1755914,
      "confidence": 0.8118076923076927,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Bei mir ist es nur der Job. Also mir ist der Job tatsächlich viel wichtiger als die Firma. Wobei die Firma, wo wir jetzt arbeiten, ist natürlich ganz toll.",
      "start": 1757135,
      "end": 1766357,
      "confidence": 0.7737931034482759,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Man kann es nochmal in den 1,5 Grad verlinken, den wir natürlich auch in den Show nutzen.",
      "start": 1766377,
      "end": 1771739,
      "confidence": 0.574764705882353,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber auch nur, weil du den besseren Vertrag hast, oder? Scheinbar.",
      "start": 1771759,
      "end": 1775259,
      "confidence": 0.772818181818182,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Es kommt darauf an, in welcher Metrik du dich bewegst.",
      "start": 1775279,
      "end": 1777500,
      "confidence": 0.7537,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Jetzt ist es natürlich so, dass Software-Engineers sind halt, ich sag mal, schon in diesem Fachkräftemangel, in dieser Blase mit drin in irgendeiner Art und Weise. Und jetzt wird auch immer gesagt, du musst die ganze Zeit netzwerken, denn circa 40 Prozent aller Jobs werden durch Persönlichbeziehungen besetzt und die kommen gar nicht auf den offenen Jobmarkt. Eine andere Studie sagte, ein Drittel wird über Vitamin B besetzt. Ich hab mal ein bisschen grob gegoogelt, das findet sich alles zwischen 30 und 40 Prozent statt. Inwieweit sagt ihr, dass es war oder dass es nicht war?",
      "start": 1780845,
      "end": 1814313,
      "confidence": 0.7933437499999997,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich kann mir das gut vorstellen. Ich habe, also ich weiß nicht, ob man das jetzt Netzwerk nennen kann, aber ich habe meinen ersten Job auf einem Meetup gefunden. Also ich habe jemanden kennengelernt, der irgendwie bei der Firma gearbeitet hat und der hat mich dann da durch den Prozess geschleust und sich auch sehr für mich eingesetzt. Und eben den zweiten Job über einfach eine Stellenausschreibung und den dritten Job eben, ja, ich weiß nicht, ob man das jetzt auch Netzwerk nennen kann, wenn man da so weiter empfohlen wird.",
      "start": 1814353,
      "end": 1838208,
      "confidence": 0.7721428571428571,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Mitarbeiter würde ich jetzt schon sehr stark zu netzwerk weil jemand ich sag mal stellt ja stellt ja schon seine reputation irgendwie jetzt nicht in frage aber wenn man halt konstant 50 leute pro monat referred dann ist es halt was anderes als wenn man hier und da mal jemanden empfiehlt oder ja.",
      "start": 1839229,
      "end": 1856631,
      "confidence": 0.8344150943396227,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Sowieso gute Frage, was Netzwerk eigentlich ist. Aber ich würde mal Netzwerk so definieren, alles was nicht einfach eine Jobdescription ist, wo ich mich bewerbe. Alles andere, wo ich irgendwie einen Kontakt habe, ist Netzwerk. Egal, was das eigentlich ist, würde ich mal sagen.",
      "start": 1857412,
      "end": 1872554,
      "confidence": 0.7592272727272729,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja.",
      "start": 1872817,
      "end": 1872917,
      "confidence": 0.208,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Und ehrlich gesagt, mir tut die Antwort auf diese Frage auch ein bisschen weh, weil ich hasse Netzwerken. Ich hasse auch Smalltalk. Es zieht mir so viel Energie und trotzdem ist das das, was mir in der Vergangenheit dazu geholfen hat, schnell einen Job zu finden. Und ich war bisher auch nie unglücklich mit meiner Entscheidung. Und ich meine, so ein Netzwerkcheck, das ist natürlich zum einen, kommst du dann in die andere Firma über so ein Referral, wirst du schneller eingeladen, also dieses über den CV abgelehnt werden, das Risiko ist größer. Das heißt, du kannst als Person auch, bekommst die Chance zu überzeugen. Und andersrum habe ich aber auch den Check, möchte ich in dieser Firma arbeiten, ohne dass ich dieses Risiko eingehe, sondern dadurch, dass ich jemanden kenne, kann ich direkt sagen, okay, die Firma könnte für mich auch passen.",
      "start": 1872937,
      "end": 1915742,
      "confidence": 0.7978111888111892,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich würde ja auch sagen, Netzwerk ist jetzt nicht Smalltalk irgendwie. Also nur wenn man sich irgendwie kennenlernt auf einem Meetup und auch über technische Dinge spricht, dann hat man ja auch genau so ein Netzwerk. Also es muss ja nicht immer nur der langweilige Smalltalk sein und vor allem die Absicht, dass ich in Zukunft einen Job habe, spreche jetzt möglichst mit Leuten und mache mir irgendwie ein Netzwerk.",
      "start": 1916210,
      "end": 1936796,
      "confidence": 0.7461428571428573,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, es hilft aber, wenn Smalltalk dir leicht fällt, würde ich sagen.",
      "start": 1936856,
      "end": 1940797,
      "confidence": 0.7713333333333333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Man lernt grundsätzlich leute einfacher kennen das stimmt natürlich ja.",
      "start": 1942273,
      "end": 1946156,
      "confidence": 0.7304000000000002,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber ellen ich glaube du hast gerade einen schönen punkt angesprochen denn ich glaube die die größte hürde ist dass man eigentlich ins gespräch eingeladen wird und die möglichkeit hat, sich zu beweisen beziehungsweise ein paar offene fragen klarzustellen und ich denke persönliche referrals nehmen einem sehr oft diese dieser cv passt gerade nicht weg würde denn was heißt denn ein cv passt sprechen wir gleich auch noch, Aber das ist ja eigentlich mit den heutigen Tools und mit der heutigen Anzahl an Bewerbern und Bewerberinnen auf eine Jobstelle, da wird ja oft technisch auch nachgeholfen. Mit klassischem Patternmatching, Keywordmatching und Co. Und wenn man jetzt nicht Kubernetes drinstehen hat, in einer Stellenausschreibung, wo Kubernetes steht, Dann ist man vielleicht schon raus, wo man vielleicht die Linux Container Technologie und drunter programmiert hat. Nehmen wir mal als Beispiel. Deswegen ist das, glaube ich, schon ein wichtiger Punkt. Wie viele Leute habt ihr denn schon referred, also weiterempfohlen und wann macht ihr das und wann macht ihr das nicht? Du sagtest gerade, dein erster Job kam irgendwie über ein Meetup, weil meine Frage ist, die Person hat ja dann noch nicht mit dir gearbeitet und hat dich dann aber trotzdem weiterempfohlen. Also ich würde da mal gerne ein Gefühl von kriegen, wie ihr das handhabt.",
      "start": 1946196,
      "end": 2025598,
      "confidence": 0.7812009345794396,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich finde das auch risikoreich, weil ich empfehle Leute eigentlich nur weiter, wenn ich, entweder wenn ich die Person ganz gut kenne oder ich denke, dass die Person einen bestimmten Mehrwert für die Firma auch hat. Und aber ich habe auch immer das Gefühl, wenn ich jetzt jemand, empfehle, der die dann nicht so einen guten Job macht, dann fällt das irgendwie auf mich zurück. Und deswegen bin ich da auch total vorsichtig. Also gerade jetzt irgendwie bei unserer Firma, weil uns schreiben schon ab und zu Leute und auch die sich bewerben wollen etc. Und ich bin vorsichtig meistens, würde ich sagen. Und wenn ich jetzt jemanden auf Meetup kennenlerne, dann würde ich die Person vielleicht sagen, okay, hier ist der Link zur Jobbeschreibung, kannst dich selber bewerben. Eher so in die Richtung.",
      "start": 2025898,
      "end": 2068502,
      "confidence": 0.8206740740740737,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ja, ich denke gerade über einen Punkt nach. Also ich glaube, ich bin schon auch vorsichtig, wenn ich eine Tech-Person empfehle, aber wenn ich eine Person empfehle, die ich fachlich sowieso nicht beurteilen kann, da empfehle ich, sobald ich denke, okay, charakterlich finde ich, könnte das passen, hier ist die Person, ihr bewertet jetzt, ob das in die Firma passt. Aber bei Tech-Profilen würde ich auch sagen, da bin ich vorsichtiger. Wo ich auch wirklich viel referre, ist Mentorings. Also ich biete Mentorings für andere Frauen in der IT an. Und wenn ich da merke, also eine hat zum Beispiel, eine meiner Mentees hat bei Orbit angefangen, nachdem ich sie referrt habe, weil ich im Gespräch gemerkt habe, okay, sie sucht nach etwas, das meine Firma ihr bieten würde. Also da auch tatsächlich so ein proaktives Ding von, hey, guck dir doch mal meine Firma an. Und das habe ich tatsächlich jetzt schon mit drei Mentees gemacht. Es ist nicht immer was geworden, aber da reiche ich auch super gerne die Hand, vor allem auch, wenn das juniorige Entwicklerinnen sind. Weil diesen Einstieg als Junior zu finden, das ist irgendwie das Schwierige, finde ich. Am Anfang, gerade Leute, die einen Quereinstieg gemacht haben und ein Bootcamp gemacht haben, bei denen kommt es eigentlich nur darauf an, die brauchen einen Fuß in der Tür. mit tatsächlich einer Juniorstelle, wo sie so ein, zwei, drei Jahre Erfahrung sammeln und dann können die sich wieder selbstständig wegbewerben. Aber am Anfang können die da so ein bisschen Hilfe gebrauchen und da mache ich das total gerne. zu referen, auch wenn ich die fachlich gar nicht so sehr einschätzen kann.",
      "start": 2069478,
      "end": 2157297,
      "confidence": 0.7949090909090913,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Weil der erste Job ist auch der schwerste, finde ich. Also ich bin total dankbar, dass die Person auf die Meetup mich weiterempfohlen hat, weil das hat mir total geholfen in meiner Karriere. Und ich hätte das, ich glaube, sonst, also erstmal hätte ich die Firma nicht gefunden und zweitens hätte ich den Job auch nicht bekommen, glaube ich, wenn die Person sich nicht für mich eingesetzt hätte. Und ich fand das richtig, richtig cool.",
      "start": 2157318,
      "end": 2177435,
      "confidence": 0.7931866666666668,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Also, wenn ich da mal meinen Hiring-Manager-Hut aufsetzen darf. Ich finde es auch eigentlich schade, dass man nicht mehr Leute refert, auch wenn man jetzt gar nicht so einen direkten Kontakt zu denen hat. Weil ich habe gerade kürzlich zum Beispiel auf einem Meetup einen Jungen kennengelernt, den ich dann weiterempfohlen habe bzw. ein paar Firmen angeschrieben habe, ob sie jemanden suchen. Ich habe halt klar dazu geschrieben, okay, ich habe keine Ahnung, wie da technisch drauf ist. Aber er ist ein sympathischer Kerl. Und ich glaube, alleine die Info kann ja schon mehr helfen. Und die ist für mich als Hiringmanager auch wichtig, dass jemand sympathisch rüberkommt, zu einem Meetup überhaupt hingeht, aktiv. Und da bekomme ich schon mehr Informationen als von irgendeinem Recruiter, der einfach mir einen CV weiterleitet. Und der bekommt dann aber irgendwie 20 Prozent vom Jahresgehalt. Also ich habe auch immer probiert, mein Team zu motivieren, dass sie irgendwie Leute herankarrt, würde ich fast sagen, weil die gehen ja sowieso durch den normalen Prozess durch. Und umso mehr Kontakt man hat, umso mehr Leute man bekommt und wenn die sich kennen, umso besser, weil wenn die jetzt absolut unsympathisch sind, dann wird sie hoffentlich niemand weiterempfehlen. Das heißt, ich habe schon eine gewisse Hürde übersprungen und auch wenn es nur ein kleiner Pluspunkt ist, aber auch der hilft schon meiner Meinung nach.",
      "start": 2178256,
      "end": 2252090,
      "confidence": 0.7872907488986786,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wo wir dann bei dem Motto Hire for Attitude, not for Skills wären. Das finde ich einen ganz guten Satz, weil du Fähigkeiten kannst und solltest du deinen Mitarbeitenden ja auch beibringen. Attitude ist halt das, was du nicht so wirklich easy ändern kannst.",
      "start": 2252844,
      "end": 2267675,
      "confidence": 0.7372272727272726,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich würde gerne auf diesen Punkt eingehen. Einen Moment, aber noch einen kleinen Disclaimer bezüglich der Mitarbeiterempfehlung. Es ist üblich in Firmen, dass wenn Mitarbeiter jemanden von außerhalb werben, dass dort ein Referral-Bonus auch eine Rolle spielt, wenn die Person in der Regel dann die Probezeit von sechs Monaten, zumindest im deutschen Raum, von sechs Monaten bestanden hat. Und dieser Referral-Bonus, der kann ab und zu recht happig werden. Also ich habe schon Zahlen von 1.000 Euro bis 10.000 Euro gesehen. Von daher, da gibt's natürlich dann auch einen Incentive, weswegen ein Mitarbeiter dich selbst.",
      "start": 2267695,
      "end": 2303467,
      "confidence": 0.8333263157894737,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Auch ... Ja, aber das hat der Recruiter auch. Der hat noch viel mehr Incentive, irgendwie den CV zu faken und dir möglichst irgendwen reinzudrücken.",
      "start": 2303507,
      "end": 2311355,
      "confidence": 0.70608,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ja, das ist korrekt, aber der Recruiter hat in der Regel nicht so einen großen Hebel wie der Mitarbeiter in der Firma, um direkt den CV zu geben.",
      "start": 2311617,
      "end": 2318643,
      "confidence": 0.7417931034482759,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also, was ich schon auch gemacht habe, die Erfahrung, manche Personen, die haben extrem gerne Leute empfohlen und da kam extrem viel rein, aber da fragt man dann halt einfach mehr nach. Kennst du die Person? Was hältst du von dieser Person? Und dann merkt man ja auch sofort, okay, wie stehen die zueinander? Und kann man ja auch nachfragen, ist das ein Freund von dir? Also, da merkt man ja dann schon auch was.",
      "start": 2318823,
      "end": 2338841,
      "confidence": 0.7204399999999999,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich finde aber auch, also zu diesem Referral-Bonus, ich finde, es ist ein bisschen ein Armutszeugnis, wenn das nicht passiert. Weil es ist ja das größte Kompliment für die Firma, zumindest wenn man da arbeitet, sonst bekommst du den Referral-Bonus ja auch nicht, dass man da Firma machen kann, dass man sagt, es ist total cool hier zu arbeiten, komm dazu.",
      "start": 2339279,
      "end": 2357832,
      "confidence": 0.8038032786885247,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Meinst du, es ist ein Armutszeugnis, wenn du keinen Bonus bekommst?",
      "start": 2358327,
      "end": 2361448,
      "confidence": 0.375,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau.",
      "start": 2361488,
      "end": 2361848,
      "confidence": 0.789,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja.",
      "start": 2362428,
      "end": 2362888,
      "confidence": 0.784,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Also, ich ... Gut, falls das missverständlich war, danke fürs Nachfragen. Ich habe in der Vergangenheit Leute refert. Ich habe da nie einen Bonus für gesehen, und ich fühlte mich nicht sehr gewertschätzt dadurch. Weil ich spare der Firma ja effektiv Geld. Ich spare der Firma das Sourcing, ich spare der Firma Interviews, die Zeit kosten, eventuell sogar Coding-Challenges, die Zeit kosten.",
      "start": 2362968,
      "end": 2385975,
      "confidence": 0.8141774193548388,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber man könnte ja auch sagen, wenn du überzeugt bist von der Firma, dann ist es ja auch in deinem Interesse.",
      "start": 2386593,
      "end": 2391255,
      "confidence": 0.7941428571428573,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau. Ja, trotzdem ist das eine Frage der Wertschätzung, finde ich.",
      "start": 2391675,
      "end": 2396497,
      "confidence": 0.7759090909090909,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das bringt uns eigentlich zum nächsten Thema, weil das, was du gerade gesagt hast, könnte man ja eigentlich schon als Red Flag für eine Firma bezeichnen.",
      "start": 2396537,
      "end": 2405101,
      "confidence": 0.7886923076923077,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wenn es keinen High-Rank-Bonus gibt.",
      "start": 2405121,
      "end": 2406542,
      "confidence": 0.7134,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, so habe ich es jetzt verstanden.",
      "start": 2406562,
      "end": 2408603,
      "confidence": 0.6100000000000001,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich wollte nur nochmal nachfragen, ja. Aber welche Höhe ist dann sinnvoll? Weil ich habe mir das auch immer gedacht, dann kämpft man da jetzt irgendwie um, ist es jetzt 2.000, ist es 3.000 und dann kommt der Recruiter und bekommt irgendwie 20 Prozent vom Jahresgehalt. Und dann war für mich auch immer die Frage, warum streitet man dann um 500 Euro mehr um, wenn der Recruiter eh erst zehnfache bekommt?",
      "start": 2410192,
      "end": 2430195,
      "confidence": 0.700375,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, wobei, ehrlich gesagt, die Höhe ist mir gar nicht so wichtig. Es geht mir eher um die Geste und diese Wertschätzung von, wir sehen, dass uns das gerade Geld gespart hat. Also gut, so ein 20-Euro-Amazon-Gutschein wäre jetzt so, ja, okay, come on.",
      "start": 2431120,
      "end": 2445229,
      "confidence": 0.777159090909091,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ich bin, ich fühle mich auch immer ein bisschen komisch, wenn ich so Kopfgeld bekomme, ehrlich gesagt. Irgendwie fühlt sich das, dann weiß ich nicht genau, was ich damit mache, weil ich habe ja selber gefühlt dafür nichts geleistet. Dann bin ich mal so, habe ich jetzt das Geld verdient, gebe ich jetzt das der Person, die die Probezeit bestanden hat, weil die hat ja effektiv was dafür geleistet, für dieses Geld.",
      "start": 2445269,
      "end": 2464715,
      "confidence": 0.729041095890411,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Es kommt auch darauf an, wie viel du leistest, ob du jetzt wirklich nur den CV weiterreichst oder ob du die Person überzeugst. Ich habe zum Beispiel als Hiringmanager auch immer, wenn jemand empfohlen wurde und der lokal war, dann hat die Person einfach am Abend auf ein Bier vorbeigeschaut und dann war natürlich die Person, die den Referral gemacht hat, auch mit dabei. Also da war dann schon auch natürlich Investment von der Person und Überzeugung und vielleicht Informationen geben und ich hatte auch schon öfters Calls mit irgendwelchen Leuten, die gefragt haben, wie ist denn die Firma und so weiter. Also da investiert man ja schon auch Zeit.",
      "start": 2465880,
      "end": 2498065,
      "confidence": 0.829645454545454,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und vor allem, Doreen, hättest du mich nicht refert, hätte ich nicht bei 1,5 Grad angefangen. Das stimmt. Also klar, ich muss jetzt die Probezeit noch überstehen, aber der Bonus gehört auf jeden Fall dir. Kannst mich zum Essen einladen.",
      "start": 2498125,
      "end": 2510871,
      "confidence": 0.7078249999999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich würde sagen, Kopfgeld ist auch ein sehr harter Begriff.",
      "start": 2511532,
      "end": 2514073,
      "confidence": 0.6342000000000001,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, aber Headhunter ist eigentlich der richtige Begriff, würde ich fast sagen.",
      "start": 2514968,
      "end": 2519030,
      "confidence": 0.6100833333333332,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, aber Headhunter ist ja dann die Berufsbezeichnung und Dodo hat ja Elton jetzt nur refert, weil die sich kennen und weil hoffentlich Dodo auch von Eltons Arbeitsleistung überzeugt ist und cultural fit und so weiter. Also deswegen ist Kopfgeld schon, das Kopfgeld erinnert mich irgendwie a immer an alte Western und b immer an diese Schuldeneintreiber in Amerika. Ja, verstehe ich, was du meinst. Nee, aber ich merke schon, da gibt's auch schon Unterschiede, wie man jemanden empfiehlt. Wie der Wolfgang schon sagte, irgendwie ein Feierabendbier trinken. Oder vielleicht mal einen nicht verbindlichen Call vorher machen versus, ah, ich hab hier einen CV und den trag ich einfach in mein HR-System ein. Ich glaub, da gibt's halt schon Welten, wie man so was sieht. Lass uns mal zum nächsten Punkt springen, und zwar die richtige Firma finden. Und Elton, du hast gerade schon ein schönes Stichwort genannt, Hiring for Attitude. Kannst du uns mal ein bisschen durchführen, was Hiring for Attitude für dich bedeutet?",
      "start": 2519051,
      "end": 2573578,
      "confidence": 0.7281393939393942,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Hire for attitude, not for skills. Dahinter steht eben, dass es charakterlich und von der Einstellung und von der Firmenkultur viel wichtiger ist, dass es passt. Also Skills kannst du beibringen, Attitude ist halt schwergängiger, das zu ändern. Und deshalb würde ich halt auch viel eher, wenn ich jetzt zwei Leute im Bewerbungsgespräch habe, würde ich viel eher die Person nehmen, bei der mir vielleicht der Check bei Next.js fehlt. Dafür passt das charakterlich aber total gut, als die Person einzustellen, wo ich charakterlich ein paar Fragezeichen habe und die hat dafür Next.js Spezialwissen.",
      "start": 2573990,
      "end": 2608963,
      "confidence": 0.818904255319149,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie steht ihr so zu Charakterinterviews?",
      "start": 2609003,
      "end": 2612847,
      "confidence": 0.86,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ach so, Charaktertests und so.",
      "start": 2612927,
      "end": 2614469,
      "confidence": 0.5414,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, nicht unbedingt Charaktertests, aber auch, es gibt ja dann so, je nach Größe der Firma, irgendwie Leadership-Interviews oder sowas in die Richtung. Oder dann wird man nochmal von HR interviewt, also so Culture-Fit-Interviews auch.",
      "start": 2615128,
      "end": 2630561,
      "confidence": 0.8251428571428571,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "So verhaltensbasierte Interviews.",
      "start": 2630581,
      "end": 2632643,
      "confidence": 0.8373333333333334,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also zum Beispiel, wenn dich jemand fragt, gab es schon mal einen Konflikt in deiner letzten Arbeit und wie hast du den gelöst?",
      "start": 2632703,
      "end": 2640490,
      "confidence": 0.8160869565217391,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Solche Fragen muss ich zugeben. So eine Frage stelle ich auch.",
      "start": 2641076,
      "end": 2644318,
      "confidence": 0.850818181818182,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Habe ich auch immer gestellt. Du findest, deinem Gesichtsausdruck nach, findest du die Fragen nicht so toll, oder?",
      "start": 2644558,
      "end": 2650362,
      "confidence": 0.7504444444444444,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich finde die super, tatsächlich.",
      "start": 2650402,
      "end": 2651743,
      "confidence": 0.8504000000000002,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ah, du findest die, okay. Ich hätte den Gesichtsausdruck falsch intensiviert.",
      "start": 2651783,
      "end": 2654645,
      "confidence": 0.40509090909090906,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nee, ich finde die gut. Ich finde, dass man das auch viel faken kann tatsächlich. Aber man hört das ja dann vielleicht auch raus. Und generell finde ich das gut, wenn man solche Sachen abfragt. Also ich bin eigentlich ein Fan davon. Ich finde, mehr Firmen sollten darauf Acht geben.",
      "start": 2656205,
      "end": 2670848,
      "confidence": 0.75476,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "In allen Interviews, wo ich solche Fragen gestellt habe, oder ich habe eigentlich immer solche Fragen gestellt, aber in allen Interviews, die ich bisher erlebt habe, soweit ich das beurteilen kann, so im Nachhinein, die Leute haben das nie gefakt, sondern sogar ganz im Gegenteil. Also meine Lieblingsfrage, die ich sehr gerne gestellt habe, war, wann hast du zum letzten Mal einer Person geholfen? Komplett freigestellt, ganz offen, simple Frage. Und es ist unglaublich, wie viele Leute dann gekommen sind mit Ja, gerade gestern, weil mein ganzes Team ist scheiße und keiner in meinem Team hat irgendeine Ahnung. Und ich muss ihnen ständig helfen. Und das ist eigentlich mein Tagesablauf. Ich muss immer allen helfen, allen nachlaufen. Die sind alle unfähig. Und ich hab mir so gedacht, okay, die meisten checken gar nicht, dass sie das faken könnten.",
      "start": 2671322,
      "end": 2714695,
      "confidence": 0.7921231884057969,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die geben einfach direkt solche Antworten.",
      "start": 2714735,
      "end": 2719776,
      "confidence": 0.6235,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es war nie ein Problem. Zumindest alle, die eingestellt haben, war das okay im Nachhinein gesehen.",
      "start": 2719816,
      "end": 2724998,
      "confidence": 0.7736874999999999,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sehr gute Interviewfrage. Ich würde auch ganz gerne meine Aussage zu Hire for Attitude, Not for Skills nochmal ein bisschen auch in einem anderen Kontext setzen. Ich meine, Skills sind natürlich nicht komplett egal. Ich finde auch immer bei Skills, die muss man auch abklopfen. Was mich dieses Attitude over Skills unterstützen lässt, ist so ein bisschen die Frage, was erzeugt mir als Teammitglied die meisten Schmerzen? Ich habe eher Schmerzen, wenn ich den Charakter der Person, wenn ich damit nicht arbeiten kann. Ich habe viel weniger Schmerzen damit zu sagen, okay, die Skills sind jetzt noch nicht so tief. Aber ich teile voll gerne das tiefen Wissen, das ich dann zum Beispiel habe. überhaupt keine Schmerzen dabei. Und beim Skills anlernen, das muss man natürlich ein bisschen da in dem Zusammenhang betrachten, was für eine Seniorität habe ich denn im Team? Also wenn ich ein Team habe, das zehn Junioren umfasst, zehn Werkstudis oder so, Dann sollte ich vielleicht doch noch mal auf die Skills achten und das nächste Mal eine seniorigere Person einstellen, weil man natürlich auch diesen Lehrauftrag hat. Deswegen vielleicht auch an alle Juniors da draußen, wo wir auch den Punkt Umgang mit Misserfolgen haben, nur weil ihr eine Absage bekommt, heißt das nicht, dass ihr schlecht seid, sondern vielleicht kann die Firma gar nicht den Lehrauftrag euch gegenüber erfüllen.",
      "start": 2725373,
      "end": 2798598,
      "confidence": 0.8026785714285716,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du hast eine Sache gesagt, die war, man möchte ja Leute heiraten, mit denen man sich wohlfühlt oder die gut reinpassen. Ich finde, man muss aber auch aufpassen, dass man nicht nur Leute heirat, die man mag und die, wie man selber ist.",
      "start": 2799087,
      "end": 2812171,
      "confidence": 0.8449069767441862,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Auf jeden Fall.",
      "start": 2812431,
      "end": 2814091,
      "confidence": 0.4163333333333334,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Weil wir mögen alle Leute, die wie wir sind am liebsten und Leute, die den selben Background haben. Selbe Hautfarbe, Selbstgeschlecht, nicht unbedingt, aber ich finde, man muss da total aufpassen. Und je eher man quasi sagt, okay, das ist mein Bauchgefühl und ich mochte die Person einfach, desto eher fällt man in so unconscious bias Sachen.",
      "start": 2814131,
      "end": 2832328,
      "confidence": 0.7844210526315791,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Auf jeden Fall. Deswegen habe ich vielleicht auch den Charakter jetzt ein bisschen als falsches Wort hinzugezogen. Aber die Attitude ist mir schon wichtig. Und ich brauche zum Beispiel Personen mit der Einstellung, neugierig zu sein, zuzuhören, sich selbst über diese unconscious biases auch bewusst zu sein, reflektiert zu sein. Und das ist so ein bisschen das, was ich jetzt eben mit Charakter meinte.",
      "start": 2833367,
      "end": 2856223,
      "confidence": 0.8181718750000001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie würdest du es sicherstellen, dass du möglichst diverse Leute dann hirest, wenn du die Entscheidung treffen müsstest?",
      "start": 2856243,
      "end": 2862968,
      "confidence": 0.7102777777777779,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist jetzt eine sehr geladene Frage. Also ich finde, das Erste, was wichtig ist, ist, dass man sich vorher überlegt, was sind denn eigentlich so meine Kriterien für eine Stelle? Um dann zu sagen, ich will, dass die Person mindestens das und das kann und irgendwie auch so cultural fit-mäßig, was ist mir denn eigentlich wichtig? Und dann nicht so sehr nach Bauchgefühl zu gehen. Gerade im Engineering ist es ja so, dass wenn man einfach nur eine Stellenausschreibung hat, dann sind die Leute, die sich darauf bewerben, sehr homogen, meistens. Das heißt, wenn man eine diversere Gruppe haben will, dann muss man, finde ich, mehr aktives Sourcing, aktives Recruiting betreiben und dann gucken, dass man eine diversere, zumindest, also Leute hat, die sich darauf bewerben, damit man überhaupt diverseren Menschen die Chance gibt. Und dann auch sowas wie in der Stellenausschreibung nicht, also es gibt Studien, dass sich Frauen eher auf Jobs bewerben, also oder eher auf Jobanzeigen bewerben, wo sie alle Kriterien erfüllen und Männer auf 60 Prozent, also wenn sie 60 Prozent erfüllen, dann bewerben sie sich und Frauen ungefähr bei 100 Prozent. Und das ist bestimmt nicht immer so, aber es ist schon so, je weniger Requirements, je weniger Anforderungen man in der Jobbeschreibung hat, desto diverser sind die Leute, die sich darauf bewerben.",
      "start": 2863340,
      "end": 2943955,
      "confidence": 0.817054794520548,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Beziehungsweise nice to haves habe ich schon ganz häufig mal gesehen oder auch selber benutzt, dass man halt sagt, okay, das sind wirklich die Anforderungen und das hier sind die nice to haves.",
      "start": 2944700,
      "end": 2953490,
      "confidence": 0.8125151515151514,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber wenn wir jetzt mal davon ausgehen, es bewerben sich diverse Leute. Was du jetzt auch zuerst gesagt hast, ist, man muss aufpassen an conscious bias, dass man die Leute einstellt, die einem persönlich irgendwie ähnlich sind. Also wie stellst du sicher, dass das nicht passiert in einem Interview, dass du sagst, okay, der ist irgendwie zu weit weg, der ist nicht team fit, das ist ja sogar an die Ausrede oder cultural fit, team fit, weil der ist.",
      "start": 2954118,
      "end": 2975137,
      "confidence": 0.7776835443037975,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nicht so wie ich.",
      "start": 2975157,
      "end": 2975698,
      "confidence": 0.6519999999999999,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also wie probierst du dem zu begegnen?",
      "start": 2976118,
      "end": 2979341,
      "confidence": 0.7914285714285716,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich glaube, wenn man sich darüber bewusst ist, ist das schon mal der erste Schritt. Dann weiß man zumindest, okay, es kann passieren, dass ich das habe und dann kann ich darauf achten. Es gibt auch Firmen und Menschen, die sagen, okay, Quoten sind gut. Also ich meine, Otto zum Beispiel hat eine relativ krasse Quote für Frauen in der IT eingeführt und dann auch krass danach eingestellt. Und da kann man okay sagen, sind jetzt Quoten gut oder schlecht?",
      "start": 2980017,
      "end": 3003171,
      "confidence": 0.8178875,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber du kannst ja keine Quote einführen für Leute, die nicht so sind wie ich. Also klar, vom Geschlecht her schon, aber jetzt rein vom Teamfit, von irgendwie dem Charakter.",
      "start": 3003546,
      "end": 3012435,
      "confidence": 0.7458000000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich meine, Background ist ja schon auch eine Sache. Und ich würde schon sagen, dass du an Hard Facts, also sowas wie, hat jemand studiert, hat jemand nicht studiert, kommt jemand aus Deutschland, kommt jemand woanders her. Ich finde schon, dass das ein einen extremen Einfluss auf den Charakter hat. Und dass wenn du nur, wenn du quasi nicht sagst, okay, ich mag die Person so, ich mag die nicht, wenn du quasi einfach diverse Personen einstellst, dann wirst du auch Menschen dabei haben, wo du sagst, okay, die hätte ich jetzt, die sind jetzt nicht direkt so wie ich.",
      "start": 3012495,
      "end": 3041332,
      "confidence": 0.7566930693069305,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Vielleicht sollte auch nicht eine Person entscheiden, yes oder no. Man kann daraus ja auch eine Teamentscheidung machen und sagen, hey, nachdem wir sagen, fachlich passt das, hast du noch ein Team kennenlernen, wo dann irgendwie fünf Leute dabei sind, die vielleicht auch nicht alle nur Techies sind, sondern mal einen aus UIUX, einen Produktlerinnen. Und dann ist die Entscheidung ja auch schon diverser. Klar, du brauchst irgendwie eine diverse Grundmasse, aber da vielleicht die Entscheidungsgewalt ein bisschen aufzuteilen.",
      "start": 3041833,
      "end": 3067295,
      "confidence": 0.7686075949367089,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das ist, glaube ich, ein super Tipp und habe ich auch immer gern gesehen und gern gehabt, irgendwelche Leute, vielleicht sogar Leute, die man selber gar nicht so gern mag, mit dazunehmen ins Interview, einfach um so eine andere Sicht noch mit reinzubringen oder aus einer anderen Abteilung. Ich glaube, Google, Andi, du hast das immer aufgebracht, der Bar Racer oder so, wie der bei Google heißt, oder einfach so komplett aus einer fremden Abteilung von außen, der noch mal irgendwie checkt, ob wirklich die Latte erreicht wurde.",
      "start": 3067668,
      "end": 3097335,
      "confidence": 0.821034090909091,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, also der Barrier ist ein bisschen was anderes. Es gibt verschiedene Firmen, die haben das Prozedere, dass jemand in den Interviewprozess mitkommt, der in Zukunft gar nichts mit der Person zu tun hat. Das bedeutet, diese Person hat keinen Incentive, um das Team zu verstärken oder ähnliches und somit gar keinen Bias. Und diese Person guckt dann halt oft auf kulturelle Aspekte, Company Values, Attitude, wie wir es erwähnt haben, oder Ähnliches. Jetzt sind wir aber ein bisschen im Gespräch auf die Hiringmanager-Seite, auf die Firmenseite gewechselt. Obwohl wir natürlich auch von der Kandidatenseite kamen. Das bedeutet also auch, dass es für euch wichtig ist, dass ihr während des Interviewprozesses mit mehreren Leuten sprecht und nicht nur mit einer Person. Hab ich das richtig verstanden?",
      "start": 3098115,
      "end": 3145177,
      "confidence": 0.8168650793650797,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, auf jeden Fall. Sonst kann man auch einen ganz schlechten Eindruck bekommen, finde ich, wie das Team tatsächlich ist und ob ich mich da wohlfühlen würde, da zu arbeiten.",
      "start": 3145718,
      "end": 3155081,
      "confidence": 0.8069333333333333,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Wie wichtig ist es euch, dass sie wirklich dann die Leute kennenlernt, mit denen ihr zusammenarbeitet?",
      "start": 3155101,
      "end": 3160743,
      "confidence": 0.8955000000000002,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sehr wichtig. Ich habe tatsächlich in meiner letzten Stelle extra danach gefragt. Also ich wäre, glaube ich, auch eingestellt worden, ohne mein direktes Team kennenzulernen und hatte dann eben gefragt, ob ich, also da hatten wir darüber gesprochen, ob das okay wäre. Und dann habe ich mit den zwei auch nochmal einen Call gehabt.",
      "start": 3160783,
      "end": 3175307,
      "confidence": 0.7626111111111112,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ja, mir ist es auch wichtig. Zum einen auch, damit das Team mich kennenlernt, aber auch andersrum, um ein Gefühl für die Leute und mir die Arbeiten zu bekommen.",
      "start": 3175634,
      "end": 3185878,
      "confidence": 0.7992413793103446,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es gibt halt leider Situationen, wo das die Firma selbst noch nicht weiß. Das hatte ich selber auch oft. Das ist natürlich sehr problematisch, weil die meisten das halt schon wissen wollen. Aber wenn halt die ganze Firma in einer extremen Hiringphase ist, viele Umstrukturierungen hat und du eigentlich gar nicht garantieren kannst, ob in drei Monaten dieses Team genau noch so steht, dann kannst du halt auch wenig versprechen und solltest meiner Meinung nach auch nichts versprechen, weil das dann natürlich enttäuschend ist. Aber ich glaube, das ist schon eigentlich das Minimum, was irgendwie an Info da sein sollte. Wo werde ich schlussendlich arbeiten? Ich hoffe doch mal, dass die meisten das wichtig ist.",
      "start": 3186625,
      "end": 3222106,
      "confidence": 0.7897391304347825,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und mit wem.",
      "start": 3222901,
      "end": 3224882,
      "confidence": 0.38000000000000006,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Für mich wäre das sogar so eine Red Flag ein bisschen, wenn jemand sagen würde, okay, wir wissen noch nicht, wo du hinkommst und wir heiern gerade so viele Leute. Weil dann denke ich mir, okay, habt ihr euch schon überlegt, ob es mich wirklich braucht? Passe ich da wirklich hin? Passt mein Skillset? Und mir ist es schon wichtig, dass es dann tatsächlich eine Stelle gibt, in der ich gebraucht werde.",
      "start": 3224942,
      "end": 3245153,
      "confidence": 0.7740416666666667,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Obwohl natürlich bei stark wachsenden Firmen das natürlich dann schon auch mal so sein kann. Also ich meine theoretisch von deinem Interviewgespräch bis zum Einstellungsdatum hätte sich bei 1,5 Grad ja auch schon eine ganze Menge ändern können. Weil schnell wachsend seid ihr ja aktuell.",
      "start": 3245907,
      "end": 3261984,
      "confidence": 0.7294,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, da hat sich einiges geändert.",
      "start": 3262024,
      "end": 3263366,
      "confidence": 0.6643333333333333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ich finde dann zum Beispiel, keine Leute kennenzulernen, ist ja auch was, weil ich meine, selbst wenn sich die Teamstruktur irgendwie ändert, dann sind es ja immer noch mehr oder weniger dieselben Leute, auch wenn man dann nicht direkt mit der Person zusammenarbeitet. Aber zumindest mal zu sagen, okay, das wäre das Team und natürlich kann sich das ändern, aber hier sind jetzt mal zwei Leute, mit denen könntest du arbeiten.",
      "start": 3266709,
      "end": 3286150,
      "confidence": 0.8276666666666667,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Das Man muss halt auch transparent einfach damit umgehen, glaube ich. Und umso besser die Firma das verkaufen kann, möglichst transparent. Und ich glaube, wenn man das dann versteht, aber trotzdem Leute kennengelernt hat, dann kann das schon funktionieren. Und da gibt es, glaube ich, unterschiedliche Needs. Vielleicht macht das das Alter auch viel aus, aber mir kommt vor, jüngere Leute sind da wesentlich flexibler. Ob das jetzt gut ist, ist eine andere Frage, aber grundsätzlich sind die meisten, die jünger sind, flexibel und die wollen einfach Gas geben und denen ist egal, wo teilweise.",
      "start": 3286591,
      "end": 3317398,
      "confidence": 0.8152421052631579,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ellen, du hattest gerade noch einen Punkt.",
      "start": 3317918,
      "end": 3319079,
      "confidence": 0.22842857142857145,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich wollte eigentlich so ein bisschen dabei einhaken, dass bei dem, also so den Need von, ich muss wissen, dass es einen Platz für mich gibt und eine Stelle, auf die ich passe. Ich glaube, das habe ich gar nicht so doll. Ich habe eher, was mich nervös macht bei einem Jobwechsel, ist eher, was sind das für Leute? Was sind das für Personen? Wie sind die drauf? Und mein Platz findet sich dann schon. Also mir ist wichtig zu wissen, okay, ich darf auf jeden Fall coden. Check. Und danach geht es mir um die Leute, mit denen ich zusammenarbeite. Und dann, wenn das ein Match ist, dann kann ich Herausforderungen wuppen.",
      "start": 3319409,
      "end": 3356468,
      "confidence": 0.807070175438596,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wobei ich natürlich jetzt vor kurzem gelernt habe, dass für eine Softwareentwicklerin der Akt des Programmierens wirklich nur 20 bis 30 Prozent.",
      "start": 3357093,
      "end": 3365838,
      "confidence": 0.8077272727272728,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Der Akt des Programmierens. Das ist ja unglaublich, der Akt des Programmierens.",
      "start": 3365858,
      "end": 3372342,
      "confidence": 0.5415,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die Tätigkeit des Programmierens nur 20 bis 30 Prozent des eigentlichen Tages einnimmt.",
      "start": 3372382,
      "end": 3377985,
      "confidence": 0.7912307692307693,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das kann ich jetzt so nicht bestätigen. Also selbst in meiner letzten Rolle, wo ich auch People-Verantwortung hatte, hatte ich trotzdem, wenn es eine schlechte Woche war, zumindest 40 Prozent. Und bei einer guten Woche hatte ich so 70 Prozent. Ich muss auch sagen, wenn ich vor der Mittagszeit keine Zeile Code geschrieben oder committed habe, dann kriege ich innerlich so ein ... Dann werde ich nervös.",
      "start": 3378520,
      "end": 3403138,
      "confidence": 0.7925223880597015,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "So eine Art hangry. Man ist immer so hungrig und angry.",
      "start": 3404763,
      "end": 3409966,
      "confidence": 0.4556363636363637,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Einfach, weil ich das brauche. Ja, Programmieren hat viel mit Kommunikation zu tun, aber als Ausgleich dazu brauche ich auch Fokuszeit, wo ich einfach mal Code produziere. Das brauche ich, um ausgeglichen zu sein, sozusagen. Also eine Stelle mit 20 Prozent Code würde ich sagen, no, no, das ist nicht meine.",
      "start": 3410006,
      "end": 3428815,
      "confidence": 0.7889803921568629,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und das stellst du auch sicher dann in einem Interview, dass es genauso ist demnach.",
      "start": 3428855,
      "end": 3433357,
      "confidence": 0.6728,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich stelle jetzt nicht die Frage nach den Prozenten, aber ich habe dieses Mal schon klar gesagt, ich möchte den Fokus aufs Programmieren legen und nicht auf Management zum Beispiel. Also für mich ist eher so der Pfad vielleicht auch ganz spannend, diese Unterscheidung zwischen, okay, schlage ich den People-Lead-Pfad ein oder schlage ich den technischen Pfad ein. Für mich ist das aktuell zumindest der Fokus von technischem Fahrt. Und ja, ich lerne auch total gern Leute an, aber ich möchte nicht diese People-Verantwortung und den Overhead mit Urlaubstagen, ja, nein, das möchte ich nicht mehr. Aktuell.",
      "start": 3434115,
      "end": 3468773,
      "confidence": 0.808265306122449,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Da muss ich sagen, Urlaub approven ist jetzt nicht der Overhead.",
      "start": 3468813,
      "end": 3472334,
      "confidence": 0.45445454545454544,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, aber der ganze Rattenspanz, der da dranhängt, so dieses disziplinarische Verantwortung, hab ich aktuell keine Lust drauf.",
      "start": 3472394,
      "end": 3480077,
      "confidence": 0.8121666666666667,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt sind wir in dem Bereich, in Anführungszeichen, die richtige Firma finden. Und da sprechen wir schon eine ganze Menge drüber. Das ist superinteressant. Doch eine Sache, die kam noch nicht auf. Und zwar, was die Firma eigentlich macht. Wie die Firma eigentlich Geld verdient. Und auch, woran man arbeitet. Zum Beispiel bei mir ist es so, ich war mal in einer Agentur. Projektbasierte Arbeit hattest du das genannt, Elton, glaub ich, initial. Irgendwann war ich in einer produktbasierten Firma. Und beide Seiten sind interessant, aber zum Beispiel, wenn es darum geht, was die Firma macht, hab ich so aktuell noch meine Grundsätze. Zum Beispiel würde ich aktuell nicht für Heckler & Koch arbeiten wollen. Wie ist das bei euch? Habt ihr bei der Job- beziehungsweise Firmensuche auch da speziell drauf geguckt, dass ihr irgendwas für, ich sag mal, The Greater Good macht? Oder würdet ihr auch für Online-Glücksspiel arbeiten? Dodo, die Frage geht vielleicht an dich.",
      "start": 3480398,
      "end": 3535618,
      "confidence": 0.7952738853503185,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich würde nicht für Online-Glücksspiel arbeiten, das wäre raus. Ich würde nicht für böse Sachen arbeiten, sowas wie Tabak, Waffen.",
      "start": 3537000,
      "end": 3547190,
      "confidence": 0.8599499999999999,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ölkonzerne.",
      "start": 3547230,
      "end": 3548251,
      "confidence": 0.925,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ölkonzerne, so böse, böse.",
      "start": 3548311,
      "end": 3551234,
      "confidence": 0.8712500000000001,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "No offense an alle Hörerinnen.",
      "start": 3552297,
      "end": 3557981,
      "confidence": 0.711,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und ich habe auch mal für eine E-Commerce Firma gearbeitet und da war ich schon so, ja okay, also das ist jetzt technisch schon spannend, aber jetzt irgendwie, dass Leute jetzt noch mehr auf der Webseite kaufen, weiß ich nicht, ob das jetzt mich auf Dauer als Person erfüllt. Und jetzt arbeiten wir für eine Firma, die auch 1,5 Grad heißt, aber auch Solaranlagen produziert und Wärmepumpen und wo das Ziel ist, zumindest ein bisschen an der Klimakrise mitzuarbeiten und auch ein sehr spannendes Feld ist, eben dieser Energiemarkt. Da kommt das eigentlich alles ganz gut zusammen. Aber ich habe vorher ja für Onlinezeitungen gearbeitet und das fand ich auch spannend, weil ich, also Journalismus ist mir auch wichtig und es muss jetzt nicht immer Klimawandel sein oder es muss jetzt nicht immer die Welt dritten sein und ich muss jetzt nicht für eine NGO arbeiten, aber ich will auch nicht für was ganz Böses und Sinnloses arbeiten, wo ich mir denke, okay, wenn ich jetzt irgendwie meinen Job nicht richtig mache und irgendwie das System down ist, ist es vielleicht sogar ein bisschen besser für die Welt insgesamt.",
      "start": 3558041,
      "end": 3618128,
      "confidence": 0.7947619047619048,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber ist es für dich wichtig, dass du eine Connection zu dem Produkt hast? Dass du das Produkt zum Beispiel selbst nutzt? Oder ist dir das eigentlich gar nicht so wichtig?",
      "start": 3618962,
      "end": 3627246,
      "confidence": 0.7771935483870966,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es kommt drauf an, glaube ich. Also ich meine, ich nutze jetzt unser Produkt auch nicht, weil ich habe kein Haus. Noch nicht. Ich weiß nicht, ob das noch kommt. Ich muss es jetzt nicht selber nutzen. Ich glaube, eine Verbindung hilft schon. Es ist mir nicht mega wichtig, um das jetzt vielleicht zusammenzupassen.",
      "start": 3628147,
      "end": 3647477,
      "confidence": 0.7997777777777779,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Also ich kann euch empfehlen, was du sagst, wiederzufinden. Ich habe auch mal bei einem Onlineshop gearbeitet und dachte mir, ob ich das jetzt mache oder nicht, das ist ja jetzt irgendwie sehr egal für eine kurze Zeit. Oder auch wenn ich Werkstudentin war, war das auch in Ordnung. Da war das nicht so wichtig, dass es erfüllend ist. Dann meine nächste Station war schon so, dass ich das Produkt selbst nicht benutzt habe, weil wir hatten vorhin das Thema Jobsuchmaschinen. Nutze ich eher nicht. Aber trotzdem habe ich den höheren Sinn darin gesehen, für andere diese Plattform zu bauen. Danach bei meiner Zeit in Projekten, da habe ich dann schon auch gemerkt, dass es für mich, also es waren schon Projekte, die einen Sinn hatten und auch einen Impact, also es gab einen Nutzen dahinter. Alles, was eben keinen Nutzen hatte, wurde falsifiziert und auch nicht umgesetzt. Also die Dinge, die wir da in den Projekten gebaut haben, hatten für jemanden einen Sinn, aber mir fehlte total dieser höhere Sinn. Für mich der Unterschied zwischen Impact und Purpose quasi. Ich hab jetzt wirklich explizit nach was gesucht, wo ich denke, ja, ich hab Bock, da jeden Tag für aufzustehen und das zu implementieren. Und das hat im Endeffekt auch das Zünglein an der Waage ausgemacht, wo ich gesagt hab, okay, ich entscheide mich für 1,5 Grad.",
      "start": 3648517,
      "end": 3721637,
      "confidence": 0.811436123348017,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Hat sich das über die Zeit geändert bei euch? Also jetzt vom Alter her?",
      "start": 3721657,
      "end": 3725658,
      "confidence": 0.8019285714285713,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Doch, bei mir schon.",
      "start": 3725678,
      "end": 3726318,
      "confidence": 0.704,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also es ist wichtiger geworden, schätze ich mal.",
      "start": 3726820,
      "end": 3728581,
      "confidence": 0.398375,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich habe am Anfang viel mehr darauf geachtet, was brauche ich für ein Umfeld, um lernen zu können. Und jetzt geht es mir eher darum, was ist das für ein Umfeld? Kann ich das, was ich kann, da gut anwenden? Das beschreibt es vielleicht ein bisschen, wie sich das verändert hat bei mir im Verlauf von Junior zu seniorigeren Stellen.",
      "start": 3728621,
      "end": 3748877,
      "confidence": 0.8295833333333333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie wichtig ist für euch die Technologie?",
      "start": 3748897,
      "end": 3750838,
      "confidence": 0.8530000000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sehr wichtig.",
      "start": 3750858,
      "end": 3751338,
      "confidence": 0.709,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, sehr wichtig.",
      "start": 3751378,
      "end": 3753180,
      "confidence": 0.4630000000000001,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Was versteht ihr in unserer Technologie? Framework, Sprache oder modern Cloud? Ich meine, es sind ja schon drei Spektren.",
      "start": 3754505,
      "end": 3762821,
      "confidence": 0.7257894736842107,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Alles davon, würde ich sagen.",
      "start": 3762881,
      "end": 3765586,
      "confidence": 0.8502000000000001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich auch, alles davon.",
      "start": 3765647,
      "end": 3766368,
      "confidence": 0.66125,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Das ist lustig, weil bei mir war es ganz anders. Bei mir war, am Anfang meiner Karriere war mir das enorm wichtig, dass ich immer mit dem neuen, coolen, heißen Zeug arbeiten, Hacker-news-driven-development und Java-Cloud und was weiß der Geier nicht. Und inzwischen bin ich eher dafür, okay, ich sag nicht, kannst du eine Programmiersprache, kannst du alle, weil das ist natürlich nicht ganz wahr, aber kennt man sehr viele Konzepte von prozeduraler und objektorientierter Programmierung, kommt man schon mal sehr weit, würde ich mal sagen.",
      "start": 3766899,
      "end": 3792488,
      "confidence": 0.7667790697674417,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber es hat jetzt niemand von neuen Technologien gesagt, nur die richtigen Technologien. Nee, das stimmt.",
      "start": 3792868,
      "end": 3797017,
      "confidence": 0.5428125000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da hätte ich auch eingehakt.",
      "start": 3797037,
      "end": 3798119,
      "confidence": 0.6531999999999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Moment, Moment, lass mich ausreden. Inzwischen ist es mir eher wichtiger, woran ich arbeite und die Technologie könnte theoretisch auch Kobol sein. Weil es ist dann immer so eine Sache, nutzt man den Service auch.",
      "start": 3799262,
      "end": 3815566,
      "confidence": 0.8053714285714287,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wie viel programmierst du denn am Tag? Bist du so bei den 20 Prozent? Also wie viel macht der Schmerz denn dann für dich aus effektiv?",
      "start": 3815586,
      "end": 3822888,
      "confidence": 0.7991923076923076,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich programmiere am Tag keine 20 Prozent weniger. Das ist richtig. Das bedeutet, ich habe den direkten Schmerz mit unserer Codebase nicht. Da bin ich auch ehrlich.",
      "start": 3823753,
      "end": 3834523,
      "confidence": 0.8524444444444442,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber um nochmal zurückzukommen auf dieses Junior-Ding. Am Anfang hatte ich nicht das Gefühl, dass ich groß eine Wahl habe, sondern ich hätte im Grunde jeden Job genommen, der irgendwie einigermaßen gepasst hat, wo ich einigermaßen das Gefühl habe, ich lerne das, was ich lernen möchte, weil es gibt nicht so viele Junior-Stellen und auch irgendwie nach zwei Jahren Berufserfahrung hat man jetzt noch nicht die riesen Auswahl. Natürlich, wenn man irgendwie zehn Jahre Berufserfahrung hat und nach Manager, Managerin-Stelle sucht, Dann hat man deutlich mehr Auswahl und dann kann man auch gucken, okay, ja, ich möchte jetzt irgendwas machen, was mir am Herzen liegt. Aber viele Leute haben halt nicht diesen Luxus, finde ich.",
      "start": 3834973,
      "end": 3871309,
      "confidence": 0.8190086956521736,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber du hast gesagt, du wolltest das lernen, was du wolltest. Bezieht sich das jetzt auf die Technologie oder war das mehr so, ich will programmieren, mehr programmieren oder mehr Data Science ganz allgemein?",
      "start": 3871369,
      "end": 3882313,
      "confidence": 0.7913529411764707,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Am Anfang wollte ich eine Data Science Stelle und habe dann aktiv danach gesucht. Und ehrlich gesagt, so kurz nach dem Studium, hatte ich auch ehrlich gesagt keine Ahnung, was das sein soll. Und ich hätte bestimmt auch jede Stelle genommen, wo irgendwie irgendwas mit Data drin stand. Jetzt bin ich schon so, dass ich glaube auch, weil um mich in dem Job wohl zu fühlen und um das Gefühl zu haben, dass ich da irgendwas kann, würde ich auch lieber aktuell irgendwo anfangen, wo ich sage, okay, Grundstock von dem, was von mir erwartet wird, kann ich auf jeden Fall und da fühle ich mich wohl. Und wenn dann neue Sachen dabei sind, dann finde ich das perfekt, dass man so ein paar neue Sachen hat und ein paar Sachen, die ich schon kenne und auch gerne mag. Also zum Beispiel, ich habe ja vorher als Data Scientist gearbeitet und dann mir überlegt oder rausgefunden, dass ich Infrastruktur total toll finde und dass ich gerne mehr in die Richtung gehen würde. Verstehe ich total. Oder? Und dann habe ich aktiv, also nicht aktiv danach gesucht in dem Fall, aber ich wollte schon eher in die Richtung Infrastruktur.",
      "start": 3882722,
      "end": 3943157,
      "confidence": 0.7918181818181821,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ich glaube tatsächlich, eine Sache, die mir noch wichtiger ist, als was für Technologien sind das, was kann ich lernen und was ist das für ein Produkt, ist tatsächlich der Part von Work-Life-Balance und Kultur. Ist das toxisch? Geilen wir uns irgendwie daran auf, dass wir alle zehn Überstunden die Woche machen. Das ist noch der Punkt, der bei mir noch oben drauf kommt. Wenn ich da das Gefühl habe, das ist hier für mich eine Hustle-Kultur, dann helfen mir auch die anderen Punkte nichts. Dann ist das nicht die Firma, zu der ich gehen will.",
      "start": 3943197,
      "end": 3974252,
      "confidence": 0.8572187499999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie findest du das raus?",
      "start": 3974292,
      "end": 3975174,
      "confidence": 0.5913999999999999,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Im besten Fall frage ich danach und klopfe das ein bisschen ab, um die Unternehmenskultur da ein bisschen einschätzen zu können. Oder ich kenne eine Person, die ich fragen kann, wie das so aussieht.",
      "start": 3976982,
      "end": 3989047,
      "confidence": 0.790441176470588,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ein Freund von mir hat mir erzählt, er hat in seinem Interview am Ende dann irgendwie so gefragt, ob er nur 80 Prozent arbeiten kann. Und die Antwort war, naja, ist eher schwierig, weil wir sind jetzt eher so von 50 Stunden oder so ausgegangen, weil wir haben gerade viele Projekte und Überstunden sind eigentlich so der Standard. Also vielleicht kann man es mit solchen Fragen auch einfach herausfinden und wenn man ganz tief geht sozusagen auf Teilzeit, vielleicht kommt dann irgendwie die Antwort, die man eben nicht hören will.",
      "start": 3989107,
      "end": 4020728,
      "confidence": 0.8323444444444447,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Gut ich hoffe das war jetzt nicht Ernst & Young, PricewaterCoopers oder Bain oder einer dieser Big Four.",
      "start": 4022071,
      "end": 4028656,
      "confidence": 0.7161666666666666,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Na da würde man es sich ja erwarten oder da ist es ja eigentlich fast klar, aber es war ein großes Systemhaus also.",
      "start": 4028696,
      "end": 4033881,
      "confidence": 0.7881304347826087,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wie wichtig sind euch die Elemente von dem Buzzword Bingo Work-Life-Balance? Also sagt ihr sagt ihr okay arbeit ist da um miete zu zahlen und ich lasse nach acht stunden den den den stift fallen und ansonsten lasse ich alles neu bezahlen oder sagt ihr so ich arbeite hier acht stunden und das muss schon ich muss schon wohlfühlen muss schon spaß haben und allem drum und dran weil das ist ein essenzieller sind drittel meines tages eigentlich.",
      "start": 4033901,
      "end": 4060280,
      "confidence": 0.7617948717948718,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Für mich muss mein Job auch irgendwie mein Lebensinhalt sein, weil ich verbringe effektiv nicht nur ein Drittel meines Tages damit, ich verbringe die meiste Zeit meines Tages mit Arbeit und das muss mich auch erfüllen und ich muss auch Es darf nicht so sein, dass ich das Gefühl habe, dass es mich auslaugt. Und ich arbeite auch einfach wahnsinnig gern, muss ich gestehen. Und auch, ich hatte meine Zeit lang, während Corona hatten wir dann Kurzarbeit. Und am Freitag habe ich dann an anderen Sachen gearbeitet, aber ähnliche Sachen gemacht. Und das, was ich mache, mache ich einfach wahnsinnig gerne. Und das ist mir wichtig. Und dann muss die Firma und das Umfeld das hergeben, dass ich meinen Job einfach gerne mache. Und dass das Arbeiten sich für mich ein Stück weit wie Freizeit anfühlt. Das ist mir wichtig. Und ich bin auch ganz schlecht darin, tatsächlich das abzugrenzen. Ich bin ganz schlecht darin, Arbeit und Privatleben richtig abzugrenzen. Ich habe auch alles auf meinem privaten Handy zum Beispiel, also E-Mails etc. rausgelegt, weil ich nicht so gut darin bin, aber auch das nicht so möchte, weil ich möchte, dass es ein Stück weit verschwimmt, weil ich einfach gerne arbeite.",
      "start": 4061087,
      "end": 4128655,
      "confidence": 0.8348955223880602,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Du wirst jetzt fünf Recruiter anfragen auf LinkedIn haben. Wir haben gehört, du arbeitest gerne.",
      "start": 4128675,
      "end": 4133418,
      "confidence": 0.6691333333333335,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und du hättest auch gerne Arbeit, fühlt sich an wie Freizeit, das heißt du möchtest auch kein Gehalt dafür, oder? Auf jeden Fall.",
      "start": 4136454,
      "end": 4144042,
      "confidence": 0.7741304347826087,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das ist eine sehr, das ist eine seltsame Einstellung, finde ich, zur Arbeit, aber das ist das, was mir tatsächlich wichtig ist.",
      "start": 4144062,
      "end": 4151971,
      "confidence": 0.7455909090909091,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber ich kann da mitfühlen, ich bin da von der ähnlichen Schiene, ja.",
      "start": 4152011,
      "end": 4155374,
      "confidence": 0.6910000000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also gehst du ab und zu mal die Extrameile, wie man es so schön sagt?",
      "start": 4155394,
      "end": 4158578,
      "confidence": 0.5905999999999999,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich würde sagen ja, aber ich muss auch aufpassen.",
      "start": 4159718,
      "end": 4161359,
      "confidence": 0.7683333333333332,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Solange es dir Spaß macht, oder?",
      "start": 4161379,
      "end": 4163039,
      "confidence": 0.3558333333333334,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau. Es darf mich halt nicht auslaugen und es gibt da auch Grenzen. Also wenn ich selber merke, dass ich irgendwie angespannt werde und irgendwie nicht mehr die Kapazität habe, um da Spaß dran zu haben, weil ich irgendwie 50, 60 Stunden die Woche gearbeitet habe und das zu viel ist, dann muss ich das auch runterfahren. Also es gibt da auf jeden Fall eine Grenze, in der es keinen Spaß mehr macht.",
      "start": 4163079,
      "end": 4183046,
      "confidence": 0.8215890410958905,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Also ich muss auch sagen, ich glaube, meine Ansicht ist ein bisschen anders. Ich brauche nicht das Gefühl, dass Arbeit für mich wie Freizeit ist. Ich code auch selten in meiner Freizeit. Ich mache da eher so Community-Sachen wie unseren Podcast zum Beispiel. Aber ich brauche auch mal eine Pause von diesem Schreiben und Coden. Also mein Tag Mein Output wird nicht besser, wenn ich 10 bis 12 Stunden arbeite, sondern mein Output wird besser, wenn ich eine Nacht drüber schlafe, manchmal nachts aufwache und dann kommt mir plötzlich die Lösung und am nächsten Tag setze ich mich mit einem frischen Kopf daran. Also ich finde halt dieses Ding von Überstunden, der Überstunden wegen, ich mache Überstunden, wenn es einen Grund dafür gibt. Dann mache ich die auch gerne, in Anführungsstrichen, aber ich bummel die auch sehr gerne in der Folgewoche dann ab, weil ich brauche das auch. Also ich brauche den Ausgleich, damit mein Gehirn funktioniert.",
      "start": 4183934,
      "end": 4236557,
      "confidence": 0.7872547770700636,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Man muss ja auch mal ganz ehrlich sagen, in sehr vielen Fällen sind Überstunden ja eigentlich nur, also durch Überstunden kompensierst du deine eigene fehlende Produktivität oder deine eigene fehlende Erwartungsmanagement gegenüber deinem Vorgesetzten. Wenn du einfach zu viel Arbeit auf dem Tisch hast, was du in deinen regulären, ich sag mal jetzt 40 Stunden nicht schaffst, Und du machst den Ausgleich über Uhrstunden, dann ist es nicht, dass du mehr arbeitest, sondern natürlich arbeitest du mehr, aber du schaffst es ja nicht, Grenzen zu setzen. Du schaffst es ja nicht zu sagen, hey, ich hab hier zu viel Arbeit, da komm ich nicht her. Weil ich bin persönlich auch leider auf Dodos Seite mit der extra Meile und es macht Spaß und es muss Lebeninhalt sein und so weiter. Ich wär gerne viel mehr diese Person, die ich jetzt beschreibe. Für mich ist die Definition von Arbeit, also wenn man sich ganz mal auf das Fundamentale zurückzieht, ist das halt Zeit und Geld im Austausch, nein, Geld im Austausch von Zeit und Fähigkeit. Du kaufst Geld dafür, damit du deine Zeit und deine Fähigkeit jemandem zur Verfügung stellst, um den Traum von jemandem anders umzusetzen. Und wenn dein Traum oder wenn der Traum von deinem Arbeitgeber zufällig mit dir matcht, dann ist das vielleicht Passion und Motivation. Aber ich wäre gerne besser dafür, einfach den Stift fallen zu lassen und meinen Kopf dann einfach nur auf mein Leben zu fokussieren.",
      "start": 4237273,
      "end": 4322778,
      "confidence": 0.8234605809128624,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich auch, tatsächlich. Mir wäre das lieber, auch wenn ich einfach sagen könnte, okay, das ist Arbeit und das ist nicht mein Lebensinhalt und meine Person definiert sich nicht durch den Job.",
      "start": 4323479,
      "end": 4334906,
      "confidence": 0.8178749999999999,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Das funktioniert halt mal besser und mal weniger gut. Also ich kann das auch nicht immer so stringent durchziehen.",
      "start": 4335086,
      "end": 4340290,
      "confidence": 0.7000000000000001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du sagst, du machst eine Pause und dann bist du effizienter am nächsten Tag. Was das eigentlich bedeutet, du hast das Problem in deiner Tasche gepackt oder in deinem Kopf und dann gehst du schlafen und träumst davon und dann morgens beim Frühstück, obwohl du noch gar nicht die Arbeit begonnen hast, denkst du nach und denkst so, wow, jetzt hab ich's. Und dann hast du jetzt die letzten acht bis zehn bis zwölf Stunden dieses Problem mit dir geschleppt und eigentlich außerhalb der Arbeit gelöst. Ist natürlich jetzt nicht alles so schwarz-weiß und eins und null, ja, aber ich wär gerne die Person, die einfach viel mehr abgeben kann beziehungsweise Einfach.",
      "start": 4340931,
      "end": 4370799,
      "confidence": 0.6805178571428573,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ja. Wieder die Frage, hat sich da was verändert bei euch die letzten Jahre oder Jahrzehnte?",
      "start": 4371600,
      "end": 4380395,
      "confidence": 0.8378823529411763,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich glaube, ich bin über die Zeit besser darin geworden, mit Überstunden umzugehen. Also ich glaube, Andi, du hattest das gesagt, mit dem auch proaktiv kommunizieren, wenn man sich zu viel auf den Tisch geladen hat, in einem Sprint zum Beispiel. Darin bin ich besser geworden. Ich suche die Fehler mit der Mehrerfahrung, die ich mittlerweile habe, nicht so sehr bei mir mit, oh Gott, warum kriege ich das jetzt nicht in der Zeit fertig, in der es eigentlich fertig sein sollte, sondern ich bin besser darin geworden, zurückzuspiegeln. dass die Einschätzung des Aufwands vielleicht falsch war oder dass das hier halt länger braucht, weil ich glaube, darin bin ich besser geworden.",
      "start": 4381033,
      "end": 4416940,
      "confidence": 0.8214107142857142,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt haben wir schon einiges besprochen in den Interviews, was euch wichtig ist. Habt ihr sonst noch irgendwelche Red Flags oder Warnsignale oder was ist euch sonst noch im Interview wichtig oder im Interviewprozess vielleicht auch?",
      "start": 4416960,
      "end": 4427550,
      "confidence": 0.7673888888888888,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich hab tatsächlich ein Ding, was mich so ein bisschen aufhorchen lässt, das ist tatsächlich Gendern. Also wenn ich mit jemandem spreche oder in den Text lese oder von Softwareentwickler gesprochen wird, dann ist das für mich direkt ein Signal von, also mittlerweile fühle ich mich von Softwareentwickler nicht mehr angesprochen, weil ich einfach sehr gewöhnt bin an diese Softwareentwicklerin. Und wenn ich dann eine Jobbeschreibung lese, wo nach Softwareentwicklern gesucht wird, dann, selbst wenn da WDM dahintersteht, dann ist das für mich ein Warnsignal zu gucken, wie reflektiert ist die Firma, wenn sie mich mal diesen Text gendern kann? Und wie ist dann die Kommunikation in der Firma? Also das wäre dann was, wo ich jetzt nicht sagen würde, oh, da bewerbe ich mich gar nicht erst. Aber es wäre dann was, wo ich ein erhöhtes Augenmerk in den Interviews drauflegen würde.",
      "start": 4427939,
      "end": 4474506,
      "confidence": 0.8299160839160837,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Würdet ihr erwarten, dass eine Frau im Interviewprozess ist?",
      "start": 4474526,
      "end": 4477707,
      "confidence": 0.6233333333333334,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nee, das nicht so unbedingt.",
      "start": 4478660,
      "end": 4480061,
      "confidence": 0.7302,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also wenn die Firma groß genug ist, natürlich. Wenn es eine Drei-Mann-Firma ist und jetzt wirklich Mann-Firma ist, dann ist es halt.",
      "start": 4480421,
      "end": 4485302,
      "confidence": 0.7802272727272727,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Schwierig, aber... Nee, ist mir auch nicht so wichtig. Aber ich würde mich auch auf eine Stellenausschreibung, die auf Deutsch ist und nicht gegendert, würde ich mich auch nicht bewerben.",
      "start": 4485322,
      "end": 4494605,
      "confidence": 0.7569666666666667,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Es ist halt so, den minimalen Effort, der wurde nicht gemacht. Das ist schade, aber ja. Spricht halt für eine Kultur, in der es nicht genug Augenmerk auf solche Dinge gibt.",
      "start": 4494645,
      "end": 4507769,
      "confidence": 0.8276451612903225,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Sonstige Red Flags?",
      "start": 4508982,
      "end": 4510663,
      "confidence": 0.6833333333333332,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Für mich vielleicht so abschließend. Es ist jetzt keine Red Flag, aber ich fühle mich wohler in jüngeren, dynamischeren Teams. Deswegen arbeite ich so gerne in Startups. Einfach weil ich mich in so einer großen Firma mit sehr viel Hierarchie fühle ich mich glaube ich nicht so wohl. Und ich habe immer das Gefühl, dass ich da nicht so viel Freude und Leidenschaft für meinen Job haben könnte. Und immer wenn ich das Gefühl habe, also ich bin jetzt nicht gegen sehr große Firmen und ich finde auch viele große Firmen machen das ganz gut, dass sie irgendwie dann auch den Teams selber sehr viel Entscheidungsgewalt zum Beispiel überlassen. Aber wenn ich irgendwo interviewt werde und die mir dann erzählen, dass sie schon gar keine Laptops bekommen haben, dann finde ich das total schwierig und das ist so, das ist eine Red Flag für mich, wenn Teams, wenn ich das Gefühl habe, dass Teams nicht genug eigene Entscheidungsgewalt haben, weil dann habe ich gar keine als Entwicklerin und dann kann ich nur das machen, was mir von oben gesagt wird.",
      "start": 4510723,
      "end": 4567409,
      "confidence": 0.8242666666666664,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Hast du irgendwelche Tipps, wie du das rausfindest?",
      "start": 4567429,
      "end": 4569652,
      "confidence": 0.5662499999999999,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Tatsächlich, ich frage dann explizit danach, also ich frage dann danach, was es braucht oder mit wem ich meine Arbeit zum Beispiel abstimmen muss. Wie kriege ich meine Aufgaben zugeteilt? Kann ich mir selber Aufgaben suchen? Solche Fragen.",
      "start": 4570002,
      "end": 4582409,
      "confidence": 0.8285526315789473,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Also so einen normalen Tagesablauf oder so ein Produktfeature-Ablauf sozusagen. Wie entsteht ein Feature? Weil ich glaube, es ist auch bei kleinen Firmen durchaus gang und gäbe, dass extreme Hierarchie ist. Also es kann dir schon auch passieren, auch wenn es tendenziell vielleicht bei Startups weniger ist.",
      "start": 4582449,
      "end": 4597878,
      "confidence": 0.7712553191489361,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jüngere Teams geht aber dann auch oft zulast der Seniorität oder?",
      "start": 4598688,
      "end": 4602197,
      "confidence": 0.806090909090909,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das stimmt. Und ich bin ganz froh, dass in unserer jetzigen Firma sehr viel mehr seniorige Leute sind, als ich es gewohnt bin, mitzuarbeiten. Einfach weil ich total viel auch lerne und ich glaube, auch hier älter ich werde, desto eher fühle ich mich dann in Teams wohl, die auch senioriger sind. Also das stimmt.",
      "start": 4602808,
      "end": 4621054,
      "confidence": 0.8137454545454544,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Wobei Seniorität auch nicht gleich Alter ist. Ich meine, das meintet ihr, glaube ich, gerade nicht so, aber nur, um das nochmal ausgesprochen zu haben.",
      "start": 4621735,
      "end": 4627457,
      "confidence": 0.6709999999999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, aber es korridiert zumindest. Sehr stark.",
      "start": 4627497,
      "end": 4630197,
      "confidence": 0.5878571428571429,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Habt ihr denn Red Flags?",
      "start": 4630678,
      "end": 4631638,
      "confidence": 0.3124,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Eine Red Flag, die hattest du ein bisschen schon angesprochen. Das ist diese Attitude-Geschichte. Die würde ich gerne ein bisschen weiter treiben. Und zwar, was ist in der Firma, ich sage mal, anerkannt, beziehungsweise was wird inzentiviert? Weil das, was inzentiviert wird, treibt die Kultur. Und wenn zum Beispiel eine Hero-Culture inzentiviert wird, das bedeutet man hat einen Ausfall, jemand springt da rein, weiß alles, löst alles und geht einfach wieder raus ohne den ganzen, ich sag mal den Bug richtig zu fixen, sondern nur das System wieder hochzuheben, dann ist das schon und dann wird diese Person gefeiert, dann ist das leider eine oder ein starkes Indiz für eine sogenannte Hero-Culture. dass einzelne Personen über Teams gehoben werden. Somit hast du Knowledge-Tiles und allem drum und dran. Und das ist oft gleichzusetzen mit Leuten, die dann auch sehr viel in der Architektur zu sagen haben und dann gegebenenfalls als Gatekeeper da sind. Das machen wir nicht, weil, ja, und dann fadenscheinige Gründe. So was ist immer ganz, ganz schwierig, finde ich. Und das geht auch ein bisschen einher damit, mit dem ... Mit der Kultur der Firma, hat die Firma eine Knowledge-Kultur, also wird das, was du bereits weißt, inzentiviert und wirst du dafür hochgehoben oder eine Learning-Kultur, dass du einen Fehler gemacht hast und aus diesem Fehler lernst und das neu dann einfließen lässt. Das ist ein essentieller Unterschied meines Erachtens nach und das ist für mich ganz, ganz schwierig, weil besonders bei einer Knowledge-Kultur, holst du primär leute rein und der interviewprozess wird auch so getrieben dass du leute holst die sich mit den technologien bereits schon auskennen, die du hast und da muss man leider sagen sehr viele firmen suchen ein sehr spezifisches profil programmiersprachen und so weiter und so fort anstatt talentierten menschen die möglichkeit zu geben diese technologie in, oft sehr kurzer zeit muss man sagen zu lernen und somit schließt man sehr sehr viele leute aus dem pool aus das sind so für mich so die haupt flex wie findest du das raus. Ich habe kein Rezept dafür. Wenn man in der Firma ist, kriegt man das glaube ich in den nächsten, in den ersten vier bis fünf Monaten mit. Besonders wenn man so langsam aus der, ich nenne das immer, Honeymoon-Phase raus ist. Die ersten zwei, drei Monate bezeichne ich immer, oder die ersten sechs eigentlich als Honeymoon-Phase, weil dann sieht man die Probleme noch nicht. Das ist leider, also ich habe keine gute Technik, um herauszufinden. wie man sowas testet weil wenn du fragst im interviewprozess habt ihr eine hero culture sagt natürlich jeder nein also von daher.",
      "start": 4631968,
      "end": 4790077,
      "confidence": 0.8136636155606405,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, was du fragen kannst, ist, wie wird ein Incident zum Beispiel gehandelt? Erzähl mir mal über den letzten Incident, den ihr gehabt habt. Wie ist das abgelaufen? Eben, wer entscheidet, wenn ein Feature eingebracht wird? Solche Dinge, da merkst du dann, finde ich, schon solche Tendenzen. Wer ist der Beste im Team? Kannst du ja auch fragen. Oder wie entscheidet ihr in eurem Team irgendwas? Eine Technologie oder so. Wenn dann immer kommt, ja, da gibt es den einen und der weiß perfekt Bescheid, dann ist es halt auch schwierig.",
      "start": 4791114,
      "end": 4820586,
      "confidence": 0.7384065934065933,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wohingegen man sagen muss, das, was Leute denken, der Prozess ist, und was er dann wirklich ist, ist ja immer so eine Sache, ne? Also ich meine ... Ja, umso mehr.",
      "start": 4820806,
      "end": 4829473,
      "confidence": 0.7973225806451613,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Du nachfragst, umso besser.",
      "start": 4829533,
      "end": 4831054,
      "confidence": 0.74675,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, aber ich meine ... Also eher.",
      "start": 4831094,
      "end": 4832154,
      "confidence": 0.6784285714285715,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Hast du halt einen Red Flag, das du ja eben rauskitzeln willst.",
      "start": 4832174,
      "end": 4835777,
      "confidence": 0.6159166666666666,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also es gibt ja nicht umsonst den Spruch, Culture eats process for breakfast. und ... Ja? Du hast zwar einen Prozess, wie Features reinkommen sollen, ja? Dann gibt's aber diese Kultur noch, ja? Von daher ... Naja, schwierig.",
      "start": 4835837,
      "end": 4850408,
      "confidence": 0.7059210526315789,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ihr habt jetzt schon so ein paar spannende Fragen. Also ich hoffe, ich erinnere mich bei meinem nächsten Interview. Das hoffentlich noch ein bisschen dauert natürlich, weil ich bin gerade sehr happy. Honeymoon-Phase. Genau, Honeymoon-Phase. Also sind das so die Fragen, die ihr dann stellt in dem Interview oder bereitet ihr euch nochmal anders auf ein Interview vor?",
      "start": 4851377,
      "end": 4872048,
      "confidence": 0.7731724137931036,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich mache immer eine exzessive Recherche. Ich hasse es, wenn ich Leute interviewe und ich stelle die Frage, was weißt du denn schon über Firmennamen? Also was weißt du denn schon mal über 1,5 Grad? Und die Leute sagen, ja nicht so viel, ihr macht irgendwas mit Energie. Und dann frage ich, wie verdienen wir denn Geld? Und das ist für mich schon, ich finde, das ist respektlos. wenn man sich bei einer Firma bewirbt und nicht weiß, wie diese Firma Geld verdient oder Geld verdienen möchte oder was diese Firma generell macht. Deswegen mache ich immer eine sehr große Recherche, wie verdient die Firma Geld, in welchem Segment ist sie unterwegs. Ich gucke auf LinkedIn, wie viele Mitarbeiter sind da. Ich gucke, ob die auf seinem GitHub sind, im Open Source Bereich, was für ein Employer Branding machen die, all sowas. Also da bereite ich mich schon sehr gut vor. In der Regel für den Job, für den ich mich bewerbe, sofern ich kein Quereinsteiger bin oder mich anders entwickeln möchte, davon weiß man ja relativ viel von seinem Fach in der Regel. Und das könnte man, würde ich fast sagen, ich sage, vieles aus dem FF. Vielleicht liest man sich ein bisschen in die Technologien ein oder schaut sich ein Konferenztalk an von der Firma darüber, damit man ungefähr weiß, okay, was nutzen die, damit man sein Wissen da vielleicht in der Richtung ein bisschen auffrischen kann. Ich beschäftige mich sehr viel mit der Firma, ich beschäftige mich sehr viel mit den Strukturen, ich schaue mir die Leute an, ich schaue mir jeden, mit dem ich ein Interview habe, dass ich mir den Namen vorher gebe und schaue denen auf LinkedIn nach, damit ich weiß, okay, was ist das für ein Background. Also, ich bereite mich da schon sehr vor, weil ich finde, das gehört ... Das ist für mich auch so ein Respektding irgendwie.",
      "start": 4872108,
      "end": 4968045,
      "confidence": 0.734179810725552,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich glaube, in Teilen stimme ich dir zu. Ich finde jetzt die Frage nach, wie verdient die Firma Geld, finde ich jetzt nicht so relevant. Aber klar, man sollte sich mit der Firma auseinandergesetzt haben. Also, ich mein, die Frage, bevor ich ein Interview mache, ist schon, kann ich mir vorstellen, bei der Firma zu arbeiten? Die Frage nach, wie verdienen die Geld, wäre für mich jetzt eine, die würde ich nicht ganz nach oben stellen.",
      "start": 4968345,
      "end": 4986491,
      "confidence": 0.7799605263157896,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Warum?",
      "start": 4988252,
      "end": 4988532,
      "confidence": 0.386,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich weiß nicht.",
      "start": 4988592,
      "end": 4990393,
      "confidence": 0.4000000000000001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich hab halt auch zu oft in Firmen gearbeitet, die gar kein Geld verdienen.",
      "start": 4990433,
      "end": 4994055,
      "confidence": 0.4661428571428572,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ich glaube, mir ist wichtiger, ich muss nicht unbedingt das Businessmodell vorher vorab verstehen, sondern mir ist wichtiger, was macht die Firma? Also, mir ist das Businessmodel dahinter nicht so wichtig.",
      "start": 4994095,
      "end": 5005660,
      "confidence": 0.8778387096774195,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Mehr auch nicht tatsächlich. Und ich finde das meistens sehr vielschichtig, weil auch, womit die Firma tatsächlich Geld verdient, ist was, was von außen manchmal nicht direkt ersichtlich ist und wo ich nicht erwarten würde, dass die Person es im Interview dann tatsächlich weiß. Ich fände es total schön, wenn die Person dann sagt, hey, habe ich irgendwie nicht so eine richtige Ahnung, ich war irgendwie auf eurer Webseite und ich weiß, dass ihr das und das macht, aber es ist irgendwie alles Open Source und ich weiß ehrlich gesagt überhaupt nicht genau, wie ihr an Geld kommt. Das fände ich auch eine schöne Antwort zum Beispiel. Und mir ist es nicht wichtig, dass die Person das von vornherein weiß.",
      "start": 5006164,
      "end": 5040074,
      "confidence": 0.7569166666666667,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Es ist jetzt kein Kriterium, wo ich jemanden rauskicken würde. Das möchte ich ganz vorne sagen. Doch ich denke, das eine hat mit dem anderen sehr viel zu tun, weil für mich zeigt das auch, wie tief geht man in ein Problem oder wie tief hat man wirklich Interesse daran. Und die zweite Geschichte ist, besonders wenn man in einer höheren Position einsteigt, ist das natürlich auch für mich eine Frage, kann man bei diesem BISMUS-Modell auch einen Impact haben? Besonders wenn es nämlich in Seniorität, Staff und Co. geht oder in den Engineering-Management-Rollen oder generell Führungskraft, dann ist das natürlich schon eine hohe relevante Frage, aber auch für Staff-Engineers. Also ein Staff-Engineer, der nicht weiß, wie die Firma Geld verdient, wird auch ein bisschen länger dauern, um herauszufinden, wie kriegt man dann wirklich einen Impact hin.",
      "start": 5040546,
      "end": 5081629,
      "confidence": 0.7987883211678831,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich glaube, das Kritische ist nicht, wie Geld verdient wird, sondern dass man das Produkt versteht.",
      "start": 5081669,
      "end": 5086633,
      "confidence": 0.7991176470588234,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau.",
      "start": 5086853,
      "end": 5087353,
      "confidence": 0.4405,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich glaube, es geht mehr darum. Und ich hatte auch so Interviews, wo ich als Interviewer gefragt habe, was würdest du denn bei unserer Webseite, bei dem Produkt, bei der Applikation, Was würdest du denn verbessern? Oder hast du irgendwas gefunden, was dich stört als User? Ist ja ein user-facing Produkt gewesen, bei Trivago jetzt zum Beispiel. Und die Leute haben teilweise, also selten, aber es kamen teilweise so Antworten, ich war noch nie auf der Webseite. Und da frage ich mich dann natürlich schon, wenn ich mich bewirbe einer Firma und nicht mal weiß, was die eigentlich machen, oder noch nie mal auf dem Produkt war, einfach wo ich nur auf die Webseite gehen muss, dann ist für mich als Interviewer das ein Red Flag. Also so ein grundsätzliches Verständnis vom Produkt ist meiner Meinung nach schon wichtig. Weil ich will ja wissen, ob ich für die Firma arbeiten will überhaupt. Also ich kann mich nicht bei Facebook bewerben und habe noch nie Facebook verwendet oder in irgendeiner Form weiß, was Facebook macht.",
      "start": 5088054,
      "end": 5140553,
      "confidence": 0.7827942857142859,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn die Firma dann ein Produkt hat. Vielleicht auch hier nochmal die Unterscheidung. Aber ich meine, ich habe vorher bei einer Firma gearbeitet, die hatte kein eigenes Produkt. Und es war vielleicht auch nicht ganz ersichtlich, was genau man als Techie jetzt bei der Firma macht. Aber dann erwarte ich halt zumindest, dass der Kandidat, die Kandidatin, die vor mir sitzt, fragt. Also dann erwarte ich Fragen, wenn ich schon weiß, okay, ist da jetzt ein Interesse da. Also sie muss nicht top vorbereitet sein, aber sie muss zumindest Fragen haben.",
      "start": 5141126,
      "end": 5171598,
      "confidence": 0.8294285714285712,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das würde ich sofort unterschreiben. In meiner Erfahrung ist das ganz, ganz selten der Fall, dass wenn man etwas nicht weiß, dass man dann fragt, wie ist es denn oder können Sie mir das mal erklären oder ähnliches. Das flippt die ganze Sache natürlich vom schlechten ersten Eindruck zu. Oh, lernfähig, interessiert und so weiter. Das ist natürlich schon eine ganz andere Geschichte. Passiert sehr, sehr selten und ich denke auch, das ist ein Punkt, wo sich Leute im Interviewprozess auch ein bisschen hervorheben können.",
      "start": 5172390,
      "end": 5201445,
      "confidence": 0.7865764705882351,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich glaube, grundsätzlich keine Fragen zu haben, ist mal schlecht. Also ich würde auf jeden Fall probieren, Fragen zu haben.",
      "start": 5201985,
      "end": 5208672,
      "confidence": 0.7267142857142856,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Es ist ja auch eigentlich leicht. Also ich verstehe gar nicht, wie man keine Fragen haben kann. Ich habe meistens sehr viele Fragen. Also sei es, vielleicht auch einmal dazu, was ist denn ein gutes Interview für mich? Für mich ist ein gutes Interview ein Gespräch. Erstmal das. Wo man das Gefühl hat, okay, ich bin ja jetzt nicht die Person vor mir, die hat jetzt keinen Fragenkatalog und checkt das irgendwie ab, sondern ich fühle mich wohl, wenn es ein Gespräch ist.",
      "start": 5208992,
      "end": 5234296,
      "confidence": 0.7971686746987954,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich finde bei einem Interviewgespräch, da ist aber auch eine ganze Menge Glück dabei, weil wenn man eingeladen wird, ist das erstmal eine super Sache, weil man kann sich erstmal beweisen, man kann Sachen aus dem Lebenslauf klarstellen, die vielleicht falsch verstanden wurden oder ähnliches und man lernt mal die Person dahinter kennen, aber wie das Gespräch dann, bewertet wird oder sogar verläuft ist ist eine unglaubliche glückssache meines erachtens nach weil es hängt so viel ab von der person die einem gegenüber sitzt wie hat die person geschlafen hat die sich gerade mit ihrem partner gestritten all das hat einen einfluss aufs interview man ob man es möchte oder nicht man kann so professionell sein wie man möchte hat man eine schlechte laune, wird das Ergebnis wahrscheinlich negativer. Ich sage nicht negativ, sondern negativer. Und dann, wie viel Erfahrung hat die Interviewperson, mit der man das Interview führt? Besonders als ich angefangen habe, Kandidaten zu interviewen, habe ich mir Fragen gestellt, wo ich die Antwort kenne. Das ist natürlich unglaublich schlecht, weil dann dränge ich die Person natürlich schon in irgendeine Art und in eine Richtung, und dann erwarte ich, dass die Person das auch weiß, und das ist natürlich nicht der Fall. all das kann man alles gar nicht beeinflussen und deswegen würde ich auch sagen oder ist zumindest die erfahrung wenn man abgelehnt wird auf basis von weiß man ja nicht weil die grund wird auch oft nicht kommuniziert der grund wird in der regel nicht kommuniziert weil so viel ich weiß in deutschland man fast bei jedem grund dagegen rechtlich vorgehen kann deswegen wird man meist gesagt okay es war es war eine schöne zeit und das passt leider hier nicht deswegen werden wir.",
      "start": 5234770,
      "end": 5328173,
      "confidence": 0.7987013888888886,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Im interviewprozess Manchmal kriegt man da verbal noch ein bisschen was raus, also vielleicht als Tipp für alle anderen in Person kriegt man da vielleicht nochmal eine ehrlichere Antwort drauf.",
      "start": 5328233,
      "end": 5338867,
      "confidence": 0.7269333333333333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es ist eigentlich gar nicht so schlimm rechtlich, aber es will sich halt niemand damit auseinandersetzen und meistens sind es halt keine Rechtspersonen oder HR-Personen, die dir dann das Feedback geben. Das ist halt das größte Problem. Seid ihr eigentlich schon mal abgelehnt worden in einem Interview? Oder halt nach dem Interview?",
      "start": 5338927,
      "end": 5353954,
      "confidence": 0.7764807692307693,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, oft ganz schlimm finde ich es dann nach so einer Challenge oder wenn ich irgendwas programmieren musste, weil dann manchmal finde ich, fand ich die Aufgabe auch nicht ganz fair. Oder es war ja auch bei mir irgendwie Glück, ob ich jetzt mich gut darauf vorbereitet habe oder ob ich das jetzt gut lösen konnte oder nicht. Und dann fühle ich mich schon, also dann kann ich damit manchmal nicht so gut umgehen, wenn ich mir dann denke, okay, aber irgendwie hätte ich das besser gekonnt oder dann tue ich mich da manchmal echt schwer damit, aber bisher war es bei mir immer so, dass wenn ich abgelehnt wurde, dann war das auch besser so. Also es war immer quasi dann Glück im Unglück im Grunde, weil es sowieso nicht richtig gepasst hätte und weil es sowieso nicht die richtige Stelle für mich gewesen wäre.",
      "start": 5354423,
      "end": 5395638,
      "confidence": 0.810417808219178,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber war das schwierig für dich, dich dein Selbstbewusstsein dagegen so ein bisschen zu schützen?",
      "start": 5395678,
      "end": 5400180,
      "confidence": 0.7295333333333333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, auf jeden Fall. Auch dieses, ich glaube, abgelehnt werden, finde ich total schwierig. Auch persönlich, also eigentlich auf allen Ebenen. Für meine Fähigkeiten, für meine Persönlichkeit. Ich finde sowieso, dieser ganze Bewerbungsprozess ist emotional immer sehr schwierig für mich, weil man sein Ganzes selbst so auf dem Präsentierteller hat. Und dann ist es so, magst du mich?",
      "start": 5401042,
      "end": 5423412,
      "confidence": 0.8226034482758622,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Findest du mich gut? Es liegt nicht an dir, es liegt an mir.",
      "start": 5423592,
      "end": 5427854,
      "confidence": 0.6646153846153845,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Deswegen finde ich das emotional immer total aufreibend, sich irgendwo zu bewerben und sich sein ganzes Selbst irgendwie so jemandem vor die Füße zu legen und zu sagen, nimmst du das jetzt? Aber es war dann, es war wirklich immer ganz gut. Und ich nehme das, also je nachdem, viele Stellen ist es dann auch wirklich so, dass, okay, das hätte nicht gepasst und da bin ich auch froh, dass es irgendwie dass ich dann abgelehnt werde und dann bin ich auch immer richtig froh, weil sonst hätte ich auch Nein gesagt zum Beispiel. Aber ich muss auch sagen, ich warte dann oft darauf, ob mir das dann angeboten wird oder nicht, um dann Nein zu sagen, anstatt dann proaktiv manchmal Nein zu sagen.",
      "start": 5429935,
      "end": 5463859,
      "confidence": 0.8039999999999998,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Aber diese Kenntnis, dass es dann nicht geklappt hat, dass das besser war, die kommt bei mir zumindest erst später. Ich bin immer wieder, ich finde es immer wieder schade und zweifle auch an mir, an meinen Fähigkeiten, wenn ich abgelehnt werde. Und später macht man sich dann Gedanken und dann sagt, okay, ja, vielleicht war das auch okay so. Ist das bei dir auch so, oder ist das so, oh, Ablehnung, oh, war richtig so.",
      "start": 5465020,
      "end": 5487092,
      "confidence": 0.7234605263157894,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es kommt drauf an. Es ist so ein Bauchgefühl. Manchmal ist es dann, wie wenn man so ein Kind ist, wenn man sich nicht entscheiden kann und dann wirft man eine Münze und dann guckt man, ob man sich jetzt, ob das Bauchgefühl sich dagegen wehrt, gegen die Entscheidung, die die Münze gefällt hat.",
      "start": 5487928,
      "end": 5502645,
      "confidence": 0.7434444444444444,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Du meinst, dass wir einfach nochmal flippen? So lange bis wir das richtige Ergebnis haben?",
      "start": 5503786,
      "end": 5507811,
      "confidence": 0.4992666666666666,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und da ist es ja auch so. Und manchmal ist es tatsächlich so, dass ich mir dann denke, oh Mann, ich hätte das schon gerne gemacht und dann erst hinterher feststelle, zum Beispiel auch, wenn ich dann tatsächlich eine Stelle bekommen habe, denke ich mir so, oh, die ist viel besser. Und manchmal ist es aber auch so, dass dann in dem Moment, wo die Absage kommt, denke ich mir so, ja, okay, das hätte ich sowieso nicht gewollt.",
      "start": 5509590,
      "end": 5527457,
      "confidence": 0.7672405063291137,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Du hattest grad schon so eine Take-Home-Challenge angesprochen. Wie steht ihr so was gegenüber? Weil ich mein, im Endeffekt, ihr kriegt deine Aufgabe sehr wahrscheinlich nach Hause. Dafür habt ihr eine Woche Zeit, investiert etliche Stunden in eurer Freizeit. Wie seht ihr das, Ellen?",
      "start": 5528213,
      "end": 5547938,
      "confidence": 0.7689318181818183,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich bin da ehrlich gesagt nicht so der Fan von. Ich musste so was noch nie machen. Aber ich habe das auch von der Firmenperspektive nie gefordert. Ich finde halt, Das, was man dabei halt meistens nicht mitschneiden kann, ist, wie arbeitet die Person denn jetzt gerade? Und das kann ich in der Coding Challenge auch nicht zeigen. Also, was ich viel effektiver finde, ist tatsächlich eine Live-Coding-Session. Ja, das ist sehr stressig, aber den Faktor muss man dann halt rausrechnen, dass sich die Person, die da im Screen-Sharing zum Beispiel gerade live codet, dass da halt ein Nervositätsfaktor mit drin ist, definitiv. Aber ich finde, das zeigt einem am ehesten. Da kannst du meistens nach 20 Minuten sagen, ja, das passt, oder nach 20 Minuten, nee, das passt nicht. Ich meine, es gibt auch diese Take-home-Challenges, die dann so ein Screen-Recording mit drin haben, aber das finde ich dann wiederum auch wieder mega ineffektiv. Also, ich finde es sowohl für die Seite der Leute, die interviewen, als auch die, die interviewt werden, so eine Live-Coding-Session besser. In einem gesetzten Rahmen von zum Beispiel einer Stunde, Bewerbungsverfahren sind ja meistens auch recht zeitintensiv, kannst du zeigen, was du kannst und überzeugen oder eben nicht und nach der Stunde bist du dann aber auch durch damit und hast nicht irgendwie Samstag, Sonntag investiert, um da eine asynchrone Coding-Challenge zu bekommen und am Ende wird dann dein Code irgendwie bewertet. Also da bin ich eher Team-Live-Coding.",
      "start": 5547978,
      "end": 5629112,
      "confidence": 0.7869590163934422,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Obwohl Livecoding natürlich schon eine andere Liga ist, weil du bist ja on spot. Du musst in diesem Moment, ich sag mal, performen. Also das Nervositätslevel ist bei mir schon deutlich höher.",
      "start": 5630590,
      "end": 5642572,
      "confidence": 0.676125,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Definitiv. Also da ist es auch so ein bisschen an der, ich musste nie eine Livecoding-Session machen, das muss ich dazu sagen. Ich hatte bisher immer eher so die Gespräche oder mal ein Probearbeiten, wo ich dann eben einfach so einen halben Tag mal entwickelt habe. Ich finde, beim Livecoding ist es halt super wichtig, von der Firma die dich eventuell einstellen will, ein Setting zu schaffen, in dem die Person sich möglichst wohl fühlt. Also davon vorab eben die Erwartungshaltung zu haben, hey, du musst da jetzt nicht, wir gucken dir jetzt nicht alle still dabei zu, wie du das live codest, sondern wir wollen emulieren, dass wir gemeinsam an einem Problem, an einer Problemlösung arbeiten. Das ist halt der wichtige Vibe dabei. Wenn ich eine Live-Coding-Session habe, wo ich das Gefühl habe, Ich hatte mal ein Interview in einer Programmiersprache, die ich nicht kannte, auf einer Mac-Tastatur, obwohl ich Linux-PC-User war.",
      "start": 5642612,
      "end": 5689612,
      "confidence": 0.7275490196078429,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und noch mit drei Leuten, die um mich herum gesessen sind und mich beobachtet haben beim Coding. Oder mir auch geholfen haben, muss ich dazu sagen, weil am Mac, ich habe eh keine geschwungene Klammer zusammengebracht. Es war eine Katastrophe. Es waren harte eineinhalb Stunden, glaube ich.",
      "start": 5701423,
      "end": 5716098,
      "confidence": 0.7898297872340425,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Hast du den Job eigentlich jetzt bekommen?",
      "start": 5716118,
      "end": 5718921,
      "confidence": 0.4111428571428571,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Nö.",
      "start": 5719041,
      "end": 5719842,
      "confidence": 0.806,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es war ein ziemlicher Kampf. Wenn die mich eingestellt hätten, keine Ahnung.",
      "start": 5719882,
      "end": 5724867,
      "confidence": 0.6361666666666667,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zwei schöne Sachen in Bezug auf Take-Home-Challenges habe ich mal gesehen. Und zwar sind ja inzwischen einige Firmen auf dem Markt, die primär ein Open-Source-Produkt haben. Und oftmals bei solchen Firmen ist eine Take-Home-Challenge, bitte fixe ein Bug in unserem Open-Source-Repository mit einer Pull-Request.",
      "start": 5725683,
      "end": 5743068,
      "confidence": 0.8164545454545451,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist cool.",
      "start": 5743088,
      "end": 5743468,
      "confidence": 0.18866666666666668,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Das finde ich schön, weil das zeigt eigentlich alles, so wie du auch wirklich arbeiten würdest. Und die zweite schöne Geschichte ist, es gibt Firmen, die zahlen dich pro Stunde für den Take-Home-Test. Jetzt keine horrenden Summen, aber 30, 40 Dollar oder 50 Dollar pro Stunde oder ähnliches. Und das finde ich schon wieder es ist auf jeden fall eine green flag nennt man das so also was schönes was was was was ein toller benefit ist weil es schon irgendwie ein bisschen respekt zeigt zumindest.",
      "start": 5744496,
      "end": 5777160,
      "confidence": 0.7974651162790699,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Finde ich auch. Ich finde es eine Wertschätzung auf eine Art und Weise, dass man nicht sagt, ich möchte, dass du kostenlos für uns zehn Stunden arbeitest, sondern es ist eine Wertschätzung. Und dann sagt man, okay, scheinbar werden Menschen und die Zeit von Menschen wird hier sehr gewertschätzt. Und das ist auf jeden Fall eine Green Flag. Ich glaube, das kann man so sagen.",
      "start": 5777663,
      "end": 5795148,
      "confidence": 0.7583846153846155,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Wo man natürlich sagen muss, dass das Erzeugnis eines Take-Home-Tests natürlich in der Regel kein produktiver Code ist, der eingesetzt wird. Also es wird ja eigentlich nur versucht, okay, deine Hardskills ein bisschen zu testen. Obwohl das natürlich auch fraglich ist, wenn ich das zu Hause mache, weil, keine Ahnung, mein Bruder kann mir ja helfen und, ne? Und all diese möglichen Tricks, die man da machen kann.",
      "start": 5795748,
      "end": 5817723,
      "confidence": 0.8163676470588238,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Was habt ihr in euren Firmen?",
      "start": 5818063,
      "end": 5819564,
      "confidence": 0.6146666666666667,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Wolfgang, was machst du in deiner Firma als Freelancer?",
      "start": 5819604,
      "end": 5822546,
      "confidence": 0.5454444444444445,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich mache ja Gott sei Dank keine, oder was heißt Gott sei Dank? Ich mache aktuell leider keine Interviews. Aber wir haben sehr viel rumprobiert und rumexperimentiert mit ganz vielen Dingen und irgendwie hat nicht so gut funktioniert. Wir haben probiert, irgendwie langen Code herzugeben und man soll die Schwachstellen im Code identifizieren. Wir haben klassische Coding Challenges gemacht. Es ist einfach meiner Meinung nach sehr, sehr schwierig, da irgendwas zu finden, was hundertprozentig funktioniert. Das Problem an Coding Challenges ganz allgemein, was ich immer gesehen habe als Hiringmanager, ist, dass jeder anders entscheidet. Und es ist wahnsinnig schwierig nachzuvollziehen, warum jetzt jemand, der den Code beurteilt, den Code nicht mag, den schon. Und es war nicht sehr einheitlich in unseren Teams, die den Code jeweils beurteilt haben. Und darum bin ich auch kein großer Fan davon.",
      "start": 5824082,
      "end": 5871693,
      "confidence": 0.7736569343065696,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wir haben eine Take-Home-Challenge, wir haben aber auch einen Evaluation-Guide dafür, genau damit das nicht passiert, was der Wolfgang gerade gesagt hat. Und wir haben eine System-Interview, wo jemand dann auch einen Server live debuggt mit uns. Das ist dann so eine Art Live-Coding. Aber das ist jetzt nicht so, hier ist das Problem, löse das, sondern eher, du kriegst zwei Teammitglieder gestellt und ihr agiert im Team jetzt und löst das Problem. Und da geht's nicht wirklich darum, hat man den Fehler auf dem Server gefunden, sondern eher darum, wie kommuniziert man, ja, wie und so weiter. Also eher ein Verhaltensinterview vielleicht, ja, Teamfitinterview, ja, wie, sowas halt. Deswegen ... Ja, aber offengesprochen ist auch schwierig. Wir versenden auch Take-Home-Tests, die kommen nie zurück, weil jemand sagt, sorry, no-go für mich. Verstehe ich auch. Da ist meine Frage, ist ein gut gepflegtes GitHub-Profil auch eine Alternative zum Take-Home-Test? Also macht das Sinn heutzutage?",
      "start": 5871997,
      "end": 5937813,
      "confidence": 0.8100129870129871,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Dann müssten wir deine ganzen Astro-Comics von unserer Webseite, von dem JS-Framework mal alle private stellen, Andi.",
      "start": 5937853,
      "end": 5943877,
      "confidence": 0.6950000000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ehrlich gesagt, ich pflege mein Gitterprofil nicht genug. Mein Gitterprofil ist überhaupt nicht repräsentativ für das, was ich in den Coding Skills kann. Ich gebe mein Gitterprofil aber auch nicht in meinem CV an. Ich glaube, wenn Leute ihr Gitterprofil im CV angeben, dann kann man da auf jeden Fall mal reingucken. Für mich wäre das wahrscheinlich eher ein Ausstoßkriterium, weil ich das nicht pflege.",
      "start": 5945405,
      "end": 5971233,
      "confidence": 0.810212121212121,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wir hatten das auch lange Zeit probiert, den Leuten freizustellen, ob sie uns irgendeinen Code schicken von ihnen oder die Challenge machen. Und wir haben, glaube ich, so gut wie nie irgendeinen Code bekommen. Obwohl es komplett egal war, was. Aber ist klar, im Firmenumfeld kannst du nichts teilen. Das heißt, du musst irgendwie Open Source machen. Machen viele nicht. Oder die Codequalität ist vielleicht dann auch nicht so gut, wie sie gerne hätten. Also es ist genauso schwierig wieder. Also es ist wirklich schwierig, da einen Weg zu finden, der für die Masse funktioniert. Das Beste ist einfach, du hast so wenig Bewerber innen, dass es einfach kein Problem ist, wenn du mit jeder und jedem persönliche Interviews machst und das einfach auf einer persönlichen Ebene klärst.",
      "start": 5971587,
      "end": 6010489,
      "confidence": 0.8236484374999995,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich hoffe halt, dass niemand sich eingeschüchtert fühlt bei dem Thema, hier ist jetzt Livecoding, oh Gott, das traue ich mich gar nicht. sondern eher Jobsuche an sich vielleicht auch als was zu sehen, wo man eigentlich nicht verlieren kann. Also ein Nein hat man ja schon. Das heißt, wenn man sich nicht bewirbt, dann gewinnt man auch nicht. Und auch beim Rest, entweder findest du halt mehr über dich selbst raus. Wonach suchst du eigentlich? Wieso passt diese Firma hier nicht auf mich? Das sind ja auch spannende Antworten, die man da irgendwie rausfindet. Und Okay, vielleicht ist diese Live-Coding-Challenge oder habe ich jetzt aber ganz schön versagt, so vom Gefühl her, aber man lernt ja trotzdem was dabei. Also so dieses nicht so davon sich einschüchtern lassen, sondern das eher als Herausforderung zu sehen.",
      "start": 6010529,
      "end": 6056032,
      "confidence": 0.8254632352941178,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Allen, das was du gerade gesagt hast, finde ich unglaublich wichtig und kann ich auch wirklich nur bestätigen, denn ja, es ist natürlich ein enormes Zeitinvestment und ja, auch wenn man die Stelle später nicht kriegt, für mich, also ich habe so viel gelernt, ich habe auch sehr viel darüber gelernt, was ich eigentlich nicht möchte, denn erst wenn man mit ganz vielen verschiedenen Firmen spricht und mit ganz vielen verschiedenen Leuten, merkt man erst mal, was da draußen los ist, was es für Firmen gibt, wie die arbeiten, welche Leute deine zukünftigen Teammitglieder vielleicht sind. Und dann merkt man, möchte ich das? Möchte ich in diesem Segment arbeiten? Dann geht man wieder nach Hause, dann geht man raus spazieren. Und ich habe sehr viel über mich gelernt und auch sehr viel festgestellt, was ich nicht möchte. Und das, finde ich, ist fast viel wichtiger als zu wissen, was man möchte. Denn oft schränkt das dann sonst deine Entscheidungskriterien ein bisschen ein.",
      "start": 6056708,
      "end": 6107870,
      "confidence": 0.7957530864197532,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und so als kleine Story vielleicht noch, meinen ersten Job, da bin ich durch die Coding Challenge gefallen. Also ich war einfach nicht vorbereitet, ich war super schlecht. Und dann hat dieser Mensch, den ich nur von dem Meetup kannte, hat mich angerufen und mich gefragt, was denn da los war und dass sie sich das angeguckt hätten. Und ich so, ja, keine Ahnung, weiß ich nicht. Ich hatte das vor allem früher, dass ich dann irgendwie Panik geschoben habe, gerade wenn da irgendwie so ein, wenn eine Stunde Zeitfenster ist und dann bin ich so, oh Gott, und dann macht mein Gehirn so ein bisschen zu, also so ein bisschen wie Prüfungspanik im Endeffekt. Und dann haben wir aber darüber gesprochen und dann durfte ich nochmal reinkommen und eine Präsentation halten und das war total lieb und das hat mir irgendwie auch gezeigt, wie viel, wie die Kommunikation ist in der Firma und das war eine total positive Erfahrung, obwohl ich diesen Test total vermasselt habe.",
      "start": 6108672,
      "end": 6154993,
      "confidence": 0.7427485029940115,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Und was man auch verstehen muss, ist einfach, dass die Firmen normalerweise sehr kritisch sind. Und alles, was man als Firma minimieren will, ist eigentlich diese false positive rate, also dass du jemanden einstellst, obwohl du das nicht wolltest, weil dann hast du viele Monate investiert und irgendwann, du musst die Person kündigen, das ist alles ein Hassle. Also du willst diese Rate möglichst niedrig drücken. Und das heißt, du lehnst wahrscheinlich ganz viele Personen ab, die eigentlich super gut sind. Und das nimmst du aber in Kauf als Firma, weil einfach das andere so teuer ist, meistens zumindestens. Und gerade größere Firmen, die können es sich nicht leisten, da stundenlang zu investieren und das nochmal prüfen. Und klar, würde man das gerne, aber das geht halt einfach nicht, wenn du hunderte BewerberInnen hast da pro Woche oder so. Und das muss man sich halt immer vor Augen halten. Eine Ablehnung heißt noch lange nicht, dass das schlecht war. Aber vielleicht von den zehn Leuten, die das Interview geführt haben, war halt eine Person, irgendwie hat da negative Rückmeldung gegeben. Und dann fliegt man schon raus aus dem Prozess. Und vielleicht hat die Person einfach einen schlechten Tag gehabt. Also es kann alles ein Grund sein. Und das heißt noch lange nicht, dass man irgendwie schlecht performt hat. Es passt halt einfach nicht. Und im Zweifelsfall lehnt einen die Firma üblicherweise eher.",
      "start": 6155322,
      "end": 6228285,
      "confidence": 0.8245517241379315,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt gehen wir aber mal vom Best Case aus. Ihr habt performt. Ihr seid der Company Fit. Dann kommt leider der Endgegner. Verhandlungen von Angeboten. Denn ihr sollt natürlich nicht umsonst arbeiten. Wie fühlt ihr euch ... ... immer bei diesem Schritt? Ihr bekommt ein Angebot, ... ... nehmt ihr das immer sofort an ... ... oder sagt ihr, ... ... also wir müssen zusammen noch mal an den Tisch ... ... und noch mal über die Zahl reden?",
      "start": 6229045,
      "end": 6251700,
      "confidence": 0.7323924050632911,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es kommt drauf an, ... ... wie sehr ich die Stelle möchte. Wenn, ... ... also jetzt ... ... bei meiner aktuellen Position, ... ... ich wollte die Stelle unbedingt, ... ... ich fand die Firma mega, ... ... ich fand die Stelle mega ... ... und ich war überhaupt ... ... nicht bereit darauf zu wetten, ... ... jetzt zu verhandeln ... ... und ich hab tatsächlich einfach das Erste genommen, ... ... was sie mir angeboten haben ... ... und wir haben so ein bisschen drüber gesprochen, ... ... aber ich war ... überhaupt nicht risikobereit genug, da zu verhandeln. Und ich glaube, das kann man auf jeden Fall machen und das ist auch irgendwie erwartet und Leute sind einem da auch nicht böse. Aber es fällt mir total schwer. Wie ist es bei dir?",
      "start": 6251900,
      "end": 6286337,
      "confidence": 0.7167664233576647,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ich mag Verhandlungen auch nicht. Ich finde sie trotzdem wichtig. Im besten Fall hast du ja verhandelt, bevor dieser Vertrag bei dir ankommt. dass dann nicht du öffnest diese zwölf Seiten und suchst erstmal nach dem Gehalt, sondern im besten Fall habt ihr euch vorher schon drüber unterhalten. Und was ich da mache ist, Entweder kann man die Person einschätzen, aber normalerweise stelle ich die Frage, auch wenn es darum geht, intern noch mal Gehalt zu verhandeln, inwiefern kenne ich die Person, die mir gegenüber sitzt? Ich stelle meistens die Frage nach. Ich möchte weder unterbezahlt sein, noch überbezahlt sein, weil nichts davon macht einen glücklich, finde ich zumindest. Ich stelle am Anfang meistens die Frage von, Wie ist mein Gegenüber drauf? Findest du es toll, mich runterzuhandeln? Oder kann ich ehrlich sagen, womit ich zufrieden bin? Und die Antwort darauf ist normalerweise, man muss sich drauf vertrauen können, dass man eine ehrliche Antwort bekommt, ist dann normalerweise, dass man sich drauf einigt, nee, komm, lass uns ehrlich sprechen, was von der Company passt, was zu deinem Skillset passt und womit du zufrieden bist. Das ist ein bisschen dieses Heads-up, was ich mache, bevor ich eine Zahl nenne. Ich mein, selbst wenn ... Wenn das Gehalt dann niedriger ausfällt, weil die Firma kann dir einfach nicht so viel zahlen, wie du gerne möchtest, gibt es ja noch andere Faktoren, die man auch verhandeln kann. Also sowas wie Urlaubstage, Stunden in der Woche. Da gibt es ja noch viel Spielraum, die nicht direkt gehältlich an der Tour sind.",
      "start": 6286397,
      "end": 6373635,
      "confidence": 0.7961361867704276,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Compensation Package einfach gesamt, was das Angebot halt ist.",
      "start": 6374760,
      "end": 6378802,
      "confidence": 0.6801111111111111,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ab und zu gibt es, glaube ich, auch die Möglichkeit, sogar die Arbeitszeit ein bisschen zu reduzieren oder Ähnliches. Also ich glaube, das ist ein entscheidender Faktor, den sehr, sehr viele Leute übersehen. Es gibt natürlich auch noch so Gehaltselemente wie einen Signing-Bonus, also eine Einmalzahlung, dass du wechselst. Das machen auch ziemlich viele Firmen mit. Im deutschen Umfeld, was ich schon so gesehen habe, sind das so 2.000 bis 10.000 Euro, die man da teilweise noch mal rausverhandeln kann als Einmalzahlung. Das klingt viel für einen selber ist auch sehr viel geld für die firma im recruiting prozess ist das eigentlich noch sehr sehr günstig. Und sowas kann man machen und dann manche firmen besonders startups gehen dann noch equity mit also also ich sag mal optionen später bei einem liquidations event aktien zu einem vergünstigten strike preis zu kaufen. Alles ein bisschen, ziemlich viel bla bla und Wirtschaftskram. Punkt ist, falls die Firma irgendwann public geht oder verkauft wird, dass man dann ein bisschen am Unternehmensgewinn, ich sag mal, beteiligt ist. Das ist virtuelles Geld so lange, bis man es wirklich veräußern kann, was offengesprochen in den letzten paar Jahren nicht so oft passiert ist, weil die wirtschaftliche Lage nicht so gut war.",
      "start": 6378862,
      "end": 6449803,
      "confidence": 0.7982146341463414,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich glaube, wichtig ist einfach, dass man verhandelt, wenn man nicht zufrieden ist, weil man hat immer noch die Möglichkeit, irgendwann Ja zu sagen. Also wenn die Firma sagt, nein, wir können nicht höher gehen, dann hast du immer noch die Möglichkeit. Also du wirst dir nicht rausgekickt aus dem Prozess nur, weil du sagst, okay, könnt ihr mir mehr bieten oder habt ihr andere Möglichkeiten, anderen Spielraum irgendwo. Und ich würde es halt auch immer so empfehlen, dass man das eigentlich immer der Firma zuschiebt, dass man halt sagt, macht mir ein Angebot, ihr kennt den Markt perfekt, ihr wisst, was intern möglich ist, was die anderen bei euch in der Firma verdienen, macht ein Angebot und wenn man nicht zufrieden ist, einfach, ja, gibt's irgendwo Möglichkeiten, gibt's Handlungsspielraum, ihr wisst ja, was möglich ist bei euch intern, macht mir ein Angebot. Und da gar nicht zu sehr hart auf eine Nummer oder so gehen auf den Preis.",
      "start": 6450958,
      "end": 6496304,
      "confidence": 0.8037421383647795,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn du zufrieden bist, würdest du dann nicht mehr nachverhandeln? Also nimmst du dann auch das Erste, was sie dir geben?",
      "start": 6496602,
      "end": 6502705,
      "confidence": 0.7162380952380952,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Habe ich schon. Jetzt so im Nachhinein, wo ich den Markt besser kenne und auch die Firmen, es ist eigentlich nie so, dass du das Maximum am Anfang bekommst.",
      "start": 6502745,
      "end": 6512391,
      "confidence": 0.8668965517241382,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und zwar würde ich mindestens immer einmal versuchen nachzuverhandeln. Nicht, weil ich geldgierig bin, sondern einfach nur, wenn man einmal drin ist und man wird deutlich geringer als andere bezahlt, ein 20% Salary Bump, um dich auf selben Level zu heben, ist so gut wie noch nie passiert. Sondern die Schwelle wird immer bei der Einstellung gesetzt. Aus welchen Gründen auch immer, sehr viele Firmen das nicht machen, ich verstehe es nicht. Ich würde vorschlagen, immer einmal mindestens nachzuverhandeln. Für mich ist das immer so ein bisschen Training, mich aus der Komfortzone rauszukicken, muss ich zugeben. Ich hasse Sales, ich hasse Verhandlungen, ich bin kacke darin. Und immer wenn ich mich traue, weil ich hab ja schon ein Angebot, also die wollen mich ja, also ich hab ja eine Bestätigung, also bin ich auf der starken Seite, dann kann ich auch jetzt mal eben kurz ins Schwitzen geraten, die zwei Minuten. Weil es sind zwei Minuten, die du darüber sprichst. Und zwei Minuten können wirklich dir den Traum des Hauses verwirklichen oder nicht. Ich weiß jetzt nicht, ein bisschen übertrieben gesagt, aber es kann wirklich einen Unterschied machen.",
      "start": 6512431,
      "end": 6574949,
      "confidence": 0.7617074468085107,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und vor allem ist ja alles, bevor du das aussprichst, der unangenehme Part. Also wirklich dieses Überwinden, das ist das, wo man so denkt, oh fuck, jetzt muss ich da aber noch mal rein. Also ich hatte das einmal, da musste ich meine Zahl, die ich im Erstgespräch genannt habe, noch mal nach oben korrigieren und das war furchtbar für mich. Da hatte ich im ersten Gespräch eine Zahl gesagt und war dann im Nachgang so ein bisschen so, okay, irgendwie eigentlich passt diese Zahl nicht und musste dann im dritten Gespräch nochmal sagen, übrigens, ich hätte da nochmal ein Thema, wir müssen nochmal über die Eckdaten sprechen.",
      "start": 6575746,
      "end": 6606065,
      "confidence": 0.8051296296296299,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Darum ist es, glaube ich, wichtig, keine Zahl zu nennen, möglichst lange zumindest. Das machen ja die meisten in dem Interviewprozess sehr früh und die wollen da auch eine Zahl, aber eigentlich kann man das normal immer rauszögern oder eine Range geben oder eine sehr hohe Range, einfach so ganz grob, damit es nicht ganz off ist. Aber ich würde mir auf keine Zahl möglichst lange festlegen.",
      "start": 6606475,
      "end": 6628368,
      "confidence": 0.8122388059701493,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich meine, es war dann im Endeffekt auch alles in Ordnung und ich konnte das noch mal nach oben korrigieren. Und mein Gegenüber war da auch sehr empathisch und meinte, du brauchst dich ja auch gar nicht unter Marktwert zu verkaufen und war da sehr wohlwollend. Aber es war schon ein innerer Kampf, so ein bisschen. Und vielleicht auch für alle, die noch nie verhandelt haben. Was ich damals gemacht habe, ist, ich bin von einer Werkstudentin in eine Festanstellung übergegangen. Ich habe vorher meinen Chef gefragt. Ich meinte zu ihm, hey, ich habe gar keine Ahnung, wo ich mich einordnen soll. Kannst du mir irgendwie einen Spielraum nennen? Und er meinte dann, Ellen, auf jeden Fall über XK im Jahr. Und dann konnte ich mich daran orientieren und das als Basis für meine Verhandlungen benutzen. Also da irgendwie eine Form von Marktwert abchecken, hat mir auf jeden Fall geholfen.",
      "start": 6628580,
      "end": 6672973,
      "confidence": 0.7868940397350989,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Beziehungsweise es gibt ja auch die Möglichkeit, selber zu fragen, was ist denn eure Range von der Jobposition? Also gar nicht selber irgendeine Zahl sagen, sondern das frühzeitig fragen, weil dann sitzt du am längeren Hebel und dann einfach sagen, macht mir ein faires Angebot und dann geht's weiter.",
      "start": 6673894,
      "end": 6689693,
      "confidence": 0.7990816326530612,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Total sinnvoll.",
      "start": 6689853,
      "end": 6691014,
      "confidence": 0.359,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Nicht nur total sinnvoll, meines Erachtens nach Pflicht, weil der Punkt ist einfach, wenn man nach der Gehaltsrange fragt und dann nichts bekommt, kann man nicht wissen, wo man mit seinem Gehalt ist und ob die Stelle überhaupt für relevant ist, weil du investierst so viel Zeit während des Interviewsprozesses. Das ist eine meiner ersten Fragen, wie sieht die Gehaltsrange aus? Und dann wird mir oft irgendwas gesagt, dann kann ich sagen, okay, ich verdiene jetzt gerade aktuell mehr oder was weiß der Geier nicht. Weil verschlechtern möchte man sich ja auch nicht.",
      "start": 6691034,
      "end": 6721334,
      "confidence": 0.82141935483871,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Viele Firmen haben natürlich keine Range, das ist ein Problem, aber dann kannst du ja fragen, okay, was verdient bei euch irgendwie ein Senior Developer? Ich weiß nicht, vielleicht bin ich kein Senior, aber nur mal zur Orientierung, was verdient ein Senior bei euch oder so irgendwas? Also, dass man in irgendeine Zahl kommt.",
      "start": 6721354,
      "end": 6735860,
      "confidence": 0.7274629629629629,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da wir grad schon über das Gehalt als Endgegner gesprochen haben und danach oft das Videogame zu Ende ist, kommen wir auch mal gegen Ende zu dieser Aufnahme. Dodo, Ellen, habt ihr noch etwas, was ihr unseren Hörerinnen und Hörern mitgeben wollt? Etwas, wenn diese Personen eine Sache von dieser langen Episode behalten sollen, was wäre es?",
      "start": 6735940,
      "end": 6759683,
      "confidence": 0.8687017543859648,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Weil wir jetzt so lange über Firmen, Bewerbungsprozesse etc. gesprochen haben. Ich glaube, das, was ich mir gerne öfter sagen würde, wenn ich das mache, ist erstens, dass ich ja auch einen Ort finden möchte, wo ich mich wohlfühle und wo ich irgendwie zufrieden bin. Das heißt, ein Bewerbungsprozess ist nicht nur, dass jemand anderes mich nehmen muss und dass ich mich da irgendwie gut präsentieren muss, sondern dass ich auch herausfinden muss, Wo passe ich gut hin? Und dann auch dieses so, wenn man abgelehnt wird und einen Misserfolg hat, dann ist das vielleicht auch in Ordnung und dann entweder lernt man total viel oder es war wirklich besser so. Und ich glaube, wenn man mit einer Einstellung da rangeht, die sagt, okay, ich möchte irgendwie neue Sachen lernen und ich möchte mich weiterentwickeln und das ist, egal was rauskommt, ist es auf jeden Fall was Positives. Auch wenn ich zum Beispiel bei der Firma bleibe, weil ich dann irgendwie festgestellt habe, okay, irgendwie gefällt es mir hier doch ganz gut. Ich glaube, immer diesen positiven Aspekt zu sehen, das ist, glaube ich, das, was ich mir gerne öfter raten würde.",
      "start": 6759997,
      "end": 6821784,
      "confidence": 0.8266197916666665,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Ich kann bei einem Punkt davon auch direkt anknüpfen. So diese Sichtweise von, du musst dich nicht bei anderen anbiedern, sondern du kannst auch Anforderungen stellen. Das wäre so ein Punkt, den ich gerne noch mal mitgeben wollen würde. Im Sinne von, du hast jetzt einen Job angefangen und oh mein Gott, diese sechs Monate Probezeit, schaffe ich die eigentlich? Probezeit ist ein beidseitiges Ding. Also nicht nur die Angestellten haben eine Probezeit, die sie überstehen müssen, sondern auch die Firma muss die Probezeit bei dir überstehen. Und das finde ich total wichtig und nimmt auch Druck raus. dass man das nicht vergisst, dass das eben auch andersrum passen muss.",
      "start": 6822887,
      "end": 6858034,
      "confidence": 0.8089363636363635,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Vielen lieben Dank an euch beide, dass ihr euch die Zeit genommen habt, mit uns eine Episode zu diesem Thema aufzunehmen. Ich hoffe, Wolfgang hat die ursprünglichen Wünsche erfüllt bekommen, dass jemand mal einer anderen Meinung ist, da Wolfgang und ich in dieser Podcast-Ehe anscheinend unsere Meinungen über Zeit angeglichen haben.",
      "start": 6858074,
      "end": 6879940,
      "confidence": 0.8510196078431372,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Vielen Dank für das Meinungsspektrum heute. Sogar wir waren uns nicht einig, Andi.",
      "start": 6881198,
      "end": 6884967,
      "confidence": 0.7292307692307692,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "An alle Hörerinnen und Hörer, falls ihr mehr von Dodo und Ellen hören wollt, schaltet doch mal in den Unmute It Podcast rein. Verlinken wir natürlich auch in den Shownotes, weil diese beiden sprechen nicht nur alleine, ab und zu auch mit Gästen über diverse Themen, wo unser Podcast ab und zu mal eine Überschneidung hat. Da geht es nämlich nicht nur um Technik, sondern eigentlich auch um viel, viel mehr. Deswegen einfach mal reinhören. Dodo, Ellen, Wolfgang, vielen Dank für eure Zeit.",
      "start": 6886826,
      "end": 6915453,
      "confidence": 0.7878674698795181,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Danke euch.",
      "start": 6915853,
      "end": 6916253,
      "confidence": 0.2945,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Wir haben jetzt 2 Stunden 42 auf der Uhr, vielleicht für alle, die es interessiert.",
      "start": 6917033,
      "end": 6922015,
      "confidence": 0.609,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das war bisher die längste Aufnahme im Engineering-Kiosk-Studio.",
      "start": 6922035,
      "end": 6926796,
      "confidence": 0.85525,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich bin gespannt, was am Ende rauskommt.",
      "start": 6926956,
      "end": 6928697,
      "confidence": 0.5811428571428571,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich auch.",
      "start": 6929257,
      "end": 6930417,
      "confidence": 0.5846666666666667,
      "speaker": "D",
      "channel": null
    },
    {
      "text": "Und ich habe trotzdem das Gefühl, es waren so viele Punkte dabei, wo wir noch tiefer hätten reingehen können. Von daher vielen, vielen Dank für das Gespräch. Und bis zum nächsten Mal, würde ich sagen.",
      "start": 6930437,
      "end": 6940060,
      "confidence": 0.754542857142857,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wir beenden jetzt diese Podcast-Formel, weil wir haben alle Hunger.",
      "start": 6940080,
      "end": 6942161,
      "confidence": 0.6508999999999999,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja.",
      "start": 6942661,
      "end": 6943061,
      "confidence": 0.603,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Guten Appetit. Bis zum nächsten Mal. Tschüss zusammen.",
      "start": 6943081,
      "end": 6946262,
      "confidence": 0.44625000000000004,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Tschüss! Tschau!",
      "start": 6946842,
      "end": 6949746,
      "confidence": 0.4125,
      "speaker": "D",
      "channel": null
    }
  ],
  "confidence": 0.785238855524634,
  "audio_duration": 6893,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}