{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/6b2ecca1-a2ff-4da0-b55c-eb5cc0577399/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "speech_model": null,
    "id": "1dd23291-d892-4b0d-a2d3-fc659bd74fcd",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Das Brot ist den Deutschen heilig. Manche bezeichnen Deutschland sogar als Brotnation. Der 21. April ist sogar Tag des deutschen Brotes. Was es nicht alles gibt. Ziemlich viel Wind und irgendwie klingt das alles sehr kompliziert. Aber die Grundzutaten eines Sauerteigbrotes sind recht simpel. Mehl, Wasser, Salz und ein wenig Zeit. Vielleicht ist das auch der Grund, warum es so viele Leute zu Hause ausprobieren und ihr eigenes Brot backen wollen. Und es kommt mir so vor, als sind es überproportional viele Leute aus dem Softwarebereich. Einer, der das Brotbacken demokratisieren möchte, ist Hendrik Kleinwächter. Als gelernter Softwareengineer overengineert er das Ganze etwas und macht es dadurch für uns alle zugänglicher. Mit Brotbackrezepten war er lange auf der Hacker News Startseite. Mittels AB-Tests versucht er die beste Backmethode zu finden. Einkorn oder Emmer Vollkornmehl? Geölte Leibform oder Leibform mit Pergamentpapier? Sauerteiggärung mittels Fruchtfliegen? Gar kein Problem, wird getestet. Er visualisiert den Backprozess mit Float Charts und hat ein Buch über Sauerteigbrot geschrieben und es unter einer Open Source Lizenz auf GitHub zur Verfügung gestellt. Das ist so skurril wie es klingt und dazu haben wir natürlich Fragen. Es geht ums Brotbacken mit einem Software Engineering Mindset. Und in dieser Episode gibt es noch eine kleine Besonderheit. Wenn ihr bis zum Ende dranbleibt, dann gibt es da auch ein tolles Gewinnspiel. Viel Spaß dabei.",
            "start": 3164,
            "end": 86144,
            "confidence": 0.7773542600896864,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi, hast du mal überlegt, ich hätte mir einen coolen Vorschlag für einen neuen Gast für ein Interview und zwar würde ich gerne mal einen Influencer einladen.",
            "start": 86204,
            "end": 93408,
            "confidence": 0.6320000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du hast wirklich einen am Sender. Das kommt mir hier nicht in die Tüte. Am Arsch kommt hier ein Influencer rein.",
            "start": 93448,
            "end": 100011,
            "confidence": 0.8445238095238097,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber ich habe einen guten Influencer. Klar, ich bin ja nicht irgendwie so ein Influencer wie dein Finder oder so, den du so gerne hast, sondern ein richtig cooler Influencer, der eigentlich Developer ist.",
            "start": 100051,
            "end": 109836,
            "confidence": 0.7080882352941176,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Diesen Quote würde ich gerne nehmen, falls du wirklich einen Influencer einladen solltest und dieser Influencer fällt mir auf die Mütze, wie zum Beispiel Fynn Kliemann, dann halte ich den vor mit so einem I told you so Dance.",
            "start": 109856,
            "end": 120502,
            "confidence": 0.7528974358974359,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, du bist ja immer noch ein Fan außerdem, so viel mal dazu. Aber ich mache das jetzt einfach, ist mir vollkommen egal, was du sagst. Darum, guten Tag Hendrik.",
            "start": 120522,
            "end": 128485,
            "confidence": 0.793,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Moin, guten Tag.",
            "start": 128526,
            "end": 129487,
            "confidence": 0.5823333333333333,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Henrik, schön, dass du dir die Zeit genommen hast und in unserem Podcast erscheinst. Lass mich dich kurz vorstellen. Wer bist du? Henrik Kleinwächter aus dem schönen Hamburg. Moin moin sozusagen.",
            "start": 130487,
            "end": 141632,
            "confidence": 0.7936451612903225,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Moin.",
            "start": 141712,
            "end": 142612,
            "confidence": 0.678,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du bist ursprünglich in der Ruby-Welt zu Hause. Heutzutage beziehungsweise laut deines LinkedIn-Profils wird man dich als Entrepreneur oder in Anführungszeichen Startup-Gründer bezeichnen. Ich bezeichne dich eigentlich sehr umtriebig mit deinen Ideen.",
            "start": 142672,
            "end": 156979,
            "confidence": 0.8360937499999997,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Moment, wir haben von Influencer gesprochen. Jetzt kommst du damit Entrepreneur.",
            "start": 156999,
            "end": 159900,
            "confidence": 0.6495454545454545,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du hast mich immer als nordsee krabbe damals bezeichnet an die das ist auch.",
            "start": 160220,
            "end": 164264,
            "confidence": 0.676,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "So für mich ja weil hamburg norden aus duisburg nun gut du hast vor einer ganzen weile eine agentur gegründet die unter anderem tech produkt und ux beratung macht aber auch mvp umsetzung und startup ideen und so weiter und sofort mit dem namen dive, Dive ist inzwischen ein sogenanntes Purpose-Unternehmen mit über zehn Leuten und ein Purpose-Unternehmen ist, soweit ich das verstanden habe, das ganze Unternehmen ist in kompletter Mitarbeiterhand sozusagen. Er nickt gerade für die ganzen Leute auf dem Ohr. Wir kennen uns durch deine Arbeit bei Trivago. Du hast sogar mal offiziell für den Wolfgang reported, soviel ich das weiß.",
            "start": 164424,
            "end": 204628,
            "confidence": 0.8300776699029127,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber nur ganz kurz, weil Hendrik konnte in so einem festen Teamumfeld einfach nicht arbeiten. Er ist zu wenig weitergegangen, sofort ausgebrochen und hat da die gesamte Firma von anderer Stelle revolutioniert.",
            "start": 205240,
            "end": 219095,
            "confidence": 0.8369999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich kann das verstehen, dass du das mit Wolfgang nicht so lange ausgehalten hast. Inzwischen bist du professioneller CTO in der Automotive-Industrie, aber dafür, du bist kein Influencer für die Automotive-Industrie, sondern du bist Influencer durch dein letztes Projekt The Bread Code. Kann man dich als Brot-Influencer, Brot-Back-Influencer bezeichnen?",
            "start": 219115,
            "end": 240722,
            "confidence": 0.7214285714285713,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube schon und es ist mir tatsächlich auch peinlich. Ich war auf einem Entwicklermeetup in Budapest vor einiger Zeit und ich bin noch nie von irgendjemandem erkannt worden. Aber zum ersten Mal hat mich eine Person erkannt und kam zu mir. Hey, ich kenne dich doch. Du bist doch der von YouTube. Und das war auch ein Software-Entwickler, ein Front-Entwickler, der zu mir kam und meinte, boah, voll geil, dank dir habe ich gelernt, wie man richtig geiles Brot backen kann. Das ist das erste Mal, dass ich irgendwo entdeckt bzw. erkannt worden bin.",
            "start": 241687,
            "end": 270611,
            "confidence": 0.7951473684210528,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich habe ja auch ziemlich früh mit Brot backen angefangen, darum war ich immer ein großer Fan von deinen Videos. Und ihr habt es sehr stark betrieben, auch wie ich in Holland gelebt habe, in Amsterdam. Und wenn man da in den Supermarkt geht und so ein Brot kauft, Brot kriegt man sowieso nicht in Holland. Wenn man dort Mehl einkauft, dann gibt es dort Mehl. Wenn man dann aber diese Deutschen anschaut, nur ein bisschen über die Grenze geht, oder in Österreich ist es eigentlich so ähnlich, dann gibt es ja 100.000 Mehlsorten mit ganz vielen Mahlgrädern. Ist das die Mehrzahl? Graden?",
            "start": 270631,
            "end": 301354,
            "confidence": 0.7570679611650483,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Mahlgraden, ja.",
            "start": 301474,
            "end": 302554,
            "confidence": 0.5565,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Was ist dein Lieblingsmahlgrad?",
            "start": 302594,
            "end": 303915,
            "confidence": 0.8755,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Oh, das ist schwierig zu sagen. It depends.",
            "start": 305195,
            "end": 308838,
            "confidence": 0.7665000000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Man sieht schon, du bist eine Tech-Person, eindeutig.",
            "start": 308858,
            "end": 313061,
            "confidence": 0.5665000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Ich habe damals angefangen, Brot zu backen, als ich studiert habe. Da habe ich in Göttingen studiert. Und das ging eigentlich alles damit los, dass ich mir Honig im Supermarkt kaufen wollte. Und wenn ihr mal in den Supermarkt reingeht und dann ist da ein Honigregal, dann schaut ihr, nehmt einfach irgendein Glas Honig und guckt mal drauf. was da draufsteht, woher der Honig kommt, und dann steht da sowas drauf wie Mischung aus EG- und Nicht-EG-Ländern. Und da dachte ich mir so, hä? Das ist doch eigentlich die ganze Welt, oder nicht? Dann habe ich angefangen darauf zu achten, was ich mir für Honig kaufe, und dann war der nächste Schritt draufzuschauen beim Brot, was ist denn eigentlich in so einem Brot drin? Und da waren da so viele Zutaten drin, dass ich mir dachte, das kann doch eigentlich nicht normal sein. Das hat nichts mit dem geilen Brot zu tun, was Mama damals für mich gebacken hat, was frisch aus dem Ofen kam, so richtig noch warm war, eine gute Kruste hatte, so ein bisschen Butter einfach nur da drauf und du hast eine Scheibe gegessen und dachtest, das ist das geilste Brot überhaupt. Und wie Produkte heutzutage im Supermarkt nichts mehr mit dem ursprünglichen Brot zu tun haben können, das hat mich irgendwie sehr stark zum Nachdenken bewegt. Und da dachte ich, okay, das musst du dir doch mal im Detail anschauen. Das kann doch nicht so schwierig sein, jetzt ein Brot zu backen. Ja, und dann ist halt eins zum anderen gekommen. Und jetzt bin ich dann wohl der Brot-Influencer geworden.",
            "start": 313101,
            "end": 392753,
            "confidence": 0.7742218045112786,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du bist ja kein klassischer Influencer. Du bist ja eigentlich Entwickler und kommst aus der ganzen Tech-Welt. Und du hast es ja sehr speziell angegangen, würde ich mal sagen, deine ganze Brotreise. Und zwar hat es ja begonnen mit einem Hacker-News-Eintrag, den ich mir auch rausgesucht habe, der eigentlich überhaupt nicht performt hat. Da waren irgendwie nur ein, zwei Upvotes. Das war so 2018. Hattest du da irgendwie Die falsche Plattform oder hast du dir gedacht die technischen Leute interessieren sich jetzt für Brot oder wo war dein Zusammenhang überhaupt und wie hat es dann funktioniert.",
            "start": 394635,
            "end": 427868,
            "confidence": 0.8033229166666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also wenn man jetzt ein Brot backt da gehen wir sicherlich gleich auch nochmal drauf ein ins Detail was man genau dafür machen muss dann ist das ein Prozess man, Befolgt irgendein Rezept, was man findet und 99 Prozent beim ersten Mal schlägt das total fehl und hat dann irgendwie so einen harten Knüppel gebacken, der überhaupt nicht schmeckt und so weiter, weil man kann nicht einfach Rezepte, die man irgendwo findet, eins zu eins befolgen, weil du eben, wie du schon gerade gesagt hast, Wolfgang, Die Mahlgrade sind unterschiedlich, die Mehle sind unterschiedlich, dann sind die Hefen unterschiedlich, die Temperatur ist unterschiedlich. Das heißt, man wird scheitern das erste Mal, wenn man Brot backt. Und ich habe dann angefangen, meine ganzen Sachen, meine Findings alle aufzuschreiben in einem Git-Repository. Und das war dann der Breadcode. Und da dachte ich mir, okay, geht das doch eigentlich perfekt, weil dann kann ich dokumentieren, wie verändern sich meine Rezepte auch mit der Zeit, dass Leute sehen können, eigentlich über die Historie, was sind denn meine Learnings gewesen. Und ich glaub, weiß nicht, ob das erste Mal erfolgreich gewesen ist, aber das zweite Mal, als ich das dann bei Hacker News reingestellt hatte, das ist dann super erfolgreich gewesen.",
            "start": 427908,
            "end": 496162,
            "confidence": 0.8054999999999998,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, das war dann, glaub, zwei Monate später, ein Monat später sogar, und das hat dann plötzlich 619 Upvotes bekommen. Und 619 Upvotes, wer Hacker News kennt, das ist schon ... Sehr stark, also da warst du wahrscheinlich sogar auf der Startseite, zumindest eine gewisse Zeit.",
            "start": 496322,
            "end": 512355,
            "confidence": 0.7035217391304347,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Eine gewisse Zeit, und es sind auf jeden Fall super viele Leute auf mich zugekommen und meinten, boah, wie geil sie das finden. Und ich hab viel an Open Source gearbeitet, aber nichts war so erfolgreich wie mein erster Set an Brotbackrezepten bei GitHub.",
            "start": 512455,
            "end": 526319,
            "confidence": 0.7910681818181817,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Hast du da eigentlich irgendwas geändert auf GitHub, oder war das wieder ein klassischer Hacker-News-Zufall, dass es das erste Mal nicht performt hat?",
            "start": 526339,
            "end": 532300,
            "confidence": 0.6184347826086958,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaub, das war ein klassischer Hacker-News-Zufall einfach. Wahrscheinlich irgendwie der Algorithmus hat gesehen, da haben jetzt zwei, drei Leute in kurzer Zeit auf Upvote geklickt oder so und dann ist das irgendwie viral gegangen. Es war auch so, ich hab das irgendwann abends gepostet. Ich weiß auch, als wir bei Trivago waren, da hatte ich das zu Ende geschrieben, reingestellt, bin irgendwie ins Bett gegangen und am nächsten Morgen hatte das einfach unfassbar viele Upvotes dann an der Stelle. Hätte nie gedacht, dass Leute sich für sowas wie Brot so stark interessieren könnten. Aber es scheint irgendwie ein Techie-Thema zu sein, das Brotbacken.",
            "start": 532340,
            "end": 563616,
            "confidence": 0.7576153846153846,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Bevor wir ein bisschen tiefer in dein The-Bread-Code-Projekt reingehen und vielleicht auch mal auf den Grund dieses Hacker-News-Erfolgs gehen, was würdest du denn sagen, ich mein, du hast grad auch gesagt, du warst fasziniert, dass so viele Leute sich fürs Brotbacken interessieren. Im Endeffekt hast du ja genauso angefangen. Du hast dich fürs Brotbacken interessiert. Du hast dich an deine Kindheit erinnert. Ich möchte mal wieder das geile Brot von Oma. Und wir Deutschen, ich weiß, der Wolfgang versteht das nicht so ganz, Wir sind ja wirklich bekloppt, wenn man mal über Brot nachdenkt, fahr nach Australien, da gibt es deutsche Bäckereien, fahr in die USA, versuch mal was anderes außer Toastbrot zu finden. Aber du hast ja auch initial gesagt, im Brotbacken hat sich denn gar nicht so viel geändert. Doch ist das wirklich so also ich meine man sagt ja heutzutage alles ist irgendwie kaputt ja manche leute sagen die politik werden kaputt viele techniker sagen das internet ist kaputt und dns ist auch nicht distributed und ich möchte jetzt von dir wissen als brotinfluencer was ist denn eigentlich am modernen brot backen kaputt.",
            "start": 564297,
            "end": 627260,
            "confidence": 0.8102634408602154,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wenn wir die ganze Geschichte der Welt aufteilen in ein Jahr und dann ist quasi Geburt unserer Erde ist vor ungefähr 4,2 Milliarden Jahren, das wäre der 1. Januar und wir reden jetzt quasi Mitternacht die aktuelle Zeit. Wenn wir das aufteilen so in einen riesigen Zeitstrahl, dann gibt es eigentlich seit dem 3. März oder seit März irgendwie Leben bei uns in den Ozeanen. Dann gab es irgendwie das erste Mal am 1. September gab es Leben an Land. Irgendwie Ende November, da gab es dann zu dem Zeitpunkt tatsächlich auch schon Häfen und Mikroorganismen, die gelebt haben. Und Ende November gab es dann die ersten Dinosaurier. Anfang Dezember hat dann angefangen Pangea, unser Superkontinent, sich irgendwie aufzuteilen. Am 27. Dezember ungefähr sind die Dinosaurier gestorben. Wir selbst als Menschen sind am 31. Dezember auf die Welt gekommen. Vor zwölf Sekunden ungefähr, das sind vor 12.000 Jahren, ist im ehemaligen Jordanien das erste Brot gebacken worden und vor ungefähr einer Sekunde, wir haben 12.000 Jahre lang natürlich Brot gebacken und dann haben wir, Louis Pasteur hat entdeckt, dass es Hefepilze gibt und hat dann zum ersten Mal rein Hefe isoliert aus ursprünglichen Sauerteigen und was vorher, keine Ahnung, 20 Stunden gedauert hat, einen Brotteig zu backen, ging auf einmal innerhalb von einer Stunde. Oder die gesamten Prozesse, die du hast, um einen guten Brotteig herzustellen, mit viel Geschmack und so weiter, das ist nichts, was du einfach so super schnell innerhalb von einer Stunde hinbekommen kannst. Und das ist ein Prozess, der braucht eine gewisse Zeit. Ihr könnt euch das so vorstellen, wenn ihr ein Keim habt, der Keim wandelt sich ja irgendwann in Grünzeugs auf, das Rauswack wächst aus diesem Keimling. Weil in diesem Keimling ist nur die ganze Energie drin, die die Pflanze irgendwann braucht zum Wachsen. Und das ist letztendlich das, was ein gutes Brot ausmacht. Diese Prozesse passieren immer noch. Natürlich kann jetzt keine grüne Pflanze mehr entstehen, aber diese biochemischen Prozesse finden einfach noch statt. Und die können nicht in einer Stunde stattfinden, sondern die brauchen eine gewisse Zeit. Und deshalb ist es so wichtig, dass wenn man einen Teig hat, dass der Teig lange geht, fast über 24 Stunden damit diese Prozesse stattfinden. Am Ende, was ihr esst, ist nicht den Keim ursprünglich, sondern ihr esst ein komplett anderes, komplett biochemisch anderes Produkt an der Stelle. Und das ist das, was kaputt ist bei dem Brot heutzutage, weil es einfach viel zu schnell geht, viel zu schnell fermentiert. Das heißt, es hat nicht mehr diesen Umwandlungsprozess durchgemacht, den es eigentlich ursprünglich durchgemacht hat. Und um das dann hinzubekommen, dass es in einer Stunde gut funktioniert, können noch bis zu 250 weitere Stoffe reingemischt werden in den Brotteig, die nicht mal auf der Verpackung angegeben werden müssen, nur um diese biochemischen Prozesse schneller zu machen an der Stelle.",
            "start": 627820,
            "end": 807253,
            "confidence": 0.8337468354430382,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also würdest du sagen, auch das Brot ist ein Opfer der sogenannten Industrialisierung geworden?",
            "start": 807533,
            "end": 812718,
            "confidence": 0.807,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Auf jeden Fall, genau. Das Brot, was wir ursprünglich gegessen haben, hat nichts mehr zu tun mit dem Brot, was wir heute essen. Es ist ein komplett chemisches Produkt letztendlich.",
            "start": 812758,
            "end": 822268,
            "confidence": 0.8695666666666669,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wie lange dauert die Herstellung eines Brotes, wenn du's backst?",
            "start": 822528,
            "end": 825609,
            "confidence": 0.7962,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "In der Regel auch so 24 Stunden, der ganze Prozess. Das heißt nicht, dass ich jetzt 24 Stunden da sitze und was mache die ganze Zeit. Meine Arbeitszeit sind vielleicht drei Minuten oder so. Aber du musst einfach das Ganze zusammenklatschen, mischen und dann wartest du, lässt es einfach stehen und lässt es fermentieren. Und am Ende isst du nicht mehr das ursprüngliche Korn, sondern am Ende kann man sagen, isst man nur noch Abfallprodukte von Bakterien und Tiefen. Also man ist ein komplett verstoffwechseltes Produkt. Das hat nichts mehr mit dem ursprünglichen Produkt aus der Natur zu tun.",
            "start": 825649,
            "end": 858041,
            "confidence": 0.849444444444444,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "War das damals, 2018, ihr habt nachgeschaut, dein erstes Video, zumindest das, was noch online ist, am 1. Mai 2018. War der Inhalt von diesem Video genau das, was du jetzt erzählt hast? Oder wie bist du auf die Idee gekommen, jetzt da ein Video auf YouTube hochzuladen?",
            "start": 858081,
            "end": 872711,
            "confidence": 0.7349583333333336,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also ich wollte nie mein Gesicht zeigen bei YouTube.",
            "start": 873493,
            "end": 876654,
            "confidence": 0.8031111111111112,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube da war dein Gesicht auch noch nicht drinnen in dem Video, wenn ich nicht alles täuscht. Ich habe mir die ersten paar Minuten angeschaut, da sieht man prima deine Hände und wie du mit dem Brot arbeitest.",
            "start": 876694,
            "end": 888298,
            "confidence": 0.7127435897435899,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn ich jetzt den Leuten schreibe, okay ihr habt jetzt einen Teig, den müsst ihr jetzt so mischen und dann müsst ihr den Teig irgendwie so falten zum Beispiel an der Stelle. Das ist halt schwierig, das per Text zu beschreiben. Und das war eigentlich nur der Grund, weshalb ich mich entschieden habe, ein paar YouTube-Videos dazu noch zu machen, um das einfach besser visualisieren zu können an der Stelle.",
            "start": 888318,
            "end": 906492,
            "confidence": 0.7252285714285716,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wann hat es dann Klick gemacht, dass du da mehr Zeit investiert hast? Und dann sind über 200 Videos mittlerweile. Warum? Oder ist es dann irgendwann explodiert? Oder wie kommt man überhaupt auf die Idee? Vor allem als Developer, auch wenn man jetzt vielleicht kein Problem hat mit sozialen Kontakten, aber es ist ja doch sehr, sehr outgoing, sich dann vor der Kamera zu zeigen und wirklich sich in die Auslage zu stellen eigentlich.",
            "start": 906532,
            "end": 932837,
            "confidence": 0.8278783783783785,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist eine gute Frage. Ich habe gemerkt, ich habe die ersten Videos gemacht, und dann dachte ich mir, okay, die Leute, das, was ich an Feedback bekomme, ist gut, die Leute finden das sehr interessant, die lernen was, sind dankbar dafür, schreiben, boah, ich habe voll viel gelernt, Hendrik, dank deiner Videos, dann dachte ich mir, okay. Möchtest du das jetzt mal testen, ob das theoretisch auch als YouTube-Kanal funktionieren kann? Da ich ja selbst Softwareentwickler bin und sehr analytisch, habe ich mir dann angefangen, die Metriken anzuschauen bei YouTube, was denn wichtig ist für den YouTube-Algorithmus. Und dann habe ich halt nach und nach durch AB-Tests herausgefunden, was anscheinend gute Kombinationen sind, um erfolgreich YouTube-Videos zu produzieren. Und das ist tatsächlich auch das, was ich dann viel gemacht hab, weshalb mein Kanal so erfolgreich ist, dass ich wirklich immer unterschiedliche Titel teste, unterschiedliche Thumbnails, also Bilder, die angezeigt werden bei YouTube. Und so hab ich dann nach und nach auch, wie ich die Videos produziere, die sind mittlerweile sehr anders, als wie ich sie damals produziert habe, das so hinzubekommen, dass das möglichst gut durch den YouTube-Algorithmus verbreitet werden kann.",
            "start": 933457,
            "end": 993734,
            "confidence": 0.7973072916666669,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt sind wir schon mittendrin in deinem Projekt Brot backen oder ein Software Engineering Mindset ans Brot backen. Und die ganze Sache hat mit dem ersten Projekt von drei inzwischen, so wie viel ich das weiß, angefangen. The Bread Code. Das zweite Projekt hat es von einmal bis ein bisschen weg vom Brot zum Pizzateig hingegangen. Und dann natürlich noch dein letztes Projekt, sogar ein komplettes Buch. Das heißt sogar The Sourdough Framework. Also ebenfalls wieder was Engineering-Technisches. Wenn du deine Brotreise mal, ich sag mal, wenn du The Bread Code als ersten Teil deiner Brotreise beschreiben würdest, wie würdest du das heutzutage jemandem erklären, was The Bread Code ist?",
            "start": 993934,
            "end": 1037796,
            "confidence": 0.7694000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "The Bread Code ist eine Symbiose aus meiner Liebe zur Softwareentwicklung und der Liebe des Brotbackens, würde ich sagen. Das beschreibt The Bread Code eigentlich ganz gut. Und das nutzt die Praktiken, die wir wichtig finden, der Softwareentwicklung, um Leuten beizubringen, wie man gutes Brot backen kann. Und wir als Softwareentwickler haben das Problem, wir stoßen den ganzen Tag mit dem Kopf gegen die Wand, und es tut super, super, super, super häufig weh, aber wir geben nie auf, wir versuchen immer, die Fehler zu finden, versuchen ein gutes Debugging irgendwie zu haben, und versuchen dann herauszufinden, was ist denn eigentlich der Fehler gewesen an der Stelle. Und das ist auch so ein Stück weit, was ich den Leuten beibringe. Ich bringe den Leuten kein Rezept bei, deshalb auch mein Buch The Sourdough Framework. Meine Videos bringen denen eher wirklich ein Framework bei mit, was sind denn eigentlich die Parameter, auf die ich achten muss, wenn ich jetzt einen Brotteig ansetze, wenn ich mir Mehl anschaue, auf was muss ich alles achten? Und dann kann ich nämlich zu Hause, wenn ich das weiß, dieses Wissen, kann ich meinen eigenen Brotteig gut machen, weil ich dieses Basiswissen habe, die Basis für alles. Also nachdem man meine Sachen sich angeschaut hat, kann man jedes andere Rezeptbuch nehmen, was es da draußen gibt und das dann befolgen und weiß genau, okay, das macht jetzt hier keinen Sinn, das macht die Person einfach so, weil sie dachte, okay, das ist irgendwie cool und ich kann wirklich durch Rezepte Sachen rausstreichen, die keinen Sinn machen zum Beispiel. Das ist so ein bisschen die Idee davon.",
            "start": 1037836,
            "end": 1129665,
            "confidence": 0.8278740740740749,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich find das schön, weil meines Erachtens nach hast du The Breadcode ein bisschen runtergespielt. Weil du auch schon dein analytisches Mindset angesprochen hast, möcht ich jetzt die ganze Sache mal ein bisschen in Zahlen fassen für unsere Hörerinnen und Hörer. The Breadcode sind inzwischen drei GitHub-Repositories. Das eine mit 4.000 Stars, das andere mit 3.500 Stars und das dritte mit 2.500 Stars. Du hast über 30.000 Instagram-Follower und über 220.000 YouTube-Follower. Und du warst mehrere stunden so viel ich weiß sogar fast den ganzen tag auf der startseite von hacker news. Und nur damit das alle verstehen wir reden übers brotbacken und warum. So kommt es mir zumindest vor. Ich weiß nicht, ob ich in einer Bubble lebe, aber warum habe ich das Gefühl, dass alle Leute, die im Tech-Bereich arbeiten, eine Tendenz zum Brotbacken haben? Hast du auch schon mal das Gefühl gekriegt oder bin ich da in einer Bubble und sagst, nee, das ist nicht so, Andi?",
            "start": 1130433,
            "end": 1186868,
            "confidence": 0.7742500000000002,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich weiß nicht, Wolfgang, du backst doch auch gerne Brot, oder?",
            "start": 1187448,
            "end": 1190391,
            "confidence": 0.3284545454545454,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, das ist so ein Hipster-Problem, oder? Das ganze Brotbacken. Und die ganzen Tech-Leute sind ja viele Hipster. Insofern hängt es, glaube ich, einfach direkt miteinander zusammen.",
            "start": 1190431,
            "end": 1199198,
            "confidence": 0.7207777777777779,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ist das so wie Urban Gardening oder was?",
            "start": 1199647,
            "end": 1201808,
            "confidence": 0.5876250000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau. Ob das jetzt viele Techies machen, keine Ahnung. Aber man muss die Wohnung auch nicht verlassen. Das hat ja auch einen Vorteil. Also man kann Hipster sein, ohne rauszugehen. Bei Urban Gardening ist es schon schwieriger.",
            "start": 1201828,
            "end": 1212214,
            "confidence": 0.6973783783783783,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also meiner Meinung nach ja. Es ist natürlich auch ein sehr privilegiertes Problem, würde ich sagen, dass man erstmal überhaupt die Zeit hat, selbst Brot zu backen. Aber es braucht eigentlich auch gar nicht so viel Zeit, um ein anständiges Brot zu backen. Wir aus der Softwarebranche wollen halt gerne wissen, wie etwas funktioniert. Und wir wissen auch, ich glaube, die meisten wissen, wenn sie ein Brot beim Bäcker kaufen, dann ist das in der Regel nicht so geil. Es gibt ja nur noch ganz, ganz wenige Handwerksbäcker, die wirklich noch nach ursprünglichen Prinzipien jetzt Brot backen oder so. Der Rest wird alles, es ist alles kontrolliert von der Industrie letztendlich.",
            "start": 1212254,
            "end": 1245238,
            "confidence": 0.8289189189189186,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber siehst du da jetzt so einen Aufwärtstrend oder einen Trend von Änderungen, weil es gerade zufällig in letzter Zeit, ich glaube auf OMR und Kassenzone, die zwei Podcasts, höre ich ganz gern, da waren jetzt innerhalb kürzester Zeit, glaube ich, drei so Manufakturen, so Bäcker, die das auch teilweise so im größeren Stil dann betreiben und franchiseartig, aber eben auch ganz sauer da und so weiter, ganz klassisch, auch preislich natürlich auf einer ganz anderen Liga als jetzt irgend so ein Kamps oder so in Deutschland. Siehst du da irgendwie so eine Trendwende, dass das wieder akzeptiert wird oder die Leute vielleicht auch Geld ausgeben, mehr Geld ausgeben, freiwillig für gutes Brot.",
            "start": 1245818,
            "end": 1283634,
            "confidence": 0.7820353982300886,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hatte neulich mal mit einer Bäckerei aus Süddeutschland gesprochen, dem Fickinscher Backhaus, Andreas Fickinscher, der macht das irgendwie in 10. Generation oder so. Und die haben seit 400 Jahren die Bäckerei. Das heißt, deren Bäckerei ist einfach mal älter als die USA. Und der hatte mir Zahlen genannt, dass es immer noch so ist, dass aktuell irgendwie zehn Bäckereien durchschnittlich pro Tag in Deutschland verschwinden. Also die Zahlen müssen wir nochmal gegenchecken, aber wir haben immer noch einen klaren Bäckerei-Schwund an der Stelle.",
            "start": 1283654,
            "end": 1312811,
            "confidence": 0.7849880952380953,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Moment mal, wie viele Bäckereien hat Deutschland denn?",
            "start": 1313266,
            "end": 1315627,
            "confidence": 0.7022499999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Viele. Ich meine, ihr habt doch bei euch im Dorf bestimmt auch alleine zwei, drei Bäckereien, oder?",
            "start": 1315667,
            "end": 1320048,
            "confidence": 0.7098235294117647,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nee, leider gar keine. Gar keine?",
            "start": 1320068,
            "end": 1322108,
            "confidence": 0.6705,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Moment, Andi, ich hab bei dir schon mal bei so einer Dorfbäckerei, die aus Duisburg kommt, Brot gekauft.",
            "start": 1322128,
            "end": 1326989,
            "confidence": 0.5980555555555556,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die hat zugemacht.",
            "start": 1327009,
            "end": 1327650,
            "confidence": 0.778,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ah, siehst du?",
            "start": 1327710,
            "end": 1331871,
            "confidence": 0.8426666666666667,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Deswegen haben wir gerade keinen, deswegen war ich so ein bisschen verdutzt. Zehn Stück am Tag machen zu, was natürlich schon echt hart ist.",
            "start": 1331911,
            "end": 1337292,
            "confidence": 0.7506666666666665,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das ist echt eine große Menge, ja. Und deshalb ist, glaube ich, und das, was halt die Alternative ist, ist, natürlich gibt es so ein paar Ausnahmen, irgendwelche Manufakturen, aber in der breiten Masse sinkt die Qualität an Brot immer weiter. Weil es ist ja auch so industriell, man möchte seine Gewinne erhöhen, das heißt, man möchte noch schneller zum Ziel kommen. Und was ist die Lösung? Dass man noch mehr Zusatzstoffe verwendet, um bestimmte Prozesse, die lange dauern, noch schneller zu machen.",
            "start": 1337917,
            "end": 1364632,
            "confidence": 0.7892289156626507,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Was man, finde ich, schon merkt, ist natürlich auch, dass jetzt so in ganzen Hipster-Cafés und so weiter, also wo es Brunch gibt und sowas, da wird halt so dieses Brot auch zelebriert. Also die fangen natürlich jetzt, eben ist halt so diese Hipster-Bubble, aber da ist es schon extrem üblich, da Sourdoughbrot zu haben, vielleicht sogar selbst gemacht. Also, aber vermutlich ist es eher eine Bubble und wenn man auf die Masse geht, auf die reinen Zahlen, dann sieht die Sache natürlich anders aus, klar.",
            "start": 1365852,
            "end": 1389953,
            "confidence": 0.8101162790697678,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt hatte ich ja schon erwähnt, ein Engineering-Approach zum Brotbacken. Und dann beschäftigt man sich ein wenig mit deinem ersten GitHub-Repository, was auch auf Hacker News so steil gegangen ist. Und dann findet man einen Folder, einen Ordner namens Experimente. Und dann geht man da rein und dann stellt man fest, was du da getan hast, ist klassisches A-B-Testing. von Brotbackmethoden. Und zwar hast du Experimente durchgeführt, wie zum Beispiel Einkorn-Vollkornmehl versus Emmer-Vollkornmehl. Du hast eine geölte Leibform versus eine Leibform mit Pergamentpapier getestet. Du hast den Sauerteig einmal bei Raumtemperatur und einmal im Kühlschrank gären lassen. Du hast sogar getestet, ob senkrechtes versus schräges Ritzen im Brot einen Unterschied macht.",
            "start": 1390391,
            "end": 1440712,
            "confidence": 0.8415045045045046,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wahnsinniger Unterschied.",
            "start": 1441032,
            "end": 1443294,
            "confidence": 0.4465,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, Moment, da sprechen wir gleich drüber. Und was ich auch schön fand, was ich eigentlich gedacht hätte, wär so der Standard, du hast unterschiedliche Flüssigkeitszufuhr beim Hefebrot getestet. Also wie viel Wasser kommt da rein und welchen Effekt hat das? Und das Tolle ist, all diese Experimente sind nicht nur im Text beschrieben, sondern da sind Fotos bei. Und du hast mal so ein Brot seitlich aufgeschnitten. Wahnsinn. Was würdest du sagen, war das überraschendste Ergebnis dieser AB-Tests. Weil oft hat man ja eine Hypothese, die testet man, und ab und zu kommt da ja was völlig anderes raus. Was würdest du sagen, war das überraschendste bei einem Brot-AB-Test?",
            "start": 1443314,
            "end": 1483098,
            "confidence": 0.7679999999999997,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also, ich glaub, das Überraschendste hat mit Fruchtfliegen zu tun.",
            "start": 1484238,
            "end": 1488399,
            "confidence": 0.7891999999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ey, super, ich hab mir eigentlich im Kopf gehabt, dass du mal einen Fruchtfliegen-Sourdough gemacht hast, und ich wollt schon fragen, ob du den AB getestet hast mit anderen.",
            "start": 1488679,
            "end": 1495120,
            "confidence": 0.6080344827586209,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Bitte? Das klingt eklig.",
            "start": 1497494,
            "end": 1499917,
            "confidence": 0.82375,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also, ihr kennt wahrscheinlich alle Fruchtfliegen im Sommer. Man hat irgendwie ein leckeres Obst bei sich in der Küche stehen und dann auf einmal kommen die Fruchtfliegen und man ärgert sich ganz doll. Die meisten Leute wissen gar nicht, warum die Fruchtfliegen eigentlich zu dem Obst kommen. Die Fruchtfliegen kommen nämlich gar nicht wegen des Obstes, sondern egal auf welcher Frucht, egal auf welcher Pflanze, auf jedem Blatt ist es so in der Natur, dass man obendrauf eine Schicht hat von Mikroorganismen und diese Mikroorganismen leben in Symbiose mit dieser Pflanze und kriegen dann Energie aus der Photosynthese der Pflanze. Und bei Obst ist es so, da lebt auch eine Schicht an Hefen drauf zum Beispiel. Und irgendwann merken die Hefen, okay, die Pflanze kriegt keine weitere Energie oder die Frucht kriegt keine Energie aus der Photosynthese. Ich muss mich jetzt reproduzieren, ich muss mich verteilen. Und was dann diese Hefen machen ist, die fangen an, das Obst zu vergären und produzieren dadurch Aromen, Aromastoffe. Und diese Aromastoffe, die locken dann die Fruchtfliegen an. Und dann kommen die Fruchtfliegen, landen auf der Oberfläche des Obstes, tanzen auf der Oberfläche des Obstes rum und verteilen die Sporen der wilden Hefen, die man nutzt, um den Sauerteig anzusetzen, in der gesamten welt das heißt die fruchtfliegen sind eigentlich die bienen der wilden hefen das ist also wenn ihr das gelernt habt aus diesem podcast dann habt ihr eine richtig krasse sache gelernt finde ich weil ich dachte immer das sind niedere lebewesen aber die haben eine ganz wichtige rolle im ökosystem der wilden hefen die fruchtfliegen.",
            "start": 1499977,
            "end": 1595598,
            "confidence": 0.8320378787878793,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber wo legen die fruchtfliegenden ihre eier?",
            "start": 1595618,
            "end": 1597440,
            "confidence": 0.6959999999999998,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die Fruchtfliegen legen dann irgendwann die Eier in das Obst tatsächlich, aber fliegen halt weiter, nachdem sie in Kontakt gekommen sind mit der Oberfläche und landen dann wieder auf anderen Früchten. Und so können sich dann die Hefepilze vermehren und haben dann einen weiteren Genpool an der Stelle.",
            "start": 1598380,
            "end": 1613600,
            "confidence": 0.8196666666666667,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und was war jetzt genau der AB-Test bzw. das Ergebnis?",
            "start": 1613820,
            "end": 1617083,
            "confidence": 0.7898999999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das Ergebnis war, dass ich versucht habe, die wilden Hefen von den Fruchtfliegen zu isolieren, weil ich einfach mal wissen wollte. Normalerweise setzt man einen Sauerteig an mit Mehl, was man im Supermarkt kauft und da sind diese Sporen als Kontamination mit drin, weil die vorher auf den Pflanzen waren und deshalb sind die auch im Mehl. Und ich dachte, boah, das wäre doch eigentlich voll cool, wenn ich mal diese Hefespuren nicht vom Mehl nehme, sondern wenn ich die extrahiere von Fruchtfliegen und dann teste, ob ich dann einen anderen Geschmack in dem Sauerteigbrot am Ende habe im Vergleich zum normalen Sauerteig. Und das ist jetzt kein Spaß. Ich habe das gemacht, habe das versucht so wissenschaftlich wie es geht zu isolieren und der Sauerteig riecht sehr stark nach so einer gereiften Banane.",
            "start": 1617964,
            "end": 1662144,
            "confidence": 0.8217761194029849,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das hat sich jetzt gerade so angehört, wie bei mir damals im Chemieunterricht.",
            "start": 1663290,
            "end": 1668094,
            "confidence": 0.9198461538461539,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja.",
            "start": 1669195,
            "end": 1669756,
            "confidence": 0.787,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hast diese Reagenzgläser und versuchst, was zu trennen, aber wir reden hier von Utensilien, die eigentlich jeder in der Küche hat. Ja? Ein Topf, eine Bratpfanne und Co., oder?",
            "start": 1669776,
            "end": 1679944,
            "confidence": 0.7784000000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also, wenn ich jetzt zum Beispiel was mit Fruchtfliegen mache oder so, dann versuche ich natürlich, möglichst sauber zu arbeiten an der Stelle, dass ich wenig Kontamination habe. Das kann jetzt nicht jeder so einfach machen, aber normalerweise, um geiles Brot zu backen, braucht ihr nur eine Bratpfanne. Wo man normalerweise die Finkenwerder Scholle reinhaut, da könnt ihr auch einfach direkten Brot drin machen.",
            "start": 1679984,
            "end": 1700485,
            "confidence": 0.8119687499999997,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die was rein hat?",
            "start": 1701667,
            "end": 1702868,
            "confidence": 0.67325,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Fisch, Wolfgang, Fisch.",
            "start": 1703048,
            "end": 1704108,
            "confidence": 0.4146666666666667,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ah, danke, danke.",
            "start": 1704168,
            "end": 1706129,
            "confidence": 0.6936666666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das Tolle ist, du hast das jetzt grad so beschrieben, und ich hab mich ein bisschen gefühlt wie so ein kleiner Chemikant, denn deine Mission ist ja unter anderem, du bist besessen von dem Warum und der Wissenschaft hinter jedem Rezept. Und das fand ich, hast du sehr schön beschrieben. Dein erstes GitHub-Repository hat auch ganz im Engineering Approach eine FAQ für Common Problems. Und da findet man wirklich alles im Style von, wirklich, Question-Answer. Faszinierend. meine Kruste ist zu dick, auf meinem Brot. Wie fix ich das? Apropos Kruste, jetzt hattest du schon angeteasert, wie du das Brot, wie du den Brotteig anritzt. Senkrecht oder schräg. Das ist ja dann, dann geht das auf, und dann hat man diese schöne, schöne Kruste, die da auseinandergeht. Du sagtest grade, im AB-Test ist herausgekommen, dass dies einen Riesenunterschied macht. So du willst mich jetzt die verkack.",
            "start": 1706149,
            "end": 1759273,
            "confidence": 0.7684965517241376,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Eiern also was was der unterschied ist ja. Also wenn man einen Brotteig backt im Ofen zu Hause man braucht übrigens gar keinen Ofen dass wir einen Ofen haben ist auch eine Erfindung die noch gar nicht so alt ist man kann einfach wirklich damals hat man auf dem Feuer in irgendeiner Pfanne Brot drin gebacken also man muss keinen Ofen haben um geiles Brot zu backen an der Stelle. Aber wenn man das jetzt im Ofen machen möchte, dann ist es so, dass das Brot geht auf beim Backen und man macht einen Schnitt in die Oberfläche des Brotes und dann kann das Brot durch diesen Schnitt wachsen an der Stelle. Würde man das nicht machen, würde Folgendes passieren. Es würde sich sehr schnell eine Kruste bilden und dann würde das Brot am Ende nicht so luftig sein, wie das sein könnte. Dadurch, dass man diesen Schnitt macht, kann das Brot besser wachsen im Ofen und ist dann am Ende ein bisschen luftiger. Brotteig besteht nur aus Mehl, Wasser und Salz und das ist ein Zusammenspiel von, du willst eine geile Kruste haben, aber es soll dann auch schön luftig sein in der Mitte. Und dieser Schnitt verbessert einfach insgesamt die Konsistenz, die Textur am Ende des Brotes, wenn man das isst. Und wenn du das falsch anschneidest, dann kann das Brot einfach nicht so gut aufgehen an der Stelle. Du willst deinen Brotteig möglichst in einem 45-Grad-Winkel relativ zu der Oberfläche. Und das Brot ist ja ein Stück weit rund. Das heißt, die 45 Grad ändern sich je nachdem, wo man den Brotteig anschneidet. Möglichst einen 45-Grad-Winkel dazu anschneiden, dass es maximal aufgehen kann beim Backen im Ofen.",
            "start": 1759313,
            "end": 1852711,
            "confidence": 0.8253964285714287,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es wird wirklich sehr technisch, unglaublich.",
            "start": 1853340,
            "end": 1856641,
            "confidence": 0.8639999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nochmal zur Erinnerung, wir sprechen über Brotbacken. Also Brot ist für mich wichtig als Deutscher, da sind wir uns einig. Aber die Wissenschaft, dein Brot zu backen. Ich verstehe auch, dass Bäcker auch ein Meisterberuf sind, das verstehe ich auch, aber Bäcker machen ja auch ziemlich viel andere Sachen, Croissants und alles andere.",
            "start": 1856661,
            "end": 1871845,
            "confidence": 0.7499999999999998,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die hast du übrigens auch mal gemacht, oder?",
            "start": 1871865,
            "end": 1873265,
            "confidence": 0.518375,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Croissants habe ich auch mal gemacht, aber ich habe das normale Brot noch gar nicht perfektioniert. Und das muss ich erstmal richtig gut hinbekommen, bevor ich viele andere Sachen mache. Ich will erstmal wirklich das perfekte Brot, so wie ich das mache, hinbekommen. Und dann traue ich mich, nochmal andere Sachen mehr im Detail anzuschauen. Also das ist wirklich mein ganz klarer Fokus, dass ich erstmal das Basisbrot richtig gut hinbekomme.",
            "start": 1874016,
            "end": 1900020,
            "confidence": 0.8507605633802816,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wie würdest du dein perfektes Brot beschreiben? Weil ich frage mich gerade, ob das so wie Quellcode ist. Den perfekten Quellcode werden wir alle nie schreiben können. Nächste Woche kommt irgendwie ein neues Framework raus und dann haben wir wieder ein neues Paradigma, was wir planen müssen. Deswegen, was ist das perfekte Brot für dich?",
            "start": 1900440,
            "end": 1915808,
            "confidence": 0.8211090909090908,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das ist eine gute Frage. Für jeden ist das perfekte Brot unterschiedlich. Für mich ist es, ich habe eine richtig schön krosse Kruste, die auch ein bisschen leicht dunkel ist. Und dann schneide ich das Brot an. Ich habe draußen diese, das sollte schon fast wie so Chips schmecken, wo ich reinbeißen kann von der Konsistenz, dass es so ein richtig angenehmes, knackiges Gefühl ist. Und dann habe ich im Brot selbst eine sehr luftige, leicht feuchte Krumme. Das ist der innere Teil des Brotes. Und das passt dann super gut in Kombination mit der Textur. Und dann esse ich dieses Brot und dann habe ich so eine leichte Säure noch im Abgang dazu. Und dann diese Kombination aus all diesen Geschmacksrichtungen macht dann für mich das perfekte Brot. Und da braucht man dann wirklich nur noch ein bisschen Butter oder ein bisschen Olivenöl, ein bisschen Salz. Und das schmeckt einfach schon so unfassbar gut. Und das wirklich nur mit Mehl, Wasser, Salz. Diese drei einfachen Sachen können so ein geiles Produkt bauen. Das fasziniert mich daran.",
            "start": 1916703,
            "end": 1973595,
            "confidence": 0.8047344632768364,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "So, jetzt muss ich mal diese ganze Romantik zerstören, weil ich weiß ja auch, dass du Startup-Founder bist und deine Agentur gegründet hast und eben Startup früher und Developer. Das heißt, du blickst ja auch grundsätzlich auf Zahlen, hast einen Approach, da dir auch die Analytics und so weiter anzusehen. Jetzt wenn man mal auf die Business-Seite wechselt von deinem YouTube-Kanal. Ich glaube, du hast ja zeitweise auch mehr oder weniger, ja, zumindestens fast hauptberuflich gemacht. Wie weit war denn das professionell eigentlich dann irgendwann aufgezogen? Bist du dann auf der Seite auch so rangegangen, A-B-Testing, das Ganze auch wirklich auszuprobieren und wirklich zu perfektionieren oder Ziele zu haben? Ich meine, 200.000 Follower bekommt man auch nicht von heute auf morgen. Das ist schon eine extreme Leistung, muss man dazu sagen. Vor allem in dem Thema, was ja irgendwie jeder machen kann. Also man würde sagen, jetzt als spezieller Developer bei Kubernetes, dann hat man da die absolute Nische gefunden, aber Brot ist jetzt nicht so speziell, das würde ich mal sagen.",
            "start": 1973795,
            "end": 2029751,
            "confidence": 0.8017674418604654,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ist gut, dass du das sagst. Nach Trivago war das so, dass ich mir eine sechsmonatige Auszeit genommen hab. Da wollte ich überlegen für mich selbst, was ich mit meinem Leben machen möchte. Dann hab ich mir überlegt, ich hab noch 15.000 Tage zu leben wahrscheinlich. Wie kann ich diese Tage möglichst gut einsetzen? Und was möchte ich, was die Leute über mich erzählen, wenn ich dann irgendwann mal begraben werde? Was möchte ich, was die Leute sagen über Hendrik? Mein Lebensziel, hab ich mich entschieden, ist, ich möchte, dass die Leute sagen, Hendrik hat möglichst vielen Leuten beigebracht, gutes Brot zu backen. Und dann habe ich alles erreicht, was ich erreichen möchte.",
            "start": 2030672,
            "end": 2064509,
            "confidence": 0.8042477876106194,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Hast du einen Grabstein auch schon definiert? Einen Spruch für einen Grabstein?",
            "start": 2064549,
            "end": 2068092,
            "confidence": 0.56025,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das könnte man vielleicht schon mal crowdfunden. Hier fermentierte Hendrik. Bitte keine Sauerteige von mir extrahieren.",
            "start": 2068112,
            "end": 2078600,
            "confidence": 0.6656249999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich wollte gerade sagen, man könnte ja dann den Sauerteig ableiten.",
            "start": 2078639,
            "end": 2081262,
            "confidence": 0.4811818181818182,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das wird auf jeden Fall gehen. Nee, genau, und ich hab mich entschieden wirklich damals, ich möchte, ich mach The Bread Code, mach ich zwei Tage die Woche. Und diese beiden The Bread Code Tage möchte ich nicht kommerziell machen, weil mir ist das Thema so wichtig, dass Leute mehr geiles Brot backen können zu Hause, dass mein Ziel nicht damit ist, Geld zu verdienen. Sicherlich werde ich vielleicht irgendwann mal ein bisschen Geld damit verdienen. Ich verdiene auch ab und zu schon ein bisschen was. Aber das ist nicht mein Ziel. Ich mache das rein, nicht kommerziell. Das heißt, dadurch bin ich halt auch überhaupt nicht interessant für irgendwelche Partnerschaften und so weiter, weil ich nichts verkaufe.",
            "start": 2084033,
            "end": 2118387,
            "confidence": 0.7912542372881358,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hast auch kaum Affiliates, oder?",
            "start": 2118407,
            "end": 2122188,
            "confidence": 0.18800000000000003,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Oder zumindest nichts, was ich mitbekommen habe. Genau, ich habe zwar ein paar Affiliate-Links, ich hatte das auch damals mehr, aber dann dachte ich mir, nee, das ist nicht das, was ich möchte, weil ich möchte wirklich den Leuten das Brotbacken beibringen. Man muss sich nichts Teures dafür kaufen. Die Bratpfanne ist das Einzige, was du brauchst, um Brot zu backen und mehr brauchst du nicht.",
            "start": 2122228,
            "end": 2139132,
            "confidence": 0.7172121212121214,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn man jetzt das vergleicht mit einem Developer-Gehalt, was man üblicherweise so bekommt heutzutage.",
            "start": 2139712,
            "end": 2145375,
            "confidence": 0.7464285714285716,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Schlechter.",
            "start": 2145395,
            "end": 2146716,
            "confidence": 0.851,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, also liegt das, in welcher Relation liegt das irgendwie?",
            "start": 2146776,
            "end": 2150138,
            "confidence": 0.7303000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Müsste ich mal ganz kurz ausrechnen. Natürlich so ein bisschen davon ab, auch in welcher Position man arbeitet, aber das ist vielleicht so ein... Drittel Developer Gehalt oder so irgendwie so in dem Rahmen. Ich mache das wirklich nur und das ist auch meine Philosophie. Ich hatte irgendwann mal da einen anderen Podcast zu dem Thema gehört und zwar, ich glaube es war, einige kennen ja den Dieter Bohlen aus Hamburg, der hat nur eine Sache, finde ich, hat er gesagt, die sehr schlau ist. dass wie dumm denn eigentlich die Menschen sind, weil irgendwann, es gibt Leute, die fahren einfach nur schnell ein Auto im Kreis und verdienen damit ganz viel Geld. Das heißt, du musst eigentlich nur eine Sache machen können, die du richtig, richtig gut kannst und irgendwann kommen Leute und geben dir Geld dafür. Und das ist ein Stück weit auch meine Philosophie mit der Breadcode. Ich möchte einfach der Beste sein, was das Brotbacken angeht und irgendwann könnte sich da ein kommerzielles Modell draus entwickeln, aber ich mache das in erster Linie einfach, weil ich das geil finde und Spaß daran habe. Ich möchte auch gar nicht unter dem Druck sein, Geld verdienen zu müssen, weil das mache ich während meiner anderen drei Tage, zwei Tage die Woche, will ich wirklich nutzen, um kreativ Spaß zu haben.",
            "start": 2150158,
            "end": 2213381,
            "confidence": 0.7950450450450447,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt aber auch, das, was man von YouTube bekommt, in deinem Fall, du hattest ja wirklich Millionen von Aufrufen teilweise im Monat, dass das trotzdem noch weit ab ist von einem sinnvollen Gehalt.",
            "start": 2214161,
            "end": 2225866,
            "confidence": 0.8280588235294117,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also bei YouTube ist es tatsächlich so und das ist auch einer der Gründe, weshalb ich jetzt nicht mehr so viele YouTube-Videos mache. Es gibt ja viele, die machen jede Woche ein neues Video. Das bringt überhaupt gar nichts. Es ist häufig so, du machst zehn Videos und davon ist dann eins erfolgreich oder so. Wenn ich jetzt ein schlechtes Video mache, das kriegt irgendwie nur 5000 Aufrufe, dann verdiene ich 15 Euro mit so einem Video. Das lohnt sich dann gar nicht. Es lohnt sich wirklich nur die Videos, die dann mal mehr als 500.000 Aufrufe haben oder so an der Stelle.",
            "start": 2226426,
            "end": 2253363,
            "confidence": 0.77452427184466,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und ich meine, dass du die Leute enablen möchtest, mit einer Bratpfanne Brot zu backen, das sieht man ja auch an den Gitter-Prepositories. Also all das, über das wir gerade sprechen, ist ja auch Open Source. Auf der einen Seite habe ich gerade gesehen, viele Sachen sind unter der MIT-License lizenziert. Und auch dein neuestes Buch für das Framework zur Teich-Herstellung ist unter Creative Commons.",
            "start": 2253933,
            "end": 2278017,
            "confidence": 0.8197846153846157,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Released, soviel ich weiß. Genau, da haben wir uns abgestimmt. Es gibt da nämlich tatsächlich auch viele Leute. Vielen Dank nochmal an die ganzen Supporter des Projektes bei GitHub. die wirklich viel mich unterstützen, was Rechtschreibung angeht. Ich bin so ein halber Legastheniker, ein Stück weit. die dann immer Fixes machen, Sachen verbessern und so weiter. Das ist also ein Projekt, was schon über mich hinausgewachsen ist. Und da hat sich einfach noch mal gezeigt, wie geil einfach Open Source ist, weil es gibt total viele Leute, die mal einen Pull-Request machen, Sachen optimieren. Der eine hat zum Beispiel ein richtig geiles Makefile geschrieben, wie das ganze Buch geil kompiliert werden kann und so weiter.",
            "start": 2278037,
            "end": 2313092,
            "confidence": 0.7947217391304346,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Kannst du mir ganz kurz den Make-Befehl sagen, um das Buch zu kompilieren? Ich merk schon, du hast schon CLI-Guidelines gelesen. So ist das nicht. Geil, geil. Kommen wir mal ganz kurz zu deinem kurzen Ausrutscher weg vom Brot hin zum Pizzateig. Und was du bei dem Pizzateig-Repository nämlich gemacht hast, du hast Float Charts eingeführt. Ich weiß nicht, warum, aber warum braucht man zur Herstellung eines guten Pizzateigs jetzt Float Charts?",
            "start": 2313492,
            "end": 2347118,
            "confidence": 0.8085555555555557,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Flowcharts visualisieren, finde ich, ganz gut den Prozess, sodass man sehr gut sehen kann, wo ist man denn jetzt eigentlich an der Stelle. Und auch mein Buch, The Sourdough Framework, lebt komplett von Flowcharts. Die Leute könnten fast sagen, dass ich fanatisch bin, was Flowcharts angeht. Es zeigt einfach, finde ich, super gut, wo man ist in dem Prozess und was man dann als nächstes machen muss an der Stelle.",
            "start": 2347578,
            "end": 2368888,
            "confidence": 0.8081285714285713,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das klingt ja super technisch. Ist das verständlich für Es klingt jetzt so herablassend, normalsterbliche, aber für nicht technische Leute, wir haben das ja irgendwie ständig vor uns, aber jetzt für, keine Ahnung, für irgendwen, der jetzt Brot backen will und gar nicht im technischen Bereich unterwegs ist, ist das trotzdem verständlich.",
            "start": 2368928,
            "end": 2387313,
            "confidence": 0.7880192307692307,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist eine gute Frage, das sollte ich vielleicht noch mal empirisch testen, ob das wirklich verständlich ist. Bis jetzt bin ich davon ausgegangen, ja, aber vielleicht ist das gar nicht so einfach.",
            "start": 2387353,
            "end": 2395218,
            "confidence": 0.6985757575757575,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Keine Ahnung, vielleicht ist das auch relativ klar für die meisten Leute. Es klingt ja meistens komplizierter, als es eigentlich ist, so wie mit allen Dingen. Und was grafisch ist, funktioniert ja üblicherweise sowieso immer besser. Vor allem, wenn es dann nett aufbereitet ist, wie in deinem Buch.",
            "start": 2395238,
            "end": 2408936,
            "confidence": 0.7666875000000002,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja.",
            "start": 2409418,
            "end": 2410099,
            "confidence": 0.738,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Gab es einen Zeitpunkt, wo du gedacht hattest, oh, jetzt brauche ich ein UML-Diagramm für das Pizzablocken?",
            "start": 2410119,
            "end": 2414063,
            "confidence": 0.5212941176470587,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ein ER-Diagramm.",
            "start": 2414083,
            "end": 2417006,
            "confidence": 0.5365,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hab ich tatsächlich auch überlegt.",
            "start": 2417026,
            "end": 2418107,
            "confidence": 0.7455999999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Entschuldigung, ein UML-Diagramm. Gab es einen Zeitpunkt, wo du ein UML-Diagramm überlegt hattest einzuführen?",
            "start": 2418127,
            "end": 2425594,
            "confidence": 0.6762857142857143,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hatte ich tatsächlich auch mal überlegt und dachte, ich habe jetzt schon die Flowcharts, das reicht dann auch. Es ist, man kann natürlich alles beschreiben, aber am Ende kommt es auch immer ein Stück weit darauf an, so wie fühlt sich der Teig an und so weiter. Und ich wollte es jetzt auch nicht zu übertechnisieren an der Stelle.",
            "start": 2425634,
            "end": 2442201,
            "confidence": 0.804677966101695,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn wir zu deinem Buch übergehen, zum The Sourdough Framework, jetzt hattest du die ganzen YouTube-Follower, und dann kommt man zu irgendeinem Punkt, okay, ich könnte jetzt ein Buch machen, noch dazu auf einem Markt, wo es ja keine Ahnung wie viele Kochbücher gibt, also Backbücher in dem Fall, Brotbackbücher, gibt es ja wirklich massig, und die sind teilweise auch sehr teuer, schön aufbereitet. Das ist ja noch mal eine komplett andere Liga. Videos machen ist das eine, aber das ist ja wieder eine komplett andere Herangehensweise, andere Technik, andere Aufbereitung der Themen. Wie kommt man auf sowas und wie bist du das angegangen? Auch die grafischen Sachen zum Beispiel, die sind ja beim Video schwierig, aber natürlich im Buch nochmal ganz was anderes.",
            "start": 2443963,
            "end": 2488074,
            "confidence": 0.8225241935483874,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich war so ein bisschen ein Stück weit auf den Kriegsfuß mit dem YouTube-Algorithmus oder generell mit Social-Media-Algorithmen, weil ich finde, dass es sehr stark zu Populismus führt ein Stück weit, weil Meinungen sehr stark extremisiert werden. Und das ist eine Sache, die bin ich nicht als Person und das möchte ich auch eigentlich nicht unterstützen. dass bestimmte Meinungen sehr stark gepusht werden. So funktionieren die Algorithmen. Die haben irgendwas, was extrem ist, und dann wird das gepusht an der Stelle. Klar kann ich jetzt sagen, das sind einfach nur Brotback-Sachen. Ich mache quasi Brotback-Propaganda bei YouTube ein Stück weit. Aber für mich ist das ein Problem, dass ich so eine Plattform damit auch unterstütze. Und das war der Zeitpunkt, wo ich dann in meine Community gefragt habe, hey Leute, hättet ihr Interesse daran, dass ich ein Buchschreibe zum Thema Sauerteig, was sehr stark ins Detail geht. Da habe ich glaube ich damals so 4000 Euro eingesammelt von der Community.",
            "start": 2488814,
            "end": 2544836,
            "confidence": 0.8318499999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Community meinst du als die YouTube Community, also dieser Bereich, den es bei Influencern gibt. Da brauchst du auch eine gewisse Anzahl an Follower, damit du dann den Community-Bereich Also du sprichst von der Community oder hattest du auch irgendeine auf einer anderen Plattform Community?",
            "start": 2544856,
            "end": 2559822,
            "confidence": 0.7208666666666669,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Guter Punkt. Es gibt noch so eine Seite, ihr kennt das bestimmt sowas wie Patreon oder ich nutze eine Seite, die heißt CoFi, da kann man den Leuten quasi so einen Kaffee kaufen. Und da haben mich immer mal die Leute unterstützt, indem sie mir einfach mal zwei Euro für so einen Kaffee oder so gegeben haben an der Stelle. Und da kann man mir ein Paket Flour kaufen an der Stelle. Also man kann mir ein Paket Mehl schenken, wenn man das möchte. Und da drüber habe ich dann die Leute aufgerufen und gefragt, hey, würdet ihr das gut finden, das zu machen? Und dann kam halt ein gewisses Budget zusammen und dachte ich, okay, alles klar, das ist voll cool.",
            "start": 2559842,
            "end": 2589047,
            "confidence": 0.7132213114754101,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wie funktioniert das technisch? Ist das dann E-Mails, die die bekommen?",
            "start": 2589087,
            "end": 2592149,
            "confidence": 0.7273636363636364,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist so eine Plattform, auf die ich gehen kann. Da wird dann einmal so beschrieben, wer ich denn eigentlich bin, was ich so mache und da kann ich dann einfach, habe ich so ein Feld, wo ich eingeben kann, Hendrik zwei Pakete Mehl kaufen zum Beispiel.",
            "start": 2593451,
            "end": 2606550,
            "confidence": 0.815255319148936,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und darüber hast du die 4.000 zusammenbekommen?",
            "start": 2606897,
            "end": 2610338,
            "confidence": 0.7231428571428571,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, das war für mich so, ich meinte, okay, wenn ein bisschen Geld zusammenkommt und das Interesse da ist, dann committe ich mich darauf, das Buch zu schreiben an der Stelle.",
            "start": 2610378,
            "end": 2618640,
            "confidence": 0.7675806451612901,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber die Kommunikation ist weiterhin über YouTube gelaufen. Also es war nur die Plattform, um zu spenden, aber die Kommunikation war rein über YouTube.",
            "start": 2618680,
            "end": 2625381,
            "confidence": 0.7623750000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Auf beidem ein Stück weit. Also ich habe natürlich dann auch YouTube da, diesen Community-Tab genutzt dafür, um Sachen zu kommunizieren, auch bei Instagram ein Stück weit. Und so ist dann dieser erste Spendenblock zusammengekommen. Ja, und dann ist das Geld zusammengekommen, dann habe ich mir entschieden, alles klar, super, ich schreibe das Buch als Open-Source-Buch.",
            "start": 2625401,
            "end": 2643909,
            "confidence": 0.7438750000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "War das davor schon klar, dass das Open-Source wird? Also hast du das schon so promoted? Genau.",
            "start": 2644169,
            "end": 2649553,
            "confidence": 0.6688235294117646,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das war mir von Anfang an klar, dass ich das Open-Source machen wollte, weil ich halt aus dem Breadcode-Projekt vorher gelernt hatte, wie gut das denn eigentlich ist, das so zu machen. Und ich wollte halt auch, dass es über mich hinauswächst, dass es nicht an Hendrik hängt, sondern dass es einfach ein Ding ist, was alle verwenden können auf der Welt. Und dann habe ich nach und nach angefangen, über zwei Jahre dieses Buch zu schreiben. Also ich habe da wirklich massiv Zeit reingesteckt und dann immer meine Donnerstag und Freitage verwendet, wirklich dieses Buch zu schreiben. Und ich wollte halt auch keine Rezeptsammlung. Es gibt nur ein Rezept im Buch, sondern wirklich das Basiswissen. Was sind Hefen? Was sind Bakterien? Wie funktioniert das biochemisch? Und so weiter. Und auch immer mit wissenschaftlichen Quellen alles belegt an der Stelle. Es ist also fast eher eine Doktorarbeit geworden an der Stelle, würde ich sagen. Ja, und dann hat sich das so weiterentwickelt und dann kam einige zu mir, boah Hendrik, ich finde das so gut, aber ich würde das ganz gerne nochmal wirklich als physisches Buch haben wollen an der Stelle.",
            "start": 2649573,
            "end": 2703901,
            "confidence": 0.808544502617801,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, das war ursprünglich gar nicht geplant, physisch, sondern nur digital.",
            "start": 2703941,
            "end": 2708084,
            "confidence": 0.5989999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich wollte halt, ich will halt immer möglichst viele Leute erreichen, das ist immer mein Ziel und so ein physisches Buch ist ja auch teuer, das kann sich nicht jeder leisten und deshalb ist wirklich mein Hauptziel, das digitale Buch an möglichst viele Leute weltweit zu bringen. Und da können jetzt die Leute das einfach sich kostenlos durchladen. Die PDF ist nicht so, dass man erstmal seine E-Mail eingeben muss und dann kriegt man das Buch. Nee, ich gebe den Leuten direkt die PDF-Links und EPUB-Links, dass sie sich das runterladen können und wenn sie wollen, können sie noch was spenden. Aber ich hasse diese Seiten, wo man erstmal seine E-Mail eingeben muss und dann gezwungen wird, irgendwas noch zu machen und so. Nee, jeder kann das einfach lesen. Und es gibt auch eine Seite, das LaTeX Buch wird automatisch in eine Website konvertiert, the-saudo-framework.com, und da kann man auch die ganzen Inhalte direkt auf der Website nochmal lesen.",
            "start": 2708144,
            "end": 2757279,
            "confidence": 0.8133647798742141,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also technisch hast du auf LaTeX aufgebaut?",
            "start": 2757319,
            "end": 2760021,
            "confidence": 0.6707142857142857,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, auf LaTeX ist das Ganze aufgebaut.",
            "start": 2760061,
            "end": 2761762,
            "confidence": 0.7248571428571429,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich kann mich noch erinnern, wir hatten mal in irgendeinem Chat, hast du gefragt, ja, was ist das beste Framework und wie, was sollst du am besten verwenden und auch Design und so weiter, ist ein großer Punkt. Also schlussendlich ist es klassisch LaTeX geworden.",
            "start": 2761782,
            "end": 2773750,
            "confidence": 0.6986888888888889,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es ist klassisch Latech geworden, ja.",
            "start": 2773890,
            "end": 2775811,
            "confidence": 0.3924999999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, jetzt komme ich aus dem wissenschaftlichen Bereich und ich kenne Latech und man kennt das, wenn man so Papers anschaut oder Bücher, wie Latech ausschaut. Wenn ich jetzt dein Buch anschaue heute, das schaut überhaupt nicht nach Latech aus. Also was ist da falsch? Wo ist da die Conversion oder wie hast du das gemacht?",
            "start": 2775871,
            "end": 2792498,
            "confidence": 0.7428392857142857,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist Teil der Community. Da gab es super viele Leute, die gesagt haben, das sieht mir zu stark nach LaTeX aus. Bitte lass es das so machen, dass es irgendwie noch mehr nach einem Kochbuch aussieht an der Stelle.",
            "start": 2793692,
            "end": 2804965,
            "confidence": 0.8379749999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und das ist aber immer noch Latex?",
            "start": 2805778,
            "end": 2807378,
            "confidence": 0.7830000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist immer noch Latex, genau.",
            "start": 2807479,
            "end": 2809359,
            "confidence": 0.759,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und das schlussendlich, dieses physikalische Buch, was sie in der Hand halten kann, auch das ist Latex?",
            "start": 2809399,
            "end": 2814000,
            "confidence": 0.8157647058823531,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nein, das ist tatsächlich kein Latex. Das ist einmal komplett durchdesignt worden mit InDesign ist es dann passiert an der Stelle.",
            "start": 2814020,
            "end": 2821002,
            "confidence": 0.7861428571428571,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, und das haben dann professionelle Designer gemacht?",
            "start": 2821082,
            "end": 2824463,
            "confidence": 0.7254999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, das hat hier ein Designerfreund von mir gemacht, der hat dann wirklich einmal sich, ist diesen ganzen Inhalt durchgegangen, der Inhalt war ja schon fertig und hat das dann nochmal in schön gemacht mit besseren Grafik und noch ein bisschen mehr Witz und so weiter.",
            "start": 2824921,
            "end": 2837164,
            "confidence": 0.7540217391304346,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, weil also gerade grafisch sticht es, finde ich, schon heraus, dass es sehr liebevoll, würde ich mal sagen, designt ist und das hat dann, eine Person komplett übernommen oder eine Firma oder wie?",
            "start": 2837184,
            "end": 2849108,
            "confidence": 0.7193823529411764,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das hat eine Person komplett übernommen, aber das ist auch, die Community hat das mit mir zusammen gemacht. Wir hatten dann nochmal bestimmt 3000 Korrekturvorschläge für dieses Buch, nachdem wir die erste Version fertig hatten. Und da hat das ganze Lektorat dann die Community gemacht und die sind wirklich jedes Wort, jede Seite durchgegangen und haben nochmal gesagt, das könnte man noch verbessern, das könnte man noch verbessern. Und das hat dann auch insgesamt dazu geführt, dass das ein relativ teures Design geworden ist, weil wir wirklich viel Zeit da reingesteckt haben, um einfach ein richtig cooles physisches Buch zu machen an der Stelle.",
            "start": 2849128,
            "end": 2880321,
            "confidence": 0.798,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt jeder, der weiß, was so ein Buch kostet, und da sprechen wir ja nicht mehr von 4.000 Euro üblicherweise, hast du das einfach finanziert aus eigener Tasche oder ist es ja doch ein großes Projekt, also so ein liebevolles Buch mit Design und allem drum und dran und dann drucken und physikalisch, das ist ja ein Riesenprojekt.",
            "start": 2880341,
            "end": 2896508,
            "confidence": 0.7009137931034483,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich habe mich dann entschieden, für dieses physische Buch eine Kickstarter-Kampagne zu machen, um zu schauen, ob denn Leute wirklich Interesse daran haben, so ein Buch zu bestellen. Und dann dachte ich mir, okay, wenn da Interesse ist, dann macht es Sinn, vielleicht so eine Kickstarter, dann macht es Sinn, das auch wirklich zu machen. Ja, und dann habe ich, glaube ich, es waren 42.000 Euro oder so über Kickstarter eingenommen, um die ersten Versionen zu verkaufen. Und damit habe ich dann den Designer bezahlt und auch die Personen, die mir hier in Hamburg helfen beim Drucken des Buches.",
            "start": 2896748,
            "end": 2925619,
            "confidence": 0.778,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und das ist wirklich ein Hardcover-Buch, oder?",
            "start": 2926419,
            "end": 2928801,
            "confidence": 0.6529999999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, das ist ein Hardcover-Buch, das sind 250 Seiten insgesamt. Und wir haben auch wirklich nur die besten, der besten Materialien verwendet oder so. Das Buch kostet glaube ich gerade, müssten es so 42 Euro sein, aber die Produktionskosten sind alleine fast 15 Euro pro Buch. Ist wirklich ein richtig geiles, wir haben keine Kosten gespart, um einfach, wir wollten, wenn man dieses Buch in der Küche hat, dass es einfach ein Hingucker ist und dass es einfach Spaß macht, da drin zu lesen an der Stelle.",
            "start": 2928821,
            "end": 2957412,
            "confidence": 0.7588390804597702,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das bedeutet aber auch, dass wenn ich jetzt ein Pull-Request mache an das Buch, was ich ja machen kann, das ja Open Source auf GitHub ist, dass es dann später nicht mehr im physikalischen Buch landet, weil es wurde manuell durchdesignt.",
            "start": 2957978,
            "end": 2970664,
            "confidence": 0.7760975609756098,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was wir machen, ist, wir werden noch mal eine zweite Version machen, und dann ist es dann unsere Aufgabe, die neuen Änderungen aus der Open-Source-Variante dann auch noch mal in das physische Buch mitzuübernehmen. Geiler wäre es natürlich gewesen, würde das alles komplett automatisch passieren an der Stelle, ne?",
            "start": 2970704,
            "end": 2986011,
            "confidence": 0.7872244897959182,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wie ist denn überhaupt die Zusammenarbeit so mit GitHub und der Community? Weil ich vermute, du hast ja nicht alles Developer, die dir folgen, deine Follower-Community, sondern das sind auch nicht technische Leute. Haben die dann trotzdem irgendwie GitHub verwendet? Hast du da irgendwelche Einblicke, wer das eigentlich so ist, wenn da ein Pull-Request daherkommt oder ein Änderungswunsch?",
            "start": 2987272,
            "end": 3005603,
            "confidence": 0.7503620689655172,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die Seite The Sourdough Framework hat ein neues Design bekommen, was einfach noch ein bisschen cooler aussieht. Und da musste ich wieder irgendwas mit CSS machen. Und bei CSS, ich versuche einfach 1000 Sachen und irgendwie, keine Ahnung, die Seite ist ein bisschen zu breit und das klappt irgendwie nicht. Und dann habe ich drei, vier Stunden, saß ich da, hab das nicht hinbekommen, einfach einen Pull-Request aufgemacht und dann innerhalb von Einer Stunde hat Anthony aus meiner Community aus Florida, der CSS liebt und das Buch auch geil findet, gesagt, ja, easy, kein Ding, und hat das sofort gefixt. Ich dachte mir, wie geil ist das denn eigentlich, dass man einfach diese Leute im Hintergrund hat, die an das Breadcode glauben und das halt auch unterstützen und dass die einem da so unter die Arme greifen können und auch zu sehen, dass irgendwie die Leute so viele Korrekturen nochmal gemacht haben und so stark an dieses Projekt glauben, hat mir einfach nochmal wahnsinnig viel Unterstützung daran gegeben, dass ich an was Richtigem arbeite, dass die Leute das cool finden.",
            "start": 3005623,
            "end": 3058550,
            "confidence": 0.7495555555555555,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und wie schaut es auf der negativen Seite aus, wie viele Community-Members haben sich beschwert, ich hätte ein Typo gefunden, aber dieses ganze GitHub-Zeug, keine Ahnung, wie das funktioniert, was machst du da für einen komischen technischen Over-Engineering-Approach?",
            "start": 3059050,
            "end": 3071473,
            "confidence": 0.7390263157894735,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Da haben dann auch wiederum Leute aus der Community geholfen und denen geholfen, diese Sachen, die das dann teilweise ausgedruckt haben, markiert haben und haben das dann übersetzt in Pull-Requests von den Leuten, um das dann anzupassen. Also es war echt krass, wie sich da irgendwie alle Leute unter die Arme gegriffen haben und sich unterstützt haben an der Stelle.",
            "start": 3072133,
            "end": 3091646,
            "confidence": 0.8103666666666669,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du sagtest gerade Leute, die an The Bread Code glauben. Das hört sich an, als machst du deine Sauerteigbrot-Sekte auf.",
            "start": 3091666,
            "end": 3098010,
            "confidence": 0.64455,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, das war dann der nächste Schritt, oder? Jetzt hast du Einträge schon was in den Kopf gelegt.",
            "start": 3099187,
            "end": 3103649,
            "confidence": 0.6171111111111112,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die glauben, also was ich ja den Leuten sage ist, ich möchte ein Stück weit das Brotbacken demokratisieren und allen Leuten auf der Welt beibringen, wie man gutes Brot backen kann. Und die Leute, wenn ich sage, an was glauben, die glauben daran, dass einfach das Brot heutzutage, was man im Supermarkt kaufen kann, nicht das Beste ist und dass mehr Leute am besten Brot zu Hause backen sollen. Das ist ein Stück weit meine Vision. Und da glauben viele dran, dass das eine Person braucht, die das auch mehr Leuten beibringen kann.",
            "start": 3105590,
            "end": 3136333,
            "confidence": 0.8616666666666674,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn ich an etwas demokratisieren denke, denke ich zuerst nicht an Brot, weil ich denke eigentlich, das ist schon relativ gut zugänglich und für jeden machbar. Aber ich finde das sehr, sehr gut, wie du es angehst. Denn Rebka hat mal ein bisschen durch den Table of Contents von dem Buch gescrollt. Faszinierend. Die Geschichte fängt an mit der Geschichte vom Sauerteig. Danach, wie ein Sauerteig funktioniert, hatten wir ja hier auch ein bisschen. Dann über verschiedene Brotarten. Dann ein Riesenartikel über Weizensauerteig. Dann sogenannte Mixins, ich weiß nicht, ob das angelehnt ist an CSS oder ähnliches, mit verschiedenen Mehlen, Nüssen und Co. Und was mich sehr zum Lachen gebracht hat, ist das letzte Chapter, nämlich ein Troubleshoot-Chapter. Klassisches Debugging nennen wir es mal. Was ist hier falsch gegangen? Schöne Sache. Jetzt stelle ich mir natürlich die Frage, jetzt kann man so das Buch als heiliger Gral eines Projektes sehen. Was ist denn der nächste ... Engineering-Approach, den du aus der Softwareentwicklung klaust und aufs Brotbacken anwendest.",
            "start": 3137035,
            "end": 3200670,
            "confidence": 0.800718562874252,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du hast gesagt Sekte, eindeutig. Das ist eigentlich das große Ziel, oder, Hendrik? Ich geb's zu.",
            "start": 3200690,
            "end": 3207394,
            "confidence": 0.6861875,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sekte sind dann auf der Engineering-Seite die React-Advocates, oder?",
            "start": 3207814,
            "end": 3211956,
            "confidence": 0.8568888888888888,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich hoffe, dass es nicht so viel Frontend-Entwicklung ist, weil dann müsste man ja das komplette Prinzip Brotbacken immer ändern, jede Woche einmal. Ich hoffe auch nicht, dass ich irgendwie sowas wie Webpack finde im Brotbacken oder so. Ich hab jetzt gerade festgestellt, ich hab mich fünf Jahre vor Webpack gedrückt und irgendwie jetzt verwendet man gar nicht mehr so viel Webpack.",
            "start": 3214217,
            "end": 3231147,
            "confidence": 0.8449838709677419,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du hast überlebt, ja.",
            "start": 3231468,
            "end": 3232388,
            "confidence": 0.54725,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hab's überlebt.",
            "start": 3232408,
            "end": 3235590,
            "confidence": 0.5983333333333334,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, aber was wäre denn der Package-Manager für das Brotbacken? Oder ... Was wäre denn die, ich sag mal, Standardisierung wie Web-Components oder ähnliches fürs Brotbacken?",
            "start": 3235650,
            "end": 3246275,
            "confidence": 0.7352692307692307,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du siehst schon, Andi liebt Over-Engineering. Sowas Einfaches wie Brot und Andi kommt sofort, wie kann man das noch komplizierter machen?",
            "start": 3246935,
            "end": 3253801,
            "confidence": 0.791047619047619,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Moment, der Hendrik hat angefangen, AB-Testing aufs Brotbacken zu adaptieren, Flowcharts einzuführen und ich frage mich natürlich, was ist der nächste Schritt?",
            "start": 3253841,
            "end": 3262768,
            "confidence": 0.7842727272727273,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, aber als Wissenschaftler bin ich ja der Meinung, das ist genau Hendriks Aufgabe. Er macht die ganzen Tests und du als User konsumierst die einfach nur und nimmst dir den besten Outcome. Das ist die Idee von Wissenschaft. Vielleicht ist es das Institut dann, Hendrik, als nächstes. Das Flotpak-Institut.",
            "start": 3263088,
            "end": 3277855,
            "confidence": 0.8080400000000003,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Irgendwie sowas, ne? Irgendwie so Standard noch mehr entwickeln oder so.",
            "start": 3278216,
            "end": 3282478,
            "confidence": 0.7459090909090911,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Moment mal, aber du lachst gerade. Ich habe aber bei der Recherche gesehen, du hast eine Gastvorlesung zu dem Projekt erhalten. Ist das richtig?",
            "start": 3282518,
            "end": 3288901,
            "confidence": 0.7819166666666667,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, das habe ich tatsächlich mal gemacht. Ich gebe häufiger mal abends Talks auf Engineering-Veranstaltungen zum Thema Brotbacken. Und tatsächlich biete ich mittlerweile auch mit zwei Freunden aus Finkenwerder, ich komme ja aus einem Fischhütte auf Finkenwerder, da essen wir übrigens die Finkenwerder Scholle, sehr zu empfehlen. Wir bieten einen Pizzabackkurs an, der heißt agile Pizzaentwicklung. Und das machen wir hauptsächlich bei Softwareunternehmen und fahren da vorbei und machen dann zeigen wie man pizza backt in der agilen art und weise mit einem frontend team dann gibt es die. Belegen dann die pizza dann gibt es einmal ein backend team die machen dann den teig dann gibt es einmal nochmal ein devops team die backen dann die pizza.",
            "start": 3289385,
            "end": 3334907,
            "confidence": 0.7929406779661017,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Achso ich hab gedacht die heizen den ofen vor oder so. Aber ich finde ich finde es richtig hart stereotypenhaft dass das frontend team die pizza belegt also granate.",
            "start": 3334967,
            "end": 3345013,
            "confidence": 0.6310344827586207,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und da gibt es nochmal das QA-Team, da wollen immer alle sein im QA-Team, weil die müssen dann nämlich das Produkt der anderen Teams testen und Feedback geben, was nicht richtig funktioniert hat. Also es wollen immer alle direkt in das QA-Team gehen, deshalb sage ich immer meistens nicht, was die Aufgabe des QA-Teams ist.",
            "start": 3345953,
            "end": 3361976,
            "confidence": 0.7941454545454546,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich kann mich erinnern, du hast mal bei so einer internen Developer-Konferenz eben auch einen Vortrag dazu gehalten und hattest Brot mit. Und du warst natürlich der absolute Hero, weil jeder sofort mal zu Anfang vom Vortrag mal Brot testen konnte oder kosten konnte. Das ist natürlich die absolute Meisterklasse. So fängt man einen Vortrag an.",
            "start": 3362907,
            "end": 3380916,
            "confidence": 0.7790892857142858,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es ist in meinem Freundeskreis auch wieder so eine, ich sag mal, da backen halt ziemlich viele Brot. Und viele Leute sind ja auch sehr technikverliebt. Und was machen technikverliebte Leute, wenn sie ein neues Projekt starten? In der Regel kaufen sie sich erstmal ein neues, ein neues Domain. Und das Brotback- oder Pizzabackpendat wäre dann eigentlich irgendwie so ein relativ teurer Ofen, den du auf dem Balkon hast, so von Oni oder ähnliches. Was sagt denn der Typ, der sagt, du brauchst nur eine Pfanne zum Brotbacken zu solchen Öfen, die speziell als Brotbackofen im Marketing angepriesen werden?",
            "start": 3381187,
            "end": 3417696,
            "confidence": 0.7624040404040401,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also zum Thema Brotbackofen würde ich mir absolut nichts kaufen. Das macht wirklich überhaupt keinen Sinn. Wenn wir jetzt über das Thema Pizza diskutieren, dann würde ich sagen, dass du mit einer Bratpfanne, mit einer ganz normalen Bratpfanne, kannst die 95% geile neapolitanische Pizza backen. Aber für die letzten 5% brauchst du einen teuren Pizzaofen, weil du brauchst diesen Ofen, der sehr, sehr viel Temperatur hat. Das kann man aber auch mit einer Bratpfanne ein Stück weit simulieren, ist aber ein bisschen mehr Arbeit an der Stelle.",
            "start": 3417736,
            "end": 3451623,
            "confidence": 0.7851609195402302,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Da gibt's garantiert videos auf youtube von.",
            "start": 3452003,
            "end": 3453706,
            "confidence": 0.5872857142857143,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Da gibt's auf jeden fall videos wie ich das einmal im detail zeige genau.",
            "start": 3453726,
            "end": 3457373,
            "confidence": 0.8127857142857141,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja können wir gern verlinken in den schon.",
            "start": 3457413,
            "end": 3459637,
            "confidence": 0.6152500000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Außerdem alle Links sind in den Shownotes verfügbar. Also, falls ihr mehr über Brotbacken, Floatcharts, AB-Testing von irgendwelchen Mädeln und Co. wissen wollt, findet ihr alles in den Shownotes. Was ich faszinierend finde an deinem Projekt, an deiner Brotreise nenn ich's mal, die meisten Softwareentwickler overengineeren, und du gehst aber irgendwie die andere Richtung. Du sagst, du hast eine Bratpfanne, das reicht. Also, du bist eher so der Typ, der auch in 2024 noch JavaScript-Files über das Script-Tag manuell reinlädt, oder?",
            "start": 3460387,
            "end": 3494673,
            "confidence": 0.7730617283950617,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Scheiße, jetzt hast du mich entdeckt.",
            "start": 3494713,
            "end": 3497653,
            "confidence": 0.26366666666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Oder anders, wie stehst du denn dazu, dass jQuery vor Kurzem ein neues Release rausgebracht hat?",
            "start": 3497693,
            "end": 3502394,
            "confidence": 0.6860625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wow, das ist ja eigentlich ziemlich gut zu hören, weil ich hab damals so viel jQuery gemacht, das heißt, mein ganzes Wissen ist jetzt doch nicht für die Tonne. Also kann man das immer noch heutzutage verwenden. Nee, Spaß beiseite, ich bin echt überrascht. wie viel Frontend-Code ich mittlerweile mithilfe von AIs und so weiter schreiben kann. Das macht mir das so viel einfacher, weil ich muss das nicht mehr aus Stackoverflow zusammen kopieren an der Stelle. Ich kann sogar jQuery-Code schreiben, und dann wird das einfach übersetzt in vanilla JavaScript. Wie geil ist das denn?",
            "start": 3502454,
            "end": 3528847,
            "confidence": 0.7750104166666668,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich hätte noch eine Frage zum Schluss. Und zwar, du machst das ja jetzt seit sechs Jahren. Und ich vermute ja, da hat es ziemlich viele Downs auch gegeben. Vor allem wahrscheinlich am Anfang, bis du mal auf eine sinnvolle Follower-Anzahl gekommen bist und so weiter. Sechs Jahre ist ja schon eine extrem lange Zeit, auch für ein Side-Project ganz allgemein. Wie hält man sich denn da motiviert sechs Jahre lang? Und du, so wie es scheint, willst du das ja auch weiterhin machen.",
            "start": 3528887,
            "end": 3554484,
            "confidence": 0.7578809523809524,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube, und das ist, weshalb ich so motiviert bin, ist, weil ich das nicht kommerziell mache. mir ist kommerzieller erfolgt wirklich total egal das ist nicht das was mich treibt was mich treibt ist dass ich möglichst viele leute erreichen kann mit nachrichten wie man gutes brot zu hause backen kann und das ist das was mich motiviert und nicht dass ich jetzt immer ein nächstes und noch ein erfolgreiches video machen muss ich glaube ich könnte mir vorstellen wenn man das so macht dann hinterfragt man das ganze relativ schnell, weil dann merkt man, ah Mist, jetzt habe ich irgendwie vier Tage an einem Video gearbeitet, aber das hätte jetzt nur 15 Euro verdient. Mich stört das halt nicht. Natürlich ist das schlecht, wenn das passiert, aber das ist nichts, was mich jetzt demotiviert oder so an der Stelle. Und auch dadurch, dass ich jetzt dieses Buch geschrieben habe, dieses Open-Source-Buch, habe ich einfach was geschaffen, was über den YouTube-Algorithmus hinausgeht, was einfach längerfristig hoffentlich da draußen ist. Weil beim YouTube-Algorithmus, wenn man sich darauf einlässt, die Videos werden für eine gewisse Zeit angezeigt, dann werden sie nicht mehr angezeigt. Es ist ein kontinuierliches Spiel, neue Videos zu machen und so. Und ich glaube, das hätte mich schon sehr stark demotiviert, hätte ich das dann so gemacht. Aber jetzt mit dem Fokus auf Open Source macht mir das einfach super viel Spaß. Und ich lese ja die Kommentare, wie Leute schreiben, vielen, vielen Dank für das, was du mir beigebracht hast und so weiter.",
            "start": 3555265,
            "end": 3635879,
            "confidence": 0.8384570312500003,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt prahlst du die ganze Zeit damit, man braucht nur eine Pfanne um Brot zu backen und jetzt möchte ich von dir wissen, was ist das minimalste Setup und der Nummer 1 Tipp, den du mir als Brot Back Noob jetzt geben kannst, dass ich gleich noch zum Edeka fahre und was muss ich da einkaufen, um heute Abend mit meiner Brot Back Journey zu starten.",
            "start": 3636619,
            "end": 3659361,
            "confidence": 0.8530151515151517,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Okay, also du hast eine Bratpfanne und du hast einen Herd. Das ist das, was du brauchst. Hab ich. Dann brauchst du noch ein Glas. Hast du ein Glas?",
            "start": 3660530,
            "end": 3668755,
            "confidence": 0.648448275862069,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Bestimmt.",
            "start": 3668775,
            "end": 3669495,
            "confidence": 0.919,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Okay, ein Glas vielleicht auch noch. Und dann brauchst du noch irgendeine Art Vollkornmehl. Das musst du dir jetzt heute kaufen im Supermarkt. Das kann ein Weizenvollkornmehl sein, Roggenvollkornmehl.",
            "start": 3669575,
            "end": 3679701,
            "confidence": 0.7148275862068966,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Spielt da diese Typnummer eine Rolle?",
            "start": 3679721,
            "end": 3680882,
            "confidence": 0.718,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die Typnummer gibt den Mahlgrad an. Du musst jetzt einen Sauerteig ansetzen und für den Sauerteig nimmst du ein Vollkornmehl. Da ist dann keine Typnummer. Das Höchste ist, wenn keine Typnummer angegeben ist. Weil da ist ganz viel natürliche Kontamination drauf, auf der Oberfläche. Und das ist das, was du haben willst, um einen Sauerteig anzusetzen. Vollkorn hat mehr Kontamination als ein weißes Mehl, wo der innere Teil des Korns mithalten ist.",
            "start": 3682282,
            "end": 3707993,
            "confidence": 0.7522361111111109,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt ich komme jetzt doch nur zur antwort von meiner initialen frage der beste mal grad ist kein mal grad.",
            "start": 3708333,
            "end": 3714876,
            "confidence": 0.7524761904761904,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es hängt davon ab was du möchtest es tut mir leid. Dann mischt du das zusammen an die einfach bisschen mehr bisschen wasser zusammen mischen lässt es stehen morgen wirst du sehen das riecht schon so ein bisschen komisch interessant dann nimmst du davon wieder ein löffel raus. misch das wieder mit bisschen Mehl und Wasser und machst das so circa eine Woche lang und dann riechst du mal daran und dann solltest du was haben, was so vielleicht so ein bisschen leicht nach Essig riecht und dann hast du deinen Sauerteig hergestellt, wie wir das vor 12.000 Jahren schon gemacht haben. Und dann kannst du davon was nehmen, wieder bisschen Mehl über Wasser mischen, bisschen Salz noch rein und dann wartest du nur ein bisschen, haust das in die Pfanne und dann hast du dein erstes Brot gebacken.",
            "start": 3714936,
            "end": 3754527,
            "confidence": 0.7503381294964027,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und das Glas kommt dann oben drüber, über die Pfanne?",
            "start": 3754567,
            "end": 3756547,
            "confidence": 0.6434000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und das Glas ist ja bisschen zu klein für die Pfanne wahrscheinlich also.",
            "start": 3756907,
            "end": 3761315,
            "confidence": 0.7822307692307692,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Achso du sprichst von vom vom für den Sauerteig das heißt mit der Pfanne mache ich das dann wirklich offen oder brauche ich dann Deckel.",
            "start": 3761376,
            "end": 3767527,
            "confidence": 0.61756,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn du einen Deckel hast, wäre das ganz gut, einen Deckel noch zu nehmen. Brauchst du aber nicht unbedingt. Die Idee ist beim Deckel, du hast irgendwie, wenn du eine Tortilla auch machst, zum Beispiel in der Pfanne, dann entsteht Wasserdampf beim Backen und dieser Wasserdampf ist dann unter dem Deckel und backt dann das Backgut ein Stück weit von oben. Das heißt, ein Deckel ist schon sinnvoll, aber braucht man auch nicht unbedingt.",
            "start": 3768803,
            "end": 3788771,
            "confidence": 0.7977162162162162,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber genau für dieses minimalistische Brot hast du bestimmt auch ein Video, was wir unten verlinken können.",
            "start": 3788831,
            "end": 3792753,
            "confidence": 0.668235294117647,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das können wir in die Shownotes reinpacken. Das ist das Simple Flatbread Recipe aus meinem Buch The Sourdough Framework. Das ist tatsächlich das einzige Rezept, was es in meinem Buch gibt.",
            "start": 3793751,
            "end": 3801800,
            "confidence": 0.678483870967742,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt, man kann es auch in GitHub dann nachschlagen?",
            "start": 3802340,
            "end": 3804883,
            "confidence": 0.6307,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Man kann es auch in GitHub nachschlagen, wenn man möchte.",
            "start": 3804903,
            "end": 3807086,
            "confidence": 0.7872,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Dann würde ich sagen, machen wir jetzt Schluss mit dieser Podcast-Episode, denn ich habe noch einen Auftrag. Ich werde noch ein Brot packen. Hey Dirk, vielen lieben Dank, dass du uns auf die Brotback-Reise, auf die Brotback-Engineering-Reise mit HB-Testing, Flowcharts und Co. und einem Hacker-News-Trending-Artikel mitgenommen hast. Ich bin wirklich fasziniert, was man mit sowas machen kann. Aber hey, du hast mir wieder bewiesen, Kreativität kennt in irgendeiner Art und Weise keine Grenzen.",
            "start": 3807106,
            "end": 3836092,
            "confidence": 0.7929452054794524,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Danke euch, hat Spaß gemacht.",
            "start": 3836432,
            "end": 3837793,
            "confidence": 0.3554,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vielen Dank für die ganzen Videos vor allem und die ganzen Tipps, Hendrik. Ich habe sie persönlich auch viel ausprobiert und gebrauchen können. Danke auch. Wir haben nämlich jetzt Andi dazu gebracht, dass er Brot backt. Und Andi, ich werde dich accountable halten. Ich will dieses Brot sehen und werde dir das jede Episode vorhalten, bis du das einmal fabriziert hast. Und deine Frau darf dir nicht helfen. Das werde ich auch sicherstellen. Und dann schauen wir mal an, was du für ein Brot backst.",
            "start": 3837833,
            "end": 3863296,
            "confidence": 0.8018470588235297,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn leute wissen wollen was aus meinem brot geworden ist müsst ihr natürlich in unsere engineering kiosk community kommen oder uns auf den plattformen linkedin twitter oder masterdom folgen denn da wird es gepublished wenn ihr das nicht tut dann tut es mir leid dann werdet ihr leider das beste brot.",
            "start": 3864096,
            "end": 3881345,
            "confidence": 0.8432549019607845,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und wenn ihr sinnvolles Brot sehen wollt, dann findet ihr alle Links zu Hendrik's Accounts auf den Plattformen in den Journals. Da seht ihr dann, wie es ausschauen sollte, wenn ihr Andis Brot gesehen habt.",
            "start": 3882010,
            "end": 3893138,
            "confidence": 0.7842857142857143,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und falls ihr natürlich auch Pizza essen wollt, der Hendrik bietet Pizza Agile Kurse an. Und dann würde ich euch empfehlen, ins Quality Assurance Team zu kommen. Das war's von uns drei. Hendrik, vielen lieben Dank für deine Zeit. Und bis bald, tschüss.",
            "start": 3893178,
            "end": 3908068,
            "confidence": 0.767860465116279,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Danke, tschüss.",
            "start": 3908088,
            "end": 3909450,
            "confidence": 0.476,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Bevor ich noch tschau sag, unten gibt's so einen Link, Thumbs up, Thumbs down in den Shownotes. Nachdem das keine übliche Folge war, bitte gebt uns mal Feedback, was ihr von solchen Folgen haltet. Ciao. Und ihr habt jetzt die Möglichkeit, eines von drei Büchern von Henrik, The Bread Code, zu gewinnen. Geht dazu einfach auf LinkedIn, Mastodon, Twitter oder auf unsere Discord-Community. Dort findet ihr ein Video von Henrik. Kommentiert darunter einfach, warum genau ihr ein Buch erhalten solltet und was euch an der Episode gefallen hat.",
            "start": 3909490,
            "end": 3939880,
            "confidence": 0.7808068181818182,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.784711621966795,
    "audio_duration": 3940.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}