{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/9N6cdZWqysTidWs/download/ep127_imposter.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "speech_model": null,
  "id": "251d8dfb-f0c0-4ce6-8f29-20d6af9dfefc",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Jeder, aber wirklich jeder kennt diese Situation. Man muss etwas präsentieren und fragt wenn die merken, dass ich eigentlich gar keine Ahnung von diesem Thema habe. Oder dass man sich den eigenen Erfolg, die eigenen Leistungen einfach nicht eingestehen möchte. Das ganze nennt man Impostor Syndrom oder auch Hochstapler Syndrom. Und Achtung, es ist ganz normal. Das Gegenteil davon ist der sogenannte Dunning Kruger. Effektiv, wenn einzelne Personen ihr Können überschätzen, obwohl sie dafür nicht qualifiziert sind oder das nötige Wissen fehlt. Und das dritte Phänomen aus dem beruflichen Leben ist das PETA Prinzip. Dies besagt, dass Menschen bis zu ihrer Unfähigkeit befördert werden. Kommt dir das alles irgendwie bekannt vor? Vielleicht sogar aus deinem Beruf? Uns auf jeden Fall. Und deswegen wollten wir mehr über diese Themen wissen und sprechen mit der promovierten Psychologin Fanny Jiménez darüber. Fanny bringt Licht ins Dunkle und erklärt uns, was die einzelnen Phänomene wirklich bedeuten, welchen Einfluss diese auf unsere Persönlichkeit haben, aber auch, ob diese normal sind, wie wir diesen vorbeugen können und vieles, vieles mehr. Wir springen direkt rein in die menschliche Psyche und los geht's. Dieser Podcast, der engineering Kiosk, beschreibt sich als deutschsprachiger Software Engineering Podcast. Doch wenn man mal auf unsere Episodenlisten schaut, dann bin ich mir gar nicht so sicher, ob wir uns noch so schimpfen dürfen. Denn uns geht nämlich ziemlich viel auch um die Themen um also links und rechts um der Softwareentwicklung. Denn wir denken Technologie ist ein hartes Problem, aber ein gelöstes Problem. Aber was viel schwieriger ist, sind die Menschen drumherum. Im Team zusammenarbeiten und so weiter und so fort.",
      "start": 3680,
      "end": 102360,
      "confidence": 0.9166613432835824,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Moment, nicht die Menschen sind das Schwierige. Das Zusammenarbeiten ist das schwierig.",
      "start": 102400,
      "end": 105984,
      "confidence": 0.7930958333333332,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ab und zu sind auch die Menschen das Schwierige. Und da schließe ich mich nicht aus. Und deswegen haben wir heute mal ein ganz tolles Thema, wo ich super viele Fragen habe, schon irgendwie komplett durch meine Karriere hinweg. Und zwar geht es um die Phänomene das Peter Prinzip und das Impostor Syndrom. Denn beide Phänomene betreffen irgendwie das berufliche Leben, aber auch irgendwie die persönliche Wahrnehmung der eigenen Fähigkeiten und Leistungen. Und wenn man sich damit mal ein bisschen beschäftigt, dann merkt man, die menschliche Psyche ist wunderbar und rätselhaft und zuweilen auch echt anstrengend und teilweise echt kompliziert. Und davon habe ich von Psychologie keine Ahnung. Ich möchte mir das auch nicht mutmaßen, dass ich da irgendwie was empfehle oder was richtiges oder was falsches sage. Und aus diesem Grund haben wir uns eine Expertin eingeladen und ich bin sehr, sehr glücklich darüber. Dass sie dieser Einladung gefolgt ist. Hallo Fanny.",
      "start": 106112,
      "end": 161930,
      "confidence": 0.9158840522875816,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Hi.",
      "start": 162010,
      "end": 162630,
      "confidence": 0.79778,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Mal ganz kurz für die Hörerinnen und Hörer, wer bist du? Du bist promovierte Psychologin und Wissenschaftsjournalistin, bist Buchautorin mit einem schönen Titel ich und mein Spleen, was wir tun, wenn wir alleine sind. Du hattest mal eine Kolumne in der Welt mit dem schönen Titel bin ich eigentlich normal, wenn die über Macken und Marotten galt. Du bist selbst Podcasterin mit dem Psychologie in 15 Minuten Podcast mit dem Namen Nevermind. Und aktuell bist du chief of Staff und Head of Audio bei Business Insider, meines Wissens nach einem Portal für Nachrichten aus Wirtschaft, Politik, Wissenschaft und tech. Ist das korrekt?",
      "start": 163690,
      "end": 201666,
      "confidence": 0.9169262745098037,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Alles richtig, ja, sehr gut zusammengefasst.",
      "start": 201778,
      "end": 204186,
      "confidence": 0.9582166666666666,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Meine erste Frage wäre das Wort Spleen. Ich habe eigentlich gedacht, das wäre irgendwie so ein lokaler Slang oder umgangssprachlich, aber wie würdest du einen Spleen beschreiben?",
      "start": 204258,
      "end": 215710,
      "confidence": 0.8928511111111112,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, Spleen, manche sagen auch Marotte, andere sagen auch Tick, wobei Tick immer so ein bisschen, finde ich, schwierig ist, weil es in die psychopathologische Richtung geht. Aber das ist eine Gewohnheit, die ich behaupte, jeder Mensch hat einen Spleen oder eine Marotte und die auf den ersten Blick keine erkennbare Funktion hat. Also sowas wie die Wäsche beim Aufhängen farbig sortieren oder die Spülmaschine immer nach einem ganz bestimmten festen System einräumen und sich beschweren, wenn jemand anders den Teller andersrum hinstellt oder so. Also Angewohnheiten, die Menschen haben, wo andere drauf gucken und sagen, hä, was soll das denn? Warum macht er oder sie das? Und genau, meistens steckt da aber doch eine Funktion dahinter. Und deswegen finde ich Spleens sehr faszinierend.",
      "start": 216570,
      "end": 263158,
      "confidence": 0.9014877419354838,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich würde sagen, wie man die Spülmaschine einräumt. Ich glaube, das sind Glaubenskriege.",
      "start": 263214,
      "end": 267086,
      "confidence": 0.8534761538461539,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Von daher sind Glaubenskriege, ich habe in meinem Buch auch eine Studie dazu verlinkt, wer sich das anschauen will. Es gibt nämlich Physiker, die das tatsächlich untersucht haben, was am allersinnvollsten ist. Also wenn ihr den Glaubenskrieg beenden wollt, schaut da rein. Es ist ein gelöstes Problem.",
      "start": 267158,
      "end": 282406,
      "confidence": 0.9531565957446809,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also die lese ich. Das ist der Glaubenskrieg herrscht nämlich hier zu Hause. Auch.",
      "start": 282518,
      "end": 288200,
      "confidence": 0.9569242857142857,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wenn wir übrigens gerade bei Glaubenskriege sind. Ich habe ja in meiner Recherche herausgefunden, weil ich einige von deinen Podcast Episoden gehört habe, dass du ja vom sternzeichen Löwin bist und Spätaufsteherin. Stimmt das?",
      "start": 289940,
      "end": 303292,
      "confidence": 0.8869635294117647,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das stimmt beides, ja, ich finde das.",
      "start": 303396,
      "end": 305860,
      "confidence": 0.8657314285714285,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Super, weil trifft genau meinen Kern. Andi und ich haben absolut unterschiedliche Arbeitszeiten. Bin total froh, dass du da bist, bevor du schon überhaupt irgendwas gesagt hast thematisch.",
      "start": 305940,
      "end": 315740,
      "confidence": 0.8905935714285713,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sehr gut. Wir nehmen das ja auch zu einem späteren Zeitpunkt auf. Es ist ja nicht der 9 Uhr Slot heute. Das ist das, genau.",
      "start": 316360,
      "end": 322968,
      "confidence": 0.915432,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, offen gesprochen, ist ja echt schwierig zu finden mit dem Wolfgang, von daher.",
      "start": 323144,
      "end": 326500,
      "confidence": 0.8671650000000001,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber starten wir mal in das Thema rein. Ich persönlich bin ja auch Meetup Organisator, Andy war das auch lang. Und wir hatten auch in unseren Teams immer das Problem, dass Teammitglieder irgendwie scheu hatten, irgendwo Vorträge zu machen, auf Meetup zu gehen, sich da auf die Bühne zu stellen. Und die Standardantwort in unseren Köpfen war eigentlich immer Impostor Syndrom. Das muss das Impostor Syndrom sein. Und wir als Leads haben dann halt probiert, irgendwie zu pushen in ganz verschiedenen Varianten. Ist es ein richtiges Verständnis von Impostor Syndrom oder wie würdest du Impostor Syndrom grundsätzlich mal definieren?",
      "start": 328000,
      "end": 363810,
      "confidence": 0.9056743434343437,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das Impostor Syndrom ist der Glaube, dass man die eigene Position oder die eigenen Zugeständnisse, sowas wie, man wird aufgefordert, irgendwo aufzutreten, dass man das gar nicht verdient hat. Und dass man sich auf diesem Gebiet, dem eigenen Gebiet, wo man sich tummelt, im Job vor allen Dingen, wie ein hochstapler fühlt und befürchtet, jederzeit aufzufliegen. Also es sind so Gedanken wie, oh Gott, irgendwann finden alle raus, dass ich eigentlich gar nichts kann oder ich weiß gar nicht, warum ich hier gelandet bin, ich weiß doch gar nicht genug. Also so Gedanken, die darum kreisen, dass man ungenügend ist, zumindest für das, was man da gerade machen soll im Job. Ganz starke Zweifel an dem eigenen Wissen, dem eigenen Können, dem eigenen Auftreten. Und ja, das würde ich sagen, ist so der Kern vom Hochstapler Syndrom oder dem Impostor Syndrom.",
      "start": 363930,
      "end": 413152,
      "confidence": 0.9394248226950357,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber das betrifft wahrscheinlich nicht nur jetzt, wenn ich einen Vortrag machen will. Gibt es irgendwelche Situationen im Alltag, wo das auch auftreten kann? Also im Berufsumfeld? Oder geht es da wirklich nur, wenn es dann so absolute Steigerungen sind, würde ich mal sagen, von der Leistung, wo man jetzt wirklich was macht, was man noch nie gemacht hat oder solche Dinge?",
      "start": 413216,
      "end": 431020,
      "confidence": 0.9591324193548387,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nein, überhaupt nicht. Das kann immer auftreten. Ich glaube z.B. eine häufige Situation ist, wenn man in einem Meeting einfach nur drin sitzt. Ich nehme jetzt, sag jetzt mal einfach neuer Job, ja, ich bin so in meinem ersten Monat dabei und war auch stolz, dass ich die Stelle bekommen habe und setze mich in dieses Meeting und höre mir das erste Mal an, wie so eine Wochenrunde abläuft und eine Wochenplanung und sitze da und höre einem nach dem anderen zu. Und je mehr die Menschen reden und schlaue Sätze von sich geben, desto mehr denke ich, was mache ich eigentlich hier? Ich habe doch gar keine Ahnung. Oh Gott, gleich bin ich dran und dann werden alle merken, dass sie einen Fehler gemacht haben, dass sie mich hier eingestellt haben, so, also es ist sehr viel, was sich im Kopf abspielt und auch in Situationen, wo man nur beobachtet. Also man muss gar nichts aktiv tun, sondern es reicht, wenn man in einer Umgebung ist, wo man den Eindruck hat, das eigene Können reicht gerade nicht.",
      "start": 431100,
      "end": 481754,
      "confidence": 0.9313172471910113,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und gibt es da irgendwie einen Unterschied, ob ich jetzt Junior Level bin, also irgendwie frisch von der von der Uni bin oder kann sowas auch später im Berufsumfeld dann passieren?",
      "start": 481922,
      "end": 493690,
      "confidence": 0.8584700000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, es kann immer passieren. Also es gibt Umfragen dazu, wie oft oder ob Menschen überhaupt dieses Gefühl kennen. Und in Umfragen geben 80 % aller Menschen an, dass sie das Gefühl kennen, dass sie ab und zu schon mal dagesessen haben und gedacht haben, ich bin hier gar nicht richtig, ich kann das alles gar nicht und sich so ein bisschen eben wie ein Hochstapler fühlen.",
      "start": 493810,
      "end": 512360,
      "confidence": 0.9421938805970147,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das kann also auch dem großen CEO passieren oder der Leiterin, die da auf der Bühne steht und eigentlich eine super Präsenz hat, aber im Hintergrund vielleicht trotzdem irgendwo das Impostor Syndrom abschlägt.",
      "start": 512520,
      "end": 522936,
      "confidence": 0.9385327272727274,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Absolut. Also deswegen, ich wollte gerade noch ergänzen, die 80 % haben das angegeben. Ich glaube ja, dass die anderen 20 es entweder schon wieder vergessen haben, dass es ihnen auch mal so gegangen ist oder einfach auch ein bisschen geschummelt haben. Erfahrung ist, dass man, wenn man von Menschen umgeben ist, immer mal an den Punkt kommt, dass man denkt, oh, die anderen sind ja auch ganz schlau, vielleicht habe ich mich da überschätzt vorher oder vielleicht weiß ich doch ein bisschen weniger als ich dachte. Und das sind ja im Kern erstmal selbst Zweifel, die ganz wichtig sind für die Entwicklung eines jeden Menschen. Wenn wir nie an uns selbst zweifeln würden, dann würden wir auch nicht daran arbeiten, uns zu verbessern, uns weiterzuentwickeln. Insofern ist das im Kern ein ganz urmenschliches, wichtiges Gefühl. Das Impostor Syndrom, deswegen ja auch dieser Begriff Syndrom charakterisiert noch mal, dass es über den normalen Selbstzweifel aber hinausgeht. Also wer das sehr häufig hat, dieses Gefühl, der kommt eben in diese Gedankenschleifen, die ich so ein bisschen vorhin beschrieben habe, rein und findet nicht mehr so leicht raus. Also da ist es sozusagen ein Muster, was sich in den Gedanken eingespielt hat, was sehr leicht angestupst werden kann. So kann man es vielleicht formulieren. Und weil du gerade von vom CEO gesprochen hast, man hat auch Umfragen unter Führungs gemacht und da sind es 50 bis 60 %, die angeben, dass sie das Impostor Syndrom auch sehr wohl kennen. Also auch noch die Hälfte oder sogar ein bisschen drüber prof wenn ich dir.",
      "start": 523048,
      "end": 609778,
      "confidence": 0.9312322222222221,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt so zuhöre, dann klingt das so ein bisschen nach, als wenn das oft oder vermehrt auftritt, wenn man, ich sag mal, mit neuen Themen oder ähnliches in Berührung kommt. Und da frage ich mich, hat das irgendwie einen Zusammenhang, dass man immer, wenn man außerhalb seiner Komfortzone unterwegs ist, dass das vermehrt auftritt? Oder ich meine, mähe ich jetzt den ganzen Tag Rasen, dann bin ich beim Rasenmähen in meiner Komfortzone. Rasenmähnlich ist wahrscheinlich nicht das beste Beispiel zu mir gegeben.",
      "start": 609794,
      "end": 636476,
      "confidence": 0.8944186585365852,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich wollte gerade sagen, ich werde nicht in meiner Komfortzone.",
      "start": 636588,
      "end": 639280,
      "confidence": 0.851656,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Nehmen wir mal Rasenpflege.",
      "start": 640780,
      "end": 642356,
      "confidence": 0.887025,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich gucke an die Lieblingsbeschäftigung einfach.",
      "start": 642428,
      "end": 645120,
      "confidence": 0.7110985714285715,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich meine, du hast ja, du hast einen Garten und der wird ja wahrscheinlich anders gepflegt als jetzt der Rasen auf dem Golfplatz oder sowas. Und also ist das dann halt so okay, wenn ich in meiner Komfortzone bin, tritt das dann weniger auf oder kann. Gibt es eine Relation zu.",
      "start": 646260,
      "end": 657936,
      "confidence": 0.8908755769230768,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das ist eine sehr gute Frage. Also in der Psychologie geht man ja immer davon aus, dass jedes Verhalten bedingt wird durch die Person oder die Persönlichkeit eines Menschen und durch die Situation, in die dieser Mensch oder diese Persönlichkeit gesetzt wird. So formuliere ich jetzt mal. Und das ist beim Impostor Syndrom auch so. Ganz viele Menschen glauben, dass das eher eine Persönlichkeitsfrage ist, also dass Menschen eben dann eben zu wenig Selbstbewusstsein oder so haben und deswegen impostern. Und die Studienlage zeigt aber ganz deutlich, dass es ganz bestimmte Situationen gibt, die das Impostor Syndrom richtiggehend triggern oder oder anstoßen. Und das sind Situationen, in denen, wie du gesagt hast, man aus der Komfortzone raus ist. Also z.b. wenn man einen neuen Job anfängt oder in ein neues Team wechselt, auch wenn man im alten Job verbleibt, wenn die Erwartungen an die eigene Rolle nicht ganz klar sind, wenn man gar nicht weiß, was ist denn hier eigentlich der Standard, den ich erfüllen muss? Was ja oft passiert, wenn man in einem neuen Job ist, dann muss man sich das erstmal erschließen, was es auch fördert. Das Impostor Syndrom ist ein sehr konkurrenzorientiertes Umfeld, also so Ellenbogen Mentalität oder wenn sehr oft rausgestellt wird, wer hier gerade mehr weiß als der andere, wer besser performt hat als der andere. Auch das fördert Hochstaplergedanken. Genau. Also es ist ein Phänomen, was in der Persönlichkeit liegt. Da kommen wir vielleicht auch noch drauf, was genau das bei bestimmten Menschen oder warum bestimmte Menschen das schneller entwickeln als andere. Aber die Situation ist enorm wichtig dafür, weil es die auslösende Situation ist, also der Auslöser. Und eine Sache, die ich ganz spannend finde und die ich nicht wusste, bevor ich mich intensiver beschäftigt habe mit diesem Phänomen, ist, dass Stereotype z.b. eine große Rolle dabei spielen. Also ich denke, denke jetzt gerade an euch, an euer Umfeld. Entwickler sind ja oft sehr, sehr diverse.",
      "start": 658108,
      "end": 777466,
      "confidence": 0.9323027160493828,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Teams und naja, schön wäre es, würde ich mal sagen.",
      "start": 777498,
      "end": 781762,
      "confidence": 0.8256509999999999,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ist nicht so.",
      "start": 781866,
      "end": 782690,
      "confidence": 0.9110575,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Leider, leider weniger, als man vielleicht gerne hätte, aber grundsätzlich vielleicht international divers wenigstens.",
      "start": 782730,
      "end": 789030,
      "confidence": 0.89485,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, interessant.",
      "start": 789410,
      "end": 790314,
      "confidence": 0.7274750000000001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber Frauen in Entwicklerteams ist immer noch leider eine Seltenheit und liegt schon eher unter 20 %, würde ich sagen.",
      "start": 790362,
      "end": 796962,
      "confidence": 0.9394429999999998,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Doreen Ah, okay, okay, interessant. Also zumindest ist es so, dass Stereotype, wenn die angepingt werden, dass auch die sehr schnell zu Hochstapler Gedanken führen. Und das kann so was sein wie, ich bin der erste in meiner Familie, der studiert, ja, dann werde ich schneller zum Hochstapler Syndrom tendieren oder zu diesen Gedanken, die typisch dafür sind, als jemand, wo alle studiert haben in der Familie und wo klar ist, das Schaffen, das macht man bei uns so, das ist völlig selbstverständlich. Also die Selbstzweifel um dieses Studium herum sind einfach kleiner. Und wo das auch passiert, weil du gerade die Frauen erwähnt hast, ist z.B. in Berufsfeldern, wo der Stereotype sagt, ich sage jetzt mal, Frauen können kein Mathe oder Frauen verstehen nichts von Technik. Dann ist eine Frau, wenn sie in diesem Job landet, und dafür muss sie ja schon einiges geleistet haben, um in diesem Job zu landen, trotzdem wird sie anfälliger sein für Hochstaplergedanken als ihre männlichen Kollegen. Einfach aus dem Grund heraus, dass die Selbstverständlichkeit fehlt. Und dass, wenn die Selbstverständlichkeit fehlt, Selbstzweifel angetriggert werden.",
      "start": 796986,
      "end": 865494,
      "confidence": 0.9095247513812154,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es gibt ja auch diese Theorie, oder ich glaube, es ist eigentlich auch oft schon nachgewiesen worden, dass Frauen bei Job Postings sich eher nicht darüber aussehen, wenn da viele Dinge oben stehen, was man nicht alles können muss und was man für den Job nicht alles braucht. Und Männer dann eher sagen, ja, ja, schon okay, schaffe ich schon irgendwie oder das kann ich schon irgendwie. Siehst du das dann auch als Impostor in gewisser Weise? Und gibt es dann auch Unterschiede einfach von Geschlechterseite? Oder würdest du das dann auf die Stereotypen wieder zurückführen?",
      "start": 865662,
      "end": 897546,
      "confidence": 0.9406698958333334,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist eine gute Frage. Sagen wir mal so, das Impostor Syndrom ist nicht geschlechtsabhängig. Das heißt, das erfahren Männer und Frauen genauso häufig oder geben es zumindest erst mal so an. Bei den Selbstzweifeln und dem, was man damit macht, mit diesen Selbstzweifeln, ich glaube, da würde ich schon sagen, dass es zumindest Tendenzen gibt, dass Frauen da sehr viel selbstkritischer sein können als Männer. Nicht immer, aber können. Das heißt, das ist aber eher der Umgang. Ich glaube, das Maß an Selbstzweifel unterscheidet sich nicht, aber der Umgang damit, so würde ich es formulieren.",
      "start": 897738,
      "end": 932606,
      "confidence": 0.9228325000000003,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Hängt da dann irgendwie das Selbstwertgefühl auch mit dran, dass Männer einfach, keine Ahnung, vielleicht ein höheres Selbstwertgefühl haben von Natur aus oder was Natur auch immer heißt?",
      "start": 932758,
      "end": 942750,
      "confidence": 0.9211678571428573,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist die Frage. Ich glaube nicht, müsste ich, da kenne ich jetzt die Zahlen nicht, da müsste ich mir die Studie noch mal anschauen zum Selbstwert. Ich glaube nicht, dass das so ist. Ich glaube, dass sich der Umgang damit unterscheidet und auch das, was man sich selbst zutraut, was, das muss man ja auch dazu sagen, auch da wieder die Situation spielt eine Rolle und die gelernten Erfahrungen, was das Umfeld mir zutraut. Und da ist es natürlich bei Frauen so, dass sie einfach jahrhundertelang die Erfahrung gemacht haben, dass ihnen wenig bis gar nichts zugetraut wird. Das hat sich ja alles erst in den letzten zwei, dreihundert Jahren so langsam geändert. Insofern ist das eine ganz andere Historie und auch ein anderes Mindset. Und auch da wieder eine andere Selbstverständlichkeit, mit der Männer und Frauen durch die Welt gehen, wenn es um ihre Leistungsfähigkeit geht.",
      "start": 945930,
      "end": 990574,
      "confidence": 0.9429950675675677,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Im Laufe meiner Karriere habe ich immer wieder gehört, man muss nicht oder man darf nicht aufhören zu lernen. Und besonders in der Softwareentwicklung ist das halt, ich Sag mal, gang und gäbe. Ich glaube, in letzter Zeit kam jetzt AI und jeder muss jetzt irgendwie mit künstlicher Intelligenz umgehen können und einen anderen, ich sag mal, Karriere. Etwas, den ich schon öfters gehört habe, sei nie der klügste im Raum. Bzw. Wenn du der klügste im Raum bist, dann verlasse den Raum, so umgangssprachlich. Und da frage ich mich natürlich, fördern diese dieses dauerhafte Lernen und sei nie der Glücksraum nicht irgendwie auf das Impostor Syndrom, weil du begibst dich halt dann oder du zwingst dich ja maßgeblich immer in neue Situationen, wo du ja dann mehr oder weniger sogar hoffentlich keine Ahnung von hast und dich fragst, was tue ich eigentlich hier?",
      "start": 1066742,
      "end": 1111900,
      "confidence": 0.8952432638888885,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, würde ich schon sagen, ja, weil das spielt wieder in diese Situationsfaktoren rein. Das heißt, je mehr auch alle anderen um mich herum lernen und je höher die Erwartungen sind, dass ich beständig lerne und mich weiterbilde, desto mehr kann ich mich mit anderen vergleichen. Und der Vergleich, deswegen auch konkurrenzorientiertes Umfeld, ist super Nährboden für Impostor. Je mehr ich mich mit anderen vergleiche, umso eher fällt mir natürlich auch ups er weiß bei dem Thema mehr, sie hat das schon gemacht, was ich noch nie gemacht habe. Und dann ist man sofort bei diesen Gedanken. Vielleicht bin ich ein Hochstapler und die anderen haben es nur noch nicht gemerkt.",
      "start": 1111980,
      "end": 1146990,
      "confidence": 0.9412081081081077,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Der Wolfgang hatte am Anfang erwähnt, dass wir früher ziemlich viel oder eher immer noch Meetups organisieren, wo es dann oft um, ich sag mal, Vorträge geht. Und wenn man ein solches Event organisiert, dann geht man, ich sag mal, auf so eine kleine Roadshow, man quatscht ziemlich viele Leute an. Hey, hast du nicht mal Lust, einen Vortrag über Thema XY zu halten? Und da kommt man ja oft an diesem Punkt, wo dann geantwortet wird, aber ich weiß doch gar nichts, ich kann doch gar nichts und worüber soll ich denn sprechen? Und meine, meine Antwort war immer ja, woran arbeitest du denn jetzt gerade? Ja, ich entwickle gerade ein Plugin für WordPress. Ja, dann erzähl mir doch mal was darüber. Und dann kam die Person dann ins Reden und ins Reden und ins Reden. Ich habe ein paar Notizen nebenbei gemacht und am Ende, heutzutage wird man diese Notizen nehmen, die in eine künstliche Intelligenz packen und sagen machen wir bitte eine Präsentation. Aber im Endeffekt hatte man dann mehr oder weniger schon so einen roten Faden von der Präsentation. Und da frage ich mich gerade so ein bisschen, ist das überhaupt förderlich, was man da getan hat? Weil man versucht ja die Person eigentlich nur zu enablen, um, ich sag mal, ein bisschen aus ihrer Komfortzone rauszuschubsen. Vielleicht. Das hört sich jetzt total negativ an, wie ich das formuliere, aber. Und dann frage ich mich, ist das ja, also kann das dieser, dieser Effekt, jemanden, so sehe ich es, zu enablen, nicht später einen negativen Effekt haben, weil man dann dieses mögliche Impostor Syndrom sogar fördert, falls jemand da spricht, eine Frage bekommt und dann öffentlich sagen muss, ich weiß es nicht.",
      "start": 1147150,
      "end": 1228782,
      "confidence": 0.9020055594405588,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nö, ganz klares Nein. Nein, das finde ich aber einen sehr interessanten Punkt, den du machst. Ich habe ja in den USA studiert und ich würde jetzt mal mir anmaßen zu sagen, das ist glaube ich auch einen Mentalitätsunterschied, fällt mir jedenfalls immer auf in Deutschland. Es ist immer noch so, dass dieses sehr bescheidene Auftreten und keine große Selbstdarstellung ist immer noch ein ziemlicher Wert, mit dem man so groß wird. In den USA ist das komplett anders. Und da wirst du das ganze Studium vom ersten Semester an gezwungen, jede Woche zu präsentieren. Und zwar völlig egal, wie dein Wissensstand dann gerade ist oder wie viel von dem Buch, dem Paper oder was auch immer du geschafft hast zu lesen. Du musst öffentlich sprechen. Und das ist eine reine Übungssache. Das lernen wir, glaube ich. Ich bin jetzt auch lange schon nicht mehr in der Schule gewesen, aber ich glaube, wir lernen das immer noch nicht so viel, wie es eigentlich gut wäre, weil das natürlich, wenn man es schafft und selbst wenn man dann eine Frage bekommt, die man nicht beantworten kann, aber in der Regel hat man dann was geschafft. Man kommt da lebend wieder runter von dieser Bühne und hat danach in der Regel immer noch seinen Job. Meistens kriegt man sogar noch ganz gutes Feedback. Das heißt, das ist eigentlich ein super guter Weg, um zu verstehen, ich schaffe das, ich bin selbstwirksam, ich kann aus meiner Komfortzone raus. Und meistens klappt das sogar ganz gut. Also das finde ich, wenn ihr das als Führungskräfte macht und die Leute ein bisschen rausschubst, das ist gut. Also schade, dass noch keiner vor euch dann gemacht hat.",
      "start": 1228846,
      "end": 1321592,
      "confidence": 0.9419444128113876,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube, dass das, dass das sehr häufig schon gemacht wird bei den meisten. Und ehrlich gesagt, stupsen reicht meistens nicht aus. Das braucht schon teilweise auch erinnern, immer wieder fragen, immer wieder pushen, auch vielleicht den Rahmen geben, Hilfestellung, wenn es, wenn es nötig ist, natürlich, ist klar. Aber ich glaube, also ich würde sagen, es wird schon viel hoffentlich eigentlich auch gemacht. Und ich glaube, es gehört da auch sinnvoll dazu, im Leadership Bereich sowas zu machen. Und man ist verantwortlich auch für die Weiterentwicklung in gewisser Weise.",
      "start": 1321656,
      "end": 1352270,
      "confidence": 0.8845130000000002,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, absolut richtig.",
      "start": 1352390,
      "end": 1353662,
      "confidence": 0.9837966666666667,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, jetzt hast du das ein sehr positives Bild gezeichnet und dass man da etwas zurückbekommt und rausbekommt und vielleicht sicherer wird und auch etwas lernt, kann es auch in eine negative Seite überschlagen. Also dass es wirklich in irgendwie Probleme führt, irgendwelche Angststörungen oder ähnliches, wenn man ständig dem Impostor Syndrom ausgesetzt ist und vielleicht dann eben nicht mehr damit richtig umgehen kann und vielleicht eben gar nicht mehr auf die Bühne raufkommt, sondern davor schon irgendwie an den Ängsten oder bei diesen Ängsten stecken bleibt.",
      "start": 1353686,
      "end": 1386288,
      "confidence": 0.8930110344827585,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich muss dazu sagen, ich bin natürlich keine klinische Psychologin, aber ich würde trotzdem sagen nein, aus dem einfachen Grund, dass man weiß, dass Ängste vor allen Dingen dann größer werden, wenn man dem Angstauslöser aus dem Weg geht. Also je mehr man die Situation vermeidet, die einem Angst machen, umso größer werden die Ängste. Deswegen, also das ist der Grund, warum man in der Verhaltenstherapie oft konfrontiert, nämlich genau mit den Dingen, vor denen man Angst hat. Das heißt, in der Verhaltenstherapie würden auch in dem Fall die Therapeuten dafür sorgen und ganz sanft die Leute Stück für Stück auf die Bühnen schubsen, um mal bei dem Beispiel zu bleiben, weil Ängste einfach so funktionieren. Die natürliche menschliche Reaktion auf Angst ist Vermeidung. Und das lässt aber die Angst leider eher größer werden, statt sie abzubauen oder auch auf dem gleichen Level zu halten. Und da sind wir ja so ein bisschen bei der Persönlichkeit. Wir hatten vorhin schon angeschnitten, dass auch die Persönlichkeit natürlich sehr wichtig ist. Und Menschen werden rein genetisch schon mit einem sehr unterschiedlichen Level an Grundangst, Psychologen nennen das Trade Angst, also wirklich eine genetisch angelegte Bereitschaft zur Angst geboren, wofür sie erst mal nichts können, auch die Eltern nicht. Und jeder muss dann damit umgehen, was die Natur ihm oder ihr mitgegeben hat. Aber daran kann man eben arbeiten. Also die Angst per se ist ja meist nicht das Problem, sondern der Umgang damit. Und ja, evolutionär haben Menschen immer dann überlegt, wenn sie überlebt, wenn sie eher ängstlich waren. Deswegen ist die Angstbereitschaft der Menschen grundsätzlich eher hoch. Trotzdem kann man die überwinden. Und das ist im Grunde auch der einzige Weg, um gut mit ihr umzugehen. Man muss sie überwinden.",
      "start": 1386344,
      "end": 1485526,
      "confidence": 0.9330761379310345,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das heißt für mich als Lied, ich brauche keine Angst haben, wenn ich da jetzt ein bisschen pushy bin und die Leute dazu überrede. Oder vielleicht im Idealfall auch Hilfestellung. Und klar, Ausnahme bestätigen die Regel, aber im Normalfall sollte das keine Störungen oder so nach sich ziehen, sondern es ist okay, wenn ich das mache.",
      "start": 1485678,
      "end": 1503492,
      "confidence": 0.9005914285714285,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, das ist okay. Also natürlich kannst du niemanden zwingen, aber Menschen haben ja auch einen freien Willen. Wer wirklich gar nicht will, aus welchen Gründen auch immer, kann das ja trotzdem sagen. Aber ich finde das nicht nur zu ermuntern, sondern auch zu begleiten. Das ist ja die beste Hilfestellung, die man bekommen kann. Das ganz alleine zu schaffen, machen manche ja auch. Also das Wort Mut kommt ja nicht einfach so, sondern Mut heißt ja, die Angst zu überwinden, sonst wäre es nicht mutig. Das heißt, manche Menschen schaffen das auch alleine. Es ist aber natürlich schöner, wenn einem jemand die Hand reicht und sagt, komm, wir machen das zusammen, ich helfe dir, ich gucke über deine Notes rüber, bevor du darauf gehst. Ich klatsche hinterher und warte hinter der Bühne auf dich. Das ist ja eine total schöne Begleitung.",
      "start": 1503556,
      "end": 1544526,
      "confidence": 0.9289471126760565,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, man kann es ja auch stufenweise machen, mal im kleineren Setting irgendwie präsentieren. Also wenn Leute Angst vor der Präsentation an sich haben von dem Vortrag, kann man sich da ja schrittweise nähern. Und zuerst im kleinen Team, bevor man mal auf eine Konferenz mit 300 Leuten geht. Weil das ist natürlich schon, wenn du in einem Theater sitzt und da drei bis 500 Leute oder so auf dich starren. Das ist natürlich schon hart, glaube ich, für jeden. Und keine Ahnung, mir persönlich geht es zumindest immer noch so, dass ich auch bei hunderten Leuten natürlich schon irgendwie nervös bin. Also, dass man da absolut sicher ist, kann ich mir nicht vorstellen. Manche vielleicht ja, nee.",
      "start": 1544638,
      "end": 1577364,
      "confidence": 0.8971941525423724,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nein, ist auch ganz wichtig. Also ich weiß auch, dass Schauspieler oder wir hatten neulich ein Gespräch hier, ein Kollege mit dem Oliver Bierhoff, also die wirklich sehr viel Leistungsdruck und sehr viel Öffentlichkeit ausgesetzt sind. Und auch die sind nervös, bevor sie auf eine Bühne gehen, weil diese Nervosität ja was ganz wichtiges ist. Die stellt ja Energie bereit und die braucht man ja, wenn man vor Leuten spricht. Man spricht ja dann auch anders als im Zweier Gespräch irgendwie im Büro, wenn man nebeneinander sitzt. Das heißt, der Körper bereitet sich darauf vor. Und die Nervosität ist erstmal was total Schönes, weil es Energie bereitstellt. Und wenn man das schafft, von der Angst wegzukommen gedanklich und diese Energie in die Performance zu packen und in einen Ausdruck und in Kraft und Gesten, dann ist sie sogar sehr, sehr hilfreich und wichtig.",
      "start": 1577452,
      "end": 1620134,
      "confidence": 0.915384335664336,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe mal gehört, wenn man nicht mehr nervös ist, dann nimmt man die ganze Sache nicht mehr so ernst, zumindest beim public speaking. Und fand ich recht schön. Also zu mir hat es immer geholfen, weil ich jetzt gut vor 300 Leuten spreche. Das tut man jetzt auch nicht jeden Tag. Da ist man, glaube ich, ganz einfach nervös.",
      "start": 1620222,
      "end": 1635358,
      "confidence": 0.9568661666666667,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ja, alles auch wichtig, finde ich auch.",
      "start": 1635454,
      "end": 1638222,
      "confidence": 0.8509125000000001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt gibt es da noch das Attribut des Perfektionismus, zumindestens ich bin in manchen Teilen auch sehr perfektionistisch, was ich weiß, dass das negativ für mich ist. Gibt es da auch irgendeine, ich sag mal, Relation zum Impostor Syndrom? Oder sagst du, es sind zwei unterschiedliche Attribute, die haben nichts miteinander zu tun?",
      "start": 1638366,
      "end": 1657340,
      "confidence": 0.9005847169811316,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Doch, die haben was miteinander zu tun, weil wenn ich die ganze Zeit die Sorge habe, dass ich nicht genüge und dass ich auffliege, dann versuche ich natürlich alles, um nicht aufzufliegen und versuche meine Arbeit so gut, gut wie möglich zu machen. Auch das weiß man aus der Forschung, dass Menschen mit Impostor Syndrom dann gern auch Feedback vermeiden, also negatives Feedback, weil sie das ja erwarten. Und dann fallen sie eher noch mal dran, machen noch eine Schleife und schlafen noch eine Nacht drüber und gucken noch mal drauf, um sicher zu gehen, keine Fehler zu machen, weil sie sich vor diesem negativen Feedback fürchten, was sie ja schon antizipieren. Das heißt, das gibt einen sehr engen Zusammenhang zwischen Perfektionismus und zumindest einem sehr ausgeprägten Impostor Syndrom, weswegen man, wenn man das bei sich selbst bemerkt, dass man so dazu tendiert, wirklich diese Schleifen im Kopf zu drehen und das sehr häufig und sehr schnell, dann sollte man da ran, finde ich, weil es auch Zusammenhänge gibt mit Burnout. Also wer ständig Angst hat, Fehler zu machen und dann auch noch perfektionistisch wird, der ich finde, das klingt immer schon so anstrengend, wenn ich das so erzähle, der kann irgendwann nicht mehr schlafen. Das ist dann so belastend, dass es wirklich ins Burnout führen kann. Und dann sollte man was tun. Das ist, wie gesagt, immer eine Frage der Ausprägung und der Intensität. Wie schlimm ist das? Wie oft passiert mir das und wie blockiert werde ich dadurch in meiner Arbeit? Aber wenn es sehr hochgradig ist auf diesen drei Dimensionen, dann sollte man was tun.",
      "start": 1657680,
      "end": 1742038,
      "confidence": 0.9248958955223877,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und jetzt Software Engineers sind ja sehr datengetrieben und die versuchen natürlich immer alles zu quantifizieren. Jetzt sagtest du gerade, wenn man solche Gedanken häufiger hat, da gibt es jetzt nicht. Wann ist häufig häufig in der in der Psychologie oder es ist jetzt nicht so, ich habe mich jetzt letzten Monat dreimal so gefühlt. Ist das jetzt ausgeprägt oder ist das nicht ausgeprägt? Also gibt es da irgendeine Art von. Ich mag das Wort jetzt nicht, weil das erinnert mich immer so, als ich google meine Krankheit, Selbstdiagnose, irgendwie so eine Art.",
      "start": 1742214,
      "end": 1770980,
      "confidence": 0.9100192473118277,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Naja, Psychologe arbeiten immer mit dem mit dem Leidensdruck als Indikator, dass sie sagen, wenn du selbst merkst, dass es dich behindert, dass du deinen Job nicht mehr vernünftig machen kannst, dass du abends nicht mehr zur Ruhe kommst, dass du nicht mehr gut schläfst z.B. dass du merkst, wenn eine Präsentation ansteht, kriegst du jedes Mal irgendeinen Ausschlag oder so. Also wirklich Dinge, an denen man selbst merkt, das funktioniert irgendwie nicht. Ich komme da nicht raus. Ich drehe mich die ganze Zeit im Kreis. Ich traue mich nicht, das Ding abzugeben, was ich da programmiert habe, weil dann kriege ich ja Feedback und dann wird man mir sagen, dass ich ein Hochstapler bin. Also wenn es solche Dimensionen annimmt und da ist wirklich Leidensdruck, finde ich ein sehr guter Indikator, weil Menschen auch da sehr unterschiedlich sind. Einer hat zehnmal am Tag die Gedanken, kann damit aber gut umgehen. Der nächste hat das fünfmal und kommt dann aber nicht mehr raus und hat dadurch einen anderen Leidensdruck. Deswegen würde ich immer über den Leidensdruck gehen und gucken, habe ich diese Gedanken und kann trotzdem gut meinen Job machen und nachts ruhig schlafen oder nicht? Dann wird es schwierig.",
      "start": 1772240,
      "end": 1836776,
      "confidence": 0.9347226499999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Hast du irgendwelche Tipps für Leute, die jetzt konkret in so einem Impostor Syndrom drinstecken? Wie man damit umgeht oder es besser handeln kann, wenn du jetzt keinen Lead hast, der dir direkt gerade an der Seite steht und dich pusht und dir hilft.",
      "start": 1836968,
      "end": 1851128,
      "confidence": 0.9282738636363637,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und ja, es gibt verschiedene Dinge, die man machen kann. Also ich hatte ja vorhin gesagt, vergleichen ist so eine ganz gefährliche Sache, wenn man dazu tendiert, weil man immer was findet, was andere besser können. Deswegen geraten Psychologen immer dazu, auf sich selbst zu schauen, auf die eigene Entwicklung und von anderen weg. Das sagt sich natürlich leicht, ist im Alltag nicht immer ganz so easy. Was man daran koppeln kann, ist, ich nenne das immer Realitätscheck, dass man mit den Leuten um sich herum spricht. Und wenn man sich selbst wenig zutraut oder sich in diesen vergleichen immer so ein bisschen unterdurchschnittlich einsortiert, dass man mal checkt, stimmt das denn überhaupt? Was sagt denn mein Chef, meine Chefin im Jourfix? Ist das so oder nicht? Weil andere Menschen und gerade wenn man dann, da hat man dann mehrere Datenpunkte, das ist ganz schön, dann kann man die Leute sich zusammensammeln und dann kann man im Kopf einfach gegenüberstellen, okay, ich zweifle mal wieder an mir, aber mir haben letzte Woche fünf Leute gesagt, dass ich das super mache und das glaube ich jetzt einfach mal. Also zum Teil ist es natürlich auch eine Entscheidung, sich umzugewöhnen und andere Gedanken zu denken. Und auch das ist ein Tipp. Also ich hatte ja vorhin beschrieben, diese sehr typischen Gedanken, die dann kommen, ich schaffe das sowieso nicht, das können alle anderen besser als ich. Man wird mich auf jeden Fall enttarnen und merken, dass ich nichts kann, wenn man sich erwischt bei diesen Gedanken. Es gibt so, in der Psychologie nennt man das Erkennen, benennen und umformulieren. Das ist auch das, was man in der Therapie dann macht, wenn man diesen Gedanken erkennt, dann einmal kurz zu stoppen und zu sagen Moment, ist das jetzt eigentlich ein Gedanke, der mir hilft oder macht er mir gerade das Leben schwer? Und wenn er mir das Leben schwer macht, dann nehme ich mir diesen Gedanken und formuliere den um, z.B. in ich kann das schaffen, kann ganz einfacher Satz sein. Und mit diesem umformulierten Satz gehe ich dann weiter. Und wenn ich das regelmäßig mache, dann unterbreche ich zum einen diese negativen Gedankenschleifen regelmäßig und trainiere mir selbst an, anders zu denken. Und das Schöne bei der Psyche ist ja, wenn man anders denkt, fühlt man auch anders. Also die Gefühle und die Gedanken gehen immer sehr miteinander einher. Für die meisten ist es leichter, die Gedanken zu ändern und dann ziehen die Gefühle hinterher. Insofern ist das, finde ich ein ganz, ganz schöner, sehr konkreter Tipp, den man sich mitnehmen kann.",
      "start": 1851184,
      "end": 1985890,
      "confidence": 0.9432004186046506,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe das auch öfters, weil du Realitätscheck gesagt hast, ich habe das auch schon öfters miterlebt. In Firmen gibt es ja oft diese 360 Feedback Bewertungen oder vielleicht einmal im Jahr oder zweimal im Jahr, wenn man sich die einfach hin und wieder mal durchliest im Nachhinein und sich nicht nur auf die negativen Sachen fokussiert, was ja viele machen, sondern die einfach mal bereithält und wenn man wieder Probleme hat oder so, sich einfach mal durchliest und da steht dann meistens ganz oft drauf, dass man eben eine gute Präsentation gehalten hat oder solche Dinge, die können einem wirklich auch das restliche Jahr wirklich helfen, um da wieder in irgend so aus so einer Spirale vielleicht auch rauszukommen. Also das ist eine eine simple Möglichkeit, einfach um, wenn man Feedback auch aufbewahrt und dann wieder im Nachhinein auch von verwendet.",
      "start": 1985970,
      "end": 2032542,
      "confidence": 0.911204718309859,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist ein super Tipp, finde ich. Stimmt, das haben ja ganz viele und da muss man noch nicht mal aktiv loslaufen und sich noch mal was holen an Feedback, sondern genau man kann sich darauf zurückziehen. Und das hilft so ein bisschen dabei, dass man auch nicht jedem Gedanken, der einem so durch den Kopf läuft, dass man dem glaubt. Ich glaube, das ist noch was, was ich sehr wichtig finde. Wir nehmen immer an, dass das, was wir denken, so die Wahrheit ist oder für sich erstmal nehmen das so hin, dass es so ist. Ich finde immer traut nicht jedem Gedanken, den ihr habt. Ganz viele unserer Gedanken, gerade diese selbstkritischen, sind auch so Stimmen aus der Vergangenheit, damals noch gar nicht drüber gesprochen. Biografie, was habe ich in der Familie, in der Schule gelernt darüber, wie leistungsfähig ich bin, ob ich ein Versager bin in Anführungszeichen oder nicht. Und diese diese Sätze, die man dann so sein Leben lang mit sich rumträgt, kommen oft auch daher. Und insofern kann man die sich schon mal kritisch angucken.",
      "start": 2032606,
      "end": 2087120,
      "confidence": 0.9301416111111106,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das war auch gut. Du hast mal jetzt irgendwann erwähnt, man schiebt dann das Feedback irgendwie so weg oder schaut noch mal drüber, so perfektionistisch oder man hat selber das Gefühl, dieser Vortrag war nichts und der war eigentlich uninteressant und man fragt vielleicht gar nicht nach Feedback. Und wenn man dann aber die Leute mal fragt, wie war denn der Vortrag am nächsten Tag und man hört plötzlich ja, es hat allen irgendwie geholfen und es waren super viele News dabei, die die super spannend waren. Und wenn man das gar nicht macht, dann bleibt man immer bei sich selber hängen und denkt ja, es waren ja keine Fragen bei dem Vortrag. Scheinbar war es nicht interessant. Also ich glaube, das ist wirklich wichtiger Punkt, Feedback einholen, auch nach einem Vortrag z.B. absolut.",
      "start": 2087580,
      "end": 2123788,
      "confidence": 0.9256751492537313,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und das ist schwierig. Also für Menschen, die zum Impostor Syndrom tendieren, ist das wirklich schwierig, weil sie ja genau davor Angst haben, Feedback zu bekommen. Aber ja, es ist ganz, ganz wichtig.",
      "start": 2123844,
      "end": 2134772,
      "confidence": 0.9317309090909093,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich rede mir immer ein, dass andere Menschen nur mit einem anderen Thema einfach nur mehr Zeit verbracht haben und die deswegen mehr wissen. Also da, weil ich bin dessen ja auch nicht gefeilt. Das bedeutet, ich habe das natürlich auch bzw. Frag mich das öfters mal. Und weil ich jetzt gerade auch von mir rede und sage, ich habe das auch, das klingt so ich wäre tiefkrank. Ich glaube, ich bin nicht tiefkrank, ist meine Frage, bin ich eigentlich noch normal, wenn ich das nie habe oder noch nie hatte? Um mal mit deiner Kolumne es einzuleiten.",
      "start": 2134956,
      "end": 2164908,
      "confidence": 0.8946066326530613,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Sehr schön. Na ja, ich habe ja vorhin schon gesagt, ich glaube die 20 %, die sagen, sie hatten das noch nie, schummeln so ein bisschen. Doch, ich glaube, es kennt in Ansätzen zumindest jeder, zumindest den Selbstzweifel, weil das eine der größten Triebfedern für Entwicklung ist und die. Ja, ich glaube schon, dass Menschen sich im Kern immer gern entwickeln wollen. Nicht unbedingt im Job, manche auch auf anderen Gebieten, aber dass man an sich zweifelt. Der Mensch ist ja ein hochgradig soziales Wesen und sehr darauf bedacht, in der Gruppe zu passen und in der Gruppe einen Platz zu finden. Und deswegen glaube ich, das wäre nicht so normal, tatsächlich jemand das überhaupt gar nicht kennt. Aber es ist natürlich normal, das unterschiedlich ausgeprägt zu haben. Also manche haben das oft, manche nie oder fast nie.",
      "start": 2165044,
      "end": 2211556,
      "confidence": 0.9383486956521737,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Bei der Vorbereitung zu dieser Episode bin ich dann auch noch über einen zweiten Begriff gestoßen, und zwar dem Dunning Kruger oder kruger Effekt. Ich weiß gar nicht, ob es um Kruger oder Krueger geht. Kannst du uns den ganz kurz erklären? Weil der steht ja auch, glaube ich, zumindest in einem gewissen Zusammenhang zum Impostor Syndrom.",
      "start": 2211628,
      "end": 2228860,
      "confidence": 0.9198442105263158,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja genau, Dunning Kruger wäre es in dem Fall tatsächlich, weil die zwei, die das entdeckt haben, waren David Dunning und Justin Kruger, also zwei US Amerikaner, glaube ich. Der Dunning kruger Effekt bezeichnet eine kognitive Verzerrung und die besagt, dass Menschen das eigene Wissen oder Können überschätzen. Also im Grunde genau das Gegenteil vom Impostor Syndrom. Und zwar vor allen Dingen in den frühen Phasen. Also wenn man z.b. gerade anfängt, eine Sprache zu lernen. Ja, das kennt vielleicht jeder. Da gibt es ja auch, da gibt es auch diese schönen Grafiken, wo man so sieht, dass man am Anfang so ganz, ganz schnell Fortschritte macht und dann verharrt es auf so einem Plateau, wenn man dann anfängt, die Konjugation oder so zu lernen, das zieht sich dann und irgendwann geht es noch mal hoch. Aber am Anfang hat man so einen Stellenanstieg an Wissen und Können und das spürt man. Und deswegen tendieren gerade Anfänger, bei was auch immer sie Anfänger sind, dazu, sich massiv zu überschätzen. Das ist der Dunning kruger Effekt.",
      "start": 2228940,
      "end": 2287440,
      "confidence": 0.9192532571428566,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das kennt man in der IT Welt eigentlich auch. Irgendwie Juniors, die frisch reinkommen, wenn sie glauben, sie sind besser als alle, die irgendwie Senioriker unterwegs sind und sie können die Welt verändern. Und in Diskussionen merkt man das ganz, ganz stark oft, wie Persönlichkeiten dann so auftreten und alles besser wissen auf gut Deutsch.",
      "start": 2287580,
      "end": 2307540,
      "confidence": 0.9274598181818184,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Man muss ja auch sagen, wenn man programmieren jetzt mal lernt, da denkt man ja auch am Anfang, man kann die Welt bewegen, weil man kann einem Computer sagen, was was dieser Computer tun soll und auf einmal malst du dir irgendwelche Roboter aus, die Maschinen bauen und dass das halt alles viel komplizierter ist im Detail, sei mal dahingestellt. Aber wenn wir jetzt mal, wenn ich jetzt so zuhöre, dann bin ich mir nicht ganz sicher. Impostor Syndrom, kann das als Krankheit wahrgenommen werden oder ist das einfach nur, wie gesagt, ein Syndrom, das kommt und geht und das begleitet dich dein ganzes Leben lang?",
      "start": 2308400,
      "end": 2340228,
      "confidence": 0.9260200943396225,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, genau. Ganz wichtig, gute Frage. Es ist ein Phänomen, also Syndrom bezeichnet ja so ein Zusammenhang aus verschiedenen Indikatoren oder verschiedenen Anzeichen, die zusammen auftreten. Das ist beim Impostor Syndrom so, aber es ist kein, es hat keinen Krankheitswert. Es kann ein bekommen oder es kann dahin führen, wenn es Richtung Burnout, Depressionen, also Burnout ist ja eine Erschöpfungsdepression, geht, dann schon. Aber für sich genommen ist es erstmal nur ein Phänomen, was beschreibt, welche Gedanken mit welchen Gefühlen in welchen Situationen zusammenhängen.",
      "start": 2340324,
      "end": 2376106,
      "confidence": 0.9230389285714286,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wie sieht die Antwort mit der gleichen Frage für den Dunning kruger Effekt aus?",
      "start": 2376208,
      "end": 2381090,
      "confidence": 0.8906240000000001,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Der Dunning kruger Effekt ist ein bisschen komplizierter. Also rein aus Forschungssicht. Das Impostor Syndrom ist inzwischen sehr, sehr gut erforscht. Da gibt es sehr viele Befunde dazu, auch für verschiedene Gruppen. Alles, was wir jetzt besprochen haben. Beim Dunning kruger Effekt gibt es ein bisschen mehr Kontroverse, ob es diesen Effekt überhaupt wirklich gibt. Was sehr gut belegt ist, ist, dass Menschen sich, wenn man sie so fragt, wie sie ihr Können einschätzen, normalerweise immer besser einschätzen als der Durchschnitt. Also fragt man Menschen, bist du so ein durchschnittlich guter Autofahrer oder bist du besser, bist du ein besserer Autofahrer als die anderen? Dann haben Menschen die Tendenz zu sagen, na ich fahre schon besser als die meisten. Also wenn ich mir das so angucke, wie die einparken und so. Also Menschen haben eine Tendenz, sich besser einzuschätzen als der der Mittelwert. Und inzwischen vermutet man, dass der Dunning kruger Effekt eigentlich nur genau das zeigt. Da gibt es also einfach von Forschungsdesigns ja so ein paar Sachen, die ein bisschen komplizierter sind, aber es ist natürlich erstmal sehr intuitiv schön verständlich, gerade mit dieser Kurve mit den Anfängern. Also wenn man, das trifft natürlich schon zu, dass Menschen, die etwas lernen, am Anfang Schwierigkeiten haben einzuschätzen, wie gut oder schlecht sie im Vergleich zu anderen sind, weil ihnen einfach noch Erfahrungswerte fehlen.",
      "start": 2382030,
      "end": 2461476,
      "confidence": 0.9181863392857152,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe aber auch irgendwo gelesen, und Achtung, das ist wieder so klassisches, ich habe das irgendwo gelesen, das muss jetzt nicht wahr sein, dass aber im allgemeinen der Durchschnitt relativ niedrig ist, weil wenn man nämlich mit einer Thematik, weiß ich nicht, 100 Stunden oder 50 Stunden irgendwie verbringt, dann soll man wohl, Achtung, statistisch besser als der Durchschnitt sein. Deswegen frage ich mich, ist dieser Dunning krüger Effekt dann nicht vielleicht sogar für viele Leute auch einfach die Wahrheit in ihrer subjektiven Welt?",
      "start": 2461588,
      "end": 2491896,
      "confidence": 0.9127127058823529,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Auf jeden Fall, das glaube ich schon. Ich glaube übrigens auch, dass ich ein besserer Autofahrer bin als die meisten. Ich weiß nicht, wie es euch geht, aber ja klar, in der subjektiven Erfahrung stimmt das. Deswegen ist er, glaube ich, auch so beliebt und wird sehr gern verwendet, weil er so intuitiv, so schön verständlich ist. Und das mit dem Sprachenlernen kennt auch jeder. Ich weiß nicht, ob ihr diese Sprachlern Apps mal benutzt habt. Da ist ja auch so, am Anfang denkt man, boah, ich bin voll das Sprachtalent, ich habe hier immer 100 Punkte, ich kann alle Wörter gut nachsprechen und dann wird es irgendwann, geht es um die Grammatik und die Zeitform und dann.",
      "start": 2491928,
      "end": 2519072,
      "confidence": 0.905502966101695,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Denkt man, bis man dann in das Land fährt und mal wirklich sprechen muss.",
      "start": 2519096,
      "end": 2524032,
      "confidence": 0.9557914285714284,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dann wird es ganz schwierig.",
      "start": 2524216,
      "end": 2525280,
      "confidence": 0.9659039999999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Dann kommt Impostor die erste, könnten sie bitte langsamer sprechen?",
      "start": 2525320,
      "end": 2529980,
      "confidence": 0.8779069999999999,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau. Ja, also ich glaube, so kann man es zusammenfassen. Dunning Kruger ist sehr bekannt, nicht ganz unumstritten, auch nicht so ganz so einfach zu untersuchen, muss man dazu sagen. Aber so als Hilfskonstrukt finde ich trotzdem sinnvoll, damit was zu machen.",
      "start": 2530880,
      "end": 2546266,
      "confidence": 0.9086697619047619,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt versuchen wir auch immer positive Aspekte irgendwie reinzubringen. Gibt es die beim Impostor Syndrom, gibt es auch irgendwelche Vorteile, dass das Impostor Syndrom existiert oder ist es nur nervig?",
      "start": 2546418,
      "end": 2559546,
      "confidence": 0.8959093333333332,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nee, das ist auch gut. Das führt z.B. dazu, also erstens, wir hatten ja gesagt, Selbstzweifel sind wichtig für die Entwicklung, so ein bisschen Impostor ist ganz gut, weil es uns pusht, weil wir merken, ah, hier, Kollegin hier zur rechten, die hat auf jeden Fall schon mehr Erfahrung da und mit der arbeite ich an dem Projekt. Wäre ganz gut, wenn ich da ein bisschen aufhole. Das heißt, das motiviert zur Weiterentwicklung. Und was man auch weiß ist, vor allen Dingen bei Führungskräften, die so ein bisschen an Impostor leiden, dass die feinfühliger sind im Umgang mit ihren Teammitgliedern. Vermutlich, weil sie unterstellen, dass es auch denen oft so geht, dass sie nicht genau wissen, ob sie jetzt wirklich geeignet sind für ihren Job. Und deswegen also sagen wir mal, sozial kompetenter umgehen mit den Menschen um sie herum. Das heißt, ja, ein bisschen Impostor ist gar nicht schlecht, nur zu viel darf es nicht sein. Nicht so, dass es blockiert, als würdest.",
      "start": 2559698,
      "end": 2612258,
      "confidence": 0.9201440243902437,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du selbst Podcasts machen. Hast du die Überleitung zum nächsten Thema mit dem Wort Führungskräfte eingeleitet? Vielen Dank dafür. Thema Führungskräfte. Ich hatte im Intro auch schon ein bisschen das Peter Prinzip angesprochen. Das wird zumindest in meiner Bubble nicht so inflationär wie das Impostor Syndrom benutzt, aber immer mal wieder gehört. Wie würdest du das, wie würdest du den ersten Paragraphen vom Wikipedia Artikel des Peter Prinzips definieren, wenn du den schreiben müsstest?",
      "start": 2612274,
      "end": 2638814,
      "confidence": 0.9009140540540539,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Oh, okay. Peter Prinzip, also aus der wissenschaftlichen Brille gesehen, noch mal eine Stufe unter Dunning Kruger. Das heißt, das Peter Prinzip ist eine these, die hat einen Universitätsprofessor mal aufgestellt, der ist, glaube ich, auch US Amerikaner oder halb kanadisch. Und das ist eine sehr verfängliche Idee, die besagt, dass jeder Mensch im Arbeitskontext bis zum Level seiner Unfähigkeit befördert wird. Das heißt, man steigt in Organisationen, in Firmen so lange auf nach oben in der Hierarchie, bis man irgendwo landet, wo man eigentlich ungeeignet ist oder unfähig und dann geht es nicht mehr weiter. Das ist die Grundidee vom Peter Prinzip. Und das bedeutet, dass man sehr viele Arbeitsplätze hat in Unternehmen, wo Fehler passieren, weil die Menschen, die das eigentlich steuern sollen, was da gemacht wird, das gar nicht können, was sie machen sollen. Das ist die Grundidee von Peter Prinzip.",
      "start": 2638902,
      "end": 2694210,
      "confidence": 0.9241693750000002,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt hast du gesagt, das ist eine Theorie. Kannst du die nachvollziehen selber? Du arbeitest ja auch im Journalismus, kennst viele C Levels, viele Firmen.",
      "start": 2694290,
      "end": 2702470,
      "confidence": 0.9122120000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich kann die total nachvollziehen. Es gibt mit Sicherheit auch Fälle, wo das genauso ist. Das glaube ich schon. Ich finde, das Peter Prinzip ist für mich immer so ein bisschen wie so ein Warnschild, was man so irgendwo hinhängt, nämlich sowohl für Menschen in ihrer eigenen Karriereplanung als auch für Menschen, die andere einstellen und befördern, nämlich Recruiter und Führungskräfte, darauf zu achten, worauf es eigentlich ankommt bei einer Beförderung. Also warum befördere ich diesen Menschen auf genau diese Position oder aus der Sicht des Mitarbeitenden, warum genau möchte ich eigentlich befördert werden in diesem Positionen? Ein Beispiel, was das schön illustriert beim Peter Prinzip ist jemand, der an Autos schraubt in der Werkstatt und der irgendwie ein totaler Tüftler ist und jedes Problem da lösen kann. Alle Kunden kommen zurück, sagen also wenn hier Herr Meier an meinem Auto ist, das ist super, danach läuft alles. Dieser Mensch hat eine sehr hohe Kompetenz auf seiner Position. Wenn er aufgrund dieses sehr positiven Feedbacks irgendwann befördert wird zum Werkstattleiter, dann kann es Probleme geben, weil Herr Meier, der ja so ein Tüftler ist, gerne weiter tüfteln möchte und eigentlich nicht so richtig Lust hat auf Adminaufgaben, auf Dienstpläne einteilen, darauf zu gucken, ist hier eigentlich jemand Burnout gefährdet z.B. oder wie förde ich Mitarbeiter? Das heißt, das sind völlig andere Anforderungen, die an die Position des Werkstattleiters gestellt werden, als an die des Tüftlers in der Werkstatt. Und da zeigt sich ganz schön, finde ich, was das die Schwierigkeit ist bei Beförderung. Und darauf will das Peter Prinzip im Grunde hinweisen.",
      "start": 2702890,
      "end": 2801816,
      "confidence": 0.9214411832061069,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt haben wir in der Tech Bubble ist es ja auch ein ganz bekanntes Problem, dass irgendwelche Leute, die coden wollen und dann eigentlich aufsteigen. Und früher war es noch schlimmer, da hat es nur den Karriereweg gegeben. Wenn du befördert werden willst und mehr Geld verdienen willst, dann musst du ein Lead werden und ist aber eine komplett andere Position. Du musst plötzlich Menschen anleiten und führen und ganz viele organisatorische Tätigkeiten und eigentlich wirst du nur coden und eigentlich willst du nur programmieren. Also das hat man in der Tech Bubble ja auch so ein bisschen erkannt. Und jetzt gibt es den parallelen Karriereweg auch für technische Leute, die eben keine Personalverantwortung wollen und da dementsprechend dann in Senior Staff Level also weiter steigen können in Gehalt und Verantwortung, ohne Personen führen zu können. Jetzt gibt es da dann überhaupt eine einen sinnvollen Ausweg oder ist es inhärent immer da? Weil es gibt ja die wenigsten Leute, die jetzt wirklich führen und Management gelernt haben. Und du willst ja vielleicht nicht nur diese Leute haben, aber du musst ja irgendwie die Transformation machen von von diesen Personen. Also müssen wir es einfach akzeptieren. Gibt es eine Lösung oder ist das Beta Prinzip einfach da und wir müssen damit leben?",
      "start": 2801888,
      "end": 2872848,
      "confidence": 0.9144339336492893,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich hoffe nicht. Also was man natürlich immer gut machen kann, ist antesten. Das haben ja auch ganz viele Firmen sowieso schon integriert in ihren Hierarchien, dass es eine Stellvertreterfunktion gibt. Das heißt, wenn ich das testen möchte, ob mein Mitarbeiter oder meine Mitarbeiterin geeignet wäre für diese Leadposition, dann kann ich das testen. Ich bin ja irgendwann mal im Urlaub, ich bin auch mal krank und testweise kann dann diese Person das probieren und übernehmen. Und ich finde, da zeigt sich immer relativ schnell, ob das jemandem liegt oder nicht. Also eine Grundvoraussetzung ist, wenn man fühlen will, muss man Menschen mögen und zwar wirklich mögen, weil man muss sich sehr vielen Menschen und sehr vielen Problemen beschäftigen. Das heißt, wer das verneinen kann, da ist schon mal, glaube ich, eine andere Laufbahn sinnvoller. Aber dieses Antesten finde ich tatsächlich für beide Seiten extrem sinnvoll und wichtig. Noch mal anders ist es, wenn man im Recruiting ist und eine Führungsposition von außen besetzt. Also nicht immer kann man ja intern nachbesetzen. Klar, das ist schwieriger und da finde ich auch in Deutschland sind wir noch nicht so wahnsinnig gut, gut zu screenen. Da sind auch auch jetzt muss ich wieder die Amerikaner nehmen, aber weil ich die Kultur da ganz gut kenne, auch weiter. Also die sind beim bei den Einstellungsprozessen viel rigoroser, wenn es um Führungspositionen geht und gerade um höhere Management Positionen und screenen da sehr, sehr genau, wie viel Erfahrung hat jemand? Was sagen die früheren Teammitglieder dieses Menschen? Also auch das kann man ganz gut testen, finde ich.",
      "start": 2872984,
      "end": 2963374,
      "confidence": 0.926247946768061,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Würdest du jetzt sagen, dass das beta Prinzip eher ein Problem ist von der Firma selbst, dass die Leute hochgepusht werden oder kann es auch von der Person selbst kommen im Sinne von Dunning kruger Effekt? Ich glaube, ich kann das und überschätze mich selber. Also woher kommt da eher der Druck?",
      "start": 2963542,
      "end": 2983040,
      "confidence": 0.9042846153846156,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das muss ich jetzt ein bisschen subjektiv aus meiner Arbeitserfahrung beantworten, nachdem das Beta.",
      "start": 2984220,
      "end": 2989652,
      "confidence": 0.90231,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Prinzip ja nicht gut erforscht ist.",
      "start": 2989676,
      "end": 2991360,
      "confidence": 0.9146816666666666,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Passt das perfekt? Passt das perfekt? Ich also nach meiner Erfahrung kam es bisher eher von den Mitarbeitenden selbst. Ich glaube auch noch aus diesem alten Verständnis raus, gibt es überhaupt andere Wege, um z.B. mehr Geld zu verdienen oder was anderes zu machen? Da ist natürlich das Unternehmen schon in der Pflicht. Hängt auch ein bisschen von der Größe ab. Geht ja nicht immer was anderes anzubieten oder die Mitarbeitenden mitzunehmen und zu schauen, wie können wir dich fördern, challengen, was auch immer. Aber oft kommt der Druck tatsächlich direkt aus dem von den Teammitgliedern selbst, die manche wollen es nur probieren, manche haben auf jeden Fall ein bisschen Effekt und denken das kann ich auch. Also so und ganz oft ist ja ein Missverständnis, dass man denkt, also hier meine Chefin, mein Chef, der hat überhaupt keine Ahnung, um bei der Werkstatt zu bleiben, der überhaupt keine Ahnung, wie man Problem XY löst. Warum genau ist er oder sie jetzt teamlied? Also das Missverständnis auf verschiedenen Ebenen, dass eben das operative können auf der Führungsebene nicht das Wichtigste ist. Also wirklich nicht. Ich finde, da fehlt auch manchmal noch so ein bisschen Wissen. Und das können auch Führungskräfte noch ganz gut herstellen, je nachdem, wie seniorisch oder juniorisch auch ihr Team ist.",
      "start": 2991740,
      "end": 3063758,
      "confidence": 0.9271682710280373,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, das kenne ich eigentlich auch aus meiner Erfahrung, aus meiner Bubble. Was ist so beim Einstellungsprozess sind so, dass man einfach die herausfindet, was die Motivation von dieser Person ist, eigentlich in das Leadership überzugehen. Weil ganz, ganz oft, und das ist glaube ich das größte Problem, wenn die Motivation darin liegt, wenn ich Chef oder Chefin bin, dann brauche ich nicht mehr diskutieren. Und dann kann ich nämlich sagen, was wir machen sollen. Weil bisher hatte ich da immer die Diskussion und ich habe immer den kürzeren gezogen und irgendwer anderer hat entschieden oder so. Wahrscheinlich auch in hierarchischen Umgebungen. Und wenn das die Hauptmotivation ist, ist meiner Meinung nach zumindest die schlechteste Motivation, Motivation in die Führung zu gehen.",
      "start": 3063934,
      "end": 3105612,
      "confidence": 0.9187410655737711,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, definitiv, stimme ich zu.",
      "start": 3105716,
      "end": 3108364,
      "confidence": 0.8908439999999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Gibt es aber leider trotzdem immer noch sehr oft und ich erlebe das auch aktuell bei ganz vielen Firmen und dass das immer noch ein großer Faktor leider ist.",
      "start": 3108532,
      "end": 3117348,
      "confidence": 0.9279779310344827,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Richtig. Ja, wie gesagt, ich finde, da können aber auch Führungskräfte einen sehr guten Job machen, indem sie selbst erklären, was eigentlich ihre Aufgabe ist. Ich finde, das machen viele gar nicht so gut. Also dass ihre Teammitglieder auch verstehen, was ist eigentlich genau hier mein Job oder meine Aufgabe. Manchmal hat man es dann über diese 360 Grad Feedbacks und dann finde ich das oft so ein aha Moment, wenn die Teammitglieder zum ersten Mal sehen, woran genau wird eigentlich meine Führungskraft bemessen. Und das ist dann eben nicht, ob er oder sie das Bauteil XY richtig einbauen kann oder einen Fehler findet, sondern ganz andere Dinge, nämlich sowas wie eine Richtung vorgeben, klare Erwartungen, Feedbacks geben. Genau, das sind eben völlig andere Maßstäbe. Und ich glaube auch das zu kommunizieren hilft dem Team besser zu verstehen, was genau wäre denn dann meine Aufgabe, wenn ich diesen Weg gehen möchte.",
      "start": 3117444,
      "end": 3168544,
      "confidence": 0.9204694701986753,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Oft muss man ja auch sagen, nur weil ich außerhalb des Teams eine Aufgabe an meine Vorgesetzte bringe, heißt das ja auch nicht, dass die Vorgesetzte diese Aufgabe gerade als super wichtig ansieht oder ähnliches. Da die Person natürlich in der Regel viel mehr Kontext hat, viel mehr mitbekommt, was geht oben drüber ab, seitwärts und so weiter. Und deswegen finde ich den Punkt, den du angesprochen hast, unglaublich wichtig, dass in der Regel halt Kontext und Informationen fehlen. Wenn ich über das Peter Prinzip nachdenke oder zumindest über die these des Petersprinzip, dann frage ich mich natürlich auch, wann sollten denn Personen überhaupt befördert werden? Denn dann, wenn diese Person diese Stelle schon mal gemacht hat und bewiesen hat, er oder sie kann das. Oder wenn jemand Potenzial zeigt, diese Rolle auszufüllen. Und natürlich hat das beides dann irgendwie ein bisschen das Risiko, dass das Peter Prinzip wohlmöglich eintrifft. Aber auf der anderen Seite möchte man Personen ja auch eine Chance zur Karriere geben und vielleicht sogar was Neues auszuprobieren oder vielleicht sogar einen Quereinstieg zu machen, oder?",
      "start": 3168712,
      "end": 3232742,
      "confidence": 0.9114077653631286,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, absolut. Deswegen finde ich eben dieses Prinzip des Antestens so wichtig. Es ist ja auch so, dass man die Position nicht unbedingt mit jemandem besetzen kann, der das in der Vergangenheit gut gemacht hat. Es gibt ja auch wirtschaftliche Bedingungen. Also in einem in einem Umfeld, was wirtschaftlich sicher ist, wo ganz viel Raum da wäre, um neue Märkte zu erschließen, visionär zu sein, neue Ideen zu pitchen. Da brauche ich natürlich einen anderen Typ Mensch als Führungskraft, als in einem Umfeld, wo es wirtschaftlich eng ist und wo man gerade so seine Ziele erreicht und wo man jemanden braucht, der extrem nachhält und extrem dran ist am Team und so ein bisschen mehr micromanaged vielleicht als Typ eins, den wir davor hatten. Also es kommt ja auch darauf an, was will ich mit dieser Position? Und das ist ja nicht ein Typ Mensch, der diese Position zu jeder Zeit in jedem Unternehmen ausführen kann, auch wenn er oder sie das vorher schon mal gemacht hat. Insofern finde ich ganz wichtig, aufs Potenzial zu gucken.",
      "start": 3232846,
      "end": 3289436,
      "confidence": 0.9463979545454546,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube, es ist teilweise, was ich zumindestens schon sehr oft erlebt habe, sogar umgekehrt, dass da eher das Impostor Syndrom wieder reinschlägt. Du hast jemanden in deinem Team, wo du denkst, er könnte ein guter Lead sein, der könnte jetzt die Rolle übernehmen, der könnte die Firma weiterentwickeln, dieses Team, den Markt erschließen, was auch immer. Und diese Person glaubt aber das schaffe ich doch nicht und kann ich das überhaupt? Und da ist es glaube ich dann auch extrem wichtig, diese Probephase, wie du angesprochen hast, dass man da einfach halbes Jahr, ein Jahr alle Tätigkeiten mal mitbekommt, um überhaupt so ein Gefühl zu bekommen, was das dann schlussendlich heißt. Und dann kann man immer noch entscheiden, ist es etwas für mich, ist dieses Leadership, diese was es auch immer ist, Management, andere Position, ist es etwas für mich oder nicht. Also ich glaube, das Antesten ist super wichtig und wir hatten auch einige Episoden im Engineering Kiosk schon dazu, dass es auch völlig okay ist, wieder zurückzuwechseln, wenn man gemerkt hat, okay, das Leadership ist nichts für einen und man wechselt zurück in Individual Contributor Rolle, dass das absolut okay ist und ich glaube, in der Tech Bubble zumindest sehr anerkannt ist.",
      "start": 3289588,
      "end": 3353444,
      "confidence": 0.9223359512195124,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Total. Und ja, auch oft eine Frage der z.B. lebensphase, habe ich gerade gedacht. Es gibt ja auch Phasen im Leben, wo man auch da Lust hat, was auszuprobieren, Risiken einzugehen, wo man wenig zu verlieren hat, wo man ortsflexibel ist. Und es gibt Phasen, wo das vielleicht nicht so ist. Deswegen finde ich es schön und wichtig, dass sich dieses ja klassische da wo das Peter Prinzip eingebettet ist, aufsteigen nur nach oben in der Hierarchie, dass sich das zumindest so langsam auflöst.",
      "start": 3353532,
      "end": 3379888,
      "confidence": 0.9137013095238099,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie kann ich denn selbst erkennen, ob ich der Peter bin oder ein Impostor ist?",
      "start": 3380024,
      "end": 3386048,
      "confidence": 0.9285413333333334,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist eine gute Frage, ob du der Peter bist.",
      "start": 3386224,
      "end": 3392136,
      "confidence": 0.936421,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Naja, also es kann ja auch sein, dass ich z.B. sogar vom Dunning kruger Effekt habe und sage, hey, natürlich kann ich das aber. Und jeder andere sagt nur, der ist ja völlig untätig da oben, ist ja völlig out of range. Also da frage ich mich schon, wie kann ich denn den Selbsttest machen, ob ich der Peter bin?",
      "start": 3392288,
      "end": 3409700,
      "confidence": 0.8921416666666666,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, also wenn es ein Feedback gibt in dem Unternehmen, was ja immer sehr ratsam ist, dann steht das da hoffentlich drin und wird auch gut durchgesprochen, weil da sollte sich das zeigen. Also wenn du auf einer Position bist und dein Feedback vielleicht okay, ein Jahr kann es mal nicht so toll ausfallen, man lernt ja auch und so weiter. Aber wenn das zwei oder drei Jahre in Folge nicht gut ausfällt und man dir auch nichts weiteres anbietet, dann könntest du ein Peter sein.",
      "start": 3409780,
      "end": 3436950,
      "confidence": 0.9463705813953486,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich möchte mich gleich mal stellvertretend bei allen Petern da draußen entschuldigen. Dieses Name Shaming, das ist ja schrecklich. Warum das auch immer Peter heißt. Weißt du das zufällig?",
      "start": 3437490,
      "end": 3448870,
      "confidence": 0.9168206896551725,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Oh, ich habe es mal gelesen. Ich müsste das jetzt noch mal nachgucken, aber es gab einen Grund dafür. Ich glaube, hieß nicht sogar der Mensch, der das entdeckt hat, Moment, dann wäre.",
      "start": 3449410,
      "end": 3456864,
      "confidence": 0.9000421212121215,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es ja weniger nebenschäm, wenn das der Name wäre.",
      "start": 3456872,
      "end": 3459872,
      "confidence": 0.8752222222222223,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich meine ja, das liefern wir nach. Habt ihr Show Notes? Wir packen es in die Show.",
      "start": 3459976,
      "end": 3463704,
      "confidence": 0.9768529411764706,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Natürlich, natürlich haben wir.",
      "start": 3463752,
      "end": 3464872,
      "confidence": 0.9091375,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Machen wir.",
      "start": 3464896,
      "end": 3465700,
      "confidence": 0.96899,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Sehr gut.",
      "start": 3466080,
      "end": 3467020,
      "confidence": 0.970615,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ich meine, das ganze Thema jetzt mal unabhängig vom Impostor Syndrom, vom Burning kruger Effekt oder vom Peter Prinzip mit, ich sag mal, psychischer Gesundheit und allgemeiner Zufriedenheit ist ja glaube ich sowieso ein, wie soll man sagen, ich untertreibe jetzt enorm komplexes Thema. Ab wann ist man zufrieden? Wir sind auch schon so ein bisschen in den Punkt von sollte man sich vergleichen eingedrungen. Und ich bin mir nicht ganz sicher, aber ich glaube Instagram, TikTok und Co fördern das jetzt nicht wirklich. Oder wie siehst du das aus seiner professionellen Sichtweise?",
      "start": 3468600,
      "end": 3500890,
      "confidence": 0.9048300000000002,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Social media, klar, Social Media ist eine Vergleichsmaschine. Absolut. Auch da weiß man aus der Forschung, je weniger man es nutzt, desto besser. Und zwar je anfälliger man ist für so Impostor Gedanken oder so ein bisschen ins depressive gehende Gedanken, umso mehr Social Media ist nicht so gut für die psychische Gesundheit. Leider. Kann man kurz so zusammenfassen.",
      "start": 3501050,
      "end": 3522838,
      "confidence": 0.9313174576271185,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die Hastel culture wahrscheinlich auch nicht unbedingt förderlich, wenn man immer Vollgas geben sollte und immer out of the comfortzone gedrückt wird. Aber auch die, würde ich mal sagen, wird ja weniger aktuell und wird auch weniger geschätzt bei der Jugend, die nachkommt, ist zumindest mal mein Eindruck Chen. Sie ist da ja doch etwas anders unterwegs.",
      "start": 3523014,
      "end": 3546840,
      "confidence": 0.9080221052631579,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, zumindest glaube ich, gibt es ist, sagen wir mal so, ist unsere ja sehr wohl Leistungsgesellschaft. Da kann man glaube ich nicht widersprechen, aber unsere Leistungsgesellschaft ist zumindest so unterteilt und es sind so viele Dinge möglich, dass sich jeder da seine Ecke suchen kann. Also der öffentliche Dienst z.B. es gibt ja immer diese Rankings der beliebtesten Arbeitgeber, da ist der öffentliche Dienst in den letzten Jahren immer ziemlich weit oben gelandet. Und ich glaube eben genau aus diesem Grund, dass Menschen, die da keine Lust drauf haben oder deren Persönlichkeit tatsächlich auch nicht dafür gemacht ist, ständig zu wachsen, muss auch überhaupt nicht, dass die einen Ort haben in dieser Kulturgesellschaft, wo es ihnen aber sehr wohl gut gehen kann, weil dann noch was anderes wichtig ist.",
      "start": 3547380,
      "end": 3591368,
      "confidence": 0.9394379999999997,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, dann vielen, vielen lieben Dank für die ganzen Einblicke und die tiefen Einblicke vor allem. Hast du noch irgendetwas für unsere Hörerschaft? Irgendwer, der sich im Imposter Syndrom gerade befindet oder alle Beta Betas da draußen? Ist Beta die Mehrzahl? Keine Ahnung.",
      "start": 3591544,
      "end": 3608580,
      "confidence": 0.9058718604651166,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich würde schon gerne diesen einen Satz mitgeben. Habt Mut, nicht jeden eurer Gedanken einfach so zu glauben. Finde ich einen ganz, ganz wichtigen Satz eigentlich für das gesamte Leben. Hilft bei Impostor, hilft aber auch bei vielen, vielen anderen Dingen. Nicht jeder Gedanke, den ihr habt, einfach.",
      "start": 3611440,
      "end": 3628206,
      "confidence": 0.9326673469387756,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "So glauben und auch nicht alles, was im Internet steht.",
      "start": 3628238,
      "end": 3630598,
      "confidence": 0.942607,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Auch das nicht.",
      "start": 3630694,
      "end": 3631730,
      "confidence": 0.9483099999999999,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also Selbstreflexion und Reflektion ist sehr schöner Abschluss.",
      "start": 3633390,
      "end": 3637570,
      "confidence": 0.7395387500000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Vielen lieben Dank, dass du meiner e Mail Einladung gefolgt bist. Mir hast du auf jeden Fall sehr viel Mythen. Wie sagt man das? Endmythek? Ich weiß es nicht. Ich habe jetzt auf jeden Fall das Gefühl, ich verstehe das Impostor Syndrom deutlich besser. Ich hoffe, ich werde das nicht mehr so inflationär benutzen, wie ich es vorher getan habe. Vielen lieben Dank für die ganzen Einblicke. Und für alle, die noch mehr von Funny hören möchten, wir verlinken ihren Podcast Nevermind Psychologie in 15 Minuten auch in den Show Notes.",
      "start": 3638990,
      "end": 3669624,
      "confidence": 0.9223774725274724,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und ich bin auch schon großer Fan. Ich habe für die Vorbereitung einige Episoden gehört und höre noch weiter. Also super Podcast, definitiv zu empfehlen.",
      "start": 3669712,
      "end": 3678760,
      "confidence": 0.8705548000000001,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und natürlich ist die Hörempfehlung natürlich auch auf die weiteren Business Insider Podcast. Die verlinken wir auch alle in den Shownotes. Fanny, vielen lieben Dank, dass du da warst. Und ja, ich wünsche dir noch einen schönen Tag. Tschüss.",
      "start": 3679100,
      "end": 3692412,
      "confidence": 0.8902897435897434,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Sehr gerne. Danke euch auch. Tschüss.",
      "start": 3692556,
      "end": 3694540,
      "confidence": 0.8346666666666667,
      "speaker": "C",
      "channel": null
    }
  ],
  "confidence": 0.921018736263739,
  "audio_duration": 3625,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}