{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/84908405-bd61-4398-bdf3-134fddb59c3e/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62bepb0duz-17b6-43b5-922b-690d426d95e1",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen zu einer neuen Episode des Engineering Kiosks. Produktiver zu werden wünscht sich vermutlich so ziemlich jeder, auch wir. Und darum sprechen wir heute über unser Zeitmanagement. Warum Andy sogar durch sein Zeitmanagement befördert wurde, wie Zeitmanagement helfen kann, mehr Vertrauen aufzubauen, wie man seine Produktivität erhöhen kann, aber auch wie die Methoden wie Getting Things Done oder Inbox Zero Produktivität bremsen können. Und natürlich unsere Tipps, was wir so aus den letzten Jahrzehnten Zeitmanagement für uns mitgenommen hat.",
      "start": 1893,
      "end": 29286,
      "confidence": 0.8083924050632909,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich finde es immer wieder schön, dich hier im Videostream zu sehen, wenn wir eine neue Episode vom Engineering-Kiosk aufnehmen. Hallo Wolfgang.",
      "start": 33108,
      "end": 40050,
      "confidence": 0.5715,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hallo. Gehen wir weg von der Romantik. Zurück in das Thema, bitte.",
      "start": 40070,
      "end": 43892,
      "confidence": 0.6915,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Zurück in das Thema, wie du möchtest. Wie lange hast du für deinen Doktortitel gebraucht?",
      "start": 43912,
      "end": 48113,
      "confidence": 0.676,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das war schon eine längere Zeit. Knappe zehn Jahre oder es waren, glaube ich, ziemlich genau zehn Jahre. Seit dem Master, also zwischen Master und Doktor ungefähr zehn Jahre.",
      "start": 48173,
      "end": 58977,
      "confidence": 0.8484999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Gibt es da den einen Grund, warum du zehn Jahre gebraucht hast? Oder wolltest du, hast du dir gedacht, im achten Jahr kommen die zehn, nehmen wir ja noch voll.",
      "start": 58997,
      "end": 66037,
      "confidence": 0.6209,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, damit das eine runde Zahl ist, schaut gleich viel besser aus. Und ich war immer ein Profi im Prokrastinieren. Wie heißt das auf Deutsch? Prokrastinieren?",
      "start": 66077,
      "end": 74683,
      "confidence": 0.7295384615384616,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Prokrastinieren, ja.",
      "start": 74944,
      "end": 76345,
      "confidence": 0.473,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Prokrastinieren, also ich war immer der Profi im Prokrastinieren. Weil einfach immer alle anderen Themen viel interessanter waren und irgendwelche anderen Projekte oder Forschungsthemen auch super interessant waren und dann ist mir auch Trivago dazwischen gekommen. Es hat dann doch auch einige Zeit gekostet, muss man dazu sagen. Also ich habe dann schlussendlich einen Doktor gemacht, während ich bei Trivago gearbeitet habe.",
      "start": 76365,
      "end": 96783,
      "confidence": 0.7710483870967743,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Denkst du, ordentliches Zeit- und Produktivitätsmanagement hätte die ganze Sache ein bisschen beschleunigt?",
      "start": 97213,
      "end": 102755,
      "confidence": 0.8143076923076922,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf jeden Fall Priorisierung hätte das Ganze beschleunigt, ja. Also ich weiß gar nicht, ob ich so schlecht im Zeitmanagement bin, aber in der Priorisierung, das war auf jeden Fall ein Problem. Und darum habe ich auch später dann einen Artikel geschrieben, einen Blogpost zu meinem Zeitmanagement, wie ich das mache und was man auch besser machen kann, was ich aus diesen zehn Jahren Doktor prokrastinieren gelernt habe, habe ich dann auch in diesem Blogpost beschrieben. Und Funfact am Rande, weil wir auch in der letzten Episode über Netlify gesprochen haben und Hacker News, das Blogpost, steil gehen können. Der Blogpost ist auf jeden Fall steil gegangen für meine Verhältnisse. Der war irgendwie auf Hacker News dann auf der Frontpage, glaube ich, kurze Zeit. Und ich hatte über 30.000 Views bekommen auf diesen Blogpost. Aber ich habe nichts Netlify bezahlen müssen, bin trotzdem durch meinen hochperformanten Blog mit dem Limit ausgekommen. Man sieht ja schon, mit Netlify auch bei Blogs, die sehr gut besucht sind, ist das kein Problem. Aber um aus dem zurückzukommen, was du hier ausgesucht hast, warum glaubst du, dass das wichtig ist, abgesehen davon, dass du mich kennst und dass es mir bei meinem Doktor geholfen hätte?",
      "start": 102795,
      "end": 170362,
      "confidence": 0.7558457711442785,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also META, wie das Thema Zeitmanagement und Produktivitätsmanagement und Priorisierung auch klingt, denke ich, das ist eine essentielle Grundlage, die jeder beherrschen sollte. Jeder sollte sein eigenes Zeitmanagementsystem haben oder seine eigene Philosophie, wie man Produktivität definiert und wie man aufgaben von wie man wichtige aufgaben von unwichtigen trennt nicht nur fürs private leben sondern auch für für den job weil ich denke wir alle werden sei es im privaten oder im job mit aufgaben zu gebombt und man hat immer nur so viel dinge zu tun, dass man mit ein bisschen Organisation um das ganze Thema schon einen ordentlichen Impact haben kann und auch wirklich Fortschritt machen kann. Und ich denke auch, dass zum Beispiel mir persönlich die ganze Sache auch bei Gehaltserhöhungen geholfen hat. Dass mir mehr Verantwortung übertragen wurde, weil ich durch ein einfaches System, denke ich, bewiesen habe, dass ich Sachen nicht vergesse, dass ich mich um Themen kümmere.",
      "start": 170708,
      "end": 230108,
      "confidence": 0.8502091503267971,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man merkt schon wieder, dass du eigentlich den Karriere-Podcast machen willst. Es geht schon wieder um Gehaltserhöhungen.",
      "start": 230148,
      "end": 234190,
      "confidence": 0.5025294117647059,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich will jetzt gar nicht so auf den Karriere-Podcast und auf den Karriere-Track drauf. Ich wollte nur einmal kurz darlegen, was die ganze Sache denn für einen möglichen Impact haben kann. Aber meine eigentliche Motivation ist, ich hasse es, wenn Leute sagen, ich kümmere mich drum und die dann später sagen, oh, habe ich vergessen. Weil ich denke, mit einem einfachen System vergisst man einfach nichts, sich reminder zu stellen oder ähnliches. Das hasse ich, wenn ich da konstant nachhaken muss und Leute, die sagen, ich kümmere mich drum, aber sie tun es nicht. Das bringt mich auf die Palme. Und deswegen denke ich, das ist meine Motivation. Wenn ihr was sagt, das ihr macht, kümmert euch drum oder sagt mir, ihr kümmert euch aktiv nicht mehr drum. Aber lasst es nicht im Sande verlaufen.",
      "start": 234270,
      "end": 275905,
      "confidence": 0.8075111111111114,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn ihr jetzt das Video sehen könntet von Andi, der gesamte Schreibtisch inklusive Kamera hat einfach gewackelt, weil er so emotional geworden ist. Sehr schön anzusehen. Aber du hast natürlich vollkommen recht, auch in dem Business-Umfeld ist mir das eigentlich sehr oft begegnet. Gerade in 101s haben eigentlich Leute sehr oft nachgefragt, wie sie eigentlich ihr Zeitmanagement verbessern können. By the way, wer jetzt fragt, was sind 101s, wir haben da eine eigene Episode dazu, ist die Episode 10, verlinken wir natürlich gerne. Hört mal rein, was 101s sind und wie man diese verbessern kann. Und in diesen 101s haben wir eigentlich sehr oft eben über dieses Zeitmanagement gesprochen. Und da habe ich eigentlich auch gemerkt, wie einfach es ist mit ein paar kleinen Tricks und ein paar Überlegungen, dass man sich das einfach ein bisschen genauer anschaut oder Tool verwendet, wie viel man da eigentlich erreichen kann. Also da gebe ich da vollkommen Rechte.",
      "start": 276085,
      "end": 324692,
      "confidence": 0.7627806451612906,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie seid ihr dann auf dieses Thema gekommen? Was war so der Trigger?",
      "start": 325072,
      "end": 328753,
      "confidence": 0.6686923076923077,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, dass die meisten Leute eigentlich einfach zu viel am Teller haben aktuell. Zu viele Tasks, zu viele Projekte, privat vielleicht auch noch Sachen. Und die haben einfach gemerkt, es ist zu viel. Und sie haben halt einfach gefragt, okay, wie kann ich denn da rauskommen aus diesem Teufelskreis? Und wie mache ich das einfach? Oder sie wollten auch einfach teilweise mal wissen, wie mache ich das? Gibt's da Tricks oder kann ich da irgendwo was verbessern? Und es ist gar nicht so kompliziert eigentlich dieses Thema.",
      "start": 328793,
      "end": 354799,
      "confidence": 0.7896091954022988,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was hast du dann auf die Frage geantwortet? Was hast du denen empfohlen?",
      "start": 355199,
      "end": 357762,
      "confidence": 0.45761538461538465,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, also meine ganz klassische Empfehlung war einfach mal Getting Things Done, dieses Buch zu lesen von David Allen.",
      "start": 357802,
      "end": 365209,
      "confidence": 0.8219473684210526,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nur um klarzustellen, Getting Things Done, so heißt die Methode?",
      "start": 365229,
      "end": 368772,
      "confidence": 0.7666999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, es ist keine Anweisung den Mitarbeitern gegenüber gewesen, bringt mal einfach das Zeug zu Ende. Nein, nein, es geht wirklich um eine Methode. Die ist eigentlich auch sehr bekannt, GTD, bei den Österreichern ist T und D immer das gleiche, also bei uns ist es GTD.",
      "start": 368792,
      "end": 385548,
      "confidence": 0.7848723404255323,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hört sich an wie der neue VW Golf GTD, der gleich auf der Rennstrecke irgendwie ein Viertelmeilenrennen fährt oder ähnliches.",
      "start": 385568,
      "end": 392515,
      "confidence": 0.7206500000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist auch ungefähr so alt wie VW, glaube ich, diese Methode. Also im Buch kommen überhaupt keine Computer zum Beispiel vor, finde ich eigentlich sehr spannend. Und finde ich auch super interessant, dass das aber trotzdem noch so super relevant ist und eigentlich eins zu eins ins Digital übertragen werden kann. Also es ist wirklich ja meiner Meinung nach wirklich gutes Buch, das man auch mal lesen kann.",
      "start": 393335,
      "end": 412905,
      "confidence": 0.7729411764705882,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn es darüber ein Buch gibt, dann scheint das ja so ein mega Ding zu sein. Kannst du mir mal einen eine Minute Abriss davon geben, warum das Ding toll ist, warum ich mir das ansehen sollte, also wie das funktioniert?",
      "start": 412925,
      "end": 423352,
      "confidence": 0.5605609756097559,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also im Prinzip ist es überhaupt nicht kompliziert. Es geht natürlich sehr ins Detail und da gibt es noch viele Feinheiten, aber wenn man das so ganz grob sieht, dann geht es eigentlich nur darum, dass man sich einmal alle seine Tasks aufschreibt oder dass man sich bewusst wird, was habe ich denn überhaupt alles zu tun. Das ist, glaube ich, ein wichtiger Punkt. Und dann fängt man an, wenn man diese Tasks sieht oder reinbekommt, zum Beispiel bei Ihrem E-Mail oder es sagt einem jemand was, dann überlegt man sich, kann ich diesen Task innerhalb von zwei Minuten erledigen? Wenn das der Fall ist, dann mache ich das wirklich sofort. Dann beantworte ich schnell dieses E-Mail, wenn das nur ein Ja- oder Nein-Antwort benötigt, zum Beispiel das E-Mail, dann beantworte ich das sofort. Und wenn nicht, dann übertrage ich das in irgendein System, dem ich vertraue, dass es meine Tasks abspeichern kann und mir später wieder zur Verfügung stellt. Das kann jetzt ein digitales System sein, kann aber auch ganz klassisch einfach so ein Notizbuch sein, wo ich meine Tasks reinschreibe. Aber ich weiß, okay, später werde ich diese Tasks wieder auffinden. Das heißt, sie spucken mir jetzt im Kopf nicht mehr herum. Ich habe die später im System drinnen. Digitales System, Notizbuch, was es auch immer ist. Also das ist ein ganz einfaches System. Ich bekomme die Tasks rein und schreibe sie dann irgendwo auf. Das ist einmal ganz wichtig. Was schnell geht, erledige ich sofort. Was dann aber noch dazukommt, ist, dass ich mir diese Tasks immer regelmäßig anschaue, dass ich die Organisation von diesen Tasks mache, dass ich die zusammengruppiere in Projekte zum Beispiel oder dass ich mir eine eigene Seite in meinem Notizbuch Vorbehalte für Supermarkt Shopping und wenn ich irgendwas einkaufen muss, wenn mir das gerade in den Kopf kommt, dann schreibe ich das auf diese Liste. Oder ich schreibe irgendwo was in einen Kalender, weil das am nächsten Tag wichtig ist zum Beispiel. Oder eigene, wenn ich eine eigene Seite pro Tag habe, dann schreibe ich das jeweils auf die Seite von dem Notizbuchkalender, an dem Tag ich das erledigen muss zum Beispiel. Also da fange ich so kopieren, organisieren an und dann weiß ich, dass ich in meinem System, was ich einfach immer bei der Hand habe, weiß ich ganz genau, okay, was muss ich morgen erledigen, was muss ich heute erledigen, was muss ich im Supermarkt erledigen, dass ich das einfach alles in meinem Notizbuch oder in einem digitalen Notizbuch gespeichert habe. Also die Organisation von den Sachen ist dann ganz wichtig. Und damit man das möglichst regelmäßig macht, muss man sich das halt auch dann wöchentlich oder monatlich in einem speziellen Termin, den man sich zurechtlegt, für den man Zeit blockt, dann einfach nochmal genau anschauen. Einfach am Ende der Woche zum Beispiel, was mache ich nächste Woche? Was ist wichtig? Ist noch alles richtig gruppiert? Muss ich vielleicht irgendwo was durchstreichen und auf eine andere Seite schreiben, weil ich das verschieben will? Oder in einem digitalen Produkt geht das natürlich direkt. Aber dass ich mir also wirklich regelmäßig so einen Review-Termin vornehme, in dem ich wirklich meine Tasks alle durchgehe und überlege, was ich denn machen will. Man kann es sogar dann jährlich machen mit seinen jährlichen Zielen zum Beispiel oder seinen Lebenszielen, wenn man das will. Also wöchentlich, monatlich, jährlich zum Beispiel. Da gibt es viele Möglichkeiten.",
      "start": 423532,
      "end": 608113,
      "confidence": 0.7993567662565906,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast jetzt so viele Regeln aufgezählt, das hört sich gerade an, als musst du dir ein Regelwerk bauen, um dein Regelwerk, was dir bei der Produktivität und beim Zeitmanagement helfen soll, zu maintainen.",
      "start": 608253,
      "end": 616799,
      "confidence": 0.7264705882352943,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es sind natürlich schon gewisse Regeln und das ist glaube ich ganz wichtig, dass man die halt einfach in den Alltag übernimmt, es sind jetzt keine komplizierten Regeln, dass sie einfach zum Beispiel, einmal am Tag mir meine Tasks durchschau und check, muss ich da irgendwas umändern, umpriorisieren oder so und alles was reinkommt, schreibe ich halt irgendwo auf. Also es sind jetzt nicht super komplizierte Regeln, aber ich muss mir die natürlich möglichst in meinen Alltag integrieren, dass die einfach automatisch passieren, dass das eben nicht irgendwas ist, wo ich ständig nachlesen muss, was muss ich jetzt machen, sondern dass ich halt da einfach meine Routine habe und das einfach automatisch funktioniert.",
      "start": 616839,
      "end": 649455,
      "confidence": 0.770115044247788,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was würdest du sagen, wie viel Zeit geht da so drauf für das tägliche Maintainen dieses Systems?",
      "start": 649495,
      "end": 654777,
      "confidence": 0.7242352941176471,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ganz konkret für das Review, für das tägliche Review, ich mache das meistens eigentlich am Abend, dass ich mir einfach so festlege, okay, was für Tasks stehen morgen an, was könnte ich machen. Das dauert üblicherweise 10 Minuten oder so oder 15 Minuten vielleicht, wenn Wenn ich überhaupt und dann vielleicht so regelmäßigere, größere Reviews in dann schon 30 Minuten, wenn ich jetzt in ein Projekt reingehe zum Beispiel und mir überlege, was sind die nächsten Schritte oder was mache ich, was für Projekte stehen aktuell an. Also sowas eher, was zweiwöchentlich ist oder wöchentlich oder teilweise sogar monatlich, das ist dann eher so im 30-Minuten-Bereich. Aber es ist jetzt nicht extrem viel Zeit, die man damit verbringt.",
      "start": 655135,
      "end": 693336,
      "confidence": 0.782672268907563,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Muss man alle regeln befolgen die du gerade genannt hast oder kann ich mir auch die ein oder andere da rauspicken.",
      "start": 693816,
      "end": 698959,
      "confidence": 0.8316666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja was heißt können und dürfen dürfen darf man alles und ich glaube das ist eigentlich das ziemlich wichtige an solchen zeitmanagement systemen man soll sie halt verstehen warum die einzelnen schritte gemacht werden und dann sich das einfach rauspicken was halt das beste ist also ich habe jetzt sicher auch nicht alle regeln von getting things done erwähnt, Da gibt es noch wesentlich mehrere und da kann man auch überall tiefer gehen natürlich noch. Aber das sind einmal so grundsätzliche Regeln, die ich auch sehr gern verwende und anwende und die mir auch sehr viel gebracht haben, einfach in meiner Organisation und in meinem Zeitmanagement.",
      "start": 699300,
      "end": 734391,
      "confidence": 0.8321132075471694,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du feierst das jetzt total. Was sind denn die negativen Punkte dazu? Hast du auch so ein bisschen Kritik an dem System? Also du verkaufst jetzt gerade so das Allerweltslösung. Wir sollten das alle machen, weil das hilft jedem.",
      "start": 734831,
      "end": 745394,
      "confidence": 0.6957692307692308,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich habe keinen direkten Kritikpunkt gegenüber Getting Things Done. Der einzige Kritikpunkt ist vielleicht, dass es keine Rocket Science ist und die Frage ist, ob man das Getting Things Done nennen muss oder vielleicht einfach einfaches System zur Taskverwaltung, weil viel mehr ist es wirklich nicht. Aber es sind halt so gewisse Sachen, die man sich einfach mal vor Augen führen muss. Und ich glaube, jeder, der sich länger mit dem Thema beschäftigt, wird vielleicht auf einen ähnlichen Ansatz kommen. Insofern sehe ich da jetzt auch keine großen Probleme. Und für mich hat das einfach extrem gut funktioniert. Und ich glaube, für viele andere auch. Also darum empfehle ich das einfach, weil es ein super einfacher Einstieg ist, nicht viel braucht, keine Tools oder sowas braucht und man da einfach mal einsteigen kann und probieren kann, sich ein bisschen zu verbessern. Wie siehst du das ganze? Hast du negative Punkte bezüglich getting things done?",
      "start": 745434,
      "end": 795130,
      "confidence": 0.7701096774193551,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bevor ich die Frage beantworte, verstehe ich das richtig? Deine Kritik ist, das System ist so einfach, dass es keinen eigenen Namen verdient? Ja. Okay, gut.",
      "start": 795150,
      "end": 805398,
      "confidence": 0.7354615384615385,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber es ist ja, die Leistung ist ja, dass sich mal jemand überlegt hat und zusammengeschrieben hat, David Allen in dem Fall.",
      "start": 805458,
      "end": 811062,
      "confidence": 0.8284090909090911,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, so habe ich das noch nicht gesehen, aber ich glaube, es gibt Themen in der Welt, die einen eigenen Namen haben, die glaube ich noch simpler sind. Aber nun gut, aber nun gut. Gut, ich muss aber auch sagen, ich flunkere natürlich jetzt hier gerade so ein bisschen oder ich stelle mich auf doof für die Rolle des Podcastes, denn auch ich nutze Getting Things Done von David Allen.",
      "start": 811325,
      "end": 831240,
      "confidence": 0.7099000000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, jetzt darfst du mir aber nicht ausweichen. Was sind die negativen Punkte?",
      "start": 831260,
      "end": 834422,
      "confidence": 0.5234615384615385,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die negativen Punkte, Ich weiß gar nicht, ob es ein negativer Punkt am System selbst ist. Ich habe zwei Punkte, die schwierig zu handeln sind, sagen wir es mal so. Der eine Punkt ist die Anwendung von der ersten Regel, und zwar schreibe alles, was du im Kopf hast, aus und sortiere das, damit du es nicht mehr im Kopf hast, damit dein Kopf frei für alles ist. Das führt dazu, dass du wirklich einfach alles aufschreibst. Klar, die späteren Reviews führen dazu, dass du manche Dinge wegschmeißt und dich explizit dafür entscheidest, das mache ich jetzt gerade nicht. Der Punkt ist aber, du schreibst einfach alles auf und machst dir, wenn es so möchtest, selbst wieder Arbeit, manche Aufgaben wieder wegzuschmeißen, weil das ein schneller Gedanke war, den du vielleicht später nochmal weiterverfolgen möchtest. Das wäre so die erste erste thematik wo ich sagen würde weiß ich nicht ganz ob das so geil ist der zweite punkt wäre es fällt mir relativ leicht meinen tag zu voll zu packen also ich plane dann meinen nächsten tag was mache ich morgen und. Dann spielt das Leben mal wieder eine Rolle und da kommt einfach mal was von links rein, was von rechts rein, was gegebenenfalls wichtiger ist, was ich nicht eingeplant hatte. Und das führt natürlich dazu, dass ich mit den geplanten Aufgaben gar nicht so weit komme. Und das wiederum führt dazu, dass ich die Aufgaben immer weiter schiebe, immer weiter schiebe und immer weiter schiebe und irgendwann denke ich mir, hey, ich hab die jetzt seit einer Woche weiter geschoben, irgendwie können die doch nicht so dringend sein. Also ich overcommitte meinen Tag kontinuierlich ich habe das gefühl dass ich da auch einfach nicht besser werde ich nehme mir immer vor heute schreibst du dir wirklich nur zwei aufgaben auf die du morgen machst und die mache ich dann und dann denke ich mir hätte dir auch mehr nehmen können nächsten tag nehme ich mir dann fünf aufgaben und danach kriege ich davon gar keine geschafft.",
      "start": 834442,
      "end": 941006,
      "confidence": 0.7941804733727814,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber ich glaube, das ist jetzt nicht unbedingt die Schuld von Getting Things Done, sondern ganz allgemein von Overcommitment, egal was für Systeme man verwendet. Und ich glaube, das Gute ist eben, dass man, wenn man alles protokolliert hat oder aufgezeichnet hat, dass eben auch nichts verloren geht. Weil ganz oft ist es ja so, man hat drei Sachen vor an dem Tag, die nimmt man sich vor und dann passieren fünf andere Sachen und dann vergisst man aber die drei Sachen, die man eigentlich machen wollte, weil halt die anderen fünf Sachen jetzt am Tabett gestanden sind. So ein System ermöglicht es halt, dass man dann am nächsten Tag sieht, ah ok, die drei Sachen wollt ihr noch erledigen und dann kann man neu priorisieren oder neue Einteilungen machen, wann man die Sachen denn erledigen will. Und die regelmäßigen Reviews, die kicken natürlich auch wieder Dinge raus. Also ich habe das ganz oft, dass ich mir dann überlege, ok, jetzt habe ich sie fünfmal weitergeschoben, jetzt kicke ich sie raus, es ist nicht mehr so wichtig. Und das gibt mir aber auch diese Sicherheit, dass ich eben nichts vergiss und dass ich die Möglichkeit habe, auch natürlich Sachen wieder zu entfernen von meiner Liste, ganz klar.",
      "start": 941186,
      "end": 998875,
      "confidence": 0.7663478260869565,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist richtig, das ist richtig. Deswegen sagte ich ja initial, dass es gegebenenfalls gar nicht die Kritik am System selbst ist, sondern an der Anwendung. Aber ich muss auch sagen, ich wende eigentlich auch gar nicht jede Regel von Getting Things dann an. Was ich mache ist, ich schreibe mir alles auf und teilweise erwische ich mich selbst dabei, wie ich auch zwei oder fünf Minuten Tasks als To-Do formuliere, obwohl es dann gegebenenfalls schneller wäre, sie direkt zu machen. dass der kontinuierliche Review von meinen Listen führe ich so immer durch, wenn ich Zeit habe, weil ab und zu denke ich mir, ich schreibe ja alles auf, alles ist in meinem System drin und was wichtig ist, kommt wieder. Das hole ich mir dann aus meiner Liste raus, wenn es dann wirklich wichtig ist. Das bedeutet, der Review, den mache ich jetzt nicht ganz so ordentlich, zumindest nicht regulär. Wenn ich ihn jedoch mache, muss ich zugeben, er hat sich immer gelohnt, weil ich immer sehr viele Sachen weggeschmissen habe, neu priorisiert habe, und teilweise daran erinnert habe, hey, das habe ich ja aufgeschrieben, das hatte ich ja gar nicht mehr auf dem Schirm. Cool.",
      "start": 999232,
      "end": 1055371,
      "confidence": 0.7938781725888324,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich glaube der Review-Prozess ist extrem wichtig, weil man einfach mal rauszoomen muss. Wenn man ständig in dem Abarbeiten von Tasks drinnen ist, in so einem Hamsterrad, dann vergisst man einfach das große Ganze und darum ist es glaube ich extrem wichtig raus zu zoomen und sich mal zu überlegen, okay, ist noch alles up to date, macht noch alles Sinn, was ich da überhaupt mache oder kann ich da vielleicht wirklich Sachen wegschmeißen. Und gerade bei Projekten ist es wichtig, da habe ich einfach so zwei wöchentlich meistens so einen Birdview-Task in meinen Tasks drinnen stehen, der poppt auf und der sagt mir dann einfach, okay, zoome jetzt einfach mal raus bei diesem Projekt und check mal ab, ist noch alles Stand der Dinge, ist alles noch wichtig, muss man irgendwas umpriorisieren, damit man diesen Überblick nicht verliert. Und darum finde ich diese Reviews extrem wichtig und sollte man auf jeden Fall machen.",
      "start": 1055431,
      "end": 1102909,
      "confidence": 0.7995548387096773,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich nutze Gettings Links dann im privaten Umfeld, so wie im Job. Im privaten Umfeld mache ich wirklich für alles. Wenn ich einen Blogpost schreiben möchte, packe ich dann eine Notiz hin. Okay, Blogpost über Thema ABC. Ich habe auch wiederkehrende Aufgaben, zum Beispiel für mein Haus. An einem Haus muss man ja kontinuierlich dran schrauben und es müssen auch immer wieder Sachen in regelmäßigen Abständen gemacht werden. Die Heizung muss gewartet werden. Die Regenrinnen müssen sauber gemacht werden, etc. Und für sowas habe ich im Getting Things dann einfach eine wiederkehrende Aufgabe, dass ich jedes Quartal meine Lichtschächte sauber mache, zum Beispiel, oder meine Regenrinnen oder ähnliches. Das poppt dann automatisch auf, genauso wie ich für eine Rauchmelder an meinem Quartal durchteste, ob die Batterien noch funktionieren. Und ich muss an sowas nicht mehr denken, weil das System erinnert mich dran. Im Job hat mir das sehr, sehr viel gebracht, weil ich hatte mal einen Vorgesetzten und immer wenn ich Themen bei ihm angesprochen habe, dann hieß es, erinnere mich mal nächste Woche dran. Aber ja, komm mit dem Thema nächstes Mal nochmal auf mich zu. Der hatte also so eine Tendenz, einfach keine Entscheidung zu treffen und die Entscheidung immer weiter wegzudelegieren.",
      "start": 1103402,
      "end": 1164216,
      "confidence": 0.747171568627451,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Er hat sie eben nicht delegiert, er hat sie nur verschoben.",
      "start": 1164476,
      "end": 1167577,
      "confidence": 0.5394545454545455,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Er hat sie nach vorne delegiert, ja, für sich selber halt. Und er hat sie auf jeden Fall aktuell von sich weggeschoben. Auf jeden Fall habe ich dann irgendwann mal angefangen mir eigene Reminder in Getting Things an, im Prinzip zu setzen. Ich habe sie mir aufgeschrieben, ich erinnere mich, zehn Minuten vor unserem nächsten Meeting, nächste Woche, vor unserem nächsten One-on-One. Dann war ich im 101 und hab die Themenliste rausgeholt. Ja, hör mal, letzte Woche hast du gesagt, ich soll euch diese Woche erneut auf Thema A ansprechen. Wie sieht's denn damit aus? Und das hab ich halt immer und immer wieder gemacht. Und nach einer Zeit hat er verstanden, dieses Thema geht nicht weg. Und dann hat die Person, hat mein Vorgesetzter nämlich angefangen, die Entscheidung sofort zu treffen. Ich bin ihm so lange auf die Nerven gegangen, bis er verstanden hat, scheiße, der kommt ja wirklich mit der Aufgabe weg. Weil er war von vielen Leuten gewohnt, wenn er sagt, ja erinnere mich nächste Woche, dass das unter ferner Liefen fällt und die Leute nicht wiederkommen.",
      "start": 1167777,
      "end": 1215071,
      "confidence": 0.7414388888888891,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also du hast dir deinen Vorgesetzten erzogen.",
      "start": 1215111,
      "end": 1217194,
      "confidence": 0.5618571428571429,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja sozusagen, aber das hat dann auch dazu geführt, dass mein Vorgesetzter verstanden, oh dem kannst du Themen geben und er vergisst sie nicht. Und das meinte ich initial mit karriere podcast ja so technisch das allein das kann dir sehr viel bringen dass du auf einmal mehr verantwortung bekommst gegebenenfalls wichtigere oder spannendere projekte mit mehr impact zugewiesen bekommst weil du halt einfach als zuverlässig angesehen wirst obwohl ich habe kein talent dafür nur was du mir sagst das schreibe ich mir auf wenn ich darum kümmern muss dann schreibe ich mir das auf damit ich das nicht vergesse und dann habe ich einen computer der erinnert mich daran mehr mache ich ja nicht.",
      "start": 1217334,
      "end": 1253684,
      "confidence": 0.7638956521739132,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich kenne auch eine andere Geschichte zu Reminder. Ein Kollege von uns beiden hat es auch viel verwendet als Engineering Manager, dass wenn er einfach irgendwo etwas gehört hat von einem an seinem Team, zum Beispiel, er fährt jetzt auf Urlaub oder er heiratet nächste Woche, hat er sich einen Reminder gesetzt auf kurz danach, um einfach mal nachzufragen, wie ist das Ganze abgelaufen, wie war denn die Hochzeit, wie war der Urlaub, wie waren solche Dinge. Klingt jetzt fast wie Manipulation, muss man natürlich dazu sagen. Aber man muss sich auch unter dem Kontext das Ganze vorstellen, ich kenne das selber, wenn man teilweise über 20 Leute hat, man kann sich das einfach gar nicht mehr merken, was einem die Leute sagen, aber man hat ja trotzdem Interesse an den Leuten und das ist ja wirklich ein echtes Interesse, aber man hat halt so viel um die Ohren, dass man das gar nicht mehr schafft, das alles im Kopf zu behalten, wenn man viele Leute im Team hat. Da helfen natürlich solche Sachen genauso. Einfach auf der privaten Ebene, dass man da auch nachfragt zum Beispiel und solche Sachen nicht vergisst und halt dann dementsprechend die Beziehung oder Freundschaft dann auch dementsprechend verbessert und aufrechterhalten kann.",
      "start": 1253964,
      "end": 1317139,
      "confidence": 0.8373333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du wirst lachen, ich mache das genauso. Und ich sehe das gar nicht als Manipulation, ich sehe das einfach nur Jeder hat so viele Sachen am Laufen, sei es privat, man hat eine Frau, Kind, Hund, man will noch in Urlaub fahren, dann ist die Arbeit stressig und dann auf Social Media prallen noch so viele Informationen ein. Da ist es gar nicht verwerflich, wenn man solche Sachen halt mal von den anderen Leuten vergisst, weil es steckt halt oft nicht auf deiner Top Prio 1. Und wenn du dann einfach aufschreibst hey jemand war auf sardinien und einfach mal fragen wie war es denn erzähl doch mal ein bisschen was das das ist ja keine manipulation du interessierst dich ja wirklich dafür ja und du sorgst halt dafür, dass du diese richtigen fragen halt stellst und, Ich finde das jetzt ist keine Manipulation ist nur eine Art wie du dich organisierst manche leute sind halt besser darin und manche brauchen halt hilfsmittel.",
      "start": 1317159,
      "end": 1363087,
      "confidence": 0.788963190184049,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich schreibe mir auch ganz oft auf wenn ich zum beispiel irgendwem eine message schreiben soll am nächsten tag und ich denke mir okay es dauert vielleicht doch ich muss mir überlegen was sie wirklich schreibt. Schreiben wir einfach ein Task für den nächsten Tag am Abend, schreiben wir das auf, sende Andi eine Message und dann kann ich das am nächsten Tag machen. Also ich mache das auch teilweise mit wirklich kleinen Tasks oder ein Klassiker zum Beispiel ist Zahnbürste wechseln. Also ich habe immer dieses Problem, ich sehe, dass meine Zahnbürste gewechselt werden muss, der Kopf von der Zahnbürste und mir fällt es immer ein, wenn ich die Zähne putze und danach habe ich es vergessen und am nächsten Tag denke ich mir wieder, damn, es ist immer noch der alte Kopf drauf und ich muss einen neuen kaufen. Und mittlerweile ist es halt wirklich so, ich hab's Handy normal sowieso daneben liegen beim Zähneputzen und dann schreiben wir wirklich an Task, okay, ich muss diese dumme Zahnbürste austauschen. Und das funktioniert dann auch.",
      "start": 1363127,
      "end": 1411828,
      "confidence": 0.7066214689265533,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Immer wenn ich mit einem ehemaligen Arbeitskollegen, wenn ich den mal irgendwo treffe oder ähnliches, sage ich, hey, pass mal auf, ich melde mich mal in zwei Monaten, lass mal Mittagessen gehen oder lass mal Abendessen gehen. Einfach nur mal um zu quatschen. Und ja, danach schreibe ich mir sofort auf, Reminder in zwei Monaten und dann melde ich mich irgendwann bei dieser Person. also ich benutze das wirklich für alles und wenn man den wert davon erkennt und seinem system vertraut, dann hat man meines erachtens nach auch kontinuierlich deutlich freieren kopf weil du musst du denkst nicht kontinuierlich nach ich muss daran denken ich muss daran denken ich muss daran denken weil du weißt ja ich hab's aufgeschrieben und das system erinnert mich das führt dann ab und zu mal ein bisschen zu zu knatsch in meiner ehe, weil meine Frau kann nicht verstehen, dass ich dann manche Dinge einfach nicht mehr im Kopf habe. Sie ist aber immer wieder erstaunt, wenn ich es dann doch zeitlich mache, weil das System erinnert mich ja, aber wenn sie mit mir darüber sprechen möchte, dann kann ich mich da gegebenenfalls nicht mehr daran erinnern, dass wir irgendwas versprochen haben oder dass ich irgendwas zu tun hatte, weil sie sagt dann, hey, du musst das machen. Hast du mir gar nicht gesagt? Dann schaue ich nach, dann hat sie mir das irgendwie vor zwei Wochen gesagt und ich hab's mir aufgeschrieben und hab's wieder vergessen, weil in zwei Wochen muss ich die Aufgabe erst machen.",
      "start": 1411868,
      "end": 1486325,
      "confidence": 0.754925196850394,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, jetzt haben wir genug private Geschichten erzählt. Kommen wir mal zurück zu den Hard Facts. Gibt's sonst noch irgendwelche Methoden, die du gerne empfehlst oder selber verwendest?",
      "start": 1486572,
      "end": 1497820,
      "confidence": 0.8085714285714285,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hätte da noch ein, zwei, drei Methoden, ja. Und ich fang einfach mal mit einer Methode an, die ich immer noch versuche anzuwenden, wo ich aber schon seit Jahren versuche, mir diese abzugewöhnen. Und zwar ist das Inbox Zero. Inbox 0 ist eigentlich, die Grundidee ist, dass du dein E-Mail-Postfach immer auf 0 E-Mails hältst und dass du somit dann eigentlich deine Liste clean hast und nichts mehr zu tun hast.",
      "start": 1497860,
      "end": 1527397,
      "confidence": 0.843444444444444,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Warum willst du weg davon? Ich verwende es nämlich übrigens auch, darum bin ich noch mehr interessiert.",
      "start": 1527857,
      "end": 1532680,
      "confidence": 0.7734117647058826,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weil die E-Mail-Inbox eigentlich eine To-Do-Liste ist, die von anderen gefüllt werden kann. Und ich möchte nicht von anderen getrieben werden. Nur weil du mir fünf E-Mails schreibst, heißt das nicht, dass die für mich wichtig sind. Und dass ich mich explizit daran setzen muss, um die abzuarbeiten, wegzulöschen, anzusehen oder zu labeln oder zu kategorisieren. Deswegen möchte ich eigentlich davon wegkommen, weil ich mich mehr dazu erziehen möchte, mehr Input, den wir mehr und mehr haben, besser zu ignorieren und meine eigene to do list und mein eigenes projekt im fokus zu haben und dass ich dann mehr selbstbestimmt bin anstatt dass ich mich von dir treiben lasse.",
      "start": 1532700,
      "end": 1574648,
      "confidence": 0.8656788990825689,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielleicht nochmal jetzt zur Erklärung, wer Zero Inbox nicht kennt, ist eigentlich sowas ähnlich wie die Getting Things Done Inbox, wenn das jemandem was sagt. Es geht darum, dass alle E-Mails, die in der Inbox aktuell sind, eigentlich To-Dos sind, die man abzuarbeiten hat. Und sobald man eine E-Mail abgearbeitet hat oder nichts mehr ansteht bezüglich dieser E-Mail, verschiebt man diese E-Mail in ein Archiv oder löscht die E-Mail, wie auch immer. Aber das kann dann nicht mehr passieren. Ich hatte früher zum Beispiel so eine Inbox, die hatte irgendwie 12.000 E-Mails gespeichert oder so, weil ich lösche relativ wenige E-Mails. Und dann gibt es aber genau dieses Problem, dass so neue E-Mails oft nach unten rutschen, weil man neue E-Mails bekommt, die werden oben wieder angehängt und dann vergisst man einfach, dass da ein ungelesenes E-Mail zum Beispiel irgendwo ist, eigentlich schon 20 E-Mails weiter unten. Und so übersieht man dann viele Sachen. Da bin ich dann auch umgestiegen auf die Zero-Inbox-Methode, dass man also wirklich nur diese E-Mails hat, die noch nicht bearbeitet worden sind. Und ich mache es dann aber auch so, um das Problem vom Andi eben nicht zu haben, dass ich Sachen, die mir jetzt aktuell nicht wichtig sind, dass ich die lösche oder wenn ich sie erst in der Zukunft irgendwann bearbeiten will, Dann erstelle ich mir da wieder ein Task in meinem Getting-Things-Done-System oder ein Remember-the-Milk bei mir zum Beispiel und hinterlege dort die Info, okay, dieses E-Mail oder dieses Projekt, was auch immer musst du noch abklären und solltest du machen und dann ist es in meinem normalen System wieder drin und ich kann die E-Mail schon löschen, dass ich wieder möglichst leere Inbox in meinem E-Mail-Postfach habe.",
      "start": 1574799,
      "end": 1671046,
      "confidence": 0.7956888111888112,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, eine zweite Kritik wäre jetzt eigentlich, dass du zwei Input-Streams hast, die du dann wieder überführen musst, weil du hast ja auf einmal deine E-Mail, dein E-Mail-Postfach, ja, und deine Getting-Things-Done-Liste. Und natürlich, du überführst die jetzt, aber hast schon wieder mehrere Input-Streams.",
      "start": 1671427,
      "end": 1687213,
      "confidence": 0.7309545454545457,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe aber ganz, ganz viele Input-Streams. Ich habe Telefon als Input-Stream, ich habe andere Personen als Input-Stream. Also es kommt sowieso auf mehreren Kanälen rein. Aber was mir halt früher immer passiert ist, dass ich wirklich E-Mails vergessen habe und übersehen habe, weil die nach unten gewandert sind und das wollte ich halt einfach loswerden. Und ganz abgesehen davon, wenn wir jetzt ein bisschen an Umweltschutz und so weiter denken und auch an die eigene Zeit, wer IMAP-Server verwendet, und jeweils 12.000 E-Mails synchen muss. Jedes Mal, wenn er auf die Inbox klickt, der braucht erstens viel Zeit, weil das wird mit der Zeit wirklich langsamer und verbraucht auch extrem viel Energie. Also auch da kann man sparen, wenn man die E-Mails aus seiner Inbox rauswirft.",
      "start": 1687694,
      "end": 1727328,
      "confidence": 0.7724015748031491,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du benutzt kein Gmail, oder?",
      "start": 1727349,
      "end": 1728949,
      "confidence": 0.744,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, ich benutze Oldschool IMAP.",
      "start": 1729009,
      "end": 1731050,
      "confidence": 0.49879999999999997,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In Gmail gibt es auf jeden Fall eine Funktionalität, die dir nur ungelesene E-Mails anzeigt oder alle ungelesenen E-Mails nach oben priorisiert.",
      "start": 1731130,
      "end": 1740335,
      "confidence": 0.7608636363636364,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das gibt es in jedem normalen E-Mail-Programm auch, aber das hat nie gut funktioniert für mich. Dann werden die automatisch als gelesen markiert, weil ich halt einmal die E-Mail durchgelesen habe oder versehentlich draufgeklickt habe, dann geht sie wieder verloren. Also irgendwie war ich da nie so glücklich mit diesem System. Aber auch da wieder, ich glaube, man muss ein System finden, was für einen selbst passt. Aber ich glaube, das Wichtige ist halt, dass man Sachen nicht verlieren darf oder nicht übersehen darf. Und da braucht man halt irgendein System wieder, dem man vertrauen kann. Und das einem hilft dabei, eben Sachen nicht zu vergessen, was es auch immer ist.",
      "start": 1740555,
      "end": 1771614,
      "confidence": 0.790607142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich verfolge Inbox Zero immer noch. Ich trainiere mich jeden Tag daran, mehr und mehr wegzulöschen und nicht alles zu lesen. Und ich versuche, mich auch nicht davon treiben zu lassen.",
      "start": 1772155,
      "end": 1784402,
      "confidence": 0.7931250000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist sicher eine gute Einstellung und ich glaube, das eine schließt das andere nicht aus, weil ich glaube, löschen ist immer ein guter Punkt und ich lösche auch keine Newsletter oder solche Dinge, die man früher oft so aufgehalten hat, ah, die will ich später nochmal lesen. Da bin ich mittlerweile einfach knallhart und lösche die raus, wie wenn man halt auf Twitter auch nicht jeden Tag ist, dann bekommt man auch nicht alles mit und man wird nicht ganz Twitter lesen, wenn man mal eine Woche auf Urlaub war, was in der letzten Woche passiert ist.",
      "start": 1784916,
      "end": 1809914,
      "confidence": 0.7612448979591837,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, wir müssen alle generell besser werden, in Sachen zu ignorieren, weil sonst gehen wir alle bald unter, weil Social Media und Apps und allem drum und dran, die kämpfen um deine Aufmerksamkeit deswegen. Und damit man alle seine Sachen schön geordnet hat, komme ich zu den nächsten Hack, der kein Hack ist, der einfach nur konsequent durchgezogen wird von mir. Und das ist mein Kalender. Und ich, also ohne meinen Kalender bin ich einfach nichts. Ich wäre verloren, würde ich fast sagen. Ich trage mir wirklich alles in den Kalender ein. Wann ich beim Sport bin, wann wir Podcastaufnahme haben, wenn ich mit einem guten Kumpel bei einem anderen kumpel holz abholen gehe dann mache ich einen kalender eintrag und versende diesen kalender eintrag sogar an meine kumpels und die regen sich jedes mal auf warum ich dafür den kalender.",
      "start": 1810474,
      "end": 1863815,
      "confidence": 0.8409366197183097,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eintrag schicke ich bin übrigens jedes mal extrem froh weil ihr habt genau den gleichen ansatz und probiere alles in meinen kalender einzutragen und dann kann man nämlich auch zum beispiel solche Dinge verwenden wie so Appointment Pages, also so Webseiten, wo andere Leute dann einfach sich einen Termin aussuchen können, einen freien Termin, und dir einen Termin reinbuchen können. Das ist extrem praktisch, weil sonst ist es extrem kompliziert, Ping-Pong hin und her, wann hat der Zeit, wann hat der Zeit und so sendet man einfach einen Link aus, sagt, ja bitte such dir einfach einen Termin aus und dann wird es automatisch in den Kalender eingetragen. Sowas wie Calendly zum Beispiel oder ich verwende eben Nextcloud App dafür, die direkt das in Kalender einträgt. Finde ich extrem praktisch und ist für mich auch ziemlich wichtig, der Kalender.",
      "start": 1863835,
      "end": 1910052,
      "confidence": 0.7957697841726619,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das finde ich super, um dieses Ping-Pong zu vermeiden. Ja, wann hast du denn Zeit? Ja, ich habe da einen. Ah ne, da passt es mir aber nicht. Aber irgendwie erinnert mich das schon so ein bisschen wieder daran, von anderen getrieben zu werden, weil jeder kann mir dann aktiv einfach einen Kalender reinschmeißen und du bist dann Klar, du kannst vielleicht absagen oder ähnliches, aber dann bist du ja schon wieder beim Ping-Pong. Weißt du, was ich meine?",
      "start": 1910992,
      "end": 1931110,
      "confidence": 0.618746835443038,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also, üblicherweise habe ich das Problem nicht. Es traut sich da niemand, was einzutragen, wenn ich ihn da vorne gefragt habe oder den Link gesendet habe. Bitte such dir was aus, wenn man es vereinbart hat. Man will sich treffen oder will einen Online-Call machen. Also, das Problem habe ich eigentlich bisher selten gehabt. Aber das Problem in der Firmenwelt gibt es natürlich sehr oft, dass man da einfach Sachen reingeworfen bekommt. Aber da muss man halt dann auch wieder knallhart sein und einfach Sachen absagen, verschieben. Und dementsprechend darf man halt da auch keine Angst davor haben, mal Nein zu sagen. Das ist, glaube ich, schon ein wichtiger Punkt.",
      "start": 1931150,
      "end": 1961684,
      "confidence": 0.7733727272727269,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So strikt auf den Kalender zu achten hat natürlich auch einen Vorteil. Mein Kalender ist immer up-to-date, sei es mein privater Kalender oder mein Arbeitskalender. Und ich habe es in mehreren Firmen schon erlebt, da wurde ich gefragt, ob mein Kalender up-to-date sei.",
      "start": 1962204,
      "end": 1975612,
      "confidence": 0.7630465116279069,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, die Frage kenne ich auch.",
      "start": 1976132,
      "end": 1977413,
      "confidence": 0.38399999999999995,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ist das für eine Frage? Ich verstehe die Frage einfach nicht. In welcher Situation ist dein Kalender mal nicht up to date? Auf jeden Fall überrascht mich, diese Frage überrascht mich halt sehr. Und deswegen ist mein privater Kalender halt auch so recht voll, weil ich schreibe mir wirklich alles auf. Klar, ich bin auf einen Geburtstag eingeladen, Hochzeit eingeladen, das sind so die klassischen Termine. Aber wie gesagt, wenn ich zum Sport gehe, wenn wir Podcastaufnahme haben, Viele Leute schauen da drauf und sagen, boah, bist du busy? Aber ich benutze die Termine eigentlich genauso wie jede andere Aufgabe. Ich schreibe sie mir auf in ein System, doch ich habe halt für Aufgaben ein anderes System als für meine Termine. Und weil ich halt auch möchte, dass meine Freunde oder Bekannte die Termine mit mir nicht vergessen, schicke ich denen halt jetzt auch oft eine Einladung, wo ich dann oft halt Wöse Kommentare zu kriege und ich weiß gar nicht, ob die die mal annehmen oder nicht, aber naja, vielleicht kriege ich ein bisschen Feedback von denen, wenn die hier den Einwanderer-Podcast hören.",
      "start": 1978063,
      "end": 2036486,
      "confidence": 0.7877027027027028,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich meine, man muss dazu sagen, jeder hat natürlich auch nicht so ein digitales Kalendersystem. Viele haben auch ein klassisches Notizbuch, so einen klassischen Kalender, so, wie nennt sich dieses, so mit Stift und Papier, so einen Kalender. Aber das ist ja auch vollkommen okay. Und ich glaube, nur wichtig ist, dass man einen Kalender hat und ich hoffe, dass die meisten Leute einen Kalender haben, die irgendwie Termine haben und jetzt vielleicht nicht so ein durchgeplantes Leben durch den Job haben, dass sie dort hingehen und dann wird alles für sie erledigt. Also finde ich schon, dass man heutzutage eigentlich jedem empfehlen kann, einen Kalender eigentlich in irgendeiner Form zu führen.",
      "start": 2036526,
      "end": 2073657,
      "confidence": 0.8002589285714284,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eine kleine Warnung, nur weil ich alle Termine im Kalender habe, oder ihr alle Termine im Kalender habt, heißt das nicht, dass man pünktlich zu diesen Terminen kommt. Leider habe ich einen Ruf, nicht pünktlich zu sein.",
      "start": 2074337,
      "end": 2085065,
      "confidence": 0.8315135135135133,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist denn mit der deutschen Pünktlichkeit?",
      "start": 2085105,
      "end": 2087087,
      "confidence": 0.6811428571428572,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die trifft auf mich nicht zu. Ich bin pünktlich beim Kegeln, weil wenn ich da zu spät komme, gibt es Strafe, muss ich dann halt Geld zahlen. Oder beim Sport, weil für jede Minute gibt es dann 10 Strafburpees und die will einfach keiner machen.",
      "start": 2087107,
      "end": 2098415,
      "confidence": 0.7594000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, also bei dir geht es nur mit Strafen, habe ich schon erkannt.",
      "start": 2098822,
      "end": 2102143,
      "confidence": 0.6090000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Strafen erziehen mich auf jeden Fall.",
      "start": 2102163,
      "end": 2103663,
      "confidence": 0.9049999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist die akademische Viertelstunde, das ist schon okay.",
      "start": 2104244,
      "end": 2108465,
      "confidence": 0.6993999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das sage ich auch immer, aber naja, legt halt keiner mehr Wert auf ordentliche akademische Bräuche, würde ich mal sagen. Immer wenn ich über produktivität mit anderen leuten rede kommt mir die eisenhauer matrix um die ecke kennst du die ja.",
      "start": 2108485,
      "end": 2123154,
      "confidence": 0.727609756097561,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kenne ich natürlich schon mal angewandt. Ich bin kein großer fan davon aber erklär mal warum um was es geht.",
      "start": 2123174,
      "end": 2129278,
      "confidence": 0.6865,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die eisenhauer matrix ist meines erachtens nach noch simpler als getting things done und ob die wirklich so den den namen verdient weiß ich jetzt nicht. Sie ist auf jeden Fall ein Koordinatensystem mit vier Feldern. Und auf der x-Achse hast du die Dringlichkeit, also dringend und nicht dringend. Und auf der y-Achse hast du die Wichtigkeit, wichtig und nicht wichtig. Das bedeutet, du hast natürlich Quadranten, wie zum Beispiel, was wichtig ist und was dringend ist, sollst du sofort selbst erledigen. Was nicht dringend ist und wichtig ist, kannst du terminieren und selbst erledigen. Was dringend ist und nicht wichtig, sollst du an kompetente mitarbeiter delegieren und was nicht dringend und nicht wichtig ist sollst du einfach gar nicht bearbeiten direkt in den papierkopf schmeißen.",
      "start": 2129298,
      "end": 2175578,
      "confidence": 0.8292142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich glaube ist eine extrem einfache regel die auch einfach anzuwenden ist das stimmt schon. Da ist meine kritik auch wieder hat die wirklich einen eigenen namen verdient okay aber wenn man so visuell aufzeichnen will hilft es vielleicht auch wenn man ja gar nicht genau weiß ob der eisenhauer das wirklich selber verwendet hat. Das große Problem, was ich an dieser Eisenhower Matrix sehe, ist dieses, dass nicht wichtige und dringende Angelegenheiten an kompetente Mitarbeiter delegiert werden sollen. Und da bin ich eigentlich irgendwo dagegen, weil ich finde auch, dass wichtige Tasks an Mitarbeiter delegiert werden sollen und Mitarbeiterinnen. Also nicht nur die nicht wichtigen, sondern ich muss auch schauen, dass es interessante, wichtige Tasks sind, die man anderen Leuten gibt, weil sonst können Leute ja auch nie wachsen. Also wenn man nur diesen unwichtigen Kram weiterleitet, also dann wird das Team nicht glücklich und die Leute können auch einfach nicht wachsen. Und das sehe ich als größten Kritikpunkt eigentlich an der ganzen Methode. Aber der Rest stimmt natürlich einfach, was soll man selber sofort erledigen, was soll man später erledigen und was soll man gar nicht erledigen und das gar nicht erledigen ist glaube ich auch sehr wichtig, dass dieses Nein sagen und nicht alles automatisch machen doch ein wichtiger Punkt ist.",
      "start": 2175638,
      "end": 2247239,
      "confidence": 0.8229906976744177,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast einen Punkt, aber lass uns mal bitte ein bisschen Kontext erzeugen, woher die Eisenhower-Matrix ihren Namen hat. und zwar vom ehemaligen präsidenten dwight d eisenhauer vom ehemaligen amerikanischen präsidenten und er war präsident habe ich gerade mal nachgeguckt von 1953 bis 61 von 1953 bis 61 war das thema management und employee recognition und den spannenden aufgaben geben bestimmt noch leicht anders als jetzt und natürlich. Ich denke, dass nicht wichtige, aber dringende Aufgaben, dann an kompetente Mitarbeiter zu delegieren, wenn man diesen zeitlichen Aspekt mit reinnimmt, ich glaube, dann war das halt einfach früher so.",
      "start": 2247939,
      "end": 2291184,
      "confidence": 0.7817959183673472,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, da gebe ich dir vollkommen recht. Also als schnelle Einteilung oder sich das einfach mal klarzumachen, solche Methoden sind ja auch einfach da, dass man sich so Sachen mal überlegt oder durchdenkt, was man denn da machen kann. Es sind ja nie so Methoden, die man eins zu eins umsetzen sollte oder so ein absolutes Regelwerk, Aber einfach so eine Hilfe, die man dazu hat, um sich ein eigenes System zurechtzulegen. Und da hilft sowas natürlich wie die Eisenhower Matrix auf jeden Fall.",
      "start": 2291505,
      "end": 2319069,
      "confidence": 0.8162738095238098,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was mir aber enorm schwerfällt, ist Aufgaben aktiv wegzuschmeißen. weil ich mir aufdenke aus irgendeinem grund habe ich die ja aufgeschrieben und für irgendwen sind die ja wichtig aber ich habe irgendwann mal in meinem vorherigen job einen test gemacht und zwar hatte ich einfach den ganzen tisch voll voll aufgaben und habe einfach gesagt ach weißt du was ich mache für die hälfte mal nicht die eine hälfte schiebe ich vom tisch runter die mache ich nicht. Und ich glaube ich habe 20 oder 25 Aufgaben einfach weggeschoben, nicht gemacht, und ich glaube eine kam mit einem Bumerang zurück, die dann wichtig war, und von den anderen 24, die hätten mich wochenlang Arbeit gekostet, hat sich niemand mehr gemeldet. Also da hat dann wieder irgendwer geschrien, das ist wichtig, hat sich das dann selbst nicht aufgeschrieben, um dann da wieder darauf zurückzukommen. Man hat sich dann nie wieder gemeldet. Und das hat mir irgendwie gezeigt, wichtige Dinge kommen eigentlich immer wieder und viele Sachen kann man einfach nicht machen, weil man denkt zwar sie seien unglaublich wichtig, sind sie im Endeffekt aber nicht.",
      "start": 2319130,
      "end": 2383619,
      "confidence": 0.797369565217391,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist ja auch so ein Klassiker in der Softwareentwicklung, wenn man sich das Backlog einfach füllt und füllt und füllt und man das eigentlich nie irgendwie säubert wieder und mal Sachen rauskickt. Und eigentlich sind dann viele Bugs oder Tasks vielleicht gar nicht mehr relevant und schlummern aber trotzdem irgendwo noch im Ticketsystem herum in ewig langen Listen. Es gibt ja auch diese Erzählung von dem CEO, der damals Studiefahrzeit übernommen hatte. Also die älteren Zuhörer und Hörerinnen kennen vielleicht StudiVZ noch. Das war diese deutsche Facebook-Kubi. Und da hat mal ein neuer CEO angefangen und er hat einfach gesagt, wir löschen jetzt unser gesamtes Ticketsystem. Und das hat er einfach durchgezogen. Alle Bugs, alles was dort eingetragen war, hat er gelöscht und die sind von null wieder losgestartet. Einfach weil er gesagt hat, wenn es wichtig ist, wird es wieder aufpoppen.",
      "start": 2383830,
      "end": 2434603,
      "confidence": 0.8288391608391611,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hast du da mal irgendwie ein bisschen was mehr drüber gehört was daraus geworden ist also nicht aus studivozett sondern aus dieser aktion wird das positiv angenommen weil ich kann mir schon vorstellen dass von den mitarbeitern erstmal einen riesen schock kam besonders von den ganzen leuten die tickets erstellt haben oder die. von den PMs, die da stundenlang in irgendwelchen Grooming-Sessions verbracht haben oder ähnliches?",
      "start": 2434883,
      "end": 2453060,
      "confidence": 0.7049696969696966,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also StudiVZ ist ja abgeschaltet worden vor ein paar Tagen, habe ich gerade gelesen. Unglaublich, dass es noch so lange irgendwie aktiv war. Aber ich kenne jetzt keine Insider-Informationen dazu, aber ich kenne jemanden, der für StudiVZ dann mal später gearbeitet hat, der hat das auch sehr stolz erzählt und das war scheinbar schon in der Firma als coole Story unterwegs. Keine Ahnung, ob es dann auf Anhieb akzeptiert worden ist von allen, aber grundsätzlich die ganzen Tasks zu löschen und viel Arbeit damit für sinnlos zu erklären, ich glaube, das könnte schon eigentlich auch bei vielen guten Anklang finden, weil man halt dann einfach wieder frisch starten kann und nicht so einen schweren Rucksack mit sich herumträgt.",
      "start": 2453100,
      "end": 2493434,
      "confidence": 0.7996525423728813,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich kann mir schon vorstellen, dass das Sinn hat. Es ist eine harte Entscheidung, aber auf der Arbeit haben wir auch einen Jarrah-Filter, der nennt sich Trash Candidates. Und der filtert alle Tickets, die in den letzten 90 Tagen, glaube ich, nicht angefasst worden sind. Und die werden kontinuierlich reviewed und da werden auch kontinuierlich Sachen von weggeschmissen, weil wenn die seit 90 Tagen nicht angerührt worden sind, dann scheinen die nicht so wichtig zu sein. Natürlich kann man das nicht generalisieren ja strategische projekte die über ein jahr oder ähnliches laufen sind bestimmt da ein bisschen anders aber da ist die frage ob man dazu schon ein richtiges ticket und ein gut beschriebenes ticket erstellen kann oder ob das nicht eher irgendwie in einem oka system oder ähnliches sein sollte. Okay, wir sind jetzt gerade mal durch vier Methoden gegangen, oder vier Sachen, auf die wir beide sehr viel Wert legen. Getting Things Done, Eisenhower Matrix, Kalender und Zero Inbox. Hast du denn noch andere Hacks, die man jetzt vielleicht nicht mit einem Methodennamen versehen kann oder ähnliches?",
      "start": 2493754,
      "end": 2555645,
      "confidence": 0.7819776536312854,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also was ich auch noch probiere, um meine Prokrastination zu vermeiden, ist, dass ich mich selber eigentlich austrickse, indem ich mir coole Tasks schreibe. Weil es gibt nichts Schlimmeres als solche Tasks, die langweilig klingen, die man eigentlich überhaupt nicht machen will und die man dann immer rausschiebt. Und da probiere ich einfach mich selber auszutricksen, indem ich die Tasks möglichst klein mache. Also ich habe das in dem Blogartikel damals Shape and Cell genannt. Das heißt, man probiert die Tasks wirklich so zu shapen, zu formen, dass sie interessant sind, dass sie klein sind, dass man sie auch in kleinen Häppchen sozusagen abarbeiten kann. Wie schaut das konkret aus? Also so ein Klassiker ist, dass man halt einfach so ein Task drin hat, Projekt X weitermachen oder so. Das ist natürlich überhaupt nicht sexy. sondern da wäre es natürlich ideal, wenn man schon in einer Review Session sich überlegt, okay, was sind denn die nächsten zwei wichtigen Tasks in dem Projekt X und dann wirklich ganz konkret die Tasks hinschreibt, vielleicht sich auch überlegt, okay, wie lange sollen die Tasks dauern oder will ich da vielleicht einfach mal ein Timeboxing drum machen um so einen Task, dass ich zum Beispiel sage, okay, ich will da jetzt nur zwei Stunden investieren, nicht länger. Und dann schaue ich mir das Ganze nochmal an, weil wenn ich mir so ein Task überlege und ich weiß das schon, oh der dauert acht Stunden, dann fange ich den eh nie an. Wenn ich da so ein Time-Boxing zwei Stunden hinschreibe, dann weiß ich, okay, es geht einmal nur um zwei Stunden jetzt, danach kann ich ihn wieder zurücklegen in den Task, dann habe ich schon einmal was erledigt. Und dann nenne ich den natürlich auch noch super interessant, weil ich sehe zum Beispiel die Analyse von drei Konkurrenten und dann Time-Boxe ich das Ganze für 60 Minuten für ein Projekt von mir. Dann weiß ich schon ganz genau, okay, es geht wirklich nur um eine Recherche, die dauert so und so lang und ich suche mir einfach mal drei Konkurrenten raus, was es sonst gibt. Aber das ist halt grundsätzlich schon viel überschaubarer, als wenn da steht, Konkurrentenanalyse oder sowas zu machen, weil dann weiß ich einfach nicht, wie lang ist das, was soll ich da eigentlich machen oder vielleicht noch schlimmer, einfach eben Projekt X weitermachen. Und so probiere ich mich eben möglichst selber auszutricksen, dass das möglichst einfach für mich ist, dass ich wirklich ein Task anfange und dann aber auch vielleicht stoppe, weil ich einfach sage, okay, dann habe ich Timepoxt auf 60 Minuten. Jetzt sind 60 Minuten um, ich habe auch noch andere Dinge heute zu tun. Das heißt, ich speichere mal mein Ergebnis und setze mir dann einen neuen Task wieder vielleicht mit 60 Minuten an einem anderen Tag.",
      "start": 2556045,
      "end": 2699418,
      "confidence": 0.7762106382978726,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das klingt auf jeden Fall total akademisch, was du da gerade gesagt hast.",
      "start": 2699438,
      "end": 2702459,
      "confidence": 0.5155384615384615,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist total dumm, um mich auszutricksen.",
      "start": 2703339,
      "end": 2705479,
      "confidence": 0.72225,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ein System auf dem System. Aber ich finde das schön, dass du deine Probleme kennst und dir ein System entwickelst, die gastlerische Methode anscheinend, um dich selbst auszudringen. Eine Frage habe ich, als du dir überlegt hast, boah, ich brauche mal hier irgendwas für mein Zeitmanagement oder mein To-Do-Listen-Management. Hast du dir irgendwas geschnappt sofort losgelegt und hat es funktioniert oder wie hast du die ganze sache gestartet.",
      "start": 2705539,
      "end": 2729001,
      "confidence": 0.6932941176470587,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ganze zeug ist natürlich über über jahrzehnte gewachsen und ich habe auch extrem viele tools dafür verwendet und getting things done habe ich glaube ich wirklich vor 20 jahren oder so gelesen hat mir mein bruder damals empfohlen, auf einer audio cd im auto gehört es erklärt schon wie alt das ganze ist und, Dann habe ich mir eigentlich probiert, diverse Tools zu organisieren, mit denen ich arbeiten kann. Viele davon gibt es einfach gar nicht mehr, viele davon waren einfach Müll. Und in letzter Zeit vertraue ich eigentlich Remember the Milk, dank dir Andi, das hast du mir mal gezeigt. Und irgendwie am Anfang, vor Jahren habe ich mir das mal angeschaut und bin eigentlich nicht sehr warm damit geworden. Und jetzt vor zwei, drei Jahren habe ich es nochmal probiert und irgendwie finde ich das ein sehr cooles System. Baut auf dem Getting Things Done Approach auf, aber man muss ihn nicht verwenden. Es ist einfach nur sehr intelligente, ganz einfach gehaltene Software, die aber auch synkt mit dem Handy, dass man überall den gleichen Stand hat. Ist auch grundsätzlich kostenfrei, in der Pro-Variante super günstig, irgendwie 40 Euro im Jahr oder so. Also auch das ist super günstig und funktioniert meiner Meinung nach super genial.",
      "start": 2729281,
      "end": 2802984,
      "confidence": 0.7984736842105264,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich hatte ähnliche Startschwierigkeiten. Ich hab da mal, ich hab irgendwann mal Getting Things Done, das Buch gekauft, hab's angefangen zu lesen. Ich glaub, nach einem Drittel hab ich's dann weggelegt und hab gesagt, komm, ich mach das jetzt einfach mal, ich probier das mal aus. Hab dann angefangen, aber irgendwie kam ich nicht so in den Rhythmus, das Getting Things Done Tool, was ich damals genutzt hab, wirklich so in meinen täglichen, in meinen Alltag zu integrieren. Dann hab ich das wieder zur Seite gelegt und nach einem Jahr einfach noch mal angefasst. Und seitdem mach ich's eigentlich kontinuierlich durch. Ich weiß nicht, was sich wirklich geändert hat. Vielleicht war ich so frustriert, dass ich's mal versucht habe, dann wieder weggelegt habe, wieder gemerkt habe, ich vergess wieder ganz viele Dinge und mich dann wirklich hart gezwungen habe. Und nach ein, zwei Wochen ist es dann wirklich drin. Und seitdem halt ... Genau, ich hab auch mal tooltechnisch, hab ich mal mit Wunderlist ganz am Anfang ausprobiert.",
      "start": 2803683,
      "end": 2852774,
      "confidence": 0.7805680473372785,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Merkt man auch schon wieder, dass du ziemlich alt bist?",
      "start": 2852814,
      "end": 2854835,
      "confidence": 0.5798000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja wunderlist gibt es nicht mehr habe ich heute gelernt im vorgespräch zu diesem podcast es ist jetzt microsoft to do ich wusste dass wunderlist von microsoft gekauft wurde aber ich hatte eigentlich gedacht microsoft führt das produkt weiter nee aber sie haben es in diese office suite anscheinend irgendwie mit integriert okay. Ja und seitdem seitdem bin ich auch ein fan von remember the milk leider leider leider ist die software gar nicht mehr so aktiv in der entwicklung also die firma gibt es noch ist neutral australische firma und hier und da antworten die auch noch support aber ich glaube die sagen diese software ist feature complete ab und zu fixen sie mal ein back aber viel geht da nicht mehr also.",
      "start": 2855195,
      "end": 2890106,
      "confidence": 0.7708225806451614,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der einzige Nachteil ist, dass es halt ein bisschen in die Jahre gekommene UI schon ist, auch das JavaScript Framework, Google JavaScript Framework. Keine Ahnung, wie aktiv das noch entwickelt wird. Also keine Ahnung, ob sie da im Hintergrund dann irgendwas Neues bauen. Es ist natürlich auch nicht so leicht mit 40 Euro Jahresgebühr von der Pro-Version und sonst. Die klassische Version, die auch leicht ausreicht, ist kostenlos. Also vielleicht scheitert das Ganze auch am finanziellen. Wäre auf jeden Fall sehr schade, weil, wie gesagt, ich bin ein großer Fan und funktioniert also wirklich sehr gut. Wir machen auch die ganze Planung vom Podcast, wer welche Tasks übernimmt, zum Beispiel irgendwelche Tweets raussenden oder Audiogramme schneiden. Da haben wir eine Liste, die geshared ist, wo wir beide drauf Zugriff haben. Also das macht das Leben auch eigentlich viel einfacher. Was ich sonst früher noch verwendet habe, ist Evernote. Ist nicht wirklich eine App zum Planen, hat aber mittlerweile auch einige Features diesbezüglich, aber war halt für mich so die klassische Notiz-App, die ich eigentlich immer verwendet habe. Da habe ich kürzlich übrigens gerade eine nette App gesehen, die heißt Notable.app. Die speichert einfach die ganzen Nodes, die man aufschreibt in Markdown-Files und sind einfach plain Markdown-Files, die in dem Verzeichnis angelegt werden und macht einen auch noch sehr guten Eindruck. Also man kann glaube ich auch wirklich ganz, ganz einfach starten, um sich solche Dinge aufzuschreiben in Nodes, in Files und sich dann selber ein System zusammenbasteln. Also man braucht nicht immer irgendwie ein fixfertiges System, was Reminder und alles mögliche built-in hat.",
      "start": 2890807,
      "end": 2986742,
      "confidence": 0.7920684410646395,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also, ich glaube, technische Tools gibt es wie Sand am Meer dafür. Ich kenne viele Leute, die nutzen Asana. Ich kenne viele Mac-User, die nutzen Things. Ich für meinen Teil nutze digital Remembers Milk. Wenn ich irgendwo unterwegs bin, wo ich mein Handy aktiv mal nicht in die Hand nehmen möchte oder keinen Laptop dabei habe, dann habe ich ab und zu auch mal ein Notizbuch. Das räume ich dann ab und zu mal auf oder auf dem Handy ab und zu mal die Notizen-App, falls ich mal ein paar unsortierte Notes einfach mal runterschreiben möchte.",
      "start": 2987282,
      "end": 3016629,
      "confidence": 0.7706666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bei mir ist es teilweise sogar so weit, dass ich mir in Remember the Milk einen Task schreibe, der eigentlich eine Notiz ist und da trage ich das am nächsten Tag in irgendein Google Docs oder so ein, wenn es um irgendein Projekt geht oder um das Podcast zum Beispiel, weil ich da einfach weiß, okay, das ist synchronisiert, das ist automatisch dann in meiner Tasklist am nächsten Tag drin und dann wird die Notiz übernommen in das Google Docs von unserem Podcast zum Beispiel von der Episodenvorbereitung.",
      "start": 3016920,
      "end": 3044067,
      "confidence": 0.7752272727272728,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir haben noch nie darüber gesprochen, aber ich mache es genauso, weil meine Notizen ist ein kompletter Müllhaufen. Ich habe Notizen überall und ich weiß im Remember the Milk, da finde ich es wieder und verarbeite es später. Also lustigerweise. Ich greife aber öfters mal auch auf Stifte und Zettel zurück. Also wenn man jetzt gerade auf meinen Schreibtisch guckt, ich habe, ich glaube, so ungefähr zehn kleine Zettel hier rumfliegen, weil es ab und zu schneller geht, weil ich vielleicht auch ab und zu mal Abwechslung brauche. Für die ganzen Power-Emacs-User gibt es auch den Org-Mode bei Emacs und der hat auch Support für Getting Things Done. Also falls ihr im Emac unterwegs seid und die ganze Sache lieber in Files organisieren wollt, könnt ihr auch damit an euer Ziel kommen.",
      "start": 3044668,
      "end": 3085498,
      "confidence": 0.7466515151515148,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber man merkt schon bei den paar Tools, die wir jetzt schon erwähnt haben, es gibt massiv Tools, aber es gibt eben auch nur Stift und Zettel. Ist auch ein super Tool. Und ich glaube, man muss einfach seinen eigenen Weg finden, wo man die Tasks und die Aufgaben einfach aufschreibt. Ich glaube, das ist einfach wichtig, dass man sie irgendwo erfasst und dann halt dementsprechend organisiert und reviewt. Aber in was für einem Tool ist eigentlich ziemlich egal und was für einen Approach man da nimmt, ist eigentlich auch egal. Man sollte sich definitiv ein paar Sachen durchlesen, was gibt es so und dann einfach entscheiden, okay, was will ich mal ausprobieren. Dann einfach für eine Zeit ausprobieren und schauen, ob das für einen funktioniert. Das braucht eine Zeit. Man kann den ja auch ständig optimieren, diesen ganzen Workflow, wie man mit so Tasks umgeht. Und das war ja bei mir auch so, dass ich das über die letzten Jahrzehnte natürlich oft geändert habe an tools angepasst habe an meine eigenen needs je nachdem wie viele tasks man hat ob man das für den job verwendet oder nur privat und solche dinge also einfach zeit nehmen und sachen mal ausprobieren und dann kommt man schon auf einen guten grünen spike.",
      "start": 3085877,
      "end": 3151442,
      "confidence": 0.8117440758293833,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ich kann auch verstehen wenn ihr uns jetzt zuhört und sagt, Brauche ich alles nicht, ich komme auch so klar. Ist auch völlig in Ordnung. Ich habe den Wert dieser ganzen Arbeit und dieser ganzen Organisation auch erst später erkannt und muss zugeben, ich könnte jetzt nicht mehr ohne leben. Probiert es einfach mal aus, seid mal offen, schaut es euch einfach mal an. Und falls ihr noch mal ein bisschen Inspiration braucht, haben wir hier ein paar Blogartikel und ein paar Bücher, die euch gegebenenfalls vielleicht ein bisschen unterstützen. Und zwar ist einer meiner Lieblings-Blogposts Maker-Schedule-Manager-Schedule von Paul Graham. Der spricht eigentlich auch so ein bisschen über Zeitmanagement, zwar aus der Sicht von Programmierern und zwar aus der Sicht des Zeitplans eines Makers, eines Individual Contributors und einem Manager. dass es da natürlich ein bisschen Clinch gibt in Bezug auf lange Fokuszeit und viele Kontextswitche. Aber das gibt auch einen sehr, sehr guten Einstieg in Zeitmanagement und worauf es ankommt. Ein weiteres Buch, was wir hier im Podcast schon erwähnt haben, ist die Grundlektüre zu Getting Things Done, The Art of Stress-Free Productivity von David Allen selbst. Verlinken wir auch in den Show Notes.",
      "start": 3151482,
      "end": 3220947,
      "confidence": 0.7853163265306123,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir verlinken auch noch ein YouTube-Video, das das Getting-Things-Done-Konzept kurz erklärt in so einem Comic-Video. Ist auch sehr schnell und gut.",
      "start": 3221167,
      "end": 3230979,
      "confidence": 0.7982380952380955,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dieses YouTube-Video ist, glaube ich, acht Minuten lang. Das ist dann sehr wahrscheinlich für die Leute, die nicht lesen wollen und auch keine Blinkist-Subscription haben. Ich bin auch noch ein Fan von James Clear. James Clear ist der Autor des Buches Atomic Habits. Hab ich schon mehrmals erwähnt, ich glaub in der Side-Project-Episode. Atomic Habits geht's eigentlich darum, ihr habt ein großes Ziel und macht eigentlich jeden Tag eine kleine Sache. Beispiel, ihr wollt ein Buch schreiben und ihr schreibt einfach jeden Tag einen Satz. Nach 365 Tagen habt ihr 365 Sätze. An sehr guten Tagen schreibt ihr mal 20, 30 Sätze. Und auf einmal habt ihr irgendwann so einen Vorsprung, und veröffentlicht vielleicht euer Buch und jeder fragt sich so, hä, wann hattest du denn Zeit dafür? Wie spielt das jetzt mit Zeitmanagement und Produktivität zusammen? Meines Erachtens nach gibt es in dem Buch viele schöne Storys, wie du an großen Projekten, obwohl niemand Zeit hat, dennoch arbeiten kannst und Produktivität heißt ja nicht immer, dass du alles auf einmal machst, sondern dass du Fortschritt hast und kontinuierlich daran arbeitest. Und wenn wir schon bei Büchern sind, auch eine Top-Empfehlung ist The Checklist Manifesto. Da geht... Es ist ein ganzes Buch über Checklisten. Viele Leute lachen mich dafür aus. Jedoch sind Checklisten wirklich eine Superpower. Was gute Checklisten sind, weil viele Sachen kann man einfach automatisieren. Oder auch, wenn man keine Zeit hat, diese zu automatisieren, kann man die auf jeden Fall über mehrere Leute skalieren, sei es im Team oder ähnliches. Besonders wenn ihr im Infrastrukturbereich seid, manche Sachen muss man einfach manuell machen und eine Checkliste, speziell wenn ihr irgendwelche Audits habt, hilft da auch immer. Auf jeden Fall Produktivitätsgewinn. Dann würde ich sagen, es war mal wieder eine produktive Folge. Kann man das so sagen? Produktive Folge?",
      "start": 3230999,
      "end": 3336985,
      "confidence": 0.795538205980066,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, wir haben länger gebraucht als erwartet und länger als die durchschnittlichen Folgen, also keine Ahnung, ob unser Zeitmanagement so gut ist in dem Fall, aber ihr da draußen könnt es ja besser machen und hoffentlich waren ein paar Ideen dabei und wie gesagt, sonst in den Links findet ihr mehr Informationen zu den ganzen Themen. Und ich glaube, das Wichtigste ist einfach, dass man ein gutes System für sich findet und vor allem ein System, dem man vertraut, damit man eben im Kopf einfach Platz für andere wichtige Dinge hat. Und ich kann euch das auch aus meiner Erfahrung sagen, wenn ihr älter werdet, seid ihr noch glücklicher über so ein System, weil es noch schwieriger wird, sich alles selber im Kopf zu markieren.",
      "start": 3337825,
      "end": 3377788,
      "confidence": 0.8233120000000003,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich meine, so kacke können wir beide im Zeit- und Produktivitätsmanagement ja nicht sein, wenn wir es trotz der ganzen anderen Verantwortlichkeiten immer noch schaffen, jetzt die 12. Folge jede Woche zu releasen, oder?",
      "start": 3378188,
      "end": 3391635,
      "confidence": 0.8620857142857142,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da merkt man schon, es ist die 13. Folge, die wir gerade aufnehmen. Eigentlich die 14., wenn man die Folge 0 mitrechnet. Man merkt schon, der Andi wird auch alt.",
      "start": 3391675,
      "end": 3399700,
      "confidence": 0.7018,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Siehst du, ich hab's nicht im Kopf, weil es steht auf engineeringkiosk.dev. Aber dieser Podcast ist der Beweis, dass die ganzen Sachen halt nicht nur Hokuspokus sind. Das freut mich.",
      "start": 3400280,
      "end": 3413092,
      "confidence": 0.7769999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Falls ihr trotzdem glaubt, es ist Hokuspokus, bitte schickt an stetisch at engineeringkiosk.dev eine E-Mail. Und wenn ihr glaubt, es ist nicht Hokuspokus, dann am besten einen öffentlichen Tweet. Und dann lasst uns vielleicht auch wissen, was ihr denn so verwendet an Tools oder an Approaches oder ob ihr andere interessante Links habt zu dem Thema. Ganz wichtig, auf Twitter ist es natürlich auch einsehbar von allen und fördert den Diskurs und auch gerade wenn es interessante Links sind, ist es sicher auch für andere Hörer und Hörerinnen interessant. Also am besten bitte auf Twitter, aber sonst bei E-Mail geht es natürlich auch. Und wir würden uns natürlich auch freuen, wenn ihr uns teilen würdet oder auch auf den ganzen Plattformen bewerten, wenn es zumindestens möglich ist. Keine Ahnung, du verwendest Spotify, Andi, da gibt's Sterne, oder?",
      "start": 3413132,
      "end": 3466968,
      "confidence": 0.8405401459854014,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin mega Spotify-Hörer. Ich glaube, der Service, für den ich bezahle und wirklich am meisten nutze. Und ich habe noch nie einen Podcast bewertet. Also ich kann dir gar nicht sagen, ob es da Sterne gibt.",
      "start": 3467008,
      "end": 3478558,
      "confidence": 0.7814324324324325,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie soll man da einen erfolgreichen Podcast rausbringen mit dir? Okay, also ich glaube es gibt Sterne. Ich verwende Pocket Casts. Ist mir einfach viel lieber als Plattform oder als App. Bitte bewertet uns und teilt es auch. Ich glaube teilen ist viel effizienter noch. Also wenn ihr irgendwen in eurem Team, in der Umgebung habt, bitte sendet den Podcast-Link weiter, sofern ihr glaubt, dass wir guten Inhalt machen. Und hoffentlich hören wir uns nächste Woche dann wieder.",
      "start": 3479960,
      "end": 3509328,
      "confidence": 0.7730512820512819,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du brabbelst immer so viel, aber da stimme ich dir zu. Bis zum nächsten Mal. Tschüss. Wie lange hast du für deinen Doktortitel gebraucht?",
      "start": 3509708,
      "end": 3519451,
      "confidence": 0.6642083333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Begrüßend, da ist Michel noch.",
      "start": 3519491,
      "end": 3521852,
      "confidence": 0.6552,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich finde das immer wieder schön, dich hier im Videostream zu sehen.",
      "start": 3521892,
      "end": 3524613,
      "confidence": 0.7335833333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber zurück zu Comment. Oh mein Gott, ich kann halt nicht mehr Deutsch.",
      "start": 3524693,
      "end": 3529255,
      "confidence": 0.5832307692307693,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.780551746382823,
  "audio_duration": 3529.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
