{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/7177e0ff-d168-4fe0-a38f-7e5be23bdde5/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "speech_model": null,
    "id": "0b8a19de-4b80-4455-a886-f267d14dfcb7",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Jeden Morgen, wenn du zur Arbeit gehst, gehst du an den Verhandlungstisch. Du kannst jedes Mal ich glaube, ich bin wichtiger, ich möchte neue Esops haben. Auch wenn manche Chefs vielleicht nicht mögen, wenn ich es sage, aber ich würde jeden dazu einladen, öfter als nötig in solche Verhandlungen zu gehen.",
            "start": 2200,
            "end": 13390,
            "confidence": 0.8931254901960782,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ihr kennt diese Stimme vermutlich schon, wenn auch noch nicht aus dem Engineering Kiosk. Denn Philipp Klöckner aka Pip ist der bekannteste Angel Investor Deutschlands und Co Host des größten deutschen Tech Business Podcast Doppelgänger, in dem er zweimal wöchentlich die Techwelt analysiert. In dieser Episode hilft er uns zu verstehen, was es für uns als Techworker heißt, nicht nur Gehalt, sondern auch Anteile an Startups und Firmen zu bekommen. Obwohl die ganze Thematik recht simpel klingt, kann dies sehr undurchsichtig sein. ESOPs, VSOPs, Cliff Strike Price Options, Exercise Window, Liquidationspräferenz, Verwässerung und und und. Die Buzzword Bingo Karte ist recht schnell voll. Pip bringt einfach mal Licht ins Dunkle. Und nebenbei kommen wir natürlich auch nicht drumherum, zweitausendein ein paar grundlegende Kulturthemen in der startup Welt zu diskutieren. Also los geht's mit Philipp Pip Klöckner. In der heutigen Episode sprechen wir über ein Thema, wo nicht viele Leute gerne drüber reden. Und zwar sprechen wir über Geld und Softwareentwicklerinnen oder beziehungsweise Knowledge Worker im Tech Bereich sind da in einer sehr, sehr komfortablen Situation. Und zwar aus zwei Gründen. Auf der einen Seite sind diese Art von Arbeitnehmern in der Regel sehr gut bezahlt. Und da rede ich nicht nur von USA oder Gehälter im AI Bereich, sondern wenn man 1012 Jahre Berufserfahrung hat, sind sechsstellige Hälter auch in Deutschland möglich. Auf der anderen Seite hat das normale Gehalt in der Regel mehrere Komponenten. Hatten wir in Episode sechs und dreiig gegen Ende von 2022 schon mal darüber gesprochen. Und zwar hat ein klassisches, ich sag mal Software Engineering Gehalt in Deutschland oder in Europa, auch in den USA, in der Regel so vier, vier Bestandteile. Und deswegen nennt man das nicht Gehalt, sondern in der Regel Total Compensation. Und zwar besteht das aus dem Basisgehalt auf einem Bonus, einem jährlichen Bonus, ab und zu noch einem Signing Bonus, wenn man den Arbeitgeber wechselt. Wenn du hier den Vertrag unterschreibst, dann bekommst du noch mal oben drauf oder als vierter Bestandteil geht es um Equity aka Firmenanteile. Und speziell zum letzten Bereich Equity und Firmenanteil, das ist immer so eine so eine komplizierte Geschichte. Und da bin ich sehr, sehr glücklich, dass wir uns dort einen Experten einladen konnten bzw. Angefragt haben. Und ich bin sehr, sehr glücklich, dass dieser Experte uns auch die Einladung gefolgt ist. Und zwar sind Firmenanteile, ich sag mal umgangssprachlich sein täglich. Deswegen herzlich willkommen, Philipp Pip Glöckner.",
            "start": 13430,
            "end": 156244,
            "confidence": 0.8956699752475251,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hallo, ich freue mich sehr, da zu sein.",
            "start": 156332,
            "end": 157444,
            "confidence": 0.96427,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich habe eher so das Gefühl, ich kenne dich sehr gut, weil du wöchentlich auf meinem Ohr bist und deswegen kann ich das nicht für jeden voraussetzen. Und deswegen stelle ich dich ganz kurz vor. Und zwar bist du ursprünglich aus dem Suchmaschinenoptimierungsbereich, aus dem seo Bereich und warst auch mal Produktmanager und CMO bei Idealo. Du bist unter anderem bzw. Warst Search Strategy Berater bei Home 24, food Panda, get your guide. Du hast ein paar Jahre bei Rocket Internet, bei den Sommer Brüdern verbracht, ich sag mal der deutschen Startup Schmiede. Generell hat sich deine berufliche Laufbahn im Businessbereich, im Bereich internationale Marktplätze, vertikale Suchen und ich sag mal Internet Aggregatoren gedreht. Inzwischen bist du Aufsichtsrat bei Homego Angel Investor und Berater für Private Equity Firmen und Venture Capital Fonds. Aber ich denke, die meisten Leute werden dich entweder durch deine Präsenz im Doppelgänger Tech Talk Podcast kennen oder von den Keynotes zum Thema AI auf dem jährlichen OMR Festival. Ist das alles richtig und habe ich irgendwas vergessen?",
            "start": 157492,
            "end": 219956,
            "confidence": 0.8970775438596498,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das war ausnahmslos richtig. Vergessen hast du bestimmt auch was, aber das hätte ich auch. Also es ist tatsächlich so, dass ich immer viele Dinge gleichzeitig mache, um auch möglichst viel zu lernen. Vielen Dank.",
            "start": 220028,
            "end": 231314,
            "confidence": 0.9398357142857142,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also früher warst du erfolgreich und jetzt bist du berühmt auch noch, oder? Durch den Podcast.",
            "start": 231452,
            "end": 235590,
            "confidence": 0.9156406249999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, das ist so ein bisschen lustig eigentlich. Ich will nicht sagen, mein Leben hat sich nicht verändert, aber rein beruflich mache ich das gleiche wie immer. Nur natürlich wird das inzwischen deutlich mehr wahrgenommen. Also ich beschwere mich natürlich nicht darüber, aber es lässt dann auch so ein bisschen hinterfragen, wie man vorher die Welt gesehen hat. Natürlich, man findet ja auch immer selber personenbeeindruckend und man fängt dann viel mehr an zu hinterfragen, was eigentlich dahinter steckt und lernt auch so ein bisschen, dass die spannendsten Leute vielleicht immer noch irgendwo in der Versenkung schlummern und darauf warten, entdeckt zu werden, weil die mediale Aufmerksamkeit dann eben doch viel damit macht.",
            "start": 235750,
            "end": 267582,
            "confidence": 0.9031030973451324,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt bin ich ja auch ein Hörer, der zweimal wöchentlich bei euch dabei ist, weil ihr released ja wirklich zweimal wöchentlich. Also Hut ab mal dafür. Das ist wirklich eine Leistung, das kann ich selber, wie viel Aufwand eigentlich so ein Podcast ist. Aber nachdem ich euch immer lausche, weiß ich ja auch, dass du des Öfteren erwähnt hast bisher bei euch im Podcast, dass du eigentlich, wenn du nochmal die Wahl hättest, vielleicht jetzt was technischeres machen würdest oder eine technischere Ausbildung in irgendeiner Form machen würdest. Jetzt sprichst du deinen Podcast bei uns, wo du wahrscheinlich, würde man sagen, 95 % Tech People irgendwie hast, die jetzt, die jetzt zuhören und die vielleicht auch auf die andere Richtung vielleicht blicken und sagen, diese Business Leute, vielleicht hätte ich eigentlich was mit Business machen sollen, weil das sind eigentlich die, die viel Geld machen und die reich sind. Also was würdest du denen jetzt sagen, dass sie die richtige Entscheidung getroffen haben oder warum würdest du gerne eigentlich mehr technischen Einblick haben oder mehr die technische Richtung gewählt haben?",
            "start": 267726,
            "end": 323446,
            "confidence": 0.8924748333333336,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also ich wäre auf jeden Fall beim Andi, dass der schnellere Weg zu einem sechsstelligen Gehalt im Moment, glaube ich, Entwicklerwerten ist, wäre mein Gefühl oder Entwicklerin. Ich glaube trotzdem, dass der spannendste Bereich ist, ein grundlegendes Verständnis von beiden zu haben. Also entweder super gut in einem zu sein, das kann natürlich auch wertvoll sein, aber mein Vorteil damals bei der Suchmaschinenoptimierung war, dass die meisten Suchmaschinenoptimierer kamen halt aus dem technischen, also entweder vollkommen unausgebildet oder eben mit einem Programmierer oder technischen Hintergrund. Und ich habe so ein bisschen die BWL Denke da mit reingebracht. Also wie identifiziere ich eigentlich spannende Nischen, wie verhandle ich gute Konditionen mit Werbepartnern aus und so. Und ich glaube, Die Kombination von beiden war sehr wertvoll. Und also auch beim doppelgänger Podcast haben wir, glaube ich, viele technische Hörer. Und ich glaube, die hören das, um eben auch die Wirtschaftsseite zu verstehen. Und das würde ich jedem eigentlich ans Herz legen. Also ich finde es wichtig, dass die sogenannten Businessleute verstehen, wie gut das Produktmanagement geht, was eine Datenbank oder API kann und was sie nicht können oder was Limitationen sind, was AI kann und was sie nicht gut kann, sondern beide Seiten sollten einfach voneinander lernen. Ich glaube, das schafft den größten Wert, sowohl in der Zusammenarbeit als auch für die Individuen.",
            "start": 323518,
            "end": 392270,
            "confidence": 0.9179619457013578,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Perfekt, da sind wir jetzt genau dafür da.",
            "start": 392350,
            "end": 394214,
            "confidence": 0.99283875,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, du hast mich gerade als Hörer angesprochen, aber war das gerade eine kleine Hommage an den Studiengang Wirtschaftsinformatik?",
            "start": 394302,
            "end": 400238,
            "confidence": 0.897381,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, auch. Ja, genau. Das ist ja sozusagen diese Symbiose oder Synthese von beidem. Ich glaube, man kann das so ein bisschen fakultativ machen, dass man z.B. sagt, ich studiere schon noch technische Informatik, weil ich z.B. so super tief ins Thema Deep learning gehen will oder so. Und dann besuche ich einfach ein paar andere BWL Kurse oder VWL Kurse oder Hör und Podcast. Ich glaube, das Interesse ist wichtiger als ich finde es immer gefährlich, so den Eindruck zu erwecken, dass den richtigen Studiengang wählen, dass das so wichtig wäre. Ich glaube, es ist viel wichtiger, sich für andere Themen zu interessieren, breites Interesse, viel Neugier zu haben. Aber natürlich so auf dem Papier wäre Wirtschaftsinformatik natürlich die beste Kombination aus beiden. Aber man könnte auch argumentieren, so, man hat dann vielleicht nicht die beste BWL Ausbildung und gleichzeitig auch nicht die beste Informatikausbildung. Also vielleicht doch am Anfang für sozusagen in anführungsstrichen Premium Studiengang entscheiden und dann das andere dazulernen. Könnte ich mir vorstellen, dass das sogar zu einem besseren Ergebnis kommt.",
            "start": 400334,
            "end": 450276,
            "confidence": 0.8986643428571431,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi probiert nur immer eine Bestätigung zu finden, warum er Wirtschaftsinformatiker leider nicht von mir.",
            "start": 450348,
            "end": 455600,
            "confidence": 0.9151326666666667,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich stimme dir zu, ich bin nicht der beste Informatiker, ich bin auch nicht der beste bwler oder VWLer. Auf der anderen Seite, wenn man jetzt damit anfängt, hat man natürlich ein Delay von dreieinhalb oder drei Jahren bis zum Bachelor und dann vielleicht noch den Master und allem drum und dran. Und ob die ganze Sache noch so eine hohe Relevanz in drei bis fünf Jahren hat, wie sie jetzt gerade ist, weiß ich jetzt auch nicht. Kann wirklich sagen, wirklich irrelevant, aber fastest pace zu einem sechsstelligen halt. Keine Ahnung, ob man da was darauf optimieren sollte.",
            "start": 456220,
            "end": 478648,
            "confidence": 0.9209885858585857,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube, deswegen ist so die Grundneugier und das ständige Weiterlernen auch so wichtig. Früher, wenn wir Leute fürs Online Marketing oder Suchmaschinenoptimierung eingestellt haben, habe ich immer gesagt, ich will gar keine Leute mit 10 Jahren Berufserfahrung, weil die Berufserfahrung ist ja längst veraltet oder das Wissen von damals. Die Gefahr, dass du jemand mit veralteten Wissen und veralteten Ansichten auch heierst, war viel größer tatsächlich. Das ist so ein bisschen, als wenn du zum Zeitungskiosk gehst und sagst ich hätte gerne die Zeitung von gestern und würde gern doppelt so viel dafür bezahlen. Das würde ja kein Mensch machen machen. Du brauchst halt das aktuellste Wissen und du brauchst vor allen Dingen Menschen, die bereit sind, sozusagen auch morgen und übermorgen ihr Wissen zu erneuern. Deswegen natürlich hilft beim programmieren Berufserfahrung einfach weil man viel lernen, viel gesehen hat, schon auch mit. Aber prinzipiell finde ich Potenzial und Neugier wichtiger als Erfahrung.",
            "start": 478784,
            "end": 523628,
            "confidence": 0.8999342857142865,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Lass uns mal ganz kurz zum Thema, nicht ganz kurz, sondern für den Rest des Podcasts natürlich zum Thema Equity bzw. Firmenanteile als Anteil vom Gehalt sprechen. Meine erste Frage wäre eigentlich, warum ist das überhaupt relevant? Aus Arbeitgeber oder aus Arbeitnehmer sich? Also ich meine, warum schwappt das jetzt irgendwie aus Amerika rüber nach Deutschland oder beziehungsweise warum machen Unternehmen das überhaupt, Firmenanteile abzugeben? Denn ich sage mal, das ganze Risiko ist ja bei den Gründern und Co. In der Regel. Warum hat das überhaupt eine Relevanz?",
            "start": 523684,
            "end": 550996,
            "confidence": 0.8957790909090909,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, also ein einfacher Nebeneffekt wäre, man spart dadurch Geld. Also Start ups sind immer klamm natürlich und man kann mit Firmenanteilen statt Geld bezahlen, aber das ist glaube ich nicht das wichtigste. Worum es eigentlich geht, ist die Ziele oder Incentives, wie man so schön sagt, die Anreize, wird man im Deutschen sagen, der beiden Parteien zu allein noch ein schlimmes englisches Wort, also gleichzurichten. Es geht darum, dass man sicherstellt, dass das Personal in die gleiche Richtung arbeitet, die gleichen Anreize hat wie andere Shareholder, unter anderem die Gründer oder Gründerinnen, aber auch die Investoren. Wenn wir alle die gleiche Share Klasse besitzen oder die gleichen Anteile, die gleiche Familie von Anteilen, dann kann man davon ausgehen, dass wir in die gleiche Richtung arbeiten, dass niemand irgendwelche privaten Ziele verfolgt, z.b. dass jemand sagt so, ich pimmel hier eigentlich nur meine Zeit ab, weil ich ein hohes Fixgehalt habe oder so. Sondern man weiß so, jeder ist ein bisschen im Risiko, es geht für alle um was. Wenn das unheimlich erfolgreich wird, das hat nach oben hin eine starke Motivationsfunktion, wenn es unheimlich erfolgreich wird, dann werden auch die Erstangestellten oft Millionäre oder ist zumindest theoretisch möglich, passiert auch relativ oft bei zumindest Unicorn Exits. Nach unten hin spart man sich halt tatsächlich auch ein bisschen Geld, was für ein Startup auch wichtig ist, zweitausendein, es hat vielleicht auch eine ganz wichtige, ohne jetzt vorzugreifen, aber so eine vor Selektionsfunktion, also Menschen, die zustimmen ich bin bereit auf ein bisschen Fixgehalt zu verzichten und möchte dafür meine Upside, bin bereit mehr Risiko einzugehen. Das sind vielleicht auch Menschen, die mehr zu einer startup Kultur passen. Und da merkt man schon, dass diese ESOP, VSOP Strukturen oder Mitarbeiteroptionsstrukturen sind natürlich vor allen Dingen geeignet für junge Firmen als Start ups und Wachstumsunternehmen. In Konzernen gibt es schon auch andere Mitarbeiterbeteiligungsprogramme in der Regel, aber diese virtuellen Optionen oder Mitarbeiteroptionen, das kommt so ein bisschen aus der anglo amerikanischen Welt, ist zumindest in der startup Szene nicht ganz unüblich, aber es verbreitet sich noch immer mehr, kann man bestimmt sagen.",
            "start": 551068,
            "end": 662586,
            "confidence": 0.9178057714285712,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt sagtest du, okay, dadurch können, ich sag mal, junge Unternehmen auch Geld sparen, aber das Geld sparen ist ja eigentlich nur delayed, oder? Ich meine, du zahlst es nicht bei der Einstellung, sondern halt später. Klar, im Erfolgsfall oder wenn wenn man irgendwie, weiß ich nicht, public gegangen ist oder aufgekauft wird, aber ÿousand im Endeffekt hat der Gründer oder die Person, die Anteile hat, ja dann weniger, ich sag mal cash out, oder?",
            "start": 662778,
            "end": 684432,
            "confidence": 0.910466933333333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, es hat einen also einen kurzfristigen liquiditätsschonenden Effekt. Könnte, könnte man sagen. Langfristig im Erfolgsfall kostet in Anführungsstrichen, kostet das natürlich viel mehr, aber man geht davon aus, dass dann auch alle so glücklich sind, dass man das eigentlich niemand mehr das bereut so. Aber ich würde auch sagen, dass der Kostenaspekt meiner Meinung nach nicht der der wichtigste Aspekt ist. Man kann darüber argumentieren, einerseits gibt man den ersten Mitarbeitern ja oft zu Mitarbeiteraktien, aber dann, wenn ich vielleicht auch noch mal einen richtig guten Produktmanager, Produktmanagerin holen will oder eine sehr talentierte CFO oder Head of HR vielleicht von einer anderen Firma abwerben, dann schnürt man oft auch noch mal so Pakete und das sind da ja manchmal Leute, die irgendwie eine Viertelmillion im Jahr kosten oder so. Wenn wenn ich rede jetzt über Wachstumsunternehmen, die wirklich große Ambition haben und dann kann so ein breiteres Compensation Package, was halt Anteile an Unternehmen beinhaltet, natürlich auch noch mal wichtiger wird, weil die die wenigsten starles erwachsen unternehmen wollen hohe sechsstellige Gehälter zahlen.",
            "start": 684576,
            "end": 741772,
            "confidence": 0.9010388571428573,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also jetzt hast du schon gesagt, es hat so Einzug gehalten, du hast jetzt sicher einen besseren Blick auf die ganze Industrie. Wie weit ist es jetzt schon üblich im deutschsprachigen Raum würde ich mal sagen, also ich habe auch in Holland eine Zeit gelebt, da war das sehr, sehr üblich, eigentlich bei allen Startups. Jetzt in Deutschland machen das jetzt 100 % der Startups schon, dass die irgendwie ihre ersten Developer oder so wirklich schon mit Shares ausstatten.",
            "start": 741796,
            "end": 765186,
            "confidence": 0.8841694936708863,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, das kommt so ein bisschen darauf an, wie man Startup definiert. Wenn man Startup jetzt jedes jung gegründete Technologieunternehmen oder so ein hypothetische Technologieunternehmen nimmt, dann vielleicht nicht. Wenn wir aber das insoweit begrenzen, dass wir sagen, wir reden über Start ups, die mindestens einen professionellen Investor haben, also einen prominenten Business Angel oder ein early Stage VC Fund oder vielleicht sogar schon eine zweite Runde abgeschlossen haben. Ich würde sagen, da ist es in mindestens 80, wenn nicht 90 % der Fall, dass man eigentlich mit der ersten Finanzierungsrunde, also selbst wenn die Gründer oder die ersten Mitarbeiter das noch nicht vorgesehen haben, dann ist es im Zweifel, würde ich behaupten, der erste Investor oder Investorin, die dann sagt, wir müssen eigentlich jetzt mal 10 % des Cap Tables, also der Gesellschafterliste reservieren für zukünftige HiRes Mitarbeiter Einstellungen. Die werden höchstwahrscheinlich nach Beteiligung fragen und deswegen reservieren wir jetzt schon mal innerhalb dieser Beteiligungsrunde im Shareholder agreement, im Vertrag zwischen den Gesellschaftern, reservieren wir eigentlich schon shares dafür, weil wir wissen, wir werden die brauchen. Wenn für den Fall, dass die Firma erfolgreich ist, werden wir noch besseres Personal brauchen. Und also in dem Moment, wo man einen Venture Capital Investor hat, würde ich sagen, in mehr als 80 % der Fälle wird es auch irgendeine Art von Mitarbeiteroption geben. Dann kann man natürlich noch unterscheiden, es gibt Unternehmen, die geben z.B. allen Mitarbeitern, auch dem Office Manager oder der HR Abteilung, der Finance Abteilung zumindest einige Shares. Es gibt welche, die machen das wirklich nur für sehr frühes oder sehr in der Hierarchie sehr weit oben liegendes Personal. Da gibt es bei der Ausgestaltung natürlich viele Wege, aber ich würde sagen, in professionell finanzierten Startups, Ÿousand ist es eher die Regel als die Ausnahme heutzutage. Ich würde denken, in ganz Europa auf jeden Fall im Dachraum und Benelux Raum, wie du sagst, in Frankreich sicherlich auch.",
            "start": 765268,
            "end": 865346,
            "confidence": 0.9183416927899692,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wenn du jetzt als Angel so einen Tipp gibst, dann gibst du den Tipp, weil man einfach sonst gar keine Leute mehr finden würde? Oder was ist der Hintergrund davon?",
            "start": 865378,
            "end": 874298,
            "confidence": 0.9498183333333333,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, dass die besten Leute das so ein bisschen erwarten tatsächlich schon, dass sie an der Upside beteiligt werden. Also man möchte sich sicherlich nicht irgendwie oberhalb von Euro dann mit Fixgehältern überbieten, sondern das Spannendste ist natürlich, ich muss ja sowieso meine Vision als Gründer, jetzt aus Sicht der Gründer oder Gründerin, ich muss meine Vision dem Mitarbeiter oder Mitarbeiterin ja sowieso verkaufen. Und wenn ich schaffe, dass diese Mitarbeiterin daran glaubt an meine Firma, dann kann es ja auch ganz spannend sein, wenn sie daran beteiligt wird. Das ist die eine Sache. Und die andere, ich glaube wirklich sehr an dieses Alignment, dass man weiß, wir haben beide so ein bisschen noch nicht alles im Trockenen, sondern wir unterliegen beide noch Risiken. Dahinter ist natürlich die Hoffnung, dass die Mitarbeiter auch härter arbeiten, länger arbeiten, mal nicht auf die Uhr gucken, wenn Freitag irgendwas kaputt geht, länger im Büro bleiben oder so. Ich glaube, das ist natürlich so ein bisschen die implizite Begründung dahinter, dass man auch mehr unternehmerisches Handeln versucht zu ermöglichen oder zu befördern, dadurch, dass man die Mitarbeiter ja letztlich zu Unternehmern macht. Ich sehe das immer aus zwei Perspektiven, also drei einerseits gibt es die Perspektive der Gründer, die Perspektive der Mitarbeiter. Und ich habe ja meine zweitausendein Karriere als Investor auch als ein sogenannter Broke Angel angefangen. Also Broke Angel heißt mittelloser Angel Investor quasi oder pleite Angel Investor, weil ich habe für die erste Zeit, insbesondere als ich mit Rocket Internet gearbeitet, ganz oft einfach meine Zeit investiert und dafür Beteiligung bekommen. Ich wollte das auch genauso, also ich wollte nicht irgendwie Fixgehälter haben, die sind in der Beratung meiner Meinung nach sowieso viel zu klein, sondern ich wollte mich als Unternehmer fühlen. Ich wollte, wenn das klappt und wenn ich einen positiven Impact auf die Firma habe, dann wollte ich zweitausendein daran partizipieren, dann wollte ich zumindest die rechnerische Chance haben, dadurch millionär zu werden z.B. und es hat letztlich dann auch bei zwei, drei Firmen so funktioniert und ich glaube das ist natürlich, was man auch aus Gründerperspektive dann wieder so ein bisschen sucht. Man sucht Menschen, die unternehmerisch denken, die mal die Extrameile gehen, die bereit sind Risiken einzugehen. Das ist glaube ich einer der Gedanken, die man zumindest im Hinterkopf hat, wenn man versucht solche Mitarbeiterbeteiligungsstrukturen zu schaffen.",
            "start": 874394,
            "end": 993358,
            "confidence": 0.9287837595907925,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber funktioniert es deiner Erfahrung nach auch in der Maße zumindest? Weil ich kann mich schon auch erinnern, dass es eigentlich viele Leute gibt, gegeben haben, die haben Aktienpakete bekommen, aber die werden am Freitagabend doch nicht geblieben, wenn wenn es nicht ausgemacht gewesen wäre, weil die einfach sagen, das gehört dazu, die Aktien gehören dazu und ich habe trotzdem einen Nine to five Job.",
            "start": 993454,
            "end": 1010994,
            "confidence": 0.8879047692307691,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, das ist eine hervorragende Frage. Meine Erfahrung ist, das ist jetzt ein bisschen schwarz weiß, wie ich das beschreibe, aber insbesondere z.B. mit Entwicklern und Entwicklerinnen habe ich viele Menschen erlebt, die überhaupt nicht auf ESOPs positiv reagieren, selbst auf Boni positiv. Bei einer Firma, ich sage jetzt nicht welches ist, aber bei einer Firma, wo ich mal gearbeitet habe, wurde es gang und gäbe, dass wir jedes Jahr, also ich würde sagen fast 1/3 des Gehaltes als Bonus, als freiwilligen Bonus ausgezahlt haben und dass man auch sehr gut damit rechnen konnte, dass dieser Bonus jedes Jahr eigentlich um 1020 % steigt und das Fixgehalt aber auch und trotzdem haben Menschen, also die haben am Ende wirklich einen mittleren fünfstelligen Weihnachtsscheck ernsthaftes Geld und viele haben aber gesagt, ich hätte lieber 1500 mehr fix gehalt und ich habe das also als unternehmerisch denkender Mensch habe ich es überhaupt nicht verstanden. Also ich dachte so vertrauen die uns eigentlich nicht und das war so nach nachdem man vier Jahre diesen Bonus bekommen haben, jetzt auch nicht so, dass man sich fühlen musste, wie wenn ich jetzt mal irgendwie einen Messer klaue aus der Firma, dann kriege ich den nicht mehr. Also ich konnte es sehr schwer nachvollziehen, wie jemand irgendwie Euro liegen lässt, damit er oder mehr Fixgehalt bekommt. Also es gibt ja den Unterschied zwischen Risikoaversion und Risikoliebhaberei oder Risk Lover sagt man im Englischen und diese Incentivierungsmechanismen funktionieren natürlich vor allen Dingen für Menschen, die mit Risiko leben können, die vielleicht auch noch keine Familie haben. Risiko muss man sich auch leisten können, fairerweise. Es gibt einfach Menschen, die können diese Schwankungen gar nicht akzeptieren, weil sie wirklich vielleicht ein Haus finanzieren und dann möchte man vielleicht nicht so viel Risiko haben. Und deswegen muss man vielleicht überlegen, ob man da gar nicht so generalistische Regelungen trifft aus Unternehmersicht, sondern man muss eigentlich für jeden Mitarbeiter so das finden, was ihn am meisten motiviert oder womit er sich auch am sichersten fühlt im Job. Und was ich definitiv gesehen habe, dass Leute quasi vollkommen, also ob es irrational ist oder nicht, muss man entscheiden, aber rein, ich sage jetzt mal rein rechnerisch falsch entschieden haben, also ein deutlich besseres Paket abgelehnt haben, zweitausendein, nur um mehr Sicherheit zu bekommen. Das lässt sich so mit behavioral Finance inzwischen alles erklären, warum das so ist. So Kahnemann und so haben da ja geforscht, warum man das gerne so nimmt. Aber rein Logisch hat es oft keinen Sinn gemacht, weil ein Bonus ist ja schon ein relativ hohes Versprechen, dass er kommt. Bei eSOPs kann man sagen, das unterliegt natürlich wirklich hohem Risiko und dafür muss man auch so ein bisschen gemacht sein. Aber die Frage muss man sich schon stellen. Und wenn man das Risiko nicht möchte, dann ist es. Dann darf man aber eigentlich auch in einem Startup oder Wachstumsunternehmen fast nicht arbeiten, würde ich sagen, weil das Risiko, dass man da innerhalb von zwei Jahren seinen Job verliert, ist ja immer signifikant groß.",
            "start": 1011082,
            "end": 1155790,
            "confidence": 0.9111831620553359,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Na, gefällt dir diese Episode? Wir haben noch weitere 100 Dreiig Episoden mit Tech Content und dabei schwingt immer eine Sache mit. Wir glauben, dass Technik zwar kompliziert ist, aber grundlegend ein gelöstes Problem. Die wahre Herausforderung ist alles drumherum, vor allem die Menschen, Teams und Umgebungen. Daher haben wir nicht nur technische Episoden, wo wir bis auf die Grundlagen wie Komplexität von Algorithmen in Episode 28 gehen oder uns die Story hinter der container Technologie Docker anschauen wie in Episode 46, sondern wir beschäftigen uns auch ganz viel mit nichttechnischen Themen. Z.b. besprechen wir in Episode 127 mit einer Psychologin das weit verbreitete Impostor Syndrom oder in Episode fünf, ob Entwicklerinnen sich für einen Weg zum Teamlead entscheiden sollten. Am besten abonnieren und scrollt einmal durch unseren Fundus an einem doch sehr breiten und nicht nur technischen lastigen Themenspektrum. Link findest du in den Shownotes oder unter engineeringkiosk dev. Viel Spaß. Was esops sind, da kommen wir gleich zu. Ich habe noch eine Frage zum Thema Risiko, weil das ist schon sehr oft gefallen. Meine Frage ist eher, gibt es da überhaupt ein Risiko? Ich meine, du kriegst ja ein Fixgehalt. Ja, du sagtest natürlich schon, klar, für einen gewissen Teil von Anteilen, ich sag mal, ist das Basisgehalt minimal niedriger oder ein bisschen niedriger, aber ich sag mal, im Vergleich zur zur deutschen Gesellschaft ist es ja schon weit über dem, ich sag mal arithmetischen Mittel oder ähnliches, was was ich sag mal, die Bundesbevölkerung verdient. Deswegen die Frage, gibt es da eigentlich so ein Risiko oder ist es eher eigentlich das, ich sag mal Ms. Out von der Opportunity, die man haben kann?",
            "start": 1156770,
            "end": 1247440,
            "confidence": 0.8961656521739124,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, also ich würde sagen, das echte Risiko hält sich in Grenzen. Also wenn man calculated Risk Taker ist, dann muss man das eigentlich gut finden, dass das Modell, wie du richtig sagst, man verzichtet in der Regel auf wenig Fixgehalt. Also ist ja nicht so, dass man statt für dann für arbeitet und den Rest in esops bekommt, sondern es ist eher so, statt 120 bekommt man 105, dafür bekommt man aber irgendwie jedes Jahr noch mal. Von daher ist das Risiko niedrig. Ich glaube, prinzipiell muss man schon sagen, ein Startups Wachstumsunternehmen ist das Risiko, dass der Job mal verloren gehen kann, auch ohne das Wollen des Startups, einfach weil sich die Marktkonditionen auch mal drehen oder so. Das ist signifikant. Aber auch da habe ich das Gefühl, dass Entwickler und Entwicklerinnen jetzt nicht längere Zeit auf dem Arbeitsamt verbringen. In der Regel, wenn das passiert und es gibt einen, es gibt immer noch seltene so Ÿousand Edge Fälle, je nachdem aber auch wie gut Firmen die Programme einrichten, die Mitarbeiterbeteiligungsprogramme. Es gibt gewisse Konstellationen, wo man wirklich Aktien oder Optionen zugeteilt bekommt und dann unter sehr adversen Umständen die Steuerschuld daraus größer werden kann, als der Benefit, den man bekommen hat. Das ist mal bei Klarna passiert, das passiert eher selten und auch das lässt sich größtenteils auch verhindern, wenn man die Programme schlau strukturiert. Also wir sind alle keine Anwälte hier und keine Steuerberater, aber man kann diese Risiken auf jeden Fall begrenzen. Ich würde sagen, prinzipiell ist es ein einigermaßen risikoloses Instrument, sondern es ist eher so die Kirsche auf einer Torte, dass wenn wirklich alles funktioniert, dann ist die die Kirsche sogar viel größer als die Torte in der Regel. Aber wenn die fehlt, schmeckt die Torte halt am Ende trotzdem. In der Regel ist man nicht unter die Armutsgrenze gefallen.",
            "start": 1247520,
            "end": 1341320,
            "confidence": 0.9247387296416927,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Schön, schön, schön gesagt. Lass uns mal in die Sektion Equity explained gehen. Und zwar hattest du gerade schon einen Begriff genannt, ESOP. Und ich stelle mir halt die Frage, okay, bei deutschen Unternehmen in der Regel vielleicht noch keinen, noch keine AG ist es meist, ich sag mal eine GmbH Gesellschaft mit Beschränkung Haftung. Und wie sehen die Modelle und Strukturen von den Firmenanteilen eigentlich aus? Weil immer wenn ich daran nach google, dann kommen mir so Begriffe wie Stock Options, RSUs, sogenannte Restricted Stock Units im europäischen Bereich ESOP, VSOP. Kannst du mal ganz kurz erklären, wie das eigentlich irgendwie von so einer Firma, wie man da, ich sag mal Anteile rausschneiden kann und ohne zum Notar zu gehen und also wie funktioniert das Ÿousand?",
            "start": 1341620,
            "end": 1379150,
            "confidence": 0.8862414960629926,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, was du gerade genannt hast, sind die drei gängigsten Optionen schon die RSU, ESOPs und VSOPs. Prinzipiell sind das alles Mitarbeiterbeteiligungsprogramme. Es geht darum, Mitarbeiter so zu stellen, als wären sie Shareholder, also Miteigentumer oder Gesellschafter an einer Firma. Esops, das steht für Employees Stock Option Program und was wichtig ist zu verstehen, viele fragen so, wie verhandle ich das denn, wie mache ich den Vertrag und so weiter. Und in der Regel handelt sich und das sagt das PIA schon, es ist ein Employee Stock Option Programm. Es gibt einen breiten Vertrag, unter dem diese Stock Options gewährt werden und dann gibt es so Subscription Letters, ich erkläre gleich, wie das funktioniert, wo dann jeder einzelne Mitarbeiter und Mitarbeiterin ihre Anteile bekommen und wo die Konditionen vielleicht noch mal drinstehen, sofern sie abweichen. Aber prinzipiell räumt man in der Regel mit jeder Finanzierungsrunde oder bei der Gründung des Unternehmens so einen gewissen Pool an Optionen frei. Also man sagt, wir möchten 10 % unserer Anteile reservieren für Mitarbeiteroptionen. Dann macht man ein Programm, da steht z.B. drin, was die das sogenannte Ausübungspreis ist, der strike Preis, kommen wir vielleicht gleich noch drauf. Einfach gesagt, da stehen die Konditionen dieses Programms drin und dann unterschreiben Mitarbeiter nur noch, dass sie dabei sind und bekommen Optionen gewährt sozusagen von der Firma über diese Subscription Letter. Das ist eigentlich in allen Fällen sehr ähnlich. Der Unterschied zwischen ESOP und VSOP ist in dem ESOP Programm, also Employee Stock Option Program, ist es so, dass ich tatsächliche Optionen bekomme, um Anteile an der Firma zu besitzen später. Das heißt, ich kann diese Option ausüben und die Ausübung meint in dem Fall, ich kaufe zu einem vorher bestimmten Preis, der kann z.B. sehr niedrig sein, in der Regel würde man denken, ist der niedriger als der spätere Preis, damit eben finanzieller Vorteil entsteht auch. Also ähnlich wie bei Aktienoptionen kaufe ich zu einem vorher vereinbarten Preis, der niedriger ist als der derzeitige, ein Anteil an der Firma und besitze dann einen Anteil, der viel wertvoller ist auf einmal und kann den dann entweder veräußern oder auch nicht. Und da gibt es immer gewisse Restriktionen noch. Aber dadurch entsteht quasi der Wert, dass ich das Vorkaufsrecht auf einen Anteil an der Firma habe, zu einem sehr, sehr günstigen Preis, nämlich z.B. dem Preis bei Gründung oder bei der ersten Finanzierungsrunde. Und wenn später bei einem IPO oder so, wenn die Firma an die Börse geht, ist das Delta zwischen dem Vorkaufsrecht und dem dann erreichten Endpreis natürlich unheimlich groß und dadurch entsteht ein sehr hoher Wert. Und bei dem VSOP oder v ISOP Programm, das meint einfach nur Virtual Employee Stock Option Program, und zwar virtual, weil ich nicht sozusagen die physischen Anteile oder die wirklichen Anteile im Handelsregister, physisch sind ja gar nicht, aber nicht die Anteile im Handelsregister erwerbe, sondern einfach gesagt werde ich so gestellt finanziell, als wäre ich ein Shareholder. Das heißt, es ist genau genommen ein schuldrechtliches Verhältnis. Also die Firma schuldet mir die Differenz, ich werde niemals einen Anteil an der Firma besitzen, aber die Firma schuldet mir immer, oder der gesamte Gesellschafterkreis, das ist ja die Firma schuldet mir immer die Differenz so zu dem Ausübungspreis, als hätte ich diese Aktien besessen oder diese Option besessen. Also man virtualisiert das. Der hauptgrosse Unterschied ist, dass man keine Stimmrechte hat, weil man die Aktien oder Anteil ja nicht besitzt, sondern nur den finanziellen Vorteil. Also ich bekomme alle Finanzströme, die ich vorher auch bekommen hätte, ich habe aber nicht die Stimmrechte.",
            "start": 1379260,
            "end": 1567484,
            "confidence": 0.9195729510961214,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Bezüglich der Stimmrechte, da habe ich mir bei deiner Erklärung zu ESOPs gefragt, wenn ich die Option habe und verwirkliche, bin ich dann stiller Gesellschafter der GmbH, weil ich dann reale Firmenanteile kriege?",
            "start": 1567532,
            "end": 1579300,
            "confidence": 0.932010909090909,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn du sie ausübst, also wenn du sie sozusagen ziehst, die Option, dann wirst du zum Teilhaber der Firma, zum Gesellschafter und dann hättest du auch die Stimmrechte. Genau, solange aber du nur Optionen besitzt, hast du nach meinem Verständnis noch kein Wahlrecht quasi bei irgendwelchen Gesellschafter oder so.",
            "start": 1579420,
            "end": 1595192,
            "confidence": 0.8886489795918365,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und wie sieht das dann in der Praxis aus? Gehen dann die Geschäftsführer in der Regel, widmen die dann die Firma später zu einer AG um und gehen dann an eine Börse damit? Weil ich meine, wenn jeder Mitarbeiter, der ESOP hat, dann wirkliche Stimmrechte hat, dann ist es ja schon sportlich mit Entscheidungsfindung.",
            "start": 1595336,
            "end": 1610872,
            "confidence": 0.9347412962962961,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, also in der Regel sind die ESOP Pools aus verschiedenen Runden, es kommen jede Runde manchmal noch neue dazu, repräsentieren vielleicht 10 bis 20 % der gesamten Unternehmung. Theoretisch hätten die wie gesagt schon, sobald man an der Börse ist egal, dann hat man ja tausende und zehntausende von verschiedenen Schäden Shareholdern. Davor ist es eher so, dass die ESOPs eigentlich relativ spät in der Regel ausgeübt werden, also vielleicht kurz vor einem Liquiditätsevent, also von einem Verkauf oder IPO oder erst im Moment des IPOs wird es oft umgewandelt. Wenn man die Firma z.B. für einen Börsengang in die AG umwandelt, dann wird das ESOP Programm auch noch mal umgewandelt, weil vielleicht die Bezugsrechte sich verändert, also dass ich nicht eine, sondern 100 Aktien für jede Option bekomme oder so. Das regelt aber in der Regel alles die die Firma. Da muss man als Mitarbeiter nicht so stark dran arbeiten. Dann haben wir noch die RSUs, das gibt es in Deutschland ist es, ich würde sagen, eher unüblich. Das machen oft die, wenn jemand aus einer Zuhörerschaft bei Google oder Amazon arbeitet, die werden das vielleicht kennen. Das sind sogenannte Restricted Stock Units. Das sind wie gesagt auch mit Mitarbeiterbeteiligungsprogramm restricted, weil man diese Aktien erst so nach und nach bekommt, wie auch bei ESOPs in der Regel. Das sind letztlich echte Aktien, die man bekommt, inklusive Stimmrechte, vollwertige Aktien. Mit dem einzigen Unterschied, dass sie insofern restricted sind, dass sie erst nach und nach zugeteilt werden. Man unterschreibt meistens, wenn man einen Vertrag unterschreibt, schon wie viele Aktien man über die nächsten vier bis fünf Jahre bekommt und ein Teil dieser Aktien sind halt immer restricted und ein Teil wird zugeteilt. Jedes und die Anzahl der restricted werden quasi immer weniger dadurch.",
            "start": 1610936,
            "end": 1700882,
            "confidence": 0.9141362372881361,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das bedeutet, das gilt dann nur für Public Firmen bereits.",
            "start": 1700946,
            "end": 1703442,
            "confidence": 0.93503,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sobald man eine AG ist, kann man das glaube ich machen. Also man muss zumindest wahrscheinlich eine AG sein. Ich würde sagen, in den üblichsten Fällen sind es amerikanische Public Firmen, die RSUs nutzen statt es absolut.",
            "start": 1703506,
            "end": 1713554,
            "confidence": 0.8924716216216216,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich kenne das eigentlich auch primär von Firmen, die entweder wo die Mutter irgendwo in Amerika ist oder halt bei solchen wie Salesforce, die natürlich extrem viele Leute in Deutschland haben oder Subfirmen, die sie aufgekauft haben oder halt deutsche Firmen, die aber dann vielleicht an einer amerikanischen Börse oder so gehandelt werden.",
            "start": 1713562,
            "end": 1729502,
            "confidence": 0.9227243396226414,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vorteil ist hier noch mal, dass die RSUs sofort liquide sind in der Regel. Also ich kann die sofort auch wieder verkaufen, z.B. um der Steuerschuld nachzukommen oder einfach weil ich es nutzen will. Ich kenne durchaus Leute, die also wenn man früh bei Google oder Amazon eingestiegen ist, ist, dann hat man irgendwann wirklich Millionen von Euros an diesen RSIUs und das also selbst man nebenbei noch einen Sparplan hat oder ein Sparbuch, dann ist das einfach ein sehr großes Klumpenrisiko. Das möchte der Arbeitgeber natürlich auch, dass man umso stärker ist ja die Motivation auch. Aber die sind quasi so liquide, dass ich die auch entweder zu regelmäßigen Zeitpunkten oder sogar an jedem Handelstag wieder verkaufen kann. Das ist bei es abs noch mal ein bisschen anders. Die Es abs kann ich ja nicht frei handeln. Also die die die Stock Options, das sind ja erstmal nur Optionen innerhalb Vertragsbeziehung zwischen dem Unternehmen und mir. Die kann ich nicht so ohne weiteres in der Regel an dritten anbieten oder so weiter.",
            "start": 1729646,
            "end": 1778610,
            "confidence": 0.9119167052023118,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was sind in dem Bereich auch oft jetzt eigentlich gehört habe, ist das Firmen teilweise anbieten, wie viele Anteile du als RSUs bekommst und wie groß dein Anteil cash ist. Also bei so Firmen wie Spotify, Shopify, ich glaube in dem Fall, die verwechselt man ja gerne. In dem Fall bieten es beide an. Also dass die Mitarbeiter wirklich sagen, okay ich will so und so viel % von meinem Gehalt, also ich bekomme irgendwie einen Block sozusagen total compensation und ich selber kann dann wählen, okay so viel % will ich in Rsius und so viel % in Cash.",
            "start": 1778770,
            "end": 1810270,
            "confidence": 0.8764314999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja man hat natürlich dabei so ein bisschen im Hinterkopf beobachtet jemand diese Entscheidung und wirklich als nicht committed, wenn ich immer Geld nehme statt Aktien. Also die die Angst könnte ich verstehen. Ich glaube, dass bei Unternehmen die so groß sind, die Gefahr gar nicht so groß ist, dass das passiert. Aus Unternehmenssicht ist es natürlich wieder liquiditätsschonend. Also vom operativen Ergebnis wird beides gleich behandelt. Also egal ob ob ich meine Mitarbeiter in Aktien oder in Geld bezahle sozusagen im im Income Statement, das man für die Börse vorbereitet, sieht das erstmal gleich aus. Aber das eine ist eben aus Kapitalfluss Sicht Cash schonend. Also wenn ich mit Aktien bezahle und wenn ich in Cash bezahle, dann sieht man sieht das Cashflow Statement eben noch mal anders aus. Das aus Unternehmenssicht, aus Mitarbeitersicht kommt es wirklich auf die eigenen Präferenzen ein bisschen an. Steuerlich wird es glaube ich in Deutschland gleich behandelt.",
            "start": 1810390,
            "end": 1858498,
            "confidence": 0.9105777272727269,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das heißt du würdest dann auf, wenn es ginge auf 100 % der Aktien gehen oder oder ein Großteil zumindest. 100 % geht glaube ich sowieso nie.",
            "start": 1858554,
            "end": 1866234,
            "confidence": 0.8797859259259257,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber ja Frage ist, ob Firmen das eventuell manchmal noch incentivieren sogar, dass sie sagen bei den Aktien geben wir dir noch mal einen Discount oder so. Das ist so bei den größeren Mitarbeiterprogrammen manchmal der Fall und es hängt natürlich davon ab am Ende, ob man an die Firma glaubt oder ob man eine bessere Verwendung für das Geld hat. So wenn ich sowieso ein anderes Unternehmen investieren möchte, mein Portfolio irgendwie verbreitern, dann will man vielleicht irgendwann auch zumindest die Hälfte oder so in cash haben. Das kommt, glaube ich, sehr auf die individuelle Situation an. Ich würde, weiß nicht, ob es da jetzt eine generelle Regelung gibt, weil wenn.",
            "start": 1866282,
            "end": 1895558,
            "confidence": 0.9054702678571431,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich das richtig verstehe, dann wette ich ja schon drauf, dass die Firma besser performt als der Markt.",
            "start": 1895574,
            "end": 1900574,
            "confidence": 0.9320805555555555,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, man könnte sagen, meine Opportunitätskosten sind, ich würde das Geld ansonsten in den MSCI World oder S P 500 Sparplan packen. Das ist sozusagen der risikolose oder fast oder risikoarme Alternative und die bringt irgendwie sieben bis 10 % im Jahr. Und wenn ich stattdessen die Aktien meines Unternehmens nehme, muss ich eigentlich glauben, dass die zweistellige Aktien gewinne. Ansonsten soll ich das nicht tun. Also wenn ich nicht glaube, dass die Firma zweistellig sozusagen im Kurs wächst, mehr als 10, %, dann bin ich vielleicht besser beraten, das Geld woanders anzulegen. Und wie gesagt, die Risikoverteilung oder Diversifizierung spielt ja auch noch eine Rolle. Man muss wirklich aufpassen, dass man nicht zu viel in einem Korb hat. Auch wenn ich es immer gut finde, wenn Unternehmen, also wenn man sagen, sehr unternehmerisch nah an dem Arbeitgeber zweitausendein sozusagen incentiviert ist.",
            "start": 1900662,
            "end": 1945164,
            "confidence": 0.9115321126760565,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Spannende Geschichte, weil du besonders gesagt hast, wenn man als Unternehmen glaubt, aber dein Eigener Impact ist ja oft schon limitiert. Siehe jetzt in letzter Zeit Microsoft mit ChatGPT oder Nvidia mit dem ganzen AI Hype. Also ich bin mir jetzt nicht sicher, wie viel einfluss die Nvidia Mitarbeiter selbst an dem kompletten Blow up von diesem Hype hatten und dann jetzt natürlich mit zufällig den richtigen Chips und so weiter einen enormen Boom hatten. Deswegen ist es natürlich schon so eine Sache. Was heißt glauben oder wie viel Glück ist auch dabei?",
            "start": 1945332,
            "end": 1973508,
            "confidence": 0.9078043010752688,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du musst ja die Firma glauben, nicht an dich selber in dem Fall.",
            "start": 1973604,
            "end": 1976340,
            "confidence": 0.850716923076923,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, also ob das nur Zufall war mit den Chips, das können wir in einer anderen Folge mal besprechen. Ich glaube, Nvidia hat sich ganz gut auf den Zufall vorbereitet. Es ist natürlich richtig, dass je größer die Firma wird, also Nvidia hat glaube ich rund Mitarbeiter, Google Meta haben sechs, also Meta jetzt wieder ein bisschen weniger, aber so eher sechsstellige Anzahl Mitarbeiter. Und da ist der Beitrag, die Contribution des Einzelnen oder der Einzelne natürlich infinitissimal, klar. Aber trotzdem spüre ich, ich spüre ja auch, wie die Teams um mich herum wirken. Ich spüre, wie die Kultur der Firma ist. Vielleicht ist es einfach so, dass ich glaube, ich arbeite irgendwie bei DeepMind und bin eine top Ingenieurin oder Produktmanagerin, aber ich sehe auch, dass die Leute irgendwie in Dublin oder Zürich bei Google ein bisschen slacken oder das in Mountain View alle lang. Das ist jetzt ein random Beispiel, aber ich habe trotzdem ein Gefühl dafür, ob es mit der Firma vorangeht oder nicht. Aber es ist natürlich richtig, dass diese dieses Alignment der Incentives zunehmend schlechter funktioniert, wenn wir nie das Gefühl hat, er ist ein sehr kleines Rad in der Firma. Dann müsste man eigentlich so die die Stock Options noch mehr an die Business unit oder so koppeln. Aber das wird dann so komplex und ein bisschen arbiträr, also dass dann einzeln entscheiden, ob es jetzt gut oder schlecht läuft, das will man auch nicht. Das Gute ist an der Incentivierung über die Aktien oder Aktienoptionen, dass der Markt am Ende ja entscheidet, ob meine Arbeit gut oder schlecht war. Also es ist es ist nicht mehr der Chef, der sagt, du hast das gut oder schlecht gemacht, sondern ob ob diese Aktien mehr oder weniger wert sind, entscheidet eine Crowd Intelligenz im Sinne von dem Aktienmarkt letztlich.",
            "start": 1976880,
            "end": 2068052,
            "confidence": 0.9084871052631578,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du hattest gerade schon das Wort Strike Price in den Mund genommen und ich kenne aus dem ganzen Bereich auch so ein kleines Buzzword Bingo mit Vesting, Vesting Cliff waiting period. Da gibt es das Wort exercising strike price expiry date exercise window. Kannst du uns ganz kurz irgendwie mal dato durchführen? Was ist investing? Was ist ein vesting cliff? Was ist ein strike price? Was ist ein exercise window?",
            "start": 2068116,
            "end": 2090484,
            "confidence": 0.861980857142857,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das klingt, als hältst du die Paragrafen deines letzten ESOP Vertrags noch mal durch die dicken Überschriften durchgelesen.",
            "start": 2090572,
            "end": 2096264,
            "confidence": 0.739293888888889,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich habe mal einen solchen Cheat bekommen. Auch ESOPs und auch VSOPs. Und ja, ich habe diese Papiere einfach unterschrieben. Ich bin Ehrlich, ich habe keine Waschmaschine gekauft, aber ich habe nicht alles immer verstanden. Und der CFO hat dann auch regelmäßig so Question Answer Session gemacht in der Firma und hat versucht, allen diese Worte zu erklären. Und das war vor, das war so 2013, 2014. 2000 fünfzehnte.",
            "start": 2096432,
            "end": 2117552,
            "confidence": 0.9141672463768115,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, vor allem sind es ja teilweise dreiig Seiten oder noch mehr, die man da unterschreiben muss. Zweitausendein, also gleich zu deutsch.",
            "start": 2117616,
            "end": 2123614,
            "confidence": 0.8418304545454546,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Einerseits ist es so, dass in der Regel, eventuell sollte man das checken, aber in der Regel unterschreiben ja alle den gleichen Vertrag. Eventuell sogar die Gründer selber kriegen manchmal noch Anteile per ESA Programm oder die hohen Mitarbeiter. Von daher, ich will nicht sagen, kann man sich darauf verlassen, aber es wäre jetzt auch ineffizient, wenn jeder Mitarbeiter sich einen Anwalt dafür sucht. Aber dann die wichtigsten Terms können wir einmal durchgehen. Also Vesting meint einfach, dass ich meine Anteile im Fortschritt mit meiner Unternehmenszugehörigkeit Ÿousand bekomme. Das ist bei den Restricted Stock units genauso, aber auch bei den ESOPs in der Regel relativ gängig ist quartalsweise. Man kann das auch monatsweise, jährlich oder halbjährlich machen, aber quartalsweise ist das, was ich am öftesten sehe. Und das heißt z.B. ich bekomme 160 Anteile über die nächsten vier Jahre. So typische, typische Vesting Perioden sind drei bis fünf Jahre, würde ich sagen, ist gängig. Das Unternehmen möchte natürlich immer so lange wie möglich die Mitarbeiter bin. Die Mitarbeiter wollen natürlich in möglichst kurzer Zeit ihre Ÿousand Aktien verdienen, aber so zwischen drei und fünf Jahren ist relativ gängig. Man könnte jetzt sagen, ich kriege 160 Aktienoptionen zu einem gewissen Preis über die nächsten vier Jahre und das würde eben heißen 40 pro Jahr und damit 10 pro Quartal. So und das heißt, nach den ersten drei Monaten gehören mir 10, nach einem halben Jahr gehören mir 20 und so weiter, wenn ich das richtig gerechnet habe. Das heißt, das meint Westing nur, dass ich im Fortschritt meiner Zugehörigkeit mit dem Unternehmen nach und nach die Anteile bekomme. Dann gibt es noch zwei Spezialfälle, die ich wichtig finde. Das eine ist das sogenannte Cliff. Das kann man ganz einfach erklären, das ist ein bisschen wie eine Probezeit. Das heißt, wenn ich typischerweise innerhalb von sechs Monaten oder 12 Monaten der Arbeitgeber feststellt, so haben wir uns das alles nicht vorgestellt, wir passen kulturell null zusammen oder es ist einfach vom Performance Review hat das überhaupt nicht unsere Ansprüche erfüllt, dann kann man sagen, dass für die Zeit, für diese Probezeit, ich glaube sechs, manchmal auch 12 Monate ist gängig, ich glaube sechs ist fairer sozusagen, wenn der Mitarbeiter in der Zeit gekündigt wird oder selber kündigt, dann wären eben noch gar keine Anteile zugeteilt, obwohl man schon den Anspruch auf die ersten sechs Monate hätte. Oder hier in meinem Beispiel die ersten 20 esops würde man in dem Fall dann keine zuteilen, weil man einfach so früh gemerkt, also dass eine langfristige Mitarbeiterinzentivierung gar keinen Sinn macht, wenn der Mitarbeiter sowieso nicht oder die Mitarbeiterin sowieso nicht Ÿousand lange bleibt das mein Cliff. Cliff heißt, wenn ich vor dem Cliff gefeuert werde, werde ich wahrscheinlich leer ausgehen, dann kriege ich trotzdem mein Gehalt, natürlich wie in der Probezeit auch, aber ich bekomme diese Intensivierung nicht. Ich halte das ehrlich gesagt für sehr fair. So, wenn ich es nicht schaffe, meinen Arbeitgeber, Arbeitgeberin zu überzeugen in der Zeit, dann muss ich das mit dem kleinen Risiko leben. Ich habe mich da auf jeden Fall immer, ich bin immer sehr cliff freundlich sozusagen, wenn ich von Unternehmen in ESOPs bezahlt werde. Und das andere, das kann auch noch spannend sein, ist das sogenannte accelerated vesting. Das Problem ist so ein bisschen, dass man das wird in einem guten ESA Vertrag oder in einem arbeitnehmerfreundlichen ESA Vertrag immer drin sein. Wenn es nicht drin ist, ist es natürlich schwer als Einzelner das reinzuverhandeln, weil die werden immer sagen, das steht in unserem ESA Programm so nicht drin. Wir machen wirklich jetzt keine Ausnahme. Vielleicht kann man das in dem Zeitletter, in dem Subscription Letter noch mal extra definieren für einzelne Personen, aber Ÿousand accelerating möchte ich z.B. immer deswegen haben. Also es ist eine arbeitnehmerfreundliche Regelung, die eigentlich heißt, mein Vesting geht über vier Jahre. Das heißt, ich bekomme eben im Fortschritt über vier Jahre das. Aber wenn jetzt die Firma in zwei Jahren schon IPO macht oder gekauft wird von einem Konkurrenten sehr früh, dann ist eigentlich für alle der wirtschaftliche Erfolg schon eingetreten. Nämlich die Gründer kriegen ihr Geld, die Investoren kriegen ihr Geld, warum soll ich nicht meine Shares komplett schon bekommen? So, ich habe doch meine Arbeit angekommen, zweitausendein schon geleistet oder wir feiern doch alle eine Party, warum soll ich nicht meine Anteile bekommen? In meinem Fall als Berater würde ich sagen, ist der, würde ich definitiv sagen, der Erfolgsfall ist da eingetreten. Man kann jetzt diskutieren, ob bei anderen Arbeitnehmern so haben die jetzt ihre Arbeit geleistet oder nicht? Ich würde fairerweise immer sagen, sozusagen, wenn die Firma verkauft wird oder IPO, dann ist ein so großes Ziel erreicht, dass man so akzeleriert westen kann und dass jeder einfach am Erfolg mit partizipiert. Weil du hattest ja auch gar nicht die Chance, also oft kriegst du ja auch gar nicht die Chance, das weitere Vesting sozusagen, du müsstest du eventuell neu vorhanden, du weißt gar nicht, ob der neue Besitzer der Firma wieder ein ESA Programm auflegt. Du hast ja auch gar nicht die Chance, vielleicht die anderen Anteile zu verdienen. Und ich glaube gerade so als einer der frühen Mitarbeiter kann man das vielleicht noch mit aushandeln, dass man auch im Fall, dass man nicht die volle Zeit ableisten kann, die 100 % Anteil kann. Was es nicht heißt, ist, dass wenn ich nach zwei Jahren kündige, so behandelt werde, hätte ich vier Jahre gearbeitet. Das meint es nicht, sondern nur, wenn die Firma sozusagen übernommen wird oder früher an die Börse geht, das ist oft auch nicht drin. Muss man schauen, ob man es schafft, das durchzusetzen. Es gibt noch einen Sonderfall, man kann so eine Art degressives Vesting machen, das ist, wenn man z.B. ein früher Advisor oder so bei einer Firma ist, kann das ganz spannend sein. Also ich müsste jetzt als Marketingberater oder Produktberater ja so ein bisschen die Angst haben, dass wenn ich jetzt über vier Jahre Investing Scheme habe und ich im ersten Jahr richtig gut arbeite, das heißt, ich erkläre denen alle Marketing Tricks und irgendwie baue ein erstes gutes Produkt Ÿousand, dann können die ja nach einem Jahr sagen, so das wichtigste hast du uns eigentlich schon gegeben, wir schmeißen nicht drauf. Das ist fairerweise noch nie passiert bzw. Genau einmal passiert bei einer Firma, die meinem besten Freund gehört. Aber ansonsten hat noch nie jemand zum Glück sozusagen dieses Cliff gegen mich ausgenutzt, weil das könnte stark gegen mich spielen. Aber man könnte argumentieren, dass bei bestimmten, wenn ich z.B. jemanden von der Konkurrenz weg heiere, weil ich glaube, der bringt besonders spannende Kundenkontakte mit oder so, dann könnte man natürlich sagen, ich möchte eigentlich im ersten Jahr schon 50 % meiner Anteile Ÿousand Westen und dann dreiig und noch zweimal 10 oder so über die vier Jahre, weil einfach so viel nutzen schon in der ersten Zeit entsteht, wenn wir, wenn wir uns richtig verstanden haben. Das wäre vielleicht noch Sonderregelung, die in manchen, ich glaube nicht gar nicht so ein Arbeitnehmerverhältnissen, vielleicht eher ein Beraterverhältnissen sinnvoll sein kann. So, das war so ein bisschen das Thema Cliff und Vesting. Also Cliff so ähnlich wie eine Probezeit. Ich bekomme nichts, wenn ich nicht die Probezeit überlebe. Vesting einfach nur, ich bekomme eine Anteile nach der Arbeitszeit. Es wird sich vorher schon darauf geeinigt, wie viel ich bekomme, aber ich bekomme sie eben nach und nach. So, dann gibt es sozusagen den strike Preis, das ist das Exercising, das Ausüben der Option. Das ist alles sehr ähnlich. Der strike Preis oder Ausübungspreis meint den Wert oder Share Price, um genau zu sein, zu dem ich die Option ausüben kann. Und Option ausüben heißt immer, ich nehme das Recht, das Vorkaufsrecht, eine Aktie zu kaufen zu einem vorher bestimmten Preis. Zweitausendeinundzwanzig war und wie gesagt, im Idealfall ist es z.b. so, ich bekomme, die Firma hat Anteile, ich bekomme als einer der ersten Mitarbeiter schon Optionen zum dann ist der Anteilspreis vielleicht noch wirklich eins, jetzt Einfachheit halber. Manchmal ist dann auch 10 oder 20 oder 12,5. Aber wenn wir jetzt mal €1 und die Firma macht drei, vier Finanzierungsrunden und es irgendwann nicht mehr Euro wert, sondern 25 Millionen wert. So, dann ist halt meine Option ist dann ja die Differenz zwischen einem Euro und €1000 wert, weil es gibt in fairerweise, es gibt inzwischen mehr Anteile. Also es gibt ja nicht mehr Anteile, sondern es gibt ein paar mehr. Das heißt, sagen wir mal so, ich wurde weiter verwässert. Es gibt jetzt Anteile, weil die in den nächsten Finanzierungsrunden, so eine Kapitalerhöhung. Diese Finanzierungsrunden funktionieren ja so, dass neue Anteile rausgegeben werden an der Firma. In der ersten Runde werden vielleicht 5000 neue rausgegeben, dann noch mal oder so. Sagen wir es gibt inzwischen Anteile Ÿousand, die Firma ist 25 Millionen wert. Dann ist jetzt jeder Anteil €500 wert. Und mein Ausübungspreis ist aber noch der €1 sozusagen aus dem ersten Tag der Firma. Das heißt, wenn ich diese Option ausübe, zahle ich €1 und bekomme dafür einen Anteil der Firma. Dieser Anteil der Firma ist aber €500 wert. So, das heißt mein Optionsgewinn ist €499. Den krieg ich jetzt nicht sofort cash ausgezahlt, außer eventuell beim virtuellen Optionsprogramm, da wird das entweder cash oder mit dem Zeitverzug dann ausgezahlt. Aber erstmal habe ich jetzt Aktien im Wert von €500 für €1 gekauft, indem ich meine Option, also diese Vorkaufsoption ausgeübt habe. Macht das Sinn? Das ist sozusagen das sogenannte Exercising der Option oder das Ausüben der Option. Und der strike Preis ist eben der Ausübungspreis, in meinem Beispiel €1. Der wird immer auf dem Subscription Letter draufstehen. Auf dem Subscription Letter wird draufstehen, wie viel Anteil ich bekomme und was der strike Preis ist.",
            "start": 2123742,
            "end": 2611580,
            "confidence": 0.9115338452088434,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und muss sie den dann direkt zahlen? Also muss ich den Cash auslegen, den einen Euro?",
            "start": 2611700,
            "end": 2615618,
            "confidence": 0.8917150000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, da gibt es so verschiedene sogenannte Settling Optionen. In der Regel wird das je nachdem, also je älter die Firma ist, desto eher wird das von der Bank eventuell auch betreut oder von einem professionellen Broker. Der wird in der Regel dafür sorgen, dass du nur noch die Differenz bekommst. Also es wird dann in der virtuellen S beides gemacht. Also du kriegst das Geld für deine Aktien schon so schnell zurück, wie du es bezahlst. Theoretisch müsstest du es, aber beim Visa Programm brauchst du das nicht, weil du ja nur die virtuelle Differenz bekommst. Beim ESOP Programm wird es in der Regel so sein, dass zweitausendein. Man versucht das eigentlich immer so zu optimieren, aus Firmen sich, dass niemand in Vorkasse gehen muss von den Mitarbeitern oder das jetzt daran scheitert, dass ich das Geld nicht habe, die Option auszuüben oder so. Das wird man in der Regel.",
            "start": 2615804,
            "end": 2654852,
            "confidence": 0.9217913245033114,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber das ist doch oft ein Fall in Amerika, oder? Ich meine, ich habe schon gehört, dass ganz viele tech Mitarbeiter sich den, ich sag mal den Cashout nicht leisten können aufgrund der Steuerlast vorher. Dafür gab es ja auch die Silicon Valley Bank und so. Also ich meine, die war ja glaube ich, berühmt, dass sie solchen Leuten, ich glaube, einen Lohn gegeben hat, damit die das auscashen können, oder Ÿousand.",
            "start": 2654996,
            "end": 2672720,
            "confidence": 0.9238448611111111,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Also wenn der strike Price nicht mehr super niedrig ist, sondern schon ein bisschen höher, dann braucht man manchmal diese Überbrückung. In Deutschland ist es glaube ich, noch relativ unüblich, ehrlich gesagt. Ich habe noch niemanden gesehen, der sich groß damit beschäftigen musste. Aber man kann quasi überbrücken, indem man den Strikepreis finanziert als Bank und gleichzeitig die dann ja im Besitz des ausübenden befindlichen Aktien so als Sicherheit nimmt quasi. Das wird dann natürlich brutal. Wenn dann der Kurs fallen sollte unter den Strikepreis, dann würde ich theoretisch einen Verlust machen und in der Regel noch steuern. Je nachdem, wie die Reihenfolge oder wie schnell das Finanzamt ist, könnte es sogar sein, dass ich höhere Steuern zahlen muss. Eventuell kriege ich die, weil der Verlust wird ja später auch wieder Capital Gains oder negativ Capital Gains. Dann müsste sich das ein bisschen ausgleichen. Aber kurzfristig kann man dadurch in steuerliche Probleme kommen, auf jeden Fall.",
            "start": 2673290,
            "end": 2720550,
            "confidence": 0.9296768789808918,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hast du gerade das Wort schnell und Finanz habt ihr in einem Satz gesagt.",
            "start": 2720670,
            "end": 2722942,
            "confidence": 0.9234092857142856,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, genau. Das passiert ja eher selten in der Regel. Ÿousand.",
            "start": 2722966,
            "end": 2726090,
            "confidence": 0.9090863636363636,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Naja, wenn es darum geht, Geld einzukursieren, ist schon normalerweise da nie ein Problem.",
            "start": 2726620,
            "end": 2733300,
            "confidence": 0.8494321428571429,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Im Voraus schon geschätzt. Ich habe noch eine Ergänzung zu. Ich habe gesagt, auf dem Subscription Letter, wo ich sozusagen dem ESOP Programm beitrete als Arbeitnehmer, steht immer der strike Preis und die Anzahl der Optionen. Was natürlich schade ist, ist das nicht draufsteht, wie viel % der Firma gehören mir jetzt eigentlich? Weil das ist eigentlich die wichtige Information. Also was ich frage Leute immer, die kriegen dann 40, 40 ESOPs zugeteilt zu einem strike Preis von 12,50. Und was heißt das jetzt? Habe ich jetzt €800 bekommen oder das ist ja überhaupt nicht greifbar, sondern eigentlich muss ich ja wissen, was ist denn der Share Price? Also wie bewerten Investoren gerade die Firma? Also ist da schon eine Differenz zwischen den 12,50 oder nicht? Dann theoretisch hat das auch steuerliche Implikationen, da gehen wir jetzt nicht drauf ein. Und wie viel % der Firma repräsentieren diese 40 GmbH Anteile?",
            "start": 2733420,
            "end": 2778118,
            "confidence": 0.9069403973509934,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kann man das bei solchen, ich sag mal funding events wie Series A, Series b oder Ÿousand sowas dann nicht sagen? Weil da kriegt man ja in der Regel, ich sag mal öffentlich mit, wie viel zu wie viel zu welchem Wert die Firma bewertet wurde. Das heißt jetzt nicht, dass man sagt, wie viel % man hat, aber man redet ja in der Regel nicht davon, dass ein Arbeitnehmer 5 % der Firma hat. In der Regel sage ich, vielleicht gibt es sowas aber sondern 0,000 irgendwas.",
            "start": 2778174,
            "end": 2799180,
            "confidence": 0.9220852272727277,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Was du halt dann machen kannst, ist, du liest bei TechCrunch, dein Arbeitgeber wurde gerade mit 200 Millionen bewertet und dann kannst du ins Unternehmenshandelsregister gehen und schauen, wie viel Share, wie viel GmbH Anteile gibt es denn? Dann kannst du den Wert jedes Anteils dadurch ausrechnen, quasi wenn diese Information, also Handelsregister ist einigermaßen zuverlässig, aber ob die die Finanzierungsrundeninformation. Da gibt es ja auch so verschiedene Möglichkeiten das zu tunen. Aber so kann man theoretisch rausbekommen, was ist jetzt eigentlich. Man kann aber auch einfach mal den CFO oder die CFO fragen und sagen, was ist das eigentlich wert? Oder gib mir mal eine Tabelle, in der verschiedene Szenarien durchgerechnet sind. Was heißt das dann, wenn unsere Firma 15, 200, 500 Millionen wert wird, wie viel werde ich dann unbedingt ungefähr noch besitzen? Damit man einfach so ein bisschen im Kopf spielen kann, was das bedeutet. Weil Fakt ist, die meisten Leute wissen eigentlich nicht, wie viel Upside, wie viel mögliche Upside haben sie jetzt, wenn sie 40 Optionen bekommen haben.",
            "start": 2799260,
            "end": 2847946,
            "confidence": 0.8934201149425287,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt hast du schon erwähnt, es wird immer so designt, dass die Mitarbeiterinnen möglichst kein Geld auslegen müssen, das möglichst einfach gemacht wird für die, dass es Standard schreiben ist. Das Monte schreibt jetzt keine Ahnung, ob es eine gute Idee ist, ein Angel zu fragen, ob es auch negative Seiten zu dem Ganzen gibt und jemand, der auch noch sehr risikofreudig ist. Aber gibt es irgendwas Negatives auch diesbezüglich oder würdest du sagen, wenn man die Chance hat, drauf losstürzen?",
            "start": 2847978,
            "end": 2872946,
            "confidence": 0.8988949382716052,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also es gibt diese rein theoretischen steuerlichen Fallstricke noch, die aber wie gesagt, sich größtenteils ausschließen lassen. Ich glaube, was einem bewusst sein sollte ist, dass wenn eine Firma verkauft, liquidiert wird, an die Börse geht, da gibt es ja so eine Art Kaskade, so ein Wasserfall an wer bekommt sein Geld zuerst? Und es ist in aller Regel nicht so, dass wenn eine Firma 100 für 100 Millionen verkauft wird und es gibt Anteile, dass jeder Shareholder €1000 bekommt. Ganz oft ist es so, dass die letzten Investoren z.B. zuerst ihr Geld bekommen und da gibt's dieses Wort Liquidationspräferenz oder Liquidation preference im Englischen. Und das heißt z.B. dass die die letzten Investoren haben sich oft zusichern lassen, dass sie eine Mindestrendite von 8 % bekommen oder dass sie also mit jedem Jahr mit 8 % mehr wiederbekommen als ihr Investment oder dass sie sofort das Doppelte wiederbekommen. Selbst wenn die Firma am nächsten Tag verkauft wird, kriegen sie das Doppelte von dem letzten Investment, teilweise bis zu das Dreifache. Es gibt Konstrukte, wo man versucht, aktiv Shareholder zu benachteiligen, wo man sogar das Sechsfache vereinfacht oder so, oder das Zehnfache.",
            "start": 2873018,
            "end": 2933220,
            "confidence": 0.904754739583333,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber warum? Warum wird das gemacht? Denn die letzten Investoren, die tragen ja nicht mehr das Risiko von Product Market fit, weil der ist ja eingetreten. Das sind ja die letzten Investoren. Also ich gehe davon aus, vorher haben Leute investieren. Klar, gegebenenfalls könnte man sagen, okay, die sind zu hoch eingestiegen, fair enough. Aber ich meine, warum kriegen die Liquiditätspräferenz?",
            "start": 2933300,
            "end": 2947894,
            "confidence": 0.9145081967213117,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, also was die sagen ist letztlich, ihr verkauft uns diesen Bullshit und dafür, dass wir jetzt den höchsten Preis von. Ihr habt ja alle ihr. Also ihr werdet, selbst wenn die Firma nur für 100 Millionen verkauft werden, dann wird, werden die ersten Angel Investoren, die Gründer und so, die werden alle ihr Geld machen, deswegen wir zahlen jetzt den höchsten Preis und damit wir noch mal Geld machen, unser Geld verdreifacht, vierfachen können, muss die Firma deutlich größer werden. Deswegen lassen wir uns das teilweise zusichern und teilen wieder das Risiko. Also sie geben eigentlich Risiko an den Rest der Firma zurück, weil die sind eigentlich aus dem Risiko raus, ne, weil dann als Gründer irgendwie habe ich am Anfang mal vielleicht in meine Firma investiert, oder? Und wenn ich jetzt noch 10 % der Firma habe, selbst wenn die für nur 10 Millionen verkauft wird, dann werde ich meine Millionen auf jeden Fall bekommen. Und diese Liquidation Preference verlagert so ein bisschen Risiko in die Firma zurück, würde ich sagen. Und es gibt auch Investoren, die das nicht machen, einfach um den Deal zu gewinnen, weil es eine bessere, bessere Kondition für den Rest der Company sind. Aber gerade in der letzten Zeit war das, wurde es relativ viel vereinbart. Und was ich sagen wollte ist, dass die Mitarbeiter Optionen in der Regel die allerletzte Stufe in dieser Kaskade sind. Also jeder wird sein Geld gesehen haben, bevor diese ESOPs ausbezahlt werden. Das heißt, sagen wir mal, eine Firma wird für 100 Millionen verkauft, in der der letzte Investor 20 Millionen mit einer dreifachen Liquidation Preference investiert hat. Dann wird der zuerst seine 60 bekommen und die restlichen 40 werden dann unter den anderen Investoren geteilt. Wenn die jetzt z.B. auch Liquidation Preferences hatten, dann werden die sozusagen auch mehr als sie eingezahlt haben, erstmal zurückbekommen. Und eventuell, was dann als letztes komprimiert wird, also zusammengedrückt wird, sind die Anteile der Gründer und Gründerinnen und die der Mitarbeiter und sagen, selbst die Gründershares haben noch, obwohl sie letzte in der vorletzte in der Kette sind, sozusagen einen höheren Rang als die Mitarbeiter. Was nicht heißt, man kann natürlich vertraglich andere Möglichkeiten suchen, dass man z.B. mit dem Aufkäufer vereinbart, die Liquidation Preference würde das sagen, aber wir möchten, dass die letzten Shares zwischen Gründern und Mitarbeitern aufgetaucht werden. Kommt ein bisschen darauf an, was für moralische Vorstellungen Leute auch haben, glaube ich. Das heißt, vieles kann man noch freiwillig regeln, aber so ein rein gesetzlich pro forma wäre es so, dass die ESOP Holder oder insbesondere Visa Polder dann die virtuellen, weil es ja ein Schuldverhältnis ist gegenüber eventuell als letztes ihr Geld bekämen.",
            "start": 2947982,
            "end": 3080126,
            "confidence": 0.910444384787472,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das hat man aber bei Public Companies dann nie das Problem, oder? Weil das ist fixiert, oder kann es sowas auch auftreten?",
            "start": 3080278,
            "end": 3085934,
            "confidence": 0.9261886363636361,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ein IPO löst in der Regel viele, weil dann wieder alle, dann gibt es nicht mehr so viele Shareklassen. Also man macht das ja so, dass man verschiedene Shareklassen kreiert, damit die verschiedene Rechte haben können. Weil normalerweise haben alle Gesellschafter die gleichen Rechte. Und damit du neue Rechte machen kannst, baust du sowas wie Vorzugsaktien, also Anteile, die mehr Rechte haben als andere. Am Ende gibt es ja manchmal fünf verschiedene oder 10 verschiedene Shareklassen. Und beim IPO werden in der Regel alle Share Klassen in eine oder zwei überführt. Zwei, wenn man will, dass eine gewisse share Klasse, z.B. die der Gründer noch mehr Stimmrechte behält. Aber es gibt dann nicht mehr 10 Share Klassen in der Regel beim IPO, sondern dann haben alle tatsächlich den Anteil, wie auf dem Cap Table steht oft.",
            "start": 3085982,
            "end": 3124914,
            "confidence": 0.9056627007299269,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und nach einem IPO, wenn ich RSUs habe, kann das dann auch nicht passieren, oder? Da habe ich ihn ja auch fixiert.",
            "start": 3124962,
            "end": 3129794,
            "confidence": 0.8801181818181817,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also wenn die Firma sowieso schon public ist und du RSU hast, dann betrifft dich das eigentlich nicht mehr, würde ich sagen.",
            "start": 3129882,
            "end": 3134274,
            "confidence": 0.9180436363636364,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was bedeutet, dass eigentlich neue Funding Runden für Mitarbeiter in der Regel nachteilig sind, oder? Wegen der klassischen Verbesserung? Oder wird der Equity Pool bei neuen Finanzierungsrunden erweitert und geben existierende, z.B. die Gründer mehr ihrer Shares ab? Weil dann wäre es ja keine Verwässerung, weil dann kriegen ja einen neuen Anteil des Pools, weil der Pool ja extended wird.",
            "start": 3134362,
            "end": 3151754,
            "confidence": 0.8756435,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Verwässerung ist so negativ assoziiert vom Wort. Also das heißt einfach, jemand Neues möchte, also neuer Investor möchte in die Firma investieren. Es gibt bisher Anteile, jetzt schafft man 5000 neue Anteile, GmbH Anteile, dafür zahlt jemand z.B. 10 Millionen, dann wäre die Firma insgesamt 60 Millionen wert, weil für 1/6 der Firma, nämlich von. Hat er 10 Millionen gekauft, also ist die ganze Firma 60 Millionen wert.",
            "start": 3151802,
            "end": 3172962,
            "confidence": 0.9062479411764707,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ÿousand.",
            "start": 3173026,
            "end": 3173204,
            "confidence": 0.83426,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "So, jetzt kann man sagen, jetzt ist mein Anteil, vorher gab es Anteile, jetzt gibt es Anteile, damit wurde ich 16 % verwässert in dem Fall, dadurch, dass 5000 neue Anteile geschaffen wurden. Aber was ja auch richtig ist, dass wenn die Firma vielleicht vorher nur die Hälfte wert war, dann sagen wir, ich habe vorher 1 % der Firma gehabt, 1 % von einer Firma, die dreiig Millionen wert war, dann hat mir gehört. So, jetzt hat der neue Investor die Firma aber mit 60 Millionen, habe ich gerade gesagt, glaube ich, bewertet, indem er 10 Millionen für 16,6 %, nämlich 5000 von Anteilen bezahlt hat. Dann gehören mir, gehört mir jetzt zwar nur noch nicht mehr 1, %, sondern 250 von 300 sind dann 0,83 %. Und aber das von 60 Millionen. Und damit ist mein Anteil jetzt rund, kriegst du es im Kopf nicht ganz hin, aber rund wert. Also ja, ich wurde um 16 % oder 16,6 % verwässert, hier 16,7, um genau zu sein. Obwohl mir jetzt ein bisschen weniger an der Firma gehört, prozentual am gesamten Kuchen, ist der Kuchen ja viel größer geworden, weil die Bewertung der Firma gestiegen ist. Das heißt, Verwässerung ist eigentlich nur dann schlecht, wenn der Anstieg des Firmenwertes kleiner ist als der Anstieg der neuen Anteile sozusagen. Oder meine, meine Verwässerung, die Dilution sagt man auch dazu. Das heißt, prinzipiell sagen wir, wenn sich der Firmenwert jedes mal verdoppelt, mit jeder Runde, dann ist Verwässerung in der Regel nicht dein Problem. So, dann gehört dir halt 15 bis 20 % weniger auf deiner Firma, aber die Firma ist halt doppelt so viel wert. Das heißt, dein Kuchenstück ist ein klein bisschen schmaler geworden, aber der Kuchen ist einfach viel größer geworden. Und deswegen ist Verwässerung im Normalfall, dass alles gut läuft, gar nicht so ein großes Problem. Das Problem ist hauptsächlich Liquidation Preference. Eben wenn die letzten Investoren, wenn die gesagt haben, im Fall, dass wir morgen den Kuchen verkaufen, kriegen wir drei Stück, obwohl wir nur eins reingeschoben haben. Das ist dann eher das, was bei den Verwässerungen dann gegen einen spielt.",
            "start": 3173242,
            "end": 3285530,
            "confidence": 0.9121969577464788,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber die Terms mit der Liquidation Preference, die sind ja nicht öffentlich zugänglich. Das sind ja private Verträge, oder?",
            "start": 3285610,
            "end": 3290042,
            "confidence": 0.8946915789473685,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das wissen, also das weiß weder, in der Regel weiß das die Presse nicht und dann wissen es auch die Mitarbeiter nicht. Das lässt sich auch nicht im Handelsregister oder nur umständlich nachschauen. Das kommt darauf an, wie die Firmenkultur ist. Das ist was, was im All Hands vielleicht mal fragen sollte, was denn die Terms der letzten Runde sind, je nachdem wie die, wie transparent die Firmenkultur ist, wird das dann beantragt, antwortet oder auch nicht. Aber das ist für den Wert der ESOPs, also deines Gehaltsbestandteils, ist das unheimlich wichtig, das zu verstehen eigentlich. Und ich würde sagen, in 95 % der Fälle wird das nicht kommuniziert.",
            "start": 3290146,
            "end": 3320622,
            "confidence": 0.9196524545454542,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wir haben im Select einen Ask me Anything Channel. Die Transparenz ist sehr hoch. Ich glaube, das werde ich mal die Tage fragen.",
            "start": 3320686,
            "end": 3326334,
            "confidence": 0.9072095652173914,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Viel Erfolg.",
            "start": 3326502,
            "end": 3327450,
            "confidence": 0.932075,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die Transparenz ist aber ein guter Punkt, weil das, was du jetzt beschrieben hast, ist eigentlich immer, wenn es gut läuft, du hast es ja auch gesagt, wenn es gut läuft, ist Verwässerung kein Problem. Aber wenn es natürlich schlecht läuft, vor allem bei Public Companies, ihr habt es selber mal erlebt, wie sehr das auf die Moral und auf die Kultur schlägt. Also ich weiß nicht, wie viele All Hands wir verbraten haben, nur irgendwie mit die Leute zu beruhigen, dass der Aktienwert vielleicht nicht so viel Einfluss hat auf die eigentliche Arbeit und so weiter. Also man hat da teilweise durch diese Transparenz, vor allem wenn man public company ist, dann schon auch einen großen Hebel, auch einen negativen Hebel auf die Moral und auf die Kultur.",
            "start": 3328070,
            "end": 3366364,
            "confidence": 0.9279727906976747,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja und für den Fall, dass der öffentliche Kurs, also sei es an der Börse oder auch vorher schon, man kann ja auch sogenannte Downrounds haben, also dass bei der nächsten Finanzierungsrunde der Unternehmenswert niedriger ist als bei der vorherigen, dann kann es natürlich auch sein, dass der Unternehmenswert oder der Share Price unter meinen Strikepreis, unter meinen Ausübungspreis fällt und damit ist die Option dann quasi wertlos, bis bis später wieder eventuell der Kurs drüber liegen könnte. Und dann ist natürlich alles, was wir vorher als Vorteil beschrieben haben, Alignment, Incentives, Motivation und so weiter, ist dann natürlich verpufft, weil wenn ich die Früchte nicht mehr ernten kann, weil meine Option wertlos wird, weil der der Kurs des Unternehmens eigentlich unterhalb meines letzten Strike Prices liegt, weil ich vielleicht später zur Company hinzugekommen bin, dann hat man ein großes Problem. Auch dafür gibt es Lösungen. Also was in den USA z.b. sehr gängig ist, ist, dass die Firma regelmäßig, auch aus steuerlichen Gründen muss man sagen, in den USA aber neu bewertet zweitausendein wird. Und dann wird auch oft gesagt, wir setzen jetzt den strike Preis auf den neuen sozusagen tiefsten Wasserstand zurück, damit es wieder eine Motivation gibt, von hier sozusagen aufwärts zu arbeiten, weil sagen wir durch den durch den massiven Zinswechsel, wo die Zinsen um vier, viereinhalb % sich verändert haben innerhalb weniger Quartale, da ist natürlich so, dass eine Firma, die vielleicht vorher ein Unicorn war, ist auf einmal nur noch 150 Millionen wert, obwohl die Firma sich vielleicht sogar gut entwickelt. Es ist einfach der Gesamtmarkt, der sich verändert hat. Und dann möchte man eigentlich oft sagen, da kann jetzt niemand was für gerade und wir wollen, also wir brauchen so oder so weiter motivierte Mitarbeiter, vielleicht mussten wir sogar ein paar entlassen oder so. Aber die, die jetzt da sind, die müssen wieder motiviert werden und incentiviert werden auch. Das heißt, wir setzen deren ESA Programme auf den aktuellen Preis runter, damit sie vom jetzigen sozusagen Fortschritt, wenn es jetzt aufwärts geht, wieder richtig partizipieren. Und wenn nicht, darf man sich als Firma auch nicht wundern, wenn die Mitarbeiter nicht motiviert sind. Also Ÿousand, da muss man ins Gespräch treten miteinander, denke ich. Das ist vielleicht auch noch ein wichtiger Tipp. Man denkt immer, weil ich irgendwann mal was unterschrieben habe, muss ich jetzt vier Jahre knechten hier und ich ärgere mich dann, dass ich damals zu wenig es bekommen habe, obwohl ich inzwischen so wichtig geworden bin für die Firma. Ich kann nur jeden aufrufen, jeden Morgen, wenn du zur Arbeit gehst, gehst du an den Verhandlungstisch. Du kannst jedes Mal sagen, ich glaube, ich bin wichtiger, ich möchte neue ESOPs haben. Du kannst auch zurückgeben, das wirst du wahrscheinlich nicht machen. Aber ich glaube, Leute sollten immer ihre Karte am Arbeitsmarkt spielen. Und wenn sie glauben, also nichts ist, und auch selbst aus Unternehmersicht, nichts ist ärgerlich, als wenn dann jemand für €20 mehr zur Konkurrenz geht, den ich eventuell ein paar mehr ESOPs hätte geben können. Also geht lieber mal zum Arbeitgeber, oder? Nachdem er ein positives irgendwie Performance Review gegeben hat. Wie sieht es denn aus mit neuen EsOps? Noch mal so, ich bin super committed für die Company, ich glaube, ich arbeite härter als viele andere und so, deswegen sollte man das ruhig ausnutzen.",
            "start": 3366452,
            "end": 3527442,
            "confidence": 0.9104276618705031,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die Flipside von dem, was du da gerade beschreibst, sind doch die sogenannten golden handcuffs, oder? So nach dem Motto, ich habe so viel ESO, viel Equity, dass ich jetzt einfach hier sitze und auf mein Liquiditätsevent warte und dann eigentlich, ich sag mal, in Deutschland ist man ja fast als Arbeitnehmer unkündbar. Ist das nicht auch ein Problem, so nach dem Motto, dass man dann vielleicht als Sache, ach komm, da fahre ich mal zwei, drei Gänge runter hier.",
            "start": 3527506,
            "end": 3544910,
            "confidence": 0.893489,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das ist durchaus eine Gefahr. Es gibt so bei Google gab es, gibt es diesen festgeschriebenen Term Rest Invest. Also wenn ihr die Silicon Valley Comedy Serie gesehen habt, da sitzen dann Leute irgendwie auf dem Dach, sonnen sich und trinken irgendwie süße Drinks. Ist das comedy dokumentarisch glaube ich, überwiegend dokumentarisch. Und das ist eine Gefahr. Definitiv. Ich glaube aus Angestellten Sicht ist es eigentlich doof, weil am Ende ist nichts wertvoller als Zeit. Und wenn du 3/4 deiner Shares gewestet hast oder 60 % bei einer Firma, die so erfolgreich ist wie Google, auch noch nach dem auch nach dem IPO, dann hat sich Google ja noch sehr gut entwickelt. Dann bist du eigentlich so aus dem Gröbsten raus, dass es dumm wäre dein Leben zu verschwenden, um bei einer Firma, also dann sollten dir die 8 Stunden tages immer noch zu wertvoll sein, um das zu machen. Würde ich jetzt aus individueller Sicht, ich muss immer versuchen aus allen Perspektiven so ein bisschen drauf zu schauen, aber aus arbeitnehmer Sicht würde ich sagen, mach das nicht. Also Golden Handcuffs solltest du idealerweise nicht spüren, weil deine Zeit ist wichtiger als das Geld gerade. Also wenn, wenn deine ESOPs einmal so viel wert geworden sind oder deine RSI.",
            "start": 3544990,
            "end": 3602562,
            "confidence": 0.8971733649289101,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Auf der anderen Seite hast du dieses Problem, was ja auch keine Ahnung, ob es noch so weit verbreitet ist, aber es gab sechs extrem stark, dass alle irgendwie nur so vier Jahre geblieben sind bei einer Firma und dann sofort weiter gehoppt sind, weil am Anfang hast du immer die meisten Aktien bekommen oder fürs Wechseln und du hast dann so einen extrem schnellen Wechsel drinnen und alle bleiben genau immer nur diese diese vier Jahre.",
            "start": 3602666,
            "end": 3623508,
            "confidence": 0.9266605194805194,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, das passiert. Also schlaue Firmen vergeben esops in so rollierenden Schemes. Also eigentlich mache ich jedes Jahr ein neues Ployee sozusagen Incentive Programm und ich setze jedes Jahr neue die die laufen trotzdem über vier Jahre.",
            "start": 3623564,
            "end": 3636940,
            "confidence": 0.877311081081081,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also so überlappend.",
            "start": 3636980,
            "end": 3638356,
            "confidence": 0.75723,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, überlappend. So auch kaskadieren kann man sagen oder überlappend. Das heißt ich beginne eigentlich jedes Jahr ein neues ESA Programm und jeder nimmt daran auch teil und dadurch sozusagen hast du so mounting losses. Also du hast nie das richtige Jahr um auszusteigen dann, weil du jedes Jahr was neues bekommst. Also man sollte es nicht so terminal denken, dass nach vier Jahren ist das gegessen und dann muss ich neu verhandeln oder so, sondern die Firma sollte eigentlich schauen, dass sie mindestens ein Jahr bevor das ausläuft schon überlegt, was ist eigentlich für deinen deine nächste Karrierestufe die richtige Intentivierung.",
            "start": 3638468,
            "end": 3668300,
            "confidence": 0.8821187254901958,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ist eine gute Mitigation. Aber jetzt gerade habe ich mal irgendwie flog über Twitter über mein Screen, dass Nvidia jetzt ein anderes Problem hat, weil die sind ja so erfolgreich geworden und du sagtest ja auch schon, dass viele Start up mitarbeiter Millionäre werden. Das ist öfter zu oft öfter passiert. Aber die sind jetzt so viel wert, dass sie sogar jetzt die Firma verlassen und achtung in Rente gehen das problem to have. Aber ich meine SAP hat glaube ich jetzt gerade auch so ein ähnliches Problem, dass sie glaube ich Leute entlassen zweitausendein haben und ihr, ihr, wie nennt man das? Severance package? Also das, wenn man okay, ich unterschreibe, ich kündige Aufhebungsvertrag und dafür kriege ich weiß ich nicht wie viel Gehälter. Das aber jetzt zu viele Leute Interesse haben, dieses Paket zu nehmen und von SAP zu wegzugehen. Das habe ich auch irgendwo gelesen. Das ist ja auch so ein Nachteil. Also ich meine, da hilft ja ein neues ESA Programm ja auch nicht.",
            "start": 3668420,
            "end": 3712362,
            "confidence": 0.8996440476190477,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, ich glaube, da wurde es nur in älteren Angeboten bei SAP sogar. War das so?",
            "start": 3712466,
            "end": 3716434,
            "confidence": 0.9516731249999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Gute Frage, Details kenne ich nicht.",
            "start": 3716482,
            "end": 3717674,
            "confidence": 0.8741383333333332,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, also wenn der, ich meine, man könnte sagen, das ist eine gute, ich versuche jetzt das Positive dran zu sehen. Man könnte sagen, das ist eine gute Selbstselektionen. Also du willst natürlich genau die Mitarbeiter, die zur Arbeit kommen, obwohl sie sich an den Strand legen können. Das sind vielleicht sogar die motiviertesten Mitarbeiter und auch die können theoretisch noch reicher werden. Wobei im Fall von Nvidia ist es wirklich schwer sich auszudenken, wie du nochmal Incentive schaffen kannst, was das übertreffen kann. Fairerweise so die, die müssen das ja auch erstmal liquidieren. Im Moment ist auch das ja noch im Risiko des Kapital, wenn es noch in den Video Aktien steckt, müssen sie ja noch weiter ackern eigentlich, damit das wertvoll bleibt, wenn man so möchte. Aber ja, da zweitausendein, das ist eins, der ist einfach ein Extremfall, muss man sagen. Ein sehr schöner natürlich, wo es wirklich hunderte, vielleicht tausende Mitarbeiter zu Millionären macht, manche zu Multimillionären. Bei den frühen Facebook und Google Mitarbeitern gibt es teilweise, ich glaube also hohe dreistellige Millionäre, zumindest wenn die irgendwie ganz früh CMO oder so gewesen sind. Aber ich meine, das ist das Schöne daran, das soll ja auch die Karotte sein, die du Menschen hinhängst, dass das möglich ist. Deswegen mag ich das Modell auch irgendwie, weil es, also ich habe in meinem Beratungsjob fast nie irgendwie einen Cent. Also bei Rocket haben selbst die Gründer haben da irgendwie ein sechsstelliges Gehalt bekommen. Ich war sozusagen der einzige Typ, dass wenn die, wenn die Firma Bast geht, also die Investoren vielleicht auch, aber dann bekomme ich nichts. Dann hat selbst der Gründer, die Gründerin mehr bekommen als ich. Aber ich mochte das, ich wollte halt an der Upside, wenn es wirklich klappt, dann gern viel Geld mitverdienen können und es war auch total okay, wenn es dann in acht von 10 Fällen nicht funktioniert. Von daher würde ich das eher sozusagen als bestmögliches Szenario sehen. Und ganz ehrlich, wenn eine Firma, die irgendwie 3,3 Billionen wert ist, natürlich möchte die weiterhin das beste Personal halten, aber die hat auch alle Möglichkeiten, neues Personal zu finden im Notfall. Und vielleicht wollen sie sich auch irgendwann personell erneuern. Und wie gesagt, wer lieber am Strand liegen will, dann soll er halt am Strand liegen, weil soll sie halt am Strand liegen.",
            "start": 3717722,
            "end": 3820268,
            "confidence": 0.9034039999999994,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und es muss ja nicht sein, dass die am Strand liegen. Also die können ja auch was mit ihrem Geld machen. Also wenn man das Gute im Menschen sieht, gesellschaftlich, und die haben jetzt viel Geld, können die ja auch Angels spielen z.B. oder irgendwie neue Firmen aufbauen. Also die wenigsten werden ja nur am Strand liegen, hoffentlich.",
            "start": 3820324,
            "end": 3835392,
            "confidence": 0.9047651724137933,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau das. Und man darf nie vergessen, man driftet da leicht in so eine Neiddebatte ab und sagt, jetzt sind das alles Multimillionäre geworden und haben keinen Bock mehr zu arbeiten. Aber die haben diesen Reichtum selber geschaffen. Also sie waren die Mitarbeiter, die das ermöglicht haben. Genau, deswegen gibt es diese Programme, damit Menschen, die über vier Jahre ihr Leben der Firma gewidmet haben oder teilweise noch länger, die Chance haben, das zu können, wenn wirklich vieles, vieles gut geht für die Firma. Und Nvidia hat ja auch schwere Zeiten gehabt, irgendwie jetzt vielleicht nicht in den letzten vier Jahren, da lief wirklich, gab es viel Rückenwind, da bin ich schon bei euch. Aber man darf nicht vergessen, das ist der Erfolg, den sie als Mitarbeiter. Und ganz oft ist ja so, sagen wir im Fall von Tesla, ist es so, dass irgendwie 56 Milliarden der Typ ganz oben bekommt. So, da haben die Mitarbeiter deutlich weniger bekommen. Aber prinzipiell ist es ja was Schönes, wenn die Leute an der Zeit und dem Erfolg, den sie selber erarbeitet haben, partizipieren können. Das heißt, ich kann da fast nur Positives sehen und mein Mitleid mit Nvidia und Jensen Wang hält sich in Grenzen an der Stelle. Also ich habe das Gefühl, dem geht es auch ganz gut.",
            "start": 3835516,
            "end": 3891418,
            "confidence": 0.9250457142857144,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ÿousand, Gratulation an alle Mitarbeiter, die in den Genuss kommen konnten, weil ich glaube auch in der Anfangszeit bei Nvidia und bei Meta und wo ist. Das ist alles kein Spaß. Also Startup ist, man programmiert nicht nur, sondern wenn das Klo geputzt werden muss, putzt das auch mal das Klo.",
            "start": 3891434,
            "end": 3906256,
            "confidence": 0.9281111764705884,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "So ist das schon lange her, dass die Startups waren, aber hat es wahrscheinlich auch jetzt.",
            "start": 3906328,
            "end": 3911136,
            "confidence": 0.8186437499999998,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt kommen wir mal ganz kurz zu dem Punkt. Ich habe jetzt Anteile und die sind vielleicht auch schon gewestet. Ich habe meine drei, vier Jahre durch, aber jetzt findet kein Liquiditäts Event statt. Also die Firma geht nicht an die Börse, die Firma wird nicht gekauft und das ist ja in letzter Zeit, ich sag mal des öfteren so gewesen. Ich glaube der letzte Tech IPO war irgendwie Reddit und da ist ja relativ wenig im Markt, was da jetzt gerade, ich sag mal über die Ladentheke geht. Ist das nicht auch ein riesen Problem jetzt gerade für Leute, die Firmenanteile haben, weil die sehen Wirtschaft gerade ein bisschen schwierig? Der Zins wird jetzt gerade von Stopp europäischer letztens von vier auf dreieinhalb 3,7 Ÿ gesenkt. Ja, fängt langsam an, wird aber noch ein paar Quartale dauern. Wie sieht der Zins in den USA aus? Weiß ich jetzt gerade nicht. Also Börsenfenster sind jetzt gerade nicht würde ich sagen.",
            "start": 3911168,
            "end": 3956914,
            "confidence": 0.89331275,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, also das Problem existiert für Investoren, aber damit auch für Mitarbeiter. Also in den ESOP Programmen, also in diesem Hauptletter sozusagen oder Hauptdokument werden immer in der Regel sogenannte Liquiditätsevents beschrieben. Das sind Stichtage, zu denen die Option sozusagen ausgeübt oder liquidiert werden ist, zahlungswirksam werden kann. Also wo wo du Cash bekommst einfach gesagt oder demnächst Cash bekommst. Typischer Beispiel ist ein Börsengang IPO, das ist in der Regel der Best Case. Das heißt, wenn die Firma an die Börse geht, steht dann relativ klar, dann werden deine Optionen in echte Aktien gewandelt oder du bekommst einen Anspruch auf die Differenz bei einem Visa Programm, virtuellen Programm. So ein anderes Liquiditätsevent ist in der Regel beschrieben als mehr als 50 % der Firma Firmenanteile wechseln den Besitzer. Das ist eine Akquisition einfach gesagt, ein Verkauf der Firma. Kann auch mal ein Merger sein oder andere Sachen, aber in der Regel sogenannter Trade Sale oder Verkauf, das wäre ein Event. Und jetzt hast du vollkommen recht, es gibt Phasen, in denen das wenig passiert, z.B. trade Sales Verkäufe werden gerade viel von Wettbewerbsbehörden blockiert, also große Unternehmen dürfen gar nicht mehr so viele Unternehmen kaufen. Bei IPOs entscheidet das Börsenwetter immer, dass manchmal passieren so 2021 22 passieren ein paar hundert und jetzt passieren keine 20 im Jahr oder nur eine kleine zweistellige Anzahl und dann fehlt es eben an diesen Liquiditätsevents. Und es gibt aber verschiedene andere Möglichkeiten Liquidität zu schaffen, einfach weil Unternehmen auch wissen, dass ihre Mitarbeiter irgendwie nach nach vier, fünf Jahren, acht Jahren Arbeit irgendwann dann vielleicht sich doch, also du kannst ja eine Situation sein, dass deine Aktien pro forma irgendwie Millionen wert sind und trotzdem kannst du ja noch nicht mal ein Haus kaufen im Silicon Valley oder so. Und dann wollen Mitarbeiter natürlich manchmal Liquidität haben und dann gibt es verschiedene Möglichkeiten die zu schaffen. Es gibt so z.B. secondary Marktplätze, equity sense eine, es gibt noch zig andere, aber wo wo ich entweder als Gruppe oder als Einzelner meine meine Aktien oder Optionen verkaufen kann. Auf der Käuferseite sind dann wieder andere Individuen, die vielleicht in das Startup investieren wollen, aber nicht können. Oder es gibt auch Fonds, die das im großen Stil kaufen. Secondaries. Also Secondaries heißt einfach, es fließt kein neues Kapital in die Firma, sondern ich kaufe nur die Anteile von bestehenden Investoren oder in dem Fall Mitarbeiter. Man kann sogenannte Tender organisieren. Ich glaube, das ist bei Klarna oder Revolut passiert, dass man sagt, wir finden jetzt einen Käufer, der gerade 5 % der Firma kaufen will und dafür dürfen ESOPs im Wert von 5 % oder eventuell auch ein paar Altinvestoren, die ganz lange schon dabei sind, dürfen insgesamt 5 % der Firma verkaufen. Es wird in so einer Art Bookbuilding Programm der richtige Preis dafür gefunden. Also im Tender ist eine Ausschreibung mehr oder weniger und dann dürfen alle sagen, mit wie viel Equity möchten sie daran teilnehmen, wie viel möchte ich verkaufen, wie viel möchte ich hinter die Brandmauer bringen, sagt man gern. Und dann findet man einen institutionellen Käufer, in der Regel dafür eine Bank oder eben großen Fonds, der sich dafür interessiert oder ein Investor, der vielleicht will die Firma kein neues Geld mehr nehmen, weil sie schon profitabel ist, aber es gibt trotzdem jemand, der Anteile kaufen will. Dann kann man so einen strukturierten secondary sale organisieren im Sinne der ersten. Also die, die am meisten drücken, sind in der Regel die Mitarbeiter, aber auch die Erstinvestoren, weil so Startups, irgendwie so ein Get your Guide oder Revolut, die es vielleicht schon irgendwie 1314 Jahre gibt, da wollen manchmal die ersten Investoren auch einfach raus und dann organisiert man so eine secondary Runde, so ein Tender. Oder man kann das eben auch über Marktplätze machen, je nachdem wie groß das ist. Das können entweder klassische Broker machen oder auch digitale Marktplätze.",
            "start": 3957082,
            "end": 4153711,
            "confidence": 0.9206096313364054,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Irgendwie bleiben bei mir halt immer die negativen Fragen hängen. Andi hat im Vorhinein schon gesagt, du musst ein Devil's Advocate spielen in Bad Cop. Also darum noch vielleicht noch so eine so eine abschließende Frage, die mir mal jetzt auch in den Sinn gekommen ist mit der neuen Gen Z und und den ganzen Bewegungen der jungen Leute, die mehr nach Purple suchen und vielleicht auch nicht mehr so fulltime arbeiten wollen und nicht mehr in die Hassel culture und so weiter einzahlen wollen. Siehst du das ganze Modell mit Anteile in der Zukunft noch gleich stark? Weil auch dieses Hypergrowth ist zumindestens aktuell vielleicht ein bisschen weniger, dass die Leute in Zukunft einfach sagen, ich will meinen sinnvollen Gehalt, mein quasi Grundeinkommen unter Anführungszeichen und ich mache mir ein schönes leben und es ist nicht mehr so wichtig, dass sie da irgendwie dieses IPO als Ziel habe und dorthin arbeite.",
            "start": 4153775,
            "end": 4204639,
            "confidence": 0.8713620394736837,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich würde sagen Zweitausendein nicht generalisiert, aber für den speziellen Fall von Startups und Wachstumsunternehmen ist das nicht das richtige Profil von Menschen, die man einstehen sollte, wenn jemand sein Leben so gestalten will und kann. Und ich glaube, den Luxus gibt es im Moment, deswegen würde ich auch niemandem vorschreiben, wie er sein Leben zu leben hat. Aber wo ich mir relativ sicher bin, ist, dass es sehr schwer ist, ein erfolgreiches Startup zu gründen mit Menschen, die ihre Freizeit so priorisieren. Zweitausendein. Es gibt sicherlich Jobs, die die gut machen können und oft sind die Menschen trotzdem noch vielleicht produktiver als unsere Eltern durch Technologie und so weiter. Ich sehe das gar nicht so so schwarz weiß, ehrlich gesagt. Aber ich glaube, man wird retrospektiv wenig Startups finden, die jetzt groß geworden sind, weil sie besonders gute Work Life culture angeboten haben. Mir ist keins bekannt, aber eben.",
            "start": 4204719,
            "end": 4255356,
            "confidence": 0.9270919999999996,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Glaubst du, dass es weniger Leute gibt in Zukunft, die die dort mitspielen unter Anführungszeichen, bei diesem Spiel?",
            "start": 4255388,
            "end": 4261148,
            "confidence": 0.788425,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, marginal gibt es bestimmt weniger, aber wir machen oft den Fehler so zu verallgemeinern, so die ganze Gen Z ist arbeitsfaul oder das hast du nicht gesagt, aber so kommt das dann manchmal rüber.",
            "start": 4261244,
            "end": 4272812,
            "confidence": 0.8699360000000002,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Optimiert ihre Zeit.",
            "start": 4272916,
            "end": 4274236,
            "confidence": 0.9880033333333333,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich lerne so, ich bin ja viel so an Universitäten, fairerweise so den gründerfreundlicheren Universitäten und so unterwegs und da sehe ich nach wie vor noch unheimlich motivierte, ambitionierte Menschen. Natürlich verschiebt sich das, also du hast ja nicht unrecht, es verschiebt sich graduell, oder du beschreibst ja auch nur was verschiebt sich graduell? Marginal schon, aber in jeder Generation wirst du Menschen, wirst du Unternehmer und Unternehmerinnen haben und Menschen, die bereit sind mehr zu leisten. Und du wirst auch Menschen haben, die vielleicht Fehler, die unsere Eltern in Erziehung gemacht haben oder so nicht machen oder mehr Zeit für ihre Kinder haben oder für ihre Selbstverwirklichung, die vielleicht am Ende bessere Mental Health dadurch haben und für das Gesamtsystem dann genauso wichtig sind. Aber dass Start ups mit dem Bild zusammenpassen, das glaube ich wiederum nicht. Das ist einigermaßen unfassbar. Nein, das ist halte ich für unwahrscheinlich.",
            "start": 4274388,
            "end": 4319692,
            "confidence": 0.8994387248322151,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die Gen Z ist arbeitsfaul, ist die Headline der Bildtage.",
            "start": 4319796,
            "end": 4323732,
            "confidence": 0.7388679999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das würde Business Insider jetzt über den Podcast schreiben. Den letzten, den letzten Satz, den nehmen wir doch.",
            "start": 4323756,
            "end": 4328120,
            "confidence": 0.8780811111111113,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Sorry, Pip. Wir kommen zum Ende. Ich habe enorm viel in der letzten H gelernt. Hast du noch etwas Pip, was du unseren Hörerinnen und Hörern irgendwie mitgeben möchtest zu diesem Thema?",
            "start": 4328740,
            "end": 4341100,
            "confidence": 0.9489156249999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es gibt keine handfesseln. Man kann jeden Tag mit jedem neu verhandeln, auch wenn man was dummes unterscheidet verschrieben hat, weil am Ende jeder hat ein relativ kurzfristiges Kündigungsrecht oder bzw. Zumindest als Arbeitnehmer hast du die Möglichkeit, relativ kurzfristig zu kündigen. Und wenn man überzeugt davon ist, dass man ein Leistungsträger ist, würde ich jeden motivieren. Und das ist glaube ich, nicht arbeitgeberunfreundlich, wenn ich das sage, sondern auch der Arbeitgeber möchte seine Leistungsträger ja ins Unternehmen binden. Deswegen würde ich, auch wenn manche Chefs vielleicht nicht mögen, wenn ich sage, aber ich würde jeden dazu einladen, öfter als nötig in solche Verhandlungen zu andersrum den den Leadern oder Teamleitern würde ich sagen, kann manchmal Sinn machen, den Menschen dieses Gespräch zu ersparen und das selber öfter zu suchen. Also ich habe versucht, als ich Teams geleitet habe, denen die Gehaltserstriche abzunehmen und für sie zu führen, weil es gibt Menschen in technischen berufen, die sich einfach gar nicht selber verkaufen wollen und nicht gut finden, aber sie gehen dann trotzdem irgendwann wegen €500 beleidigt zum Konkurrenten. Und um das auszuschließen, habe ich versucht, ihnen diese Last abzunehmen und habe das selten bereut, ehrlich gesagt.",
            "start": 4341140,
            "end": 4399488,
            "confidence": 0.9064935714285715,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Solche Teamleiter würde ich mir vermehrt wünschen. Ist mir glaube ich, erst einmal in meinen letzten 1415 Jahren passiert oder so, aber hat mich auch daran gewundert. Ich war überrascht, aber ich würde das als Wort zum Sonntag.",
            "start": 4399544,
            "end": 4410996,
            "confidence": 0.8892586842105265,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber das gehört halt auch zum Compensation Package. Es gibt bestimmt Menschen, die eine Woche gestresst sind vor so einem Gespräch und auch sowieso gar keine Lust darauf haben. Also sie gehen gar nicht mit Erwartungen daran. Sie gehen eh davon aus, dass sie nicht mehr Gehalt bekommen, sind trotzdem noch vorher gestresst. Und wenn du jemandem das abnehmen kannst, indem du ihm freiwillig einfach einen fairen Betrag zwischen vielleicht fünf oder 10 %, ich glaube unter 10 wird schon echt schwer bei Tech Berufen freiwillig gibst und sagt über deine Performance haben wir schon geredet und dass du mehr Gehalt bekommst, ist fair. Wir sehen ja auch, wie sich der Markt entwickelt. Wir müssen jetzt nicht dieses Armwrestling im Konferenzraum machen. Ich glaube, das kann einen zu einem super attraktiven Arbeitgeber machen. Es spricht sich auch rum, das warum, worüber Menschen vielleicht auch reden und Kollegen mitbringen, das ist vielleicht wichtiger als ein Signing Bonus am Ende.",
            "start": 4411188,
            "end": 4457008,
            "confidence": 0.8944529746835448,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich habe nochmal im Namen der Hörerinnen und Hörer, natürlich auch im Namen von Wolfgang und mir zu danken, dass du dir die Zeit genommen hast. Mir hast du auf jeden Fall auch enorm viele, ich sag mal, Vorurteile und Mythen ausgeräumt. Ich habe immer gedacht, Verbesserungen wäre nur schlecht, z.B. das hatten wir ja auch besprochen. Aber auch diese ganze Unterscheidung zwischen ESOP, VSOP, Rsius, weil das ist ja wirklich, ich sag mal, ein Buzzword Dschungel. Ich könnte eine Bingo Karte mit dieser Episode hier füllen ohne Probleme. Vielen lieben Dank. Ich würde sagen, wenn ihr mehr über solche Themen hören wollt, schaltet doch mal in den Doppelgänger TikTok Podcast rein. Der kommt mittwochs und samstags. Da geht es nicht nur immer nur um tech Aktien, da geht es auch um, wie performt Shopify und Spotify natürlich und allem drunter. Da geht es aber auch immer oft um Hörerfragen. Was soll ich tun hier? Soll ich eher das studieren oder ich will gründen und jemand möchte mich beim CapTable über den Tisch ziehen oder ähnliches. Also sehr, sehr spannende Fragen. Hört doch mal einfach da rein. Elon Musk ist auch dauerhaft ein Thema.",
            "start": 4457064,
            "end": 4511212,
            "confidence": 0.9038169072164949,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "So viel ich weiß, leider.",
            "start": 4511276,
            "end": 4512876,
            "confidence": 0.824114,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genialer Content jede Woche.",
            "start": 4513068,
            "end": 4514420,
            "confidence": 0.93307,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vielen, vielen Dank. Ich hoffe, ich habe es nicht komplizierter, sondern einfacher gemacht. Es hat sehr viel Spaß gemacht, auf jeden Fall.",
            "start": 4514460,
            "end": 4518990,
            "confidence": 0.9408059090909094,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Vielen, vielen Dank.",
            "start": 4519030,
            "end": 4519910,
            "confidence": 0.9820100000000002,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wie immer findet ihr die Links in den Show Notes. Vielen Dank und tschüss, bye, bye.",
            "start": 4519990,
            "end": 4524302,
            "confidence": 0.8847524999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sehr gern. Ciao, ciao, ciao.",
            "start": 4524406,
            "end": 4526170,
            "confidence": 0.850662,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und noch einmal zur Erinnerung, wenn du dich für tech interessierst oder alles rundherum, hör mal in unsere anderen Episoden rein. Da ist sicher auch für dich ein Thema dabei.",
            "start": 4528390,
            "end": 4536790,
            "confidence": 0.9621666666666668,
            "speaker": "C",
            "channel": null
        }
    ],
    "confidence": 0.908496945452153,
    "audio_duration": 4537.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}