{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/qrSb89mJt4YdQ44/download/ep_fitness.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "speech_model": null,
    "id": "236d6597-2bae-4687-a1a0-3491b1139ae8",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Als tech bzw. Knowledge Workerin arbeiten wir zwar alle an unterschiedlichen Projekten, an unterschiedlichen Produkten und in anderen Kontexten, doch eins haben wir leider alle gemeinsam. Wir sitzen den Großteil des Tages recht statisch auf einem Stuhl vor einem Computer. Es ist zwar oft bequem, aber wie gut ist es denn für den eigenen Körper? Und auch sonst, der Alltag ist oft stressig, eine Deadline jagt die nächste, back to back Meetings stehen an und niemand hat bzw. Nimmt sich wirklich die Zeit, sich mal halbwegs was gesundes zu kochen, stattdessen schnell zum Imbiss nebenan. Deswegen widmen wir uns mal diesem wichtigen, doch recht techniklosen Thema der eigenen Fitness und Gesundheit und sprechen über die Probleme beim dauerhaften Sitzen, die Folgen von Stress, die Bedeutung von Fitness und die Extreme in Social media. Und das Ganze mit Patrick Cole, einem Personal Trainer. Los geht's. Viel Spaß. Ein sehr, sehr weiser Mann, Ÿousand, hat mal zu mir gesagt, Gesundheit ist das höchste Gut. Und Dieser sehr, sehr weise Mann war mein Großvater, denn ich denke, fast alle Großväter sind sehr, sehr weise. Denn das Faszinierende an der Gesundheit ist, es ist völlig egal, wie viel Geld du hast, denn das kann man sich in der Regel nicht erkaufen. Es gibt zwar ein paar Start ups, die versuchen jetzt in diese Richtung zu gehen. Longivity heißt das oder irgendwie sowas.",
            "start": 4040,
            "end": 84136,
            "confidence": 0.9130637280701754,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Longevity.",
            "start": 84208,
            "end": 85044,
            "confidence": 0.336,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Longevity, wie man sich, glaube ich, deutlich verjüngt. Und die machen ganz crazy Kram mit Bluttransfusionen von jüngeren Leuten und was weiß der geil nicht. Schauen wir mal, wie lange wir Elon Musk und Co. Noch ertragen müssen. Aber dass wir gar nicht auf diese Mittel zurückgreifen müssen, haben wir uns mal gedacht, wir tackeln dieses Problem mal und versuchen mal so ein bisschen Awareness zum Thema Gesundheit, Ernährung und Fitness [SOS/EOS], in eure Software Engineering Bubble zu kriegen. Auch wenn ihr denkt, das ist nichts für euch. Im Endeffekt müsst ihr essen, im Endeffekt müsst ihr euch in irgendeiner Art und weise bewegen. Deswegen, also das ist, ob ihr wollt oder nicht, Teil eures Lebens. Und unabhängig davon, ob ich Sport mache und der Wolfgang auch jeden Tag mal irgendwie den Berg hochkraxelt in Österreich ist es so, wir haben davon nur begrenzt Ahnung, weil wir haben Ahnung von Software Engineering und Menschen, aber wenig von Sport und Ernährung. Und aus diesem Grund haben wir uns professionelle Hilfe dazu geholt. Und deswegen begrüße ich Patrick Kohl. Hallo.",
            "start": 85152,
            "end": 148314,
            "confidence": 0.9112217977528088,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hallo. Hallo zusammen.",
            "start": 148442,
            "end": 150030,
            "confidence": 0.7913166666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Patrick, ganz kurz für die Hörerinnen und Hörern an den Lautsprechern. Wer bist du? Du bist seit über 12 Jahren selbstständig. Als Personal Trainer. Du machst natürlich Personal Training als Personal Trainer. Du machst aber auch sogenannte company Fitness. Und da haben wir uns nämlich auch kennengelernt. Du warst nämlich im Company Fitnessbereich bei Trivago unterwegs und hast da unter anderem Sportkurse geleitet, Yoga Kurse und so weiter und so fort. Du machst sogenannte.",
            "start": 150370,
            "end": 176846,
            "confidence": 0.9034897297297301,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hattest du Kontakt mit Andi? War Andi brav in deinen Kursen?",
            "start": 176918,
            "end": 180246,
            "confidence": 0.88141,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Der war eins, zweimal dabei, ne, ein.",
            "start": 180398,
            "end": 183670,
            "confidence": 0.7083914285714286,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Zweimal, dann war er wieder weg und.",
            "start": 183710,
            "end": 187462,
            "confidence": 0.9251042857142858,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Dann mal ein paar mal im Gym erwischt.",
            "start": 187486,
            "end": 189710,
            "confidence": 0.97901125,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich habe Respekt gelernt von Patrick, wenn man so möchte. Aber neben der Company Fitness machst du auch Bootcamps und Kita und Grundschulsport, was ich sehr, sehr schön finde. Wir nehmen auch hier gerade auf. In dem Videostream sieht man, dass Patrick in seinem kleinen Studio in der schönsten Stadt Deutschlands ist, nämlich in Duisburg. Und da gibt es so eine Sprossenwand. Wir veröffentlichen den Screenshot später mal auf Social media. Und bei dieser Sprossenwand habe ich direkt so ein Flashback aus diesen kleinen Grundschultourenhallen von früher. Aber nun gut, du wohnst leider nicht in der schönsten Stadt Deutschlands, sondern in einer Nachbarstadt, Mülheim an der Ruhr. Du kommst aber aus den USA, aus Pennsylvania und hast auch an der University of Pittsburgh unter anderem International Business mit dem Nebenfach Sportwissenschaften studiert. Studiert. Und auf deiner Webseite beschreibst du deinen typischen Kunden. Und wenn ich es nicht besser wüsste, beschreibst du uns hier alle irgendwie. Und zwar beschreibst du deinen typischen Kunden als jemanden, der einen Bürojob hat, der stressig sein kann, mit seiner Körperhaltung zu kämpfen hat. Ich glaube, jeder, der kontinuierlich auf einem Bürostuhl sitzt, tut dies. Jemand, der vielleicht Schmerzen im Rücken oder in den Gelenken hat, jemand, der weiß, dass er etwas, dass er oder sie etwas ändern muss, ist sich aber unsicher, was er oder sie zu tun hat und ist vielleicht auch nicht ganz so motiviert. Und dass sich im Laufe des Lebens sich etwas gesünder bewegen möchte und sich stärker fühlen möchte. Also auf mich trifft das alles sehr zu. Deswegen finde ich das sehr schön. Wolfgang, trifft diese Attribute auch auf dich zu?",
            "start": 189830,
            "end": 282960,
            "confidence": 0.9203282720588235,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Natürlich trifft alles auf mich zu.",
            "start": 283120,
            "end": 285260,
            "confidence": 0.9747916666666666,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wie bist du auf diese Definition deines typischen Kunden gekommen?",
            "start": 286120,
            "end": 288904,
            "confidence": 0.9449499999999998,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Zweitausendein? Ich mache das ja schon sehr lange. Also die Leute sind alle zu mir gekommen mit den gleichen Problemen. Ich habe Probleme mit meiner Haltung, mein Schultergelenk, mein Kniegelenk, was auch immer. Und am Anfang, wo ich Personal Training gestartet habe, ich komme ja aus dem Sportbereich, ich habe ja auch ein bisschen Profibasketball gespielt, auch hier in Deutschland und habe dann früher gedacht, ich will so ein bisschen mehr in Athletiktraining und so, mehr für Sportler. Aber mit der Zeit kamen immer mehr Leute zu mir, die Bürojobs hatten und die haben immer diese gleichen Probleme gehabt. Meine Haltung, die wollten kein Sixpack haben oder große Muskulatur, die wollen ihre Haltung verbessern, sich besser fühlen, sich wohler fühlen. Und dann habe ich gesagt, okay, dann muss ich mich jetzt auf diesen Kundenstamm sozusagen konzentrieren und nicht der Topathlet oder Leute, die Sixpacks haben wollen, sondern wirklich nur Leute, die sich fitter fühlen wollen.",
            "start": 288952,
            "end": 343136,
            "confidence": 0.9076450967741939,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wo siehst du denn so ganz allgemein die Probleme in diesem Bürojob Umfeld? Also bei uns sozusagen bei den ganzen, vor allem Programmiererinnen und alle, die halt am Computer den ganzen Tag sitzen, 8 Stunden Computer in einem, in einem Stuhl zu sitzen. Wo, wo sind da die größten Probleme in dieser ganzen Bubble?",
            "start": 343288,
            "end": 363876,
            "confidence": 0.9016644444444444,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Habt ihr schon mal einen Arm oder irgendwie was im Gips gehabt? Ja, ja, habt ihr, wenn man den Gips abnimmt, merkt ihr, dann habt ihr, was für ein Gefühl habt ihr gehabt?",
            "start": 364028,
            "end": 375188,
            "confidence": 0.8784324242424241,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es ist alles tot darunter sozusagen.",
            "start": 375284,
            "end": 377572,
            "confidence": 0.7913450000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Und ich sag das immer bei den Leuten, genau das gleiche passiert, wenn ihr lange sitzt. Also die Muskulatur baut sich so komplett ab. Ich würde sagen 150 %, dass die Grundprobleme, die wir haben, Haltung, Kniegelenk, unter Rückenmuskulatur, was auch immer, kommt alles vom Sitzen, weil wir nicht nur sitzen, sondern langes Sitzen. Und wir sind 8 Stunden, 9 Stunden in einer Position und die Muskulatur, wie beim Arm im Gips, baut sich komplett ab. Und deswegen haben wir dann einfach zu viele Belastung, zu viel Belastung auf die Gelenke.",
            "start": 377756,
            "end": 416224,
            "confidence": 0.8843129347826085,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und weil du jetzt sagst, das lange Sitzen vor allem, was wäre dann kurzes Sitzen? Also ab wann ist was lange?",
            "start": 416312,
            "end": 423580,
            "confidence": 0.9220895238095239,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jeder hat so ein Körpergefühl, wenn man Kinder z.B. anschaut, wir machen ja Grundschulsport, Kindergartensport und wir sehen Kinder, die sind halt viel am Boden. Das Problem ist mit langem Sitzen, ein Stuhl ist bequem. Bequem ist nicht gut, weil dann will man, also auch wenn ich im Stuhl bin, würde ich auch 8 Stunden in eine schlechte Haltung einfach fahren. Wie lange? Das ist immer, man muss den Körper, also man muss sagen, okay, wie fühlt sich das jetzt gerade an aktuell? Merke ich jetzt was im Rücken oder fühle ich mich jetzt aktuell steif oder so? Das Wichtige ist einfach nur, dass man sich halt bewegt mit der Zeit. Man kann jetzt nicht sagen, okay, nach jeder, also ich glaube, es gibt so Apps, alle dreiig Minuten bewegt man sich oder man muss so ein bisschen nach dem Gefühl gehen, das Gelenk einfach nicht, das Hüftgelenk nicht in diesen 90 Grad halten die Schulter nicht hier die ganze Zeit, dass man einfach die Position ändert. Und das ist das Problem halt mit sitzen. Dadurch, dass es so bequem ist, ändert man sich die Position einfach nicht.",
            "start": 423920,
            "end": 484358,
            "confidence": 0.9190082978723406,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn man jetzt mal davon ausgeht, dass wir lang sitzen, was wir alle tun und uns nicht bewegen, was wir auch alle eben tun, was sind so die häufigsten Folgen, vor allem jetzt für die, die vielleicht noch jünger sind und noch keine Probleme haben. Was siehst du denn so für Probleme, die dadurch entstehen, durch dieses lange Sitzen?",
            "start": 484494,
            "end": 501410,
            "confidence": 0.9492428813559323,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was ich sagen muss, das Alter spielt nicht mehr so eine Rolle. Ich sehe wirklich, ich habe Kunden, die sind 22 und die sind so steif und haben jetzt schon auch Bandscheibenvorfall gehabt, also mit 22, also das ist Wahnsinn. Und Kinder, also ich merke, ich mache ja auch Grundschulsport, ab der zweitausendein, sechsten, siebten Klasse können die Kinder sich nicht mehr anständig bewegen. Die haben Probleme, sich am Boden hinzusetzen und aufzustehen. Also das heißt, die meisten, also viel, man hat Schulterprobleme durch die Steißbein nach vorne, man hat Nackenprobleme, Migräne, Knieprobleme, Hüftprobleme, untere Rücken, Bandscheibenvorfälle, Fußgelenk, dadurch, dass man nie am Boden geht und in die Hocke zweitausendein wird der Fußgelenk steif, mit der Rilleszene bekommt man Probleme. Also alles.",
            "start": 501490,
            "end": 552750,
            "confidence": 0.8778750819672126,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also es geht im Prinzip auch darum, dass die Dinge steif werden, weil das Knie wäre ja nicht belastet beim Sitzen, weil das hängt ja nur rum. Aber es geht darum, dass es eben nicht belastet wird und dadurch eben nicht trainiert wird, oder?",
            "start": 552830,
            "end": 564638,
            "confidence": 0.9610581818181818,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee, also man hat ja das Skelett und das Skelett ist ja dafür da und also sagen wir, die Gelenke sind ja dafür da, dass wir uns überhaupt bewegen können zweitausendein. Die Muskulatur ist dafür da. Also die Gelenke muss man verstehen, weil viele verstehen, okay, Gelenk, ein Gelenk ist ja eigentlich schwach, es ist ein Schwachpunkt vom Körper und unsere Muskulatur dient, um die Gelenke sozusagen zu schützen. Das heißt, wenn wir unter Belastung stehen, wir spazieren oder wir joggen oder wir springen oder was auch immer, die Muskulatur entlastet die Gelenke. Die Gelenke haben auch Bandscheiben z.B. sind wie Stoßdämpfer, um die Gelenke so ein bisschen zu schützen, dass man keine Verletzungen so schnell hat. Aber durch Das lange Sitzen, wie der Arm im Gips, baut sich die Muskulatur komplett ab und dafür dann haben die Gelenke keinen Schutz mehr, die haben nur die Stoßdämpfer, die Bandscheiben. Aber das ist viel zu viel Belastung. Wenn wir jetzt nach vorne gehen und ein Kasten Bier hochheben oder sowas, das ist dann einfach viel zu viel Belastung dann für nur die Gelenke, wenn da keine Muskulatur ist. Also das lange Sitzen ist nicht für die Gelenke, sondern die Muskulatur baut sich ab und dann ist zu viel Belastung auf die Gelenke und dann passieren Bandscheibenvorfälle.",
            "start": 564734,
            "end": 643874,
            "confidence": 0.9304701860465113,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt gehen wir mal ins andere extrem. Also ich habe so eine Apple Watch und die Apple Watch erinnert mich 12 mal am Tag, dass ich für 1 Minute mich hinstellen soll und ab und zu nervt es hart, bin ich ganz ehrlich, jetzt wo ich dir so zuhöre. Okay, ich sollte es mehr befolgen. Meine Frage ist aber, Ÿousand, jetzt haben mehr und mehr Büros und auch dein Homeoffice und haben Leute mehr auf Standing Desks umgestellt. Die können dann ihren Tisch hochfahren und stehen dann mal ein bisschen. Und da habe ich auch mal gehört bzw. Gelesen, lange stehen am Standing Desk 8 Stunden ist aber auch nicht gut komplett. Ist das dasselbe Gefühl bzw. Effekt? Weil beim Stehen aktiviere ich ja auch Muskeln. Also klar, die Knochen machen auch ganz viel, wenn ich mich nicht bewege, aber ich aktiviere ja auch die Muskeln beim Stehen. Also warum ist dann lange stehen jetzt nicht gut, wenn lange sitzen nicht gut ist?",
            "start": 644002,
            "end": 690264,
            "confidence": 0.9180653987730067,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Zweitausendein das Problem ist, also man muss sich vorstellen, egal was für eine Position, lange in einer Position ist nicht gut. Das ist genau das gleiche beim Stehen. Beim Stehen ist es oftmals noch schlimmer, weil wir so eine Fehlhaltung haben von dem langen Sitzen. Das heißt, viele haben den Becken einfach nach vorne gekippt, dann ist zu viel Belastung sowieso auf dem Rücken. Das heißt, wenn wir dann stehen, also der Po, Muskulatur ist tot, eingeschlafen, funktioniert nicht mehr, entlastet nicht mehr den Rücken. Das heißt, wenn wir dann lange stehen, ist noch mehr Belastung auf den Rücken dann. Also das heißt, stehen lange ist auch überhaupt nicht gut.",
            "start": 690392,
            "end": 726160,
            "confidence": 0.9325086363636368,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und wegen nochmal noch mal ein Kommentar oder eine Frage zum Bandscheibenvorfall. Und zwar habe ich mal gehört, jetzt weiß ich nicht, ob das wahr ist, dass es ist völlig egal wie viel Sport du machst, gegen einen Bandscheibenvorfall kann man eigentlich relativ wenig, ich sag mal trainieren oder sowas. Also auch die Top sportler, die einen sehr starken Rücken haben, können vielleicht, sag mal out of the blue einen Bandscheibenvorfall kriegen. Ist das korrekt oder ist das ein Mythos?",
            "start": 726240,
            "end": 752444,
            "confidence": 0.8808615,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ist auf jeden Fall korrekt. Die Wahrscheinlichkeit ist niedriger natürlich für jemand, der einen Bürojob hat, aber der Hochsportler macht ja auch Intensivsport. Das heißt der Körperkontakt Sport, das ist ja auch nicht unbedingt gut für den Körper. Und dann natürlich können auch solche Verletzungen dann passieren. Was man verstehen muss, ist nicht nur, also viele denken, ich muss meinen Rücken stärken. Es geht nicht nur um den Rücken, sondern um die Rumpf, also die Core Muskulatur. Core ist nicht nur Bauch, das ist Bauch, Hüfte und Rücken. Alles was den Becken stabilisiert. Das heißt, man muss eine gute Balance haben zwischen Bauch, Hüfte und Rücken, um den Becken, die Wirbelsäule mit dem Becken verbunden zu stabilisieren oder zu entlasten.",
            "start": 752532,
            "end": 795438,
            "confidence": 0.9037333057851242,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hast du schon kurz mal erwähnt, Migräne als eine Folge von Nackenschmerzen oder ähnlichen Dingen. Wie sehr würdest du das einschätzen? Ist es verknüpft, dass das Ganze dann irgendwie noch, keine Ahnung, mehr in Richtung Stress geht oder dass man, wenn man körperliche Probleme hat, das eben auch Einfluss auf die mentale Psyche hat? Mentale Psyche, das ist doppelt gemoppelt. Mentale Gesundheit.",
            "start": 795534,
            "end": 822330,
            "confidence": 0.9403833333333337,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also ich glaube einfach sehr viel, also wenn ich irgendwie was hatte, Schulterprobleme oder Ÿousand, weil ich früher Basketball gehöre oder Knieprobleme. Ich glaube, also das belastet einen, das stresst einen zusätzlich. Und wenn man jeden Tag irgendwie, keine Ahnung, mein Schulter tut weh oder das belastet einen psychisch. Also deswegen spielt das komplett eine Rolle, also wie der körperliche Fitnesslevel von jemandem ist. Und man sieht, der Körper hat ja so viele Nerven, allein durch die Haltung, die wir haben, wenn wir im Stuhl sitzen. Und die Bandscheiben sind ja mit so viel verbunden. Deswegen haben viele die z.B. ischiasnerv Probleme, die, keine Ahnung, die spüren die Zehen nicht mehr oder sowas, durch das lange Sitzen. Das ist genau das gleiche, was oben passiert. Ganz viele strahlt nach oben und dann hat man Kopfschmerzen auf einmal durch die Haltung. Deswegen, also ich glaube, viele verstehen nicht, wir haben ja ein Skelett, unser Skull, was heißt Skull Nr. Auf Deutsch?",
            "start": 822990,
            "end": 879620,
            "confidence": 0.9083245000000003,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Schädel.",
            "start": 880000,
            "end": 880712,
            "confidence": 0.44676,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Schädel, genau. Ist mit der Wirbelsäule verbunden und Wirbelsäule mit dem Becken. Also eine bestimmte Haltung ist wichtig, damit sich die Gelenke richtig bewegen können, die Schultergelenke sich richtig bewegen können, die Hüftgelenke sich richtig bewegen können. Und durch diese Änderung in Haltung, z.B. becken nach vorne, dann kann sich das Schultergelenk z.B. nicht mehr richtig bewegen und das Hüftgelenk auch nicht mehr. Deswegen, viele müssen halt verstehen, wir haben ein Skelett, Dieses Skelett hat eine bestimmte Position, Haltung, was gesund für den Körper ist. Und wenn diese Haltung geändert wird, können sich die Gelenke nicht mehr so richtig bewegen.",
            "start": 880816,
            "end": 920072,
            "confidence": 0.9055931999999995,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also das bedeutet, wenn ich auf meinem super ergonomischen Stuhl trotzdem dauerhaft so versinke, dann hilft mein ergonomischer Stuhl mir einfach gar nicht.",
            "start": 920136,
            "end": 927248,
            "confidence": 0.8938726086956521,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau. Es gibt ja viele Firmen, die haben €1000 Stühle und für die Mitarbeiter und die haben immer noch Probleme. Man sieht ja, ich weiß nicht, ob ihr davon gehört habt, die Techniker hat ja Zahlen rausgenommen von letztes Jahr über gesundheitliche Probleme zweitausendein und also es gab klar, Stress war Nr. Eins, Burnout dies und dann war Rückenproblem und alles mögliche Nr. Also weiß ich nicht mehr, aber ganz oben auf jeden Fall. Das liegt einfach daran, dass wir einfach zu lange zu viel sitzen.",
            "start": 927344,
            "end": 955574,
            "confidence": 0.9189189534883724,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also ich meine mit den Rückenproblemen, ich kann da ein Lied von singen und ich gebe auch zu, es ist gar nicht so einfach, sich konstant daran zu erinnern, wie man etwas schweres richtig hochhebt. Also in die Kniebeuge gehen, den Rücken gerade machen und allem drum und dran. Und auch bei so simplen Sachen von unserem Alltag, nämlich eine kiste Bier schleppen. Wir schleppen ja alle jede Woche eine neue Kiste Bier. Richtig. Ist es natürlich auch so, dass immer wenn ich Kumpels sehe, wenn die die Kiste Bier hochheben, du hebst aber, wenn du so weiter hebst, nicht mehr viele Kisten Bier hoch. Vielleicht geht es gerade noch mit der mit der Kiste Bier, weil wenn dann eine männliche Person das hochhebt, aber vielleicht sind es mal zwei Kisten Bier oder ein schwerer Sack Sand oder ähnliches.",
            "start": 955622,
            "end": 999990,
            "confidence": 0.9084771942446044,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was wiegt denn überhaupt eine kiste Bier?",
            "start": 1000490,
            "end": 1002442,
            "confidence": 0.9401357142857142,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es kommt drauf an. Einen er kasten, so einen kurzen, oder? Nee, aber ich würde mal sagen, weiß ich nicht, so 10 Kilo.",
            "start": 1002546,
            "end": 1009042,
            "confidence": 0.9017926086956521,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ich würde auch sagen eher mehr, weil du hast ja fast ein Kilo pro Flasche, oder?",
            "start": 1009146,
            "end": 1013106,
            "confidence": 0.9445547058823529,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Okay, ich glaube, ich werde heute nach der Podcast Aufnahme mal eine kiste Bier wiegen. Aber bedeutet das eigentlich, wenn ich das jetzt mal in die Praxis übersetze, dass die ganzen Arbeitnehmer, die jetzt wieder raus aus der Pandemie kommen und ein return to Office herbeirufen und dich wieder ins Büro holen, damit du von deinem Stuhl wieder in den Meetingraum gehst oder dich an der Kaffeemaschine vielleicht mal eine Viertelstunde im Stehen mit deinen Kolleginnen unterhältst, dass das jetzt für unsere Gesundheit ja eigentlich recht vorteilhaft ist, weil man läuft ja in Meetingräume und Co.",
            "start": 1013178,
            "end": 1047425,
            "confidence": 0.9242618750000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau, man bewegt sich. Also es geht darum, dass man einfach nicht lange in der gleichen Position bleibt.",
            "start": 1047497,
            "end": 1052869,
            "confidence": 0.9657499999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt ist es natürlich auch so, dass Knowledge Worker, Software Engineers, Produktmanager, Designer und Co. Also Leute, die die kreativ arbeiten oder vielleicht auch Engineer, Manager natürlich immer einen vollen oder oft einen vollen Kalender haben, also Back to back Meetings. Und jetzt mag es in den seltensten Firmen irgendwie, ich sag mal acknowledged sein, dass man auch ein Meeting draußen im Garten macht. Die meisten Leute erwarten ja schon so ein bisschen old fashioned. Okay, man sitzt am Schreibtisch, weil sonst kann man sich ja nicht konzentrieren. Konzentrieren. Welche Verantwortung hat denn eigentlich der Arbeitgeber für diese ganze Thematik? Denn die Meetings sind ja da, der Alltag ist stressig, teilweise habe ich sogar 6 Stunden am Stück Meetings. Und wir reden jetzt hier nicht von Arbeitsrecht, ob ich das darf oder nicht, das sei mal jetzt dahingestellt wegen Zwangspause und Co. Wie siehst du das als Personal Trainer? Welche Verantwortung ist aus deiner Sicht hat auf den Arbeitgeber abzuwälzen?",
            "start": 1053289,
            "end": 1113118,
            "confidence": 0.8880832500000004,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ich sag das so, der Arbeitgeber erwartet, dass man einen Bachelor hat oder einen Master, erwartet, dass man sich respektvoll benehmen kann. Aber ich sehe das halt schade, dass man, dass der Arbeitgeber nicht sagt, wir erwarten von unseren Mitarbeitern, dass sie auch ein gutes, also gesund sind, dass sie ein gutes Verhältnis zu Sport und Gesundheit haben und wir Ÿousand verpflichten, genauso wie ein Bachelor zu haben in was auch immer, muss man auch gesund sein. Also das wird in der heutigen Zeit wird das, außer du bist, weiß ich nicht, bei der Polizei oder Feuerwehr, da musst du ja ein bestimmtes Fitnesslevel haben. Aber ich finde das schade, dass obwohl die die Arbeitgeber, die wissen ja, wie wichtig es ist. Ich persönlich wäre schon Arbeitgeber. Ja, du musst diese Voraussetzungen haben, um zu starten, weil dann weiß ich selber, wenn du selber um Ÿousand dich, du kümmerst dich selber um dich und deine Gesundheit, dann ist deine Leistung höchstwahrscheinlich auch dann besser. Deswegen sehe ich das schon, dass das einfach wichtig ist. Das wird aber trotzdem nicht in der heutigen Zeit, wie wir leben, das wird nicht verlangt.",
            "start": 1113174,
            "end": 1185842,
            "confidence": 0.8931221989528789,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du machst ja auch Company Fitness oder solche Programme. Siehst du da irgendwie eine Verbesserung in den letzten Jahren, dass sich mehr Firmen irgendwie auch darum kümmern oder das erkannt haben, dass es wichtig ist?",
            "start": 1185946,
            "end": 1197026,
            "confidence": 0.8960980000000003,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, schon, die versuchen etwas. Also viele, also die meisten, die Company Fitness machen, es gibt okay Fitnessstudio Mitgliedschaft, wir zahlen für deine Mitgliedschaft im Gym. Es gibt die Sachen, die ich z.B. gemacht habe, Kurse, wöchentliche Kurse, wo ein Trainer kommt, entweder online oder vor Ort. Dann gibt es noch der Personal Trainer, der vor Ort ist, das teuerste, aber effektivste, weil das auch das Problem ist, die Motivation der Leute. Also bei allen Firmen, wo ich bin, Gym Mitgliedschaft, der gezahlt wird, funktioniert nicht. Also die Zahlen sind weniger als 5 %, die das wirklich dann nutzen, wöchentliche Kurse, auch bei mir, bei meinen Kursen auch wenn die top super sind, die Leute haben mega Spaß, die Zahlen merkt man. Das ist, wenn man guckt, wie groß eine Firma ist und wie viele wirklich daran teilnehmen, das ist einfach viel zu wenig. Ich glaube, die versuchen mehr, weil die wissen, die müssen mehr machen und die Leute verlangen, glaube ich, vielleicht auch mehr so Sachen Team Events mit Sport, mit Obst in der Küche oder Mandelmilch in der Küche. Aber ich glaube, die Firmen müssen halt gucken, okay, welche Sachen funktionieren. Wir sehen jetzt aktuell, dass diese wöchentliche Kurse nicht unbedingt funktionieren, diese Gym Mitgliedschaften nicht funktionieren, wir müssen was anderes machen. Aber ich glaube dadurch, dass das Fitness und Gesundheit jetzt nicht an Priorität steht für die Mitarbeiter, deswegen wird halt nichts geändert. Das sind nur diese Grundsachen, die bleiben. Aber diese Sachen funktionieren ja nicht jetzt.",
            "start": 1197138,
            "end": 1294162,
            "confidence": 0.9123362799999996,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Bei den Kursen z.B. die du, die du gibst in Firmen und wirklich vor Ort bist. Was sich mir immer die die Frage stellt, auch wenn man da jetzt einen Gym zur Verfügung stellt in der Firma, bei Trivago damals gab es ein eigenes, ja, kann man das schon Fitnessstudio nennen, aber war eigentlich schon recht viel da und Laufstrecke am Dach und so weiter. Jetzt ohne der Werbung machen zu wollen, aber ich hatte immer das Gefühl, zumindestens von außen, ich war ehrlich gesagt auch kaum dort irgendwo involviert, dass das eigentlich immer die Leute nutzen, die eh schon super fit sind und eh schon sporteln und am Tag in der Mittagspause die Laufstrecke nutzen und solche Dinge. Wie viel % würdest du sagen, von den Leuten, die in die Kurse kommen, sind eigentlich eh schon topfit und bräuchten das vielleicht gar nicht in dem Sinne? Also brauchen tut es jeder, ist schon klar, aber wie viel % sind eigentlich zweitausendein Leute, die es wirklich brauchen und für die es ganz, ganz wichtig ist, dass die das wirklich machen. Und wie viel sind eher die, die eh schon absolut sportlich sind?",
            "start": 1294186,
            "end": 1355012,
            "confidence": 0.9249234895833336,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Bestimmt 90 %.",
            "start": 1355156,
            "end": 1356636,
            "confidence": 0.9499466666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also nur 10 % von denen, wo wirklich was wichtig ist, dass sie das machen oder wo wirklich das einzige ist, was sie an Bewegung machen.",
            "start": 1356748,
            "end": 1364292,
            "confidence": 0.9129457692307692,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, ja. Und deswegen, wenn man insgesamt guckt, wie groß eine Firma, sagen wir 1000 Mitarbeiter und da sind, weiß nicht, 20 dreiig Mitarbeiter, das sind die, die auch Sport regelmäßig machen.",
            "start": 1364356,
            "end": 1376018,
            "confidence": 0.9438875,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hatten wir gerade ganz kurz noch mal über die Folgen gesprochen, über die möglichen Folgen, was. Und ich hatte ja in der Einleitung gesagt, dass ein sehr weiser Mann, mein Großvater, gesagt hat, Gesundheit ist das höchste Gut. Jetzt frage ich mich natürlich, welche Schäden von langem Sitzen, langen Stehen, zu wenig Bewegung sind denn reparabel? Welche kann ich später noch beheben, wenn ich jetzt sage, ich muss jetzt meinen Lifestyle ändern und ich stehe jetzt so wie meine Apple Watch mir das sagt, 12 mal am Tag auf und welche Schäden zweitausendein sind einfach da und kann man dann nicht mehr beheben. Kannst du, kannst du da ein, zwei Beispiele nennen? Weiß ich jetzt nicht. Du sagtest gerade aus Gelenke werden steif, Muskulatur bildet sich zurück, aber die kann man ja vielleicht wieder aufbauen oder so. Also Welche Schäden sind wirklich kaputt für dein Leben und welche nicht?",
            "start": 1376084,
            "end": 1423440,
            "confidence": 0.9113737999999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Super Beispiel habe ich. Es gibt auch öfters, glaube ich beim Fußball. Ich hatte einen Kunde, der hatte kein Kreuzband mehr. Also Kreuzband durchweg klassischer Fußballer. Genau. Und ich glaube bei Fußballern, die können auch weiterspielen, dadurch, dass die Muskulatur so stark ist bei denen. Und das war, wollte ich erwähnen, bei meinen Kunden auch. Wir haben die Muskulatur so aufgebaut, dass er das Knie komplett bewegen konnte ohne Schmerzen. Die Muskulatur ist so unglaublich wichtig und ich glaube einfach daran, dass gerade auch wenn man kein Kreuzband hat oder einen Bandscheibenvorfall schon hatte durch die Muskulatur, dass man das Gelenk so entlasten kann, auch wenn es schon geschädigt ist, dass man sich trotzdem noch weiter bewegen kann. Also ich glaube schon mit vielen Problemen, die wir haben. Also Bandscheibenvorfall kann man auf jeden Fall hatte ich auch schon Kunden, die sich dann wieder besser bewegen konnten oder kein Kreuzband mehr.",
            "start": 1424380,
            "end": 1485284,
            "confidence": 0.9158483443708608,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich habe ein bisschen geguckt und zwar habe ich einfach Fußballer ohne Kreuzband eingegeben. Zweitausendein und da kommt kommen super viele Artikel, wie z.B. dass irgendwelche Hochleistungssportler kein Kreuzband mehr haben und so weiter und die trotzdem Hochleistungssport machen. Aber auch ein Fußballer und zwar Zlatan Ibromavi Bravovic, ganz bekannter Fußballer, für Leute, die Ahnung da haben, ich bin nicht so einer. Und der hat irgendwie den AC Milan ohne Kreuzband über sechs Monate noch zum Titel geführt. So heißt es auf jeden Fall der Artikel. Er sagt aber auch, er hat Höllenschmerzen gehabt.",
            "start": 1485452,
            "end": 1516826,
            "confidence": 0.8992836170212767,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja okay, er ist aber auch Hochsportler, aber deswegen, die Muskulatur kann unglaublich viel und da müssen wir uns jetzt kümmern. Muskelaufbau, Muskulatur, das ist so unglaublich, gerade im Alter. Also in der Fitnessindustrie wird viel. Ihr kennt das bestimmt alle auch bei mir den Kursen HIT Training.",
            "start": 1516858,
            "end": 1537654,
            "confidence": 0.88902625,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Was ist, was ist HIIT training für alle, die es nicht kennen?",
            "start": 1537742,
            "end": 1541174,
            "confidence": 0.8368483333333332,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "High intensity interval training, das ist sozusagen Herzfrequenz hoch runter, hoch runter. Also du arbeitest quasi mit dem Herzfrequenz. Dann gibt es die meinen okay, ich muss jetzt einen Marathon laufen können, oder man denkt immer okay, Cardio Konditionstraining, Cardio, Cardio, Cardio. Aber die Wichtigkeit von der Muskulatur ist, also ich würde sagen, behaupten so viel wichtiger, weil Muskeltraining, auch Wiederholung steigt, auch das Herzfrequenz. Das heißt, es ist auch eine bestimmte Art von Cardio Training, aber natürlich nicht so, als würde man jetzt sprinten gehen, da steigt der Puls nicht so hoch. Aber viele sehen den Wert im Konditionstraining, weil bei den meisten, die wollen ja Gewicht verlieren und die meisten meinen, man ist fit, wenn man 10 km oder einen Marathon laufen kann. Aber Fitness ist eher Muskulatur, gute Haltung haben, keine Gelenkschmerzen, das ist Fitness. Und deswegen würde ich vielen sagen, sie sollen sich eher auf Muskeltraining konzentrieren, nicht auf die Schritte, die sie am Tag machen, die Schritte, sondern Muskelaufbau, um die Gelenke sozusagen zu schützen.",
            "start": 1541262,
            "end": 1613094,
            "confidence": 0.9038382352941179,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und wie macht man das in der Praxis?",
            "start": 1613222,
            "end": 1615126,
            "confidence": 0.92774875,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es gibt verschiedene Methoden Muskel aufzubauen, also die drei Wege Wiederholung. Z.B. ich mache jetzt Liegestütze, anstatt 15 mache ich jetzt 20 Wiederholungen. So tue ich den Körper sozusagen mehr beanspruchen. Dann kann man Gewicht nehmen, ich mache jetzt Bankdrücken und anstatt 10 Kilo mache ich 20 Kilo. Oder bei der Liegestütze, ich mache Liegestütze an der Küchenarbeitsplatte, dann gehe ich runter auf die Bank oder runter direkt zum Boden. Das ist auch mehr Gewicht, so tut man auch den Muskel mehr beanspruchen. Dann gibt es noch die dritte Variation, ist die Zeit unter Spannung, also die Zeit, wo die Muskulatur unter Spannung steht. Was ich immer sage, ist die beste Methode Muskulatur aufzubauen, weil das auch viel besser für die Gelenke ist, anstatt mehr Wiederholung zu machen. Mehr Belastung für Gelenke und mehr Gewicht drauf, auch viel mehr Belastung für Gelenke. Zeitunterspannung ist einfach, wenn man jetzt eine Niegeschütze oder Kniebeuge macht, zweitausendein, man braucht fünf oder 10 s bis in die untere Position zu kommen und dann erst wieder nach oben.",
            "start": 1615198,
            "end": 1671800,
            "confidence": 0.9060632947976872,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also ganz, ganz langsam die Kniebeuge z.B. zu machen.",
            "start": 1671880,
            "end": 1675136,
            "confidence": 0.8895833333333333,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, ja, ja.",
            "start": 1675168,
            "end": 1676736,
            "confidence": 0.7493166666666666,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es gibt in meinem Sportkurs ich mache, ich mache auch so Functional Fitness, High Intervall, Crossfit Ding und so weiter. Und da gibt es einen Song, der nennt sich Bring Sally Up, Bring Sally Down. Wenn jemand den googelt, den kennt jeder. Und das Problem an diesem Song ist, der wird oft genutzt, 3 Minuten, da gibt es auch echt lange Versionen von so 10 Minuten. Und der Bewegungsablauf ist wie folgt. Du stehst und dann sagt er bring Sally down, sagt er bring Sally up, bring Sally down. Und wenn er sagt down, dann gehst du runter in deine Kniebeuge und du bleibst so lange in dieser Kniebeuge bis er sagt, da singt bring Sally ab. Und das machst du halt konstant und irgendwann hängst du halt so ein ganzen Refrain halt im Brink Sally down unten in deiner Kniebeuge. Also wenn wir jetzt auch um Muskulaturspannung halten und dass das hört sich schon einfach nach 3 Minuten hoch runter, hoch runter, danach weißt du wirklich was du getan hast. Aber das hört sich ja ziemlich viel an, dass du auch sehr viel, ich sag mal sogenanntes körpereigenes Gewicht empfiehlst. Ja, so Bodyweight Training, also eine Kniebeuge, einen Ausfallschritt, vielleicht in der Liegestütz Position nur verharren, ohne mit gerade Brücken hoffentlich ohne Liegestütz selbst zu machen, weil vielleicht bin ich ja noch gar nicht so stark, weil offen gesprochen Liegestütz finde ich persönlich gar nicht so leicht, oder? Ja wie nennt man das? Ein Plank, die sogenannte Plank Challenge gibt es bestimmt auch auf Instagram.",
            "start": 1676928,
            "end": 1755972,
            "confidence": 0.859782265625,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich habe gedacht du machst Planking und Liegestütze mit Sally Andy 3 Minuten machen.",
            "start": 1756076,
            "end": 1760916,
            "confidence": 0.80371,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir auch, aber danach siehst du auch einen See unter mir, weil ich alles voll schwitze.",
            "start": 1760948,
            "end": 1765692,
            "confidence": 0.9189037499999999,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber bleiben wir mal bei den konkreten Dingen, die man ganz leicht umsetzen kann. Patrick, was würdest du jetzt empfehlen, was ich jetzt am Schreibtisch im Office ganz simpel mal machen könnte? Kniebeugen hast du erwähnt, gibt es so irgendwie zweitausendein die zwei, drei Klassiker, die man irgendwie möglichst einfach im Office auch machen kann, hin und wieder, wenn man eben eine Pause macht, jetzt einmal die h oder alle 2 Stunden oder?",
            "start": 1765876,
            "end": 1788890,
            "confidence": 0.8937482191780827,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Klar man kann, man hat ja diese Stehtische jetzt, man kann super Liegestütze gegen Stehtisch, also ihr müsst euch vorstellen, Liegestütze, die Bewegung kann jeder. Man kann, es gibt halt verschiedene Positionen, um es einfacher zu, also wieder mit Gewicht arbeiten, um es einfacher zu machen. Man kann ja gegen die Wand anfangen oder man kann direkt runter am Boden, was am schwierigsten dann ist. Also deswegen könnte man mit dem Stehtisch z.B. arbeiten und Liegestütze gegen Stehtisch machen in einer höheren Position. Umso stärker man wird, umso niedriger kann man es dann machen. Man kann z.b. dips auch machen. Dips ist die Hände an am Stuhl und dann runter auch fürs Schultergelenk.",
            "start": 1788970,
            "end": 1830766,
            "confidence": 0.9143426548672567,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Trizeps Tipps heißt legt die Hände auf meine Lehne am Stuhl und dann drücke ich nach oben, oder?",
            "start": 1830798,
            "end": 1837782,
            "confidence": 0.8751322222222222,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, also man die Hände am Stuhl, die Beine ein Stückchen weiter nach vorne und dann geht man quasi, man beugt das Ellenbogen Po runter zum Boden und dann drückt man sich hoch und spannt den Trizeps sozusagen an. Das ist dann der. Das ist dann der Dip. Ich hoffe, ihr habt mich gehört jetzt am Mikro.",
            "start": 1837926,
            "end": 1855410,
            "confidence": 0.8786898245614035,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Für alle Hörerinnen und Hörer, der Patrick und ich werden vielleicht noch einen Termin vereinbaren und wenn diese Podcast Episode erscheint, dann seht ihr mich vielleicht mal dippen.",
            "start": 1855910,
            "end": 1864376,
            "confidence": 0.9334271428571427,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also wenn ich das jetzt mit meinen Worten beschreiben müsste, Arsch vor den Stuhl, nach unten und dann wieder hochziehen mit ausgestreckten Armen, bis man wieder in ausgestreckter Position ist, ja, an den Lehnen.",
            "start": 1864568,
            "end": 1876860,
            "confidence": 0.9334291176470588,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und ich, ich sag den meisten, man muss, also ich arbeite gerne mit dem Eigenkörpergewicht, weil das, weil viele haben auch keinen Zugang zu Gewichten und mit dem Eigenkörpergewicht kann man auch super. Weil viele haben z. B. In 4 kg Hantel zu Hause. Irgendwann ist das zu einfach. Und um Muskel aufzubauen, muss man ja mehr Gewicht nehmen oder die Zeit unter Spannung. Aber trotzdem, ich sage den meisten, man kann alles mit dem einen Körpergewicht machen. Die Grundsachen. Es sind wirklich nur ein paar Übungen, die man einfach braucht, aber die verschiedenen Level, z.B. liegestütze für den vorderen Bereich, die Brustmuskulatur, Schulter, für die Haltung. Wenn man richtige Liegestütze macht, ist es super. Ich sage immer, das hört sich jetzt vielleicht für manche verrückt an, den Klimmzug. Wir brauchen den Klimmzug, weil erstens ist die top Übung um Rückenmuskulatur. Rückenmuskulatur zieht einen sozusagen in die richtige Haltung und man macht die Arme nach oben. Ihr müsst euch jetzt frage ich euch, wie oft macht ihr die Arme nach oben? Wahrscheinlich nie. Also im Alltag so, das machen die wenigsten.",
            "start": 1877160,
            "end": 1942098,
            "confidence": 0.8963286187845304,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also du meinst einfach nur nach oben strecken?",
            "start": 1942234,
            "end": 1944218,
            "confidence": 0.89737125,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, aber dabei sich halt hochziehen. Jetzt sage ich, das ist eine der schwierigsten Übungen überhaupt, ein Klimmzug. Aber man kann z.B. es gibt verschiedene verstellbare Stangen oder man kann z.B. zum Spielplatz gehen, da kann man super, vielleicht wenn der Andi kommt, dann zeige ich das auch mal. Man kann super Klimmzüge machen mit den Beinen am Boden. Das heißt, man macht einen Klimmzug, genau das gleiche, aber es ist halt viel weniger Gewicht. Oder man kann z.B. bänder nehmen, so Terra Bänder, also Resistance Bands und die kann man super Arme nach oben und irgendwo festschnallen und dann ziehen. Wir müssen halt mehr die Arme nach oben machen, um die Rückenmuskulatur zu stärken. Das machen wir einfach zu wenig. Und das hilft uns einfach allein schon, wenn ihr die Arme nach oben. Die Haltung verbessert sich bei ganz vielen und viele, die steif sind, die nach vorne gebeugt sind, haben Schwierigkeiten, die Arme nach oben zu machen, weil durch die Haltung da fehlt die Beweglichkeit, die Kraft im Rückenmuskulatur und das heißt, die haben Schwierigkeiten, die Arme nach oben.",
            "start": 1944274,
            "end": 2004250,
            "confidence": 0.8894966298342538,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich kenne das von mir, von mir selbst voll mit meiner extrem schlechten Haltung, wenn ich mich gerade an die Wand stelle und nur die die Hände nach oben mit den Händerücken an die Wand und einfach über den Kopf und dann auch wieder nach unten und immer an der Wand bleiben, auch mit den Ellbogen ist extrem schwierig, einfach wenn man, weil man sich extrem nach hinten dehnen muss. Also gerade wenn man eine schlechte Haltung hat und man glaubt, es ist so einfach, da redet man noch über keinen Klimmzug oder sonst was, sondern nur die die Handrücken an die Wand. Das kann schon extrem schwer sein. Frage noch von von meiner Seite, weil es immer oft ein Thema ist, wenn du jetzt sagst Klimmzug, ist es ausschlaggebend, in welche Richtung du die die Hände hältst? Also ob das mit dem Handrücken zum Gesicht ist oder mit der Handfläche zum Gesicht, wie man die Stange greift?",
            "start": 2004310,
            "end": 2053118,
            "confidence": 0.9130527044025165,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Die Handfläche zum Gesicht ist der Rückenmuskulatur arbeitet auch, aber weniger. Das ist öfters den die Bizeps Muskulatur. Also für Leute, die so ein bisschen Bizepstraining machen wollen, kann man gerne machen. Aber wenn man jetzt wirklich nur mal sagt okay, ich will meine Rückenmuskulatur für die Haltung verbessern, da ist die Handfläche weg vom Körper.",
            "start": 2053214,
            "end": 2073048,
            "confidence": 0.9086698214285718,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also Handrücken zum Gesicht steigt den Rücken, beides mal rücken.",
            "start": 2073104,
            "end": 2077392,
            "confidence": 0.8784150000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wer keinen Zugriff zu einer sogenannten Klimmzustange hat, hier zumindestens im Ruhrgebiet gibt es sehr, sehr viele Parks oder Seen und da gibt es dann oft ein sogenannter Trimm Dich Pfad und dieser Trimm Dich Pfad ist oft ein, ich sag mal einen Rundgang spazieren, wo dann auf diesem Spaziergang links und rechts, ich sag mal so kleine öffentliche Fitnessgeräte sind jetzt natürlich nicht zu vergleichen wie mit einem Fitnessstudio oder ähnliches, aber die haben oft so eine Klimmzustange oder ähnliches, da, wo man sich mal dranhängen kann. Und das kann man sehr gut machen, falls man mal eine Runde spazieren geht, auch mit einem Eis in der Hand, gar keine Frage. Und was ich mal gehört habe, ist, sich einfach mal an so einer Klimmzugstange auszuhängen. Also das bedeutet, dass man wirklich in der Luft hängt, die Boden, die Füße sind auch in der Luft, dass ich dann, ich sag mal die Wirbelsäule so ein bisschen entkoppelt, entkoppelt ist das falsche Wort, aber so ein bisschen lang zieht und dann, dass man dann wirklich, ich sag mal, ein bisschen größer wird vielleicht, weil man sich halt so komplett irgendwie so entspannt. Ist das hilfreich?",
            "start": 2077536,
            "end": 2137518,
            "confidence": 0.9071666666666666,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Komplett? Ja, ja, man entlastet sozusagen die die Bandscheiben, die werden entlastet. Deswegen sage ich gerade, wenn man irgendwie einen Hexenschuss hatte oder sowas, ist das auch super. Und den Rücken zu entlasten. Also deswegen hängen ist ganz wichtig. Kinder machen das immer, wir machen das nie.",
            "start": 2137614,
            "end": 2151870,
            "confidence": 0.8932368085106384,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das kann wirklich jeder machen. Da braucht man irgendwie keine sportliche Fitness für und man muss auch nicht schwitzen. Und falls ihr zu Hause keine Eigengewichte habt, ihr könnt natürlich immer eine Pulle Bier nehmen, die wiegt ein halbes Kilo. Wenn die Pulle Bier schon zu leicht ist, kauft euch einfach eine Dose Faxe. Eine faxe Dose ist nämlich 1 l.",
            "start": 2152250,
            "end": 2169001,
            "confidence": 0.868829836065574,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und dann, was ist denn Faxe?",
            "start": 2169016,
            "end": 2171330,
            "confidence": 0.7384366666666667,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Irgend Bier und dann hat man direkt ein bisschen mehr als ein Kilo. Und das Beste ist, ihr habt danach auch noch ein Getränk, weil ihr habt euch dann verdient. Zweitausendein. Ihr habt ja ein bisschen Sport gemacht. Also ich meine, wir müssen ja, wir müssen uns mal eins irgendwie vor Augen führen. Wir machen ja diesen ganzen Sport und diese Bewegung und so weiter, damit wir uns das Eis gönnen können, damit wir den döner Kebab essen können, damit wir das Bierchen trinken können.",
            "start": 2171410,
            "end": 2194792,
            "confidence": 0.9137623529411762,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich möchte übrigens dazu sagen, dieses Product Placement, was der Andi da ständig macht von Duisburg, wie schön da diese Parks sind und so weiter und irgendwelche Faxe Biere oder so sind alle nicht bezahlt.",
            "start": 2194976,
            "end": 2205272,
            "confidence": 0.9158660000000002,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, da, ich glaube, ich muss mal mit Brauerei, der König pilsener Brauerei sprechen, weil da haben wir natürlich ein sehr.",
            "start": 2205456,
            "end": 2212112,
            "confidence": 0.8903952380952382,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Tolles Bier in Duisburg und noch mehr Product placement.",
            "start": 2212136,
            "end": 2214980,
            "confidence": 0.9299866666666665,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also wir kriegen nichts bezahlt. Ich trinke einfach nur sehr gern Bier.",
            "start": 2215400,
            "end": 2219940,
            "confidence": 0.9103991666666666,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wenn wir schon beim Trinken sind, ist es eigentlich ein guter Punkt. Du hast ja am Anfang auch so ein bisschen erwähnt, die die ganze Ernährung, also wir haben jetzt immer über Bewegung gesprochen. Was spielt denn oder wie weit spielt denn die Ernährung in das Ganze hinein und wie wichtig ist die Ernährung für unsere ganz allgemeine Gesundheit?",
            "start": 2220840,
            "end": 2239060,
            "confidence": 0.9362211864406778,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was ich sagen kann ist, also wir haben allgemein einfach ein ganz schlechtes Beziehung zum Essen, ganz, ganz schlecht, also ganz wirklich schlimm. Und wir müssen auf jeden Fall die Beziehung zum Essen verbessern. Ich glaube viele und deswegen sage ich auch Sport, dass man zum Park geht, ein paar Liegestütze macht. Wir bauen kein, also wenn man 8 Stunden jetzt im Büro sitzt und ich war auch früher mal im Büro, dann das stresst, wenn man lange sitzt und man muss ja irgendwo hin, man muss ja irgendwie sich den Stress abbauen und viele greifen halt zum Essen und die sagen boah, ich will jetzt irgendwie etwas Zucker oder fettiges oder sonst was, eine Pizza, das befriedigt mich und das bringt mich runter. Bei manchen ist es auch Netflix vielleicht. Oder aber wir haben einfach eine schlechte Beziehung zum Essen. Und das heißt, wir greifen dann in Stresssituationen, wenn wir gestresst sind zum Essen. Wir wollen ein schnelles Essen haben, also was, was schnell geht, das muss sofort da sein. Und ich sage den meisten, die zweitausendein hören gar nicht, wie der Körper auf bestimmte Essenssachen reagieren. Viele haben Reaktion zum Essen, zum Zucker, zu Milchprodukten, vielleicht zu Fleisch, rotes Fleisch gerade insbesondere merken ich bin habe jetzt einen aufgeblähten Bauch oder meine Haut fängt an zu jucken, z.B. bei mir der Fall ist, wenn ich Zucker esse, viel merke ich, ich komme ja aus USA, wissen vielleicht wie in USA Junkfood kommt ja daher. Und früher hatte ich auch viel Hautprobleme, auch Jucken, Juckreiz, immer mich. Ich habe mich oftmals aufgebläht gefühlt. Das sind so typische Reaktionen, die sind auch andere Sachen. Aber ich glaube, wir durch diesen Stress, den wir haben, wenn wir lange sitzen und wir greifen dann zum Essen und anstatt zu sagen, was essen wir überhaupt? Ÿousand, viele fragen sich das gar nicht und wie fühlt sich mein Körper danach an? Und daran müssen wir einfach arbeiten.",
            "start": 2240240,
            "end": 2371418,
            "confidence": 0.9098010526315781,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich habe mal den Spruch gehört, dass ein schöner Körper nicht im Fitnessstudio, sondern in der Küche gemacht wird.",
            "start": 2371514,
            "end": 2377450,
            "confidence": 0.9437152631578947,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ist wahr. Also ich kann euch sagen, viele wollen, die machen Sport, um schlecht zu essen. Was ich euch sagen kann ist, dass es extrem wichtig ist, dass man sagt, ich will jetzt nicht Sport machen, um eine Pizza zu essen. Es ist aber auch okay, wenn man eine Pizza isst. Es geht nur darum, dass man eine gesunde Beziehung hat zum Essen. Die Gewohnheiten, dass die einfach gut sind und dass man das Essen einfach versteht. Das heißt, wenn ihr übergewichtig seid oder oftmals wissen wir, das hat alles mit der Ernährung zu tun. 150 % würde ich sagen, ist Ernährung. Das heißt, es gibt so viele Leute, die gesund essen, aber gar keinen Sport machen. Das gibt es extrem gesund essen, gar keinen Sport. Die kommen dann zu mir, weil die haben Gelenkprobleme, weil die keine Muskulatur haben, aber die sind schlank. Extrem. Aber ich glaube nicht, gibt es auch Leute, die halt einen sehr extremen Stoffwechsel haben. Die schlechtesten, die dünn sind, also extrem, das klar gibt es das auch, weil jeder einen anderen Körper hat und andere Stoffwechsel hat, aber die Wahrscheinlichkeit ist einfach da einfach höher, wenn man schlechter ist. Dass man einfach mehr Gewicht, einfach mehr Fett hat.",
            "start": 2377530,
            "end": 2454954,
            "confidence": 0.9250370098039218,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hast du schlechte Gewohnheiten erwähnt. Was wären solche Patterns, die, die schlecht sind und die man vielleicht oft sieht?",
            "start": 2455082,
            "end": 2462250,
            "confidence": 0.890841,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also unter Stress essen, snacken. Das heißt, wenn ihr im. Wir haben zu viel Zugriff zum Essen. Essen ist überall. Wir gehen durch den Bahnhof oder durch die Stadt, ist eine Bäckerei überall. Das sind überall diese Snacks. Also wir essen und bereiten das Essen nicht so oft vor. Das heißt, wir kochen gar nicht und es muss schnell gehen. Das heißt, wir sind dann schnell beim Bäcker und holen ein Brötchen. Oder man isst im Büro und jemand hat Geburtstag und man isst Kuchen, aber man hat dann den ganzen Tag oder den halben Tag nichts anständiges gegessen. Das heißt, immer dieses Snacken. Ich weiß nicht, wie das bei euch ist, aber wenn ihr was isst, gerade Zucker, habt ihr dann auch, wo ihr sagt, ja, ich könnte noch mehr essen, zweitausendein natürlich.",
            "start": 2462330,
            "end": 2510044,
            "confidence": 0.9479623880597016,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja klar. Also ist ja bei Zucker extrem, würde ich fast sagen. Ja, ein Stück Tote und dann zweite Stück. Geht immer.",
            "start": 2510092,
            "end": 2517116,
            "confidence": 0.8757290909090909,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Geht immer, ja. Und das ist halt das Problem, wenn man anfängt zu snacken, dann will man immer weiter snacken, anstatt was anständiges zu essen. Und wie gesagt, das schnelle Zubereiten, einfach alles muss schnell sein. Ich muss was bestellen, es muss sofort da sein. Das ist fast food. Leider. Ja. Also snacken schnell, schnell vorbereiten, schnell essen. Am besten viel, was den Körper sozusagen Stress befriedigt. Also wenn man gestresst isst, befriedigt ein Salat überhaupt nichts oder Gemüse. Aber wenn man eine Pizza isst, auch bei mir, oder ist ein Stück Kuchen, man hat diese Glücksgefühle, wo man sagt, das tut gut. Und das ist einfach diese schlechte Beziehung so zum Essen.",
            "start": 2517228,
            "end": 2558966,
            "confidence": 0.9151054867256639,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also seltener essen, dafür aber sinnvoll sind.",
            "start": 2559038,
            "end": 2562384,
            "confidence": 0.8374400000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau. Ja.",
            "start": 2562432,
            "end": 2563560,
            "confidence": 0.86363,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Kommen wir mal zu diesen harten Fakten. Was heißt denn mehr Zugriff, weniger Essen? Ja, das ist ja alles subjektiv und Software Engineers, die mögen es ja, Metriken zu haben, alles zu quantifizieren. Und gehe ich richtig der Annahme, dass wenn wir über viel und wenig essen, dass wir eigentlich unten drunter über die Kennzahl von Kilokalorien sprechen?",
            "start": 2563720,
            "end": 2584140,
            "confidence": 0.9365687931034483,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ich rede nicht gerne über Kalorien, weil das stresst viele, wenn man sagt. Bei manchen funktioniert das, muss ich sagen. Gerade wenn man. Weil man hat dann ein besseres Verhältnis zu dem Essen, wenn man versteht, wie viel Kalorien Kilokalorien in Snickers isst. Wenn ich jetzt diesen Snickers jetzt esse, dann weiß ich, ich habe jetzt 300 Kilokalorien und mein Tagesbedarf liegt bei 1500 Kilokalorien. Jetzt weiß ich, okay, ich habe jetzt schon 300. Dann hat man schon ein besseres Verhältnis dann, weil man dann weiß man, man setzt sich damit auseinander und sagt okay, wenn ich jetzt morgens ein Brötchen esse zum Frühstück mit Mayonnaise und weiß nicht, Remoulade, weiß ich was man auf dem Brötchen ist, fertig ist. Aber wenn man ein Brötchen morgens isst und dann ist man bei, keine Ahnung 500 cal und ich habe jetzt nur 1500 und mittags habe ich im Büro noch ein Stück Ÿousand, eine Pizza gehabt, dann bin ich jetzt weit über meine 1500 und abends will ich jetzt noch ein, keine Ahnung, noch ein Burger essen oder wie auch immer oder ein Brot, obwohl ich schon drüber bin. Dann weiß ich, wenn man Kalorien zählt, dann weiß ich oh, ich kann eigentlich nichts mehr essen, weil ich bin schon über meine Kalorien. Das ist das Gute an Kalorien zählen. Aber das Schlechte daran ist, dass das stresst einen. Anstatt man diese bessere Beziehung hat zum Essen und sagt ja, ich will jetzt vielleicht kein Brötchen essen oder keine Pizza, weil das nicht nahrhaft ist. Ich will Gemüse haben, weil das gibt meinem Körper was es braucht. Und man kann ja, wenn man z.b. gemüse isst, ich kenne keinen der ja, ich will jetzt noch, ich könnte jetzt noch viel weiter essen. Bei Zucker, Brötchen, Kuchen geht das immer. Bei Gemüse, Salat hört man irgendwann auf. Da sagt der Kö nein, ich habe keine Lust mehr. Ÿousand und das ist gut.",
            "start": 2584640,
            "end": 2699968,
            "confidence": 0.8821243302180681,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ist richtig. Ich hatte noch nie Heissung auf Brokkoli. Das, das stimmt schon. Und zwar habe ich persönlich das Problem, dass ich esse sehr, sehr gerne, sehr, sehr gerne und ich hatte nie ein Gefühl dafür, wie viel Kilokalorien verbrenne ich denn so? Dann habe ich mir so eine Apple Watch und so gekauft und habe einfach mal angefangen. Okay, was zeigt mir das Ding so an? Und nur damit war dein Snickers und deine Pizza und so weiter jetzt gerade mal in Relation setzen. Aber ich habe gerade mal kurz gegoogelt. Ein Mann, der 85 Kilo wie ich, zwei und dreiig Jahre alt ist und so circa 180 groß ist, verbraucht so circa 1900 2000 Kilokalorien pro Tag. So circa. Ein normales Croissant, also ein Buttercroissant hat ein bisschen mehr als 400 Kilokalorien. Das bedeutet, du hast 1/5 deines Kalorienbedarfs schon drin. Und du hast jetzt gerade das populäre Snickers, also dieser Schokoriegel genannt. Dieser hat 488, also 500 Kilokalorien. Also eigentlich ein jähriger alter Mann, der 180 groß ist, kann vier Sneakers pro Tag essen, bis man eigentlich sein Kalorienbedarf bereits gedeckt hat. Ob das jetzt alle relevanten Nährstoffe im Snickers sind, weiß ich jetzt nicht. Ich meine, da sind Nüsse drin. Ja, also aber nur um das mal in Relation zu setzen. Aber ich kann auch schon verstehen, dass das Kalorien zählen stressig ist, aber auch anstrengend, weil ich gehe ins Restaurant und hol mir einen Salat. Jetzt denkt man sich, ist ja gesund, ist ja, ist ja was Gutes. Ja, da sind Tomaten bei und Gurken und dann ist da die große Cocktailsoße drauf, ein halber L. Ja, oder von mir aus auch Soße Hollandaise. Ich weiß nicht, gibt es einen Salat, wo so ist Hollandaise drin vorkommt? Bestimmt irgendwie, wenn der Spargel blei ist oder so, aber dann ist der Salat ja auch nicht mehr kalorienarm. Er ist zwar vielleicht gut für deine Nährstoffe, aber dann hat man sehr wahrscheinlich auch schon seinen Kalorienbedarf bei einem großen Salat mit Soss Hollandaise. Ordentlich gesprengt, oder?",
            "start": 2700024,
            "end": 2820326,
            "confidence": 0.8976604719764013,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Komplett. Ja.",
            "start": 2820438,
            "end": 2821062,
            "confidence": 0.9531350000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, jetzt ist es natürlich so, dass wir alle irgendwie Knowledge Worker sind und offen gesprochen, kochen braucht Zeit. Also wir haben keine Zeit, vielleicht sind wir stressig, vielleicht haben wir gerade einen Ausfall mit der Infrastruktur oder mein Projektmanager nervt mich schon wieder, weil wir die Deadline wieder zerreißen und allem drum und dran. Wie können wir. Was ist denn dein Tipp, um das mal, ich sag mal so langsam von ich esse blödes Zeug und ich weiß, dass ich blödes Zeug esse zu ich esse besseres. Ich will nicht komplett gesund werden sofort am Anfang, sondern ich möchte mich in die richtige Richtung bewegen. Ich möchte jetzt keinen extremen Switch machen. Was würdest du sagen, sind denn leichte Elemente, die man, ich sag mal, austauschen kann, die einfach keinen Aufwand erfordern im täglichen, täglichen Alltag?",
            "start": 2821086,
            "end": 2867810,
            "confidence": 0.9155852554744526,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also erstens mehr trinken, weniger snacken, weil oftmals hat man durst, wenn man snackt und nimmt dann Zucker. Das heißt, wenn ihr im Büro seid, ihr habt morgens gefrühstückt und dann ist es 11 Uhr und oder sagen wir nee, mittags, ne, ihr habt Mittag gegessen und dann ist es um 12 habt ihr Mittag gegessen, dann ist es 15 Uhr, 14 Uhr und niemand bringt Kuchen vorbei. Anstatt den Kuchen zu essen, zu trinken, einfach Wasser zu trinken. Was auch wichtig ist, sage ich vielen, wir essen gerne Pizza z.b. man muss gucken, dass man versucht Ersatz zu finden, gerade an den Sachen, die man, wo man Unverträglichkeiten hat. Das heißt, ich z.B. hafer kann ich nicht gut vertragen. Ich nutze z.B. flaxseeds, Leinsamen mit Haselnüsse und tue die halt als über Nacht einweichen, so ein Overnight Oats ist das und mit Chia Samen und so auch sehr gut. Das heißt, oder Pizza, anstatt ein normales Pizzateig zu nehmen, kann man auch super mit Linsen arbeiten. Linsen Pizzateig, das heißt, ihr müsst gucken, dass ihr vielleicht Ersatzprodukte ÿousand nimmt. Und was ich sagen kann ist vorbereiten, das heißt, wenn ihr schon Homeoffice, also wenn ihr Homeoffice macht und ihr seid zu Hause und ihr habt nichts im Kühlschrank, dann ist es klar, dass ihr dann Döner bestellt oder so ist es wichtig, dass man einfach zu Hause was hat oder was vielleicht schon vorbereitet hat, dass man einfach, oder im Büro, wenn man im Büro ist, dass man was mitnimmt, dass man was anständiges da hat, anstatt mit den Kollegen dann zum döner Pommendöner zu holen oder irgendwie sowas, ne. Das heißt, das Vorbereiten ist auch ganz, ganz wichtig, dass man immer was mitnimmt, wenigstens eine Mahlzeit, ne, dass man im Büro dann oder zu Hause dann hat.",
            "start": 2868750,
            "end": 2984622,
            "confidence": 0.9018261538461545,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt wenn du trinken sagst, trinken ist ja immer so ein so ein kritisches Thema, zumindestens bei mir, weil ich trinke eigentlich ganz gerne Wasser. Jetzt gibt's da aber natürlich extrem viel Bewegung auch in dem Markt. Es gibt diese, dass man sich diese riechenden Ringe auf das Wasser drauf klemmt, damit man Wasser irgendwie verkraftet, weil es nur Wasser ist, weil es scheinbar das Problem ist bei so vielen Leuten, dass viele scheinbar nicht gerne nur Wasser trinken, sondern gerne den Geschmack haben. Und was ich halt bisher erlebt habe ist, dass die, die klassischen Drinks mit Geschmack halt auch teilweise, gerade wenn es um Zucker geht, natürlich extrem sind. Also auch so in den ganzen neuen Startups, wenn man da so in die Kühlschränke blickt, das sind dann die neuen coolen Vitamin Hipster Getränke drin. Wie blickst du auf das ganze Getränkethema?",
            "start": 2984806,
            "end": 3034150,
            "confidence": 0.9058126388888889,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, also ich sage den meisten, wenn, wenn die trinken, ist ja kein Genuss und deswegen, die Leute sind so zuckersüchtig, dass die auch beim Trinken Zucker brauchen. Man muss, der Körper besteht ja, weiß ich nicht, 60 % aus Wasser. Wir brauchen Wasser einfach um gesund zu sein, damit wir auch klar denken können, damit wir Energie auch haben, damit wir uns gerade im Sommer nicht dehydrieren, was bei vielen passiert. Klar, man könnte vielleicht mit Zitrone arbeiten oder Gurken oder sowas, also von den ganzen Zusatzsachen da, also diese Wasser mit Geschmack und so kenne ich mich überhaupt nicht aus. Ich habe das auch nie ausprobiert selbst natürlich, aber was ich den meisten empfehlen kann, die sollen nicht denken, trinken, ich brauche was süßes. Zucker trinken ist, damit der Körper sich wie Sport und Bewegung wir brauchen das, weil wir den ganzen Tag sitzen, wieder arm im Gips, keine Muskulatur haben. Wir brauchen das, um gesund zu sein. Wasser brauchen wir einfach auch um gesund zu sein. Deswegen soll man genau da die Beziehung zum Essen, die Beziehung dann zum Trinken, gerade wenn man diese Zuckersucht dann hat, ja, dass man das versucht dann zu ändern.",
            "start": 3035130,
            "end": 3108530,
            "confidence": 0.9211282828282824,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber das ist Ein super Tipp, ja einfach mal eine Zitrone irgendwo reinwerfen ins Wasser oder eine Gurke oder irgendwas, dass das irgendein Geschmack reinkommt. Bin mir fast sicher, dass das im Endeffekt besser ist als irgendeine Tablette oder sowas reinzuwerfen. Klar geschweige denn von diesen eben extrem zuckerhaltigen Drinks, wo dann aber gesund oben steht und irgendwie, wenn man da mal hinten drauf schaut, wie viel Zucker wirklich drin ist, auch so in in es gibt so klassische Mineralwasser mit mit leichtem Geschmack auch die sind teilweise extrem zuckerhaltig. Also bin da immer geschockt, wenn ich hinten drauf schaue und und den Zuckerwert sehe. Mir persönlich geht es auch oft so, wenn ich in unterwegs bin und keinen Alkohol trinken möchte, dass es wirklich schwierig ist in Restaurants oder in Bars irgendwas zu finden, außer jetzt Wasser irgendwas. Es gibt kaum was, weil auch die ganzen Säfte und so sind natürlich extrem zuckerhaltig. Also es ist es ist schwierig da eine Alternative zu finden. Ich persönlich kämpft ich immer damit.",
            "start": 3108650,
            "end": 3165530,
            "confidence": 0.8729538011695902,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Pro Tipp im Homeoffice, falls ihr sagt Zitrone ist nicht meins, zu einer Gurke passt super ein Gin Tonic im Wasserglas, weil das sieht nämlich keiner, ob das ein Gin Tonic ist.",
            "start": 3166430,
            "end": 3177610,
            "confidence": 0.9128453125,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Von wem versteckst du das bei dir daheim im Home Office? Von deiner Frau?",
            "start": 3180750,
            "end": 3184902,
            "confidence": 0.885585,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee, aber wenn ich jetzt z.b. jetzt im Video Call dieses Wasserglas hochhalte ja ihr könnt jetzt denken, dass es Wasser ja, es könnte auch Gin Tonic sein sein.",
            "start": 3185006,
            "end": 3191946,
            "confidence": 0.8104999999999998,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Er möchte nicht verantwortlich sein, dass der Engineering Kiosk jetzt da Leute zum Alkoholiker macht.",
            "start": 3192058,
            "end": 3197390,
            "confidence": 0.805798,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hoffe nicht. Wir mit dieser Podcast Episode hoffen wir natürlich, dass wir die Maße jetzt zu einem gesünderen Leben verhelfen.",
            "start": 3198130,
            "end": 3204990,
            "confidence": 0.8645280952380953,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Alkohol ist natürlich auch noch so eine Sache. Also klar ist natürlich auch dann nicht so.",
            "start": 3205570,
            "end": 3211390,
            "confidence": 0.9704025000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Gewohnheiten, dass das Problem am Alkohol ist glaube ich gar nicht so selbst man selbst, sondern auch ungefähr das soziale Umfeld. Ja also man wird dann oft angestochert hey trink doch eins oder ähnliches, ne und da bin ich auch ganz ehrlich da da muss man ja auch echt einfach stark bleiben. Sagt nein, ich möchte jetzt einfach nichts nichts nichts trinken, weil ich versuche gerade abzunehmen oder oder das wird auch oft.",
            "start": 3213090,
            "end": 3236294,
            "confidence": 0.9017982191780827,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Gerade mit schlechten Essen kombiniert, ne, Alkohol.",
            "start": 3236342,
            "end": 3239030,
            "confidence": 0.8795000000000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und auch noch obwohl Essen in der Brauerei in so ein Brauhaus ist leider immer sehr gut. Kommen wir mal zu unserer Relation zu Fitness und zur Gesundheit in Zeiten von Social Media. Auch ich bin auf Instagram, ich bin nicht auf TikTok, ich bin noch einer der Instagram Boomer. Und wenn ich da mal durch meine Timeline scrolle, dann habe ich so das Gefühl, ich muss jetzt sofort Bodybuilding machen und dabei muss ich noch drei Supplements bestellen. Und jede Übung, die ich bisher in meinem Leben gemacht habe, habe ich anscheinend schon falsch ausgeführt, weil irgendein Instagrammer mir sagt, wie das jetzt richtig geht. Wie blickst du eigentlich als Personal Trainer, Personal Coach auf diese ganze Fitness Szene, auf dieses ganze Social Media, auf diese Extreme?",
            "start": 3239070,
            "end": 3288880,
            "confidence": 0.9256485156249997,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, das ist extrem. Also das beschreibt es genau. Das Problem ist, wir sehen ja die Bilder von diesen Leuten, die 8 % Körperfett haben, unglaublich definiert, große Muskulatur haben, große Muskeln haben. Also ich glaube, der Stress, weil das ist was, was wir hier viel, also viele nicht erreichen werden. Und wir glauben, unser Bild von fit und gesund ist jetzt komplett beeinflusst, weil wir denken, das so wie die aussehen, so muss man sein, um fit und gesund zu sein. Das heißt, Nee, dann mache ich lieber gar nichts, weil so werde ich eh nie aussehen. Das ist komplett deprimierend und das ist schade, weil viele setzen sich zu sehr unter Druck. Die meinen, ihr Schönheitsideal ist einfach, ich muss so aussehen, um fit zu sein, deswegen mache ich gar nichts.",
            "start": 3290060,
            "end": 3342096,
            "confidence": 0.910613533834586,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also wenn ich dich richtig verstehe, dann sieht man die Gesundheit von außen nicht so schnell oder nicht ganz klar an der Körperfigur, sondern es geht darum, dass es sinnvoll ist und weniger, weniger definiert, was man so auf Instagram und Co sieht.",
            "start": 3342208,
            "end": 3360898,
            "confidence": 0.9653230232558141,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau.",
            "start": 3361074,
            "end": 3361626,
            "confidence": 0.87841,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, das eine, also klar, wahrscheinlich, wenn du absolut fit bist und das äußerlich auch siehst, dann bist du vielleicht auch allgemeiner fit, aber es ist nicht zwingendermassen. Du musst nicht super dünn sein, um fit zu sein.",
            "start": 3361698,
            "end": 3372066,
            "confidence": 0.8928413157894736,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Auf gar keinen Fall. Wie gesagt, also die Grundsachen, um fit zu sein, ist wirklich eine gute Haltung zu haben, keine Gelenkprobleme. Um eine gute Haltung zu haben, muss man Muskulatur haben im Oberkörper, dass man keine Gelenkprobleme hat, keine Rückenschmerzen, wenn man jetzt runter geht, dass man sich am Boden hinsetzen kann und wieder aufstehen kann. Dass man auch laufen kann, wenn man spät ist oder rennen kann oder sprinten kann vielleicht zwischendurch. Das sind die Grundsätze, dass man zur fünften Etage laufen kann, ohne dass man jetzt umkippt. Das sind so Grundsachen von Fitness. Und die ganzen Übungen, die man sieht, oder wenn man jemanden online sieht, der Spagat ÿousand kann oder diese Mobility, ist jetzt auch ganz im Trend oder Leute, die keine Ahnung, diese muscle Ups können, kennst du vielleicht Andi, weil du in der Szene so ein bisschen bist. Für was braucht man das eigentlich, um cool zu sein, aber das macht einen.",
            "start": 3372138,
            "end": 3426746,
            "confidence": 0.9007879746835441,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Nicht fit, wenn du, wenn du sagst vom Boden aufstehen heißt, dass ich setze mich irgendwie im Schneider auf den Boden und versuche ohne Arme aufzustehen oder mit.",
            "start": 3426778,
            "end": 3433626,
            "confidence": 0.8837339285714287,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Arme oder oder wie, aber einfach nur, dass man sich zweitausendein bequem hinsetzen kann. Viele können das nicht, sich bequem im Schneidersitz am Boden setzen oder nicht im Schneidersitz, sondern hinhocken geht auch, dass der Po quasi über die Fußgelenke sind, dass man sich so hinhockt. Viele können das nicht. Ist Wahnsinn.",
            "start": 3433658,
            "end": 3452536,
            "confidence": 0.9028521153846154,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Faszinierend. Okay. Inwieweit blickst du denn eigentlich auf diese ganzen Gadgets und Smartwatches und Fitness Apps? Und ja, hier bei Apple gibt es so Ringe, die man pro Tag ÿousand irgendwie erreichen muss. Das sind so Bewegungsringe und Aktivitätsringe und du sollst, wie gesagt, ich habe gerade schon immer gesagt, 12 mal stehen am Tag für für 1 Minute und solche Geschichten. Inwieweit guckst du denn auf diese kleinen Helferlein? Weil Technik versierte Menschen oder interessierte Menschen, die finden das natürlich schon toll, wenn die pro Tag ihre 600 Bewegungskilokalorien voll haben und dann kriegst du noch ein Badge und eine Urkunde und schön wenn.",
            "start": 3452728,
            "end": 3495306,
            "confidence": 0.8477735238095234,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das einen motiviert, weil ich kenne, ich habe auch Kunden von mir, wenn das einen motiviert, etwas zu machen, ist das super. Also ist das mega, wenn man sagt ja, ich weiß nicht, ich muss jetzt Schritte. Wie gesagt, es geht nicht um die Schritte, sondern die Muskulatur, aber man bewegt sich dann trotzdem mehr und man bleibt nicht lange sitzen, was das Hauptproblem ist. Und man macht dann, wenn man jetzt öfters zur Küche geht, irgendwie einen Kaffee holen geht oder sowas oder zur Toilette geht oder immer wenn ich aufstehe, mache ich eine große Runde oder sowas. Man bewegt sich ja dadurch mehr. Und wenn diese Apps ein motivieren etwas, also mehr zu machen, würde ich die nutzen, natürlich. Aber man soll sich jetzt nicht, weil viele meinen, ich brauche jetzt alle viele Sachen im Fitness ist Trends dadurch, dass die Motivation von vielen nicht, also viele haben Ziele, die einfach nicht erreichbar sind. Das heißt, die erreichen ihr Ziel nie und das heißt, man kann den alles verkaufen. Das heißt, viele Sachen in Fitness, auch diese Gadgets sind auch Trends leider, weil wenn du gesunde Gewohnheiten hast und dich sowieso immer am Boden hinsetzt oder sowieso immer in deine Strecke gehst oder deine Muskulatur, brauchst du diese ganzen Gadgets nicht, weil du deine Gewohnheiten sind super. Das heißt, man soll sich nicht zusätzlich stressen mit diesen Gadgets, aber man kann die nutzen, wenn das ein, wenn man meint boah super, ich habe jetzt mein Badge, ich bin motiviert, dann klar kann man die nutzen, ja.",
            "start": 3495338,
            "end": 3590440,
            "confidence": 0.9321170930232561,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, für alle, die uns immer noch zuhören, wir stehen jetzt alle einmal auf. Wolfgang, stellst du dich bitte hin und.",
            "start": 3590860,
            "end": 3598996,
            "confidence": 0.9189252380952382,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Stehst du schon, Andi?",
            "start": 3599148,
            "end": 3600188,
            "confidence": 0.8308150000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich stehe schon, ja. Ich stehe schon.",
            "start": 3600244,
            "end": 3601760,
            "confidence": 0.7775414285714286,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du stehst schon. Was muss ich machen?",
            "start": 3602100,
            "end": 3604070,
            "confidence": 0.7577942857142856,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir machen jetzt alle einmal eine Kniebeuge, damit wir uns wenigstens etwas bewegen. Also du stellst dich erstmal hin, Wolfgang, weil du sitzt ja schon wieder seit einer Stunde 13. So, und wir machen jetzt alle einmal zusammen, auch ihr an den Mikrofon. Am Mikrofon. An dem Mikrofon. Wir machen das auch, aber auch hier an den Hörgeräten. Wir machen jetzt bei drei alle einmal eine Kniebeuge, ja. Damit wir uns einmal bewegen. Wolfgang, bereit?",
            "start": 3604190,
            "end": 3623926,
            "confidence": 0.9173236000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, natürlich, immer.",
            "start": 3624038,
            "end": 3625030,
            "confidence": 0.87852,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Eins, zwei, drei und runter.",
            "start": 3625110,
            "end": 3627766,
            "confidence": 0.983466,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Muss hier rauf auch wieder? Ja, ja, rauf muss wieder ganz.",
            "start": 3627878,
            "end": 3632530,
            "confidence": 0.7705690909090909,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, ich muss zugeben, es hat sich schon, also es war schon alles ein bisschen verspannt gerade bei mir. Also es war, also es war nicht leicht, fand ich. Also es war schon, hat sich schon komisch angefühlt, weil ich jetzt seit einer Stunde 13 Stunden 14 mit euch die Podcast Aufnahmen mache.",
            "start": 3632910,
            "end": 3645366,
            "confidence": 0.8451586792452835,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wenn wir jetzt schon am Ende sind und damit mit einer Kniebeuge abschließen, was wären denn Patrick, deine zwei oder drei Tipps, wo ich morgen, wenn ich jetzt am Schreibtisch arbeite, anfangen könnte? Ganz, ganz konkrete, ganz einfache Tipps, was ich machen könnte, sei es jetzt ernährungstechnisch oder auch einfach bewegungstechnisch.",
            "start": 3645398,
            "end": 3666900,
            "confidence": 0.9180219607843139,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich glaube, man muss sich immer als erstes, wenn man Fitness anfängt, muss man sich Ziele setzen erstmal und fragen, für was soll ich überhaupt trainieren? Welche Gründe habe ich jetzt?",
            "start": 3667640,
            "end": 3680360,
            "confidence": 0.8757990322580644,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich möchte einfach weiterleben.",
            "start": 3680520,
            "end": 3682216,
            "confidence": 0.929245,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, genau, das muss man sich als allererstes dann fragen, weil wenn man jetzt z.B. Ÿousand Knieprobleme hat, dann kann man im Büro könnte man dann anfangen auf ein beIN. Es gibt verschiedene Übungen z.B. zu stehen und das Knie leicht zu beugen und versuchen immer tiefer und tiefer zu kommen, damit man die Oberschenkelmuskulatur aufbaut. Dann könnte man das täglich z.B. im Büro einbauen oder wenn man Haltungsprobleme hat und ich sage jetzt, ich muss jetzt Oberkörpermuskulatur trainieren, dann könnte man im Büro jeden Tag sagt man ja, ich will jetzt meinen Schreibtisch erhöhen auf diese bestimmte Höhe und versucht dann 10 1520 Liegestütze zu machen täglich in der vollen Bewegung, damit ich Muskulatur aufbaut am Tisch. Genau. Ja, erstmal.",
            "start": 3682368,
            "end": 3729522,
            "confidence": 0.8989996694214876,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das heißt, wie lange dauert das? 2 Minuten oder?",
            "start": 3729706,
            "end": 3733402,
            "confidence": 0.8145000000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also es kommt darauf an, wie viele Wiederholungen man macht und wie viele man schafft. Was ich den meisten mitgeben kann, wenn ihr Muskulatur aufbaut, ihr müsst nicht unbedingt so viele Wiederholungen machen. Wenn ihr 1012 schafft, dann versucht mehr in die, also mehr Gewicht dann wieder zu machen. Das heißt, wenn ihr Liegestütze in auf keine Ahnung, 1,50 m. Der Schreibtisch ist jetzt 1,50 m, dann schafft ihr jetzt 12 Liegestütze mit langsamem Tempo. Dann wisst ihr okay, ich schaffe jetzt 12. Irgendwann, das ist mir jetzt einfach, jetzt kann ich meinen Tisch ein bisschen niedriger machen auf 1,20 m, was dann schwieriger wird bei der Winkel, dann, das ist ja dann mehr Gewicht, dann gehe ich dann noch weiter runter. Oder der Kniebeuge, falls man nicht ganz runterkommt, kann man auch gucken, okay, ich versuche mich immer tiefer zu arbeiten. So weiß ich, dass ich jetzt mehr Muskulatur aufbaue. Also deswegen immer versuchen, in die Endlänge zu gehen und nach vielleicht so circa 12 Wiederholungen, wenn man muss merken, Muskel aufzubauen, gerade in der letzten Wiederholung, dass man, also wenn man bei 12 ist, dass man 13 schon fast gar nicht mehr schafft. Dann weiß man, man hat den Muskel beansprucht und jetzt, okay, jetzt ist es Zeit, sobald ich das schaffe, 12 Wiederholungen, jetzt ist es Zeit, mehr Gewicht zu nehmen. Und das kann man machen, z.b. bei der Liegestütze, indem man einfach tiefer geht.",
            "start": 3733466,
            "end": 3812906,
            "confidence": 0.9078075630252097,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Was ich noch empfehlen kann, falls ihr in eurer Firma irgendwie slack oder Teams oder so nutzt. Oft, sehr oft gibt es da so ein Sports Channel oder ein Fitness Channel oder sowas. Und für mich war es immer leichter, wenn ich gleichgesinnte Leute habe, die das auch wenigstens ein bisschen wollen, weil.",
            "start": 3812978,
            "end": 3832942,
            "confidence": 0.8512784905660377,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber da hätte ich schon wieder Angst, dass da nur alle Sportfreaks drin sind.",
            "start": 3833106,
            "end": 3837050,
            "confidence": 0.8409214285714285,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, aber sorry, aber irgendwann hast du ja auch mit Sport angefangen. Okay, sorry, du machst keinen Sport, du wanderst. Aber. Aber irgendwann habe ich ja auch mit Sport angefangen und ja, man fühlt sich total kacke, aber auf der anderen Seite, die anderen, die anderen sagen ja auch nicht ha, die lachen nicht aus oder sowas, weil im Endeffekt, du bist ja da, um was zu ändern. Und dann im Endeffekt, ich finde es immer geil, wenn jemand sagt, hey, Lass mal Sport machen oder lass mal rausgehen, eine Runde Radfahren oder nicht? Weil auch oft fühle ich nicht, dass ich das möchte, aber ich weiß oft, dass wenn ich mal was getan habe, wie gerade diese Kniebeuge, die wir zusammen gemacht haben, alle zusammen. Du auch an der Box? Richtig. Ich habe mich danach schon besser gefühlt. Ich weiß, ich muss das öfter machen, weil so wie sich meine Knie angefühlt.",
            "start": 3837670,
            "end": 3883968,
            "confidence": 0.9045877124183006,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Haben, also meine Lieblingsregel eigentlich, nachdem der Andi ja auch schon seinen Lieblings Tipp genannt hat, obwohl wir ihn nicht gefragt haben, komme jetzt auch noch mit meiner Lieblingsregel ist einfach keinen Lift oder Fahrstuhl, wie ihr dazu sagt oder zu verwenden und einfach nie, nie irgendwo, also man muss jetzt schwer tragen oder so, aber sonst einfach auch wenn es fünf Stockwerke sind in irgendeinem Bürogebäude oder sonst irgendwo, ich gehe einfach immer zu Fuß und man fühlt sich da auch irgendwie fitter danach, wenn man einfach drei Stockwerke hochgegangen.",
            "start": 3883984,
            "end": 3918592,
            "confidence": 0.8566409890109892,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ist und ich kann bestätigen, es ist glaube ich völlig normal, dass wenn man auch drei, vier, fünf Stockwerke hoch läuft, man ist auch sehr fußgänger. Ich glaube auch der Top sportler ist es.",
            "start": 3918616,
            "end": 3926136,
            "confidence": 0.868230882352941,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, definitiv.",
            "start": 3926208,
            "end": 3927336,
            "confidence": 0.62947,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Patrick, vielen lieben Dank für deine Zeit. Für alle Leute, die vielleicht mal ihr eigenes Problem da eine Antwort gern zu hätten. Man kann auch Geld beim Patrick ausgeben, der macht das natürlich auch in der schönsten Stadt von Deutschland, in Duisburg in einem kleinen Studio, aber der macht das auch online und vielleicht kann man sich da ja mal 1 Stunde oder so mit Patrick unterhalten und sich ein paar eigene Tipps abholen, die auf deine eigene Situation passen. Wir verlinken natürlich Patricks Kontaktdaten in den.",
            "start": 3927448,
            "end": 3960874,
            "confidence": 0.9408622988505747,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Show Notes und die will Andy natürlich jetzt dann noch auf Social Media ganz viele Videos von euch zwei sehen. Jetzt hast du die schon versprochen, die will ja auch auf jeden Fall sagen, werden wir tun.",
            "start": 3960962,
            "end": 3972870,
            "confidence": 0.9033551351351352,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich werde mal nach der Podcast Aufnahme zum Patrick ins Studio fahren und machen wir das mal. Wir nehmen das auf und betreiben das mal vielleicht dann auf Social Media für Sachen, die ihr zu Hause machen könnt. Ich weiß nicht, ob der Patrick im Studio einen Küchentisch hat oder sowas, wo ich dann auch mal diese Züge da machen kann, damit man zeigen kann, damit man das alles schön zu Hause nachmachen kann.",
            "start": 3972910,
            "end": 3991622,
            "confidence": 0.8908425675675676,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Da findet ihr sicher eine Möglichkeit. Ja und vielleicht, wenn ihr uns was Gutes tun wollt, gibt uns jetzt schon mal Ÿousand Sterne auf Spotify oder Apple, bevor an dieses Video online gehen, weil danach bekommen wir vielleicht nur mehr ein sterne Bewertungen. Also bitte jetzt am besten jetzt gleich online gehen und uns bewerten.",
            "start": 3991766,
            "end": 4010532,
            "confidence": 0.8781558181818185,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Danke euch alle. Ich hoffe die Kniebeuge war nicht so schmerzhaft. Ansonsten danke dir Patrick und danke sehr. Tschüss, bis bald.",
            "start": 4010596,
            "end": 4016916,
            "confidence": 0.9208714285714286,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Danke dir.",
            "start": 4016988,
            "end": 4017380,
            "confidence": 0.97905,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.904714128771219,
    "audio_duration": 4025,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}