{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/a85233e6-c9c5-4cdf-a10c-0f099b253216/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "speech_model": null,
    "id": "ea96acf6-9234-403a-a9dd-2045ae2a9e06",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Herzlich willkommen zu einer neuen Episode vom Engineering Kiosk Podcast. Die Welt, die wird immer komplexer. In diesem Kontext ist die Digitalisierung nicht immer förderlich. Die erhöhte Komplexität der Umgebung hat aber auch einen Effekt auf den eigenen Job und auf Leads und andere Führungskräfte. Firmen stehen immer wieder vor der Herausforderung, die richtige Person für diese eine Stelle zu finden. Doch was wäre denn zweitausendein, wenn wir nicht nur eine Person für eine Stelle, sondern gleich zwei neue Mitarbeiter für eine offene Stelle suchen würden? Bestimmt springen dir jetzt ganz, ganz viele womöglich negative Gedanken durch den Kopf und du fragst hä, was? Doch simplifiziert fasst dies das alternative Arbeitsmodell des Job Tandems zusammen. Und genau darum geht es in dieser Episode. Wir sprechen mit Anna Drüing Schlüter von der Firma Twice, die uns einen Einblick in die Art von doppelter Führung gibt. Wir klären, wie das Ganze vonstatten geht, ob es doppelt so teuer ist, für wen sowas eigentlich etwas ist und worauf es bei diesem Modell wirklich ankommt. Als kleiner Transparenz Disclaimer, das hier ist keine gesponserte Episode von Twice und wir haben kein Geld erhalten. Wir waren einfach nur sehr neugierig und hatten Fragen. Also, los geht's, wir springen ins Gespräch. Viel Spaß.",
            "start": 4080,
            "end": 73570,
            "confidence": 0.9071691787439617,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich bin ja seit einiger Zeit zweitausendein selbstständig und ein Hauptgrund meiner Selbstständigkeit ist eigentlich die Flexibilität, die man da gewinnt. Und ich höre dieses Argument eigentlich ganz oft von anderen selbstständigen Personen. Und man hört das Argument auch immer öfters bei Personen, die im Angestelltenverhältnis sind, dass Flexibilität immer, immer wichtiger wird. Und gerade seit Corona hat sich da natürlich viel getan. Andi muss da mit seinem Hund spazieren gehen und andere Späßchen machen. Auch der braucht Flexibilität, zweitausendein. Und darum haben wir uns mal überlegt, wir könnten mal über so alternative Arbeitsmodelle sprechen. Was hat sich denn da so getan seit Corona? Was gibt es denn für innovative Arbeitsmodelle? Muss man immer alles allein machen? Muss man noch 40 Stunden arbeiten? Oder gibt es da eben auch so was wie Jobsharing als großes Stichwort? Und nachdem wir ja da in unseren Arbeitsmodellen sehr gefangen sind, haben wir mal überlegt, wer uns da wirklich weiterhelfen könnte. Und darum haben wir da eine perfekte Gästin gefunden, die uns da wirklich sehr tief weiterhelfen kann, weil sie genau in diesem Bereich arbeitet und zu diesem Thema auch viele Firmen berät. Und darum willkommen, Anna.",
            "start": 76870,
            "end": 147268,
            "confidence": 0.9180687046632122,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Vielen Dank, ich freue mich, da zu sein.",
            "start": 147404,
            "end": 149108,
            "confidence": 0.9430987500000001,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Anna, üblicherweise stellen wir unsere Gäste vor, und das tue ich auch mit dir. Und wer bist du? Du hast international Business in unserem Nachbarland, den Niederlanden, studiert. Wolfgang und ich hatten die Ehre, mit dir mehrere Jahre zusammenarbeiten zu dürfen, und zwar bei unserem ehemaligen gemeinsamen Arbeitgeber Trivago. Da warst du für drei Jahre die Leiterin der Personalabteilung, neudeutsch oder im startup Umfeld heißt das dann Head of Talents und Organisation. Und nach einer kurzen Babypause bist du dann auch wieder zurückgekommen als chief people officer. Das bedeutet, du bist dann in den Vorstand, in das top level Management aufgestiegen und hast das ebenfalls für drei Jahre gemacht. Und inzwischen bist du da aber nicht mehr. Inzwischen bist du Management Director für New Leadership und Client Relations bei TWICE und das circa seit zwei Jahren. Nur mal um ganz kurz zu erklären, was twice ist. Da wirst du, glaube ich, gleich auch noch mal drauf eingehen. Aber eure Vision ist Gender Parität auf allen, in Anführungszeichen, Führungsebenen und Vereinbarkeit für alle. Und das geht natürlich völlig in die, ich sag mal, Kerbe, die Wolfgang im Intro schon erwähnt hat. Ist das richtig? Habe ich irgendwas vergessen zu deiner Person? Wie würdest du dich selbst beschreiben, wenn du jetzt noch eine Sache hinzufügen würdest?",
            "start": 149204,
            "end": 228158,
            "confidence": 0.9096644392523362,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich würde vielleicht den Übergang beschreiben, wie ich von Trivago zu Twice gekommen bin. Das war rückblickend auch nicht wirklich zufällig, sondern aus der Erfahrung heraus. Wie du ja schon gesagt hast, als chief People officer war ich drei Jahre lang junge Mutter gleichzeitig. Und mein Mamaherz hat oft geblutet nachmittags, wenn ich hörte, alle sind auf dem Spielplatz, ich bin nicht dabei. Und deswegen wollte ich mit dem mit der zweiten Schwangerschaft alles anders und besser machen und hatte vor, im Jobsharing durchzustarten. Bin da auch neu auf das Thema aufmerksam geworden. Und mit TWICE, einer Firma, die sich wirklich darauf konzentriert hat, zu Beginn Jobsharing umzusetzen, habe ich dann so den Purpose Job gefunden für mich, weil, wie du sagtest, das Ziel ja oder die Vision ist, Genderparität zu erreichen. Und ich da einfach aus meiner eigenen Erfahrung sehr mitgehe und da sehr viel anderen Menschen, Müttern, Eltern, aber auch Unternehmen weiterhelfen.",
            "start": 228294,
            "end": 289300,
            "confidence": 0.9159618181818182,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und Leute liegen dir immer noch am Herzen, so wie es klingt, oder? Es ist immer People in deinem, in deiner aktuellen Jobbeschreibung kommt People als Wort nicht vor, aber Leadership klingt auch schwer nach Leute und Personen und Menschen.",
            "start": 289340,
            "end": 301756,
            "confidence": 0.8951035,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, auf jeden Fall. Also das eins zu eins, zwei zu eins. Also ist mir immer, liegt mir immer noch sehr am Herzen. Mehr vielleicht als das auf der Bühne stehen.",
            "start": 301948,
            "end": 309984,
            "confidence": 0.9319393548387098,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich habe auch viele one on ones mit dir genießen dürfen damals. Also kann ich nur nachvollziehen und auch bestätigen. Jetzt aber mal die grundsätzliche Frage seit vor allem Corona war, war irgendwie so gerade bei uns in der Industrie oder wahrscheinlich in allen Industrien so ein extremer Game Changer, wo sich auch ganz viel getan hat, eben mit Homeoffice Arbeitsplatzmodellen und wo die Leute vielleicht auch so schnuppern haben können, dass es auch anders geht, dass dieser neun to fünf Job ganz klassisch eigentlich nicht das Ÿousand, das ultimative Modell, das einzige Modell ist und dass es auch überhaupt anders geht. Wenn du so auf die die letzten Jahre zurückblickst, auch jetzt die die Geschichte, bis du in diese Position jetzt gekommen bist und und die speziell auf dieses Thema konzentrierst. Was hat sich denn deiner Meinung so so geändert oder was sind denn auch die die Bedürfnisse, dass es überhaupt neue Modelle braucht? Oder wie ist deine Sicht auf die Industrie, was sich so getan hat?",
            "start": 310052,
            "end": 367890,
            "confidence": 0.8964618452380955,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Kennst du alles nur geclout.com, also Cloud wie die Wolke, nicht Clown wie der Diebstahl, alles nur geklaut. Ein wöchentlicher Newsletter mit kuratierten Inhalten zu IT Architektur, Open Source, Cloud, DevOps, Site Reliability Engineering, IT Security und Management von Andreas Lehr. Er schreibt aber nicht nur einen Newsletter, sondern ist auch Geschäftsführer und Gründer von WeManage, unserem heutigen Episodensponsor. Mit seinem Team betreut er Kunden jeder Größe. Viele seiner Kunden haben als Indie Hacker gestartet und haben nach einem rasanten Wachstum das Management ihrer Infrastruktur mit dem SRE und DevOps as a Service Angebot von Andreas professionalisiert. Gerade der skalierbare Hochlastbetrieb ist eine wahre Herausforderung und das kann sehr, sehr schnell gehen. Vielunterwegs de ein Kunde von wemanage hatte z.B. die richtige Antwort auf eine wer wird Millionärfrage auf der Website und hat so zehntausende Besuche innerhalb von 2 Minuten erhalten. Aber auch geplante Erwähnungen in Print und TV müssen auf der Infrastrukturseite geplant und abgesichert werden. Wenn auch du Unterstützung für deine Infrastruktur benötigst, egal ob kleine Agentur oder großes Unternehmen mit bestehendem OBS Team, Andreas steht dir mit seinem Team zur Seite. Mehr Informationen zum DevOps as a Service von wemanage findest du unter engineeringkios dev wemanage oder natürlich in den Shownotes. Und jetzt geht es weiter mit der Podcast Episode.",
            "start": 368190,
            "end": 455450,
            "confidence": 0.8994414553990611,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also ich sag mal, viele Unternehmen halten noch so an diesem klassischen Modell, das bedeutet Anspruch an Vollzeit Arbeitszeit fest und dass das auch der einzige Weg ist, um Karriere zu machen, halt Vollzeit da zu sein. Wir hören gerade von Müttern, dass sie in Teilzeit oft in der sogenannten Teilzeitfalle stecken, da sie drei, vier der Mütter geben ihren Vollzeitjob nämlich auf sobald sie Mutter werden und wollen oft noch in Teilzeit ihren vorherigen Job, wenn es z.B. eine Teamleitungsfunktion war, weitermachen und scheitern dann aber in der Realität an so kleinen Dingen wie ich bin aber nachmittags für die Meetings nicht da, die wichtig sind und kann da nicht so wirklich teilhaben und Mehrwert bringen, wie ich möchte. So, und manche Unternehmen gehen dann darauf ein oder schieben was, aber es geht auch nicht alles. Und man muss schon sehr flexibel sein. Und deswegen ist es eigentlich aus meiner Sicht eher der Wunsch der Mitarbeitenden, oft weniger zu arbeiten als Vollzeit, aus welchen Gründen auch immer. Das muss nicht Elternschaft sein, das können andere Vereinbarkeitsthemen sein, Zeit, Business, ich spiele gern Golf, whatever, sollte ja auch egal sein. Eigentlich sollten Unternehmen ja froh sein über die Talente, die sie haben. Und Stichwort Potenzial recruiting ist eigentlich zweitausendein machbar machen, Modelle haben, die auf die Individuen eingehen, je nachdem, wie viel Zeit sie einbringen möchten ins Unternehmen. Von daher sehe ich da so noch eine große Lücke. Also die Frauen, aber auch Männer stehen eigentlich Schlange und sagen, ich möchte gerne Teilzeit, aber ich traue mich nicht, das auszusprechen, weil ich befürchte einen Karriereknick. Gerade bei Männern. Haben wir auch schon oft erlebt, dass uns Männer kontaktiert haben und sagen, ich habe meinen Job verloren und ich glaube, es ist, weil ich in Teilzeit arbeite und weil ich ein Jahr Elternzeit genommen habe. Also das, was Mütter oft machen und auch wo sie, was so ein bisschen schon eingepreist ist. Ja klar, die sind oft so ein bisschen abgeschrieben, dann ja, die macht jetzt mal Elternzeit und dann sind die Kinder ja auch oft krank und dann kümmert sich automatisch die Mutter. Das ist ja so das Bild. Dabei wollen sich auch viele Väter z.b. in die care Arbeit einbringen und sind da oft haben sie gar nicht die Möglichkeit vom Unternehmen aus.",
            "start": 455790,
            "end": 591084,
            "confidence": 0.9327449739583336,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Da halten wir aber natürlich schon an knallharten, ich sag mal alten Stereotypen fest, oder? Also ich meine unsere Gesellschaft.",
            "start": 591132,
            "end": 599468,
            "confidence": 0.8960585,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Absolut, ja, total stereotypisch. Und das ist ja auch mit unsere Vision, wenn wir sagen Genderparität und Vereinbarkeit für alle, geht es eigentlich nur, indem alle auch teilhaben können an Elternschaft, also Männer und Frauen sich einbringen können und auch bei anderen Vereinbarkeitsthemen einfach die Unternehmen viel, viel flexibler sind. Und wir wissen ja schon längst, dass Diversität in Teams sinnvoll ist und Mehrwert bringt. Das kann nur keiner mehr hören. Was aber jetzt für uns positiv hinzukommt, ist natürlich, dass Unternehmen sehr, sehr offen sind zuzuhören bei neuen Arbeitsmodellen, weil einfach durch den Fach und Führungskräftemangel sie merken, wir kriegen die Stellen nicht mehr besetzt oder wir können unsere wichtigen Mitarbeitenden nicht halten. Und deswegen sind wir da aktuell schon in sehr authentischen Gesprächen auch und ernsthaften Absichten von Unternehmen, wirklich was ändern zu wollen. Und der Ursprung von Twice, vielleicht da noch mal kurz darauf eingehen, war ja nicht jobsharing prominent zu machen, weil Jobsharing der einzige Weg ist, sondern das Ziel ist ja, die Bevölkerung auch in Unternehmen widerzuspiegeln. Und die Bevölkerung sind 50 50 Männer, Frauen und auch Frauen und Männer studieren gleich viel. Und der Kickout ist halt wirklich, wenn Frauen Mütter werden. Das ist so der Exodus, der Pipeline für Frauen in ihrer Karriere. Und wir wollen da einfach für Chancengleichheit uns einsetzen, also für Männer und Frauen. Und wenn das halt gegeben ist, dann werden sich auch die besten Talente weiterentwickeln in ihrer Karriere, ob Männlein oder Weiblein, egal. Aber diese Voraussetzungen müssen halt geschaffen werden und da ist Jobsharing ein super Mittel, um das mit zu unterstützen.",
            "start": 599604,
            "end": 700924,
            "confidence": 0.9301801509433961,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hätte ich noch Zwischendurch gerade eine Frage an Andy Kurz. Andi, du bist ja nicht so in dem Thema tief drin, darum meine Frage an dich was glaubst du, wie viel Väter in Elternzeit gehen? Wie viel? %?",
            "start": 700972,
            "end": 713968,
            "confidence": 0.8871699999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sehr wenig. Ich kann dir auch, ja, ich will.",
            "start": 714064,
            "end": 717392,
            "confidence": 0.8544666666666667,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Jetzt eine Prozentzahl, weiß ich jetzt nicht.",
            "start": 717416,
            "end": 719400,
            "confidence": 0.9789314285714286,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sagen wir mal 5 %, aber ich kann dir eine kurze Story, sehr gut dran, eine kurze Story von einem Bekannten erzählen. Und zwar ist er in den Vaterschaftsurlaub gegangen und die Frau hat weitergearbeitet, hatte finanzielle Gründe, ganz einfach, weil die Frau mehr verdient hat als der Mann. Deswegen haben die das, ich sag mal als Gegenteil gemacht, wie die Gesellschaft es in der Regel macht, weil oft auch die Gehälter nicht gleich sind und deswegen in der Regel verdient ja die Frau weniger, was sehr, sehr schade ist. Und eine eine Sache fanden wir, ich sag mal lustig, mehr oder weniger bzw. War immer so ein bisschen amüsant. Er hat sie aber sehr amüsant erzählt. Und zwar hat er sich ein bisschen befremdlich auf dem Spielplatz gefühlt, weil er war der einzige Mann und er konnte dann halt bei den Gesprächen von den Frauen halt oft nicht mit einsteigen, weil die Interessen halt einfach so komplett anders waren. Das klingt jetzt auch wieder total stereotypenhaft und ja, natürlich haben wir darüber gegrinst, aber das ist jetzt nicht das, was man eigentlich im Kopf hat, wenn man genau darüber spricht. Also es war so ein Seiteneffekt. Aber Wolfgang, wie ist denn die wahre Zahl? Hast du irgendeine Studie rausgesucht?",
            "start": 719440,
            "end": 787494,
            "confidence": 0.929306761904762,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also wenn ich die Zahlen richtig sehe, ich glaube, es steigt ja auch grundsätzlich, das ist ja mal gut. Aber 2022 waren es 1,8 Ÿousand, wenn ich das richtig sehe, in Deutschland. Und wie viel von denen nehmen mehr als zwei Monate, Andi? Ich glaube, bei zwei Monaten gibt es das gleiche Modell wie in Österreich. Bekommt man eines dazu oder so, oder geschenkt quasi.",
            "start": 787582,
            "end": 806204,
            "confidence": 0.9085661538461534,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also du musst mindestens zwei Monate nehmen.",
            "start": 806292,
            "end": 808604,
            "confidence": 0.8805242857142856,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ah, okay. Darum in Österreich bekommt man noch eines kostenlos dazu, wenn beide das in Anspruch nehmen. Und darum nimmt man das Minimum. Also was glaubst du, wie viel nehmen mehr als diese zwei Monate?",
            "start": 808732,
            "end": 818268,
            "confidence": 0.9115122857142859,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich würde sagen, auch nicht mehr als 5. %. Was ich nämlich ziemlich viel höre aus dem Bekanntenkreis, ist, dass die Männer dann wirklich nur ihre zwei Monate da nehmen und sich nicht mehr leisten. Muss man ja auch ganz ehrlich sagen. Muss man sich auch leisten können, weil ich glaube, dann kriegt man nicht mehr den vollen Zuschuss.",
            "start": 818364,
            "end": 837398,
            "confidence": 0.9224303389830509,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Gern gesehene Ausrede, aber um die Zahl zu nennen, 75 % von diesen zwei oder 1,8 % nehmen nur zwei Monate, also nur 25, %, sprich irgendwie 0,5 % auf die Gesamtzahl gerechnet.",
            "start": 837454,
            "end": 852198,
            "confidence": 0.8705030303030304,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich meine, das ist ja jetzt der Fall, wenn man Nachwuchs bekommt, den verstehe ich auch. Und was ich aber, wo ich wirklich auch relaten kann, ist das, was Anna gerade gesagt hat. Und zwar, wir im IT Sektor, im Tech Sektor sind ja sehr gesegnet, dass wir in der Regel ganz gute Gehälter haben, muss man ja sagen, Fachkräftemangel und so weiter und so fort. Stark nachgefragt, besonders mit dem KI Hype und besonders jetzt in der Zinslage mit viel Automatisierung und Geld ist teuer wieder. Das bedeutet, wir können mal nicht overheiern. Und da kommt es dann auch wieder auf den Punkt an, Arbeitszeitverkürzung von Vollzeit in Teilzeit gehen. Und dann sagt der andere, ja, viele, viele Personen haben dann auch Angst um ihre eigene Karriere. Und ich bin ehrlich, der Gedanke ging mir auch schon durch den Kopf. Ich habe mir auch schon überlegt, gehst du auf vier Tage runter, reduzierst du von den vertraglichen 40 Stunden auf, was weiß ich nicht, zwei und dreiig nehmen wir einfach mal oder dreiigste. Dann ist die Frage, hat das ein Hit auf die Karriere? Ja, vielleicht. Im deutschen Mittelstand sieht man das so. Wie wird das international gesehen? Wie wird das in Europa gesehen? Wie wird das generell, ich sag mal, in der Start up Szene gesehen? Weil dort herrscht natürlich auch immer so eine Hassel Culture, so eine high Performance culture und schwieriger Gedankengang. Ich habe für mich noch keine Lösung gefunden, bin ich ehrlich. Aber ich meine, ich bin mir auch nicht sicher, ob man eine Lösung findet, weil das dann eigentlich Opportunitätskosten werden, weil man ja eigentlich keine zwei Realitäten aufbauen kann. Man kann ja nicht einmal in Teilzeit gehen, gucken, wie sich seine Karriere entwickelt und einmal in Vollzeit bleiben und gucken, wie sich seine Karriere entwickelt. Und Anna, wie du schon sagtest, ab und zu verläuft die Karriere dann vielleicht auch ganz anders, als man dachte. Du hattest von Purpose Job gesprochen und so weiter und so fort. Aber all das, was du erzählst, ja, hier ist das lebende Beispiel. Also ich habe auch solche Bedenken.",
            "start": 852294,
            "end": 959838,
            "confidence": 0.9291157386363637,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich wollte sagen, das ist auch ein super Beispiel eigentlich, wenn du jetzt jemanden in deinem Team hast, so wie dich, Andi, der sagt boah, ehrlich gesagt, wenn ich ganz ehrlich bin, wir können ja offen sprechen. Ich suche schon nach mehr Purpose in meiner Rolle. So, ich habe das jetzt ewig gemacht, ich kenne das, das ist mein Steckenpferd, mein Standbein, aber ich hätte noch gerne ein Spielbein. So soll ich jetzt komplett wechseln? Also diese Situation hatten wir auch schon oft, dass jemand Interesse hat an einem ganz anderen Bereich, sich aber nicht traute, komplett dahin zu wechseln. Das ist z.B. auch eine super Opportunität, wo man sagen kann, bleibt doch im Jobsharing, also im Tandem mit 50 % in einer Rolle zweitausendein und macht zu 50 % eine andere Rolle. Also das sind so Möglichkeiten, eine von vielen, die Jobsharing bietet, also Lösungen für oft unmögliche Herausforderungen und Talentmanagement.",
            "start": 959894,
            "end": 1009486,
            "confidence": 0.8645125657894733,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hast du Jobsharing schon öfters genannt und Tandem. Kannst du uns da mal irgendwie eine Übersicht geben, was die Begriffe jetzt wirklich bedeuten? Ich habe so eine grobe Vorstellung davon, aber irgendwie was bedeutet das im Detail? Gibt es da Unterschied? Ist Tandem eine Untergruppe von Jobsharing oder was gibt es da für Begrifflichkeiten?",
            "start": 1009558,
            "end": 1028389,
            "confidence": 0.9030239999999999,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, also es wird oft synonym genutzt. Also wenn du es genau nimmst, bezeichnet Jobsharing das Arbeitsmodell, in dem zwei Menschen sich eine Rolle teilen und Tandem ist dann der Begriff für genau diese zwei Menschen. Aber ihr könntet z.B. auch wir arbeiten als Tandem zusammen oder wir arbeiten im Jobsharing. Es bezeichnet halt immer diese zwei Personen und die zwei Personen können dann in Summe 100 bis 200 % zweitausendein zusammenarbeiten, also eins bis zwei fte darstellen. Da ist alles möglich. Also ihr könntet weiterhin Vollzeit arbeiten, zusammen im Jobsharing oder in Teilzeit oder einer Kombination. Da ist man quasi ganz flexibel, da erleben wir auch alle Konstellationen, aber man.",
            "start": 1028469,
            "end": 1071260,
            "confidence": 0.9090433333333338,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Arbeitet dann quasi auf einer Position. Also man teilt sich dann alle Aufgaben und Verantwortungen oder wie sieht es dann in der Praxis?",
            "start": 1071300,
            "end": 1080040,
            "confidence": 0.9420921739130435,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, also man ist zwei Personen, aber eine Rolle und eine Schnittstelle. Unser Credo ist immer keine Komplexität fürs außen kreieren. Das heißt, dadurch, dass ihr ein Tandem seid, sollten jetzt nicht eure Kollegen wissen, ach, der Wolfgang ist montags da und der Andi dienstags und dann muss ich den ansprechen und den ansprechen, sondern idealerweise habt ihr eine E Mail Adresse und einen Kontaktpunkt, eine Schnittstelle, wo ihr dann auch immer untereinander natürlich die Informationen habt. Zweitausendein und ihr sortiert euch untereinander. Das kann fürs Außen natürlich mal bedeuten, mal antwortet der eine, mal der andere, aber ihr seid immer gesynct und das Drumherum hat keinen Mehraufwand sozusagen. Übrigens auch nicht der Boss, denn das ist oft die große Herausforderung, würde ich mal sagen, da die Vorgesetzten zu überzeugen, Jobsharing mal zu pilotieren. Wir hören oft, dass sie sagen, finde ich mega, macht total Sinn, ganz toll, aber in meinem Bereich, bei meinen Rollen, da passt es nicht, da kann ich mir das wirklich nicht vorstellen. Aber good luck.",
            "start": 1080480,
            "end": 1146180,
            "confidence": 0.9134906470588232,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "So, für alle Hörerinnen und Hörer, ihr seht das jetzt gerade nicht, aber alle drei Personen in diesem Podcast Call haben gerade gegrinst. So nach dem kann ich mir gut vorstellen, aber nicht bei mir, weil Grund eins, zwei, drei, klassische Ausrede. Wahnsinn, kenne ich auch.",
            "start": 1146840,
            "end": 1162880,
            "confidence": 0.9349604347826089,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Not in my backyard. Das ist ja die klassische Ausrede.",
            "start": 1163040,
            "end": 1166986,
            "confidence": 0.895189,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, und deswegen glaube ich, es ist halt was Neues. Es sind viele vielleicht Mythen damit verbunden und es ist einfach unklar. Deswegen freue ich mich, dass ich heute hier sein kann und dass wir da in der Tiefe ein bisschen darüber sprechen können, wie man z.b. die Aufgabenteilung auch gestalten kann und wie auch man ein Tandem führt, um die Teamleads, die Zuhörenden da vielleicht auch ein bisschen abzuholen und das einfach als Chance zu sehen, es bei sich auch mal auszutesten, wenn es denn für die Rolle Sinn ergibt.",
            "start": 1167138,
            "end": 1195310,
            "confidence": 0.931175934065934,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt also nur damit ich das mal kurz simpel für mein Verständnis wiederhole. Du hast in der Regel eine Position, nennen wir es eine Teamleiterin oder eine Abteilungsleiterin und diese Position wird dann eigentlich von zwei Personen ausgeübt, entweder von beide in Teilzeit bis zum anderen Spektrum, beide voll in Vollzeit, ist das richtig?",
            "start": 1195390,
            "end": 1219766,
            "confidence": 0.934682962962963,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau, es ist, wie du sagst, es sind zwei Personen auf einer Rolle und der Hintergrund kann unterschiedlich sein, warum man das Ganze macht. Ich komme gleich auch zu den Vorteilen. Jetzt kommen wir vielleicht können wir mit den Hintergründen starten. Also es kann z.B. ein Vereinbarkeitstandem sein. Wir haben eben schon über die Eltern gesprochen. Jemand, der in Teilzeit arbeiten möchte, aber auf einer Rolle ist, wo der Anspruch vom Arbeitgeber, Arbeitgebenden ist, dass man in Vollzeit arbeitet, dem gerecht zu werden. Dann erweiterst du quasi einfach deine Verfügbarkeit, indem du ins Tandem gehst mit jemandem, der zu der anderen Zeit verfügbar ist. Ja, du bist im Vereinbarkeits Tandem, du hast immer eine Überschneidungszeit auch, denn der große Vorteil von zwei Köpfen ist ja, dass du auf bestimmten Aufgaben Synergien heben kannst, indem du zusammen darüber nachdenkst. Das heißt, es ist kein Kuchensplit in du machst a die linke Hälfte, du machst die rechte Hälfte, sondern das kann es auch teilweise geben, dass man sich natürlich effizient aufteilt. Man muss nicht Händchen halten, alles zusammen machen, das ist ja komplett ineffizient. Aber auf gewissen Aufgaben, die vor allen Dingen konzeptioneller, kreativer, planerischer Natur sind, macht es total Sinn, zu zweit darüber nachzudenken. Ihr arbeitet ja eigentlich auch im Tandem, so wie ich das beobachte, denn ihr verantwortet gemeinsam den Engineering Kiosk zusammen. Also ihr seid zwei Menschen, ihr habt ein Ziel ÿousand, ihr habt beide Zugang zu allen Informationen, z.b. seid immer c er Kommunikation mit den Gästen und könnt euch so beide einbringen und auch die anfallenden Aufgaben effizient aufteilen. Ich vermute, je nach individuellen stärken Präferenzen habt ihr vielleicht klare Aufgabenteilung. Wolfgang, du hast gerade gesagt, du schneidest nachher den Podcast z.B. oder auch nach, je nach zeitlicher Verfügbarkeit eines meinem Urlaub oder andere Themen. Privat macht mal der eine die Aufgabe, mal der andere. Also ihr gebt euch sozusagen da auch den Staffelstab in die Hand und seid dadurch, dass ihr zu zweit seid, verfügbar und schnell und könnt die Themen schnell voranbringen. Und gleichzeitig gibt es bestimmt Themen, wo ihr zusammen drüber nachdenkt, konzeptionell, wen laden wir ein? Was macht Sinn? Wie können wir das weiterentwickeln?",
            "start": 1219838,
            "end": 1351436,
            "confidence": 0.9101622437673123,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber ich meine, generell kann man, wenn du den Vergleich jetzt zum Podcast siehst, ja es auch so sehen. Okay, wir nehmen jetzt den Podcast als Unternehmen und der der [sos/eos], Wolfgang ist jetzt chief audio officer und ich bin chief guest officer. Also das bedeutet dann, dann, dann ist es ja kein Jobsharing mehr. Richtig? Weil ich meine, dann hat jeder sein sein Fachgebiet, sein Aufgabenbereich und wie jedes Topmanagement, Wolfgang und ich sind es hier im Top Management vom Podcast, dann stimmen wir uns natürlich strategisch auch ab, ja, in welche Richtung es geht. Aber ich meine, ist das dann wirklich Jobsharing oder ist das jetzt hier einfach nur, dass der Wolfgang schief Audio Officer ist und ich schief, weiß ich nicht, Sales Officer, sagt der Wolfgang immer.",
            "start": 1351508,
            "end": 1393706,
            "confidence": 0.8742108461538461,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also der Podcast funktioniert ja nur, indem ihr die Köpfe auch zusammensteckt. Also ihr könntet nicht nicht unabhängig nur unabhängig voneinander arbeiten, denn du hast gesagt, wir müssen natürlich strategisch auch überlegen, wie es weitergeht. Der Anteil ist dann vielleicht höher im Jobsplit, also dass ihr gewisse Aufgaben wirklich aufteilen könnt. Aber nichtsdestotrotz gibt es auch einige Dinge, wo es absolut Sinn macht, dass ihr zusammen drauf schaut. Also vielleicht dazu kann ich mal die drei Arbeitsmodi erklären, in denen Tandems oft arbeiten.",
            "start": 1393778,
            "end": 1424148,
            "confidence": 0.9153362650602408,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich hätte gerade noch schnell eine provokante Frage, die ich gerne einstreuen würde. Wenn ich das jetzt, wenn ich dich richtig verstanden habe und ich schaue so auf ganz klassische Firmen Arbeitsweisen innerhalb von von einem von einer Firma ein Prozess von Entwicklungsteam z.b. was man dort ja macht. Ich fange jetzt keine Ahnung, als Startup an, stelle eine Programmiererin ein und merke dann irgendwann, okay, ich brauche noch jemand und dann stelle ich noch einen zweiten Programmierer ein und dann habe ich ein Programmierteam und das Team tritt als Team auf und ich kippe dort eigentlich normalerweise irgendwelche Features, Feature Requests oder solche Dinge ein und für mich ist es ein Team und das Team organisiert sich dann intern selbst in irgendeiner Form, tritt nach außen als Team auf. Heißt das jetzt einfach, die Führungskräfte haben jetzt auch verstanden, was Teamwork ist und haben Teamwork bei ihnen eingeführt und das nennt sich dann Jobsplit?",
            "start": 1424284,
            "end": 1478534,
            "confidence": 0.8861657419354839,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Naja, ich glaube schon, dass ihr da ziemlich weit seid im Engineering, dass ihr da auch so agil zusammenarbeitet und natürlich die Vorteile dessen, die Köpfe zusammenzustecken, da wo es Sinn macht und als eine Einheit aufzutreten, quasi schon lebt. Als Führungskraft selber kann ich ja sagen zweitausendein. Man ist oft mit seiner Entwicklung von Strategien erstmal bei sich und mit sich und will vielleicht Kollegen konsultieren, aber die jetzt auch nicht ständig belämmern im Sparring. Also wir sprechen mit ganz, ganz vielen Führungskräften, die sagen, ich fühle mich schon irgendwie auch alleine mit meinem Team, kann ich so nicht besprechen, meine Führungskraft hat auch irgendwie nicht viel Zeit und meine Kollegen haben ja auch ihre eigenen Themen. Also wirklich einen Sparring zu haben mit jemandem, der die gleichen Ziele hat und der auch Zeit für Sparring hat, das vermissen viele und das finden viele auch attraktiv quasi am Jobsharing.",
            "start": 1478702,
            "end": 1528446,
            "confidence": 0.9123935333333333,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also man muss natürlich dazu sagen, im Leadership Bereich ist es bei Engineering genauso wenig, dass es irgendwie Leadership Teams gibt, die dieselbe Position oder Rolle ausfüllen. Also da gibt es das auch natürlich nicht. Aber ich habe so das Gefühl, dass es irgendwie so diese New Work, das modernere Herangehen dann irgendwie halt auch jetzt es aufweicht, dass es eine Person sein muss, die alles entscheidet. Zweitausendein ultimativ immer weiß, was richtig ist. Und von dem geht man ja allgemein immer mehr weg, in den meisten Firmen zumindest. Und das erlaubt dir dann überhaupt erst, dass du sagst okay, ich bin nicht perfekt, vielleicht sind wir zu zweit besser als alleine.",
            "start": 1528518,
            "end": 1568148,
            "confidence": 0.915926517857143,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Auf jeden Fall sind wir zu zweit besser, denn also diverse Teams, zwei Meinungen sind schon besser als eine zu zweit drüber nachgedacht zu haben. Deswegen sagen wir auch immer gerne Tandem ist die kleinste Einheit Team.",
            "start": 1568244,
            "end": 1580164,
            "confidence": 0.9659224324324325,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber ist es nicht so? Also ich habe mal gehört z.B. dass ziemlich viele Leadership Circle sich zu einer ungeraden Anzahl zusammenfinden auf Basis der Entscheidungsfindung, weil bei einer ungeraden Anzahl hast du immer eine Entscheidung. Und wenn du jetzt in einem Tandem bist, da bist du bei zwei. Und wenn man sich halt nicht einig wird, dann hat man halt ja, ich sag mal keine Entscheidung. Natürlich kann man jetzt den einfachen Weg gehen, immer zu zu Mama und Papa, nämlich zu der oder dem Vorgesetzten rennen und die Entscheidung hoch babbeln lassen. Das ist ja aber nicht die Art und Weise von von Leadership. Leadership ist ja okay, du sollst ja Arbeit abnehmen und anstatt nicht mehr Arbeit erzeugen im Endeffekt. Aber ist das dann nicht eigentlich, ja, wie soll man sagen, nicht vorteilhaft?",
            "start": 1580252,
            "end": 1622534,
            "confidence": 0.9260277941176469,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also du sprichst ein sehr wichtiges Thema an, nämlich Entscheidungsfindung im Tandem bzw. Verantwortung auch teilen im Tandem. Denn das ist die Voraussetzung, um überhaupt zusammenarbeiten zu können. Wir sagen immer Tandem ist oder Jobsharing ist keine Rocket Science, sondern eigentlich müssen nur zwei Dinge gegeben sein. Du musst das Arbeitsmodell wollen, das heißt Verantwortung teilen, die Bühne teilen, kollegial zusammenarbeiten. Und das zweite ist, dass die Chemie stimmen muss, dass du dich menschlich auch mögen musst damit, dass du überhaupt Vertrauen aufbauen kannst und als eine Einheit arbeiten kannst. Also Konkurrenzdenken hat im Tandem gar keinen Platz. Und das bedeutet auch, dass man in der Arbeitsteilung genau bespricht, was heißt das denn jetzt, wenn ich nicht da bin und so ein Thema kommt auf den Tisch zweitausendein, kann ich die andere Person, die da ist, das alleine entscheiden? Willst du da involviert sein? Und da findet man so einen Modus, den man ganz agil auch ausprobiert und ändert und schaut, womit man sich wohlfühlt. Und es kann natürlich trotzdem sein, dass es Entscheidungen gibt, wo man dann sich uneins ist oder eine links gehen würde und der andere rechts. Da muss man auch ausprobieren, entweder zu sagen, wie wichtig ist mir jetzt diese Entscheidung und kann ich das jetzt mittragen, jetzt nach links zu gehen? Nächstes Mal gehen wir aber nach rechts, wenn wir in einer ähnlichen Pattsituation sind oder haben wir vielleicht auch irgendwie ein Sparring im Kollegenkreis dann an der Stelle, die uns beide kennt, die irgendwie auch nah am Thema ist und die uns dann als dritte Person helfen kann, da zu der besten Entscheidung zu kommen. Also da gibt es verschiedene Wege und das Wichtige ist einfach, dass man da ganz, ganz offen im Dialog untereinander ist und da gar nicht irgendwelche Schwingungen größer werden lässt, sondern noch mehr als in der Ehe eigentlich direkt die Themen anspricht. Denn das ist das Wichtige, eine Einheit zu sein und nicht, dass ich gehe zu Mama für die Fragen und ich gehe zu Papa für die Fragen irgendwie zustande kommt, sondern da wirklich nach außen zumindestens eine Position vertritt und die auch mitträgt und mitgeht.",
            "start": 1622662,
            "end": 1744086,
            "confidence": 0.9173184078212285,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also noch eine Ehe verkrafte ich nervlich nicht.",
            "start": 1744238,
            "end": 1746942,
            "confidence": 0.92413125,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du hast ja schon zwei, oder Andi?",
            "start": 1747086,
            "end": 1749090,
            "confidence": 0.9221114285714285,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, ich habe.",
            "start": 1749830,
            "end": 1750850,
            "confidence": 0.7468466666666668,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Du hast drei, wenn man die mitzählt eigentlich.",
            "start": 1753360,
            "end": 1755740,
            "confidence": 0.8817487500000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das war, das war jetzt nicht abgestimmt mit meinem Hund, aber okay. Ja, dann bin ich einmal verheiratet mit meiner Frau, einmal mit meinem Hund anscheinend auch irgendwie so ein bisschen und einmal hier mit dem Wolfgang.",
            "start": 1756600,
            "end": 1765300,
            "confidence": 0.890541891891892,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das Schöne ist ja, um Druck zu nehmen, sagen wir Tandems immer, ihr müsst keine besten Freunde werden. Wenn das noch dazu kommt, ist es ein Plus. Aber ihr solltet natürlich gut zusammenarbeiten können und das ist das A und O. Und da gibt es Persönlichkeitsstrukturen, die gut zusammenpassen und gut miteinander gehen und andere halt nicht. Das kennt ihr wahrscheinlich auch. Ihr habt auch nicht durch Zufall wahrscheinlich zusammengefunden, ihr kanntet euch im Kollegenkreis, habt vielleicht Projekte gemacht und habt gemerkt, es float irgendwie. Ja und genauso hat man Menschen, wo man denkt, das passt einfach nicht, kann ich mir nicht vorstellen. So und da helfen wir bei TWICE auch mit unserem Matching Algorithmus, der voraussagt, wie gut Menschen zusammenpassen und auch effektiv zusammenarbeiten können. Das basiert auf einem sehr etablierten Persönlichkeitstest und ist somit eine gute Grundlage, wenn man sich entscheidet, ins Tandem zu gehen, einen Check zu haben, sind wir da in der Green Zone, kann das funktionieren oder nicht und warum auch nicht? Und genau um über diese Dinge dann.",
            "start": 1766760,
            "end": 1827402,
            "confidence": 0.9153863793103448,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Auch zu sprechen, aber helfen dann auch so Persönlichkeitstests. Ich sage mal, es gibt ja so Tests, okay, du bist eine blaue Person, analytisch, Ÿousand und grün und ich weiß, jetzt ist alles nicht gerade korrekt mit den Farben, was ich jetzt gerade sage, aber dass du halt Personen klassifizierst, die mehr emotional gebunden sind, mehr auf ZDF zahlen, Daten, Fakten unterwegs sind und so weiter. Und man sagt ja in der Regel, dass man sich komplementär zusammenfinden sollte, dass man eigentlich dann, ich sag mal, die Schwächen des anderen durch eine durch die Stärken der anderen ausgleichen und so weiter und so fort. Wird das dann so zusammengesetzt oder sagt man hey, zweitausendein, weil du sagst ja auch, man muss starkes Vertrauen aufbauen und man sollte sich natürlich auch in irgendeiner Art und Weise sehr gut verstehen, keine besten Freunde sein muss, weil das ist ja immer noch Arbeit. Oder wird dann gesagt, nee, wir packen jetzt zwei sehr stark emotionale Personen zusammen?",
            "start": 1827426,
            "end": 1876222,
            "confidence": 0.9197412195121957,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau, also ich würde da in der Komplementarität noch mal unterscheiden zwischen den beiden Persönlichkeiten und den komplementären Skills. Da können wir vielleicht gleich noch drüber sprechen. Also was die komplementären Persönlichkeiten angeht, wir arbeiten mit einem Persönlichkeitstest zusammen, der nennt sich Hexaco. Der hat sechs Dimensionen und basiert auf dem sehr etablierten Big Five Modell. Und diese Persönlichkeitsstrukturen legen wir übereinander im Tandem, um zu schauen, wo sind wir uns ähnlich und wo sind wir vielleicht unterschiedlich. Und da gibt es Dimensionen, wo es von Vorteil ist, wenn man eher unterschiedlich ist, weil man sich dann gegenseitig gegenseitig befruchtet oder auch so ein bisschen kalibriert. Z.B. gibt es die Dimension Offenheit für neue Erfahrungen zweitausendein. Da ist es von Vorteil, wenn man sich eher komplementiert. Also wenn da die eine Person ist, die ständig aufwacht und sagt ich habe jetzt eine ganz neue Idee, lass uns das jetzt machen und am nächsten Morgen eine ganz andere Idee hat und dann das Ganze wieder in die andere Richtung zieht. Das ist total befruchtend, jemanden zu haben, der so viele Ideen reinbringt, gleichzeitig aber auch gut, dann einen komplementären Partner zu haben, der sagt oder so ein bisschen einordnet vielleicht super, können wir machen, aber lass uns doch jetzt erstmal das zu Ende machen. Das war doch, da hatten wir doch schon evaluiert, dass wir das jetzt umsetzen wollen. Also da z.B. ist es von Vorteil, unterschiedlich zu sein. Bei der Dimension Gewissenhaftigkeit ist es von Vorteil, ähnlich aufgestellt zu sein, denn wenn jemand eher fünf gerade sein lässt und sagt, ja, das passt doch jetzt der erste Wurf und lass uns rausgehen damit. Ich fühle mich damit total wohl, das zu präsentieren und die andere Person aber lieber das noch bis zum Ende durchdenken möchte und sich dann erst wohlfühlt damit, dann wird es langfristig nicht funktionieren, weil man einfach einen ganz, ganz anderen Ansatz hat. Und darauf gehen wir halt in so einem Gespräch dann auch ein. Wir machen ein Tandem Onboarding vorher, begleiten eine Pilotierung von Tandems mit einem tandem Onboarding und besprechen dann auch gerade dieses Hexago Modell im Detail und helfen dem Tandem schnell vom ich zum wir zu kommen, also im wir zu denken, wir zu sprechen. Wir wissen alle, was für einen Effekt das wir haben. Königshäuser plurales Majestätes. Wir haben uns überlegt, es hat ein ganz anderes Gewicht als ich habe es mir überlegt. Von daher ist es schon sehr, sehr wichtig, wer da zusammenkommt. Und eine Ergänzung noch. Das Schlimmste, was passieren kann, ist, dass du jobsharing pilotierst und dann nach drei, vier Monaten merkst, die Persönlichkeiten passen einfach nicht zusammen, die Chemie stimmt nicht, die können nicht zusammenarbeiten und löst es Tandem auf. Denn dann denkt das außen, das Modell funktioniert nicht. Dabei war es einfach das falsche Matching, das Recruiting hat nicht gestimmt.",
            "start": 1876366,
            "end": 2039994,
            "confidence": 0.9247999154334042,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du arbeitest jetzt mit vielen Firmen zusammen in dem Bereich. Wie offen sind Führungskräfte für sowas? Vor allem die, die Erfahrung haben als Führungskraft und gewöhnt sind, den E Gender jetzt absichtlich nicht den großen Mann da heraushängen zu lassen und alles entscheiden zu können und zu wissen immer, was die richtige Richtung ist, der richtige Pfad. Und plötzlich muss man das irgendwie teilen und auf zwei Personen auslagern. Wie viel Offenheit begegnet dir da?",
            "start": 2040042,
            "end": 2070494,
            "confidence": 0.9090968000000001,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Man muss Typ dafür sein, aber ich würde sagen, in der heutigen Arbeitswelt ist ja kollegiales Zusammenarbeiten das A und O. Von daher ist es schon der Gros der Menschen, auf die wir zumindestens treffen, die dafür offen sind. Oft auch tatsächlich Vorgesetzte, die sagen, ich bin jetzt so überzeugt davon mit dem tandem Modell oder mit dem Job Training in meinem Team. Ich würde es auch total gerne machen, aber ich traue mich noch gar nicht auf meiner Position das irgendwie auszusprechen, denn ich bin schon 10 Jahre jünger als alle meine anderen Peers in der Rolle. Ich kann schon Glück haben, hier zu sein. Ich will mein Glück nicht provozieren, indem ich jetzt mit so einer revolutionären Idee hier um die Ecke komme. Das war jetzt in der Bank, aber gestern gerade hatten wir ein Tandem Onboarding mit einem rein männlichen Tandem. Und das war ein Nachfolger Tandem. Das heißt, die eine Person ist drei Jahre vor Ruhestand und die zweite eine Führungskraft aus seinem Team um die 40, der in die Rolle reinwachsen möchte. Und die beiden gehen jetzt zusammen ins Tandem. Ist eine super Möglichkeit für den Senioren Part, Wissen weiterzugeben, denn ihr wisst ja auch, wie schwierig das ist. Kannst du nicht runterschreiben und sagen, hier, ich gehe in Rental, das ist all we know, sondern du musst es irgendwie erfahren und mitgehen können. Und der ist total offen, zweitausendein dafür, auch alles anders zu machen und selbst erst 20 oder dreiig Jahre im Unternehmen und sagt, wenn du neue Ideen hast, wie wir das zukünftig anders machen können, ich bin total offen und die begegnen sich da auf Augenhöhe. Und das ist glaube ich das zentrale, das Stichwort Augenhöhe.",
            "start": 2070662,
            "end": 2165688,
            "confidence": 0.915691894736843,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt arbeitest du natürlich schon mit mit Firmen zusammen wahrscheinlich, die da recht offen sind und Andi nennt es ja immer so der Happy Path und auf der grünen Wiese und die Realität schaut schaut anders aus. Und ich kenne das ja auch gerade Freund hat mir mal gar nicht so lange her erzählt, dass er sich beworben hat bei einem großen Systemhaus und der wollte dann Teilzeit, also irgendwie nur zwei und dreiig Stunden arbeiten. Das hat er so am Ende vom Interview gesagt und die haben dann so gemeint, also sie haben gerade extrem viele Projekte und sie stellen sich eher so in den nächsten, zumindestens im nächsten Jahr bis eineinhalb Jahren eher so 50 Stunden pro Woche vor. Also die haben das so klipp und klar gesagt. Also ich glaube, so moderne Modelle sind jetzt noch nicht überall angekommen und da sprechen wir sogar von dem großen IT Unternehmen, die da vielleicht eigentlich besser agieren sollten.",
            "start": 2165864,
            "end": 2213480,
            "confidence": 0.9122288679245283,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also dem Kollegen kannst du aber den Hinweis geben, dass das ein super Argument ist für um Jobsharing zu platzieren, um zu sagen, wenn sogar 50 Stunden gefragt sind, dann machen wir das doch zu zweit am besten und teilen uns das. Und dann ist immer jemand da, keiner im Urlaub, die Verfügbarkeit ist generiert, wir sind schneller zweitausendein, weil immer eine antworten kann. Die Qualität unseres Outputs ist besser, weil wir haben schon mal zu zweit über die wichtigen Dinge nachgedacht. Du hast weniger Arbeit, lieber Boss. Von daher ist es eher ein Argument dafür, vor allen Dingen, weil ich ja eben erwähnt habe, brauchst du eine Überschneidung in der Rolle, um halt gerade an konzeptionellen Themen auch mal die Köpfe zusammenzustecken. Deswegen ist das übliche Modell, also das Minimum, dass man 1,2 FTE investiert auf eine Jobsharing Rolle, um halt die volle Verfügbarkeit einerseits zu haben, montags bis freitags, aber halt auch noch diesen Tag über Schneidung. Und da spricht ja, wenn man 50 Stunden investiert mit 1,2 FTE, spricht es ja total dafür, zwei Personen zu besetzen, vor allem weil wir auch durch eine Umfrage belegt haben, dass Tandems mindestens genauso produktiv sind wie Personen in einzelne Besetzung, aber in den meisten Fällen umso produktiver, indem sie zu zweit sind, vor allen Dingen in Agilität und Innovationskraft. Von daher ist es ein Investment Case eher. Also in welche Rolle möchte ich das investieren, Jobsharing zu etablieren?",
            "start": 2213560,
            "end": 2301922,
            "confidence": 0.9169714644351473,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt könnte man natürlich auch argumentieren als Firma, es ist eh schon so schwer, irgendwelche Leute zu finden und wir haben jetzt die große Arbeiterlosigkeit. Jetzt erzählst du mir, ich muss jetzt zwei Leute finden. Das ist ja eh schon so, ich finde ja eine Person schon nicht und jetzt soll ich zwei finden, zweitausendein.",
            "start": 2301986,
            "end": 2316852,
            "confidence": 0.918556,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das ist tatsächlich dann oft vielleicht der Mythos. Ja, am Anfang, aber es wird durch zwei Situationen eigentlich schnell recht aufgehoben. Die erste Situation ist dann oft, dass sie feststellen im Gespräch, wir haben da ja schon jemanden intern, der bringt nur nicht alles mit. Also wir haben da das Talent, das will. Wir wollen ihn aber nicht jetzt überfordern und in eine Rolle schmeißen, die ihn schnell ÿousand wie ins Burnout bringt oder sie, sondern die ist vielleicht in zwei, drei Jahren soweit. Ja, und man merkt dann, okay, cool, ihr habt schon jemanden, der weiß, wie der Hase läuft, der das Potenzial hat, dann suchen wir doch nur noch jemanden, den wir gut dazu matchen können, der vielleicht komplementäre Skills mitbringt, vielleicht Führungserfahrung, wenn die noch nicht vorhanden sind und wo der frische Wind von außen dann auch zuträglich ist. Und diese Kombination erleben wir ganz, ganz oft. Also eine interne benennens anker Person gematcht mit jemandem, entweder intern oder halt extern. Und komplementäre Skills zu verbinden ist halt auch ein super smarter Move. Ihr habt bestimmt schon die eierlegende Wollmilchsau im Recruiting gehört. Also die Vakanz, die du nie besetzt bekommst, weil es sie einfach nicht gibt. Ja, und das erleben wir immer häufiger aktuell, dass der Kostendruck so hoch ist bei Unternehmen, dass immer mehr Rollen gestrichen werden und die Rollen, die man dann wirklich ausschreibt und sucht, so einen hohen Anspruch hat und so eine Komplexität und Breite mit sich bringt, weil da alles reingestopft ist. Und die Person, die das erfüllen kann, findest du einfach nicht. Und gerade dann macht es Sinn, sich zu öffnen und zu sagen, okay, wen können wir denn suchen, der A mitbringt, der die Eier legt und der die Wolle macht auf der anderen Seite. Und das Schöne ist, du hast halt über Zeit eine echt hohe Lernkurve in diesem Tandem. Das heißt, selbst wenn du komplementäre Skills am Anfang hast, weiß das Tandem nach einer definierten Zeit, weiß A, was b weiß. Also da ist, das ist halt das Schöne, du hast ein hohes Upskilling im Tandem und das ist auch eine große Motivation für viele, ins Tandem zu gehen.",
            "start": 2316946,
            "end": 2439150,
            "confidence": 0.9259461432506894,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt hast du schon einer der klassischen Mythen angesprochen oder das Mythen. Für mich ist das immer noch ein, ja, vielleicht eine Downside Ÿousand.",
            "start": 2439450,
            "end": 2448372,
            "confidence": 0.9123495833333336,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ein Gegenargument.",
            "start": 2448426,
            "end": 2449280,
            "confidence": 0.69272,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ein Gegenargument nennen wir das das schöne Geld und die schöne Headcount Planung. Jetzt sagte der Wolfgang zwar, Okay, finde ich überhaupt zwei Leute, jetzt sage ich aber, viele Firmen gehen gerade in die Headcount Planung für 2025, versuchen die jetzt bis Oktober, November oder ähnliches abzuschließen. Und da sind ja offene Positionen eher rar, weil finanziell ist halt schwierig, gerade bei Unternehmen aufgrund der wirtschaftlichen Lage. Und wir hatten auch gerade schon wieder ganz viele Layoffs bei größeren Firmen, auch SAP und Co. Oder verträglich abgebaut nennen die sich das sehr wahrscheinlich. Auf jeden Fall kommt es auf das gleiche raus, die Mitarbeiteranzahl wird reduziert. Und jetzt sagst du mir, wir setzen eine Position, zwei Leute, ja, auch wenn da Arbeit für 50 Stunden pro Woche ist, aber im Endeffekt hast du ja 1,2 FTEs im Mittel gehen wir mal von 1,5 FTEs oder vielleicht sogar zwei beiden Vollzeit aus. Ich meine, im Endeffekt ist es doppelt so teuer, oder?",
            "start": 2449360,
            "end": 2504410,
            "confidence": 0.8685852173913049,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was du natürlich brauchst, ist, dass du die Aufgaben müssen natürlich dem Investment entsprechend passen. Das heißt, entweder du lädst die Rolle auf, weil du weißt, da kommen eh noch Projekte dazu, das wird eh größer, ja, und dann kann die Person das auch zu zweit wuppen. Oder du sagst halt, ich habe nur einen FTE, dann setze ich zwei Personen halt auf ein FTE und nehme in Kauf, dass vielleicht freitags keiner da ist, weil die halt donnerstags zusammenarbeiten auf gewissen Themen. Also wenn du da eine Flexibilität hast als Arbeitgebende und sagst, Ÿousand, ich muss da nicht die volle Verfügbarkeit haben, dann ist es natürlich auch mit einem FTE möglich. Was eine ganz schöne Variante auch ist, was ich eben kurz erwähnt habe, ist vielleicht mit einer Teilkapazität ins Tandem zu gehen. Wir hatten dann ein schönes Beispiel, wo eine Führungskraft aus der Elternzeit zurückgekommen ist und dann, ich glaube, 70 % in Teilzeit arbeiten wollte, ihre Rolle aber weitermachen wollte. Es war ein großes Team, 13 Mitarbeitende, wo sie sagte, realistischerweise in 70 % Teilzeit, schwierig. Und hatte da aber die eine Person aus dem Team, die sie auch vertreten hat in der Elternzeit und der gesagt hat, finde ich eigentlich ganz cool die Rolle und könnte ich mir gut vorstellen, mit dir zusammen zu machen. Und der macht jetzt mit ihr zusammen zu 50 % seiner Kapazität die Führungsrolle und bleibt aber zu 50 % in seiner Expertenrolle. Der ist 20, dreiig Jahre im Unternehmen und kennt sich da aus und lebt es so. Das heißt, manchmal ist es vielleicht auch nur ein Umshiften der Ressourcen innerhalb der gegebenen Headcount Anzahl, die schon da ist. Vielleicht muss man sich da ein bisschen frei von machen und eher aus der Rolle heraus denken, welche Rolle profitiert wirklich davon, wenn zwei Leute auf gewissen Aufgaben zu zweit sind oder aus der mitarbeitenden Perspektive, wenn du jemanden hast, der halt vielleicht weniger als Vollzeit arbeiten möchte, zweitausendein und du aber als Arbeitgebender den Anspruch hast, dass da vielleicht jemand Vollzeit ist, vielleicht in eurem Bereich, dass das Wissen halt die ganze Zeit da ist, dass ihr nicht darauf verzichten könnt, ein bis zwei Tage das Wissen nicht da zu haben. Also ich würde das eher immer aus solchen Situationen heraus denken.",
            "start": 2504450,
            "end": 2634924,
            "confidence": 0.9084493717277483,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich würde sowieso auch argumentieren, jetzt wenn ich zu meinem Beispiel zurückkomme mit den 50 Stunden. Also ich verstehe bis heute nicht, wie eine Firma das sagen kann, stelle jemanden an und erwarte 50 Stunden und zwar eineinhalb Jahre lang oder so. Also ich kann mir nicht vorstellen, dass der ein FDE dabei rumkommt, weil am Ende sind wahrscheinlich 0,5 mit dem ganzen Krankenstand und dem Leistungsverlust, den man bei 50 Stunden Dauer 50 Stunden hat.",
            "start": 2635092,
            "end": 2662854,
            "confidence": 0.8822538157894738,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Natürlich.",
            "start": 2662902,
            "end": 2663446,
            "confidence": 0.91561,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also ich kann mir das nicht vorstellen, dass das sinnvoll, wenn man das sinnvoll durchrechnet, also es könnte bei eineinhalb FTEs vielleicht eh so sein, dass dass am Ende mehr rauskommt, als wenn man das halt wirklich nur auf eine Person auflädt. Und wenn man schaut, wie viel Burnouts es mittlerweile so gibt, gerade in Führungspositionen, dann ist es natürlich schon ein großer Grund.",
            "start": 2663518,
            "end": 2683650,
            "confidence": 0.8874259375,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Absolut. Da sprichst du was Gutes an, denn du hast halt wirklich im Tadeln Erholungszeit. Du hast im Vergleich zu der 80 % Teilzeit, wo du an dem freien Tag wahrscheinlich immer noch gedanklich bei der Arbeit mal kurz zumindest bist und guckst, ob da nicht irgendwie was anbrennt, hast du halt da wirklich einen Partner in Crime, wo du weißt, auf den kann ich mich verlassen und jetzt kann ich auch mal wirklich hier frei machen und mich auf meine anderen Themen konzentrieren. Und das Feedback bekommen wir halt auch von Tandems, die jetzt da reingegangen sind, die sagen, das hätte ich gar nicht gedacht, wie gut mir das gut tut und wie erleichternd es auch ist, die Verantwortung auf zwei Schultern zu verteilen. Vier Schultern. Also es gibt super viel, also es bringt Spaß. Die haben auch mehr Selbstvertrauen, mehr Mut, indem sie da einfach zu zweit sind und wissen ja, wenn irgendwas passiert, selbst wenn ein Mitarbeiter kündigt, der essentiell ist, das hatten wir auch schon, sagt, hätte ich gar nicht gedacht, aber es ist irgendwie halb so schlimm, als wenn ich jetzt alleine hier wäre. Geteiltes Leid ist halbes Leid und irgendwie habe ich das Gefühl, zu zweit kriegen wir das auf jeden Fall hin.",
            "start": 2683810,
            "end": 2747608,
            "confidence": 0.9205044019138758,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt ist es ja so, jeder kennt dieses Diagramm, wenn du zwei Leute hast, dann hast du zwei, hast du eine Kommunikationslinie, wenn du drei Ÿousand Leute hast, dass du mehr Kommunikationsliegen und so weiter und so fort. Also bedeutet die Kommunikation steigt und das ist ja beim Tandem ja jetzt eigentlich auch so. Z.B. du hast eine Vorgesetzte und auf einmal ist dein One on one nicht mehr dein Jour fix, sondern es ist eigentlich ein Jour fix oder ein One on two, wenn man so möchte. Ja, weil man hat ja zwei Leute dann für eine Stelle. Dann braucht man konstante, ich nenne das mal Sync Meetings Beziehung für das Tandem selbst. Ja, hey, ich war gerade mit dem und da gibt es dieses Problem und dieses Projekt läuft gerade schief und alles, was man halt so hat. Und das sind jetzt nur die Thematiken, die man innerhalb des Tandems hat oder im Managing ab, aber noch nicht mal im Managing down. Das bedeutet, wenn die Mitarbeiter, wie du sagtest, wen spreche ich denen jetzt an? Wer ist wofür zuständig? Und dann kommt noch die die dritte Ebene hinzu, das sind die Stakeholder. Wie beantwortest du dieses Gegenargument in Bezug auf gestiegener Kommunikationskomplexität, gestiegener Zeit für ich sag mal Informationsaustausch oder sagst du generell ja, also nur das geschriebene Wort ist das richtige Wort und wir müssen jetzt alle asynchron arbeiten.",
            "start": 2747784,
            "end": 2826890,
            "confidence": 0.8939336909871247,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die Kommunikation im Tandem ist natürlich das A und O. Du musst gewillt sein, Informationen fließen zu lassen und gute Absprachen treffen, wie es bei zwischen euch am besten passiert. Wir erleben viele Eltern, die im Tandem arbeiten, die sagen ich schicke kurz eine Sprachnachricht, wenn ich Feierabend mache und sage kurz hier, wenn der heute anruft. Ganz wichtig, dass du es schon mal kurz gehört hast. Ich hatte heute auch den Eindruck, so zwischen den Zeilen, da ist irgendwie irgendwas schief gelaufen. Ist not so amused. Ja, also das ist ja auch gerade.",
            "start": 2827010,
            "end": 2855996,
            "confidence": 0.8838779787234047,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das Wichtige, dass man irgendwie so Eltern im Business Kontext, nicht die Eltern untereinander. Nein, sorry, die Kommunikation, nur um es klarzustellen. Also es geht schon um die Firmenkommunikation.",
            "start": 2856028,
            "end": 2865914,
            "confidence": 0.8540872413793102,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber Eltern natürlich um die Firmenkommunikation. Immer Business first. Genau. Oder haben halt eine strikte Dokumentation natürlich, die einem selber auch hilft, dass man weiß, hier Regeltermin, das Kärtchen raus, was wurde letztes mal besprochen? Da muss man natürlich sehr diszipliniert sein und sich gut einspielen am Anfang. Das kostet natürlich am Anfang Zeit, aber die Tandems, die gut eingespielt sind, da ist es, da geht es so fließend, dass es auch nicht mehr viel Zeit in Anspruch nimmt. Zweitausendein und dass sie sich auch mit der Zeit blind verstehen. Ich habe eben die verschiedenen Arbeitsmodi erwähnt, die da sind Jobsplit, also einige Aufgaben aufzuteilen, Pilot, Co Pilot, der Copilot springt nur ein, wenn nötig ist, lose informiert, sprechfähig, also Jobsplit, dann der Staffellauf, wo man sich die ja, das Bild ist bewusst gewählt, wo man ganz kurze Übergabe hat und dann die Themen weiterentwickelt, entweder weil man selber gerade keine Zeit mehr hat oder weil man sagt, alle meine Brainpower ist in dieser Präsentation, guck du mal drauf. Also das ist der zweite Arbeitsmodi und der dritte ist Doppelpack physisch gleichzeitig beide. Und das muss man natürlich sehr gewählt auswählen, damit nicht jeder sagt, das hätte ich auch gerne jemand, mit dem ich Händchen halte und alle Meetings zusammen mache. Nee, wir haben uns überlegt, in diesem Meeting z.B. mit dem Vorgesetzten macht total oder der Vorgesetzte macht total Sinn, dass wir dazu zu zweit drin sind, weil das können wir gar nicht so übergeben. Das investieren wir jetzt auch und das macht Sinn, weil dann können wir beide in unseren Projekten weiterlaufen. Und worauf ich hinaus wollte ist, dass viele Tandems am Ende im Staffellauf arbeiten, die schmeißen sich die Themen hin und her und es ist so fluide, dass da wirklich gar nicht mehr viel Abstimmungszeit benötigt wird und das Upside der Synergien, die sie zusammenheben, halt viel, viel höher ist.",
            "start": 2866052,
            "end": 2974082,
            "confidence": 0.9015308280254776,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wer ist denn eigentlich legal verantwortlich dann für Sachen, die einfach mal ganz brutal vor die Wand fallen? Weil ich meine, in der schönen deutschen Kultur ist es halt so, da rollen auch ab und zu mal Köpfe, wenn ein großes Milliardenprojekt einfach offen gesprochen versaut wird, sind dann beide verantwortlich oder fängt dann an, so dieses Fingerpointing oder der ist schuld oder sie war für das Projekt verantwortlich. Also ich meine, wie sieht das vielleicht zwischenmenschlich aus und aber auch auf der legalen Seite? Also wenn wir jetzt mal nicht vom Teamleiter reden, sondern weiß ich nicht, vielleicht gibt es sogar CEOs im Tandem. Da hängt ja dann wirklich mal ein bisschen was dran.",
            "start": 2974226,
            "end": 3014308,
            "confidence": 0.9260200869565215,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also danke Andi für die Frage, weil alle österreichischen Hörer innen, wenn sich jetzt denken, typisch deutscher, denkt nur an die rechtlichen Probleme und wie sieht das ganze rechtlich aus? Aber ist natürlich eine legitime Frage.",
            "start": 3014404,
            "end": 3026920,
            "confidence": 0.8911477777777778,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Witzig, dass du das sagst, Wolfgang, weil es kommt auch bei vielen irgendwann immer kommt es im Gespräch Ÿousand Gespräch raus. Ja, aber wie sieht das denn aus? Und unser System bildet das gar nicht ab. Wir können da gar nicht zwei Leute anlegen, die die Urlauber freigeben, mal der eine oder der andere. Also es sind dann eher so die systemischen Herausforderungen. Aber klar, beide sind verantwortlich, beide verdienen ja im Idealfall auch das gleiche Geld, sind auf Augenhöhe, teilen sich die Verantwortung und sind dann gemeinsam verantwortlich und haben im Vorhinein halt abgesprochen, wie sie Entscheidungen treffen. Naja, beide verantwortlich. Und das ist aber auch gut, gut, denn je strategischer und höher aufgehängt die Rolle ist, desto größer ist ja die Tragweite der Entscheidung, die du triffst. Und die ist im Zweifel zu zweit besser als die, die du alleine triffst.",
            "start": 3027260,
            "end": 3068828,
            "confidence": 0.9010907692307694,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber ich meine, bei großen Projekten darfst du in der Regel ein Projektleiter oder bzw. Einer, der die Ansagen macht. Und findet das wirklich so in der in der in der Praxis statt, dass man dann seinen Tandempartner, Tandempartnerin, wie nennt man seinen Peer Peer vielleicht Tandempartner oder Tandempartnerin, dass man dann wirklich über jedes Ergebnis aus jedem Meeting konstant informiert. Denn wir sind uns, glaube ich, einig oder hoffentlich ist das so, dass das Tandem nicht immer zusammen auftritt, oder? Weil sonst macht es keinen Sinn.",
            "start": 3068964,
            "end": 3101484,
            "confidence": 0.8782833333333332,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Absolut. Ja, es ist keine Händchen halten. Wir machen den ganzen Job von A bis Z zusammen.",
            "start": 3101572,
            "end": 3106364,
            "confidence": 0.9304029411764704,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das wäre schön, weil dann hat man nämlich alle Vorteile, weniger Arbeit und keine Nachteile.",
            "start": 3106492,
            "end": 3111172,
            "confidence": 0.968872,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "In der Regel total ineffizient natürlich. Und dann sagen zu Recht die Kollegen das hätte ich auch gerne jemanden, der immer mit mir läuft. Nein, so ist es nicht. Aber es ist ein gutes Stichwort Projekte. Oft erleben wir so, dass Projekte tatsächlich im Jobsplit aufgeteilt sind. Sagen wir mal, Andi, du leitest jetzt das Projekt Kaffeemaschine, ja, und hast da den Hut auf im Jobsplit als Pilot und du ziehst Wolfgang zu Rate in den Projektphasen, wo es effizient ist, ihn zurate zu ziehen. Also so ein Projekt ist ja strukturiert normalerweise erst in einem Research Phase. Ja, was wollen wir überhaupt machen? Was gibt es da am Markt? Was ist state of the art? Und so weiter? Da macht es Sinn, Wolfgang zu Rate zu ziehen und zu sagen wo soll ich denn mal gucken? Oder wo fangen wir denn mal an? Welche Quellen gucken wir uns an? Und dann würdest du natürlich Andi alleine diesen Research machen und in die Tiefe gehen. Das macht ja keinen Sinn, das zu zweit zu machen. Ja, also da gibt es keine Synergien. Wenn du dann aber alle Informationen hast und ins Brainstorming gehst oder in die Konzeption, in die kreative Ausarbeitung der Strategie, dann macht es total Sinn, Wolfgang wieder dazuzunehmen. Ja, weil da sind zwei Köpfe, also eins plus eins ist größer zwei an der Stelle auch für die Planung dann, wenn du sagst ich habe dir jetzt eine Planung ausgearbeitet, so wollen wir vorgehen. Ist es hilfreich, Wolfgang zu rate zu ziehen und zu sagen kannst du da noch mal mit einem frischen Blick drauf werfen. Ich bin jetzt so tief drin, habe ich da irgendwas übersehen? Ist irgendwie ein Denkfehler drin? Da hilft total und dann setzt du um und in der Umsetzung gibt es keine Synergien. Das heißt, es ist dann eher das operative Doing und dann führst du durch. Das heißt, du bist schon in dem Sinne im Lead auf Projekten. Das macht absolut Sinn, da nicht, also das von end to end zu machen und vielleicht nicht zu wechseln bei anderen Themen. Vielleicht dem, wenn du ein großes Team hast, vielleicht ein Beispiel aus dem HR Bereich, weil ich daherkomme und sagst, wir haben das Talent Acquisition Team, also das recruiting Team, wir haben das Talent Development Team Ÿousand und da macht es nicht Sinn, dass wir gleichzeitig beide fachlich führen, sondern ich mache das jetzt mal für die drei Monate bin ich zuständig für das Talent Acquisition Team und du für das Talent Development Team. Und dann rotieren wir mal so, dass das Team auch die Exposure hat zu beiden Führungskräften bzw. Auch von beiden Führungskräften profitieren kann oder wir im Tandem auch untereinander uns abskillen, weil ich vielleicht eher aus dem Business partnering oder Recruiting Bereich komme, du eher aus dem Talent Development Organizational Bereich und wir da so zusammen quasi die ganze Bandbreite abdecken und in Zukunft auch uns selbst individuell weiterentwickeln wollen und die ganze Bandbreite abdecken können.",
            "start": 3111196,
            "end": 3262090,
            "confidence": 0.9098340361445785,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt bin ich ja eine fiese Möp, wie man hier im Ruhrgebiet sagt und habe die ganze Zeit verschwiegen, dass ich bereits ein Jahr im Tandem gearbeitet habe. Und zwar war die Story damals wie folgt Mein Vorgesetzter, der Abteilungsleiter zweitausendein, hat die Firma verlassen und die Stelle wurde frei. Und ich habe einfach mal gesagt okay, komm, das probiere ich mal aus. Habe nicht damit gerechnet, dass ich den Job gekriegt habe oder im Endeffekt kriege, so wie das halt immer ist. Und dann wurde die Stelle meines Vorgesetzten mit zwei Leuten besetzt, einmal mit mir und einmal mit einer einer Kollegin. Die Kollegin hatte einen anderen Background. Sie hatte ein MBA und war mehr in der Business Development und Produkt Ÿousand Management Thematik drin. Und ich war halt der Volltecki Nerd, wenn man so möchte und Infrastruktur und so weiter. Und da haben wir ein Jahr im Tandem gearbeitet und jetzt das reale Problem, was wir auch erlebt haben.",
            "start": 3262430,
            "end": 3320226,
            "confidence": 0.9173400000000004,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Frage von mir war das offiziell so kommuniziert, dass ihr wirklich eine eine Rolle seid?",
            "start": 3320298,
            "end": 3324458,
            "confidence": 0.8978246666666668,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, genau. Der Titel war sogar Co Lied und allem drum und dran. Und ich kann mich mit vielen Elementen, die Anna hier beschreibt, auch wiederfinden und auch mit viel Komplexität, muss ich, muss ich auch zugeben. Weil man wurde halt einfach so ins kalte Wasser geschmissen. Da muss man halt okay, erstmal erst mal gucken, wie, wie macht man das hier eigentlich so weiter? Aber eine Sache, die wir, glaube ich nicht gelöst haben für die Zeit, ist die Außendarstellung. Und zwar wen spricht man als Mitarbeiter an? Wer? Wie kommuniziert man jetzt klar zu den Stakeholdern aka anderen Abteilungen zweitausendein, wer jetzt für was zuständig ist? Jetzt hattest du vorhin schon die Antwort geben. Ja, wäre natürlich toll, wenn man eine E Mail Adresse hat. Und so weiter. Hatten wir natürlich damals nicht, aber das war auch alles noch vor Corona. Und das bedeutet, jeder war im Büro. Man kennt das ja schnell, man trifft sich an der Kaffeemaschine oder in der Cafeteria und sagt Hey Andi, ich habe ein Problem mit Projekt ABC und ich so ja, meine Partnerin macht das. Das ist halt auch eine unbefriedige Antwort, wenn man zweitausendeinousand man so möchte. Was würdest du tandems mitgeben, wie man diese Problematik und auch Verwirrung denn löst? Auf der einen Seite als Mitarbeiter, man leitet dann in der Regel ja ein großes Team oder halt von den Stakeholdern, dass man nicht immer weitergeleitet wird zu dem anderen, weil das verbrennt ja einfach nur offiziell Zeit.",
            "start": 3324554,
            "end": 3406448,
            "confidence": 0.9035323694779113,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Oder vielleicht ich kann da noch eine Frage draufsetzen gleich direkt. Du kennst die andere Person ja auch. War Andi und die Kollegin vielleicht zu unterschiedlich, dass es komplett eben dann getrennt war, Business und tech, dass es zu sehr eben zu wenig Gemeinsamkeiten gab, dass halt im Endeffekt es wieder zwei Rollen am Ende waren.",
            "start": 3406544,
            "end": 3427484,
            "confidence": 0.9060164285714286,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also von der von der Rollenerwartung hast du ja da so eine Bandbreite, indem du sagst, ich erwarte einerseits, dass jemand sich total auskennt, ja, also Experte ist in dem Bereich, sodass auch die ernst genommen wird von den Engineers. Und so weiter. Und gleichzeitig soll aber diese Rolle auch auch nach außen gehen und Produkt widerspiegeln und in internen Meetings strategisch sich da aufstellen. Das ist ja so eine Bandbreite, wo es total smart ist, da zwei Personen draufzusetzen mit unterschiedlichen Hintergründen. Ja auch Persönlichkeiten. Das erleben wir. Alec sagt auch oft im Tech Bereich. Also wir haben schon mehrere Anfragen, wo genau diese Kombination angegangen wird. Und ich würde dann eher die Frage stellen, ob ihr von eurer Persönlichkeit gut gematcht habt, ob das gut im Flow war, sodass ihr auch gesagt hat, ich habe richtig Bock, jetzt mal mich mit ihr hinzusetzen und mal zu überlegen, wie wir das Strategiemeeting da morgen am besten positionieren. Ich lasse das mal dahingestellt, das kannst du für dich beantworten. Das wichtige, was du angesprochen hast, ist aber natürlich die Außendarstellung und zu klären, was ist Jobsharing, was bedeutet das für euch? Und da ist die Maxime immer Zero Edit Complexity. Das heißt, wir sind ansprechbar über diesen Kanal. Für euch ändert sich insofern erstmal nichts. Wir haben vielleicht Schwerpunkte, du kannst mich eher für das oder sie eher für das ansprechen, aber haltet uns, schreibt einfach an diese eine Schnittstelle. Wir sortieren uns intern und selbst wenn du angesprochen wirst, Andy, kannst du ja sagen, ich nehme es mit. Super, dass du sagst, ich nehme es mit und wir antworten. Das heißt, ihr müsst intern eher den Aufwand oder den Informationsfluss aufrechterhalten und dem Außen ist nicht schwieriger machen als sonst, auch indem du verweist auf die andere oder sagst, dafür bin ich nicht zuständig, sondern ihr füllt eine Rolle. Ihr habt die Zweitausendein Verantwortung, tragt die Verantwortung zusammen, auch wenn ihr einen großen Jobsplit vielleicht haben mögt. Aber das ist sehr, sehr wichtig, sich dann nach außen klar zu positionieren und aufzuräumen mit potenziellen Mythen und einfach Klarheit zu schaffen.",
            "start": 3427652,
            "end": 3542250,
            "confidence": 0.9064457549857552,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also eins kann ich sagen, ich habe in dieser Zeit enormst viel von der anderen Seite mitgekriegt und mitgelernt. Also da muss ich zugeben, bezüglich Business, Produktmanagement und allem drum dran und wirklich, ich sag mal MBA Entscheidungsfindung ist mir teilweise der Kopf geplatzt. Wahnsinn. Also die, das war so so Startup Hockeystick Grows in der Persönlichkeitsentwicklung, wie man auf der anderen Seite, als wenn man jetzt aus von der technischen Sicht auf die Business themeshot Entscheidung trifft. Also war schon für mich persönlich sehr, sehr gut. Aber war auch eine chaotische Zeit, bin ich auch ehrlich.",
            "start": 3542370,
            "end": 3578420,
            "confidence": 0.8857819587628866,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ob das die chaotische Zeit dem Modell geschuldet ist oder anderen Einflüssen. Aber es ist schön, dass du sagst, dass das Upskilling untereinander, denn ich bin mir sicher, die andere Person hat auch viel von dir gelernt, da enorm hoch ist und die Lernkurve einfach enorm total steil ist.",
            "start": 3578540,
            "end": 3593036,
            "confidence": 0.9471303999999999,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau. Also Chaos war jetzt nicht durch das Modell, also vielleicht auch, weil wir wurden ins kalte Wasser geschmissen. Es war die Summe. Von daher.",
            "start": 3593148,
            "end": 3600876,
            "confidence": 0.9128756000000001,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das heißt, dein Tipp wäre vor allem nach außen gemeinsam aufzutreten, weil wenn ihr das richtig im Kopf habe, Andy, korrigiere mich bitte, aber zu dir sind halt alle Engineers gelaufen und alle Product und Business People sind zu deiner Partnerin gelaufen, zweitausendein. Also da war halt schon eine starke Trennung dann da eigentlich, oder?",
            "start": 3600948,
            "end": 3617162,
            "confidence": 0.9274239999999998,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir hatten, wir hatten so eine Art Skill Trennung. Genau. Was natürlich dann auch, wenn die andere Person im Urlaub war, auch zu Herausforderungen geführt hat, bin ich auch ehrlich.",
            "start": 3617346,
            "end": 3626330,
            "confidence": 0.9032593333333332,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau, das ist wichtig, dass man im Außen quasi kommuniziert. Es ist ein wir sprecht uns einfach an, wir sortieren uns. Das ist vielleicht auch was, was viele Tandems, die so reingeschmissen werden in die Situation, ja, wie ihr da wart und ihr wart ja da nicht alleine, sondern es gab noch viele Kollegen Teams, wo es auch so war, wenn ich mich richtig erinnere. Und ja, ihr habt einfach ausprobiert und gelernt und adaptiert. Und das versuchen wir von TWICe ja immer bei der Pilotierung zu vermeiden, dass man da die Fehler, die andere Tandems schon gemacht haben, wiederholt und da unnötig Zeit verliert und unnötig Credibility auch fürs Modell verliert. Deswegen buchen viele Kunden mit uns immer so ein Onboarding Programm, wo wir einfach in kurzen Sessions digital, aber auch vor Ort nicht nur das Tandem Building stärken, sondern vor allen Dingen auch die Arbeitsteilung im Tandem klären. Ganz konkret an der Rolle Excel Liste, alle Aufgaben der Rolle, wie gehen wir das an? Was macht am meisten Sinn nach bestimmten Kriterien der Aufgabe? Und dann fühlen sie sich oft sattelfest und auch sprechfähig nach außen, um ganz klar zu sagen, wir haben uns da sortiert und dann strahlst du natürlich ein ganz anderes Wir aus, als wenn du da reingeschmissen wärst. Klar.",
            "start": 3626450,
            "end": 3700282,
            "confidence": 0.9213736279069763,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt, wenn man das weiterdenkt, wenn du sagst, eine e Mail Adresse, müsste man das nicht eigentlich weiter denken und sagen, man hat dann auch nur einen Slack Account oder wirklich dann so weit gehen.",
            "start": 3700466,
            "end": 3709682,
            "confidence": 0.9238728571428573,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ein Slack Account macht, würde auch Sinn machen. Also der Sinn, warum man das macht, ist ja, dass die Informationen einfach für beide zugänglich sind, so dass du im Fall der Fälle, selbst wenn du den Hut nicht auf hast, bei einem bestimmten Projekt Ÿousand die Information rausfinden könntest. Und auch selbst wenn man da nicht aktiv eine aktive Rolle hat, bist du ja immer schon lose informiert und hast dann vielleicht weniger Zeit, die du brauchst in der Abstimmung untereinander. Also es macht auf jeden Fall Sinn, über solche Dinge nachzudenken. Es gibt auch Tandems, die sagen, ich fühle mich nicht wohl damit, eine e Mail Adresse zu haben, weil man muss sich ja dann schon gut sortieren und sagen, vielleicht so jetzt am Montagmorgen, ich kümmere mich um die Inbox und sortiere die dann ein. Da haben wir einen Ordner, der heißt To do Andi, To do Wolfi und ein Feuer Info an die For your Info Wolfi, sodass man es rein sortiert und dann genau weiß, wo man ansetzen soll, wenn du dann reingehst, Wolfgang. Das heißt, das muss man natürlich auch irgendwie effizient gestalten, dass da nicht jeder wieder von null startet. Und wer das nicht möchte, kann natürlich auch zwei E Mail Adressen behalten und die Organisation dann idealerweise dazu erziehen, euch gemeinsam trotzdem anzusprechen. CC ist das eine oder ob ihr wirklich eine e mail Gruppe habt, ja, wo es dann an euch beide geht. Also da seid ihr ja die Spezialisten, welche technischen Möglichkeiten es da gibt. Es geht ja halt darum, dass man die Information einfach hat.",
            "start": 3709746,
            "end": 3789236,
            "confidence": 0.9186255471698113,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, technisch sollte es alles kein Problem sein. Ich glaube, es scheitert eher an anderen Dingen, wenn es scheitert.",
            "start": 3789388,
            "end": 3794140,
            "confidence": 0.9302342105263158,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich als Deutscher denke da gerade an den Betriebsrat oder den Datenschutz Klassiker.",
            "start": 3794300,
            "end": 3799360,
            "confidence": 0.8432384615384614,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Auch mit mit großen DAX Konzernen zusammen und selbst die lösen diese Dinger, diese genau die Thematiken, die du gerade ansprichst. Von daher, wo ein Wille, da ein Weg.",
            "start": 3801380,
            "end": 3809450,
            "confidence": 0.8492362068965517,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, oft will man ja nicht. Also ich meine, von daher oft will der Betriebsrat ja nicht. Also.",
            "start": 3809910,
            "end": 3814250,
            "confidence": 0.8985177777777777,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Naja, also der Betriebsrat ist auch sehr offen dafür, wenn sie hören, wir haben ja ein Schlüsseltalent, was wir halten wollen, die aber in Teilzeit arbeiten möchte und sich der Rolle in die in Teilzeit nicht gewachsen sieht bzw. Auch die Erfahrung vielleicht gemacht hat, dass es zweitausendeinundzwanzig unrealistisch ist, langfristig das umzusetzen und da auch noch gesund beizubleiben. Und dann kommen sie oft zu dem Punkt, dass sie sehr offen dafür sind, für dieses Modell. Von daher die Argumente, wenn man da einmal gut argumentiert und die Argumente vorbringt, ist da auf allen Seiten immer eine große Offenheit. Zu dem Punkt muss man halt erstmal kommen und die Chance haben, das zu pitchen.",
            "start": 3814790,
            "end": 3852036,
            "confidence": 0.8987753508771932,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt arbeitest du ja primär mit großen Firmen, die auf top Ebene dieses Tandem in irgendeiner Form einführen wollen. Jetzt unsere Zuhörer innen sind ganz viele individual Contributors oder Teamleads, Engineering Manager, Product Owner, was auch immer. Würdest du sagen, auch auf der Ebene machen Tandem Sinn? Oder gibt es irgendwo Positionen, wo du sagst, es macht wenig Sinn, da ein Tandem einzuführen? Und vielleicht gerade gleich die Zusatzfrage drauf, wenn man sowas einführen will, wenn unsere Zuhörerinnen jetzt nachdenken, wie könnte man sowas einführen? Was wären deine Tipps? Wo startet man und wie startet man, wenn man es für sinnvoller.",
            "start": 3852188,
            "end": 3891290,
            "confidence": 0.9049661386138611,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also prinzipiell sagen wir, Jobsharing ist erstmal für alle Firmen geeignet, also vom Mittelstand bis DAX Konzern, also bei White Collar Jobs ist Jobsharing fast immer möglich, dazu zweite Synergien gehoben werden können.",
            "start": 3891650,
            "end": 3905170,
            "confidence": 0.9063996969696968,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Bei Startup passt überhaupt nur eine eine Position und 10 Leute machen sie gleichzeitig fast, oder?",
            "start": 3905330,
            "end": 3910390,
            "confidence": 0.88282,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Entscheidend ist somit nicht die Firma, sondern die Rolle, wie du sagst. Und auch bei den Rollen sagen wir, es ist prinzipiell geeignet für alle größeres Upside natürlich zweitausendein auf Rollen, die sehr strategisch sind. So der Karrierepfad im Engineering, wie ich euch verstanden habe, ist ja dann auch zum einen der Managementpfad oder der Expertenpass. Und je strategischer die Rolle wird, desto mehr konzeptionelle Teile dabei sind, umso mehr kannst du natürlich Synergien heben im Tandem. Generell gibt es dann eher die operativen Rollen, wo wir auch oft challengen, brauchen wir jetzt auf dieser Rolle wirklich ein Tandem mit der Überschneidungszeit, mit der Abstimmungszeit? Oder kann man den Kuchen hier auch in zwei Heften teilen und in Teilzeit arbeiten? Aber bei diesem Challenge kommt halt auch oft raus, dass es doch Sinn macht, auch auf individual Contributor Rollen vielleicht zu zweit zusammenzuarbeiten. Selbst im Blue Color Bereich. Das war ganz spannend. Wir waren im Austausch mit einem großen Konzern, die sagen, selbst bei uns am Band haben wir Tandems gebildet, und zwar deswegen, weil wir den Mitarbeitenden die Flexibilität geben wollen, ihre Schichten so untereinander zu sortieren, wie es zu ihrem Leben passt. Und Hauptsache, da steht jemand am Band. Und diese Flexibilität wurde total positiv aufgenommen in diesen Tandems. Die haben nämlich untereinander eine ganz hohe Verbindlichkeit zueinander und wollen sich da auch nicht im Stich lassen, treten ein und ich springe für dich ein, nächste Woche du. Also selbst da gibt es das ganz, ganz operative Rolle. Aber wenn wir jetzt zu einem Bereich zurückkommen, nicht umsonst gibt es ja auch per Programming, wo es Sinn macht, zusammen zu programmieren und da vielleicht auf neue Lösungswege zu zweit zu kommen, die man vorher, die man auf die man alleine vielleicht nicht gekommen wäre. Oder auch um Fehler zu vermeiden, die down the line große bugs kreieren könnten.",
            "start": 3910930,
            "end": 4018420,
            "confidence": 0.9075545161290316,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, bin jetzt total überzeugt. Wie starte ich los am besten?",
            "start": 4018500,
            "end": 4021876,
            "confidence": 0.9691845454545455,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also wenn ihr den Podcast gehört habt und die Idee gut findet und es einführen wollt, würde ich euch empfehlen, es zu pilotieren. Zweitausendein mit einem konkreten Fall. Vielleicht seid ihr der konkrete Fall und die Person, die entweder ich würde gerne reduzieren in Teilzeit, aber der Anspruch an meine Rolle ist Vollzeit. Ich suche mir ein Pendant. Ganz simples Beispiel. Oder diese Rolle, die da ausgeschrieben ist intern, fand ich schon immer cool. Und die ist ja jetzt möglich, dadurch, dass ich einen Teil der Anforderungen mitbringe und dann jemand gesucht werden könnte, der den anderen Teil mitbringt. Also ich würde es immer an einem bestimmten Case festmachen. Genauso seid ihr vielleicht Führungskräfte, die sagen ich habe da die Person bei mir im Team, die sucht nach Veränderungen, die hat bestimmte Bedürfnisse, was die Vereinbarkeit anbelangt, die möchte irgendwann uns verlassen, die ist so offen und kommuniziert mir das. Und das wäre wirklich sehr schwierig für uns, wenn wir dieses Wissen verlieren. Wie können wir sicherstellen, dass wir so Kopfmonopole auf das Wissen einfach weitergeben und da vielleicht ein Tandem bilden, wo wir sagen, das ist auch eine Art Versicherung für uns, wenn da mal jemand ausfällt, dass wir das Wissen auf jeden Fall im Unternehmen halten. Und wir als TWICE sind immer ansprechbar. Also denkt uns da ganz niedrigschwellig, immer ansprechbar für einen unverbindlichen Termin, um mal über bestimmte Cases zu sprechen oder auch strategisch zu zu schauen, wie können wir Jobsharing bei uns pilotieren? Wie können wir das mal ausprobieren und testen? Da seid ihr herzlich willkommen auf mich zuzukommen.",
            "start": 4021948,
            "end": 4117898,
            "confidence": 0.9141617110266156,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Anna, vielen lieben Dank für für deine Zeit, dass du uns das ein alternatives Arbeitsmodell auch mal näher gebracht hast. Besonders aus seinen letzten Sätzen habe ich ein neues Wort gelernt. Kopfmonopol. Sehr schön. Das ist jetzt so der Knowledge keyholder oder was?",
            "start": 4117954,
            "end": 4135870,
            "confidence": 0.8758765116279071,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau, so wie die Begrifflichkeit habe ich mal irgendwo aufgeschnappt und so ein Knowledge Keyholder darstellen. Und da habt ihr ja sicherlich auch viele Personen vielleicht im Kopf, wo ihr wisst, die sind so essentiell wichtig fürs Unternehmen. Wenn denen mal was passiert, wenn die nicht mehr da sind, wenn die kündigen, dann haben wir wirklich ein Problem. Und diesen Wissenserhalt im Unternehmen, das wird natürlich jetzt mit der Verrentung von so, so vielen Menschen immer wichtiger und da sollten Unternehmen auf jeden Fall langfristig planen.",
            "start": 4137179,
            "end": 4167798,
            "confidence": 0.8939460465116277,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich bin immer auf der Suche nach positivem Wording, wie z.B. wir haben kein Problem, wir haben eine Möglichkeit oder eine Herausforderung ist immer noch positiver und ich finde das jetzt schön, dass ich eine Alternative zu du bist ein Bus Faktor habe. Du bist das Kopfmonopol oder Silo, der Klassiker. Anna, vielen lieben Dank an alle Hörerinnen und Hörer. Ihr findet natürlich auch in den Show Notes ein paar Links, unter anderem auch zu Twice, wo es natürlich ein paar mehr Informationen über alternative Arbeitsmodelle gibt, aber auch über das Modell der Persönlichkeitspsychologie Big Five, was während des Podcasts erwähnt wurde. Und falls ihr etwas Feedback zur Episode habt, könnt ihr das natürlich auch sehr gerne in unserer Community niederschreiben. Wir leiten alles gerne auch an Anna weiter. Und ja, bis dahin würde ich mal sagen, falls euch ein alternatives Arbeitsmodell wie z.B. das Dropsharing für euch in Frage kommt, droppt das doch einfach mal bei euch in der Firma, spricht einfach mit eurer Vorgesetzten mal darüber oder vielleicht habt ihr sogar einen guten Draht zur Personalabteilung. Vielleicht haben die sogar schon darüber nachgedacht, nur ihr wisst das noch nicht. Das bedeutet, das könnte natürlich dann auch eine Art und Weise sein, wie ihr vielleicht mal in eine Leadership Rolle kommt, ohne die direkt von Anfang an 100 % auszuführen, zumindest in einem Tandem. Das war's von uns, Anna. Vielen lieben Dank für deine Zeit und ich wünsche dir noch einen schönen Tag. Tschüss.",
            "start": 4167974,
            "end": 4252084,
            "confidence": 0.9089123265306129,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Tschüss, danke dir. Und nicht vergessen, DevOps und SRE als Service für dein Digitalunternehmen, Startup oder Agentur. Flexibel und nachhaltig. Schau rein bei Wemanage.",
            "start": 4252172,
            "end": 4266220,
            "confidence": 0.8271337500000002,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.910823915982622,
    "audio_duration": 4266,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}