{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/FN5jQb6F3xMcic4/download/ep142_homeoffice.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "76e7fe2d-2090-4640-b432-7665cc9d4898",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk. Home Office, Telearbeit, mobiles Arbeiten, Full Remote oder alternativ auch Sofazentrale, Küchenkontrollzentrum oder Pyjamabüro. Obwohl diese Begriffe rechtlich und steuerlich teils eine andere Bedeutung haben, ist das Ergebnis das Arbeiten von zu Hause bzw. Nicht aus dem Büro deines Unternehmens. Zweitausendein zur Corona Pandemie sind wir alle freiwillig oder gezwungen in den Genuss des Homeoffice gekommen. Einige Unternehmen haben das Homeoffice als festen Bestandteil beibehalten, andere haben Regeln für ein hybrides Modell eingeführt und wiederum andere springen auf den fünf Tage return to office Zug auf. Das Thema ist hochsubjektiv, denn jeder hat eine Meinung, welches Arbeitsmodell das beste ist. Doch wie sehen denn eigentlich die Zahlen und Fakten zu diesem Thema aus? Jean Victor Alipur, Dr. Im Bereich Volkswirtschaft, hat mit den Forschungen zu diesem Thema bereits vor der Corona Pandemie begonnen. Mit ihm klären wir, welches Ansehen Homeoffice vor der Pandemie hatte, welche Verbreitung Homeoffice und hybrides Arbeiten heute hat, inwieweit die Produktivität steigt bzw. Sinkt, wenn wir von zu Hause arbeiten, ob es eine return to Office Bewegung gibt und ob bzw. Wie sich die städtischen Ballungsgebiete im Hinblick auf Remote work ändern. Wir springen in die Daten. Los geht's.",
      "start": 4160,
      "end": 85680,
      "confidence": 0.88730633,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Andy, warst du heute schon mit deinem Hund unterwegs?",
      "start": 87020,
      "end": 89356,
      "confidence": 0.9267711,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nee, die bessere Hälfte meines Lebens hat die morgendliche Hunde Runde übernommen.",
      "start": 89468,
      "end": 93380,
      "confidence": 0.7700625,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Dafür nimmst du jetzt einen Podcast auf, oder?",
      "start": 93500,
      "end": 95652,
      "confidence": 0.90318626,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sie ist schon zurück, aber dafür nehme ich dann jetzt auch einen Podcast auf, richtig.",
      "start": 95756,
      "end": 100612,
      "confidence": 0.95054066,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ist es der Vorteil, wenn man im Homeoffice ist, dass man so flexibel ist und mit dem Hund spazieren gehen kann, mal einen Podcast aufnehmen kann, zweitausendein die Arbeit sich so einteilen kann, wie man will?",
      "start": 100716,
      "end": 109570,
      "confidence": 0.93638945,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich glaube. Ich glaube schon, weil sonst in einem Büro hältst du die Commutezeit hin und her. Ganz klar. Aber es liegt natürlich auch an der flexiblen Arbeitsweise deines Arbeitgebers, also dass du keine Meetings hast oder sowas. Und natürlich ist es akzeptiert, dass wenn man Meetings von der Hunderunde macht. Also initial habe ich sogar mal Meetings aus dem Wald gemacht, wo ich wusste, ich muss keinen Screen teilen oder keine Meeting Notes machen. Am Anfang wurde ich knallhart was ist das denn? Das ist jetzt unerwartet. Aber später habe ich das ganz einfach unendlich mit meiner Vorgesetzten geklärt und dann war das auch okay. Sofern die denn wissen, danach kommt auch was. Und ich hänge jetzt nicht den ganzen Tag Gewalt rum, aber. Aber ja, der Flexibilität ist da, natürlich.",
      "start": 109650,
      "end": 147788,
      "confidence": 0.89471203,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und hast du jetzt keine Angst, dass so wie alle anderen großen Firmen, deine Firma oder dein Arbeitgeber irgendwann mal ankommt und sagt Return to Office und du musst jetzt nur im Office arbeiten, so wie es auch Google z.B. gemacht hat kürzlich.",
      "start": 147844,
      "end": 161804,
      "confidence": 0.9258733,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Verstehe deine Frage und ich weiß, worauf du hinaus möchtest. Ich persönlich habe keine Ahnung, da ich mich ein bisschen informiert habe und in meinem Arbeitsvertrag meine Heimatadresse als Arbeitslocation reingesetzt habe. Das bedeutet, eine Arbeitsvertragsänderung wäre notwendig, um mich ins Büro zu forcieren. Und ich glaube, die zweite Geschichte ist, glaube ich, dass das deutsche Gesetz auch sagt, dass nur wenn dein Büro innerhalb eines Kilometerradius irgendwie dabei ist, dann ist das rechtens nach Arbeitnehmergesetz und so weiter.",
      "start": 161892,
      "end": 189344,
      "confidence": 0.90589935,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Da sieht man den deutschen Schlaufuchs hat sich wieder im Vorhinein um alles gekümmert. In dem Fall hat es gewirkt, aber ihr kennt es ja sicher auch, zumindestens in meinem Umkreis ist es derzeit überall eigentlich Thema. Alle Firmen versuchen irgendwie von Hybrid wegzukommen oder die Tage zu reduzieren, das Homeoffice und mehr Office Tage zu haben. Oder eben auch so wie Google, wo Eric Schmidt ja wirklich gesagt hat, der Fokus ist irgendwo ins Private gegangen und auf die privaten Aktionen und viel weniger irgendwas weiterzubringen und darum sollen alle wieder zurück ins Office kommen. Frei übersetzt, wir verlinken gerne den Vote laut, nicht dass ich noch irgendwelche Anzeigen oder so bekomme von Google, aber das war so der Gist davon.",
      "start": 189392,
      "end": 232060,
      "confidence": 0.92695385,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sehr, sehr lieb gesagt. Er hat nämlich gesagt, dass für Google going home early and working from home was more important than winning. Also ist ein bisschen brutaler, muss ich zugeben.",
      "start": 232440,
      "end": 243952,
      "confidence": 0.9275265,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Vermutlich kennt ihr das auch alle und es wird in allen Firmen diskutiert und wenn man so die News und im Fernsehen sich das so anhört, dann hört man irgendwie ständig, dass alle Firmen zurück ins Office gehen und dass das eigentlich jetzt so der Klassiker ist und alle haben jetzt irgendwie gemerkt, man muss wieder zurück ins Office und alles findet wieder im Office statt. Und genau um dieses Thema wollen wir uns heute mal kümmern und da auch die vereintauchen. Und nachdem wir ja wenig Ahnung haben, ich als Selbstständiger habe sowieso alle Möglichkeiten, unser Schlaufuchs Andi, der sich das in den Vertrag reinreklamieren lassen hat, hat natürlich auch keine Probleme. Also wollen wir uns mal ansehen, wie ist denn das eigentlich in Deutschland bzw. Vielleicht auch auf der ganzen Welt und ist überhaupt ein return to Office Trend aktuell in Gange oder wird er wirklich größer? Und wir haben einen super Spezialisten gefunden und zwar den Jean Victor.",
      "start": 304016,
      "end": 354820,
      "confidence": 0.92379475,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Willkommen, vielen Dank für die Einladung.",
      "start": 354900,
      "end": 357720,
      "confidence": 0.948095,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Der ja sich eigentlich sein ganzes Leben, würde ich jetzt schon fast sagen, genau, der Andi erklärt es gleich, um das Thema Homeoffice kümmert und da wirklich tief drinnen ist und das freut mich umso mehr, aus der Wissenschaft kommt und das Ganze mit Zahlen belegen kann. Also nicht so wie die Bild, die da einfach eine coole Headline hinschreibt, sondern uns einmal wirklich tiefen Einblick gibt mit den ganzen Zahlen dahinter und uns aufklärt, was es wirklich heißt, Homeoffice zu haben oder nicht zu haben oder ob es den Trend gibt, dass alles zurückgeht in das Office, um endlich wieder die Gespräche bei der Kaffeemaschine zu haben.",
      "start": 358060,
      "end": 394072,
      "confidence": 0.91255593,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wer ist Joe Viktor Alipur? Du bist nicht irgendeiner du zum Thema Homeoffice. Du bist nicht so wie ich, der einfach eine subjektive Meinung hat, sondern du hast ein paar Daten und Fakten. Und wie gesagt, der Wolfgang hat ja schon gesagt, du beschäftigst dich mit dem ganzen Thema schon etwas länger. Du bist wohnhaft in München, du bist Wissenschaftler am ifo Institut, was ein Institut für Wirtschaftsforschung ist und an der LMU München, das ist die Ludwig Maximilians Universität, habe ich jetzt gelernt bei der Recherche, du hast einen Dr. Im Bereich Volkswirtschaft und du fokussierst dich auf digitale Transformation. Und da dann noch mal auf dem Subfokus die Zukunft der Arbeit. Du forschst zum übergeordneten Thema Homeoffice und Achtung, das schon seit 2000. Neunzehnte. Für alle Hörerinnen und Hörer zur Erinnerung, die Corona Pandemie ist im Mär. 2020 gestartet.",
      "start": 394236,
      "end": 445834,
      "confidence": 0.900116,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Moment, du hast aber nichts damit zu tun, oder? Dass Corona dann gekommen ist, wenn du schon früher geforscht hast, um dein Forschungsthema zu pushen.",
      "start": 446002,
      "end": 452346,
      "confidence": 0.9663984,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich hoffe nicht. Das war tatsächlich ein ziemlicher Zufall. Das ist so unser eigentlich unser großer claim to fame, dass wir mit dem Thema angefangen haben, bevor es sexy wurde durch die Pandemie. Und ich kann mich tatsächlich auch nicht beschweren, durch die Pandemie hat das Forschungsthema und meine Promotion damit einen super Boost bekommen.",
      "start": 452498,
      "end": 470062,
      "confidence": 0.9385391,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und das nicht nur im wissenschaftlichen Umfeld, denn auch man kennt dich aus, wie sagt man, Film und Fernsehen. Du wurdest bezüglich des Themas schon mehrmals von Heise, Handelsblatt, Wirtschaftswoche, Spiegel und der Tagesschau und dem ZDF interviewt. Und Achtung, als Disclaimer, da haben wir dich auch ausgegraben. Ich habe dich aus einem Instagram Post von ZDF heute zu dem Thema gesehen, habe ich gedacht, wahnsinn, super Podcast Thema. Aber du hast es freut mich ja.",
      "start": 470166,
      "end": 496898,
      "confidence": 0.90913445,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Dass Andi nicht nur irgendwelche Hunde Besitzer und so weiter auf Instagram hat, sondern auch wirklich Informationen sinnvoll über Instagram bekommt.",
      "start": 496914,
      "end": 505322,
      "confidence": 0.8483586,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Kann ich wirklich ZDF heute Instagram Kanal Informationen sehr modern aufbereitet super, aber. Und du hast aber auch unter anderem zwei wissenschaftliche Paper veröffentlicht, einmal zum Thema die Fähigkeit Deutschlands von zu Hause zu arbeiten und ein anderes heißt my home is my Castle, die Vorteile der Arbeit von zu Hause aus während der Pandemiekrise.",
      "start": 505426,
      "end": 527002,
      "confidence": 0.92917943,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau. Schön, dass ich hier sein darf. Vielen Dank für die Einladung.",
      "start": 527066,
      "end": 529762,
      "confidence": 0.93042916,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, freut uns wirklich. Jetzt für mich als Ex Wissenschaftler zumindestens, ist ja auch immer wichtig, wo forschst du da wirklich? Also ifo Institut kann sich ja heutzutage irgendwie alles schimpfen und es gibt ja auch so Institute, da kann man dann irgendwelche, als Politiker irgendwelche Studien, unter Anführungszeichen, Studien anfordern für viel Geld. Also erklär mal, was das IFo ist und ob man bei euch auch schon Studien einkaufen kann praktisch. Gerne.",
      "start": 529906,
      "end": 556658,
      "confidence": 0.9042104,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ifo Institut für Wirtschaftsforschung, das ist ein Leibniz Institut an der Universität München. Das heißt im Grunde, dass alle Wissenschaftler hier, das sind Doktoranden, Postdocs wie ich und Professoren, eine doppelte Affiliation haben, also mit dem Institut und der Uni München. Und ich würde sagen, der größte Unterschied eigentlich zur Uni ist, dass wir etwas weniger in der Forschung involviert sind, aber dafür mehr so policy Arbeiten machen. Und das sind dann so Geschichten wie z.b. auftragsstudien für die IHK oder auch für Ministerien. Aber wie du schon angedeutet hast, ist es wichtig festzustellen, dass wir komplett unabhängig sind. Also wir machen keine Gefährlichkeitsstudien, wir sind auch kein irgendwie Arbeitgeber oder gewerkschaftsnahes Institut oder stehen einer politischen Partei nahe, sondern wir sind öffentlich finanziert wie die Universitäten und machen akademische Forschung. Und das Ziel der meisten Leute hier ist auch eine akademische Karriere tatsächlich.",
      "start": 556714,
      "end": 612428,
      "confidence": 0.9169231,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt hat da Andi schon angesprochen, dass du 2019 mit dem Thema begonnen hast. Das heißt, du hast einen super Überblick, weil du kennst auch die Zeit davor, vor diesem, wie sie manche nennen, die best angerollt ist. Kannst du mal einen Überblick geben, was sich eigentlich so geändert hat? Oder für alle, die es auch nicht wissen, was gab es davor überhaupt an Homeoffice? Weil es, also mir fällt jetzt nur spontan eine Firma überhaupt ein, GitLab, die fully remote war, die man so kennt im IT Bereich. Also was hat sich geändert und wo stehen wir denn aktuell?",
      "start": 612484,
      "end": 644480,
      "confidence": 0.9359645,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, vielleicht fange ich mal damit an, wo wir heute stehen. Also es gibt ja grundsätzlich irgendwie verschiedene Möglichkeiten, die Verbreitung von Homeoffice zu messen. Also wir können z.B. die Unternehmen und die Beschäftigten einfach fragen, wie viel Homeoffice macht ihr denn? Zweitausendein. Und das machen wir im IFo tatsächlich auch. Wir haben eine regelmäßige Firmenumfrage, ihr kennt vielleicht den IFO Geschäftsklimaindex, wir fügen da regelmäßig Homeoffice Sonderfragen mit ein und ist ganz interessant, was da rausgekommen ist, ist, dass seit Abschaffung der Corona Homeoffice Pflicht April 22, manche erinnern sich vielleicht, dass wir seitdem relativ konstant bei 25 % Homeoffice Quote in Deutschland sind. Das bedeutet, dass jeder vierte Beschäftigte zumindest teilweise zu Hause arbeitet. Zum Vergleich, vor Covid lagen wir so bei fünf bis 10 %, also schon deutlicher Anstieg.",
      "start": 644560,
      "end": 696978,
      "confidence": 0.8859298,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was heißt teilweise? Es kann auch ein halber Tag sein. Das reicht theoretisch auch schon aus.",
      "start": 697034,
      "end": 701042,
      "confidence": 0.9388731,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, ein halber Tag. Aber man sollte hier. Genau, das ist einmal eine Firmenumfrage, wo wir Führungskräfte fragen. Das heißt, das ist jetzt weniger so dieses situative Homeoffice, sondern eher das, was ja also auch von denen zweitausendein Führungskräften quasi beobachtet wird oder institutionalisiert wird. Es ist, wir reden jetzt nicht davon, irgendwie zufällig jetzt spontan am Wochenende oder abends E Mails zu beantworten. Also hier geht es schon um mindestens einen Tag die Woche.",
      "start": 701106,
      "end": 725960,
      "confidence": 0.86814976,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und bei den 25 %, die Gesamtmenge ist wirklich. Sind alle Personen, die arbeiten, also auch Fließbandarbeiter oder so sind da.",
      "start": 726040,
      "end": 734696,
      "confidence": 0.88238764,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, das bezieht sich auf alle Beschäftigten, nicht nur die, die Homeoffice machen können. Und ausgenommen sind hier Solo Selbstständige, sondern es sind hier die abhängig Beschäftigten. Genau. Und wir sind hier bei 25, %, das ist super konstant seit der Pandemie, was darauf hindeutet, dass Homeoffice tatsächlich ziemlich verankert ist in Deutschland. Aber jetzt könnt ihr auch irgendwie sagen, ja, umfragen, das glauben wir nicht wirklich. Es gibt noch eine andere Möglichkeit, die Verbreitung von Homeoffice zu messen und das machen wir im Rahmen einer Studie mit, mache ich mit einer Kollegin, in der wir uns Stellenanzeigen anschauen. Und der Vorteil hier ist, dass wir quasi in die Jobbeschreibungen reingucken können, wie häufig die Firmen dann sowas wie mobiles Arbeiten oder die Möglichkeit Homeoffice zu machen oder ortsflexibel zu arbeiten, reinschreiben. Und das ist auch wenig überraschend, dass wir mit dem mit dem Beginn der Corona Pandemie einen drastischen Anstieg sind, von unter 5 % auf aktuell über 20 % aller Stellenanzeigen, die eine Homeoffice Option bewerben. Was hier interessant ist, ist, dass wir keinen Rückgang oder sowas sehen, sondern aktuell tatsächlich auf einen Rekordhoch sind. Und Stellenanzeigen sind besonders interessant, weil sie zum einen naturgemäß irgendwie zukunftsorientiert sind, das sind ja Stellen, die man besetzen will. Und zum anderen geben sie einen guten Aufschluss darüber, wie sich Firmen organisatorisch einstellen für die Zukunft. Und wenn wir jetzt Ÿousand beide Ergebnisse zusammennehmen, so sieht es nicht aus, als wäre Homeoffice tatsächlich jetzt auf dem auf dem Rückzug oder als würden sich die Uhren jetzt auf 2019 zurückdrehen.",
      "start": 734728,
      "end": 831510,
      "confidence": 0.8977355,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Hast du irgendwelche Zahlen, auch wenn man die 25 % jetzt umrechnet auf Personen, die wirklich die Möglichkeit haben, überhaupt Homeoffice zu machen, weil ein Fließbandarbeiter oder ein Arzt ist halt schwierig irgendwie Homeoffice, wobei Ärzte können vielleicht noch Paperwork zu Hause machen, aber also gibt es da irgendwelche Zahlen, wie viel das dann eigentlich bedeutet von denen, die überhaupt die Möglichkeit haben?",
      "start": 831890,
      "end": 852194,
      "confidence": 0.9129473,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zweitausendein.",
      "start": 852242,
      "end": 852380,
      "confidence": 0.76654,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, Andi, du hast ja diese eine Studie erwähnt, die ich publiziert hatte während der Promotion. Das war im Rahmen der Pandemie, war ja die große Frage, wie viel Homeoffice ist denn überhaupt möglich? Wie viel Social distancing können wir am Arbeitsplatz maximal erreichen? Und da hatten wir am IFO ausgerechnet, dass ungefähr die Hälfte aller Jobs in Deutschland prinzipiell mit Homeoffice vereinbar sind, also zumindest Teiltätigkeiten zu Hause ausgeführt werden können. Auf der anderen Seite bedeutet das natürlich, dass die Hälfte der Beschäftigten überhaupt keinen Zugriff, keinen Zugang zu Homeoffice haben. Und das glaube ich, sollten wir auch nicht vergessen, dass nicht alle Jobs dieses Privileg haben. Und tatsächlich, wenn man sich anschaut, wer denn Zugang zu Homeoffice hat, dann sind es vor allem besser ausgebildete Beschäftigte und solche, die in der Regel auch mehr verdienen. Also man könnte sagen, Homeoffice ist vor allem ein Akademikerphänomen. Tatsächlich, was ich auch noch dazu sagen müsste, ist, diese 50 %, das bedeutet nicht unbedingt, dass das irgendwie produktives Homeoffice wäre, sondern das bezieht sich wirklich nur auf die Machbarkeit. Und es war während der Pandemie irgendwie so ein interessanter Indikator, um herauszufinden, was ist die Maximalkapazität. Aber heute diese 25 % zeigt eben, dass ungefähr die Hälfte der Jobs, die theoretisch vereinbar sind, dass in der Hälfte dieser Jobs tatsächlich Homeoffice genutzt wird. Ungefähr.",
      "start": 852410,
      "end": 932184,
      "confidence": 0.8950992,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Im Brand Podcast hat der Arbeitsforscher Hans Rusinek mal gesagt, mit einem Betonmischer kann man nicht ins Homeoffice gehen.",
      "start": 932232,
      "end": 940440,
      "confidence": 0.83735895,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Da hat er recht.",
      "start": 940480,
      "end": 941336,
      "confidence": 0.9749475,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Sehr schöne Analogie. Du hattest gerade schon das den Begriff mobiles Arbeiten genannt. Meine Frage ist, wenn wir von Homeoffice sprechen, kategorisiert das eigentlich doch den Zustand, dass man nicht vom Büro des Unternehmens ausarbeitet und somit inkludiert das eigentlich auch, wenn ich jetzt aus einem Airbnb außerhalb meines Wohnorts arbeite. Also eigentlich doch flexibles Arbeiten, oder? Oder geht das wirklich nur, ich arbeite von meinem festen Wohnsitz?",
      "start": 941448,
      "end": 972600,
      "confidence": 0.93093616,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nee, also im Grunde verstehen wir Homeoffice als nicht vor Ort, also nicht im Büro zu arbeiten. In der Regel ist es tatsächlich von zu Hause aus, aber es gibt ja mittlerweile auch so das Phänomen von Coworking Spaces oder Workation oder aus dem Café raus. Also das verstehen wir so eigentlich alles so unter dem Begriff Homeoffice. Die Unterscheidung ist tatsächlich eine rechtliche hauptsächlich. Vielleicht erinnert ihr euch, vor Covid gab es ja tatsächlich ein bisschen Homeoffice, das stattgefunden hat. Und wenn man damals Homeoffice steuerlich absetzen wollte, dann hat sich das, ging das nur, wenn man einen separaten Arbeitsplatz zu Hause hat, also einen separaten Raum. Und der musste auch bestimmte arbeitsrechtliche Bedingungen erfüllen. Also da ging es dann auch darüber, dass der irgendwie nicht irgendwie gefährlich eingerichtet ist und genug Licht einfällt und so weiter. Und das hat man dann Homeoffice genannt. Aber da man nicht diese Gefahrenüberprüfung jedes Mal machen wollte oder konnte, hat man sich den Begriff mobiles Arbeiten, ich sag mal, ausgedacht, der sich auf dieses komplett Ortswechsel arbeiten bezieht und eben nicht nur das Zuhause von zu Hause arbeiten. Deswegen, wenn man jetzt in die meisten Betriebsvereinbarungen schaut, dann steht da tatsächlich mobiles Arbeiten drin, weil das eben diese ganzen Schutzansprüche an den heimischen Arbeitsplatz eben, also dass die von Seiten des Unternehmens nicht explizit überprüft werden müssen.",
      "start": 973220,
      "end": 1056338,
      "confidence": 0.91474074,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich bin kein Steuerberater, aber mit dem Thema habe ich mich natürlich zwangsläufig ein bisschen auseinandergesetzt. Über all das, was du gesagt hast, bin ich ebenfalls gestolpert, dass der Begriff Homeoffice und von zu Hause arbeiten und mobiles Arbeiten wirklich auch mit dem Finanzamt relevant ist, sozusagen. Auf der einen Seite bei Homeoffice hat natürlich auch der Arbeitgeber theoretisch das Recht, dich zu Hause zu besuchen und auch die Pflicht sicherzustellen, dass alles ergonomisch ist und allem drum und dran. Das ist die eine Baustelle. Dann natürlich mit dem abgeschotteten Raum ist die andere Baustelle. Und da gibt es noch mal so oder gab es bis vor kurzem immer noch so Regelungen, dass deine primäre Arbeitsstätte dein Homeoffice sein muss, um es wirklich steuerlich relevant zu machen. Und das ist z.B. was wir im Intro auch erwähnt haben. Wenn du deine primäre Arbeitsstätte, nämlich deine Heimatadresse in deinem Arbeitsvertrag hast, so wie bei mir, dann kannst du theoretisch die Quadratmeterzahl deines Büros von allen Kosten des Hauses oder der Wohnung, die du für den Betrieb benötigst, das bedeutet Heizkosten, Wasserkosten und so weiter prozentual auf die Wohnfläche mit anrechnen. Das ist natürlich je nach Größe deines Büros steuerlich lohnenswert. Aber Achtung, die Homeoffice Pauschale wurde nämlich für 23 auf €1200 pro Person hochgesetzt. Und da ist es fast einfacher, wenn du jetzt kein 100 Quadratmeter Büro hast, die Homeoffice Pauschale steuerlich einfach zu nehmen. Vorher waren es glaube ich 600 oder 800 und da je nach Wohnfläche, die du hast, kann das natürlich steuerrelevant sein. Also ich bin kein Steuerberater, aber für alle Leute, die darüber nachdenken in einem Job zu gehen, denkt mal drüber nach. Es schützt so ein bisschen, dass dein Arbeitgeber auch dich zurück zum return to Office zwingen kann und so weiter. Also da gibt es so ein paar kleine Kniffe. Wenn ihr da mehr Fragen zu habt, ich bin kein Steuerberater, aber kommt einfach in die Discord Community, da könnt ihr mal sagen, was ich zumindest gemacht habe. Und zurück zum Nichtsteuerberater Wolfgang.",
      "start": 1056434,
      "end": 1172848,
      "confidence": 0.9147795,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und für diesen Tipp verlangt Andy auch nur 5 % von dem, was ihr euch erspart an Steuern.",
      "start": 1172944,
      "end": 1178192,
      "confidence": 0.8729139,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zweitausendein.",
      "start": 1178376,
      "end": 1178698,
      "confidence": 0.84703,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, kommen wir zurück zu Covid. Du hast gesagt 5 % waren es damals und jetzt 25 %, also eine ordentliche Steigerung. Gibt es irgendwelche Informationen, vor allem weil du dich ja damals schon damit beschäftigt hast, warum es damals nur 5 % war waren, also warum war war Homeoffice unbeliebt und warum oder vielleicht sind es jetzt auch diese Themen, warum es return to Office gibt. Also die Argumente werden ja wahrscheinlich wiederkommen, schätze ich mal. Aber wo ist denn der Unterschied bezüglich der Attraktivität oder der Vorurteile gegenüber Homeoffice von der Firmenseite?",
      "start": 1178744,
      "end": 1212534,
      "confidence": 0.91207194,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist tatsächlich eine sehr interessante Frage, weil wenn man so ein bisschen drüber nachdenkt, wir hatten ja eigentlich auch vor Covid schon die ganzen Technologien wie Zoom, Skype, wir hatten auch schon Laptops oder zumindest konnten Firmen, wenn sie den Homeoffice fahren wollten, Laptops zur Verfügung stellen. Also wir hatten die Technologie eigentlich. Und ja, warum haben sie es damals nicht gemacht? Ich glaube, da gibt es zwei Gründe, zwei Hauptgründe, warum Homeoffice vorher kein Phänomen war oder ein Nischenphänomen. Und der eine Grund ist und ich glaube, da können viele auch relaten, ist das Homeoffice einfach einen sehr schlechten Ruf hatte. Also es war negative Stigma des faulen Heimarbeiters oder die Leute, die zu Hause sind, schieben eine ruhige Kugel und sind.",
      "start": 1212662,
      "end": 1253474,
      "confidence": 0.88281864,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Entweder Andi macht das die ganze Zeit weil er zu Hause arbeitet. Der der sitzt im Garten rum und geht mit seinem Hund spazieren, hin und wieder quatscht damit.",
      "start": 1253522,
      "end": 1261728,
      "confidence": 0.8803386,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn du das sagst, dann ich kann das. Ich habe da keine Meinung und keine keine Daten zu, aber ich tatsächlich ist es dieser Ruf und dieses Stigma, was jetzt so ein bisschen obsolet scheint oder so ein bisschen überholt. Da gibt es tatsächlich Befunde, die das ein bisschen belegen oder erklären können. Denn wenn man sich anschaut, wer sich also vor Corona auf Homeoffice Jobs beworben hat, da waren das oft Leute, die weniger produktiv waren und weniger leistungsfähig. Und aus Sicht der Führungskräfte entsteht dann z.B. der Eindruck, dass Homeoffice ursächlich für negative Produktivität ist. Und so entstehen dann Vorbehalte und so ein bisschen so ein sich selbst verstärkender Mechanismus. Also sie beobachten einen Leistungsunterschied zwischen denen, die zu Hause arbeiten und denen, die vor Ort sind. Man hat den Eindruck, Homeoffice macht die Leute weniger produktiv. Die, die leistungsorientiert sind oder karriereorientiert, gehen dann nicht ins Homeoffice, obwohl sie vielleicht produktiver dort wären, sondern sind vor Ort. Und so entsteht dann so ein Ÿousand bisschen, so dieses sich selbst verstärkende negative Stigma und diese pessimistischen Ansichten. Und was Corona geändert hat, ist, dass wir durch dieses erzwungene Experiment alle ins Homeoffice mussten und viele einfach gesehen haben, ja, es funktioniert eigentlich doch ganz gut. Und die Erfahrungen haben in der Breite tatsächlich die Erwartungen übertroffen und so ein bisschen von diesem negativen Stigma abgebaut. Und viele Firmen haben jetzt einfach auch gemerkt, ja, es funktioniert. Beschäftigte zweitausendein sind nicht weniger leistungsfähig und nichts mehr funktioniert, sondern es funktioniert eben doch irgendwie. Der zweite, glaube ich, auch wichtige Grund, warum Homeoffice aktuell ein Phänomen ist und es früher nicht war, sind sogenannte Netzwerkeffekte. Also vor Corona war das für die einzelne Firma, die vielleicht mit dem Gedanken gespielt hat, ein Homeoffice Modell zu fahren, gar nicht so erfolgsversprechend, wenn nicht auch die Kunden, Zulieferer, Stakeholder oder sonst Leute, die im Kontakt stehen mit der Firma, wenn die einfach keine Ahnung haben, wie man jetzt Zoom bedient oder die Software nicht runtergeladen haben, keine Kompetenzen haben. Das macht es für die Firma einfach weniger weniger attraktiv. Und durch Corona sind wir, wie wir sagen, also in der Forschung heißt es ein Koordination Device. Also Covid war quasi ein Mechanismus, der uns alle gleichzeitig koordiniert ins Homeoffice geschickt hat und so für alle gleichzeitig produktiver gemacht hat. Und so gesehen sind wir jetzt im Homeoffice Gleichgewicht, wo es für alle einfach besser funktioniert, als wenn es früher jeder einzelne für sich gemacht hätte.",
      "start": 1261914,
      "end": 1415524,
      "confidence": 0.9212446,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Klingt auch so ein bisschen, als wären die Leute ein bisschen aus ihrer Komfortzone rausgetreten worden und so nach dem Motto es ist mir jetzt egal, was du machst, sondern du probierst das jetzt einfach mal. Auch wenn das, auch wenn man schon immer im Büro gearbeitet hat, war das.",
      "start": 1415572,
      "end": 1431812,
      "confidence": 0.9596152,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Eigentlich auf der anderen Seite auch so, dass es einen schlechten Ruf hatte bei Arbeitnehmern, dass mehr Leute auch vielleicht lieber ins Office gegangen sind, weil sie gesagt haben, ihr habt eh so wenig Platz zu Hause, es funktioniert nicht. Und dann wurden die auch eines Besseren belehrt, dass es vielleicht besser funktioniert, als sie erwartet haben. Gibt es dazu auch Daten oder wird da immer nur die Unternehmensseite eigentlich?",
      "start": 1431836,
      "end": 1451696,
      "confidence": 0.9309517,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, meistens die Unternehmensseite, aber du hast da einen Punkt, weil wenn ich weiß, dass Homeoffice einen schlechten Ruf hat und die Leute denken, ich bin weniger produktiv und weniger leistungsfähig zu Hause, dann gehe ich einfach auch eher ins Office, auch wenn ich zu Hause vielleicht effizienter arbeiten würde. Und ich glaube, das ist das, was ich mit diesem selbstverstärkenden Effekt gemeint habe. In der Forschung nennen wir das adverse Selektion. Also führt dann zu einer Situation, wo Produktivitätspotenziale einfach auf der Strecke liegen, weil die Leute sich so in Office und Homeoffice selektieren, dass es eigentlich ineffizient ist. Aber natürlich, es gibt, wir sehen ja auch, es gibt von den erwähnten 50 % Jobs, die homeoffice fähig sind, wird ja auch nur die Hälfte tatsächlich teilweise zu Hause ausgeführt. Und das hat natürlich auch damit zu tun, dass zweitausendein viele Leute daheim nicht die Möglichkeit haben, sich einen eigenen Arbeitsplatz einzurichten. Für viele spielen auch so Gründe wie Trennung von Privaten und Arbeiten eine Rolle. Also das merke ich auch selber tatsächlich, wenn ich irgendwie drei, vier Tage hintereinander zu Hause gearbeitet habe, dann geht mir, steigt mir das auch zu Kopf, dass irgendwie mein Leben sich auf 50 Quadratmeter abspielt. Also das sind alles Gründe, die auch erklären, warum Leute zum einen so Vollzeit Homeoffice Modelle gar nicht so gerne wollen selbst, also gar nicht wirklich nachfragen und zum anderen, warum es viele Leute gibt, die auch gerne ins Büro kommen, obwohl sie prinzipiell Homeoffice machen könnten. Aber wenn man so in die Breite schaut, ist es schon so, dass Homeoffice eine sehr wertvolle Annehmlichkeit ist aus Sicht der Beschäftigten. Es gibt tatsächlich ein paar Studien, die das versuchen zu quantifizieren. Man nutzt also z.B. sogenannte discrete Choice Experimente, in dem man tatsächlich Leute rekrutiert, das sind teilweise echte Bewerber für echte Jobs und denen da verschiedene Jobbündel anbietet. Also z.b. man sagt ihnen, ihr könnt so und so viel Gehalt haben und die Möglichkeit Teilzeit zu arbeiten oder so und so viel Gehalt mit der Möglichkeit Homeoffice zu machen und dafür keine Überstunden. Also man bietet den Leuten verschiedene Bündel an und die entscheiden sich dann immer für für Option a versus Option B. Und am Ende kann man dann herausrechnen, was denn die Zahlungsbereitschaft für z.B. homeoffice ist. Also wie viel die Leute bereit sind an Gehalt aufzugeben, um die Möglichkeit zu haben, zwei bis drei Tage z.B. zu Hause zu arbeiten. Und in Deutschland gibt es solche Untersuchungen, da kam raus, dass die Leute im Schnitt bereit sind, 7 % Gehalt aufzugeben für die Option zu Hause zu arbeiten. Also wie gesagt, eine extrem wertvolle Annehmlichkeit aus aus Sicht der Bevölkerung, der Beschäftigten und aus Sicht der Unternehmen natürlich auch ein bisschen Verhandlungsmasse. Also man kann prinzipiell sagen, okay, ihr habt die Möglichkeit Homeoffice zu machen und dafür kriegt ihr ein bisschen weniger Gehalt. Also das sind quasi auch Kosteneinsparmöglichkeiten für Unternehmen. Das sollte man auch nicht vergessen.",
      "start": 1451768,
      "end": 1622940,
      "confidence": 0.9244664,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "7 % ist ja natürlich schon relativ hoch, soviel ich weiß, ist 7 % über dem arithmetischen Mittel der, ich sag mal standarddeutschen Gehaltserhöhung. Gibt es denn da mehr Informationen dazu, warum diese Leute sagen, okay, das ist äquivalent zu einer 7 % Lohnsteigerung?",
      "start": 1623020,
      "end": 1641110,
      "confidence": 0.8898468,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Die Gründe sind unterschiedlich, aber der so aus den Umfragen und Erhebungen heraus ist der wirklich der Hauptgrund, der Wegfall der Pendelzeiten. Also die Pendelei ist für viele die größte, eine große Belastung. Ich meine, das sind teilweise ja 1 Stunde oder mehrere Stunden einfach verlorene Lebenszeit so gesehen. Und wenn man sich die einsparen kann, dann ist das für viele extrem viel wert. Ein zweiter Punkt ist natürlich irgendwie die Autonomie, die man im Homeoffice hat, so ein bisschen über seine eigene Zeitanteilung und die Flexibilität. Also ich meine ganz offen, für mich ist Homeoffice auch die Möglichkeit irgendwie nachmittags zu nappen, das ist mir auch was wert. Oder wenn es halt im Sommer irgendwie auf dreiig Grad hochheizt im vierten Stock, dann gehe ich halt auch mal irgendwie mittags ins Gym und arbeite am Nachmittag dann weiter. Also das ist diese Flexibilität und Autonomie, die natürlich einem extrem viel wert ist. Und vielleicht noch ein anderer Punkt für Eltern wissen wir auch, dass eben die Vereinbarkeit von Familie und Beruf, die im Homeoffice von Homeoffice erleichtert werden kann, auch ein Thema ist. Aber wie gesagt, ich will dann immer noch, habe immer noch den Drang zu sagen, okay, aber es ist nicht nur one way, denn wenn man sich allein mal überlegt, wenn jetzt 1 Stunde Pendelei wegfällt und da gibt es auch Zahlen zu, wo man die Leute fragt, ja, was macht ihr denn mit der gewonnenen H? Da kommt auch so raus, dass im Schnitt eine halbe h von dieser H schon zur Arbeit genutzt wird. Also die Unternehmen verdienen da durchaus auch mit oder profitieren davon, weil irgendwie die halbe h, die ich in der Bahn verbringe, ist natürlich weniger produktiv, als wenn ich die schon zu Hause am Schreibtisch verbringe. Also es ist in der Tat Homeoffice aus meiner Sicht tatsächlich eine Win Win Situation.",
      "start": 1641190,
      "end": 1739758,
      "confidence": 0.92039347,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber diese halbe h, wird die dann offiziell, also sieht man in den Daten, dass sie länger gemacht wird, dass ich jetzt anstatt acht 8,5 arbeite? Oder ist es eher so, dann mache ich Freitag Homeoffice und dann zwacke ich mir die halbe h, die ich ja vorgearbeitet habe, dann eher ab. Sieht man da irgendeine Tendenz?",
      "start": 1739854,
      "end": 1756340,
      "confidence": 0.9079098,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also was man sieht ist, dass Arbeitstage fragmentierter werden. Also hatte ich erwähnt, die Leute nutzen die Flexibilität, um zwischendurch andere Sachen zu machen. Die Arbeitstage werden dadurch auch insgesamt längerfragmentierter. Also es ist nicht mehr so neun to fünf ein Arbeitsblock, sondern tatsächlich längere Arbeitstage insgesamt. Was die tatsächlich gearbeiteten Stunden angeht, scheint es auch so zu sein, dass die tatsächlich steigen. Und da gab es durchaus auch Concerns, was Homeoffice angeht, dass das ein bisschen dazu führen könnte, dass die Leute ausbrennen, weil die mehr arbeiten. Was auch damit zu tun hat, dass Leistung im Homeoffice natürlich irgendwie nicht mehr an der abgesessenen Präsenzzeit vor Ort gemessen werden kann, sondern eher am Ergebnis. Und sowas kann auch Druck erhöhen, wenn man dann einfach mehr Deadlines hat und so ÿousand abliefern muss. Das hat sich jetzt tatsächlich jetzt mit den neueren Daten nicht wirklich gezeigt, dass das ein großes Problem ist. Eigentlich durch alle Studien hinweg sieht man, dass die Jobzufriedenheit extrem steigt, wenn die Leute die Möglichkeit bekommen, Homeoffice zu machen. Ich arbeite tatsächlich selbst gerade an einem Forschungsprojekt, wo wir uns anschauen wollen, mithilfe von Krankenkassendaten, ob es bestimmte Befunde oder Hinweise darauf gibt, dass irgendwie so bestimmte Krankheiten oder vor allem mentale Geschichten oder Stress, mit Stress verbundene Geschichten irgendwie häufiger werden im Homeoffice. Aber ich glaube, so grundsätzlich deutet vieles darauf hin, dass die Leute tatsächlich, dass es, dass die Leute tatsächlich zufriedener sind und dass Krankheitstage tatsächlich zurückgehen. Also die Studien, die wir, die wir kennen, zeigen, dass ein Teil der Produktivitätsgewinne im Homeoffice daher kommt, dass die Leute sich weniger krank melden. Aber hier ist tatsächlich die Frage, melden sie sich einfach nur weniger krank und arbeiten dann halt zu Hause mit dem Schnupfen oder der Grippe halt weiter oder sind sie wirklich auch weniger krank? Das ist glaube ich, noch eine offene Frage.",
      "start": 1756920,
      "end": 1870822,
      "confidence": 0.90810305,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wenn du diese Daten mal anschaust, diese Krankenkassendaten, dann würde ich gerne eine Prognose abgeben. Ich würde sagen, die Bandscheibenvorfälle steigen. Hatten wir unter anderem in einer anderen Episode, wo wir einen Fitnesstrainer ein bisschen interviewt haben zum Thema Knowledge Worker, kontinuierlich sitzen, dauerhaftes stehen. Was ist da gut? Deswegen aber die Frage ist, du sitzt.",
      "start": 1870926,
      "end": 1892958,
      "confidence": 0.92798287,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja sowieso, ob du jetzt im Office sitzt oder im Homeoffice, ist dann die Frage, ob es einen großen Unterschied macht.",
      "start": 1892974,
      "end": 1897654,
      "confidence": 0.9333462,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, beim Office gehe ich ganz eindeutig öfter zur Kantine, öfter in die Küche, mir einen Kaffee holen, ich wechsel Meetingräume und hier springe ich ja nur von einer Zoom Session in die nächste Microsoft Teams Session. Also von daher. Aber du hattest auch gerade schon längere Arbeitszeit und das Wort Produktivität erwähnt. Nur weil ich länger arbeite, heißt das ja nicht Ultimatum, dass ich produktiver bin. Gibt es denn positive oder auch negative Effekte auf das Wort Produktivität aus Unternehmersicht, aus Arbeitgebersicht? Und dann die zweite Geschichte, weil du hattest ja gesagt, Homeoffice fällt meist auf dieses Akademikerphänomen wie wie misst man überhaupt bei akademisch relevanter kreativer Arbeit Produktivität bzw. Wie ist es in den Daten oder wissenschaftlich definiert? Weil in irgendeiner Art und Weise müsst ihr ja irgendwas zugrunde legen.",
      "start": 1897702,
      "end": 1943862,
      "confidence": 0.92144907,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist eine sehr gute Frage und glaube ich so aus irgendeinem Grund so der Aufhängerpunkt in der öffentlichen Debatte. Was macht Homeoffice mit der Produktivität? Vielleicht kurz zur Definition. Also ganz einfach Produktivität ist so Output geteilt durch Input. Also was mein Output, das ist z.B. ja irgendwie das, was ich abliefere. Und Input ist in der Regel Arbeitszeit. In der Vergangenheit, wenn man versucht hat, den Effekt von Homeoffice auf Produktivitätsveränderungen zu messen, hat man sich sehr stark fokussiert auf so einfache Tätigkeiten zweitausendein, weil da Produktivität einfacher zu messen ist. Z.B. in Callcenter Tätigkeiten, da kann man sich einfach anschauen, z.b. wie viele Calls bearbeite ich in einer Stunde oder an einem Tag? Wie häufig rufen Kunden zurück, weil ich sie, weil ich sie vielleicht schlecht beraten habe. Also sowas kann man eben einfach messen. Und was wir wissen zu diesen Art von Tätigkeiten, da gibt es eine berühmte Studie aus der Zeit vor Corona, tatsächlich aus einem Ÿousand Feldexperiment, wo sie in ein großes Callcenter in China gegangen sind und da wirklich zufällig eine Gruppe ins Homeoffice geschickt haben über, also eine zufällig ausgewählte Gruppe ins Homeoffice geschickt haben über neun Monate und eine Gruppe hat weiterhin vor Ort gearbeitet. Das war tatsächlich ein hybrides Modell, also die sind einen Tag noch reingekommen für Schulungen und Meetings und so weiter. Und was die herausgefunden haben, ist, dass die Produktivität extrem stark gestiegen ist, um satte 13 %. Zum Teil getrieben, wie erwähnt, von weniger Krankheitstagen, weniger Pausen und tatsächlich auch effizientere Arbeit, also einfach eine effizientere Nutzung der einen H. Ich glaube so die die Key Schlussfolgerung aus der Studie ist, dass zumindest für so einfache Tätigkeiten scheint Homeoffice oder diese ruhigere Arbeitsumgebung tatsächlich die Produktivität zweitausendein zu befördern. Also in Aufgaben, die man so gut in Einzeltätigkeit absolvieren kann, wo man sich wenig koordinieren muss, wo man jetzt auch wenig innovativ oder kreativ sein kann. Also ich glaube, das ist so, ja so relativ Konsens, dass es da funktioniert. Aber wie du erwähnt hast, so die große Frage ist so was wie ist es für die Knowledge Worker, für die Homeoffice auch in der Regel ja eher zugänglich ist. Und da ist die Frage, wie MS. Man Produktivität eine sehr schwierige. Also man kann es z.B. machen, indem man Performance Reviews untersucht. Also ich meine, man wird ja trotzdem, auch wenn man jetzt IT entwickelt, also in der IT arbeitet oder Softwareentwickler ist, wird man ja trotzdem irgendwie evaluiert. Sowas kann man sich anschauen. Man kann sich auch sowas wie Lines of code anschauen, was also aus meiner Sicht vielleicht nicht das beste Maß für Produktivität ist, weil ich glaube, effizienter Code ist meistens auch eher kürzer oder man schaut sich eine Anzahl an Commits an oder so. Also da gibt es verschiedene Möglichkeiten, das zu messen. Ich glaube, bei diesen Tätigkeiten ist aber, wenn man über Produktivität nachdenkt, noch ein zweiter Punkt sehr wichtig, der, der uns die ganze Sache schwierig macht, nämlich, dass nicht nur unmittelbar Produktivität quasi was schaffe ich an diesem einen Tag relevant ist, sondern auch irgendwie wie verhält es sich mit Innovationspotenzial, wenn es, wenn wir in Bereichen sind, wo wir lange Zeit an an Lösungen, über Lösungen nachdenken, wo wir neue Produkte entwickeln, wo wir Sachen patentieren wollen. Da geht es um sehr viel Kreativität und Innovation, die man jetzt nicht an einem Tag messen kann, sondern wo es eher darum geht Okay, gibt es irgendeinen Tag x, wo wir plötzlich diesen einen Einfall haben? Und da ist eine Studie ganz interessant, nämlich da Forscher haben sich angeschaut, wie hat sich Kommunikation in Microsoft verändert, als die während aufgrund von Covid komplett auf remote umstellen mussten. Und was sie herausgefunden haben ist, dass die Kommunikation zwischen Mitarbeitern sich, nachdem sie auf Homeoffice gewechselt hat, extrem stark konzentriert hat auf die engsten Teammitglieder und Kommunikation über Teamgrenzen hinweg und Abteilungsgrenzen hinweg stark gelitten hat. Und die Erkenntnis hier ist, dass wenn wir in einem Bereich sind, wo Kreativität und Wissensaustausch und voneinander lernen wichtig ist, dann kann diese Einschränkung von Wissensflows langfristig problematisch sein. Denn die Gefahr ist, dass so wissenssilos entstehen, dass wir in verschiedenen Teams plötzlich das Rad zweimal erfinden, weil wir eben nicht mehr wissen, was die Kollegen in anderen Abteilungen machen und dass diese Spontanität und ja informeller Austausch so wegfällt, dass einfach auf Dauer Innovationspotenzial verloren geht. Vielleicht sage ich auch dazu, dass wir auch aus der Vergangenheit wissen, dass also die konnten in diesem Fall tatsächlich nur digitale Kommunikation messen, aber wir wissen, dass tatsächlich persönliche Kommunikation sehr stark korreliert mit digitaler Kommunikation. Also die Erkenntnis hier ist wirklich okay, in diesen hochkreativen, innovativen Bereichen kann das tatsächlich einen langfristigen Kosten, Produktivitätseinbrüche, Innovationseinbrüche schaffen, wenn wir diese Form von Austausch nicht mehr ermöglichen.",
      "start": 1944006,
      "end": 2257542,
      "confidence": 0.9011501,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt hast du mit deiner Aussage man kann ja lines of code verwenden, wahrscheinlich bei allen unseren Hörerinnen, die sind gerade alle in die Luft gesprungen und 2 m über. Also die haben sich jetzt endlich bewegt von ihrem von ihrem Stuhl und sind aufgestanden. Das ist natürlich ganz heißes Thema und wir haben ja auch schon oft darüber gesprochen, wenn z.B. episode 87 eigene Episode nur über so Produktivitätsmessungen auch gemacht, Dora Metriken damals und sogar diese Episode hat extreme Diskussionen dann auch in unserem Discord Channel natürlich geklappt, weil egal was man verwendet, es ist immer irgendwie ein großes Problem. Darum ist natürlich noch interessanter, wenn man so silos wie grundsätzlich Kommunikation abläuft, ist natürlich dann, dann verlagert man die Diskussion vielleicht ein bisschen von der klassischen Performance Messung, die ja auch im Office extrem schwierig ist, weil du weißt ja nicht, was was diese Person produziert, nur weil sie am Computer sitzt oder Ÿousand Facebook herumsurft oder oder was auch immer. Also das ist natürlich super schwierig, da in irgendeiner Form Produktivität zu messen und vielleicht daraus dann auch einen Informationsgewinn überhaupt rauszuziehen. Aber mir persönlich ist es halt z.B. immer sehr wichtig, dass der sogenannte Happiness Score in den Teams natürlich auch gut ist. Und vielleicht kann man sowas einfach durch Befragungen auch messen, ob die Teams an sich glücklicher sind oder und dadurch natürlich dann auch vielleicht mehr Output haben, weil sie einfach gerne arbeiten und das einfach gut funktioniert. Aber auch das ist natürlich super schwierig zu messen und kann natürlich nur über Befragungen gehen.",
      "start": 2257606,
      "end": 2344620,
      "confidence": 0.9005018,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da habt ihr absolut recht und ich, also ich sehe das genauso, nur man kann ja in diesen Bereichen gibt es ja trotzdem Beförderungen und irgendwie wird ja trotzdem Leistung gemessen und wir können dann trotzdem, wenn wir jetzt herausfinden wollen, welchen Unterschied macht Homeoffice, können wir quasi das als gegeben nehmen und uns anschauen, wie verändert sich die Leistungsbewertung z.B. anhand von Performance Ratings oder Reviews. Also das ist dann ein bisschen unabhängig von der grundsätzlichen Debatte, sondern gegeben dem, was wir haben, wie verändert sich das? Und da gibt es tatsächlich also auch einige Studien, die sich jetzt dezidiert auf besser ausgebildete Leute fokussieren, um herauszufinden, wie sich da Produktivität gemessen an Performance Reviews verändert. Vor dem Hintergrund eben, dass zweitausendein Face to face in diesen Bereichen immer noch eine wichtige Rolle spielt. Wie gesagt, Wissensteilung, voneinander lernen. In all diesen hybriden Homeoffice Studien zeigt sich in der Regel, dass die Produktivität neutral bis leicht positiv tatsächlich sich verändert, also keine Produktivitätseinbrüche. Wo wir aber große Veränderungen sehen, ist tatsächlich bei der Jobzufriedenheit, also Stichwort Happiness und damit einhergehend auch mit den mit fallenden Kündigungsraten von bis zu dreiig %. Und das ist natürlich aus Sicht der Unternehmen auch ein riesen Kostenfaktor, der damit wegfällt. Ich glaube, es gibt so unter hr so die Daumenregel, so eine Kündigung kostet so ein halbes Jahresgehalt und im Developmentbereich wahrscheinlich eher zwei Jahresgehälter. Das heißt, hier lassen sich auch immens viel Kosten einsparen. Und gleichzeitig räumt es auch mit so einem Mythos auf, den man auch oft rumgeistern sieht, vor allem von Home Office Kritikern, nämlich, dass Homeoffice irgendwie die Leute weniger loyal werden lassen würde. Das Gegenteil ist der Fall. Die Leute, also Homeoffice scheint wirklich die Mitarbeiterbindung zu verbessern. Und was wir auch sehen ist tatsächlich, dass Beförderungsraten in diesen Experimenten nicht unterschiedlich sind. Also Leute, die im Homeoffice in diesen hybriden Modellen arbeiten werden nicht seltener befördert, als sie vor Ort sind. Das heißt, wenn wir wieder an den Anfang des Gesprächs gehen, diese Situation, dass die, die zu Hause arbeiten, quasi aus den Augen, aus dem Sinn sind, weil sie dieses negative Homeoffice Stigma angehaftet haben, das scheint jetzt in den neueren Studien eben nicht mehr der Fall zu sein.",
      "start": 2344700,
      "end": 2493842,
      "confidence": 0.917931,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wenn du jetzt diese Studien erwähnst und Homeoffice, klingt das meistens nach hybride Setups, also keine fully remote, sondern dass ich eben gewisse Tage auch im Office bin und dadurch natürlich vielleicht auch gewisse soziale Interaktion nachholen kann oder gewisse Dinge eben auch vor Ort klären kann. Gibt es auch irgendwelche Daten zu Fully Remote? Also das, was Andi macht, er versteckt sich da in seinem Garten und und liefert hin und wieder was über Slack.",
      "start": 2493946,
      "end": 2519360,
      "confidence": 0.90822774,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also es scheint, es gibt auch Studien zu Fully Remote und da verdichtet sich tatsächlich die Evidenz, dass das Vollzeit Homeoffice die Produktivität senkt, vor allem eben bei Tätigkeiten, die bei Tätigkeiten von Knowledge workern. Warum? Weil eben Koordination, voneinander lernen extrem wichtig ist. Es gibt Studien, die sich auch im Developmentbereich anschauen, wie z.B. feedback sich verändert, wenn die Leute auf remote umstellen. Und da sieht man, dass vor allem die jüngeren Leute darunter leiden, weil sie weniger Feedback auf ihren Code bekommen, den sie früher zwar auch online bekommen haben, aber den sie durch spontanen Kontakt oder spontane Gespräche im Office quasi erfragen konnten. Und langfristig gedacht ist es natürlich ein immenses Problem, weil man so eben langsamer und weniger gut Fähigkeiten und sein Humankapital in der Firma aufbauen kann.",
      "start": 2519980,
      "end": 2575882,
      "confidence": 0.9162332,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber man könnte jetzt ja auch sagen, man kann ja sofort in der Zoom Session springen und und das abklären.",
      "start": 2575986,
      "end": 2582002,
      "confidence": 0.8795335,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Prinzipiell schon, aber es scheint tatsächlich so zu sein, als dass das eine Hürde ist und dass diese Spontanität, dieses einfach am Büro vorbeilaufen und den den erfahrenen Kollegen nach Feedback zu fragen, dass das eine große Rolle spielt und auch diese ungeplanten wahrscheinlich. Also man weiß nicht genau, wie diese Form des Austauschs tatsächlich, wo sie stattfindet. Also ist das jetzt in der Kaffeekanne, in der Kaffeeküche oder ist das jetzt ich laufe rüber ins Büro? Aber man sieht ganz klar, dass wenn diese Spontanität und diese diese Nähe wegfällt durch Homeoffice, dass auch Feedback und dieses voneinander lernen erschwert wird. Und die Erkenntnis ist hier, dass eben besonders Jüngere darunter leiden, wenn sie ihre Fähigkeiten nicht nicht, weil sie ihre Fähigkeiten dann eben nur langsamer oder gar nicht aufbauen können.",
      "start": 2582146,
      "end": 2629258,
      "confidence": 0.9088225,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also die Idee Kaffeekanne wäre für mich schon Kündigungsgrund, aber sagen wir mal bei der Kaffeemaschine, die ein gutes Kaffee macht. Also es gibt, das ist kein Mythos, sondern es ist halt ein Sammelbegriff, der ja für diese ganzen Interaktionen, die so zwischen Tür und Angel basieren, durchaus stattfinden. Also das ist, wenn ich dich richtig verstehe, ist es belegt, dass es dieses Phänomen gibt, auch wenn man nicht genau weiß, wann und wo das stattfindet.",
      "start": 2629354,
      "end": 2656156,
      "confidence": 0.88943845,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, es gibt tatsächlich neuere Studien, die mit Handy Geo Koordinaten arbeiten und die Leute wirklich verfolgen können, wo sie sich genau treffen. Zweitausendein eher zufällig, weil ihre Betriebe nah beieinander sind, zufällig öfters in Kontakt treten, öfters zusammen in Patenten zitiert werden. Also dieses Stichwort, was in der Forschung oft serendipity genannt wird, also diese Zufälligkeit, die ermöglicht wird durch physische Nähe, scheint wirklich eine große Rolle zu spielen, sowohl im Silicon Valley als auch im gleichen Betrieb, wenn Juniors von Seniors lernen oder Zweitausendein, wenn es um Wissensaustausch gibt und Austausch geht.",
      "start": 2656188,
      "end": 2700736,
      "confidence": 0.92014736,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber hat die ganze Sache nicht auch einen gesellschaftlichen Anteil? Ich meine, in unserer, ich sag mal, westlichen Welt ist es natürlich einfacher, jemanden, ich sag mal, anzustupsen, wenn er in der Nähe ist. Wenn man den sieht, der läuft an einem vorbei, hey, ich renne mal kurz hinterher und Tipp den da kurz an. Oder Kaffeeküche, haben wir auch schon gerade drüber gesprochen. Und auch die Natur der Arbeit, weil die, wie man remote arbeitet, ist ja schon anders. Also das bedeutet, ich kann mich mehr fokussieren, habe ich jetzt alle Slack Notifications und Microsoft Teams Notifications aus und kriege ich ja gar nicht mit, dass mich jemand virtuell anstupst. Das bedeutet, ich kann mich auf mein Dokument konzentrieren. Wohingegen, wenn jemand bei mir am Schreibtisch steht, kann ich mich ja eigentlich offiziell gar nicht wehren, weil die Person steht ja da. Also meine Frage ist das ein Seiteneffekt bzw. Ÿousand das Ergebnis von einer unterschiedlichen Arbeitsnatur, wie man arbeitet? Und da kommt es dann vielleicht natürlich auch mit der zweiten Frage, was du auch genannt hattest, Neulinge oder Juniors haben gegebenenfalls ein paar mehr Herausforderungen als berufserfahrene Seniors oder ähnliches. Es geht natürlich viel um Arbeitsstruktur, Zielrichtung und so weiter.",
      "start": 2700768,
      "end": 2773670,
      "confidence": 0.91501516,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist ein guter Punkt. Also so ganz genau ist es natürlich schwierig, das irgendwie empirisch zu Ÿousand zu untersuchen. Aber selbst bei deinem Beispiel, dieses mit diesem online anstupsen, ich glaube, dass ein großer Punkt ist da eben tatsächlich diese Zufälligkeit, die gibt es in der Online Sphäre so ja noch nicht. Also man kann sich natürlich so Modelle ausdenken und ich glaube, dass Technologie natürlich mit der Zeit eine Rolle spielen wird. Tatsächlich, wenn man sich Patentanmeldungen anschaut im Bereich Lösungen, die Remote work unterstützen sollen, dann ist seit Corona dann absoluter Boom zu sehen. Das heißt, wir können sicherlich auch damit rechnen, dass neue Sachen entstehen, die vielleicht auch genau solche Aspekte adressieren, aber ich habe diese tatsächlich diese Spontanität und das, was menschliche Beziehungen und Vertrauensaufbau und sowas tatsächlich ausmacht, dass das im Persönlichen einfach mehr funktioniert und auch letztendlich wichtig ist für eine Ebene, auf der zu Spontanität und sowas auch Ÿousand tatsächlich stattfinden kann. Also das wäre sozusagen der dritte Punkt, wo ich noch gesagt hätte, das ist was, was vor allem bei Vollzeit Remote work komplett verloren geht, ist eben diese soziale Aspekt beim Lunch irgendwie im Team, bei den Kaffeepausen, da geht es sehr viel um Aufbau von Beziehungen und Vertrauen, da geht es auch um klassisches Netzwerken irgendwie. Das sind alles Aspekte, die verloren gehen und die aber wirklich eine wichtige Komponente zu sein scheinen. Bei Hybriden Modellen, wenn die gut strukturiert und austariert sind, dann scheint es tatsächlich möglich zu sein, das Beste aus beiden Welten irgendwie zu vereinen. Bei Vollzeit remote ist das anders, da verliert man diese Aspekte. Trotzdem und das ist vielleicht auch einmal wichtig zu sagen, gibt es diese Modelle und sie können sich für Firmen natürlich lohnen, weil auf der anderen Seite riesen Kostenblöcke weg wegfallen, denn man kann sich prinzipiell komplett frei machen von irgendwelchen Büros, die man unterhalten muss. Man kann prinzipiell weltweit Leute rekrutieren, was auch Lohnkosten senkt und man ist grundsätzlich auch als Arbeitgeber vielleicht attraktiver für für viele Leute, die eben weit weg wohnen oder nicht pendeln können, weil sie z.b. behinderungen haben oder aus anderen Gründen. Remote, also fully remote Konzepte können funktionieren, sind aber Nischenphänomen, weil es also zum einen natürlich auch wenig Geschäftsmodelle gibt, die man komplett remote fahren kann, aber wie ich vorhin erwähnt hatte, wenige Beschäftigte wollen auch wirklich vollzeit remote arbeiten. Für die meisten ist der persönliche Kontakt zu Kolleginnen und Kollegen schon ein wichtiger Aspekt ihres Arbeitslebens.",
      "start": 2773750,
      "end": 2938588,
      "confidence": 0.9042862,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Man muss ja auch dazu sagen, dass die klassischen fully remote Konzepte ja auch nicht wirklich fully fully sind, sondern keine Ahnung, z.B. bei Salesforce weiß ich, dass das Onboarding z.B. findet immer in Amerika an demselben Standort statt oder wie es manche Brainwashing nennen, andere Onboarding, wie man da auch immer dazu sagt. Es gibt meistens irgendwie so ein, zweimal im Jahr irgendwelche Off Sites, wo man sich trifft, also auch so Firmen wie Thirty Seven Signals, die das ja schon immer fahren, diesen Fully remote Ansatz. Die Macher von Basecamp und und hat Com, die haben genauso einmal, glaube ich, im Jahr mindestens ein wirklich Treffen, wo man sich trifft und Party macht und Sachen bespricht. Und auch der Andy kommt hin und wieder aus seinem Garten raus und fährt nach Berlin oder mal nach Oslo für ein paar Tage. Also Fully Fully Remote ist ja wirklich absolute Nische. Also sogar das gibt es, glaube ich, in großen Firmen kaum bzw. Macht keinen Sinn. Und weil eben der soziale Aspekt in irgendeiner Form noch gebraucht wird, weil wie soll man sonst irgendwie ein Vertrauensverhältnis aufbauen? Also das rein über Videocalls ist natürlich schon, glaube ich, sehr, sehr schwierig.",
      "start": 2938644,
      "end": 3004652,
      "confidence": 0.8819164,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, da hast du recht. Ich glaube so vielleicht ein Phänomen, was man auch noch erwähnen könnte, wenn so diese digitalen Nomaden, ich glaube, das sind, das sind Leute, die auch so bei Fully Remote arbeiten, aber das ist, sieht man das halt vor allem bei jungen Leuten, die irgendwie noch irgendwie so Reiselust haben und dann von Land zu Land reisen und da dann mit dem Laptop unterwegs sind. Und da gibt es jetzt immer mehr Länder tatsächlich, die extra so Visa Programme haben für solche Leute. Aber das ist wie gesagt auch eher ein Randphänomen.",
      "start": 3004756,
      "end": 3032332,
      "confidence": 0.9068798,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und ja, das geht jetzt in die andere Richtung, dass sich die ganzen Länder wieder oder die Einwohner beschweren. Also in Spanien hat es ja diesen vergünstigten Steuersatz gegeben und in Portugal und überall, wo jetzt die, die ja die Digital Nomads nicht mehr so beliebt sind und irgendwo mit Graffitis an den Wänden steht, dass sie sich eher verpissen sollen.",
      "start": 3032396,
      "end": 3051040,
      "confidence": 0.88688064,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, tatsächlich, das habe ich nicht mehr mitbekommen, aber ich glaube so grundsätzlich, also die die Nachfrage nach diesen Modellen ist auf jeden Fall gestiegen, wobei die auch.",
      "start": 3051950,
      "end": 3061286,
      "confidence": 0.8646593,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Eher so dann oft so eher Freelancer sind und vielleicht so zuarbeiten bei Firmen. Es ist dann seltener, dass die gesamte Firma nur auf solche Digital Nomads beruht, aber ja, und es gibt auch Firmen, die dann teilweise halt wirklich Offices in beliebten Ÿousand Gegenden probieren aufzumachen, weil einfach dort viele Digital Nomads unterwegs sind und sich dann da wieder Offices gründen, neue. Das hat man durchaus auch gesehen in den letzten Jahren immer öfter.",
      "start": 3061318,
      "end": 3089428,
      "confidence": 0.9129944,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt haben wir schon sehr viel über die Zahlen und Experimente und die Ergebnisse gehört. Gibt es denn auch Erkenntnisse, was gute und schlechte Homeoffice Konzepte sind? Also was, worauf man oder was man abwägen sollte, um die ganze Sache ja zweitausendein einzuführen?",
      "start": 3089524,
      "end": 3105298,
      "confidence": 0.90222603,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Du kannst jetzt, du kannst jetzt vom Wissenschaftler in den Consulting Mode schalten, also.",
      "start": 3105354,
      "end": 3111070,
      "confidence": 0.901175,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Meine Consulting Brille auf. Also ich glaube dann, ich fange mal mit einer sehr wissenschaftler Antwort an. Es kommt drauf an.",
      "start": 3112010,
      "end": 3119906,
      "confidence": 0.87333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also es kommt auch immer, das sage.",
      "start": 3120018,
      "end": 3122898,
      "confidence": 0.75817287,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich auch ITler jeder.",
      "start": 3122914,
      "end": 3124470,
      "confidence": 0.4933275,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, aber ich werde versuchen ein paar Beispiele zu nennen. Also es kommt natürlich entscheidend auf die Umsetzung zweitausendein drauf an. Vielleicht eine Anekdote ich war letztes Jahr in den USA und auf dem, als ich auf dem Rückflug war, hat der ehemalige Trigema Chef Wolfgang Grupp wohl eine Aussage getätigt, irgendwie sinngemäß wer zu Hause arbeitet, ist nichts wert oder arbeitet nicht richtig oder so. Und als ich gelandet bin, ist mein E Mail Postfach komplett explodiert mit Anfragen. Ja, was was sagt denn die Forschung jetzt Produktivität? Jetzt heißt er sagt, das ist alles, funktioniert alles nicht. Funktioniert es denn oder nicht? Und ich war dann ein bisschen überfordert und habe dann erstmal den diesen Herrn gegoogelt und habe dann tatsächlich Zeitungsberichte gesehen, wo er in Interviews relativ selbstbewusst schön formuliert, dass er keinen Computer nutzt und sich e Mails ausdrucken lässt. Und ich meine, ich glaube, das ist ein gutes Beispiel darüber, dass dafür, dass wenn man Führungskräfte hat, die in einem Unternehmen, die weder die Kompetenzen noch die Bereitschaft haben, Homeoffice Modelle irgendwie vernünftig umzusetzen, dass dann das Homeoffice, was stattfindet, einfach nicht produktiv sein kann, dass man natürlich Management und Führungsstile auch anpassen muss, wenn die Leute nicht mehr vor Ort sind, wenn die Leute nicht zur gleichen Zeit jetzt verfügbar sind. Früher ist man oft damit davon gekommen, durch die Büros zu laufen und über die Schulter zu schauen und Feedback zu geben oder Aufgaben zu verteilen und es funktioniert natürlich mit Homeoffice nicht mehr. Also vielleicht noch mal bezogen auf das, was wir vorhin besprochen haben, so die Aspekte, wo Präsenz tatsächlich Homeoffice überlegen, überlegen zu sein scheint, also Teilung von Wissen, voneinander lernen, soziale Aspekte. Das spricht alles dafür, dass eine gewisse Koordination von Präsenzzeiten oder Präsenztagen tatsächlich sehr sinnvoll ist. Was bedeutet das? Bedeutet z.b. dass man sich überlegt, okay, für ein Team oder eine Abteilung können wir das irgendwie schaffen, dass die Leute gleichzeitig vor Ort sind und eben diese gemeinsamen Präsenzzeiten haben. Ein Worst Case Szenario ist ja, wenn die Leute dann quasi ins Büro fahren, aber dort dann niemand ist und sie dort dann wieder nur in Zoom Calls hängen oder einfach die gleiche Arbeit an einem anderen Schreibtisch machen. Das heißt, man will dafür sorgen, dass die Leute gemeinsam vor Ort sind, indem man diese Ankertage schafft und koordiniert, wie viel Präsenz zeigen und Zeiten und wie viel Ankertage man jetzt festlegt, ist natürlich irgendwie sehr sehr branchen und betriebsabhängig. Also ich würde sagen grob in den Bereichen, wo Innovation und so weiter sehr wichtig ist, bräuchte man wahrscheinlich mehr Koordination und da, wo die Tätigkeiten weniger Kreativität und Koordination erfordern, kann man mit einem höheren Homeoffice Umfang auch davon kommen. Also Koordinierung von Präsenztagen und Präsenzzeiten ist ein wichtiger Punkt. Der zweite Punkt ist dafür ist dafür zu sorgen, dass an diesen Präsenztagen natürlich auch das stattfindet, was irgendwie von Präsenz, von gemeinsamen Präsenz und Austausch profitiert. Also das wären dann sowas wie Schulungen, Präsentationen, Mentoring, Onboardings, soziale Aspekte, also gemeinsame Mittagessen, vielleicht auch ein fancy Catering organisieren, dass die Leute gerne vor Ort sind, diesen Austausch, den sie im Übrigen ja auch wollen, zweitausendein die Leute kommen ja auch rein, nicht um einfach nur im Büro zu sitzen, im Einzelbüro, sondern um den Kontakt zu ihren Kolleginnen und Kollegen zu bekommen, dass man das dann ermöglicht. Das bedeutet, dass man die Arbeitswoche auch irgendwie strukturieren muss, dass man sich überlegen muss, okay, wo legen wir welche Events und Tätigkeiten hin und welche Aufgaben und Tätigkeiten nehmen die Leute mit ins Homeoffice? Und das sind wie gesagt die Tätigkeiten, die man gut in so konzentrierte Einzelarbeit absolvieren kann. Das sind Meetings in kleinen Gruppen, also Zoom Meetings finde ich z.B. wenn ich mit Studenten zoome z.B. denn das ist ideal, wenn man im Bildschirm teilen kann und sich da eine Präsentation z.B. anschauen kann. Das ist finde ich teilweise sogar entspannter, als wenn man jetzt nebeneinander vor dem gleichen Bildschirm sitzt. Also solche Sachen funktionieren tatsächlich auch sogar besser im Homeoffice und kleinen Gruppen zu diskutieren oder oder Präsentation zu arbeiten, lesen, schreiben, solche Geschichten. Aber das bedeutet wie gesagt natürlich, dass man das die Arbeitswoche irgendwie aktiv strukturieren muss. Und vielleicht so als dritter Punkt, der jetzt auch immer wieder in den Medien war, ist okay, wie ändern wir die Offices, wie ändern wir Büroräume, wie ändern wir das so, dass dieser gemeinsame Austausch tatsächlich auch möglichst produktiv stattfinden kann. Vielleicht ein aktuelles Beispiel bei uns am Institut, also wir hatten irgendwie letztes 2000 während Corona wurde bei uns das Archiv komplett zugemacht und ausgeräumt und da war eine Zeit lang die Idee, dass man da vielleicht irgendwie mehr Büros rein machen könnte, aber das hat sich dann natürlich auch erledigt mit Homeoffice und alles mögliche. Und stattdessen ist jetzt einfach ein neuer Seminarraum entstanden und so eine neue Kaffeeecke, in der man relativ in so einer relativ entspannten Atmosphäre eben mit beieinander sitzen kann und eben diesen informellen entspannten Austausch ermöglicht. Also hier geht es wirklich um die Frage wie verändern wir Büroflächen, damit gemeinsame Zeit möglichst angenehm ist? Also mein Take ist hier tatsächlich das. Also die große Frage ist ja, wie viel Büro könnten wir tatsächlich einsparen? Das ist bei hybriden Modellen tatsächlich sind diese Einsparmöglichkeiten aus meiner Sicht gar nicht so hoch. Denn wenn wir koordinieren, wollen wir, dass die Leute an bestimmten Tagen gleichzeitig vor Ort sind. Das heißt, wir brauchen die Flächen und wir brauchen vielleicht sogar mehr Fläche, wenn wir eben diese diesen gemeinsamen Austausch ermöglichen wollen. In der Sicht ist so die die Büro Frage, was Einsparmöglichkeiten bei Hybridmodellen angeht, eher nicht so hoch. Vielleicht kann ich noch ein Beispiel nennen, wie man es vielleicht eher nicht macht. Das haben vielleicht auch einige im Kopf. Ich glaube, dieses Jahr hatte ging durch die Medien, dass die deutsche Bank Homeoffice zurückfahren will. Und da war die Ansage an die Beschäftigten ja, man soll, man dürfe nicht mehr am Freitag und dem darauffolgenden Montag im Homeoffice arbeiten. Und die Begründung war, dass man die Präsenz im Büro über die über die Woche etwas glätten würde, weil es sich sonst ja nicht lohnen würde, leere Büros zu unterhalten. Aber das ist ja in dem Sinne eigentlich der komplett falsche Ansatz, weil das ja dazu man will ja nicht Präsenz glätten, sondern man will ja bei diesen hybriden Modellen, die wenig Präsenzzeiten, die man hat, ja dafür sorgen, dass die Leute eben genau dieses, diesen Wissensaustausch und sowas bekommen. Also das ist aus meiner Sicht auch wieder so ein Negativbeispiel, wenn man jetzt fies sein will.",
      "start": 3125130,
      "end": 3534084,
      "confidence": 0.9065206,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Vor allem es klingt ja eher danach, dass sie eigentlich verhindern wollten, dass sich die Leute ein langes Wochenende machen, oder?",
      "start": 3534212,
      "end": 3538960,
      "confidence": 0.9789386,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wahrscheinlich war das auch irgendwie hat es auch eine Rolle gespielt. Die offizielle Begründung war ja aber aus meiner Sicht ja auch nicht viel besser, dieses Glätten der Präsenzzeiten, weil die Offices sonst an Freitag und Montag leer stehen. Ja, also wie koordinieren? Also ich meine, wir koordinieren ja auch oder früher ja auch koordiniert, dass wir Montag bis Freitag neun to fünf arbeiten, weil die Leute in diesen eben diese gemeinsame Arbeitszeit haben. Und das bedeutet ja auch, dass die Büros am Wochenende leer stehen und in der Nacht leer stehen. Also das ist jetzt kein neues Phänomen, dass wir Leerstand haben, so gesehen in der Arbeitswoche. Und jetzt durch hybride Modelle müssen wir einfach noch stärker koordinieren, vielleicht für so über die begrenzten Zeiten, die wir noch haben.",
      "start": 3540100,
      "end": 3580946,
      "confidence": 0.9149898,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe es ja in der Einleitung auch schon erwähnt, dass der return to Office Trend zumindest in den Medien sehr stark vertreten ist. Die deutsche Bank hat auch Probleme scheinbar damit. Wie siehst du das jetzt datentechnisch? Wie viele Firmen gehen wirklich zurück? Gehen jetzt alle zurück? Wie sieht denn das jetzt aus? Haben wir alle zu erwarten, dass es, dass wir dann irgendwann im Office wieder enden?",
      "start": 3581058,
      "end": 3604578,
      "confidence": 0.9224271,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich hatte ja zu Beginn unsere Zahlen genannt. Zum einen die Homeoffice Quote, die super stabil ist bei ungefähr 25 % und zum anderen die Stellenanzeigen, die aktuell auf Rekordhoch sind, was Home Office Möglichkeiten angeht. Also was diese Zahlen angeht, sieht es nicht so aus, als würde sich die Uhr jetzt zurückdrehen auf 2019. Und tatsächlich ist so mein Eindruck, dass viel Berichterstattung über diese return to office zweitausendein Ansagen sich auf Einzelfälle konzentriert, die wir vor allem mitkriegen, weil sich gleichzeitig eben viele Mitarbeiter und Beschäftigte über diese Ansagen beschweren. Und das treibt ein bisschen die Berichterstattung natürlich, wenn man dann über Konflikte berichten kann bei SAP, bei VW, bei bei der deutschen Bank. Und ich habe auch gelesen, dass bei der deutschen Bank jetzt die auch schon wieder ein bisschen zurückgerudert sind, weil sich intern so viel Protest geregt hat. Und dieser Protest regt sich natürlich auch deswegen, weil die Beschäftigten den Eindruck haben, dass sie ein bisschen zum Sündenbock gemacht werden und ihnen so durch die Blume mitgeteilt wird, ihr arbeitet gar nicht vernünftig zu Hause. Und dann, wenn dann solche nicht nachvollziehbaren Präsenzregeln kommen, dann führt das zu noch mehr Wut, weil man dann auch nicht nachvollziehen kann, wie man denn jetzt besser vor Ort arbeiten sollte. Also ich glaube, dass es tatsächlich vor allem einige Beispiele sind, die das treiben. Wir haben auch tatsächlich am IFO in der letzten Umfragewelle die Unternehmen gefragt, wie sie zu Homeoffice Plänen stehen, zu ihren Homeoffice Plänen. Und da kam raus, dass unter den Unternehmen, wo Homeoffice machbar ist, dass nur 4 % tatsächlich Homeoffice abschaffen wollen, also eine absolute Minderheit. Und 80 % der befragten Unternehmen wollten ihre Regelungen beibehalten, wie sie sie vorher hatten. Und ungefähr gleich viele wollten sogar noch weiter flexibilisieren oder strenger machen. Und strenger machen interpretiere ich in der tatsächlich, wie gesagt, wir haben darüber gesprochen, kann ja tatsächlich auch bedeuten, dass man einfach mehr Struktur in die Homeoffice Modelle reinbringt dass man Flexibilität zurückfährt. Und das ist ja wie vorhin beschrieben, ja durchaus sinnvoll, wenn man dafür sorgt, dass die Leute eher dann an bestimmten Tagen zu gleichen Zeiten vor Ort sind. Also es gibt tatsächlich auch noch mehr Forschung, die sich mit diesem return to Office Phänomen zweitausendein beschäftigt und die haben sich, es gibt eine Studie aus aus Pittsburgh, wo die sich gelistete Unternehmen in den USA angeschaut haben und herausgefunden, dass die Unternehmen, die return to office Ansagen gemacht haben, vor allem solche waren, die in der letzten Zeit wirtschaftlich gestruggelt haben. Und sie haben auch herausgefunden, dass sich nach diesem return to Office die Performance, die Aktienperformance nicht verbessert hat, sondern nur die Zufriedenheit der Beschäftigten verschlechtert. Und eine Interpretation hier ist das tatsächlich vor allem in Fällen, wo vielleicht das Unternehmen sowieso schon struggelt, vielleicht sogar Stellenabbau im Raum steht, dass man durch die Rücknahme von Homeoffice es gewissermaßen den Leuten auch ein bisschen es einfacher macht, freiwillig zu gehen, man sich so teure Abfindungen spart. Ÿousand und es gibt auch tatsächlich viel zumindest anekdotische Evidenz, dass diese return to Office Regeln oder strengere Präsenzregeln auch nur sehr schwach oder nur sehr selektiv tatsächlich durchgesetzt werden. Also das Argument oder das Motiv Homeoffice als Sündenbock für schlechte Performance und vielleicht so eine Soft Layoff Strategie finde ich tatsächlich gar nicht so unplausibel. Und in der Breite sieht es wie gesagt nicht so aus, als würde Home Office jetzt groß zurückgefahren werden.",
      "start": 3604754,
      "end": 3825316,
      "confidence": 0.9142355,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was ist denn eigentlich mit den, du hast gesagt 50 % der Unternehmen haben überhaupt die Möglichkeit und davon 50 %, also insgesamt diese 25 % haben Homeoffice. Was ist denn mit den anderen 25? %? Gibt es da irgendwelche, bleiben die hart auf auf nur Office oder oder gibt es da irgendwie Anzeichen, dass dann auch vielleicht mehrere umsteigen auf hybrides Modell, weil die, weil es einfach schwierig ist, überhaupt noch Mitarbeiterinnen zu finden, könnte ich mir vorstellen zumindestens.",
      "start": 3825388,
      "end": 3854214,
      "confidence": 0.8801234,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also die 50 % beziehen sich auf Jobs, nicht auf Unternehmen, die Homeoffice machen können. Bei den Unternehmen, wenn ich es richtig im Kopf habe, sind fast 90 % aller Unternehmen, wo Homeoffice prinzipiell aufgrund der Tätigkeiten möglich wäre, es wird auch Homeoffice tatsächlich angeboten. Also es scheint tatsächlich so, als wäre da, wo Homeoffice möglich ist, wird es in der Regel auch gemacht oder angeboten. Und ich glaube, das hat tatsächlich auch damit zu tun, dass es für Unternehmen sehr teuer wäre, kein Homeoffice anzubieten, wenn es denn möglich wäre. Denn wir haben ja vorhin erwähnt, Homeoffice ist eine extrem wertvolle Annehmlichkeit, 7 % äquivalent zu einer siebenprozentigen Lohnsteigerung. Das heißt, wenn ich das einfach nicht anbiete oder wegnehme, dann muss ich entweder mit einem höheren Gehalt locken oder die Beschäftigten oder Bewerber suchen sich halt jemanden, einen anderen Arbeitgeber, der mir diese Möglichkeit gibt. Das heißt, vor allem in Zeiten von vor Fachkräftemangel und so weiter, ist es aus meiner Sicht für Unternehmen eigentlich ja kaum wirtschaftlich oder nicht wirklich im Sinne der Wettbewerbsfähigkeit, kein Homeoffice Modell zu fahren, wenn es möglich wäre. Und ich glaube, da wo es tatsächlich nicht gemacht wird, liegt es wahrscheinlich eher daran, dass eben die Managementkompetenzen nicht da sind oder wirklich irgendwie wirtschaftliche Schwierigkeiten und jetzt Stellenabbau, also da sich tatsächlich keine guten Gründe, warum man jetzt Homeoffice komplett abschaffen sollte oder zurückfahren.",
      "start": 3854382,
      "end": 3939920,
      "confidence": 0.9129566,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was ich hin und wieder noch höre bei so klassischen produzierenden Unternehmen oder Mittelstand oder solche Dinge, die halt dann sagen, ja, die armen Leute am Fließband können auch nicht Homeoffice machen, darum darf niemand Home Office machen, so in der Richtung. Wobei auch da kann ich mir nicht vorstellen, dass das irgendwie noch lange halten wird, weil du findest einfach niemanden mehr, der für dich arbeiten will, wahrscheinlich, wenn du zweitausendein ganz stur auf auf Office schaltest.",
      "start": 3940000,
      "end": 3963614,
      "confidence": 0.92553794,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, finde ich auch, ist eher ein vorgeschobener Grund, wobei ich das so ganz persönlich schon irgendwie nachvollziehen kann, wenn ich jetzt einen Job habe am Fließband oder so und ich kann kein Homeoffice machen und jetzt sehe ich, dass es viele anderen die Möglichkeit kriegen, kann ich das so ganz persönlich schon nachvollziehen, dass das zu Diskussionen in Unternehmen führt. Und ich kriege auch mit, dass dann oft auch, ja, sich überlegt wird, wie man denn die Leute, die keinen Zugang haben, auf andere Weise vielleicht Annehmlichkeiten bereitet. Aber da habe ich jetzt irgendwie keine empirischen Daten, irgendwie, wie das geregelt wird.",
      "start": 3963702,
      "end": 3999766,
      "confidence": 0.9393671,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Dann, wenn du darüber diskutierst, könntest du auch sagen, ja okay, dann sollten die Manager auch gleich viel verdienen, wie die, die am Fließband stehen, weil das ja, wäre dann auch unfair, warum bekommt jemand anderer mehr Gehalt? Ja, es gibt immer Unterschiede von den Positionen, ist natürlich dann, aber ist gut, wenn man darüber nachdenkt, wie man das irgendwie ausgleichen kann. Das finde ich absolut fair. Definitiv.",
      "start": 3999958,
      "end": 4018672,
      "confidence": 0.8880768,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich meine, ein Aspekt, den man vielleicht auch damit bedenken könnte, ist tatsächlich, wir sehen, wenn man sich Immobilienpreise anschaut, dass nach der Pandemie die Peripherie deutlich, relativ zugenommen hat zu den Innenstädten und sozusagen der Wohnraum in den Städten etwas billiger geworden ist. Die Frage ist, wie viel ist davon ist jetzt wirklich Homeoffice? Ich habe da arbeitete auch aktuell gerade an einem Projekt, wo wir versuchen, das zu quantifizieren und wir kommen da auf ungefähr 25 % dieses Rückgangs der Zentrum versus Peripheriegefälles. 25 % kann wahrscheinlich durch Homeoffice erklärt werden. Auf der anderen Seite bedeutet es, dass Leute, die kein Homeoffice machen, eine bessere Möglichkeit kriegen, eben nah oder besseren Zugang zu ihrem Job zu haben, sofern der Ÿousand in den Städten ist. Also das wäre vielleicht ein Aspekt, wo man so in the Broader Picture dafür spricht, dass er ein bisschen Ungleichheit entgegengewirkt wird, auch wenn man so über den Verkehr und sowas nachdenkt. Homeoffice führt dazu, dass einfach weniger gependelt wird, die dann noch ins Office kommen, ist einfach auch ein bisschen vielleicht freiere straßen. Also ich meine, solche Aspekte spielen sicherlich auch.",
      "start": 4018736,
      "end": 4091262,
      "confidence": 0.8726536,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber heißt es, dass dann wirklich die die Leute durch Homeoffice oder zumindest zu 25 % durch Homeoffice dann aus der Stadt weggezogen sind, dass die wirklich entscheiden, wir ziehen jetzt aufs Land oder so, weil wir Homeoffice machen können?",
      "start": 4091286,
      "end": 4104378,
      "confidence": 0.88039875,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist eine gute Frage. Aus den USA gibt es definitiv Befunde, die das nahelegen, dass es einen urbanen Exodus gab von Leuten, die homeoffice fähige Jobs hatten, vor allem aus Städten wie New York und San Francisco, wo die natürlich auch immens teuer war, in den Städten zu wohnen. In Deutschland schauen wir uns das gerade an und da ist es ganz interessant, dass wir zwar auch diese Stadtflucht während Corona beobachten, also dass die Städte erstmals wirklich netto an Bevölkerung verloren haben, was auch diesen Rückgang der Immobilienpreise in den Städten erklärt, relativ zu gebieten, die weiter weg sind. Aber dieser Rückgang der also diese oder diese diese Stadtflucht scheint tatsächlich eher davon erklärt zu werden oder darauf zurückzuführen zu sein, dass weniger Zuzug gab als Wegzüge. Also die Leute sind einfach, die sonst in die Stadt gezogen werden, sind einfach ausgeblieben. Zweitausendein. Und es kann natürlich sein, dass das Leute waren, die dann die Möglichkeit hatten, Homeoffice zu machen und gar nicht erst in die Stadt gezogen sind bzw. Dass das Homeoffice in der Richtung wirkt. Aber dass Leute, weil sie plötzlich Homeoffice machen konnten, aus der Stadt weggezogen sind, sieht man in Deutschland so zeigen unsere ersten Befunde. Das sieht man tatsächlich nicht so. Und ich glaube, ein Grund, warum man diese Unterschiede zwischen den USA und Deutschland sieht, könnte sein, dass dass das Stadtbild und die Stadtstruktur bei uns ganz anders ist. Hier gibt es viel mehr dieser Mixed Areas, also Wohngebiete und gewerbliche Gebiete und Restaurants und so. Das ist alles sehr gemischt. Im Stadtzentrum in den USA gibt es diese Zoning Laws und da gibt es auf diesen dieses Central Business District, wo die ganzen Bürogebäude sind und die Leute wohnen einfach nicht in der Stadt, sondern pendeln einfach nur rein. Und da wir wissen, dass Homeoffice vor allem ein Phänomen der besserverdienenden Beschäftigten ist, sind es auch die, die sich das auch gerne leisten, in der Stadt zu wohnen, um eben diesen Zugang zu den Stadt Annehmlichkeiten zu haben. Restaurants, Kunst, Kultur und so weiter. Also das kann erklären, warum die Leute jetzt nicht systematisch aus der Stadt sind, nachdem sie die Möglichkeit bekommen haben, Homeoffice zu machen. Aber das ist alles noch irgendwie Work in Progress. Da wird es sicherlich jetzt noch mehr Erkenntnisse geben, zumal wir jetzt quasi erst im zweiten Jahr nach der Pandemie sind und viele Leute wahrscheinlich auch solche Entscheidungen wie wegziehen, zuziehen auf eine Zeit geschoben haben, wo es irgendwie mehr Sicherheit gab als als während der Pandemie.",
      "start": 4104434,
      "end": 4243298,
      "confidence": 0.9193579,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das ist natürlich super interessant, wenn man die ganze Sache langfristig mal durchdenkt. Mal angenommen, du findest nun heraus, dass mehr Leute wieder zurück aufs Land ziehen oder wie du auch schon sagtest, vielleicht einfach dort bleiben und nicht in die Stadt ziehen, dass dies natürlich ein großes strukturelles Problem lösen könnte bezüglich Ärzten auf Ländern und und Industrie und allem drum und dran. Also ich meine, dieses strukturelle Problem haben wir ja in Deutschland, dass es sogar staatliche Hilfen gibt, das für Ärzte, die dann aufs Land ziehen und da auch ihre Praxis aufmachen wollen und so weiter. Ist natürlich interessant. Wann kann man circa mit den ersten Zahlen oder veröffentlichten rechnen?",
      "start": 4243354,
      "end": 4281250,
      "confidence": 0.9155259,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also Ende dieses Jahres kommt eine neue Studie von uns raus, die sich anschaut, wie sich Konsum innerhalb von Städten verändert hat aufgrund von Homeoffice. Wir haben da eine Kollaboration mit Mastercard und Telekom und kann relativ gut nachvollziehen, wo die Leute aufgrund von Homeoffice weniger auspendeln aus ihren Wohnorten und dementsprechend auch mehr in ihren Wohnorten konsumieren, also in stationären Geschäften ausgeben. Das ist eine Studie, die wir jetzt geupdatet haben. Und so als Spoiler, man sieht tatsächlich, dass die Gebiete, die so vor Corona so Consumption Hubs waren, also wo viel konzentriert Geld ausgegeben wurde, dass die Zweitausendein besonders stark verloren haben und das auch dauerhaft und das tatsächlich sich vielleicht nicht überraschend, einfach Konsum in die Wohngebiete aus den zentralen Orten verschoben hat und dass das Stadtbild auch langfristig tatsächlich verändert und auch vor Herausforderungen stellt.",
      "start": 4281710,
      "end": 4334774,
      "confidence": 0.9159369,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wenn du jetzt zwei, drei Wissenschaftler hättest, über die du verfügen dürftest und denen ein Thema sagen könntest, was dich jetzt sehr interessiert, macht mal eine Forschung in dem Bereich, weil ich selber habe keine Zeit, ich forsche an den den ganzen anderen Themen. Was was für Frage wäre das? Oder hast du irgend so was, was du super interessant findest, wo du hoffst, dass es irgendwer beantwortet in Zukunft?",
      "start": 4334942,
      "end": 4355888,
      "confidence": 0.8551434,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dadurch, dass das wirklich jetzt so ein verbreitetes Phänomen ist und auch ein dauerhaftes Phänomen, haben sich unglaublich viele interessante Forschungsfragen ergeben. Und so eine Frage, die mich sehr interessiert und die ich mich vielleicht auch selbst zuwenden werde, ist so wie verändert Homeoffice so Genderungleichheiten, was zweitausendein sowohl den die Arbeit angeht, also Lohnungleichheit z.b. ungleichheiten in Erwerbstätigkeit, aber auch so Sorgearbeitsthemen. Also da gibt es so diese zwei Perspektiven. Die einen sagen oder haben die Befürchtung, dass Homeoffice einen super antiemanzipatorischen Effekt hat, weil es ist so ungefähr Frauen sollen wieder ins Homeoffice und da sich aber auch können sie sich aber auch gleich um den Haushalt kümmern und um Kinder kümmern und dass Männer Homeoffice eher nutzen, um eben sich auf die Arbeit zu fokussieren und die Produktivität zu steigern. Und die andere Sicht ist okay, diese gewonnene Flexibilität könnte vor allem aber auch Vätern nutzen, eben mehr an diesen häuslichen und familiären Tätigkeiten eben teilzunehmen und da Genderungleichheiten zu schließen. Da gibt es noch sehr, sehr wenige Daten und die Daten, die es gibt, sind aus der Pandemie, wo natürlich alles drunter und drüber ging. Aber ich glaube, das ist so ein großes, so ein großes Thema, was mich sehr interessiert und was so gesellschaftlich, glaube ich, auch sehr relevant ist.",
      "start": 4355944,
      "end": 4434352,
      "confidence": 0.91054696,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Finde ich super spannendes Thema. Ja, also auch in meinem Umfeld erlebe ich da viele unterschiedliche Meinungen und Herangehensweisen. Wäre super interessant zu hören, was da rauskommt.",
      "start": 4434416,
      "end": 4444288,
      "confidence": 0.8756548,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wer also da die Ergebnisse mitbekommen möchte, der folgt einfach Viktor auf LinkedIn oder besucht mal hier und da seine Webseite. Alle Links haben wir natürlich auch in den Chat zweitausendein Show Notes für euch zusammengetragen. Viktor, vielen lieben Dank, dass du dir die Zeit genommen hast, hier bei uns im Podcast über deine Forschung zu sprechen, weil was ich besonders schön fand, ist jeder, der natürlich auch gezwungenermaßen während der Pandemie im Homeoffice gearbeitet hat, hat es entweder gemocht oder nicht. Auf jeden Fall. Jeder hat sehr viel Subjektivität zu dem Thema. Und auch wenn Leute irgendwie wieder zurück ins Büro müssen, dann kommen teilweise auch mal so böse Sätze. Ja, die Investoren dieser Firma sind auch Immobilieninvestoren, deswegen wollen sie, dass wir alle ins Büro Büro gehen. Und was ich hier schön fand, ist ein ganz klarer Faktenbeweis, Daten auf Basis von Umfragen, auf Forschungen und auch, dass du mal, wie soll man sagen, gegen den subjektiven Trend gearbeitet hast in Bezug auf sehen wir denn einen return to Office Trend? Nein, tun wir nicht. Nur 4 % der Firmen, die Homeoffice nach der Pandemie weitergemacht haben, machen einen return to Office und die sind, die lauten 4 % in den Medien. Das finde ich schön, Ÿousand, dass es dann in diesem Fall Einzelfälle sind. Also 4 % Einzelfälle natürlich. Aber deswegen vielen lieben Dank, dass du da mal so ein paar Fakten, ein bisschen Objektivität reingebracht hast. Ich als Home officer officer nennt man das so? Homeoffice LE? Ich weiß es nicht. Kann sehr viel mitfühlen von dem, was du gesagt hast, besonders wo Homeoffice Schwächen hat. Und ja, ich bin auch im Quartal mehrmals im Büro. Wir haben auch Teamtage, wo sich das Team dann remote technisch irgendwo an einer Location trifft, genau um diese Elemente, die du erwähnt hast, auch zu stärken, soziale Kontakte und Co. Ich gebe aber auch zu, weil ich komme gerade wieder von einem Business Trip im Büro habe ich für ein Dokument während meines Business Trips circa 7 Stunden gebraucht, um das zu schreiben. Einfach nur aus dem Grund, weil Leute neben mir am Schreibtisch gequatscht haben und so weiter, weil die Lautstärke deutlich höher war im Vergleich, weil ich solche Dokumente schon öfters geschrieben habe. Im Homeoffice mache ich die circa in 2 Stunden weg. Und das ist natürlich dann schon in Bezug auf Arbeitszeit was anderes. Aber meine Arbeitsanweisung oder das, was ich erreichen wollte, war auch sehr klar, sehr strukturiert und ich brauchte wenig Austausch. Von daher vielen lieben Dank noch mal an dich.",
      "start": 4444424,
      "end": 4591320,
      "confidence": 0.91658664,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich danke euch. Es hat Spaß gemacht.",
      "start": 4591400,
      "end": 4592808,
      "confidence": 0.91863143,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Vielen, vielen Dank. War super interessant. Zweitausendein, extrem viele Zahlen und Fakten. Das freut mich natürlich immer, wenn man da was untermauern können und vor allem so ein Mythos widerlegen können, der in den Medien auch herumschwirrt.",
      "start": 4592864,
      "end": 4604910,
      "confidence": 0.855497,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wir verabschieden uns somit aus diesem Podcast. Wenn euch diese Episode gefallen hat, nehmt doch mal den Spotify oder Apple Podcast oder SS Feed Link, schickt den bei euch in der Firma rum, im Slack rum, empfehlt diese Episode einem Freund von euch, der vielleicht jetzt gerade zurück ins Büro muss, zweitausendein, damit man auch ein bisschen Munition hat gegenübers Management. Vielleicht hilft das ja. Ansonsten würden wir uns natürlich wie immer über eine positive Bewertung auf Spotify oder Apple Podcast freuen. Und falls ihr mehr über dieses Thema diskutieren wollt, Schaut doch mal in den Show Notes, da findet ihr den Link zu unserer Discord Community und da könnt ihr euch ein paar Meinungen von ebenfalls Leuten, die entweder im Home Office oder im Büro arbeiten, abholen. Wir sagen danke und bis bald.",
      "start": 4604950,
      "end": 4649318,
      "confidence": 0.8884848,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Tschüss.",
      "start": 4649374,
      "end": 4649510,
      "confidence": 0.80999,
      "speaker": "C",
      "channel": null
    }
  ],
  "confidence": 0.9085525,
  "audio_duration": 4597,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}