{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/EpGNtLFrXn9qcPA/download/ep_opensource_management.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "a631818e-40a0-4776-b42a-3365e4d1e7a9",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk. Die Open Source Bewegung ist aus der Softwareentwicklung nicht mehr wegzudenken. Ein Teil davon zu sein, fühlt sich gut an. Wir geben etwas zurück. Einige von uns träumen davon, dass das eigene Open Source Projekt mal so richtig groß wird. Doch wie verändert sich eigentlich die Art und Weise, wie wir ein Open Source Projekt managen, wenn dies eine große Nutzerbasis, zweitausendeinundzwanzig, viele Kontributoren und noch mehr Reichweite bekommt? Steht dann noch eigentlich das Ergebnis, der Quellcode im Vordergrund? Oder spielen Themen wie Community Management, der Einfluss auf Menschen, Finanzierung oder Governance Strukturen eine größere Rolle? In dieser Episode sprechen wir mit Benni Mack. Benny ist Project Lead bei Typo, einem Open Source Content Management System. Er gibt uns Einblicke, welche Aktivitäten eigentlich notwendig sind, um ein solch großes Open Source Projekt am Leben und am Laufen zu halten. Welchen Einfluss es auf die Menschen haben kann, wie junge Kontributor innen motiviert werden können, welche Governance und Finanzierungsstrukturen existieren. Und wir sprechen über die negativen Seiten und Herausforderungen bei großen Open Source Projekten. Mein persönliches Highlight dieser das herausstechen, dass Open Source weit weniger Quellcode ist, als wir denken und vielmehr die Menschen darum dieses eigentliche Benzin für den Motor sind. Zweitausendein, los geht's. Viel Spaß. Open Source ist aus der Softwareentwicklung eigentlich nicht mehr wegzudenken. Und viele von uns machen auch in irgendeiner Art und Weise Open Source. Und mit machen in diesem Kontext meine ich primär zu Open Source beitragen oder vielleicht selbst ein Open Source Projekt maintainen und managen. Oft beginnt man damit aus dem eigenen Problem heraus und dann irgendwann kommt das erste Motivationshoch, wenn z.B. jemand einen externen Pull Request macht und wir merken, wow, unser Tool wird ja schon irgendwie genutzt und vielleicht investiert man noch mehr Zeit und noch mehr Zeit und noch mehr Zeit da rein. Und irgendwann fragt man sich halt doch schon, was mache ich denn eigentlich mit dieser Zeit? Oder kann ich meine Zeit nicht besser investieren? Denn desto größer ein Open Source Projekt wird, desto komplexer wird die ganze Thematik auch. Also wie verändert sich die Arbeit an Open Source, wenn das Projekt wirklich groß bzw. Sehr groß wird? Welche Hochs, aber auch welche Tiefs gibt es denn da? Und um das herauszufinden, haben wir uns jemanden ein eingeladen, der ein großes, ein sehr großes Open Source Projekt managt, und zwar Benny Mack. Hallo Benny. Für die Leute, die dich nicht kennen, stelle ich dich ganz kurz vor. Und zwar heißt du eigentlich Benjamin, aber alle nennen dich Benni. Du kommst aus Stuttgart, aus dem Schwabenland. Du bist Mitgründer und CTO der B GmbH, was eine Digitalagentur mit Fokus auf das Content Management System Typo ist. Typo, das ist das Open Source Projekt, über das wir heute auch sprechen. Zweitausendein machst du seit 2003 und bist aktuell Typo Project Lead. Und in diesem Dunstkreis hört man über dich, dass dein Tag wohl 48 Stunden haben soll.",
      "start": 3920,
      "end": 178222,
      "confidence": 0.9279349,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Andi, was hast du 2003 gemacht? Hast du da schon Open Source contributed oder warst du da noch in den Windeln oder so irgendwas?",
      "start": 178286,
      "end": 185790,
      "confidence": 0.86151624,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich muss jetzt mal ganz kurz auf LinkedIn gucken, was ich überhaupt 2003 gemacht habe. Da weiß ich gar nicht, ich weiß nicht, wann ich meine Ausbildung fertig gemacht habe und so weiter. 2003, ja, zweitausendein, nein, war ich noch in der Schule. Da werde ich mit hoher Wahrscheinlichkeit an irgendeinem World of Warcraft Clan, Gilden, Counter Strike, PHP System rumgeschraubt haben. Ist das Open Source? Ich habe mir eine Open Source Programmiersprache dann sehr wahrscheinlich.",
      "start": 185870,
      "end": 211028,
      "confidence": 0.8632083,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Gut, dass wir endlich mal jemanden im Podcast haben, der wirklich was bewegt hat, auch in der Vergangenheit. Nicht so wie du nur bei World of Warcraft da rumgegangen ist.",
      "start": 211164,
      "end": 218236,
      "confidence": 0.9123717,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, aber World of Warcraft kam ja erst 2005 raus. Ich weiß gar nicht, das muss dann age of Empires oder sowas gewesen oder.",
      "start": 218348,
      "end": 224916,
      "confidence": 0.90881956,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Counter Strike oder Ökosystem, irgendwie sowas. Also man kennt das ja, man ist in der Schule und so weiter. Aber Benni, warum hat dein Tag 48 Stunden? Warum erzählt das jeder?",
      "start": 224948,
      "end": 232840,
      "confidence": 0.8482061,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, weil ich irgendwie viele Dinge schnell hinbekomme. Ich weiß nicht warum. Also ich bin sicherlich nicht der weltbeste Programmierer, aber so das Switchen zwischen Themen und Projekten muss ich halt jeden Tag machen. Und ich glaube, das denken dann Leute, dass ich, obwohl ich natürlich viele Dinge mache, viel mehr Zeit benötige, aber das brauche ich nicht.",
      "start": 232920,
      "end": 250296,
      "confidence": 0.92237604,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber du bist damals schon als Programmierer eingestiegen, 2000, dreizehnte.",
      "start": 250408,
      "end": 253872,
      "confidence": 0.882797,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich bin auch, ich programmiere schon die Hälfte meiner Arbeitszeit, wenn ich arbeite tatsächlich irgendwas oder heutzutage auch viele Features von Typo kommen da von mir eigentlich. Und ja, ansonsten rede ich mit Menschen, das ist so ein bisschen mein Job, aber es macht Spaß. So verbinde ich alles und das Tag und Nacht. Und nachts mache ich halt Typo für die, die halt nachts nicht schlafen können.",
      "start": 254016,
      "end": 276270,
      "confidence": 0.92475206,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt für mich als Person, die in den er Jahren ein eigenes CMS damals programmiert hat. Also Typo ist ein CMS, für alle, die es nicht wissen. Mein CMS war ehrlich gesagt nicht so erfolgreich, muss ich dazu sagen. Aber das war noch vor der Open Source Welt eigentlich. Und ich habe ja dann irgendwie so eher Trupal verwendet und die anderen so im Business Umfeld. Die waren immer so auf Typo dritte. Ich war nie selber ein Typo User. Also kannst du mal zusammenfassen, was Typo eigentlich ist, was Typo ausmacht, wie groß es ist? Ich habe es übrigens gerade mal kurz jetzt probiert zu googeln. So 8 % Market Share habe ich gefunden aktuell. Ÿousand klarerweise irgendwie fünf und dreiig oder so, aber sonst liegen die meisten eigentlich eher unter den 8. %. Stimmt diese Zahl noch?",
      "start": 336850,
      "end": 382552,
      "confidence": 0.9205048,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Weißt du das zufällig?",
      "start": 382576,
      "end": 383664,
      "confidence": 0.8557675,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich weiß nicht, die Prozentzahl, das hängt immer davon ab, von was man es macht, von welcher Gesamtzahl man das abzieht. Aber letztendlich ist WordPress natürlich unangefochtener Marktanführer. Und das jetzt mal so, was Websites an sich betrifft, dann gibt es natürlich viele Applikationen, wo du irgendwelche Framework benutzt und dann aber der Großteil sind einfach informative Websites, klar, mit irgendwelchen Logins oder irgendwelchen Sachen. Ich glaube, an der Stelle musst du bei WordPress schon irgendwelche Plugins installieren. Und Typo hat solche Sachen out of the box dabei, so einen geschützten Bereich mit Downloads oder Mehrsprachigkeit, Multi Site Fähigkeit, also Mandantenfähigkeit kommt da schon mit, weil der Typ, der das ursprünglich gefunden hat, Casper Scahoy aus Dänemark, also bin nicht ich, der irgendwie da nachts dran saß, sondern tatsächlich der Typ, der hat das erfunden, hat dann damals gemeint, er verteilt das, war schon vor 2003, auf CDs und Disketten und verschickt die an irgendwelche Leute. Und irgendwie die Leute in Deutschland fanden das ganz gut, aber auch so in Europa. Und es war tatsächlich sehr, also hat eine ähnliche Geschichte wie Drupal. Ich würde auch schon sagen, das kann man, die zwei Systeme kann man gut vergleichen. Nur dass der Erfinder von Drupal, Dries, von Dänemark, dann in die USA nach Boston gezogen ist und Drupal eben jetzt ein Typ, wo in den USA bekannt ist und nicht in Deutschland.",
      "start": 383792,
      "end": 466120,
      "confidence": 0.87878203,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und für mich war das eigentlich immer eben so eher im Business Kontext, im professionellen Business Kontext war Typo vor allem im deutschsprachigen Raum zu Hause. Stimmt diese Einschätzung von meinem Ich vor 15 Jahren immer noch oder hat sie damals gestimmt?",
      "start": 466200,
      "end": 482408,
      "confidence": 0.9214424,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich würde sagen, genauso nutzen wir das auch. Wir benutzen das für größere Websites. Also jetzt bei der Firma, bei der ich tätig bin, Konzernen zu tun habe, die international irgendwelche Websites auch in China haben möchten. Und dann muss ich durch die Great Firewall irgendwelche Tricks, also keine Tricks, offizielle Regeln beachten. Und das ist so ein bisschen mein Tagesgeschäft, gucken, wie das Ganze natürlich dann skaliert. Und Thema Caching, ja, Performance sind so ein bisschen so meine Steckenpferde und die ganze Mehrsprachigkeit, Anbindung an irgendwelchen anderen Plattformen. Damals war halt CMS für alles da. Heutzutage muss es sich schon auch in die Systemlandschaft eingliedern. Heute hat man ja noch DRM und ein CRM und ja, was man halt so braucht. Sehr, sehr, sehr viele Buzzwords und damals gab es eben nur CMs. Und für viele war halt aber Typo auch zu kompliziert, weil man schon ein bisschen nerdig, muss ich sagen.",
      "start": 482464,
      "end": 543654,
      "confidence": 0.895241,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, das war eigentlich mein Vorurteil auch immer, das ist irgendwie zu groß, zu umfangreich und ich bleibe bei anderen. Wobei Trueball ja auch ein Monster ist, wenn wir uns ehrlich sind.",
      "start": 543782,
      "end": 552854,
      "confidence": 0.9126344,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zweitausendein. Also eine Sache, die da natürlich dagegen sticht, ist ja, ich weiß nicht, wie viel ihr jetzt so mit SAP zu tun habt, aber SAP ist jetzt so im klassischen Sinne immer Austauschformat ist CSV, also musst du mit CSVs arbeiten. Also natürlich gibt es auch andere Sachen, aber der Vorteil von SAP ist, wenn du es einmal am Start hast, dann kannst du es theoretisch für immer nutzen, nur dass es halt sehr viel Geld kostet. Und Typo hat so eine Art Backwards Compatibility Promise, die es dir schon ermöglicht, eine Instanz von 2008 immer wieder zu aktualisieren, ohne irgendwelche custom Daten zu migrieren oder irgendwas. Oder sagen, ist jetzt so alt, lass uns das neu aufsetzen. Kann man zwar machen, muss aber nicht. Und kannst du tatsächlich so aktualisieren, wenn du Bock drauf hast.",
      "start": 552902,
      "end": 595846,
      "confidence": 0.92446035,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich stelle mir gerade die Frage, ist Content Management in 2024 überhaupt noch relevant mit KI und allen no Code Tools und dem Zeitbilder? Obwohl der Zeitbilder ist wahrscheinlich auch nur ein Content Management System, oder?",
      "start": 595878,
      "end": 609214,
      "confidence": 0.91443974,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, tatsächlich, da verrate ich jetzt keine Details, aber tatsächlich, die machen auch ziemlich coole Arbeit bei IONOS, aber ich wollte jetzt hier keine direkte Werbung machen, weil die benutzen keinen Typo direkt, zumindest für ihren Homepage Baukasten. Aber die ganze Content Management Sache ist doch schon sehr relevant, weil wie vorher erwähnt, du hast viele, viele Websites, wo es darum geht, zeig mir mal meine Rechnungen und ich möchte irgendwas bestellen, dies und das. Aber du hast eigentlich sehr, sehr viele Websites, die einfach Inhalte präsentieren. Und der Klassiker ist natürlich irgend so ein Blog und heutzutage macht man alles auf YouTube, aber viele Informationen brauchst du im Web, damit KI tatsächlich dir auch die Zusammenfassung irgendwie auf Google geben kann. Und da denke ich, kommt man nicht drumherum, dass es Inhalte gibt, die von Menschen geschrieben sind oder zumindest geprofriedet sind. Zur Verfügung haben die Systeme. Gibt es auch Content Management Systeme, die tatsächlich hey, per Voice kann ich sagen, schreib mir einen Blogpost über Performance Monitoring bei PHP Anwendungen. Und dann kommt da so ein Blogpost und der liest sich vielleicht toll, aber es steht nichts drin. Und ich denke mir, da gibt es gar keinen Mehrwert, diesen zu lesen. Er kommt vom Computer und dann kommt Ai und liest diese Sachen und fasst es wieder zusammen. Das heißt, es ist eigentlich ein endloser Kreislauf von Machine to Machine und ich finde es ziemlich banane. Das heißt, solange man den Content vom Fokus her und Content ist natürlich nicht nur Text, sondern auch Bild und Video, den Content auf wichtige oder relevante Themen packt, braucht es immer ein Content Management System. Und es ist erstaunlich, welche Systeme es gibt, die keinen Fokus auf ein CMS, also auf den Content Management Part legen, wie schlecht diese doch noch sind. Das heißt, sagen wir, es gibt irgendein Shop System und die haben es also nach 15 Jahren noch nicht hinbekommen, eine gute CMS Komponente reinzusetzen, obwohl es natürlich genügend Open Source Varianten oder Alternativen gäbe, um mal was abzugucken. Aber heutzutage braucht es immer noch sehr viel Content Management.",
      "start": 609382,
      "end": 735190,
      "confidence": 0.9112001,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber gehen wir mal weg von dem eigentlichen Produkt. Also wir wollen ja eigentlich gar nicht so über Typo an sich sprechen, vom Produkt, sondern das ist ein mittlerweile sehr altes und auch sehr großes gewachsenes Open Source Projekt ist. Also du bist seit 2003 dabei, das heißt seit über 20 Jahren jetzt eigentlich. Wie blickst du denn auf dieses Open Source Projekt? Wie ist die Größe von dem Open Source Projekt? Wie viele Contributor gibt es da? Wer ist da überhaupt involviert? Steht da eine Firma dahinter? Bist du, wie läuft denn das ganze eigentlich ab, wenn es um neue Entwicklungen geht in dem Bereich Typo?",
      "start": 735350,
      "end": 771712,
      "confidence": 0.927438,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, also im Typo Bereich Zweitausendein selbst, also Typo ist jetzt, keine Ahnung, 26 Jahre alt, bin ein Großteil schon mit dabei und irgendwann hat der Gründer gemeint oder die Community, die dadurch entstanden ist, wäre total praktisch, dass man diesen Gründer irgendwie Geld bezahlen kann, damit er an der Software weiterarbeiten kann, ohne irgendwie zu überlegen müssen, wie wird mein meine Brötchen, wie werden meine Brötchen bezahlt, meine Miete etc. Also wurde ein Verein gegründet mit Ÿousand Sitz in der Schweiz jetzt vielleicht, vielleicht aus EU Gründen oder vielleicht aber auch daran, lag es daran, dass es viele Menschen gab, die Typo in der Schweiz genutzt haben und so ist die Typo Association entstanden und drumherum war einfach so war Casper der Gründer und Lead Entwickler und der hat auch irgendwie die Konferenzen, die dadurch entstanden sind, irgendwie mitgeprägt. Aber es gab viele Leute, die halt gesagt haben, ich bin jetzt nicht irgendwie ein Programmierer, aber ich kann ziemlich gut Events machen und haben dann ein Event gemacht, die anderen haben halt irgendwelche User Groups gestartet. Und dieser Verein hat dadurch auch zwei Events pro Jahr, die es seit 2006 sieben so ins Leben gerufen wurde, einfach jährlich durchgeführt. Einmal die T Con, also einfach eine Konferenz für Business People und die Developer Days, also einfach mit Nerds. Da kommen so 350 Leute und das ist einfach eine klassische Konferenz mit Austausch, mit Sessions, mit einer Coding Night, Contribution Night. Man kann überall mit partizipieren. Und mittlerweile gibt es eben auch viele Teams. Es gibt jetzt, also der Lead Developer Casper ist zurückgetreten, kam jemand anderes dazu und ich war in dem Team mit dabei und irgendwann habe ich dieses Team übernommen. Und das ist jetzt schon sehr lange her und jetzt mache ich das tatsächlich schon länger als Kasper.",
      "start": 771816,
      "end": 879224,
      "confidence": 0.8851869,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber du machst es innerhalb von diesem Verein und das ist alles innerhalb von diesem Verein angesiedelt und jeder macht es kostenlos. Ÿousand, seht ihr es richtig oder gibt es da auch bezahlte Developer? Also wird auch irgendwer wirklich bezahlt?",
      "start": 879352,
      "end": 892070,
      "confidence": 0.888754,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also dieser Verein lebt ja von Mitgliedern und durch die Mitglieder gibt es Budget für diese Teams. Und ich leite ein Team und habe dadurch ein Budget für Reisekosten, wenn ich auf eine Konferenz gehe oder verschiedene Unterkünfte brauche. Das ist schon mal das erste. Und dann gibt es aber auch, ich sage jetzt mal Schmerzensgeld, Dinge, die es zu tun gibt, auch wenn keiner Lust drauf hat. Und ein Thema davon ist Security. Irgendjemand sagt, ein Security Researcher, hey, wir haben hier ein Problem gefunden. Passiert ganz, ganz selten natürlich. ThinkerSmiley. Nein, also es kommt ab und zu vor. Und dann gibt es natürlich die policy, dass man sich 90 Tage Zeit lässt, diesen Bug zu fixen, ohne breaking Changes einzuführen. Nicht immer einfach, aber dafür wäre es ja schon gut. Man kann alles andere stehen und liegen lassen und macht das. Dafür hat das Security Team, gibt es extra auch die Möglichkeit zu sagen, wir bezahlen da auf einer Stundenbasis über diesen Verein die Leute, die diesen Bug fixen.",
      "start": 892190,
      "end": 954198,
      "confidence": 0.92580754,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber es ist jetzt niemand fulltime irgendwie angestellt oder so.",
      "start": 954254,
      "end": 957542,
      "confidence": 0.867563,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also da komme ich gleich dazu, weil dieser Verein eigentlich ja nur von diesen Mitgliedern lebt, die einfach sagen, wir gucken, dass dieses Projekt weiterlebt. Jedoch ist es so, dass die Kunden manchmal sagen, hey, es wäre schon cool, wir hätten irgendwie ein SLA, mit wem kann ich diesen SLA auch unterschreiben lassen? Und so hat sich das entwickelt, dass die Typo GmbH Ÿousand, eine hundertprozentige Tochter der Typo Association, die Typo GmbH ist im Sitz in Düsseldorf gestartet, wurde 2016, 1716, glaube ich. Und dort kümmern die sich um additional services. Also diese ganzen Sachen wurden relativ, also ihr seht, da sind jetzt ja 10 Jahre dazwischen, zwischen dem Verein und dieser Gründung der Firma. Das heißt, die Mitglieder haben natürlich da auch entschieden, dass diese Firma gestartet wird. Und in dem Moment wurden gewisse Regeln aufgestellt, die in diesem, also in den Buy Loss eben so drin sind. Diese Firma darf kein Agenturgeschäft machen, also kein Hosting, um den bestehenden Supportern Geld wegzunehmen. Das heißt, die konzentrieren sich nur auf Dinge. Und das ist natürlich eine Herausforderung, um dieses Produkt weiter und noch besser am Leben zu halten. Also SLAs, die machen, wir haben so eine LTS Support, das heißt drei Jahre lang ist das Produkt supported von mir oder Ÿousand von meinem Team und dann gibt es nochmal zusätzliche drei Jahre gegen Geld. Und dieses Geld kommt von der Typo GmbH. Die machen diese drei zusätzlichen Jahre Security Themen und haben dadurch auch Leute angestellt, die entweder in großen Features an Maintenance oder auch an Security Themen arbeiten können.",
      "start": 957606,
      "end": 1051806,
      "confidence": 0.9028286,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber dein Team ist nicht in der GmbH. Nur um das nochmal.",
      "start": 1051878,
      "end": 1055998,
      "confidence": 0.97243416,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Man hat gewisse Schnittmengen. Also ich bin eigentlich nur ein random Dude, sage ich immer. Also ich zweitausendein, ich arbeite einfach, habe mein Tagesgeschäft, meine Arbeit, meine Arbeit und bin in der Community. Das heißt, ich habe jetzt auch in dieser Typo Association keine offizielle, spezielle Rolle. Ich bin nicht in irgendeinem Aufsichtsrat oder irgend solche Sachen, da bin ich nicht der Richtige dafür.",
      "start": 1056134,
      "end": 1075788,
      "confidence": 0.86822736,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Weil du jetzt erwähnt hast, also gerade bei Security Bugs oder solchen Dingen, werden dann Leute wirklich bezahlt. Gibt es da ein ganz hartes Regelwerk? Weil ich könnte mir vorstellen, dass bei gerade so einer riesen Community kommt da ja sofort die Neiddebatte, wohin geht unser Geld von den Mitgliedern und wer wird da bezahlt? Gibt es da ein ganz hartes Regelwerk, was bezahlt wird, wenn jemand, keine Ahnung, wenn das sehr wichtig ist und innerhalb von 90 Tagen gefixt werden muss? Oder gibt es da irgendein Gremium, was das entscheidet? Also wie habt ihr aufgeteilt oder wer bestimmt, wohin das Geld geht?",
      "start": 1075884,
      "end": 1108845,
      "confidence": 0.9112736,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also jedes Team macht einen Budgetantrag einmal im Jahr bei dem Verein und sagt, ich brauche x tausend Euro für Travel Costs oder auch für Arbeitsaufwände. Und es gibt dann innerhalb des Vereins ein Business Control Committee und die kümmern sich darum zu sagen, okay, wir geben das frei. Es gibt natürlich auch einen Association Vorstand und eben dieses BCC Gremium. Und das BCC kümmert sich einmal darum, dass die Gelder genehmigt werden und dann auch, wenn jemand eine Rechnung stellt, ob das auch korrekt ist. Das machen die auch ehrenamtlich und bzw. Gibt es so einen kleinen Obolus für die Leute, die sich da zur Verfügung stellen, zwei Jahre lang. Und dadurch ist ein ganz normaler Verein mit einem Kassierer und solche Themen, die sind da mit dabei. Und wenn jetzt dieses Security Team dieses Budget hat, dann gibt es dafür den Security Team Lead, dann gibt es einen Budget Owner und der Budget Owner in dem Falle bin ich, der dann sagt, okay, ich stimme mich mit dieser Person ab und sage, okay, das müssen wir jetzt lösen und dafür benutzen wir dieses Geld, was wir Anfang des Jahres beauftragt hatten. Ist jetzt allerdings schon auch sehr, sehr förmlich. Das heißt, alles was jetzt irgendwie Stundensatz angeht, da können wir nicht verhandeln. Das steht in diesen Statuten dieser Association. Da werden wir dann, da brauchst du natürlich irgendwie eine Jahresversammlung, um irgendwas da zu ändern. Wir machen da nichts.",
      "start": 1108917,
      "end": 1186610,
      "confidence": 0.8860446,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wir sind jetzt schon recht schnell in diese Governance Geschichte reingesprungen. Aber, und das hört sich jetzt total kompliziert an, weil wir ja eigentlich über Open source sprechen und so weiter und so fort, nur mal um das klarzustellen, Typo ist ja ein vollkommen Open Source Projekt unter der Ÿousand Gnu GPL Lizenz, wo man nicht Teil eines vereins sein muss. Man muss nicht mit irgendeiner GmbH reden, um das zu benutzen oder um da einen Pull Request zu machen und so weiter. Das ist ähnlich wie Kubernetes oder PHP, die Sprache oder ähnliches. Das ist eigentlich in Anführungszeichen, kannst du auf GitHub gehen und dir den Source code reinziehen, ist das richtig?",
      "start": 1186730,
      "end": 1226152,
      "confidence": 0.91109425,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau.",
      "start": 1226216,
      "end": 1226920,
      "confidence": 0.97296,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und die Typo Association, ist sie vergleichbar mit Ÿousand, der Linux Foundation, der apache Foundation, der Eclipse Foundation oder der CNCF? Und dass das so ein Vehikel ist, was sich dann auch so ein bisschen um, ich sag mal, Marketing Verteilung, ja, Enterprise, wie soll man sagen, Needs kümmert, so nach dem Motto, dass ich viel, man Ansprechpartner hat und sowas halt. Oder wie darf man sich das so ein bisschen vorstellen?",
      "start": 1227080,
      "end": 1250302,
      "confidence": 0.87146723,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Weil genau dafür wäre eigentlich die Typo GmbH da. Das heißt, die kümmern sich um Marketing, es gibt ein Partner Netzwerk, solche Themen. Und die Association ist tatsächlich eigentlich, das hatte ich vorher nicht erwähnt, für die Marke verantwortlich. Das heißt, wenn irgendjemand kommt und meint, er nimmt sich jetzt Typo, keine Ahnung, Geo, also irgendeine Domain, wo der Trademark drin ist, dann kommt der Anwalt aus der Schweiz mit, was auch immer. Also ich habe das noch nie ausprobiert, aber man darf die dann abtreten. Und diese ganze Trademark Violations, da gibt es locker über 100 Stück pro Jahr, das machen die auch, das möchte ich jetzt auch nicht immer machen.",
      "start": 1250326,
      "end": 1285906,
      "confidence": 0.90305537,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "In diesem Podcast gibt es hier einen Running Gag, und zwar heißt er Legacy verdient das Geld. Und jetzt sagtest du, das Typo Projekt ist als Open Source Projekt schon recht alt. 26 Jahre hast du, glaube ich, gesagt. Ich nenne das immer historisch gewachsen und deswegen hast du sehr wahrscheinlich einige Codestellen, die, so linde gesagt, nicht so schön sind. So, und jetzt sagst du, okay, für.",
      "start": 1286018,
      "end": 1305618,
      "confidence": 0.9230581,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Manche Teams, es war 26 Jahre Zeit, um alles zu optimieren und perfektionieren, das muss ja perfekt sein mittlerweile, Ÿousand.",
      "start": 1305634,
      "end": 1312372,
      "confidence": 0.910058,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, richtig. Und jetzt hört man, Okay, man hat finanzielle Mittel, um solche Themen dann vielleicht auch wieder zukunftsträchtig zu machen, auch vielleicht im Security Bereich. Das untermalt den Spruch, Legacy verdient das Geld ja noch mehr. Aber wenn man so eine große Community hat, so eine große Governance drumherum, du hast eine GmbH, einen schweizer Verein, du hast gerade schon von irgendwelchen Anwälten gesprochen, die sich um Trademarks, Problematiken kümmern. Ich als Contributer bekomme damit hoffentlich nie in Berührung. Meine Frage ist eigentlich nur, ich stelle mir schon vor, dass es eine riesen Herausforderung ist, ein solches Projekt, ich sag mal, in eine Richtung zu steuern. Denn in irgendeiner Art und Weise müsst ihr ja eine Vision haben, eine Roadmap, wohin es geht, oder? Also gebt ihr irgendwie sowas vor? Versucht ihr die Community irgendwie in eine Richtung einzuschwören oder sagt ihr einfach nur Open Source GPL Lizenz, wenn ihr Bock habt, kontrolliert einfach mal, wir schauen uns das dann mal an und mergen das durch.",
      "start": 1312426,
      "end": 1373262,
      "confidence": 0.90214455,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und vielleicht auch hat sich das verändert gegenüber 2000 Dritte. Also es klingt ja, dass das jetzt wahnsinnig professionalisiert wurde und vielleicht ist es auch der Grund, warum es überhaupt ein Open Source Projekt so lange gibt. Aber wenn du das jetzt vergleichst, 2003 war das ähnlich aufgestellt, wenn es um Roadmap, Vision und solche Sachen geht, oder hat sich da auch viel verändert? Und wie macht ihr das?",
      "start": 1373326,
      "end": 1393470,
      "confidence": 0.94218886,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also behalte mal die Frage noch mal kurz, weil es gibt natürlich auch technische Sachen, die sich verändern. Nämlich, ich finde es total cool zu überlegen, dass das Projekt damals mit CVs irgendwie maintained wurde und dann mit Subversion und es gab eine Mailing Liste. Ich weiß nicht, wie viele Leute noch Mailinglisten kennen, aber das ist cool hier, wahrscheinlich, Andi, hast du auch mal da zufällig mal einen Patch eingeschickt. Nämlich es lief so ab, dass es diese heilige Gruppe an Core Team Leuten gab. Also damals war das so, wirklich gehypt ist es so, dass die, die haben dann Patches in die Mailing Liste geschickt, jemand musste die händisch applyen und dann irgendwie gucken, dass es in Subversion da reinkommt. Irgendwann gab es 2012 den Switch zu Git. Und da siehst du ja allein schon da, dass sich super viel geändert hat. Ich kenne auch sehr große Systeme, Content Management Systeme, die das immer noch mit anderen alten Technologien machen, aber z.b. solche Sachen haben uns total nach vorne gebracht und das finde ich richtig cool zu sehen. Und gleichzeitig benutzen wir PHP und da versuchen wir auch nicht immer alles von Neuem zu entwickeln, sondern versuchen da Industriestandards zu verwenden und da irgendwie austauschbar zu werden. Das heißt, eigentlich war 2003, war das so ein bisschen Patchwork. Das heißt, es gab so einen Typ, der hat irgendwie zwei Monate sich eingeschlossen, irgendwas gebaut und hat das dann hinzufügen möchten. Dann gab es diverse Iterationen, dann war die Ecke sah halt, oder dieses Zimmer sah grün aus und das nächste Zimmer, wenn man bei einer Hausanathologie bleibt, war das halt gelb mit einem komplett anderen Farbton. Das heißt, das war Wildwuchs. Und wir haben jetzt die letzten Jahre verwendet, das immer wieder auf eine einheitlichere Basis zu bringen, um die Maintenance zu reduzieren. Das ist unser Hauptfokus unter den Entwicklern.",
      "start": 1393550,
      "end": 1497620,
      "confidence": 0.9032671,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wem macht er das mit Arbeit? Nein, aber steht es jetzt irgendwo was, was die Roadmap ist, was neue Features sind, was ihr geplant habt und wer entscheidet das?",
      "start": 1497700,
      "end": 1509464,
      "confidence": 0.83566433,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die Roadmap, die interessiert natürlich jetzt solche, also die Nerds jetzt nicht so im Detail, also die Contributor auch nur begrenzt, weil ich packe, das ist eine große lesson learned für mich, ich habe schon einige graue Haare, wenn ich sie hätte, irgendwie da auch bekommen durch diese ganzen Release Zyklen, weil es gibt ein Spannungsfeld, du machst eine Roadmap und sagst, hey, für die nächste Version, die kommt irgendwie im Frühjahr, packen wir Feature eins, zwei, drei drauf. Dann machst du das und merkst, der Typ, der gesagt hat, er baut das Feature, sei es Datenbank Abstraktion neu machen, weil wir dann irgendwie flexibler sind, der meldet sich nicht mehr. Also das heißt, wie kontaktiert man diese Contributors, die einem irgendwas versprechen und ich packe es auf die Roadmap, ich bin da in einer richtig blöden Zwickmühle, dann kommt irgendwie raus, naja, also und ich habe wirklich in meinem Team da schon alles gesehen. Das heißt, der eine hat wirklich irgendwie, trennt sich von seiner fünften Frau und hat das sechste Kind gleichzeitig, dann der andere baut ein Haus, der andere hat natürlich irgendwie verheiratet, also der andere macht eine Weltreise und du stehst da und na toll, das habe ich jetzt versprochen, was mache ich denn da? Das heißt, ich persönlich, meine Taktik die letzten fünf Jahre ist eigentlich nur, ich packe Sachen auf die Roadmap, dass wenn sie nicht klappt, nur die Sachen auf die Roadmap die, wenn sie nicht klappen, ich in der Not nachts auch noch machen kann. Das heißt, in irgendeiner Form versuche ich das hinzubiegen, weil ich habe schon ein paar mal da echt ins Klo gegriffen und musste mir dann halt sagen sorry, sorry, sorry. Und da kommt es Thema wenn du jetzt eine größere Open Source Community hast oder auch Leute, die darauf sich verlassen, dass das kommt. Ich habe hier ein neues Projekt, das startet im Frühjahr, kann ich das schon einsetzen? Ja klar, aber wenn es dann nicht passiert, dann dann hast du ja die die Menschen enttäuscht und deswegen bin ich jetzt eher so ein Fan. Naja, also und es kann naja, lieber, lieber weniger versprechen und mehr liefern. Das ist meine Taktik und und wie.",
      "start": 1509632,
      "end": 1622392,
      "confidence": 0.90146655,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Kommt die Roadmap zustande? Jetzt du für deinen Bereich definierst die Roadmap und das machen dann andere Leads auch oder wer hat überhaupt Zugriff auf die Roadmap? Kann ich auch was auf die Roadmap schreiben oder?",
      "start": 1622416,
      "end": 1633788,
      "confidence": 0.9300467,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also wir haben einen großen, großen Issue Tracker Forge, das ist Redmine und dort haben wir sicherlich über 2000 offene Issues. Und wenn du jetzt sagst, ich hätte gerne Feature XYZ, dann machst du da einfach ein Ticket auf und hoffst, dass die nächsten zwei Jahre jemand das Problem beantwortet. Dieses Ticket, also wir haben da auch einige Karteileichen drin liegen, aber letztendlich ist das der Weg, wie du das beeinflussen kannst.",
      "start": 1633884,
      "end": 1657572,
      "confidence": 0.90867054,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Zweitausendein.",
      "start": 1657596,
      "end": 1657806,
      "confidence": 0.80618,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und das mache ich halt irgendwie zwischen Tag und Nacht, dass ich auch diese Tickets durchlese und auch mit meinem Team bespreche, was ich mit diesen Tickets mache. Das heißt, die Roadmap bei diesem Projekt, wo Keine Ahnung, Leute und Projekte davon abhängen, die ist aktuell in meinem Kopf komplett.",
      "start": 1657868,
      "end": 1674330,
      "confidence": 0.9282742,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber das heißt, du bist alleinig verantwortlich für die Roadmap, wenn ich das richtig verstehe.",
      "start": 1674410,
      "end": 1678722,
      "confidence": 0.887464,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja.",
      "start": 1678786,
      "end": 1679154,
      "confidence": 0.58444,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, also es gibt jetzt keine anderen Teams außer dich.",
      "start": 1679242,
      "end": 1682402,
      "confidence": 0.91796,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Doch, doch, es gibt andere Teams. Also es gibt ein Marketing Team, die warten darauf zu sagen, dass sie von mir hören, was jetzt tatsächlich reinkommt, damit sie Marketing für diese Version machen können. Wir ziehen natürlich schon, wir haben gewisse Grundwerte, das sind Themen, finde ich ja auch immer ein bisschen spannender, wie die tech only Dinge. Was sind die Werte von einem Open Source Projekt? Bei uns ist es eben Stabilität. Also man kann sagen, es ist steinalt, aber es ist eigentlich auch cool, dass es so lange hält und dass es halt auch den Support hat. Nimmst du NPM und Node? Irgendwann kam die auch auf die Idee, dass es ganz cool wäre, die Leute kriegen eine Info, wie lange eine Version maintainable ist. Und diese Sachen kannst du halt nur machen, wenn du auch wirklich zu diesem Zeitpunkt released. Also eine kleine Geschichte. Damals war ich noch klein, also nicht klein, aber halt 2006 sieben müsste das gewesen sein. Also es ist jetzt nicht so, als kann ich tun und lassen, was ich möchte. Also ich spreche mich natürlich ab, aber letztendlich bin ich ja derjenige, der die News schreibt und oder in Verbindung mit jemand anderem. Aber letztendlich war es damals so, wir hatten eine Version zweitausendein Typo 4. Mär. Keine Ahnung, ewig, ewig halt 2006 sieben. Und irgendjemand hat versprochen, ja, wir bauen das und es kommt da so ein Feature rein. Und ich so, okay, cool. Und ich war Release Manager. Damals hatten wir Release Manager und Co Release Manager und irgendwie haben die gesagt, okay, wir brauchen doch noch mal zwei Wochen länger. Okay, wir schreiben den News, wir verschieben das um ein paar Wochen, lass uns gleich und dann wir brauchen doch noch mal ein bisschen mehr Zeit, wir verschieben es nochmal einen Monat. Und nach einem halben Jahr mussten quasi der Release Manager und ich uns vom damaligen Präsidenten der Association anhören, hey, so funktioniert das nicht. Und ich so okay, klar, ich war noch sehr jung und wusste dann halt nicht, wie man mit so einer Situation umgeht. Das habe ich dadurch gelernt, nämlich der hat gesagt, hey, macht einfach was fest und im Zweifel packt es nicht in die Version rein. Also sagt einfach dieses Datum und wenn dieses Datum in zwei Jahren ist, dann macht das, aber wirklich zu diesem Zeitpunkt veröffentlicht ihr die Version. Und seitdem habe ich quasi eine Maintenance Release. Also wir releasen immer am zweiten Dienstag im Monat. Ich habe zweitausendein die Release Informationen für die nächsten eineinhalb Jahre, wann eine Version kommt und hoffentlich welche Features reinkommen. Die sind set in stone, die kommen genau an dem Tag raus und dadurch muss ich nicht mehr irgendwie nachts schlecht schlafen oder wach sein, um zu überlegen, wie mache ich das? Also das heißt, ich habe hier mich entschieden, Release Dates und Planungssicherheit über Features.",
      "start": 1682466,
      "end": 1830262,
      "confidence": 0.9077799,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt hast du gesagt, ihr hattet damals einen Release Manager und du warst Stellvertreter. Wer entscheidet heute, welches Feature reinkommt und ob etwas wirklich sauber programmiert ist und so weit ist, dass es in eine Release rein kann?",
      "start": 1830406,
      "end": 1843168,
      "confidence": 0.8898753,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, wir haben z.B. release Manager gehabt, die einfach für eine Version sich voll investiert hatten, auch ihre Learnings hatten, ausgebrannt waren und danach nichts mehr gemacht haben. Und das finde ich mal ein bisschen schade, weil dann kam der nächste und hat dann auch wieder bei fast null angefangen. Und das ist ein bisschen sinnlos, finde ich, bei Contributions. Und irgendwann hatten wir dann das Format und auch den Release Zyklus geändert 2014 und haben uns dann entschieden, wir machen so Major Versions alle eineinhalb Jahre. Und ich war immer so ein bisschen händeringend auf der Suche nach Release Managern, weil die Leute einfach gesagt haben, hey, ich will lieber coden, ich will doch nicht irgendwelche News schreiben, ich will nicht irgendwie das ganze Zeug drumherum machen, die Abstimmung. Und genau da hast du diese Erfahrungen, nämlich dieses okay, komm, dann machen wir das doch noch dazu und verschieben das. Und da haben wir das so ein bisschen aufgelöst und dadurch, ja, seitdem gibt es keine Release Manager mehr, sondern ich bin quasi der Release Manager und habe dadurch aber auch den weiteren Blick über die nächste und übernächste Version mit dabei. Kann dann einfach sagen, ne coole Idee, speichere ich mir im Hinterkopf oder halt natürlich, also jetzt nicht alles nur in meinem Kopf in irgendwelchen Notizen und hol mir die dann zur nächsten Version wieder raus.",
      "start": 1843264,
      "end": 1912708,
      "confidence": 0.9254101,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ist das so ähnlich wie eine Position, wie Guido von Rossum bei Python hatte, wie nennt man das, BDFL, Benevolent Dictator for Life oder wie würdest du das beschreiben?",
      "start": 1912844,
      "end": 1922746,
      "confidence": 0.89493346,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja genau. Also das ist letztendlich derjenige und es gibt immer wieder Situationen, wo es auch Konflikte gibt. Jetzt, es klingt immer so dramatisch, aber einfach nur so, gehen wir Weg A oder gehen wir Weg b und irgendjemand muss da eine Entscheidung treffen und gleichzeitig das grundtechnische Verständnis haben und nicht nur so ein Marketingverständnis haben. Also einfach, es sind häufig technische Gründe oder was priorisiert man? Und da, das ist natürlich mein Tagesgeschäft, Ÿousand und da kommen die Leute immer zu mir. Also da ist es für mich natürlich in meinem Privatleben super wichtig zu gucken, wann habe ich da auch mal Zeit für meine Familie oder was ich auch sonst irgendwie Hobbys habe ich tatsächlich auch, dass ich, wie kriege ich das hin, dass ich ja auch mal sage, wenn ich Urlaub habe, dann bin ich auch wirklich nicht erreichbar. Das hatte ich am Anfang auch Schwierigkeiten und es wird jetzt auch immer besser, aber genau solche Fragen kommen random.",
      "start": 1922828,
      "end": 1972204,
      "confidence": 0.89231676,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie schaffst du das, dass du komplett nicht erreichbar bist? Hast du dann da irgendwelche Stellvertreterinnen oder andere Leute, die das übernehmen oder wie läuft das?",
      "start": 1972292,
      "end": 1979988,
      "confidence": 0.89895576,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber genau, also ich habe es mir heute überlegt, als ich aus dem Urlaub zurück bin, dass ich tatsächlich, ich schaue in mein Mailpostfach tatsächlich auch mal rein, mal am Tag oder so oder mehrfach am Tag bei der Arbeit und guck halt, ist das dringend? Das klassische Prinzip, ist es dringend, okay, dann leite ich es weiter, ansonsten zu und als ungelesen markieren und wieder.",
      "start": 1980004,
      "end": 2000748,
      "confidence": 0.9059956,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber gibt es, gibt es offizielle Stellvertreter oder sowas von von deiner Rolle?",
      "start": 2000884,
      "end": 2005532,
      "confidence": 0.8391723,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jedes Team hat auch ein Co Lead bei Typo und das funktioniert eigentlich ganz gut. Und klar, mein Team ist jetzt ein bisschen größer, weil das doch verschiedene Bereiche gibt. Es gibt halt die, die sich mit MySQL und den ganzen Datenbankthemen auskennen, mit dem ganzen Testing. Dann gibt es die Leute, die sich mit Accessibility auskennen, dann gibt es, die diesen ganzen JavaScript Stack da bedienen. Und diese Konstellationen versuche ich natürlich zu steuern und habe da aber natürlich irgendwie auch Leute, die sagen, ich muss jetzt nicht vorne stehen, ich muss auch nicht alles kommunizieren. Zweitausendein. Aber wenn es ein Problem gibt, dann sprich natürlich ein. Also da merkt man, das Teamgefüge ist auch super wichtig.",
      "start": 2005676,
      "end": 2043606,
      "confidence": 0.9107771,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und jetzt nochmal zum Verständnis, Sorry, aber alle Developer, also alle Personen, die in irgendeiner Form entwickeln, sind bei dir oder gibt es noch andere Developer Teams auch?",
      "start": 2043678,
      "end": 2053022,
      "confidence": 0.9216168,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nein, ich bin das Developer Team Lead sozusagen. Ich bin der Teamlead. Und die Menschen sind natürlich auf der ganzen Welt verstreut, klar. Und manche machen das ehrenamtlich und manche sind in ihrer Firma oder bei der Typo GmbH angestellt, um Typo weiterzuentwickeln. Und denen gebe ich, egal ob sie jetzt ehrenamtlich das machen oder hauptberuflich, ihre Aufgaben. Also zumindest die grobe Richtung. Also ich code denen jetzt meistens nichts vor.",
      "start": 2053086,
      "end": 2078760,
      "confidence": 0.93107706,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wie viele Leute sind das ungefähr, mit denen du so regelmäßig zu tun hast, würde ich sagen?",
      "start": 2078840,
      "end": 2084000,
      "confidence": 0.9117733,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also die Leute, die aktiv was coden für das Produkt, also für diesen Typo Core. Typo ist auch sehr flexibel, kann so mit Extensions, Plugins an sich reinhängen, aber letztendlich dieses Produkt, was wir alle eineinhalb Jahre releasen, davon ist mein Team 15 bis 20 Leute, die nur entwickeln. Und dann gibt es die anderen Teams und die, die nur entwickeln, sind die, die nachher den Merch Knopf haben. Das heißt, die, die, also es macht nicht alles ich, ich kenne Accessibility nicht irgendwie, ich bin da kein super Profi drin, sondern da habe ich dafür die Leute, die auch da danach schauen in der Ecke und dann Sachen merchen.",
      "start": 2084040,
      "end": 2120396,
      "confidence": 0.89945847,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wie viel, wie viele Leute haben insgesamt Merge Rechte?",
      "start": 2120508,
      "end": 2122994,
      "confidence": 0.86275,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, nur die 15 bis 20.",
      "start": 2123092,
      "end": 2124654,
      "confidence": 0.857425,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, das sind die 15 bis 20 Leute.",
      "start": 2124662,
      "end": 2126550,
      "confidence": 0.92954874,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ist dein Team eigentlich das Team mit den Merge Rechten, wenn man so möchte, weil das sind ja auch alles ganz normal, es hört sich alles so sehr, wie soll man sagen, Firmen like an. Du bist jetzt der Engineering Manager von einem 15 bis 20 Mann Team, aber das sind ja Open Source Contributor, die jetzt nicht bei dir im Meetingraum nebenan sitzen, die aber Merge Rechte für Typo haben. Richtig, die sich sehr gut mit dem System auskennen.",
      "start": 2126670,
      "end": 2150054,
      "confidence": 0.9240927,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Zweitausendein, jetzt gibt es dich als Lead, dann gibt es die, die noch Merge Rechte haben, die Developer. Gibt es sonst irgendwelche speziellen Rollen noch, die in irgendeiner Form mitarbeiten?",
      "start": 2150102,
      "end": 2160548,
      "confidence": 0.9206,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ist natürlich schon wichtig zu wissen, dass natürlich irgendwie, also das klingt immer so oh, mein Team und ich entscheide alles, sondern ich bin halt einfach ein Team Lead. Und genauso gibt es ein Documentation Team Lead. Und wenn das Documentation Team sich entscheidet, die komplette Dokumentation jetzt von RST von REST auf Markdown zu ändern, dann habe ich da auch nichts zu sagen. Zweitausendein, ich komme damit auch klar.",
      "start": 2160604,
      "end": 2182386,
      "confidence": 0.90660673,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und QA oder sowas, ist das bei dir dann eher angesiedelt oder gibt es da auch.",
      "start": 2182538,
      "end": 2186898,
      "confidence": 0.8156144,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aktuell ist das bei mir angesiedelt und dann gibt es aber z.b. ein Team, was sich um die Websites kümmert, um die Inhalte, die da drauf gepackt werden. Ein Content Team, was Content schreibt und Proofreading macht, weil doch relativ viele Deutsche gerne Englisch schreiben und es nicht immer optimal ist. Und da gibt es natürlich dann Leute, die da einfach noch mal drüber gehen.",
      "start": 2186914,
      "end": 2206402,
      "confidence": 0.91915417,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Z.B. jetzt ist es ja so, neben dem Core Entwicklungsteam und neben den anderen Teams gibt es ja auch die ganz klassischen Contributer, wie Wolfgang und ich, wir nutzen das, wir laden das.",
      "start": 2206426,
      "end": 2217378,
      "confidence": 0.88671154,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich habe eben noch nie was contributed für Tipo drei, im Gegensatz zu dir, Andi, oder hoffentlich. Du hast schon was contributed. Du bist ja immer da auf Snowboard Tour gefahren, auf Depot drei Snowboard Tour oder wie das Ding heißt.",
      "start": 2217394,
      "end": 2227146,
      "confidence": 0.8665351,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, richtig. Kleiner Disclaimer, Benni und ich kennen uns schon etwas länger und wir haben auch schon das eine oder andere Bierchen in der Schweiz oder in Österreich getrunken.",
      "start": 2227218,
      "end": 2234890,
      "confidence": 0.9012728,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Im Moment hat es die Association bezahlt.",
      "start": 2235010,
      "end": 2237082,
      "confidence": 0.9559571,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nein, nein, nein, nein, nein, die Snowball Tours werden nicht von der Association bezahlt. Damals war ich, habe ich meine Ausbildung zum fachinformatiker Anwendungsentwicklung in einer Webagentur gemacht und diese Webagentur war sehr, sehr nah dran an Typo. Wir haben unser Geld auch ganz offen und ehrlich mit Typo verdient und dann hatte ich auch den Luxus, dass ich da öfters mal ein paar Patches contributen durfte und ich durfte auch schon mal die finanziellen Mittel der Association nutzen für einen Typo Hackday oder sowas, deswegen Hackathon. Und dann durfte ich mal nach Linz fliegen. Ja, ins schöne Österreich.",
      "start": 2237186,
      "end": 2270620,
      "confidence": 0.8932502,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und ich wollte gerade fragen, als quasi offizieller Tourismusbeauftragter von Tirol, wie oft wart ihr in Tirol Snowboard? Das ist schon wichtig.",
      "start": 2270740,
      "end": 2277348,
      "confidence": 0.83993775,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich weiß es nicht, weil ich tatsächlich nicht wintersportaffin bin.",
      "start": 2277444,
      "end": 2281540,
      "confidence": 0.935274,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Andi, wie oft warst du in Tirol?",
      "start": 2281660,
      "end": 2283572,
      "confidence": 0.7751914,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Müsste ich nachschauen. Verlinken wir in den Show Notes. Keine Ahnung.",
      "start": 2283676,
      "end": 2286724,
      "confidence": 0.8611373,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber ich muss jetzt doch leider jetzt, wenn es sich schon so anbietet, einen kleinen kleinen Blog einschieben. Werbeblock, nämlich wir hatten das Thema, das Produkt ist super alt, alle finden es langweilig, also nicht alle, aber es hat diesen diesen angestaubten Look. Genau das, was Wolfi gesagt hat. Und jetzt hieß es dann immer so von von Seiten der Association, wir müssen irgendwas machen für die neuen, für junge Leute, dass die irgendwie Bock haben, da auch zu contributen. Warum wollen die jungen Leute nicht contributen? Vielleicht weil das Produkt so alt ist oder alt aussieht? Oder wie macht man das attraktiver? Und es ist so ein bisschen, wenn du Jährige hast, die sich irgendwie ein Geschenk für jährige überleben überlegen ist auch immer schwierig. Und irgendwie saß ich mit zwei Freunden im Urlaub und habe überlegt, vielleicht finden wir irgendwie eine. Kamen wir irgendwie auf die Idee, es wäre doch witzig. Wir machen einen Typo Surfcamp. Wir haben nämlich Code Sprints. Da kommt man der Klassiker. 1020 Leute treffen sich von mir aus in Duisburg und sitzen da eine Woche und coden und machen neue Features und irgendwas muss fertig werden. Und die dürfen Pizza essen und dürfen bis nachts um drei coden. Und die Leute wollen das vielleicht gar nicht mehr. Wie wäre es, wir machen einfach einen zweitausendein Surfcamp, wo du morgens einen Surfkurs hast und mittags und abends coden kannst und wir laden dreiig Leute ein. Wir bezahlen alles von der Association, außer den Flug, weil du weißt ja nicht, woher die Leute kommen. Und dann sind die eine Woche da eingesperrt und müssen in sechs Teams irgendwas bauen, so hackathon mäßig.",
      "start": 2286772,
      "end": 2373446,
      "confidence": 0.89677954,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber das macht ihr erst oder habt ihr schon gemacht?",
      "start": 2373558,
      "end": 2375614,
      "confidence": 0.943574,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das habe ich jetzt dieses Jahr, letztes Jahr gekickstartet und habe mal geguckt, ob das überhaupt funktioniert, weil ich bin jetzt auch nicht mehr der ganz Jüngste und habe nur ein paar Leute, die ich unter dreiig, unter fünf und dreiig damals angefragt hatte. Und da kam doch einige zusammen. Also hat dann hat sich gefüllt und wir haben das jetzt im April durchgeführt und zwar eigentlich ein richtig cooles Event und alle hatten richtig viel Spaß und es kam auch was darüber. Und es nimmt auch so ein bisschen die Angst, weil das hat wir jetzt bisher nicht erwähnt, weil alle immer denken oh, der Benni mag. Also die wollen irgendwie. Also ich traue mich jetzt nicht, mit dir zu reden. Und ich bin eigentlich auch also normaler Mensch mit Haut. Und da ist es halt so, dass das, dass man das, wenn wir jetzt eine ganze Woche mit Benni irgendwo auf Fuerteventura verbringst, auf dem Surfcamp, dann sagst du halt ja klar, kann ich auch mal kurz irgendwo im Chat anschreiben und der weiß ja, wer ich bin. Und es ist tatsächlich natürlich diese Nahbarkeit, die darf man immer, das ist mir sehr wichtig, die darf man immer da nicht vergessen. Also wir hatten mal so ein anderes Event, das war die User Experience Week damals, 2017, war so ein Typ, kam aus Wales und meinte nur so nach ein paar wow, Benny Mac, can i have a photo with you? I'm really, you're my hero und zweitausendein. Und ich so, also ich finde jetzt nicht so, dass ich irgendwie der riesen Held bin. Also ich mache halt irgendwie die News und drücke halt auf so einen Knopf, dass es eine neue Version gibt. Kann man ja automatisieren. Und dann habe ich ein Foto von ihm gemacht und irgendwie der Typ war, der war schon länger in der Community halbwegs aktiv, hat aber dann angefangen für die Typo GmbH zu arbeiten und hat dann jetzt auf YouTube solche Introduction Videos gemacht für Typo. Und dann habe ich halt quasi, sitze ich mit dem auf diesen Developer Days und sage so, jetzt bist du der Typ, den alle kennen, weil alle herkommen. Und ich so, ja, das passiert, indem man sich einfach nur engagiert in dem Projekt. Also man macht das ja natürlich nicht für den Fame, sondern tatsächlich, das entsteht automatisch, indem man einfach sagt, dafür brenne ich, dafür habe ich Bock.",
      "start": 2375702,
      "end": 2491048,
      "confidence": 0.8909734,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also Typo macht berühmt.",
      "start": 2491144,
      "end": 2492744,
      "confidence": 0.81936,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich weiß jetzt nicht, ob Typo so die Berühmtheit erlangen wird, aber in seinen Sphären kennt man sich.",
      "start": 2492832,
      "end": 2499872,
      "confidence": 0.92753893,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich stehe hier die ganze Zeit grinsend, denn wir müssen uns alle mal ganz kurz daran erinnern, wir sprechen hier über ein Open Source Projekt. Es geht immer noch um Quellcode Zeilen, um irgendwas auf GitHub und so weiter, weil das ist das, was die meisten Programmierer mit Open Source verbinden, ein Pull Request Issue und so weiter und so fort. Und du kommst jetzt um die Ecke und sagst, ja, wir gehen mal irgendwie snowboarden und wir waren jetzt gerade surfen und erzählst von Leuten, die dich gefühlt auf der Straße erkennen und ein Selfie mit dir haben wollen, als wärst du Taylor Swift. Und.",
      "start": 2499976,
      "end": 2530160,
      "confidence": 0.90868783,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Hatte ich um da auch, ich war im Urlaub, stehe im Urlaubsland an diesem Gepäck Entnahme Ding und dann kommen so zwei junge Typen irgendwie auf meinen Kumpel Olli und mich zu und hey, ihr seid doch hier von Typo. Und wir so hä, haben wir irgendwie Typo Klamotten an? Nee, eigentlich ganz normal, also passiert mir eigentlich nie. Also tatsächlich noch nie wirklich passiert. Und dann sagen die du bist doch der Benni. Ich ja, und du bist der Olli. Okay, was macht ihr hier im Code Sprint? Und ich nee, Urlaub. Man kann ja auch einfach mal so Urlaub machen. Und so kam dann auch die Idee zustande und das waren so ja, ich bin der Mike irgendwie aus Dresden. Okay, cool. Und so habe ich dann Leute kennengelernt. Funktioniert tatsächlich.",
      "start": 2531980,
      "end": 2575862,
      "confidence": 0.84710747,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Warum erzähle ich das war vorhin hast du gesagt, so ja, du hast die Roadmap gemacht und da haben Leute irgendwas versprochen und dann haben die geheiratet, ein Kind gekriegt und ein Haus gebaut und allem drum und dran. Und ich denke mir so ja, die Leber, also die, die haben Open Source nebenbei, aber die leben halt ihr Leben. Jetzt erzählst du aber von der ganz positiven Seite, den Impact von Open Source und von auch irgendwie deiner Arbeit und der Association und allem dran auf die Menschen, natürlich auch auf dich. Also ich weiß jetzt nicht, wie toll du dich dabei gefühlt hast, am Kofferband ein Selfie mit dem Ganzen. Deswegen wie viel, wie viel oder was, was für positive Effekte überblickst du denn? Zweitausendein auch als, als Project Lead? Ja. Also siehst du, ist sowas, kommt sowas täglich rein, dass du hey geil, ihr habt mein Leben verändert, also kriegt ihr wirkliche Fame e mails oder wie kann man sich das vorstellen?",
      "start": 2575966,
      "end": 2623310,
      "confidence": 0.86851805,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nein, also nicht, dass ich wüsste. Fame würde ich auf gar keinen Fall das bezeichnen und ich bin auch nicht der Typ, ich brauche, also ich will das auch gar nicht. Aber eigentlich ist das Schöne ist natürlich, ich finde dieser Freiheitsgedanke, dass man doch doch machen kann, was man möchte, aber natürlich schon eingeschränkt. Das klingt etwas krass. Also es ist schon so, dass du sagst Hey, bei Open Source, ich kann jetzt einfach mal ein Feature bauen und mal gucken, ob es der andere cool findet. Und was ich aber noch viel, viel, viel wertschätzender oder wertvoller finde, ist, dass ich Menschen kennengelernt habe vor 15 Jahren und 10 Jahren, die ich zu den tollsten Menschen in meinem Leben, die ich kennengelernt habe, zähle, die ich nur durch Typo kennengelernt habe. Ich war jetzt zufällig vor zwei Wochen an der Nordsee im Urlaub und habe erfahren, dass halt einer von diesen zwei oder drei Association Board auch da Urlaub macht. Und dann haben sich die so getroffen und du denkst okay, im normalen Leben würdest du an der Person einfach vorbeilaufen, aber man kennt sich. Also auf einmal wird die Welt kleiner, weil ja, wenn man sich irgendwo einbringt und ja im Rampenlicht steht, klingt zwar krass, aber tatsächlich halt ja aktiv ist. Manche meine Nachbarn, wenn ich umgezogen bin, haben immer gesagt ich habe dich auf YouTube gefunden. Ich so schwierig, da war ich irgendwie, habe ich irgendwie nur Quatsch erzählt oder so. Natürlich macht das was mit einem, aber ja, eigentlich finde ich eher dieses Thema mit den Freundschaften und den Menschen total cool, weil und ihr kennt das vielleicht, ihr sitzt manchmal vor einer Aufgabe, IT Aufgabe, Matheaufgabe und wie löse ich das? Und dann habe ich eine Freundin, die rufe ich einfach an und sagt Guck mal, ich habe diesen das Problem, wie würdest du da rangehen und sagt Naja, das ist eigentlich dieses Design Pattern, macht das so und so. Und ich so okay, cool. Das heißt, ich weiß auch nicht alles, aber durch dieses Kollektiv traut man sich auch einfach mal Leute anzurufen und zu fragen, was die von deiner Idee oder das mache ich tatsächlich sehr gerne, pitch irgendwelche Ideen zu Leuten, die ich tatsächlich nur durch Typo kenne. Oder ihr kennt das vielleicht, naming is hard, also irgendwelche Sachen, wie nenne ich jetzt diese Serviceklasse oder dieses Feature? Und da brauche ich einfach Input. Ruf drei, vier Leute an, erzähl, was ich vorhabe und dann kommen die mit Begriffen um die Ecke, die ich dachte, ah cool, wäre ich nie drauf gekommen. Ja, obwohl die jetzt natürlich irgendwie net oder irgendwas anderes programmieren, das ist doch immer dasselbe. Das finde ich richtig schön.",
      "start": 2623350,
      "end": 2755544,
      "confidence": 0.8800609,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ÿousand, jetzt hast du gesagt, du hast eine riesen Community an der Hand, die gab es ja nicht immer. Wie habt ihr denn das geschafft, dass ihr die Community aufgebaut habe? Also hast du eine Idee, warum die Community immer noch so lebendig ist und auch neue Leute anzieht? Ist das das Surfen oder gibt es irgendwelche anderen Punkte? Weil das beklagen ja eigentlich ganz viele Open Source Projekte, dass es so schwierig ist, eben auch Nachwuchs zu finden, dass Leute dabei bleiben und nicht nur irgendwie ein Feature einkippen und dann wieder weg sind. Also wie baut man eine Community auf? Was glaubst du, was da der ausschlaggebende Punkt damals war oder wie ihr die halt aufrechterhalten habt? Auch mit mehreren Punkten, wahrscheinlich nicht nur einen.",
      "start": 2755552,
      "end": 2793848,
      "confidence": 0.89459914,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Einmal ist es interessant, weil Typo natürlich ein Produkt ist, was ein Redakteur, ein User aktiv nutzt. Ich finde es wesentlich schwieriger bei einer Software, die im Hintergrund läuft. Nimm irgendein Testing Tool, das wird niemals irgendwie so eine große, also wird eine große Reichweite haben, aber nicht den Bekanntheitsgrad. Das finde ich natürlich auch schade, zweitausendein, weil nur weil es viele User sehen, heißt es nicht, dass es irgendwie besser ist. Meine Schwägerin hat mir mal irgendwie einen Screenshot von ihrem Handy irgendwie geschickt, dass sie irgendwo im Krankenhaus sitzt und da eine Typo Fehlermeldung kommt, irgendwie auf einem Bildschirm beim Arzt. Und ich dachte mir, toll, deren Intranet läuft halt mit Typo ist jetzt nicht das beste Aushängeschild, aber sie hat halt den Wiedererkennungseffekt und den hast du natürlich bei irgendwelchen anderen Nginx nicht wirklich so dabei. Und das macht was aus. Aber wir hatten jetzt nicht ja nur irgendwie nur Hochzeiten. Das heißt eben, Typo ist nur noch ein Bestandteil und nicht mehr das Tool. Wir sagen, die Welt dreht sich in unserer Firma als Kunde jetzt nur noch im Typo, sondern man muss da eben ein Tool wählen, was ich glaube, so den Trade off hat zwischen eben nachhaltig, ich möchte nicht in einer Firma sitzen, also in einem Konzern, wo ich alle zwei Jahre über die Wahl des CMS nachdenken muss, sondern einfach sagen kann, es überlebt ein Relaunch, mein Content überlebt, ich kann Schnittstellen dazu bauen. Cool. Und so trägt sich das natürlich. Aber dieses Feeling Typo ist alt, das ist schon auch präsent, das ist auch das Feedback, was ich häufig bekomme.",
      "start": 2793904,
      "end": 2885118,
      "confidence": 0.8862382,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber heißt es, dass viele Contributors auch von wirklich von Firmen kommen, die dann dementsprechend bezahlt werden, also die auf Typo setzen und deshalb irgendwie ein Beitrag, ein Zurückgeben ist, dass sie Leute auch oder ihre eigenen Mitarbeiterinnen eben bezahlt daran arbeiten lassen.",
      "start": 2885214,
      "end": 2900526,
      "confidence": 0.85124695,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau das macht eigentlich die Typo Association das. Das heißt, durch das, was die Members haben, entsteht auch eine Awareness, dass man ja auch was zurückgeben kann. Ist auch eines, wenn ich jetzt auf irgendwelchen Konferenzen irgendwas erzähle, dann natürlich irgendwie Technik, aber auch genau das, dass jeder seinen Teil dazu beitragen kann. Weil, also ich bin so der, der, ich nehme ja immer gerne das Jürgen Klopp Zitat I'm the normal one, also ich mache auch nur die gleichen, ich produziere den gleichen Code, bin ich der beste Coder? Und genauso kannst du auch anfangen und dann kriegst du Feedback. Und eine Sache, die ich halt super wichtig finde, ist, dass man zeitnahe Feedback gibt als Maintainer, dass die Leute halt irgendwie auch Bock haben zu sehen, okay, das ist eine nette Community oder zumindest nette Maintainer und ja, die Menschen einfach so nehmen, egal was die, woher die kommen und wie sie heißen und was auch immer, da keinen Unterschied zu machen. Und wenn du natürlich kriegst du aber auch als Maintainer die Klischees ab, sodass ich angemotzt werde und wer kann denn so einen Irrsinn coden? Und früher war alles besser und auch täglich und es zieht mich genauso runter wie jeden anderen auch. Also man hat alles dabei.",
      "start": 2900598,
      "end": 2968496,
      "confidence": 0.89621484,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt hätte ich noch eine Frage an euch beide, weil ihr ja doch im Agentur wesentlich tiefer drin seid. Glaubt ihr, dass Agenturen irgendwie offener sind, Open Source zu sponsern? Und auch zurückzugeben, weil ich habe schon das Gefühl, dass es oft in Firmen ganz schwierig ist, da irgendwie Geld locker zu machen für Open Source. Die verwenden zwar alle Open Source, aber dann aktiv mitarbeiten ist schon noch mal was anderes. Aber bei Agenturen hört es eigentlich ziemlich oft, dass die in irgendeiner Form beteiligt sind, zumindest an Open Source. Könnt ihr das nachvollziehen oder bestätigen?",
      "start": 2968568,
      "end": 2999588,
      "confidence": 0.8680536,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Soll ich einfach mal anfangen, Benni? Jo, es kommt natürlich auf die Größe der Agentur an. Wenn das jetzt so eine 10 1520 Mann Butze ist, dann tun die sich mit explizitem Geld rausgeben. Schwierig. Die sagen aber oh, wir haben gerade irgendwie Freilauf im Projekt zwischen zwei Projekten, da kann jemand mal ein bisschen kontrollieren. Also dass das kriege ich schon mit. Was ich aus meiner früheren Agenturzeit weiß, ist, damals war das noch ein kleines Verkaufsargument. Ja, wir haben hier jemanden, der ist Typo Core Entwickler. Es gibt ja dem Kunden so eine Sicherheit, wenn wir mal einen kritischen Fehler habt, dann können wir den sofort bestmöglich beheben und wir haben Zugang zum Open Source Projekt. Das heißt natürlich bei weitem nicht, dass mein Bugfix dann wirklich auch gemerged wird und im nächsten Release drin ist und so weiter und so fort. Also es ist keine Sicherheit, aber das wird nicht gesagt. Aber der Kunde versteht das oft so. Also das ist ja genauso wie bei großen Behördenprojekten. Größere Agenturen müssen dann nachweisen, drei Mitarbeiter, die in dem Projekt sind, haben diese und diese Zertifizierung. Kannst du ungefähr damit gleichsetzen. Desto größer jedoch die Agentur wird, umso eher machen die dann auch so Governance Modelle mit. Die kaufen sich dann Platinum Membership irgendwie in so Association und stempeln das irgendwie, weil das so ein TÜV Zertifikat ist oder so Trusted Shops ähnlich. Hast bestimmt auch schon mal gesehen. Also das kriege ich, das kriege ich schon mit. Und bei den Agenturen besonders jüngere Leute, die neu zu Open Source sind, die aber auch von den Agentur Gründern dann an Open Source herangeführt werden, die gehen in eine komplett neue Welt. Ja, die werden da reingesogen. Und das wurde ich ja damals auch. Ich weiß nicht, wie viel Zeit ich auf Typo verwendet habe. Also echt viel. Ich bin rumgereist und allem drum und dran. Aber war schon für mich auch ein tolles Gefühl, muss ich zugeben. Ja, ich war, ich war jung und ich brauchte nicht das Geld. Das wollte ich jetzt nicht sagen, aber es war toll, weil ich habe mit sehr vielen Leuten gearbeitet, die sehr viel wissen, sehr viel gelernt. Und so weiter.",
      "start": 2999764,
      "end": 3110412,
      "confidence": 0.90475875,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Deswegen snowballen.",
      "start": 3110556,
      "end": 3111724,
      "confidence": 0.23184,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, Nee, nee, nee, nicht auch wirklich vom programmiertechnischen Handwerk. Also das ist das, was ich jetzt so mitbekommen habe bei ganz großen Agenturen. Ändert sich glaube ich noch mal, wenn so zwei, 300, 400 Leute da arbeiten. Da kann ich wenig zu sagen. In so einer Form, in so einem Format habe ich noch nicht gearbeitet. Aber ja, Benni, siehst du etwas ähnliches oder was sagst du?",
      "start": 3111772,
      "end": 3130830,
      "confidence": 0.8827497,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also mich würde ja interessieren, was ist, wenn ich jetzt sage, stellt euch mal den typischen Agenturchef vor, der zwischen 20 und 100 Mitarbeiter hat. Dann habt ihr bestimmt beide und die Zuhörer vielleicht auch ein Bild im Kopf von dieser Person. Und von dieser Person gibt es schon sehr viele. Also meine Definition, die, die sich da halt, also überhaupt nicht die ganze Zeit, sondern ich habe häufig Menschen erlebt, die das einfach nur machen wollten, um sich selbst und ihre Firma zu präsentieren und gar nicht irgendwie zu sagen hey, ich möchte meinen Mitarbeitern irgendwie Know how weitergeben, weil vielleicht geht der Mitarbeiter, weil er dann zu gut wird zu einer anderen Firma. Das wäre natürlich schlecht. Also ganz viele so fear driven, angstgetriebene Entscheidungen und das finde ich irgendwie Quatsch. Und das erlebe ich bei den Agenturen schon. Das heißt, da geht es ab und zu, da geht es nicht häufig, ab und zu darum, halt eben dann doch auch irgendwie was für die Firma rauszuholen, wie jetzt z.B. bei uns. Wir donaten auch als Firma an Let's Encrypt oder Nginx, weil wir es einfach nutzen und nachhaltig irgendwie da auch. Wir wollen das auch weiter nutzen. Und der Grund, warum ich mich in Typo einbringe, ist, weil ich ehrlich gesagt keinen Bock habe, in 10 Jahren auf ein anderes oder in fünf Jahren, weil Typo ausgestorben ist, ein anderes System zu wechseln, zweitausendein ein anderes System zu nutzen und alle dann umzuschulen. Das finde ich irgendwie langweilig, weil ich finde Typo cool und ich habe mich halt jetzt für Typo entschieden. Aber da zu sagen, da möchte ich irgendwie mich rein investieren persönlich. Und dann ergibt sich glaube ich, das drumherum schon. Also irgendwie, dass Firmen sagen, ich mache da auch was. Und wenn es jetzt einen Tick weitergeht, dann ist es tatsächlich so, wenn jetzt nicht nur eine Agentur Ÿousand, sondern auch ein größeres Unternehmen, die geben dann auch gern. Naja, die reden da jetzt nicht von Hey, wir geben €50 für den Patch oder so. Wenn ich bei einer Firma, also bei irgendeiner von meinen Kunden sagt Hey, könnt ihr irgendwie Typo supporten? Dann redest du ja von aufwärts. Also die, die sagen halt einfach okay, wir machen das hier einmalig, bis es durch durch unseren Einkauf durch ist und den ganzen Kram. Da geht es schon, du musst halt wesentlich mehr Sales machen. Die klassische Arbeit, das könnte man machen, zweitausendein macht man aber viel zu wenig. Das heißt, wir haben schon hauptsächlich Agenturen oder öffentliche Einrichtungen. Und da ist es so, dass z.B. typo in Deutschland zumindest, also Dachvitronen, klar, aber in Deutschland 66 % aller Hochschulen benutzen Typo irgendwo. Und jetzt gibt es diesen Government Sidebuilder, das ist ein Produkt der Bundesregierung und die, das war eine proprietäre Lösung und die haben jetzt sich entschieden, die neueste Version Government Sidebuilder GSB 11 auf Typo zu launchen. Und da wird relativ viel Geld in die Hand genommen mit Ausschreibungen, den ganzen Kram, um zu, ja, um Typo als Basis zu haben, weil da natürlich super viele Themen, die jede Website hat, damit zu lösen. Also so Accessibility und solche Sachen.",
      "start": 3130910,
      "end": 3305122,
      "confidence": 0.8974132,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also ist es ein Baukastensystem basierend auf Typo für Government Zeiten?",
      "start": 3305226,
      "end": 3310730,
      "confidence": 0.77342,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau, so kann man das sehen. Jede Kommune und jede Regierungswebsite in Deutschland kann das nutzen. Und ursprünglich hat es tatsächlich Ruanda angeboten, Rwanda hat über 100 Websites von denen, also Government Sites auf Typo gepackt und haben, die haben sich da geschult, Leute aus Europa kamen und haben das da gemacht. Und dann hat Deutschland gesagt, vielleicht wäre das gar keine so schlechte Idee, wir müssen nicht bei null anfangen, da gibt es eine Community. Also schon dieses, wir müssen nicht alles selbst machen, also und auch so das Thema Security und den ganzen Kram müssen wir uns gar nicht direkt kümmern, aber wir wollen natürlich trotzdem, und da war mal das Bundesministerium für Innere irgendwas, ich weiß nicht genau, der ITZ Bund ist da tatsächlich die Stelle, die da relevant ist. Die haben dann gesagt, ja, wir wollen es nicht nur nutzen, wir wollen auch was zurückgeben. Und so haben die dann auch gesagt, wenn jemand dieses Los, also diesen Auftrag bekommt, muss er auch was zurückgeben an das Projekt. Und das heißt natürlich auch jetzt für mich jetzt nicht war cool, ich bin nur auf YouTube zu sehen, sondern meine Arbeit, die ich da rein investiere, wird tatsächlich auch ÿousand noch von mehr Leuten genutzt und auch länger genutzt, weil es sicherlich nicht in einem Jahr wieder abgeschaltet wird. Das finde ich ganz cool.",
      "start": 3310810,
      "end": 3383672,
      "confidence": 0.917914,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Der IDC Bund gehört zum Bundesministerium für Finanzen.",
      "start": 3383816,
      "end": 3387280,
      "confidence": 0.9156,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das Schöne an der Sache ist eigentlich, ihr seht, ich habe mit dem Ding nichts zu tun, also alles das ist mit meiner Arbeit tangiert, nur Themen, wo es darum geht, z.b. irgendwelche BSI Checks oder solche Sachen irgendwie durchlaufen zu lassen, ob wir da sicherheitsrelevante Sachen gefunden haben. Und das finde ich ganz cool. Das heißt, das kommt dann noch so on top dazu. Ein kleiner Benefit für Open Source Themen, nämlich mehr Leute schauen einfach auf den Quellcode als bei den proprietären Systemen. Also ich bin Open Source Fan, auch wenn ich die Schattenseiten auch gut kenne.",
      "start": 3387360,
      "end": 3423170,
      "confidence": 0.90080214,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Lass uns mal kurz über Open source sprechen und Technologie, denn wir sprechen ja immer noch über Open Source. Wir sprechen immer noch Technologie. Und bei einem großen Open Source Projekt, Ÿousand, gibt es ja manchmal auch ein paar Eigenheiten. Z.B. seid ihr gar nicht auf GitHub, sondern ihr übernehmt contributions auf Garrett. Und jeder fragt sich so hä? Ich denke GitHub ist die neue Standard Plattform für Open Source. Also erstens, kannst du mal ganz kurz erklären, was Garrett ist in zwei Sätzen? Und zweitens dachte das machst du. Nein.",
      "start": 3423290,
      "end": 3453260,
      "confidence": 0.92180514,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also erzählt doch ihr mal, was ihr über Garrett wisst, aus dem Stegreif ohne Google.",
      "start": 3454400,
      "end": 3459152,
      "confidence": 0.863806,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Garrett ist ebenfalls ein Source Control Management System, ähnlich wie GitHub, was auf Git basiert ist unter anderem. Kommt glaube ich auch aus dem Hause Google. Meines Wissens nach heißt da irgendwas Mon. Ne, nicht Mondrian oder irgendwie sowas. Das hat einen Google internen Namen und es arbeitet mit dem sogenannten Konzept der Stack Pull Requests. Das weiß ich, das wird unter anderem von großen Firmen wie Uber und Co. Ebenfalls verwendet und das Android Project, Wikimedia und Co nutzen das alles auch. Genau, ist eine andere Art, wie man contributions akzeptiert und wie man auch Pull Requests, wie soll man sagen, verwaltet. Habe ich das richtig getroffen, Benni?",
      "start": 3459216,
      "end": 3496996,
      "confidence": 0.8938831,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "So würde ich das grob auch sagen. Genau. Es kommt aus dem Hause Google Android verwendet es aktiv. Es hat tatsächlich den Vorteil, dass ich einen quasi für jeden Change, den ich mache, mache ich natürlich auch einen Branch und kann darauf verschiedene Patch Sets packen, die aber nachher immer wieder. Also immer wenn ich eine Änderung mache von einem Contributor wie Wolfi, dann dann tue ich den Change, also ich pull das, mache ein Amend und push es dann wieder und dann bin ich quasi der Uploader von dem Patch. Und das hat den Vorteil, wir haben manchmal so. Wir hatten so ein Legacy Code und manchmal muss man relativ viel und relativ große Sachen refactoren und man kann da Kommentare hinterlassen und den ganzen Kram. Und manchmal ist es tatsächlich sehr praktisch, man hat diese gesamte Historie und kann zwischen den Diff machen, zwischen Patch Set 52 und 54. Und ja, es sind nachher mega viele Changes. Ich finde das mit dem Backbord easy, aber das ist tatsächlich Gewöhnungssache und es schreckt aber auch viele Leute ab, dass wir Gerrit verwenden. Aber solange wir eben, glaube ich, noch so große Batzen Refactor müssen, finde ich das ziemlich praktisch. Wir machen aber Mirror auch auf GitHub. Und das heißt, wenn ich einen Clone mache von GitHub, pushe ich zwar, also ich pushe zu Gerrit und pulle von GitHub.",
      "start": 3497068,
      "end": 3564978,
      "confidence": 0.88343954,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Seht ihr denn, ich sag mal, einen Effekt, dass neue Contributer eine längere Onboarding Zeit benötigen, weil ihr eigentlich eine, ich würde es jetzt mal industriefremdes System nutzen. Also es gibt ja Open Source Projekte, die nutzen Garrett, aber die Maße tut es halt nicht. Das meine ich eigentlich. Also seht ihr eine längere Onboardingzeit. Deswegen?",
      "start": 3565034,
      "end": 3583252,
      "confidence": 0.84169304,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, würde ich auf jeden Fall sagen. Also ich denke, es ist für viele leichter. Wir haben auch so eine Bridge, das heißt, du kannst auf GitHub pull request machen und der wird dann automatisch geschlossen und in Gareth aufgemacht. Also das wird mit dokumentiert, aber halt unsere Contribution Workflow Documentation ist doch schon umfangreich. Dafür läuft das über unsere Userbase und nicht über Githubs User Base. Dann gibt es die politisch politisch angehauchten Themen. Hey, jemand aus dem Iran wird irgendwie von heute auf morgen ausgesperrt. Wie steht ihr da dazu? Wie viel Code geben wir ab? Wie viele Sachen geben wir ab? Z.B. was die Issues betrifft, läuft das nachher alles auf dem System? Ja, es ist Git, aber die ganzen Issues, du hast eine API, aber das Ding läuft irgendwo in den USA. Gut, Microsoft ist schon stabil, aber und GitHub natürlich ist der Marktführer, aber solche Stimmen haben wir natürlich auch. So die Hardliner DSGVO Leute, also da.",
      "start": 3583356,
      "end": 3635166,
      "confidence": 0.8823746,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Denkt ihr auch wirklich aktiv drüber nach, so quote unquote on your content, also on your content meine ich jetzt nicht, aber own your user base und all.",
      "start": 3635198,
      "end": 3642770,
      "confidence": 0.80804217,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und die Kommunikation läuft auch über Garrett dann? Oder habt ihr da also auch so oder habt ihr da noch irgendwie, keine Ahnung, Discord Server, irgendein anderes IRC, irgendwas zum chatten oder läuft wirklich alles über Garrett, wenn ihr kommuniziert?",
      "start": 3643870,
      "end": 3657294,
      "confidence": 0.907978,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wir haben das Ticketsystem, da passiert überschaubar viel an Kommentare, dann kommt irgendwann ein Patch, dann wird der Patch kommentiert, ich mag das Komma nicht oder irgendwelche Nitpicks oder größeren Changes oder halt, da muss man dann eben auch mal entscheiden und sagen, machen wir nicht so doofe Idee. Das ist natürlich unangenehm, aber gehört zum Job. Und es gibt aber natürlich, wir haben auch Slack und man kann das jetzt mögen oder nicht. Ich persönlich würde mittelfristig, wir waren glaube ich eine der wenigsten ersten, die auf Slack waren, unter so ein unlimited Ding bekommen hatten als Open Source. Ich würde mittlerweile nicht mehr dieses System nutzen wahrscheinlich.",
      "start": 3657422,
      "end": 3695112,
      "confidence": 0.8951497,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Warum?",
      "start": 3695256,
      "end": 3695688,
      "confidence": 0.9273,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du weißt ja nicht, was mit diesem Content tatsächlich da passiert und was darum gechattet wird. Und hauptsächlich war damals das Problem, dass relativ viel Support stattfindet, das sagt hey, ich habe ein Problem mit der und der, mit dem Plugin und das funktioniert nicht. Dann sagt der zweite ja, macht das so und so und wir mussten auch so ein bisschen mehr aktiv die Leute zu Stack Overflow pushen. Und eigentlich würde ich mir ja wünschen, es passiert außerhalb irgendwie öffentlich mehr an diesem Support Themen und da ist leider ja erstmal keine sinnvolle Alternative da. Auf der anderen Seite würde ich aber sowas wie Metamost aber heutzutage bevorzugen. Das Problem ist, dass irgendwie, ich weiß es nicht, User, also es gibt so ein server Admin Team, die betreuen so die ganze Verwaltung mit Slack oder auch die, die aktualisieren Gerrit für uns. Das Heißt also, es gibt mehr wie nicht. Und die, wenn, wenn die jetzt nachher sagen in Abstimmung mit der Typo Association, mit dem Board, wir wechseln das Tool, machen wir da mit. Normalerweise werde ich natürlich auch mit in die Konversation eingespannt.",
      "start": 3695744,
      "end": 3752564,
      "confidence": 0.87303007,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ist natürlich gar nicht ohne für Leute irgendwas zu betreiben. Ja, das ist schon nur für Kommunikation oder? Kommunikation ist wichtig, klarerweise, aber es braucht natürlich viel Zeit.",
      "start": 3752612,
      "end": 3760860,
      "confidence": 0.89381427,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das schwierigere ist nicht, ist nicht das Hosting, sondern halt das laufen lassen, sondern wie bringe ich Leute von A nach B? Weil die einen kommen halt nur, also es gibt halt, ich weiß es nicht, sind 5000 Aktive und Inaktive, die halt einmal im Monat draufgehen, die also wir benutzen Slack in der Firma zweitausendein, dann ist das Ding natürlich immer offen. Es gibt aber halt welche, die haben das nicht am Laufen und dann sagen ah sorry, ich habe deine Nachricht erst irgendwie von vor einem Monat bis jetzt gelesen. Klar, weil die halt nicht da so regelmäßig drin sind und eigentlich ja, denen allen zu sagen, wir wechseln morgen, ist halt oder halt in zwei Monaten super schwierig und aber ich glaube, das wäre schon wesentlich hilfreicher und zielführender.",
      "start": 3760940,
      "end": 3800306,
      "confidence": 0.8794456,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube, das Pendat von den Leuten, die erst nach einem Monat wieder eine Chatnachricht lesen, ist dann zweitausendein der Drive by contributor, oder der dann vorbeikommt, einen Patch da lässt und sagt so, die Damen und Herren vom Typo Open Source System, die kümmern sich schon drum. Inwieweit habt ihr denn solche Herausforderungen? Also du sagtest gerade, ihr hattet Tickets, auch Karteileichen dabei in eurem Ticketsystem. Habt ihr diese Karteileichen auch im Patch Receive System, im Garret?",
      "start": 3800458,
      "end": 3831464,
      "confidence": 0.8640348,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also wir haben 2500 offene Issues und 300 pending Patches. Wenn ich tatsächlich noch mehr Zeit hätte als die 48 Stunden, würde ich die Patches auch mal sauber reviewen, vielleicht auch fertig machen, weil manche machen den Patch während der Arbeit und lassen dann liegen und jetzt hast du so ein halbfertiges Ding, ballerst noch ein paar Tests dazu, perfekt, aber passiert nicht von alleine. Das heißt, die Arbeit, die wenig Spaß macht, die muss ja dann auch passieren. Passieren, oder? Dann machst du einen Test dazu und oder der macht einen fix und es macht irgendwas anderes kaputt, eine Regression wollen wir alle nicht. Leider auch zu oft in meinem Leben passiert. Und genau diese Dinge muss man auch machen. Das gehört als Maintainer mit dazu. Und das heißt, wir haben aber natürlich trotzdem für 85 % der Tickets keine Patches. Aber man muss auch vielleicht bei den 10 % der Tickets auch erstmal noch sagen, ah, das wollen wir gar nicht machen oder bau das als Plugin.",
      "start": 3831552,
      "end": 3881612,
      "confidence": 0.90170014,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du sagtest gerade, dass ihr den Patch fertig macht. Bedeutet das, dass ihr aber dann relativ wenig Ablehnung verteilen müsst? So nach dem Motto, das kommt hier nicht rein und wir die kleinen, deine Contribution, weil ihr das dann nehmt und dann fertig macht, oder? So hört sich das gerade so ein bisschen an.",
      "start": 3881676,
      "end": 3897548,
      "confidence": 0.924045,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also wir die kleine schon Patches. Wenn jetzt also ich die kleine keinen Patch, ja, eine Sache löst, die offensichtlichen Fehler ist, sondern der ist halt, der ist nicht fertig. Aber manchmal gibt es halt irgendwie so, hey, ich finde jetzt alle Templates sollten jetzt irgendwie lower Camel Case oder was auch immer geschrieben werden. Und ich so, hey, du brickst damit irgendwie eine halbe Million Instanzen. Das sehe ich jetzt nicht irgendwie als zielführend, das werde ich dann halt schon dementsprechend ablehnen. Also wir haben natürlich Coding Guidelines, er hat vorher gefragt, ob wir irgendwelche Sachen definiert haben. Wir haben relativ viel dokumentiert und es ergibt sich natürlich auch immer wieder mit der Größe. Und die Dinge, die muss ich natürlich auch erledigen. Irgendwie hin ÿousand Themen einsammeln, mit Leuten reden und sagen, okay, wir definieren jetzt diesen neuen Standard. Auch das finde ich sehr wichtig bei Lizenzen. Jetzt, wenn du Npm oder Composer nutzt und wir Gplus sind, dann achte ich schon sehr genau darauf, welche Tools wir mit reinziehen, welche Abhängigkeiten und Review. Das mache ich tatsächlich. Ich review jede Library, die wir haben, bevor sie dazu gefügt wird, ob sie kompatibel mit GPL ist.",
      "start": 3897644,
      "end": 3960626,
      "confidence": 0.8826421,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Nachdem du jetzt 20 Jahre, über 20 Jahre eigentlich in dem ganzen Ÿousand Bereich drinnen bist und auch ganz viele Änderungen miterlebt hast und die Community hat sich wahrscheinlich fünf mal ausgetauscht in dieser Zeit so fast gefühlt. Wenn du jetzt irgendwie einen Tipp geben müsstest, jemand anderem, der so eine große Community managt oder sich gerade entwickelt, gibt es irgendeinen Game Changer, den es gegeben hat, um die, um den ganzen Prozess zu verbessern oder die Community Arbeit zu verbessern oder zu erleichtern? Hättest du da irgendeinen Ÿousand, was sehr wichtig ist, wenn man mit so einem großen Projekt oder mit so einer großen Community arbeitet?",
      "start": 3960658,
      "end": 3997806,
      "confidence": 0.8718073,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Der Tipp ist schon das, was man auch so im klassischen Führungskräftemangementbereich hat, nämlich delegieren, aber auch dieses, also die Klischees tatsächlich, dieses offene Ohr haben und nicht irgendwie sagen ich bin jetzt gerade schlecht gelaunt, also drücke ich es dem nächsten rein. Passiert ja mir auch, weil dann laufe ich lieber mit meinem Hund um die Ecke, wenn ich einen hätte oder so. Ÿousand, also die Themen haben wir auf jeden Fall auch. Ansonsten ist es schon auch das Thema, also eben zu gucken, was muss ich denn machen, was nicht? Weil es schon immer wieder die Leute gibt, die einfach dann einen Burnout haben. Ich hatte schon auch Leute, die sich so stark identifiziert haben in ihrem Leben, weil sie nichts anderes mehr gemacht haben, außer 24 sieben irgendwas für dieses Projekt zu bauen. Die waren gefühlt eins mit diesem Projekt. Und ich glaube, also da sollte man schon auf den Rat von Freunden hören und sagen nein, das ist nicht gut. Also ich habe einen Freund, der sich sehr stark in Open Source investiert hatte und das war dann zu viel und der hat dann einen neuen Job angefangen, wo er nur noch 80 % arbeitet, weil er gesagt hat, ich muss noch was anderes machen außer Open Source Contributions.",
      "start": 3997838,
      "end": 4064038,
      "confidence": 0.90663457,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also ganz hart priorisieren und delegieren.",
      "start": 4064134,
      "end": 4067206,
      "confidence": 0.84604,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau, würde ich auch sagen. Genau, noch priorisieren, was ist eigentlich mein Job und was muss ich nicht machen? Oder wo ist mein eigener Anspruch vielleicht auch einen Tick zu hoch und kann dann einfach sagen, nee, mache ich jetzt nicht oder das muss jetzt warten. Und häufig ich kann also klar quatsche ich irgendwie mit Leuten bis nachts um eins oder so und kann denen aber auch sagen heute nicht. Ja, und das ist glaube ich die Kunst zu sagen, was, was ist mein Pensum, was kriege ich hin und was nicht? Und da ist ja auch jeder individuell.",
      "start": 4067318,
      "end": 4094680,
      "confidence": 0.9239593,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wir sind am Ende dieser Podcast Episode und was ich wirklich faszinierend fand, jetzt in der letzten H. Haben wir zwar den ganzen Tag über Open Source gesprochen, aber jetzt gar nicht so wirklich viel über, ich sag mal wirklich Technologie, Design Patterns und Co. Und das das finde ich so faszinierend und das finde ich so schön an dieser Podcast Episode. Vielen lieben Dank, wenn die, dass du uns ein paar Einblicke in die, in das Management von großen Open Source Projekten gegeben hast und auch was da für Arbeit mitkommt. Du hattest gesagt, ja, es gibt auch Dinge, die sind nicht so schön, die machen nicht so viel Spaß. Und da muss ich ganz ehrlich Danke sagen, dass es so Leute gibt wie dich und solche Sachen dann auch machen. Denn ich glaube, sonst hätten wir alle keinen Zugriff auf Content Management Systeme wie Typo, WordPress, Drupal, Joomla und Liferay und wie sie alle heißen.",
      "start": 4094760,
      "end": 4146698,
      "confidence": 0.9277119,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich würde da auch noch eine kleine Geschichte einfügen, nämlich es gibt auch immer diesen Battle Typo ist eigentlich schlecht oder Typo ist besser als alle anderen Sachen. Und ich bin tatsächlich auch, weil ich ja einfach noch ein bisschen Zeit übrig habe, bin ich dieses Jahr auf den WordPress Hackathon. Der war beim Cloud Fest, also kurz davor in Rust im Europa Park. Und da waren einfach mal kurz locker 120 Leute auf dem auf dem Hackathon Code sprint und da kannst du irgendwas mit Linux coden, irgendwelche WordPress Features. Und ich habe meinen ersten WordPress commit zweitausendein produziert, der aber dann schmetternd abgelehnt wurde. Aber ich fühle mich jetzt richtig gut, weil ich auch WordPress contribute. Das macht auch ein bisschen Spaß.",
      "start": 4146874,
      "end": 4193490,
      "confidence": 0.8966387,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe so ein bisschen das Gefühl, bei dir geht es eher um den ganzen Spaß drumherum. An der Nordsee oder Ostsee Urlaub zu machen, surfen und jetzt noch Achterbahn fahren.",
      "start": 4193610,
      "end": 4201098,
      "confidence": 0.905041,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Im Europa Park, wenn das Win Win für alle Beteiligten ist, ist ja perfekt so.",
      "start": 4201114,
      "end": 4205670,
      "confidence": 0.83959466,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und die Arbeit gibt es trotzdem.",
      "start": 4206170,
      "end": 4207870,
      "confidence": 0.9029483,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die Arbeit gibt trotzdem, aber sie scheint dir ja sehr viel Spaß zu machen, sonst würdest du diese Rolle ja auch.",
      "start": 4208610,
      "end": 4213746,
      "confidence": 0.9215448,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nicht ehrenamtlich ausführen, was für mich ganz interessant war. Also keine Ahnung, ihr gebt vielleicht auch mehr Einblicke in andere CMS Systeme oder Open Source Projekte, aber es scheint mir schon sehr professionell aufgestellt zu sein mit der Association und GmbH darunter und dass das alles Sinn macht und sehr strukturiert aufgebaut. Also wäre mal interessant, ob das andere Open Source Projekte auch so professionell betreiben und ob vielleicht es auch ein Grund ist, warum es Typo immer noch gibt in dieser Zweitausendein und immer noch steigen.",
      "start": 4213778,
      "end": 4242504,
      "confidence": 0.90768504,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, und es macht tatsächlich für die Community was aus, weil es nicht nur so profit driven ist. Wenn es jetzt der Firma schlecht geht. Wenn du eine Firma oben stehen hast, dann muss man wieder 50 Leute entlassen und man hört natürlich direkt als allererstes bei den Open Source Leuten auf und oder man fängt da an, die zu entlassen und es ist natürlich super frustrierend, wenn du eigentlich so abhängig bist vom Erfolg einer Firma. Wenn du einen Verein hast, finde ich das schon wesentlich cooler. So die apache Foundation oder so. Macht schon mehr Spaß.",
      "start": 4242552,
      "end": 4273552,
      "confidence": 0.91570777,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Vielen lieben Dank, Benni, dass du den Hörerinnen und Hörern im Engineering Kiosk einen Einblick in eine solche Arbeit geben kannst. Ich denke, ganz wenig Leute machen diese Arbeit und noch weniger Leute teilen ihre Arbeit und was auch dahinter steckt. Danke dir. Und natürlich wie immer, verlinken wir alle Sachen, die wir erwähnt haben, unten den. Falls ihr also auch mal ein Danke an Benny schreiben wollt, findet ihr sehr wahrscheinlich im Typo Kosmos oder bei uns in den Shownotes irgendwie ein Link, wie ihr den Benny kontaktieren könnt. Bis dahin sagen wir bis zur nächsten Episode und tschüss.",
      "start": 4273696,
      "end": 4306754,
      "confidence": 0.8916018,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ciao.",
      "start": 4306842,
      "end": 4307250,
      "confidence": 0.44235,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Danke, ciao.",
      "start": 4307330,
      "end": 4307970,
      "confidence": 0.628045,
      "speaker": "B",
      "channel": null
    }
  ],
  "confidence": 0.8985113,
  "audio_duration": 4254,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}