{
    "language_code": "de",
    "audio_url": "https://cloud.inlupus.at/s/jmdM4FiLA68RDTr/download/ep147_mechanische_tastaturen.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "e7cb54a0-d1a9-4f34-a05a-aadfef9c725f",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Eine neue Episode vom Engineering Kiosk Podcast. Cool, dass du wieder dabei bist. Für alle Techworker innen ist kein peripher Gerät so essentiell wie die eigene Tastatur. Und doch verwenden viele von uns ein €15 Gerät, das wir noch vom ersten Computer im Schrank liegen hatten. Vergleichbar wäre dies, wenn professionelle Handwerker täglich mit der Baumaschine aus dem Discounter eine Mauer wegstemmen. Funktioniert schon irgendwie, aber angenehm ist halt anders. Mechanische Tastaturen wären in diesem vergleich wohl die Hilti unter den Eingabegeräten. Doch was zeichnet eine mechanische Tastatur aus? Sind diese nicht einfach nur laut? Was ist der Hype um diese Art von Keyboards? Wie sind diese im Detail aufgebaut? Was kosten diese? Und warum sind dort oft bunte Tasten verbaut? Welche Tastaturlayouts und Größen gibt es? Und was hat das Ganze eigentlich mit Ergonomie zu tun? In dieser Episode geht es nicht nur um Tastatur Hardware, sondern auch um Custom Firmware. Wir steigen tief in den Hasenbau von mechanischen Tastaturen und ab dafür.",
            "start": 3760,
            "end": 62722,
            "confidence": 0.90182054,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Viel Spaß.",
            "start": 62786,
            "end": 63670,
            "confidence": 0.99925,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Im heutigen Podcast sprechen wir mal über Tastaturen oder wie unser heutiger Gast diese nennt, Hackbretter. Und dieses Thema habe ich dem Wolfgang im Vorhinein mal gepitcht, denn immer wenn wir über ein Thema sprechen, dann stimmen wir uns erst ab. Machen wir das, machen wir das nicht? Kriegen wir noch Inhalt zusammen? Wen laden wir ein? Und so weiter. Also eigentlich klassische Episodenvorbereitung. Und die erste Antwort von Wolfram war kriegen wir dann eine Episode gefüllt? Da habe ich aus meiner Tasche einen Link geholt zu einem Podcast und zum sogenannten Klick Klack Hack Podcast, der inzwischen, Gratulation auch schon mal an den Gast im Vorhinein, die 100. Episode jetzt gerade erreicht hat. Und somit haben wir wohl das Argument kriegen wir mit diesem Thema eine Episode gefüllt? Doch etwas widerlegt. Das Thema Tastaturen hab ich jetzt in der Vorbereitung gelernt, scheint sogar ein Religionsthema bzw. Glaubenskriege auszulösen. Wolfgang und ich selbst benutzen keine mechanischen Tastaturen, aber in jeder Firma, in der ich bisher gearbeitet habe, hatte mindestens ein Arbeitskollege eine mechanische Tastatur im Büro, in der sehr viel Arbeit reingesteckt wurde. Ich habe das nie verstanden, denn diese Tastaturen waren einfach immer laut. Und die haben immer sehr laut geklickt, geklagt und so weiter. Und ich glaube, deswegen höre ich alles Musik immer nur noch über so Schilde.",
            "start": 66890,
            "end": 142786,
            "confidence": 0.8951567,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Headphones, [sos/eos], Moment, aber da möchte ich kurz reinkrätschen. Wenn ich das richtig verstanden habe, und die haben mir da auch ein paar Episoden angehört, muss eine mechanische Tastatur nicht laut sein, oder Philipp, habe ich das richtig mitbekommen? Weil du sagst mal in einer Episode, du zählst auf, was alle Teile in einer Tastatur sind und keine Ahnung, 80 % waren irgendwelche lautstärken Reduzierungsteile in so einer Tastatur.",
            "start": 142818,
            "end": 167704,
            "confidence": 0.88711464,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich glaube, das ist so der erste Faktor, den der Andi meinte mit Religionskriege auslösen. Nein, sie muss nicht immer laut sein. Definitiv nicht. Also es gibt Leute, die bevorzugen unfassbar leise Tastaturen. Zu denen zähle ich mich selber mittlerweile, glaube ich auch. Ich mag es. Es muss gar nicht mehr so laut klackern, wenn ich auf Tastaturen schreibe. Deswegen, ich mag es auch lieber ein bisschen leiser. Und das geht auch leiser, definitiv. Aber es geht auch unfassbar laut.",
            "start": 167792,
            "end": 189844,
            "confidence": 0.9311242,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also alle, die ein Problem mit der Lautstärke haben, ihr könnt trotzdem weiterhören.",
            "start": 189972,
            "end": 193428,
            "confidence": 0.9510639,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Auf jeden Fall. Also die Lautstärke kommt nicht von mir. Dann.",
            "start": 193484,
            "end": 196036,
            "confidence": 0.95907545,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ihr habt gerade Philipp Höhler Lutz, auch im Netz bekannt als x oder 23 bekannt, gehört. Er ist nämlich der Podcast Host des Klick Klack Hackt Podcasts, den ich unter anderem zur Vorbereitung dieses Podcasts gehört habe und habe festgestellt, Tastaturen sind ein Rabbit Hole. Und deswegen freue ich mich ungemein auf diese Episode und heiße Philipp, herzlich willkommen. Hallo.",
            "start": 196228,
            "end": 222582,
            "confidence": 0.91053367,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hi. Ja, schön, dass ich dabei sein darf. Ich fühle mich geehrt. Ich fühle mich sehr geehrt.",
            "start": 222686,
            "end": 226782,
            "confidence": 0.95156705,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hatte dich schon als Podcast Host vom Klick Klack Hack Podcast vorgestellt. Ein Podcast rein über mechanische Tastaturen. Dieser wird aus Reutlingen bei Stuttgart produziert. Neben dem Podcast bloggst du noch regelmäßig unter nerdbude com zu den Themen Keyboards, Terminals, z.b. wie man Mastodon im Terminal ansieht, Vim Podcasts oder über einen Hackspace, den du gerade selbst mitgründest. Bei dir kann man eigentlich sagen, da dreht sich sehr viel, beziehungsweise alles um Tastatur und mechanische Tastaturen. Auf jeden Fall sehe ich das überall. Und du hast sogar ÿousand mal dein eigenes Tastaturlayout entworfen. Ich wollte gerade so ein bisschen über den Namen nachdenken. Cyberkeys, aber mit K. Und das spricht man dann küber Keys aus, glaube ich. Welches du speziell für Netrunner, Hacker, Terminal Junkies mit dem Fokus auf Vim User designt hast. Und wer sich das Layout mal ansehen möchte, der kann direkt in die Show Note springen. Meines Erachtens nach gleicht es nicht einer regulären Tastatur. Ich finde es interessant, wie man darauf tippen kann. Aber nun gut. Habe ich irgendwas vergessen zur Vorstellung, Philipp?",
            "start": 226846,
            "end": 289656,
            "confidence": 0.8798086,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube, im Groben und Ganzen war es das. Also der Klick klack. Ich glaube, wir können auch CCH abkürzen. Das ist, glaube ich, so ein bisschen angenehmer, weil ich glaube, wenn man ganz oft klick klackack hintereinander sagt, dann verhaspelt man sich ganz oft. Ich glaube, CCH ist immer ganz gut. Ich glaube, daraus sind noch so ein paar Projekte entstanden oder gewachsen, die wir jetzt glaube ich, hier so noch gar nicht genannt hatten zum Thema Meetups. Z.B. es gibt eine CCH Con. Ja, also da gibt es Leute, es gibt noch mehr Leute, die sich mit mechanischen Tastaturen beschäftigen und die treffen sich auch im Real life. Das wäre die CCH Con. Es gibt noch so kleine Projekte wie den PCB Exchange, da können wir später gerne auch noch drauf eingehen. Ist auch, wie ich finde, ein relativ nettes kleines Projekt, was so auch den eigenen Geldbeutel so ein bisschen schont, weil dieses ganze Rabbit Hole dann doch schon relativ ausufern kann, was man so an Geld da drauf werfen kann. Deswegen vielleicht auch so ein kleiner Disclaimer vorneweg. Also falls ihr da draußen jetzt irgendwie denkt, ihr müsst unbedingt Tastaturen bauen und kaufen, alles drum und dran. Wir sind auf keinen Fall schuld, wenn ihr zu viel Geld ausgebt. Das vorneweg schon mal gesagt, weil man kann da unfassbar viel Geld versenken.",
            "start": 289708,
            "end": 346628,
            "confidence": 0.90229374,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wie viel Tastaturen hast du denn?",
            "start": 346764,
            "end": 348416,
            "confidence": 0.82055336,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Fragt man das so wie die Altersfrage?",
            "start": 348488,
            "end": 351928,
            "confidence": 0.8324286,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das fragt man einfach nicht.",
            "start": 351984,
            "end": 353760,
            "confidence": 0.931068,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich habe damit kein Problem. Ich habe mehr Tastaturen als Finger. Ich bin momentan bei 28 Tastaturen, die ich hier rumstehen habe.",
            "start": 353840,
            "end": 360160,
            "confidence": 0.94814825,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und wie viele davon haben so ein normales Layout, was man so kennt, als was wir so normalsterblichen als normales Layout ansehen?",
            "start": 360320,
            "end": 368456,
            "confidence": 0.9144986,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also das Standard QWERTY oder QWERTZ im Deutschen.",
            "start": 368528,
            "end": 371504,
            "confidence": 0.89946127,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, und auch so rechteckig.",
            "start": 371592,
            "end": 372824,
            "confidence": 0.978208,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also, achso, vom eigentlichen Keyboard Layout her ist es in der Tat nur noch eine einzige. Das ist so eine 60 % Keyboard. Also ja, ich glaube so 60 % so kleine Tastaturen, die kennt man glaube ich doch schon. Die sind einem ab und zu, glaube ich mal über den Weg gelaufen. Wenn nicht, stellt euch vor, ihr habt eine reguläre Tastatur mit Ziffernblock und brecht im Prinzip ab den Cursor Tasten einfach alles weg und habt nur noch die, ja, die Alpha Keys, also die Buchstaben. Genau, das sind so 60 % Keyboards und davon habe ich noch ein einziges und das ist das sogar mit QWERTY.",
            "start": 372872,
            "end": 398900,
            "confidence": 0.9130534,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, jetzt, du hast ja die perfekte Podcast Stimme, meiner Meinung nach. Also du bist ja prädestiniert, einen Podcast zu starten. Aber warum startet man Podcast über über Tastaturen? Also da muss die Begeisterung schon so groß sein, dass man wirklich einen Podcast startet hat. Wann hat denn die Begeisterung bei dir so begonnen? Auch wenn du jetzt 28 Tastaturen hast? Also wie lange bist du in diesem Hype kann man ja gar nicht mehr sagen, aber in diesem Rabbit Hole eigentlich abgedacht?",
            "start": 398980,
            "end": 424540,
            "confidence": 0.9093337,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist eine interessante Frage. Also prinzipiell wirklich mit mechanischen Tastaturen in Kontakt gekommen bin ich höchstwahrscheinlich um 2008. Sowas waren allerdings noch, ich weiß nicht, kennt ihr die Firma, das Keyboard? Die machen auch so vom Keyboard Layout an sich relativ, relativ normale Tastaturen, also auch so beziffern, Block und Cursor Tasten und allem drum und dran. Aber die hatten damals eben diese unbedruckten Keycaps, also diese Tastenkappen, hatten keine Zeichen drauf, sahen unfassbar schick aus, waren komplett schwarz. Und das war glaube ich so mein allererster Berührungspunkt mit mechanischen Tastaturen. Und ich habe immer so ein kleines bisschen ja den Drang, Sachen einerseits tiefer verstehen zu wollen, wie Sachen funktionieren und im Endeffekt dann vielleicht auch selber bauen zu können. War damals allerdings irgendwie, weißt du, da war glaube ich mein Einstieg in diese, diese ganze Szene oder dieses ganze Hobby vielleicht missglückt oder ich habe diesen Einstiegspunkt nicht so wirklich getroffen und habe dann relativ schnell frustriert eigentlich wieder aufgegeben. Hat mich dann aber trotzdem immer noch so ein bisschen verfolgt und ich hatte immer so diesen Need, irgendwie doch mal eine Tastatur selber zu bauen. Ich habe mir immer gedacht, muss funktionieren. Es gibt Leute, die bauen Tastaturen, also kann ich das auch irgendwann dann 2000, wann wird das gewesen? Boah, ist eine gute Frage. 2000, 1516, siebzehnte, sagen wir mal 2018 auf jeden Fall. Da hatte ich definitiv Kontakt, näheren Kontakt mit mechanischen Tastaturen letztendlich in dieses, diesen Kaninchenbau reingefallen und bin seitdem da auch nicht mehr rausgekommen.",
            "start": 425280,
            "end": 508336,
            "confidence": 0.8986614,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Kannst du mal kurz mir erklären als Laien, weil mir macht dieser Begriff mechanische Tastaturen immer noch so ein Problem, weil für mich sind ja mechanische Tastaturen auch diese, wo man dann noise cancellation Kopfhörer braucht, wenn wenn der Nachbar sowas verwendet. Aber eine normale Tastatur ist ja auch irgendwie mechanisch. Ich drucke ja auch irgendwie eine Taste nach unten. Also was macht eine mechanische Tastatur jetzt wirklich aus? Wo liegt denn der Unterschied zu einer herkömmlichen Tastatur?",
            "start": 508408,
            "end": 534064,
            "confidence": 0.90191805,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, also die Mechanik selber, da geht es gar nicht um diesen Tastendruck an sich, sondern um die Auslösemechanik, also das, was dein Signal im Prinzip auf deinem Keyboard auslöst. Bei einer mechanischen Tastatur hast du einzelne Schalter unter den Tasten drunter und in diesen Schaltern sind wirklich noch Kupferkontakte verbaut, die durch diese mechanische Betätigung der Taste zusammengedrückt werden. Dadurch schließt ein Kreislauf ÿousand und dementsprechend empfängt dein Computer das Signal auf dieser Matrix wurde auf Position drei, fünf eine Taste gedrückt. Diese Taste ist das B z.B. und das ist die Mechanik an der ganzen Geschichte. Deswegen das Apple Keyboard, was der Andy benutzt z.b. das ist halb mechanisch, würde ich sagen, weil da diese Scheren, diese Scherenmechanik unter den Tasten drunter hängt. Aber der Auslösepunkt selber wird wahrscheinlich durch einen kleinen Gummi Kontakt hergestellt, hätte ich mal sagen. Ich kenne mich mit den Apple Tastaturen.",
            "start": 534112,
            "end": 582542,
            "confidence": 0.9012641,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Leider nicht, aber der Gummikontakt hat ja trotzdem Metall drin. Da ist ja dann auch metalldicht.",
            "start": 582566,
            "end": 587794,
            "confidence": 0.8179475,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber an sich ist dann so halbmechanisch nennt sich das glaube ich. Muss ich aber sagen, da bin ich eher so in die Richtung Vollmechanik. Deswegen in die Halbmechanik habe ich mich nie vorgewagt. Genau. An mir geht es wirklich um die vollmechanische Auslösegeschichte in den in den Schaltern drin.",
            "start": 587842,
            "end": 602242,
            "confidence": 0.9050368,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und was begeistert dich daran denn so? Also was ist das Besondere für dich an mechanischen Tastaturen? Was macht den Hype aus?",
            "start": 602306,
            "end": 611098,
            "confidence": 0.97669774,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das kommt glaube ich auf den Zeitpunkt an, wo man sich da im Hobby befindet. Anfangs, also was mich anfangs fasziniert hat, ist einerseits natürlich die Tastenbewegung an sich. Also du hast Tasten, die du einfach unfassbar weit nach unten drücken kannst, bis es auslöst. Das ist ein haptisches Gefühl, was man sonst bei den regulären flachen Low profile Tastaturen so nicht hatte, weil es alles ist auch schön. Keine Frage. Also eins vorneweg alle Tastaturen sind super. Ich will ja keine Tastaturen verteufeln. Auf gar keinen Fall. Es soll jeder benutzen, was ihm Spaß macht. Mir selber war es aber ja so ein kleines bisschen zu schwammig, nicht präzise genug. Und wenn man da mal so auf einer mechanischen Tastatur tippt, merkt man schon eher so, dass das Handwerk, was dahinter steckt. Es ist ein bisschen, es ist ein bisschen klobiger, ein bisschen brachialer, aber man spürt dafür was. Das war so der Anfang. Das Ganze wächst dann aber so ein kleines bisschen. Wenn man da mal so ein halbes Jahr auf seiner Tastatur getippt hat, denkt man so ja, okay, der Faktor gefällt mir nicht ganz so. Und dann denkst du darüber nach, was kann man an der Tastatur verbessern? Was könnte man mal weglassen? Was könnte ich mal ausprobieren? Und dann gehst du halt so in Richtung ja modding im Prinzip. Du modest deine Tastatur, du füllst dein Keyboard Gehäuse mit irgendwelchen Kunststoffschaum aus, damit dieser Hall, der durch dieses Plastikgehäuse entsteht, geschluckt wird. Dann klingt das alles ein kleines bisschen satter und dann hast du wieder eine ganz andere Freude an deiner Tastatur, die du hast. Das ist dann so der zweite Schritt im Prinzip. Es gibt dann noch so einen dritten Schritt, wo du dann denkst, so ja gut, okay, ich finde die Tasten schon so ein bisschen hart vom Anschlag her, die könnten ein bisschen leichter sein oder ein bisschen härter. Geht natürlich auch. Ich habe ein lustiges Keyboard. Ich glaube, ich kenne Leute, die hier zuhören und die werden jetzt lachen, wenn ich mein 150 g Keyboard erwähne, denn sie haben schon drauf getippt. Grüße gehen raus an den Christian. Ich hoffe, ich darf hier Leute grüßen. Ja, also das ist dann, da geht es dann so an die Stellschrauben, die man bei einer regulären Tastatur, die man so, keine Ahnung, beim Elektrohändler kauft, nie in Betracht ziehen würde. Wenn du dir irgendwie aber eine Tastatur kaufst, wo du selber entscheiden kannst, was für Schalter du reinbaust, mit welchen Druckstärken und mit welchem Klang und mit welcher Haptik, dann fällst du da immer tiefer in dieses rabbit Hole rein und dann sitzt du da und überlegst, welche Druckstärke dein Schalter haben soll, wie sich deine Keycaps, also deine Tastenkappen anfühlen soll, welche Winkel die Tastenkappen haben sollen, welche Buchstaben auf den Tastenkappen drauf sein sollen, ob das Kuh wirklich oben links sein soll oder dann doch eher unten rechts. Und so fällt es immer weiter, immer weiter, immer weiter in diesen unfassbar endlosen Kaninchenbau rein und es verliert einfach nicht an Faszination. Das ist auch ein Punkt, den ich wunderbar toll finde an diesem ganzen Hobby. Ich mache das jetzt schon eine ganze Weile und jedes Mal, wenn ich denke, okay, ich bin ganz unten angekommen, tut sich halt trotzdem irgendwo wieder eine Tür auf und du fällst noch tiefer rein.",
            "start": 611234,
            "end": 762230,
            "confidence": 0.91774297,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du hast schon ganz viele Begriffe genannt, auf die wir gleich noch mal ein bisschen eingehen. Zur Vorbereitung habe ich mich gefragt, wie viele Leute benutzen eigentlich eine mechanische Tasse? Ich hatte ja schon im Intro erwähnt, dass ich bei jedem Arbeitgeber mindestens einen Arbeitskollegen hatte. Sie waren wirklich in der Tat meist männlich, die dann ein mechanisches Keyword hatten. Und deswegen habe ich mich gefragt, wie viele Leute benutzen das eigentlich und wo kann man das besser erfragen als auf Reddit? Da bin ich natürlich auf Reddit gegangen, habe da nur eine Umfrage gemacht und habe die Frage gestellt, nutzt du eine mechanische Tastatur? Und die Antwortmöglichkeiten waren, nein, ich nutze keine mechanische Tastatur. Ja, ich nutze eine fertig gekaufte mechanische Tastatur. Ja, ich baue sogar meine mechanische Tastatur selber und ja, ich baue sogar meine eigenen Switches. Was das sind und was man da machen muss, kommen wir gleich noch zu. Und 70 %. Also ich habe 260 Antworten bekommen, bis ich gesperrt wurde und aus dem Subreddit gebannt wurde. Das sei dahingestellt, aber bis zu dem.",
            "start": 762350,
            "end": 819876,
            "confidence": 0.9058342,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Zeitpunkt, das ist ja dein Lieblingssport, weil alle, die den Podcast schon länger verfolgen, wissen ja, dass du so schrittweise aus allen Reddits langsam gesperrt wirst. Und jetzt hast du es geschafft, aus dem EDV Reddit, deutschen Subreddit rauszufliegen mit einer Umfrage. Also du machst das wirklich sehr gut, Andy.",
            "start": 819908,
            "end": 836330,
            "confidence": 0.885595,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich weiß auch nicht, ich hake das unter dem Punkt, wenn man Leuten Macht gibt ab. Aber wie dem auch sei, 260 Antworten habe ich in relativ kurzer Zeit bekommen, bis der Mod dann von dem Subreddit um die Ecke kam.",
            "start": 837190,
            "end": 847486,
            "confidence": 0.9542959,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Plus viele Antworten.",
            "start": 847558,
            "end": 848790,
            "confidence": 0.81829,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ja, viele Antworten auch. 70 % haben gesagt, ja, ich nutze eine fertig gekaufte mechanische Tastatur. Also 180 Leute. Und das muss ich schon sagen, ist schon heftig. 20 Antworten, also ein bisschen irgendwie, was sind das dann? Sechs, 7 % sagen, die bauen ihre Tastaturen selber und drei von den 260 bauen sogar ihre Switches. Aber 70 % finde ich schon eine extrem große Verbreitung. Ich meine, Philipp, du bist jetzt in deiner, ich würde mal sagen, mechanischen Tastatur Bubble. Ist da die Verbreitung 100 % oder sind da auch sehr viele Neulinge? Oder wie würdest du denn mal, wenn du mal versuchst aus deiner, aus deiner Echokammer rauszukommen, wie würdest du die Verbreitung von mechanischen Tastaturen sehen?",
            "start": 848870,
            "end": 888816,
            "confidence": 0.89114755,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, das ist ganz schön interessant, weil ich habe mir die Frage auch schon öfters gestellt, gerade so in den allerersten Episoden, die ich mal aufgenommen habe, taucht immer wieder auf, also meine Frage taucht dann immer wieder auf, mal so diese ganze, dieses ganze Hobby wenigstens mal so auf Deutschland einzuschätzen, wie groß wirklich ja diese, diese Keyboard Bubble in Deutschland ist. Das ist unfassbar schwer zu sagen. Also ich glaube, ein Großteil der Menschen tippt auf mechanischen Tastaturen, ohne es zu wissen. Das glaube ich relativ oft. Also gerade in der Gaming Szene ist das glaube ich, relativ verbreitet. Da kauft man sich, fragt mich mal nach Markennamen, Corsair und wie sie alle heißen, Glorious, ich mal, sind ja alles mechanische Tastaturen. Ich glaube, die Leute sind dann auch mit diesem Endprodukt einfach zufrieden, was sie da gekauft haben, ganz klar. Kaufen es aber wahrscheinlich einfach nur, weil Gaming Tastatur draufsteht. Haben da noch nicht mal so diesen Anspruch an die Mechanik, sondern Vertrauen aufs Marketing. Würde ich jetzt mal böse unterstellen. Natürlich. Es ist ganz, ganz schwer zu sagen. Also ich würde sagen, von allen Menschen, die in Deutschland Computer benutzen. Oh, das ist schwer. Ich würde sagen, die Hälfte tippt auf mechanischen Tastaturen, die andere Hälfte nimmt Low profile Tastaturen, gerade Marke Apple, oder? Ja, man muss es leider sagen, die 15 Microsoft Tastaturen für €15 werden auch ganz, ganz oft verbreitet sein, denke ich mal. Aber ich denke, 50 % der Menschen benutzen mechanische Tastaturen. Von diesen 50 % würde ich vielleicht sagen dreiig % bewusst und von diesen dreiig % dann vielleicht noch mal die Hälfte dann auch wirklich tiefer greifen mit selbstgebauter Tastatur und kleiner Prozentsatz selbstgebaute Switches, gemoddete Tastaturen und alles drum und dran. Es ist schwer in Zahlen zu fassen. Ich habe es, ich habe es oft probiert. Ich habe es bis jetzt leider nicht geschafft.",
            "start": 888898,
            "end": 976344,
            "confidence": 0.9175625,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wäre vielleicht mal so ein Research Projekt, dass du vielleicht an so ein Institute rantritt oder vielleicht an Heise, mit dem Heise Verlag da irgendwas machst. Das finde ich, glaube ich mal wirklich interessanter machen.",
            "start": 976392,
            "end": 985156,
            "confidence": 0.823394,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, Heise, falls ihr zuhört, ich habe da Ideen.",
            "start": 985188,
            "end": 987800,
            "confidence": 0.79867,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt habe ich mich zur Vorbereitung auf diesem Podcast natürlich auch mit deinen Podcast Episoden beschäftigt, weil du hast unter anderem eine sogenannte Basics Podcast Episode und ich würde dich bitten, dass du mir oder dem Wolfgang auch mal, weil wir sind einfach totale Noobs, mal erklärst, wie so eine Tastatur aufgebaut ist. Du hast schon ein paar ein paar Keywords gedroppt. Keycaps, Shifts, Alpha Keys. Du hast was von einem 60 % Keyboard erzählt. Kannst du uns mal einen generellen Abriss geben, wenn du jetzt eine Tastatur selbst baust, welche Teile hat man in der Hand? Baut man da auf? Ich sag mal vielleicht von außen nach innen, dass man, dass man halt, wenn man jetzt gerade vor seinem PC hockt, dass man auf seine Tastatur schauen kann und sagen kann okay, das ist ein Keycap und so weiter und so fort, dass du uns da mal einen Abriss gibt.",
            "start": 988660,
            "end": 1036834,
            "confidence": 0.8851102,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube, das kann man glaube ich so ganz gut an einem Ja, stellt euch vor, ihr wollt eine Tastatur kaufen. Ich glaube, das trifft es am besten, wenn ihr nicht dieses komplette Pre Build Tastatur Ding haben wollt. Wenn ihr sagt okay, ich werfe jetzt da Geld hin, gebe mir eine fertige Tastatur, sondern ihr sagt okay, ihr wollt schon ein bisschen was ausgefalleneres haben. Quasi geht ihr so zu dem Shop eures Vertrauens und sagt okay, kaufen wir eine Tastatur. Das erste, die erste Frage ist natürlich ja, das Keyboard Layout an sich, was ihr haben möchtet. Ich denke so die typische Full Size, das sind in Deutschland 104 Tasten, 103 bis 104 Tasten, also mit einem schönen großen Enter, mit einem QWERTZ Layout, also dass das Z in der oberen Reihe und das Y in der unteren unterscheidet sich zu einem US Layout, ganz klar, da ist auch das Enter ein kleines bisschen anders. Ich denke, das jetzt näher zu erklären, welche Tasten da unterschiedlich sind, googelt euch, das ist glaube ich das einfachste. Da seht ihr so die die groben Unterschiede zwischen den einzelnen Layouts. Ist glaube ich so der erste Schritt. Möchtet ihr eine komplette Full Size Tastatur 100 % haben, also das ist auch der der Spot, von dem man ausgeht bei Tastaturen, das sind 100 %, die.",
            "start": 1036882,
            "end": 1095308,
            "confidence": 0.899603,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "104 Tasten, wobei das jetzt noch keine mechanische Tastatur ausmacht, oder ich kann ja auch verschiedene Layouts mit halbmechanischen oder hydraulischen oder was auch immer.",
            "start": 1095324,
            "end": 1103160,
            "confidence": 0.8867184,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ganz klar, das ist erstmal nur so die die Vorüberlegung, welche Größe man überhaupt braucht, ganz klar. Genau, das heißt, kann man alles noch weiter minimieren. Man kann auch auf dieses 80 % oder 75 % Layout gehen, da fehlt euch dann im Prinzip der Nummernblock auf der rechten Seite. Ich sag's mal pauschal, auf der rechten Seite. Es gibt Tastaturen, die haben den auch auf der linken Seite. Sind auch wunderschöne Tastaturen, aber ist eine andere Geschichte. Genau, dann hat man seine normalen Buchstaben, seine Function Keys, so Steuerung, Alt und den GUI Key, ich weiß gar nicht wie der Windows Key, der Mac Key, da wo das lustige Symbol eures Betriebssystems drauf ist. Genau, solche Tasten sind dann alles noch vorhanden. Ihr habt noch die Cursor Tasten und ihr habt noch oben das Entfernen und Position hoch, Position runter, solche Geschichten. Genau, kann man noch weiter minimieren. Dann wären wir dann bei 65. %. Da fehlt dann auch, da wird es ein bisschen schwammig, muss ich gestehen. Es gibt 65 % Tastaturen ohne Cursor Tasten, es gibt aber auch welche mit Cursor Tasten. Ist dann auch noch so eine kleine Präferenz, die man überlegen sollte, ganz klar. Aber gerade so Geschichten wie entfernen und das Page up, Page down fehlt da komplett. Hat manchmal noch eine f Reihe, also f bis f und ein separates Escape für die Wim User, ganz wichtig natürlich. Oder man minimiert noch weiter auf die 60, %, da ist dann definitiv kein Cursor mehr dabei und auch keine f Tasten mehr oben. Dann sind wir dabei 60. %. Wir können es noch weiter runter minimieren. Also ich kann das ganze runter minimieren auf 2, %, wenn ihr das wollt.",
            "start": 1103200,
            "end": 1185550,
            "confidence": 0.91228676,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und was bleiben dann übrig?",
            "start": 1186050,
            "end": 1187710,
            "confidence": 0.88371,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es bleiben zwei Tasten übrig.",
            "start": 1188170,
            "end": 1189690,
            "confidence": 0.931862,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Muss ich dann binär schreiben oder?",
            "start": 1189770,
            "end": 1191482,
            "confidence": 0.6143283,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Da musst du binär schreiben. Es gibt wirklich eine Tastatur mit null und eins. Gut, okay, soweit treiben wir es glaube ich nicht. Ich glaube die gängigste Größe ist noch bis 40. %. Ich glaube alles unter 40 % ist dann schon eher sehr, sehr Nische, weil alles unter 40 %. Da geht es dann auch langsam darum, Keys wegzulassen, die man essenziell braucht auf Tastaturen, die dann über Kombination zu erreichen sind.",
            "start": 1191546,
            "end": 1211650,
            "confidence": 0.89925355,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was ist Andi Tastatur? Das ist die klassische überteuerte Mac Tastatur Tastatur, die man so kennt.",
            "start": 1211690,
            "end": 1217086,
            "confidence": 0.8241669,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die kleine Magic Keyboard heißt die, glaube ich.",
            "start": 1217118,
            "end": 1219710,
            "confidence": 0.857275,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das sind dann so 65 % eher, oder? Weil da hast du.",
            "start": 1219790,
            "end": 1223182,
            "confidence": 0.97285664,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist doch so, das ist doch 100 %.",
            "start": 1223286,
            "end": 1225110,
            "confidence": 0.79083335,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ach so, das ist 100 %. Ich dachte, du hast die, diese, diese verschlankte Apple Tastatur.",
            "start": 1225130,
            "end": 1230646,
            "confidence": 0.8000225,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die, die habe ich hier auch. Und da hat man ja dann nur die sogenannten. Da hat man ja nur dann diese Elemente Alpha Keys und.",
            "start": 1230718,
            "end": 1237182,
            "confidence": 0.8975931,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, die müsste dann so 60 % oder so sein.",
            "start": 1237366,
            "end": 1239486,
            "confidence": 0.870584,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, sowas um die 60 % sind das dann. Genau. Also ich kann das komplette Keylayout von den Apple Tastaturen leider nicht. Aber so um die 60. %. Irgendwas zwischen 60 und 65 % ist, glaube ich auch so, wenn im Hobby anfängt, so der Sweet Spot, man fängt meistens so mit 60 65 % Tastaturen an. Ist einfach was anderes im Gegensatz zu 100. %. Genau. Aber man hat mal was anderes in der Hand. Genau.",
            "start": 1239518,
            "end": 1257650,
            "confidence": 0.8679292,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nach der haben mal bei mir den den Ziffernblock weggelassen bei meiner Tastatur. Und es war schon eine Umstellung. Also wenn man so sein Leben lang irgendwie gewöhnt ist, da rechts noch schnell Nummern einzutippen, das braucht eine Zeit, bis man, bis man nicht mehr im Lern tippt.",
            "start": 1257690,
            "end": 1270914,
            "confidence": 0.8460821,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das stimmt, das stimmt. Aber da kann man sich die Nummern auch auf die Home rolling ist auch ganz nett. Machen wir später, wenn wir dann so die Größe haben. Dann schaut mal, was es so gibt. Wenn man so in diesen typischen Online Shops bestellt, also nicht beim Elektronik Großhändler, sondern eher in den schon spezifisch spezifischeren Keyboard Online Shops. Dann hast du, dann stehst du vor der Auswahl an PCBs, an Cases, an Switches und an Keycaps. Größer haben wir. Das heißt, du guckst als allererstes mal, welches PCB. PCB. Ich habe es noch nicht mal geguckt, was es ausgesprochen heißt. Printed Circuit Board, glaube ich. Leiterplatten ist glaube ich, das wunderbare deutsche Wort. Eine wunderbare Leiterplatte. Das, was man kennt, wenn man Radius auseinander schraubt. Diese grünen Dinger sind bei Keyboards relativ selten grün. Die gibt es dann auch in schickem schwarz und lila und allem drum und dran. Braucht man. Das ist so das Herzstück des Keyboards, weil da sind natürlich die ganzen Leiterbahnen für die Keyboard Matrix drauf. Das heißt, dass der Computer auch erkennt, welche Taste gedrückt wird. Es sind bei diesen Sachen, die du fertig kaufen kannst, meistens auch die Mikrocontroller drauf gelötet, weil das willst du von Hand nicht selber machen, das ist alles so klein und filigran, da ja, muss man Lust drauf haben. Und du hast natürlich dein Layout drauf, dein Tastenlayout, das heißt da sind Löcher drin, wo du dann später deine Switches reinstecken. Zu den komme ich dann gleich noch. Passend zu den PCBs, also zu diesen Leiterplatten, brauchst du natürlich ein Case. Könntest du natürlich auch nackig einfach auf deinen Schreibtisch stellen ohne Case, aber die meisten Leute wollen dann doch ein Case haben, weil es doch ein bisschen schicker aussieht. Ist dann in den Online Shops meistens schon so beschrieben, dass du gar nichts falsches kaufen kannst. Steht am meisten schon dabei, passt zu der und der PCB, kannst du da reinbauen. Genau, dann hast du schon mal so dieses Barebone Keyboard. Genau.",
            "start": 1271002,
            "end": 1362318,
            "confidence": 0.8987773,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt hast du die Switches erwähnt, wie funktionieren die? Weil die sind ja irgendwo dann zwischen deinem PCB, oder?",
            "start": 1362374,
            "end": 1368854,
            "confidence": 0.91863316,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die sind. Die sind auf der PCB drauf im Prinzip. Die kommen da drauf, genau. Das ist aber ein Schritt. Switches, ich glaube, wenn man da mal so tiefer in dieses Hobby reingefallen ist und sich so entschlossen hat, gut, ich kaufe jetzt mal eine 60 % Tastatur, habe mir da alles schön zusammengestellt, dann ist so die erste Frage, die so von Neuling meistens kommt, ja und welche Switches nehme ich jetzt? Ist immer so das erste, weil es gibt Switches wie Sand am Meer. Es gibt wirklich unzählbar viele Switches und alle haben quasi unterschiedliche Spezifikationen. Wenn man am Anfang steht, man kann im Internet schauen nach Switch Testern, das sind im Prinzip Bretter mit verschiedenen switch Stärken drauf, unterschiedlichen Switch Typen. Kann man sich bestellen, kostet nicht viel Geld, aber man kann mal so ein bisschen unterschiedliche Switches austesten. Genau, die kommen dann auf die PCB drauf, werden im Normalfall sogar reingesteckt, das heißt sie sind Hotswappe, man könnte sie im Nachhinein sogar noch austauschen, wenn man merkt, die Switches sind so gar nicht mein Fall, die sind irgendwie zu taktil, zu laut, ich mag eher leise Switches. Kann man im Normalfall, man muss natürlich darauf achten, dass das PCB das auch unterstützt, einfach wieder rausziehen und neue Switches reinbauen. Genau, dann haben wir dieses Barebone Keyboard mit Switches drauf und da kommen dann natürlich oben, weil die Switches an sich, die haben oben nur so ein winzig kleines Kreuz im Normalfall, wenn es MX Switches sind. Und darauf zu tippen, tut auf Dauer weh an den Fingerkuppen. Deswegen gibt es da Keycaps und das sind diese wunderbaren kleinen Plastikkappen, die da drauf gesteckt werden oder Buchstaben und Zeichen draufstehen.",
            "start": 1368982,
            "end": 1449140,
            "confidence": 0.8840572,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also kann man eigentlich sagen, dass die Summe aus einem Switch und einem Keycap eigentlich für den Normalbenutzer eine Taste ist.",
            "start": 1449260,
            "end": 1456492,
            "confidence": 0.93264526,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "So könnte man das sagen, ja. Ich glaube, der Normalbenutzer sieht sogar bloß das Keycap als Taste, wenn er den Switch darunter gar nicht so wahrnimmt. Aber ja, im Prinzip ist das die Taste. Ja, das könnte man sagen. Genau. Und dann hat man eigentlich alles. Das ist, das ist so das, was ein Keyboard braucht, damit es funktioniert. Softwareseitig ist es mittlerweile, glaube ich, auch schon gang und gäbe, dass man da auch eine custom Firmware drauf hat. Klingt alles nerdiger als es ist. Also was man so an Firmware bekommt. Das erste, womit man den Kontakt bekommt, ist die QMK. Das ist so die eierlegende Wollmilchsau, habe ich vorhin, glaube ich, im Vorgespräch gesagt, an Keyboard Firmware. Die kann so ziemlich alles, was man sich vorstellen kann. Zweitausendein für Keyboards und sowas auf dem Keyboard drauf zu bekommen, ist mittlerweile auch kein Hexenwerk mehr. Man braucht nicht mal mehr das Terminal. Es gibt wunderbare Tools, wo man mit einem Klick sein Keyboard flashen kann im Prinzip und da eine funktionierende Firmware drauf hat und danach ein funktionierendes Keyboard. Genau. Viel mehr braucht es für ein Keyboard eigentlich erstmal gar nicht für den Einstieg. Wie gesagt, man braucht die Entscheidung, welche Größe man braucht, die Entscheidung, welcher Switch. Und ich glaube, das ist die schwerste Entscheidung am Anfang. Wobei ich sagen muss, sucht euch irgendeinen aus und geht von dem als Ausgangspunkt aus und optimiert dann in die Richtung, in die ihr gehen wollt. Ganz klar.",
            "start": 1456556,
            "end": 1519660,
            "confidence": 0.9145725,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Er mal kurz gegoogelt, was was so ein Switch kostet und korrigiere mich bitte, aber irgendwo so zwischen €0,50 und einem Euro pro Switch. Das wird dann schon.",
            "start": 1519790,
            "end": 1528112,
            "confidence": 0.89723784,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich korrigiere gern zwischen €0,20 und 2,40.",
            "start": 1528176,
            "end": 1531336,
            "confidence": 0.79371285,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Okay. Aber das, also wenn ich das mal 105 Tasten oder so rechne, das ist schon alleine für die Switches eine ganz ordentliche Summe für eine Tastatur.",
            "start": 1531408,
            "end": 1539600,
            "confidence": 0.8970215,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Definitiv. Also Switches können noch mal fast so viel kosten wie das Keyboard an sich. Das ist richtig. Wenn man High Class Switches nimmt. Allerdings. Ja, es ist so ein bisschen. Ich glaube da. Ja, es spaltet sich da glaube ich so ein bisschen die Szene. Also einerseits gibt es Leute, die sagen, es ist teilweise überteuert, dass Switches, die 2,40 kosten, den gleichen Sound und das gleiche Gefühl haben wie auch Switches, die für einen Euro erhältlich sind. Andersrum genau das gleiche. Es gibt auch Leute, die sagen, die €0,20 Switches haben ein ähnliches Gefühl oder Tippgefühl wie Switches, die für einen Euro über den Tisch gehen. Also man kann sich so richtig festmachen. Es ist wirklich reine Geschmackssache mit den Switches und man hat nur seine eigenen Lieblings Switches. Was anderes gibt es glaube ich nicht. Also Empfehlungen. Man kann sagen schau dir die mal an, ich finde die ganz cool. Aber man kann nicht sagen, das sind die Switches, die musst du haben. Das gibt es meiner Meinung nach zumindest in dem ganzen Hobby nicht.",
            "start": 1539680,
            "end": 1585278,
            "confidence": 0.92557484,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und wie unterscheiden sich jetzt diese Switches voneinander überhaupt?",
            "start": 1585334,
            "end": 1588246,
            "confidence": 0.8792056,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist wieder so eine Tür, die sie dann aufmacht, wenn du dieses rabbit Hole reinfällst. Die macht sich dann auf und denkst ja, das sind ja nicht viel Switches. Du kommst am Anfang kommst du mit Jerry in Berührung. Jerry ist so, ich glaube der größte switch Hersteller überhaupt. Alteingesessene deutsche Firma, macht Schalter seit sie zweitausendein denken können wahrscheinlich. Das sind so die basic Switches, würde ich sagen. Mit denen kommst du als alles als allererstes in Berührung. Sind always fragt mich, was für ein Kunststoff da verbaut wird. Ist nämlich auch ausschlaggebend für den Sound von Switches. Kann ich dir nicht sagen, weiß ich nicht um Kunststoffe. Ist aber ein relativ günstiger Kunststoff. Ist kein high class Kunststoff, der dann bei anderen Switches verbaut wird. Uwe MP Kunststoff z.b. ist so ein sehr weicher Kunststoff, sehr schallschlucken. Das heißt, du hast den Schalter im Switch entstehen, der schon deutlich minimierter als bei Cherry Switches. Dann kommt es auch auf die Verarbeitungsqualität an. Auch wenn Cherry das schon wahrscheinlich. Keine Ahnung. Verbaue ich mir jetzt sämtliche Wege zu Cherry. Cherry Switches werden schon sehr lange produziert, aber sie haben sehr viel Spielraum zwischen ihren einzelnen Komponenten. Kann man ehrlich sagen, ist Fakt.",
            "start": 1588318,
            "end": 1648742,
            "confidence": 0.8834367,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das heißt Spielraum jetzt in Bezug auf Qualität oder was meinst du jetzt mit.",
            "start": 1648886,
            "end": 1652862,
            "confidence": 0.9090993,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Spielraum in reiner Produktionsqualität? Ja, genau. Vielleicht noch einen Schritt zurück. Ein Switch besteht insgesamt grob aus fünf aus fünf Teilen. Das heißt, es gibt ein Gehäuse für den Switch, also Unterteil von dem Gehäuse, ein Oberteil. Es gibt diesen kleinen Stößel oder Stem genannt. Das ist das, was mechanisch nach unten gedrückt wird, was dann im Switch selber auch diese zwei Kupferblättchen zusammendrückt. Das sind die anderen zwei Bauteile. Genau. Und das Spiel bei Cherry entsteht gerade zwischen Stem und Oberteil vom Gehäuse bzw. Der Führung von dem Stem. Und dadurch, dass es da so unpräzise ist oder unpräzise ist vielleicht ein bisschen übertrieben, aber nicht ganz so präzise wie bei anderen Switches, kann es halt einfach sein, dass deine Taste wackelt. Und das willst du auf einem Keyboard, wo du vielleicht vorher so ein bisschen mehr Geld reingesteckt hast, weil das Design vom Case gefallen hat oder weil es ein ausgefallenes Layout hat, willst du das so nicht drauf haben z.B. und das sind dann so Faktoren, auf die du Rücksicht nehmen musst. Das andere ist, Switches gibt es ja auch in verschiedenen Druckstärken. Da gibt es alles von. Ich glaube, den stärksten Switch, den ich je gesehen habe, sind 270 g, was für den Alltagsgebrauch überhaupt nicht sinnvoll ist. Also ich habe es vorhin schon mal erwähnt, 150 g habe ich auf einem Keyboard verbaut und damit kannst du nicht länger als 2 Minuten tippen, bevor dir die Finger abfallen. Das ist schon so. Man muss so stark drücken, dass da ausgelöst wird, dass es keinen Spaß macht. Überleg irgendwas vergleichbares, aber ich. Mir fällt nichts ein, leider.",
            "start": 1652886,
            "end": 1732590,
            "confidence": 0.9011479,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du musst wissen, der Wolfgang ist Österreich und die meisten Österreicher klettern und bouldern und das bedeutet, die werden sehr starke Finger haben. Da stelle ich mir gerade die Frage, ob alles über 100 Ÿousand, 150, 180 g vielleicht eher was für Kletterer Bullderer ist.",
            "start": 1732670,
            "end": 1747676,
            "confidence": 0.8712569,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das ist vielleicht eine Marktlücke. Spezielle Tastaturen für Kletterer.",
            "start": 1747788,
            "end": 1751324,
            "confidence": 0.83243114,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aus dem Blickwinkel habe ich das noch nie gesehen. Das ist spannend. Das ist. Das ist cool.",
            "start": 1751452,
            "end": 1755700,
            "confidence": 0.90789473,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Okay, aber wenn wir mal so eine schwere Taste haben, also wie, wie kann ich mir das denn vorstellen? Ich habe jetzt keine Switches hier, aber muss ich also 150 g wirklich runterdrücken, bis dann Signal kommt?",
            "start": 1755780,
            "end": 1769028,
            "confidence": 0.91009974,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, bei 150 g brauchst du deutlich Kraft, um die auszulösen. Auf jeden Fall ist es nicht ganz so schwer, wie du es dir jetzt wahrscheinlich vorstellst, aber man merkt auf jeden Fall, dass du wirklich Kraft brauchst, um die Taste runter zu drücken. Ich glaube 150 g ist auch. Das ist. Ich nenne es immer Spassboard, was ich mir da gebaut habe. Das ist einfach nicht alltagstauglich, von was man ausgehen kann. Ich glaube, der gute Mittelwert bei einem Switch liegt bei 65 g. Das ist so der Standard Switch, der verbaut wird bei Tastaturen. Ist glaube ich auch so der sweet Spot bei den meisten Menschen. So 65 g, 62 g, alles so dazwischen ist glaube ich immer so ganz, ganz angenehm. Kann man gut drauf tippen. Kann lange drauf tippen, ohne dass man irgendwie sonderlich Ermüdungserscheinungen hat oder ähnliches. Genau, das ist so der Standard Tastendruck. Ich glaube, lass mich überlegen, die Apple Tastatur müsste auslösemässig irgendwas um die 40 g glaube ich sein. Das heißt ein bisschen stärkere Auslösekraft als deine Apple Tastatur. Würde ich, würde ich schätzen, ist so der der Standard bei mechanischen Tastaturen, aber geht natürlich auch nach unten. Und ich war anfangs auch immer so ein bisschen eher so die härteren Switches, habe lang auf 80 g getippt, bin jetzt mittlerweile runter auf 20 g und das spürt man auch deutlich. Ist das andere extrem zu den 150 g zweitausendein. Also mein Traum wäre jetzt noch runter auf 15 g zu gehen. Das ist dann aber wirklich, wirklich leicht und man kann die Tassen quasi per Hauchen auslösen. Ist sonst schon auch nett.",
            "start": 1769124,
            "end": 1840860,
            "confidence": 0.88444513,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber die die Switches selbst, ich meine, die kann man jetzt fertig kaufen oder man kann halt diese nächste modding Stufe gehen und kann halt sagen, man kann sich die Switches selbst auch bauen, oder?",
            "start": 1841160,
            "end": 1852008,
            "confidence": 0.9250351,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau. Würde ich glaube ich auch in zwei Stufen unterscheiden. Ja, also diese wirklichen Franken Switches hieß es mal, weil man aus mehreren anderen Switches quasi einen neuen Switch konstruiert. Ist ganz nett. Allerdings ist es auch, es ist kostenintensiv, muss man ganz klar dazu sagen. Man macht im Prinzip zwei Switches kaputt, um einen daraus zu machen. Und wenn man dann Switches hat, die irgendwie 2,40 pro Stück kosten, davon zwei kaputt zu machen für einen neuen Switch ist ein bisschen. Ja, muss man, muss man mögen. Was man glaube ich öfter sieht, ist das Tauschen der Feder. Es sind ja Federn drin, die den Stem wieder zurückschieben, damit die Taste natürlich auch wieder auslösen kann, weil ein einmaliges Auslösen bei der Tastatur relativ langweilig ist. Man möchte ja immer wieder tippen. Die Federn, die Federn kann man einzeln kaufen und so kann man seine Switches dann auch wirklich selber noch mal modden, kann da andere Druckstärken einbauen. So habe ich es z.B. gemacht, gerade mit diesen Low profile Switches, die 20 g haben. Mittlerweile gibt es die auch käuflich. Also die ganzen Produzenten sehen da auch im Markt anscheinend und produzieren Switches, die relativ leicht sind. Davor musste man einzelne Federn kaufen und die Switches einzeln aufmachen und Federn tauschen, wieder zu stecken. Genau.",
            "start": 1852104,
            "end": 1913326,
            "confidence": 0.9178455,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Noch eine Frage zum zum Kontakt, den du erwähnt hast. Also irgendwo muss ja der Kontakt geschlossen werden und der Kontakt wird im Switch geschlossen oder drückt das Switch unten auf die Platine und auf der Platine wird der Kontakt geschlossen.",
            "start": 1913438,
            "end": 1925906,
            "confidence": 0.91316074,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Auf der Platine selber hast du im Prinzip zwei Löcher. In die zwei Löcher kommen zwei Pins, die aus dem Switch unten rauskommen. Genau. Und diese zwei Pins, die aus dem Switch unten rauskommen, also aus dem Schalter, die werden nach innen geführt in den Schalter rein. Und in diesem Schalter drin sind dann die zwei, ja genau, die zwei Kontaktpunkte im Prinzip. Die zwei Kontakte, genau. Die dann zusammengeschoben werden. Genau. Und dann passiert dann im Switch drin die Auslösung.",
            "start": 1926058,
            "end": 1947074,
            "confidence": 0.91270643,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Weil bei so einer klassischen Folientastatur oder sowas, da hast du ja den Gummi mit diesen Ÿousand, keine Ahnung, Metallplättchen innen drin und du drückst dann das Metallplättchen auf dem PCB im Prinzip und schließt Klavier dann auf dem PCB den Kontakt. Und in dem Fall ist der Kontakt Schluss im Switch.",
            "start": 1947122,
            "end": 1963520,
            "confidence": 0.88817847,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau. Genau, der ist im Switch selber drin.",
            "start": 1963600,
            "end": 1965392,
            "confidence": 0.8204875,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt gibt es den Mythos, und das hatte ich auch im Intro erwähnt, dass die mechanische Tastaturen immer sehr laut klicken. Und jetzt haben wir im Vorgespräch auch schon festgestellt, dass man deine Tastatur einfach gar nicht hört, Philipp.",
            "start": 1965456,
            "end": 1976592,
            "confidence": 0.96478283,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und du hast nicht aufgepasst, Andy. Du hast das falsche Plastik, zweitausendein. Du brauchst ein weicheres Plastik.",
            "start": 1976736,
            "end": 1981398,
            "confidence": 0.8653023,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ja, oder so. Aber ich habe auch durch dich gelernt, dass es Switches gibt, die noch mal einen extra Klick haben. Ist das richtig? Also das bedeutet, du kannst eine laute Tastatur, wenn du möchtest, noch lauter machen.",
            "start": 1981534,
            "end": 1992862,
            "confidence": 0.9414431,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Auf jeden Fall. Auf jeden Fall. Also man kann, man kann Tastaturen richtig, richtig laut machen. Ja. Also prinzipiell gibt es drei Arten von Switches. Es gibt die linearen Switches, das unterscheidet sich auch so ein bisschen am Gefühl des Tippens selber. Also lineare Switches, da geht ein Stem völlig ohne Widerstand einfach komplett unten bis unten durch, bis in den Gehäuseboden, bis zum Auslösen. Völlig ohne Widerstand, ohne Klick, ohne irgendwas. Dann gibt es taktile Switches, die haben nicht unbedingt einen Klick, die können auch ganz, ganz leise sein, aber du spürst beim Tippen selber in der so circa in der Mitte nach 2 mm so einen kleinen Widerstand. Und das ist im Prinzip der Auslösepunkt vom Switch. Und da ist ein kleiner haptischer Widerstandspunkt, der Tactile Bump nennt sich das Ganze. Und den spürst du nur und hörst ihn aber unter Umständen nicht. Es gibt auch taktile Switches, die man hört und und noch einen Schritt weiter sind dann die clicky Switches. Und da ist dann noch mal sogar eine extra Mechanik mit eingebaut, dass die noch mal ordentlich klick machen. Genau.",
            "start": 1992926,
            "end": 2045102,
            "confidence": 0.91209173,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Gibt es denn schon mal so 1 db Messung? Also ich kenne das immer so, also wenn du eine Kettensäge startest, dann hast du so, weiß ich nicht, so 80 bis 100 dB. Hat das mal eben auch Spaß gemacht, so die lauteste Tastatur irgendwie so Dezibelmesser daneben?",
            "start": 2045206,
            "end": 2057294,
            "confidence": 0.8885529,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das ist eine gute Frage. Wäre mir nicht bekannt, müsste ich dann aber nachher im Anschluss auch gleich recherchieren, weil das will ich auch wissen.",
            "start": 2057382,
            "end": 2062454,
            "confidence": 0.9441656,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber hat das irgendwie einen Sinn dieser Klick oder ist das einfach persönliche Präferenz?",
            "start": 2062542,
            "end": 2067574,
            "confidence": 0.79532355,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ist glaube ich, persönliche Referenz. Also es gibt Switches, die wohl relativ nah am Auslösezeitpunkt auch den Klick haben. Das heißt, man könnte durch Audio Feedback im Prinzip hören, wann der Switch auslöst. Aber meines Wissens nach ist es nie so präzise am Auslösepunkt des Switches selber dran, dass man es rein von diesem Audiosignal wirklich sagen könnte, jetzt hat der Switch ausgelöst. Also da ist immer so ein kleines bisschen, so ein kleines bisschen Versatz drin. Entweder ist der Klick zu früh oder der Klick zu spät. Und deswegen ist es glaube ich, reine persönliche Präferenz. Also ich glaube, der lauteste Switch, den es gibt, sind von Kyle heißen die Navy Blues. Das ist der lauteste Klick, den es in einem Switch gibt. Die haben sogar das Ding, was da drin verbaut ist, heißt clickbar. Normalerweise ist der Klick, der in dem Switch passiert ist, nur ein kleines Stück von diesem, von diesem Kontakt, der wieder zurückspringt danach. Die Clickbar ist nochmal eine separate kleine, wirklich eine winzig kleine Bar, die das Ganze noch mal viel lauter macht und viel, viel weiter nach außen trägt auch. Also ist eine interessante Mechanik. Ich habe es bis jetzt nicht ganz durchschaut, aber Clickies sind auch nicht meine, meine Präferenz, muss ich sagen.",
            "start": 2067702,
            "end": 2128518,
            "confidence": 0.8787572,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es gibt ja auch wirklich Büros oder Firmen, die zweitausendein mechanische Tastaturen verbieten, genau aus dem lautstarken Grund. Aber wie wir jetzt wissen, hat es nichts mit der mechanischen Tastatur zu tun, sondern nur was du für eine Tastatur verwendest.",
            "start": 2128534,
            "end": 2141924,
            "confidence": 0.906339,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Auf jeden Fall.",
            "start": 2142012,
            "end": 2142660,
            "confidence": 0.9917967,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber ich kenne das schon. Es ist teilweise, also ich kann mir das auch erinnern, hatte selber die Diskussion, wie ich mal lied war in dem Team. Das hat schon viele Leute gestört. Ja, also da hatten wir schon ein paar Konflikte diesbezüglich.",
            "start": 2142740,
            "end": 2155156,
            "confidence": 0.91284186,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Auf jeden Fall. Ich glaube, wenn du da wirklich mit Menschen um dich rum tippst und dann wirklich, wirklich laute Tastaturen benutzt, es kann unschön sein und ablenken, definitiv. Aber es liegt wie gesagt eher an der Präferenz des Benutzers oder der Benutzerin und wie das Keyboard gebaut ist und nicht an dem Keyboard selber. Das Keyboard kann nichts dafür.",
            "start": 2155228,
            "end": 2170444,
            "confidence": 0.9313433,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Bei dem Thema Switches bin ich auch über die Stichwörter bounce time und debounce gestoßen. Kannst du mir da mal helfen, diese Begriffe einzuordnen?",
            "start": 2170572,
            "end": 2178396,
            "confidence": 0.8585571,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Da bin ich halt voll der Noob, muss ich ganz klar sagen. Die Bounce Time ist aber glaube ich was, was du dann eher in der Firmware konfigurieren kannst, wenn wir jetzt das gleiche meinen. Vielleicht kannst du es mir erklären, was du bei der Recherche gesehen hast.",
            "start": 2178468,
            "end": 2191290,
            "confidence": 0.93258375,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wenn ich das richtig verstanden habe, geht, geht es bei der Bounce Time und die Bounce Time unter anderem auch, wann das Signal abgesendet wird und bei der d Bounce, wann die Taste zurückkommt, damit man das wieder die Taste erneut betätigen kann. Und halt, da geht es wirklich nur um Auslösezeiten des Signals, wenn ich das richtig verstanden habe. Und bei der d Bounce Time wäre dann z.B. gaming Tastaturen vielleicht da, wo es um wirklich knallharte Reaktionszeiten geht, ein Anwendungsfall. So habe ich es festgestellt. Und jetzt stelle ich mir gerade die Frage, ist das ein Thema für den Switch? Weil im Endeffekt ja schon irgendwie. Ist das vielleicht ein Thema für die Firmware, ab wann dort ein Intervall abgefragt wird? Oder ist das sogar noch auf mechanischer Ebene mit dem Kontakt mit dem PCB?",
            "start": 2192070,
            "end": 2238070,
            "confidence": 0.8749357,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Kann man auch wieder aufsplitten? Also im Kontakt mit dem PCB, wenn du normale MX Switches benutzt oder auch die Low profile Switches, eher nicht. Was man da beachten müsste, wenn man sich eine Tastatur zusammenstellt, ist glaube ich der Travel, den der Switch zurücklegt, bis er auslöst. Ich glaube, das ist immer so der, der die Spezifikation, die angegeben wird bei den Switches. Du hast ein total travel, das heißt dein Travel wirklich von, wenn der Switch nicht berührt wird, bis du ihn komplett durchgedrückt hast, ist bei MX Switches glaube ich bei 4 mm. Und es gibt den Pre Travel, das heißt der Weg bis dahin, wo du auslöst. Aber jetzt frag mich mal, wie weit der ist. Ich glaube bis knapp zur Hälfte, 2,1 mm, wenn ich es richtig im Kopf habe.",
            "start": 2238190,
            "end": 2274362,
            "confidence": 0.90449053,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich hatte gerade eine Seite offen, der war 2 mm oder so.",
            "start": 2274426,
            "end": 2277474,
            "confidence": 0.9152358,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Oh Gott, ich mache das zu lang, dieses ganze Thema. So wird es zumindest auf mechanischer Ebene gehandhabt. Dann gibt es aber noch, es gibt noch spezielle Switches. Es gibt Hall Effekt Switches. Ist eine ganz, ganz andere Geschichte. Ist im Prinzip, soweit ich weiß, auch nicht wirklich mechanisch. Da geht es dann um Magnetismus, da kannst du es dann auch auf Firmware Ebene einstellen wann dein Switch auslöst, ob er einzeln auslöst pro Tastendruck, ob er mehrfach auslöst pro Tastendruck, all solche Geschichten. Das ist dann aber irgendwie höhere Physik mit also da habe ich noch nie einen Anspruch dran gehabt. Also es war das war mir dann immer so ein bisschen zu hoch. Also so Hall Effekt Switches und so das brauche ich glaube ich nicht wirklich. Also es gibt verschiedene Faktoren an denen man es ausprobieren kann.",
            "start": 2277562,
            "end": 2315398,
            "confidence": 0.91321105,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt jetzt wenn wir mal wieder ein paar stufen nach oben wandern, also von von dem layern der in der in der tastatur und und zu den keycaps kommen, was ja sehr beliebt ist oder wenn man so nach mechanischer tastatur sucht ist dass es extrem bunt immer alles wirkt. Also ich habe vor mir eine ganz schwarze Tastatur, eine einfache liegen, aber irgendwie mechanische scheinen immer bunt zu sein. Ist es was hat es mit dem auf sich?",
            "start": 2315494,
            "end": 2340646,
            "confidence": 0.8776886,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ist glaube ich auch so eins von den Faktoren auf die man stößt. Also man ist nicht gezwungen irgendwie so die Tastatur zu nehmen die man so im Laden angeboten bekommt, sondern man hat auch wirklich die Möglichkeit sich farbenfroh auszuleben an den ganzen Tastaturen. Muss man nicht. Es gibt auch wirklich also dieses Standard Office beige farbene wie man es von so alten IBM Tastaturen vielleicht kennt mit schwarzen Zeichen drauf gibt es, kann man alles neu kaufen, gar kein Thema. Kann man alles schön klassisch grauen beige haben, aber man kann es auch bunt haben wie du sagst. Also eine ein Keycap Set, das ist wunderschön mit einer Mono Font als Buchstabengröße und darunter als binär noch mal den gleichen Buchstaben in gelb, also als Binärfolge quasi. Sieht cool aus, aber ich würde halt nie auf die Binärfolge schauen um zu wissen welchen Buchstaben ich tippe. Es ist wirklich so rein rein fürs Auge ganz klar. Es gibt viele Leute die treiben so echt bunt, aber es gibt auch viele Leute die lassen es sehr sehr schlicht.",
            "start": 2340718,
            "end": 2389448,
            "confidence": 0.90421236,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und bietet dann einfach Jerry ganz viele Farben und Fonts und alles an oder woher bekomme ich diese Caps?",
            "start": 2389504,
            "end": 2396712,
            "confidence": 0.9245279,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist dann so ein bisschen ja die Schattenseite des Hobbys würde ich mal sagen. Also ich glaube wovon ich mich am Anfang verabschieden musste ist, dass es so dieses Keycap Set gibt, was ich haben will. Das gibt es glaube ich so prinzipiell erstmal nicht. Als allererstes muss man mal schauen was gibt es und was kommt davon an ehesten so in den Geschmack den ich habe. Das ist glaube ich immer so ein bisschen die Geschichte. Die wirklich bunten, bedruckten, ausgefallenen Keycaps Sets gibt es eigentlich nur in so in Group Bias nennt sich das Ganze. Ist ja eine Sammelbestellung. Ich glaube, man kann es als Sammelbestellung bezeichnen. Es gibt Designer, die sich wirklich darauf spezialisiert haben, Keycaps Sets zu designen. Es sind kleine Designer und es sind auch in relativ kleinen Auflagen werden diese Keycapsets produziert. Das wirkt wirkt immer relativ groß alles, sind aber wirklich relativ wenig Keycapsets. Also ich habe mal bei einem Keycap Set Zahlen gesehen, da geht es um 2500 Stück und das ist glaube ich bei einem Keyboard Markt, also wirklich bei einem Eingabegerät, was für Computer wichtig ist, essentiell, ist das nicht viel. Und manche haben da wirklich Probleme auch die 2500 Stück an diesen Komplettsets mit Keycaps loszuwerden und bleiben dann drauf sitzen. Genau ist und da gibt es dann.",
            "start": 2396776,
            "end": 2463006,
            "confidence": 0.8633498,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Firmen, die mir das drucken können oder halt bedrucken oder herstellen.",
            "start": 2463118,
            "end": 2468148,
            "confidence": 0.9138291,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es gibt auch wieder eine deutsche Firma, GMK heißen die, die sind so führend für wirklich high class Keycaps. Da kannst du dann als ja als Designer oder als Designgruppe kannst du hingehen und sagen ja, wir hätten hier 2500 Leute, die könnten sich vorstellen, dieses Keycaps zu kaufen. Wir gehen jetzt mal in Produktion, wir gehen in Vorkasse, produzieren das Ganze und werfen das Ganze dann auf dem Markt und hoffen auch, dass die Leute, die vorher gesagt haben, wir würden das gern kaufen, auch wirklich das Ganze kaufen und man als Designer oder als designer Gruppe oder wie auch immer nicht auf den Kosten hängen bleibt. Ganz klar. Prinzipiell so GMK, die machen auch so Keycaps für Supermarktkassen und Supermarktkassen sind meistens auch mechanische Switches drunter. So was produziert GMK hauptsächlich, aber die haben halt eben diese diese Spritzgussanlagen und alles drum und dran. Und wenn man damit eine gewissen Menge hinkommt und sagt, ich nehme die 2500 Sets ab, dann stellen ihre Maschinen so ein und dann produzieren die auch bunte Keycaps, die cool aussehen.",
            "start": 2468334,
            "end": 2521306,
            "confidence": 0.9144804,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also wenn ich nur für meine, für mich und meine zwei Freunde ein eigenes Set haben will, das wird dann schwierig, oder? Also das sind dann schon höhere Bestellmengen, die man da auffahren muss.",
            "start": 2521378,
            "end": 2531758,
            "confidence": 0.8793309,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn man das in einigermaßen, ich sag mal marktreifen Qualität haben will, dann ja seit kurzem, es ist wirklich noch nicht lang, ich habe Anfang des Jahres erst davon gehört, gibt es mittlerweile so zwei Firmen zumindest oder zwei Anbieter, die das ganze auch wirklich richtig custom machen. Das heißt, du kannst da sagen ich habe mein Keyboard sieht so aus, ist eine full size, ist eine 60, %, ist eine split Tastatur Ÿousand und ich möchte mir selber key caps dafür Design machen, die dann zahlst du für ein normales Set liegst du dann glaube ich bei 60, wenn ich es richtig im Kopf habe. Ich habe für meine GR habe ich $60 gezahlt. Und dann kannst du dir zumindest aus vorgegebenen Farben, kannst du dir Keycaps aussuchen. Da wird dann in auch vorgegebenen Farben, je nachdem was sie natürlich da haben, werden deine Zeichen drauf gedruckt. Du kannst sagen, welches Zeichen wo ist. Also es ist mittlerweile seit kurzer Zeit ist es möglich, auch für ein erschwingliches Geld einzelne Sets produzieren zu lassen. Und wie ich finde, mittlerweile auch in einer guten Qualität.",
            "start": 2531854,
            "end": 2580596,
            "confidence": 0.916138,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber machst du dann dieselbe Form? Also haben die dann alle dieselbe Form oder kannst du bei der Form auch noch was machen? Oder ist es meistens nur Farbe und Font und was drauf gedruckt?",
            "start": 2580708,
            "end": 2591128,
            "confidence": 0.9517926,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also Farbe und Font auf jeden Fall. Das kannst du frei auswählen. Vom eigentlichen Keycap Profil sind wir wieder bei Profilen, ist immer ein Profil. In diesem Hobby ist es mittlerweile auch ein kleines bisschen weitläufiger. Also was man standardmäßig auf Tastaturen drauf hat, ist das Cherry Profil. Also wirklich auch nach dem Hersteller benannt. Es ist so in sich, wenn man es im Querschnitt anschaut, so ein kleines bisschen gewölbt in sich. Das ist so ein kleines bisschen ergonomisch vortäuscht, sag ich mal. Das ist so das Standard Set, was angeboten wird. Geht auch mit komplett uniform Keycaps, funktioniert auch. Da ist jedes Keycap gleich, da gibt es keine Wölbung. In den Keycaps ist dann alles, alles, alles eben, wenn man das im Schnitt sieht. Genau, es ist schon ein bisschen weitläufiger geworden. Früher war es dann meistens nur das Cherry Profile.",
            "start": 2591184,
            "end": 2633980,
            "confidence": 0.906732,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und ich meine, es gibt ja auch Tasten, die haben jetzt eine kürzere Leertaste, z.B. die ist ja dann nicht immer 9 cm, 10 cm, ich weiß jetzt gar nicht, was man hier hat. Aber da gibt es ja auch kleinere Leertasten, kleinere Enter Tasten und so weiter. Ÿousand, oder?",
            "start": 2634060,
            "end": 2645874,
            "confidence": 0.844282,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau, das auf jeden Fall. Da kommen wir nämlich auch wieder zu dem Punkt, welches eigentliche Tastaturlayout man benutzt. Englisches, deutsches und so weiter. Allein die Enter Taste unterscheidet sich schon. Und das ist immer so ein bisschen auch der Knackpunkt bei diesen Group Weiß. Sie sind zu 99 %, würde ich sagen, auf amerikanische Tastaturlayouts gemünzt. Das heißt, so als deutscher quer Benutzer stehst du eh meistens ganz schlecht da, weil du nie eine oder ganz, ganz selten mal eine große Enter Taste bekommst. Manchmal gibt es Zweitausendein, die dann zahlt man aber auch wieder extra für ein extra Kit. Die ganzen Grouper sind meistens so aufgebaut, dass du einzelne Kids hast. Das heißt, du hast deine Alphatasten, deine Buchstaben separat, du hast deine Modifier, also Steuerung alt, den FN Key, solche Geschichten separat in dem Kit und so summiert sich das dann alles hoch. Deswegen auch der kleine Disclaimer am Anfang, wenn man in so einen Group By reinfällt, dann ist man da halt ganz ganz schnell mal irgendwie so €250 los, nur für Tassen. Und das ist glaube ich nicht zu unterschätzen.",
            "start": 2645962,
            "end": 2699048,
            "confidence": 0.8867341,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und Group by heißt, du sammelst dich auf einer Plattform, also tust dich zusammen auf einer Plattform und musst dann vorab schon zahlen wahrscheinlich. Und bis dann die Menge an Leuten zusammengekommen ist, dann wird es wirklich erst hergestellt.",
            "start": 2699104,
            "end": 2711156,
            "confidence": 0.87873614,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vor allem im Prinzip. Genau, also bei den meisten Groupbuys läuft es so ab, je nach Plattform. Also ist mittlerweile auch zum Glück ein kleines bisschen breit gefächerter. Das war, als ich angefangen habe mit dem Hobby, gab es zwei Foren. Es war einmal Geek Hack, das ist so ein, wenn man das anschaut, ganz ganz ganz ganz hässliches Forum, erinnert so ein bisschen an die er Jahre an sich, nicht alle, die Discosforen finde ich eigentlich ganz hübsch, denn das zweite, was ich gleich sage, ist auch ein Discourse Forum und das ist Keep Talk. Das waren so die Anlaufstellen für Group Buys im Prinzip, aber mittlerweile ist es auch so ein kleines bisschen aufgefächerter. Auf Discord rennen ganz ganz viele Keyboard Server rum, wo man sich anmeldet, drin ist und auf einmal sagt einer, ah ich habe Lust sowas zu produzieren, hat noch jemand Lust? Und da ist man dann im Prinzip schon beim zweiten Schritt von Group By, dem Interest Check. Also erstmal gucken, ob es überhaupt Leute gibt, die sowas kaufen. Ich denke jeder wird irgendwann mal in diesem Hobby so an diesem Punkt sein und denkt so, ich mache mein eigenes Keycap Set, ich kann das eh am besten, meine Idee ist großartig. Dann sitzt du da, designs und machst und tust und zeigst das Leuten. Genau. Und mit ein bisschen Glück gibt es Leute, die sagen, ja das hast du gut gemacht, würde ich kaufen. Und dann guckst du so, wie viele Leute du zusammen kriegst. Und früher war es dann so, dann brauchst du halt diese Mindestabnahmemenge, dann haben die Leute gezahlt in diesem Group bei, dann ging das ganze in Produktion, hattest wenn du Glück hast, jemanden, der das ganze einigermaßen transparent gehalten hat, wenn du Pech hattest halt nicht. Dann hast du irgendwie mal für drei Jahre lang nichts gehört von dem und hast ihm aber mal €300 überwiesen. Sind aber ganz nett, gab leider auch schon Menschen, die das einfach nie wieder gemeldet haben. Dann war das ganze Geld dann weg und es ist halt bei 2500 Keycapsets zu je €300 schon eine ganze Stange Geld, die dann einfach mal weg ist. Ganz klar. Aber ich würde sagen, der Großteil der Group beispielsweise lief ohne Probleme. Genau. Und dann wartest du, bist natürlich nicht gerade so der High Prio Kunde bei GMK, wenn du was produziert. Dementsprechend stehst du relativ weit hinten an und dann wartest du und so die Standard Wartezeit bei dem Group bei war irgendwie so anderthalb Jahre, zweitausendein Jahre. Und das ist dann. Ich habe dann von Menschen gehört, die gesagt haben oh, ich habe heute Post gekriegt mit Keycaps. Ich kann mich gar nicht mehr erinnern, die gekauft und das ist halt schon so ein bisschen. Ja, dieses Prinzip Group by ist so ein bisschen, bisschen schwierig.",
            "start": 2711188,
            "end": 2833908,
            "confidence": 0.88904685,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Klingt so ein bisschen wie nach misslungenen kickstarter Kampagnen.",
            "start": 2833964,
            "end": 2836588,
            "confidence": 0.7947978,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "So ein bisschen. Ja, wo du dann auch irgendwie so nach drei Jahren Post kriegst und denkst ach, was ist das? Habe ich das bestellt? Wann habe ich das bestellt? Das ist ja okay. Ja, genau sowas. Das ist richtig. Genau. Aber auch das hat sich zum Glück so ein kleines bisschen aufgelöst. Also sind nicht mehr nur so diese reinen ich muss zwei Jahre warten, habe davor €300 irgendwo hingeworfen, Groupbuys. So mittlerweile geht es auch alles so ein bisschen kleiner und gerade die d Drucktechnik hat da glaube ich einiges zu beigetragen. Also so Resin Druck und solche Geschichten bringt wunderbare Keycaps hervor. Vielleicht noch nicht so die bedruckten bzw. Die mit den ganzen Symbolen drauf, sondern eher erstmal so die Blacks, also ohne, ohne irgendwelche Symbole, aber in wunderbaren Profilen. Dann hast du wunderbare Wölbungen in deinen Keycaps, fühlen sich wunderbar geschmeidig an und es ist bezahlbar und es ist wirklich relativ schnell und easy sie bestellt und auch geliefert. Also ich habe selber mal über meine Zuhörer innen eine kleine Group beigemacht mit Low profile Keycaps. Die sind aus Nylon gedruckt und haben eine ziemlich abgefahrene Oberfläche. Die sind sehr rau, fühlt sich ein bisschen an wie Sandpapier, wenn man die benutzt. Und wir haben davon. Ich habe einfach mal gefragt, ob jemand mitbestellen möchte, weil die kann man bei einem Großhändler in China kann man die relativ günstig bestellen und habe gefragt, wer mitmachen möchte. Hat sie dann relativ schnell eine kleine Gruppe an Menschen gefunden, die auch welche haben wollten, zumindest mal ausprobieren. Und so hast du dann verteilt kleine Group bis. Es muss ja nicht immer irgendwas Großes sein, sondern es geht auch kleiner mittlerweile. Und das ist, weiß ich auch zu schätzen, dass das nicht mehr so diese alteingesessenen drei Jahre Wartezeit Group bei sind.",
            "start": 2836684,
            "end": 2919480,
            "confidence": 0.8883879,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ist auch was tolles an alle Leute, die uns gerade zuhören ihr könnt uns ja nicht sehen, wir machen ja kein Video Podcast. Aber das ist total lustig. Ich grinse mir die ganze Zeit einen weg. Der Philipp spricht die ganze Zeit von den Keycaps und Rau und wie die aufgebaut sind mit der Wölbung und so weiter. Und der Wolfgang schaut dann immer runter auf seine Tastatur und guckt sich die Tastatur dann ganz genau an nach dem Motto, als hätte sie gerade neu und hatte sie gerade selbst gehauen. Das ist immer so schön zu beobachten.",
            "start": 2919520,
            "end": 2943250,
            "confidence": 0.9029803,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ihr habt gerade gecheckt, wie wie eigentlich der Druck bei meiner Tastatur ist, oder? Weil scheinbar ist es ja wirklich irgendwie. Ja, es macht eher so einen Eindruck, als wird es raufgeklebt, zumindest bei meiner Cherry Tastatur.",
            "start": 2943290,
            "end": 2954474,
            "confidence": 0.8331921,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Aber jetzt haben wir ja schon über die bunten Farben bei den Keycaps gesprochen und in der Vorbereitung hast du mich sehr stark zum Lachen gebracht. Denn anscheinend gibt es den Begriff der sogenannten Vomit Keyboard Ÿousand und womit, wenn man das von englischen auf das deutsche übersetzt, heißt das erbrechen. Und wenn ich Vomit Keyboards richtig verstanden habe, bedeutet das, du packst Keycaps auf dein auf dein Hackbrett, auf deine Tastatur, die eigentlich nicht zusammenpassen, sondern du nimmst eine Tüte, mixt die einfach so und nimmst dir einfach irgendwelche und hast dann komplett bunte, so wie ich sag mal ein misslungenes lego Stück vor dir liegen.",
            "start": 2954522,
            "end": 2991024,
            "confidence": 0.89359653,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Richtig, dass das trifft ganz gut. Ja, also ich glaube, man müsste es wahrscheinlich sogar noch ein bisschen salopper übersetzen als erbrochen. Ich glaube, das trifft dann eher. Ja, so ist es im Prinzip, wenn man sich mal so umschaut, wenn man so ein bisschen im Hobby drin ist, sammeln sich halt schon so ein bisschen Keycaps an und dann hast du vielleicht mal irgendwie ein Set, wo dir dann fehlt dir mal eine Taste oder da fehlt meine Taste und dann hast du ein vollständiges Set und dann weißt du man nicht mehr wohin mit den ganzen Tasten, Kappen und allem drum und dran. Hast dann aber halt Sachen, die du auch nicht wegwerfen willst. Es gibt Leute, die verkaufen Grab Bags, nennt sich das Ganze, sind große Tüten, voll mit einzelnen Keycaps, aber unterschiedlichster Art und Weise und Farben. Und ich glaube, aus dem Ganzen raus ist es so ein bisschen entstanden. Ich kann es nicht ganz nachvollziehen. Mittlerweile ist mir so der ästhetische Effekt bei dem Keyboard doch noch relativ wichtig. Aber es gibt Menschen, die machen das. Die werfen da einfach wild die buntesten Farben an einzelnen Keycaps auf dem Keyboard drauf und benutzen das auch wirklich.",
            "start": 2991072,
            "end": 3041420,
            "confidence": 0.88379514,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also bisher habe ich mir gedacht, ich weiß nicht, ob dieses Hobby was für mich ist. Aber jetzt hast du mich mit den bunten Caps. Jeder, der mich kennt, bin recht farbenfroh. Also jetzt bin ich mir wirklich am überlegen, das wäre extrem cool.",
            "start": 3041880,
            "end": 3055036,
            "confidence": 0.91304684,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich hoffe, du hast zugehört. Womit? Keyboard sind nicht unbedingt immer nur bunt, weil die Keycaps dann die gleiche Herstellung haben. Das kann auch sein, dass dein T super rau ist und dein Set halt super glatt.",
            "start": 3055108,
            "end": 3065812,
            "confidence": 0.9107959,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi, Diversity, da hast du dann alles, was dazu gibt. Das ist perfekt.",
            "start": 3065956,
            "end": 3070884,
            "confidence": 0.7552885,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, da wird so bei mir der innere Monk getriggert, wenn wenn meine Finger verschiedene Gefühle auf verschiedenen Tasten haben. Farbe, okay, da bin ich noch dabei. Aber wenn die sich an anders anfühlen, das eine ist rau, das andere ist gelasert. Dann kommt der Buchstabe vielleicht noch ein bisschen drauf und dann ist das N vielleicht noch so draufgeklebt und kommt mit der Zeit ab, wenn ich das N aufdrücke. Also ich meine, die Keycaps haben ja auch eine andere Herstellung, gehe ich mal stark von aus.",
            "start": 3070972,
            "end": 3095532,
            "confidence": 0.9200634,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi, du bist einfach ein Boomer. Das ist.",
            "start": 3095716,
            "end": 3098040,
            "confidence": 0.7799475,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Lass uns mal noch mal ganz kurz zum Thema Keyboard Layout und Form. Wir hatten natürlich schon von der Größe größte gesprochen. Full Size hast du genannt. 65, 60, 40 %, 2 % hatten wir ganz kurz darüber gesprochen. Aber du hattest auch mal einen Begriff mit dem Split Keyboard genannt. Und bei der Recherche bin ich auch über den Begriff Unibody und sogenannte Sculpt Keyboards gestolpert. Klär mich auf. Ich bin überfragt. Split kriege ich vielleicht noch hin von der englischen Übersetzung, aber ich glaube, die.",
            "start": 3099500,
            "end": 3128328,
            "confidence": 0.8651824,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Sculpted stellen wir noch ein kleines bisschen hinten an, weil die sind so. Das ist halt, das ist dann echt verschärft. Also es ist eine ganz andere Kategorie. Ja, Unibody. Unibody und Split, Mono, Monoblock. Es gibt so, es gibt so zwei Begriffe. Ich glaube, Unibody ist der richtige. Unibody ist das, was ihr vor euch habt. Unibody Keyboard ist ein Rechteck, wo Tassen drauf sind, mit dem man schreibt. Unibody Split Keyboards brechen mit der Konvention des eigentlichen Keyboards und brechen das einmal in der Mitte durch. Nicht nur die Konvention, sondern auch das Keyboard. Und dann hast du halt zwei Teile für den Keyboard und kannst dir die aber deutlich angenehmer auf dem Schreibtisch platzieren. Zweitausendein. Was so ein Keyboard an Schwächen hat. So sehr ich Keyboards auch mag, Keyboards haben viele, viele Schwächen. Unibody Keyboards führen deine Hände vor deinem Körper zusammen. Bei Split Keyboards kommt definitiv Ergonomie ins Spiel. Und wenn man den ganzen Tag. Ich glaube, ich hatte es im Vorgespräch zumindest im Pet hatte ich es mal geschrieben, Handwerker benutzen Werkzeug und die benutzen kein günstiges Werkzeug, weil sie dann schlechtes Werkzeug benutzen. Und da wir ja irgendwie alle doch den ganzen Tag vor Computern sitzen, sind ja Tastaturen im Prinzip unser Werkzeug. Ich weiß auch nicht, wer diesen Vergleich mal gebracht hat. Ich fand ihn unfassbar passend. Deswegen sollten wir schauen, dass unser Werkzeug uns auch körperlich nicht schadet, sondern eher dem Ganzen gut zuspielt. Und so ist dann irgendwann jemand auf die Idee gekommen, mal eine Tastatur aufzusplitten und die der natürlichen, dem natürlichen Handverlauf folgend auf dem Schreibtisch zu platzieren. Wenn man mal so die Arme ausstreckt, ist ja, ich glaube, es gibt keinen Menschen, der seine Arme so vor dem Körper zusammensteckt, um dann zu schreiben bzw. Um sie natürlich so zu halten, sondern die natürliche Ÿousand Handposition ist auf einer Linie mit den Schultern, würde ich mal sagen, Minimum, wenn nicht sogar noch weiter auseinander. Und ja, so sind dann im Prinzip wahrscheinlich Split Keyboards entstanden. Und das bringt, wie gesagt, die Ergonomie so ein bisschen ins Spiel, was sculpted Keyboards machen. Die übertreiben es dann natürlich so ein kleines bisschen. Die haben die Keywords dann nicht waagerecht in einer Ebene, würde ich sagen. Da komme ich dann auch an die Grenze, das Ganze in dem Audioformat zu beschreiben mit sculpted Keyboards. Sculpted Keyboards haben im Keyboard selber noch mal eine Wölbung drin. Man kann sich das im Prinzip vorstellen wie eine Halbkugel. Wie eine Halbkugel ist das Keyboard angeordnet. Das Keyword ist nicht in einer Ebene waagerecht, sondern vollzieht eine Wölbung in sich und minimiert so im Prinzip den Weg der Finger, die man hat. Solche Geschichten. Ja, das sind sculpted keywords. Das ist so, wenn man darauf schreiben kann. Ich habe Hochachtung davor. Ich habe eine hier, die ich seit anderthalb Jahren nicht fertig gebaut habe, wofür ich auch regelmäßig gerügt werde. Aber ich werde sie irgendwann fertig bauen und werde wahrscheinlich nicht drauf tippen können.",
            "start": 3128344,
            "end": 3282330,
            "confidence": 0.9051087,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also das ist wie wenn man die Tastatur, die Tasten auf einem Hügel sozusagen anordnen würde oder auf so einem Baseballabschlagplatz.",
            "start": 3282870,
            "end": 3291450,
            "confidence": 0.87974143,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "So eine kleine Erhöhung, eher andersrum. Stell dir vor, du hast eine Kugel, halbierst die, du legst die Halbkugel mit der glatten Schnittfläche nach oben und ordnest deine Tasten innerhalb dieser Halbkugel an.",
            "start": 3291750,
            "end": 3303342,
            "confidence": 0.8834806,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also sind in der Mitte ist es tiefer als aus.",
            "start": 3303406,
            "end": 3305730,
            "confidence": 0.883305,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, genau. So, dass du mit deinen Fingern in diese Halbkugel reingreifst und da drin dann tippst im Prinzip. Genau, ja, kann man auch übertreiben kann man auch anstellen, so dass deine Hände nicht mit den Fingerspitzen nach unten auf dem Schreibtisch sind, sondern angewinkelt nach innen zeigen. Sowas. Und es gibt eine Menge Stellschrauben in diesem Hobby. Genau. Aber gerade die Ergonomie ist, da bin ich dann auch irgendwann drauf hängen geblieben auf der Ergonomie, weil man merkt dann doch deutlich nach einem 8 Stunden Tag an der Tastatur, dass einem doch irgendwie die Finger wehtun, dass einem die Handgelenke wehtun, dass sie das teilweise bis hoch in den Rücken zieht, wenn du irgendwie ja doof dran gesessen bist an deiner Tastatur. Ja. Und das hat mich dann irgendwann auch auf Split Keyboards gebracht. Genau, es gibt medizinisch medizinisches Gerät als Tastatur, das ist sehr interessant. Maltron ist ein toller Hersteller.",
            "start": 3305790,
            "end": 3350358,
            "confidence": 0.90707153,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und was verwendest du jetzt als deine zu Go Tastatur, die du immer so im Standardfall verwendest oder wechselst du ständig?",
            "start": 3350414,
            "end": 3358062,
            "confidence": 0.87405336,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich wechsel schon ab und zu, aber das was so wirklich der Daily Driver ist, ist die GR bzw. CRKBD heißt das Keyboard, sind 42 Tasten. Split Keyboard ist, dass ich jetzt vorhin schon mal kurz bei uns in die Kamera gehalten hat, für die Daumen, also für jeden Daumen hat es drei Tasten im Prinzip. Genau. Und dann sechs mal drei Alpha Keys mit den Buchstaben drauf. Die sind hier allerdings auch ein kleines bisschen anders angeordnet als auf einer 15 Tastatur. Und da jetzt kommt, jetzt kommt das Impostor Syndrom. Ich weiß aber nie, ob es Column Stagger oder Row Stagger ist. Es gibt auf jeden Fall auf normalen Tastaturen diesen leichten Versatz pro Zeile nach rechts.",
            "start": 3358126,
            "end": 3394002,
            "confidence": 0.8892483,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Es ist ein Column Staggert ist das column Ÿousand und das ganze Keyboard Layout ist sogar unter der MIT Lizenz auf GitHub.",
            "start": 3394066,
            "end": 3401848,
            "confidence": 0.78653,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die GR meinst du jetzt, die ist komplett open source? Genau, die ist super, genau.",
            "start": 3401944,
            "end": 3407980,
            "confidence": 0.78463465,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Okay, verlinken wir natürlich in den Show Notes. Open Source ist schon ein gutes Stichwort. Du hast zuerst Firmwares erwähnt. Ich gehe davon aus, diese Standard Firmware QMK glaube ich ist es, ist auch Open Source, schätze ich mal.",
            "start": 3409240,
            "end": 3422200,
            "confidence": 0.8506987,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Die ist auch komplett Open Source. Müsste glaube ich, wenn ich es richtig im Kopf habe, auch mit Lizenz haben, aber da kann ich mich auch täuschen, da nagelt mich nicht drauf fest.",
            "start": 3422280,
            "end": 3428938,
            "confidence": 0.92661,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und was kann ich wirklich dann machen mit so einer Firmware? Also was ermöglicht mir die oder was für Flexibilität habe ich da dann?",
            "start": 3428994,
            "end": 3435498,
            "confidence": 0.9388579,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du kannst im Prinzip alles machen, was du dir mit dem Keyboard vorstellen kannst.",
            "start": 3435554,
            "end": 3438394,
            "confidence": 0.92442644,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nach Hause telefonieren.",
            "start": 3438482,
            "end": 3439602,
            "confidence": 0.9810233,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Jetzt muss ich kurz überlegen. Okay, das vielleicht nicht das vielleicht, ich würde es nicht zu laut sagen. Vielleicht wird es eingebaut, aber ich glaube momentan kann es das noch nicht. Vielleicht noch einen Schritt zurück. Wenn man selber Tastaturen baut, zweitausendein, kommt man dann meistens an den Punkt, dass man auch einen Microcontroller braucht. Da sind meistens Atmega zwei und dreiig. U Mikrocontroller ist ein Prozessor, muss man glaube ich gar nicht weiter darauf eingehen. Damit ist die QMK auf jeden Fall kompatibel. Es sind Mikrocontroller und die kriegt man wirklich an jeder Ecke relativ günstig und damit ist die QMK auch kompatibel. Und ich glaube, das ist auch das, was sie so weit verbreitet und so oft benutzt gemacht hat. Genau, was man damit machen kann, standardmäßig Keyboard Layouts bauen natürlich. Man kann seine Tasten definieren bzw. Man kann definieren, welches Zeichen bei welcher Taste ausgelöst wird. Sagen wir es so. Man kann Makros damit definieren. Man kann Kombinationen aus Tasten auf einzelne Tasten legen. Das heißt, du könntest ja im Prinzip eine Copy und eine Paste Taste bauen mit einer einzelnen Taste. Brauchst keine Tastenkombination mehr, mit Strg C und Steuerung v. Solche Geschichten kann man machen. Du kannst dir einzelne Layer bauen in der QMK, gerade wenn du Tastaturen hast wie die GR, die ja relativ reduziert ist von der Tastenanzahl selber, musst du natürlich ziffern, z.B. ich habe vorhin die Ziffern genannt für die Homerow. Du musst natürlich auch irgendwann mal Zahlen schreiben an dem Computer. Und da allein dadurch, dass diese sechs mal drei Layout bei der Gr gar keinen Platz hat für Zahlen, schiebst du die Zahlen auf einen anderen Layer. Das heißt, du kannst dann sagen, ich möchte mit meinem rechten Daumen z.B. den Zahlen Layer auslösen. Dann hältst du mit einem rechten Daumen eine Taste gedrückt und kannst dann mit der linken Hand Zahlen tippen. Also der shiftet im Prinzip die Funktion der einzelnen Keys durch einzelne Layer durch. Ich glaube, das trifft es am ehesten. Genau, also die Layer Funktion, das kann ich. Die QMK kann auch RGB Lichter. Für manche Leute wahrscheinlich auch ganz, ganz arg wichtig. Ich bin überhaupt kein rgb Mensch. Ich kann RGB LEDs nicht löten. Ich mache die meistens kaputt.",
            "start": 3439666,
            "end": 3547640,
            "confidence": 0.8921919,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Moment, wo habe ich LEDs? Wo sind die dann? Was kann ich damit tun? Bin überfordert, meine Tastatur ist schwarz und leuchtet nicht.",
            "start": 3548060,
            "end": 3555240,
            "confidence": 0.96354306,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Du kannst ja LEDs hinter deine Tasten bauen. Du kannst ja LEDs auf die Unterseite bauen. Du kannst dir dann ein transparentes Case drum bauen, so dass deine ganze Tastatur in Regenbogenfarben leuchtet.",
            "start": 3555980,
            "end": 3564484,
            "confidence": 0.8856597,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber in die Tasten heißt dann, ich habe eine LED im Switch oder unterm Keycap oder wo ist die?",
            "start": 3564612,
            "end": 3568968,
            "confidence": 0.86703104,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die LED ist zum einen ist es eine SMD LED, also wirklich winzig kleines Bauteil und das kommt auf die auf die PCB drauf, also auf diese Leiterplatte und wird dann über den Microcontroller auch über die Leiterplatte gesteuert. Und die meisten Switches, die haben so kleine Auskerbungen an der Unterseite und da scheint dann Licht durch. Also man sieht dann auch die eigentliche Auskerbung. Die ist ursprünglich gedacht für diese Standard LEDs, wie man sie kennt, also mit diesen wirklichen Glaskörpern allem drum und dran. Die könnte man da reinstecken, weiß ich. Vielleicht könnt ihr in die Show Notes ein Bild davon halten.",
            "start": 3569024,
            "end": 3598506,
            "confidence": 0.9078049,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich weiß gar nicht. Wir können im Nachgang vielleicht noch mal ein Video aufnehmen und du zeigst deine Tastaturen inklusive dem Switch, oder?",
            "start": 3598538,
            "end": 3606310,
            "confidence": 0.8638583,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Okay, wäre vielleicht auch eine Möglichkeit. Mal schauen. Genau. Auf jeden Fall, da sitzt die LED für die für die Switches. Wobei dann da auch wieder zu beachten ist, wenn wir noch mal zurück auf die Group bis gehen. Die meisten Group bis unterstützen so LED Geschichten gar nicht. Die meisten Group Bytes zweitausendeinundzwanzig sind massives Plastik, wo kein Licht durchscheint. Also auch das immer so ein bisschen im Hinterkopf behalten, weil Tastaturen, wo RGB durchleuchtet durch die Tasten, das sind so halb durchscheinende Keycaps und das ist, glaube ich, es wird produziert, aber es relativ selten. Genau. Und ja, also man muss RGB wollen, wenn man es verbaut. Wie gesagt, die Unterseite kann man noch zum leuchten bringen. Man kann mit der QMK auch kleine Displays ansteuern. Finde ich auch immer ganz nett. Die GR hat auch Displays verbaut. Dadurch, dass die QMK auf, ich glaube C grundsätzlich basiert, kann man auch mit den Displays so ziemlich alles anzeigen lassen, was man möchte. Ich habe Menschen gesehen, die haben da die Words per min, die getippt werden, auf der Tastatur in Echtzeit angezeigt, wenn man auf der Tastatur tippt. Gibt Leute, die spielen darauf Space in Space Invaders. Es gibt Leute, die haben da eine kleine Katze drauf. Also was das kann die QMK auch. Einzelne kleine Bilder funktionieren auch. Das sind so winzig kleine OLEDs mit 128 mal dreiig Pixel, glaube ich, passen da drauf. Also ist alles sehr, sehr klein. Das kann man mit der QMK machen. Man kann mit der QMK kann man auch Musik machen. Dann wird das Keyboard zum Keyboard. Man kann das ganze als Midi Input Device programmieren. Die Makros hatte ich schon gesagt. Ja, also was. Also Bluetooth kann die QMK glaube ich nicht so gut. Da kommt eine andere Firmware ins Spiel. Das ist dann die ZMK, die macht ein Entwickler namens pete Johansson, ganz, ganz netter Typ, entwickelt das Ganze auch weiter und der hat sich da spezialisiert auf Bluetooth Keyboards und da ist dann die Firma auch speziell auf die Bluetooth Mikrocontroller zugeschnitten.",
            "start": 3606810,
            "end": 3710868,
            "confidence": 0.899845,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hast du eigentlich mal so Tastatur und gesehen, die die Apple mal so erfunden oder keine Ahnung, ob die Apple erfunden hat, aber diese dynamischen Tasten, die da im MacBook mal eingebaut waren, die sich nie durchgesetzt haben, wo der Escape Key plötzlich irgendwie auf dieser dynamischen Leiste war.",
            "start": 3710924,
            "end": 3727140,
            "confidence": 0.9337302,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Gibt sowas auf der Touchbar? Ich muss jetzt ja gestehen, das war das Spacebar.",
            "start": 3727180,
            "end": 3732996,
            "confidence": 0.77364856,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Touchbar.",
            "start": 3733068,
            "end": 3733836,
            "confidence": 0.32387,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich würde fast sagen touchbar hieß sie. Wir wetten nicht.",
            "start": 3733988,
            "end": 3737240,
            "confidence": 0.888515,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich muss ja gestehen, ich hatte dieses.",
            "start": 3737980,
            "end": 3741308,
            "confidence": 0.85901,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "2016 er MacBook, ich hatte es mit dieser Touchbar und mit dieser. Wie hießen die Tasten? Ich weiß, welche du meinst. Was diese Butterfly Mechanik. Ich glaube, es gab auf jeden Fall jede Menge Rückläufe von diesem MacBook, weil die Tastatur relativ schnell kaputt ging. Es ist alles Geschmackssache. Also dadurch, dass ich viel mit Wim mache, brauche ich ein Hardware Escape. Es bringt mir nichts, irgendwie so touchscreen artige Tasten zu haben. Ich muss auch sagen, ich bin damit überhaupt nicht klar gekommen, mit dieser Bar, die da oben zweitausendein im Prinzip ja nur ein Display ist, auf das gedrückt wird. Ich brauche dann schon. Ich brauche haptisches Feedback. Ich brauche haptisches Feedback. Anders funktioniert.",
            "start": 3741364,
            "end": 3777482,
            "confidence": 0.8788154,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber gibt es sowas in der mechanischen Tastatur Community, solche Tastaturen auch oder wird es einfach verbönt, weil es eben nicht mechanisch.",
            "start": 3777586,
            "end": 3785178,
            "confidence": 0.9174,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es gibt hybride Geschichten. Es gibt den Thomas aus der Schweiz z.B. bekannt unter dem Namen oder unter dem Handle TH Poll. Der hat ein komplett eigenes Keyboard entworfen und hat unter jedes Keycap im Prinzip ein eigenes kleines Display gebaut. Ist dann aber eher so, ist eher so die Hybridform. Also das schon noch diesen mechanischen Tastenanschlag, aber unter halt heben Cap, ein kleines Display, alles ein ziemlich abgefahrenes Keyboard, was er da gebaut hat. Das ist ziemlich, ziemlich cool. Hat auch viel, viel Zeit und Arbeit reingesteckt und er sieht schick aus, keine Frage. Ich brauche nicht unbedingt Displays unter jedem Cap.",
            "start": 3785354,
            "end": 3819210,
            "confidence": 0.8873466,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, man könnte ja auch argumentieren, die touchbar war ja dafür da, dass sich die zweitausendein Leute dynamisch ihre Keys dorthin legen können. Aber wenn du jetzt schon die gesamte Tastatur selbst baust, hast du ja sowieso die Fähigkeit, die Tasten genau dorthin zu legen, wie du sie gerne hättest.",
            "start": 3819590,
            "end": 3833716,
            "confidence": 0.8976854,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, auf jeden Fall, auf jeden Fall, ganz klar. Ja, der Thomas, der macht dann noch ganz andere Geschichten mit diesen Displays. Er hat, wie gesagt, einerseits kann er sich natürlich das aktuelle Keyboard Layout anzeigen lassen, was er gerade benutzt, ob es deutsch ist, ob es ein amerikanisches Layout ist, ob es was völlig abstruses ist. Irgendein Dvorak oder Workman oder ähnliche Layouts kann das ganze auch live umprogrammieren im Prinzip. Und dadurch hast du natürlich ein optisches Feedback auf der Tastatur. Wenn du da live tasten Funktionen umbaust, macht das schon Sinn. Auf jeden Fall, dass du siehst, wenn du jetzt dein C auf eine andere Taste mapst, dann machen die Displays Sinn, weil das möchte ich nicht blind machen, weil dann wäre ich, glaube ich, innerhalb kürzester Zeit einfach unfassbar verwirrt.",
            "start": 3833788,
            "end": 3873558,
            "confidence": 0.898963,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Jetzt hatte ich mir sogar die Klick Klack Episode zu Firmwares reingezogen, zur Vorbereitung. Und da hattest du eine tolle Sache beschrieben. Zweitausendein, die da ist mir das Herz aufgegangen, und zwar, dass man auf der Tastatur bzw. In der Firmware, ich weiß jetzt nicht, ob das jetzt ein Makro war oder ähnliches. Da hat jemand wohl anscheinend auf dem linken Schiff bei Programmieren von Lisp, von der Programmiersprache Lisp die Klammer aufgesetzt und auf dem rechten Shift dann die Klammer zugesetzt. Weil für die nicht Lisp Programmierer oder Leute, die noch nie Lisp Code gesehen haben, es ist sehr klammernlastig, sehr runde Klammern lastig. Und jetzt könnte man natürlich sagen, warum benutzt man kein englisches Keyboard? Ich sag euch, es ist sehr klammernlastig. Wird man das über jetzt ein Makro machen oder ist das diese Layer Thematik, dass man an sich einen Lisp Layer baut und dann das Layout so umstellt, dass es lisp programmierfreundlich ist?",
            "start": 3873694,
            "end": 3924500,
            "confidence": 0.90350014,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Würde man, glaube ich, bei anderen Programmiersprachen so machen. Das, was du da gerade beschrieben hast, das ist das Space Kadett Shift, nennt sich das. Das ist sogar wirklich eine explizite Funktion der QMK. Das Space Kadett Shift, das ist es beruht auf einer alten Tastatur, eine wunderschöne Tastatur, wie ich finde, die Space Kadett ist. Von der Farbe her ist sie Wunderschön. Ist auch wirklich, glaube ich, zur Entstehung von iMacs um die Zeit herum muss es, muss diese Tastatur existiert haben. Und ich glaube, darauf wurde iMacs auch erfunden. Wahrscheinlich. Genau. Und die hat diese Funktion damals gehabt, dass es diese geschweiften Klammern gibt auf den Shifts bzw. Diese doppelt Belegung auf den auf den Shift und von da ist es abgeschaut. Deswegen das Space Kadett Shift. Und das ist wirklich zweitausendein eine sehr, also wie ich finde, intelligente Funktion und die auch in aktuelle Tastaturen einzubauen, finde ich finde es grandios. Es ist einfach, einfach super. Für andere Programmiersprachen, wenn du da andere Klammern oder andere Sonderzeichen öfters benutzt, die man wirklich viel braucht. Lass mich überlegen, ich schraube gerade einigermaßen viel an Nixos rum. Da brauchst du auch die geschweiften Klammern, aber auch so eckige Klammern z.b. könntest du dir auch auf das shift legen im Prinzip machst das aber mit einer Funktion. So ÿousand double tap würde ich es glaube ich machen, so dass wenn du zweimal auf das Shift tippst, dass du deine eckige Klammer auf oder deine eckige Klammer zu machst. Das heißt, da machst du es im Prinzip über Funktionen, die die QMK bereitstellt. Es gibt da verschiedene Funktionen, es gibt so hold and tap und solche Geschichten. Genau, damit steuerst du im Prinzip sonst deine Layer. Das ja, wir müssen jetzt glaube ich relativ tief in die QMK eintauchen. Es gibt, wenn du Layer aktivierst, gibt es verschiedene Arten, wie du layer aktiv ÿousand aktivierst, beziehungsweise wie du deine Tasten belegst. Es gibt die Möglichkeit, dass du sagst, ich möchte mein Layer aktivieren, indem ich eine Taste halte und dadurch den Layer aktiviere und dann eine andere Taste drücke, um die Taste auf dem Layer auszulösen. Das ist die eine Möglichkeit. Benutze ich relativ viel. Ich habe auf meinen Split Keyboards auf der rechten Daumen Seite das Enter z.B. und das benutze ich ganz gerne als als Layer Wechseltaste, um da auf die Ziffern zu kommen. Z.b. so kann ich mit meinem rechten Daumen gedrückt halten das Enter und kann dann auf meiner Ÿousand homero, also auf der auf der Zeile der Buchstaben, wo meine Finger normalerweise ruhen, meine Zahlen durchgehen. Eins bis fünf. Genau. Das ganze geht aber auch anders. Es gibt mit diesem One Tab z.B. dann drückst du einmal eine Taste, kannst sie auch wieder loslassen und hast dann den Layer gewechselt. Permanent kannst du sagen, bist du eine Taste drückst, dann wechselt es automatisch wieder zurück in deinen Base Layer. Und über sowas könntest du das im Prinzip regeln. Du könntest sagen, ich drücke jetzt zweimal Shift, machen wir die eckige Klammer oder ich drücke einmal Shift und müsste dann im Prinzip auch sagen, Shift löst mir auf der zweiten Ebene, auf dem zweiten Layer dann die eckige Klammer. Fühlt sich beides an wie ein Double Tab. Ganz klar. So könntest du es lösen. Funktioniert mit allem. Also das ist die QMK ist da unfassbar vielfältig und du kannst wirklich sehr, sehr viel machen, auch mit Kombination und allem drum und dran.",
            "start": 3924840,
            "end": 4086952,
            "confidence": 0.8904417,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Für alle nicht Python Developer, die ja nur Leerzeichen oder so verwenden, also die, die echte Programmiersprachen schreiben und geschwungene Klammern und andere Klammern verwenden. Gut, jetzt habe ich alle Python Leute gegen mich, sehe ich schon, aber für.",
            "start": 4087016,
            "end": 4100968,
            "confidence": 0.8909808,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Alle, die jetzt auch so ein kleines Herz für Python, kein Problem.",
            "start": 4100984,
            "end": 4106990,
            "confidence": 0.84509164,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Aber für alle Leute, die jetzt sagen cool, ich möchte auch meine linke Schifftaste, rechte Schiff Taste irgendwie anders belegen oder möchte mal rein starten. Wie fängt man denn an, wenn ich jetzt mir in dieses Thema einarbeiten will oder mal vielleicht was ausprobieren will? Wie gehe an das Thema ran, ohne dass jetzt vielleicht auch sofort die Tastatur kaufe? Oder hast du einen einsteiger Tipp, wie man gut beginnen kann, möglichst vielleicht ohne €500 auszugeben zu Beginn?",
            "start": 4107290,
            "end": 4131990,
            "confidence": 0.86547554,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ich glaube, also wenn, wenn man nicht unbedingt. Also mir geht es ganz oft so, wenn ich irgendwo neu reinfalle, dann will ich es auf jeden Fall erst mal vor mir haben. Und ausprobieren ist immer so ein kleines bisschen so ein Besitzgedanke, vielleicht nicht der optimalste Gedanke in dem Fall, aber ich will das erstmal haben. Und ausprobieren braucht man, glaube ich gar nicht. Ganz am Anfang hatte ich es erwähnt, die Communities, die sind da relativ offen und freuen sich auch, sich gegenseitig zu treffen im wahren Leben. Und es gibt Meetups und Meetups gibt es mittlerweile für mechanische Tastaturen so ziemlich in jedem, also in jedem Bundesland auf jeden Fall, in jeder größeren Stadt würde ich sogar fast sagen. Also vier sind mir auf jeden Fall bekannt. Es gibt ein alljährliches auf den Datenspuren in Dresden, das war jetzt z.b. es gibt, wenn Leute hier sind aus Hamburg und wir die Episode vor dem 5. Okt. Raushauen im Attraktor in Hamburg ist ein Keyboard Meetup, da kann man Keyboards anfassen und ausprobieren. Es gibt die alljährliche Mechanikon in Frankfurt am Main, das ist so Europas größtes Keyword Meetup, würde ich sagen. Es gibt mein eigenes kleines Meetup in Stuttgart, das ist im Februar, falls ich das noch sagen darf. Am achter Februar, wenn ich es richtig im Kopf habe. Genau, kann man auch vorbeigehen. Meetups. Ich glaube, als allererster Punkt, um Einstieg zu finden, sind glaube ich Meetups. Die meisten sind kostenlos, man kann einfach vorbeigehen, man muss nicht mit Leuten reden, man kann es natürlich gerne tun. Die Leute, im Vorgespräch hatte ich es auch schon gesagt, die Leute machen fast nichts anderes als Keyboards bauen. Die beschäftigen sich den ganzen Tag damit, mit Keyboards und was man damit besser machen kann. Ich glaube, wenn man so Leute fragt, die erzählen einem gerne was über Keyboards. Also ich glaube, da braucht es relativ wenig Scheu, solche Leute anzusprechen und auf solche Meetups zu gehen. Ansonsten krallt euch freuen zweitausendein und geh dahin. Dann könnte das wirklich, dann könnte Keywords ausprobieren.",
            "start": 4132290,
            "end": 4226106,
            "confidence": 0.8985573,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Du hattest auch mal ein Keyboard Switch Test Board erwähnt oder ähnliches, wo wo verschiedene Switches drauf sind, um dieses Tastengefühl.",
            "start": 4226178,
            "end": 4236762,
            "confidence": 0.8706033,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau.",
            "start": 4236866,
            "end": 4237570,
            "confidence": 0.54633,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wie heißt das?",
            "start": 4237730,
            "end": 4238602,
            "confidence": 0.91925335,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ich glaube mit Switch Tester kommt man relativ weit auf Google glaubt, da kriegt man eine breite, breite Auswahl an solchen Sachen. Genau. Ist auch ein guter Einstiegspunkt, gerade wenn man sich so Gedanken machen möchte zu Switches. Was ich aber auch empfehlen kann, ohne hundertprozentige Garantie, wenn man sich so in den Communities rumtreibt und mal so ein bisschen rumfragt, was immer mal wieder übrig bleibt, sind einzelne Switches. Die Dinger werden meistens verkauft in er Packs. Er Packs, alles drum und dran. Und wenn du dann mal so ein Keyboard baust mit keine Ahnung, die zipzal Pat jetzt 28 Keys, dann bleiben bei dreiig Switches, die du bestellst, halt zwei übrig und zwei Switches verbaust du nirgendwo. Und wenn du mal lieb fragst, ich hätte mal gerne so einen Switch, gibt es mit Sicherheit Leute, die auch sagen klar, schick ich dir mal welche rum. Ich habe noch zwei übrig. Probierst du aus. Solche Geschichten. Ja. Und wie gesagt, ich glaube die Community Communities sind einfach so der Anlaufpunkt Nr. Eins für alles, was man irgendwie so haben will. Genau. So Leute, die helfen einem weiter, die geben einem Tipps, die beantworten Fragen, auch wenn sie, wenn sie blöd scheinen. Gibt ja keine blöden Fragen bekanntlich. Ja.",
            "start": 4238666,
            "end": 4297234,
            "confidence": 0.87523127,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und welche communities gibt es online? Jetzt abgesehen von deinem Podcast natürlich.",
            "start": 4297362,
            "end": 4302026,
            "confidence": 0.9139108,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, also die CCH Community ist natürlich die beste überhaupt, muss man ganz klar dazu sagen. Nee, das zum einen ganz klar, da gibt es viele Leute, die sich rumtreiben, auch aus einer vollen Breite. Es gibt Leute, die benutzen 100 % Keyboards, es gibt Leute, die benutzen nur Keyboards mit 18 Tasten. Kann ich nicht verstehen, ist mir ein bisschen wenig. Da findet man auf jeden Fall Leute, die sich für spezielle Bereiche wirklich gut auskennen. Was gibt es sonst noch? Ja, ich glaube Reddit würde ich mittlerweile meiden. Es glaube die Community nicht mehr ganz so cool. Da sind auch glaube ich viele weg von Reddit.",
            "start": 4302098,
            "end": 4332476,
            "confidence": 0.9242338,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Andi darf gar nicht mehr hin.",
            "start": 4332588,
            "end": 4333892,
            "confidence": 0.94196,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, ich werde halt konstant irgendwo gebannt anscheinend.",
            "start": 4333956,
            "end": 4337480,
            "confidence": 0.7213575,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Aber Philipp, eure CCH Community, habt ihr da irgendwie einen Discord oder wo seid ihr unterwegs?",
            "start": 4338840,
            "end": 4345632,
            "confidence": 0.88264185,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, also es gibt auf jeden Fall einen Discord. Es gibt seit heute glaube ich auch einen allgemeinen Matrix Channel. Wo man so ein bisschen quatschen kann über Keyboards ist wirklich jede Frage willkommen. Gerade Discord ist glaube ich so der Platz, wo sich da ganz, ganz viel abspielt. Es gibt den MKD, das ist der Mechanical Keyboard Deutschland Channel, der ist offen, kann jeder rein, kann sich umschauen. Genau, ist mit dem CCH Server aber genau das gleiche. Der ist genauso offen. Einfach reinkommen, rumschauen. Man muss auch nichts sagen. Kann das mal die ganzen Freaks da anschauen, was sie dafür Tastaturen präsentieren. Genau. Aber wie gesagt, fragen kann man da glaube ich in beiden auf jeden Fall. Gut. Und das sind so die anlaufpunkte Nr. Eins, die mir so einfallen würden.",
            "start": 4345696,
            "end": 4383346,
            "confidence": 0.9073508,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir verlinken auf jeden Fall diverse Communities mal in den Show Notes, dass ihr mal ein bisschen rumschauen könnt. Und wir holen uns auch noch ein paar Links von von Philipp ein, die er hier im Laufe der Episode gedroppt hat. Ich habe gerade mal ganz kurz gegoogelt und habe den Keychron Switch Tester 100 gefunden. Der kostet 50 und da hat man anscheinend 100 verschiedene Switches. Und ich glaube, diese Episode hat mich schon getriggert. Ich glaube, ich werde ihn einfach mal bestellen, weil ich möchte das einfach nur mal testen. Dann brauche ich noch vielleicht noch so eine so eine, wie nennt sich das? Eine so eine Bag voll voll Keycaps, damit ich so eine Art Vomit habe, weil ich muss ja dann Keycaps testen, die muss ich ja dann auf die Switches draufpacken. Mal gucken, ob ich da irgendwas bauen kann. Das ist ja mega rabbit Hole. Philipp. Was? Was soll ich sagen? Ich glaube, du hast einfach eine neue neues weiß ich nicht, jetzt im positiven Sinne Höllentor aufgemacht.",
            "start": 4383418,
            "end": 4434040,
            "confidence": 0.87769026,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, das trifft es gut. Ich glaube, dass das. Das glaube ich mir auch. Das ist sehr gut.",
            "start": 4434460,
            "end": 4438532,
            "confidence": 0.8626178,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, dein Disclaimer von ganz am Anfang Achtung keiner ist hier verantwortlich, wenn man sehr viel Geld ÿousand Geld ausgeben kann ich verstehen. Auch besonders, wenn ein Switch 2,40 kosten kann. Man bedenke, man hat dann noch kein Keycap. Aber gut, bei einem Full Size Keyboard von was 104 Tasten hast du gesagt.",
            "start": 4438556,
            "end": 4458602,
            "confidence": 0.88725,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Genau.",
            "start": 4458666,
            "end": 4459350,
            "confidence": 0.51487,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also ich habe echt viel gelernt, also wirklich. Und ich habe jetzt gerade irgendwie echt mal Lust, vielleicht zur Cch kon zu kommen und einfach nur mal auf den auf den Dingern rumzutippen, einfach nur mal Ÿousand bisschen darauf zu fühlen, weil ich musste schon wieder so lachen. Wie gesagt, der Wolfgang hat die ganze Zeit während des Podcasts so ganz detailliert auf seine Tastatur geguckt und ich auch. Und da war ich so ein bisschen traurig, weil so eine Apple Magic Keyboard halt recht unspektakulär ist. Ich glaube, der Wolfgang hat da so ein bisschen ja, faszinierend. Was möchtest du den Hörerinnen und Hörern vom Engineering kiosk mit zum Abschluss mitgeben?",
            "start": 4459850,
            "end": 4495248,
            "confidence": 0.9115982,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, ich glaube zwei Punkte passt auf eure Finger auf. Normale Unibody Keyboards machen Hände kaputt. Überlegt das Ganze ein bisschen auseinander zu schieben, Split zu benutzen. Und das andere ist, wenn ihr Lust habt, irgendwie in dieses ganze, dieses Höllentor aufzutreten. Ich wollte es mir klauen, dieses Höllentor aufzutreten und durchzuschreiten. Scheut euch nicht. Das ist alles in allem nicht nur was diesen Klick Klack Hack Community Servern alles angeht, auch weit drüber hinaus. Es sind alles wunderbare, nette Menschen, die sich dahinter verstanden stecken. Die reden gerne über Keyboards. Fragt sie einfach alles, was ihr wissen wollt und die werden euch auf keinen Fall blöd anschauen. Die machen nichts anderes, als sich über Keyboards auszutauschen, damit Keyboards rumzuspielen. Springt da einfach voll rein. So habe ich es gemacht am Anfang und es macht unfassbar viel Spaß, da einfach kopfüber rein zu springen, sich erst mal völlig erschlagen zu lassen von den ganzen Faktoren, die da irgendwie mit reinspielen. Aber scheut es nicht, weil so richtig bereut habe ich es bis jetzt noch nie.",
            "start": 4495304,
            "end": 4547134,
            "confidence": 0.88653,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, und damit hast du mich eigentlich schon überzeugt. Also ich war ein mir war mit Keyboard zulegen. Ich sehe das schon. Also vielen, vielen Dank für deinen ganzen Input, für den Ausflug oder für den vielleicht für den ganz hohen Überflug würde ich fast sagen, weil es gibt 100 Episoden von deinem Podcast, der noch viel, viel tiefer geht und noch in viele Details geht. Und man merkt auch, du behandelst ja ständig Feedback und und Neuigkeiten aus der Community. Es ist scheint wirklich eine zweitausendein super nette Community zu sein, die da haben. Also kann auch nur jedem empfehlen, mal vorbeizukommen. Wir werden auch versuchen, Philips Tastaturen, die wirklich sehr spacig aussehen. Also er hat sie uns schon gezeigt. Diese schauen wirklich cool aus, vielleicht noch als Bild oder als Video zu bekommen. Findet ihr dann auf den üblichen Plattformen bei uns bzw. In den Show Notes verlinkt.",
            "start": 4547182,
            "end": 4597822,
            "confidence": 0.87807953,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wer noch mehr staunen möchte, joint mal dem klick klack hack Discord Server und geht da in den Pictures Channel. Da bin ich gerade mal reingegangen und das scrolle ich hoch und teilweise denke ich mir, das ist doch keine Tastatur. Also da gibt es Tastaturen mit mit fünf, mit fünf oder sechs Tasten. Die sind so leicht, die können auf auf Gerste oben drauf liegen.",
            "start": 4597886,
            "end": 4619780,
            "confidence": 0.8926233,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was?",
            "start": 4620720,
            "end": 4621104,
            "confidence": 0.65919,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was zum Teufel? Also wer da Inspiration braucht, ja, das.",
            "start": 4621152,
            "end": 4624872,
            "confidence": 0.912478,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Vielleicht auch noch ein Projekt zu erwähnen, das finde ich unfassbar abgefahren. Der Fuka, einer der bei uns in der Late Night mitmacht, der hat jetzt ein Keyboard gebaut. Das ist die Manhattan. Und die Manhattan ist ein abgefahrenes Keyboard. Dieses Keyboard ist, glaube ich, 7 mm hoch mit allem, mit der PCB, die verbaut ist, mit den Switches, die drauf sind und mit den Keycaps. Der hat da mit Jerry geredet und die haben vor gar nicht allzu langer Zeit so ultra low profile Switches auf den Markt gebracht. Eigentlich ja für Laptop Tastaturen gedacht. Und der hat aber irgendwie so, hat er halt welche bekommen und hat daraus halt eine split Tastatur gebaut. Und dieses Ding ist unfassbar, unfassbar dünn. Man sieht es auf dem Tisch liegen und denkt, oh mein Gott, ich will das nicht kaputt machen. So dünn ist das. Also das sind, es ist abgefahren. Sehr abgefahren. Also sehr, sehr cooles Projekt von Fuka.",
            "start": 4624896,
            "end": 4667348,
            "confidence": 0.90655464,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wir versuchen ein Bild in den Shownotes zu verlinken. Philipp, was soll ich sagen? Vielen lieben Dank. Ich werde mich auf jeden Fall jetzt vielleicht nicht ganz aktiv, aber mal mehr mit mechanischen Keywords auseinandersetzen. Und du hast schon irgendein, wie gesagt, eine Begeisterung entfacht. Vielen lieben Dank.",
            "start": 4667404,
            "end": 4683132,
            "confidence": 0.9104373,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Was? Was soll ich sagen? Es tut mir leid, ich habe dieses Höllentor aufgestoßen, aber nee. Ja, schön, dass ich dabei sein durfte. Also definitiv. Und ich finde es auch immer wieder schön, wenn Leute da Begeisterung dran finden. Das ist toll. Und so ein bisschen Begeisterung teilen mit anderen macht ja auch eine Menge Spaß.",
            "start": 4683196,
            "end": 4697972,
            "confidence": 0.93804806,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Wie immer, alle Links verlinken wir in den Show Notes, damit ihr in dieses Höllenrabbit Hole auch mal abtauchen könnt. Ansonsten würden wir sagen, vielen Dank fürs Zuhören und bis zum nächsten Mal. Tschüss zusammen.",
            "start": 4698036,
            "end": 4708316,
            "confidence": 0.915286,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ciao.",
            "start": 4708388,
            "end": 4708820,
            "confidence": 0.549,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Tschüss.",
            "start": 4708900,
            "end": 4709060,
            "confidence": 0.4974,
            "speaker": "B",
            "channel": null
        }
    ],
    "confidence": 0.8971573,
    "audio_duration": 4717,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}