{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/Z3dAT7YoHESaKDz/download/ep150_thinkpads.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "multichannel": null,
  "audio_channels": null,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "9570d9ba-19f3-4e07-8463-da6e71d09db6",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen zu einer weiteren Episode vom Engineering Kiosk, deinem deutschsprachigen Softwareentwicklungspodcast. Wenn wir uns bei den verwendeten Laptops von Techworker innen so umschauen, fallen besonders zwei Firmen bzw. Modelle auf. Das eine sind MacBooks von Apple, das andere Thinkpads von IBM bzw. Lenovo. Besonders unter Softwareentwickler innen und Linux Usern sind Thinkpads sehr weit verbreitet. Wir haben uns die Frage gestellt, warum dies so ist. Warum sind Thinkpads schon so lange am Markt und so beliebt? Was ist daran besonders? Diese Fragen versuchen wir in dieser Podcast Episode zu beantworten. Christian Stankovic ist Sammler von ThinkPads und betreibt ein digitales Museum und einen Podcast zu diesem Thema. Mit ihm klären wir den Grund für die Beliebtheit von Thinkpads, wie die Geschichte zu der Notebook Marke aussieht, wer Richard Zappa ist, was es mit der roten Farbe im Produktdesign auf sich hat, welche hardwarekuriositäten es bei den verschiedenen Modellen gibt, woher eigentlich der Name Think kommt und vieles mehr. Bleib also dran, wir springen rein. Los geht's. In der Softwareentwicklung Ÿousand so ein paar Religionskriege. Bei der Programmierung ist es white space versus Tabs. Bei den Admins ist es Emacs versus Wim. Und ich glaube, bei jedem, der irgendwie was von seiner Hardware hält oder der so ein bisschen, ich sag mal, rabbit Hole Tendenzen hat, bei ihm ist es auch der Laptop. Nehme ich ein Mac, nehme ich einen freien Laptop, wo ich wirklich alles austauschen kann oder Applei, ich den guten alten Spruch nobody gets feiert for buying IBM und nimmt ein schönes Thinkpads. Das ist auch unser Thema heute im Konferenzsommer war ich unter anderem auf der Frostcon. Auf der Frostcon ist eine free and open source Konferenz im Schirm Nordrhein Westfalen. Und da schaue ich mir das Programm so durch und entdecke einen populären Namen, und zwar einen alten Bekannten, den ich sehr oft auf den Ohren habe, der auch Fokus und Linux Podcast host ist, der den Podcast Fax Informatiker macht. Und weil er mehr side Projects hat als der Tag Stunden, hat er sogar noch einen dritten Podcast, ein ThinkPad Museum Podcast zweitausendein. Und zwar lieber Christian. Hallo.",
      "start": 4480,
      "end": 142090,
      "confidence": 0.8801014,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Hi. Moin. Schön, dass ich hier sein darf.",
      "start": 142210,
      "end": 144554,
      "confidence": 0.9167575,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du beschäftigst dich auch beruflich mit Rechnern. Ich weiß jetzt nicht, wie viel davon wirklich Thinkpads sind. Ich hoffe nicht so viele, denn du bist IT Consultant und IT Trainer im Bereich Virtualisierung, Linux und Infrastructure as Code. Ich hoffe, in euren Data Centern oder Cages stehen jetzt nicht so viele Thinkpads rum. Du hast aber auf jeden Fall eine große Neugier und nerdest dich dann rein, weil du unter anderem auch ein Thinkpad Museum hast, oder beziehungsweise es zu nennen. Und meines Erachtens nach bist du der Sammler mit der größten Thinkpad Sammlung in Deutschland. Ist das korrekt?",
      "start": 144682,
      "end": 177220,
      "confidence": 0.9067394,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das würde man vielleicht meinen, aber tatsächlich gibt es immer wieder Leute, die eine größere Sammlung haben, was mich darin auch bestärkt, dass das gar nicht so schlimm ist, was ich mache, weil andere haben viel größere Sammlungen. Aber nichtsdestotrotz können wir natürlich alle aufhören, wenn wir wollten, aber wir wollen halt nicht. Also von daher, es gibt Leute, die haben eine Sammlung, die ist doppelt so groß, habe ich im Thinkbet Forum festgestellt. Von daher bin ich vermutlich noch wookie bei den Leuten.",
      "start": 177340,
      "end": 198788,
      "confidence": 0.9462843,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und ihr macht es aber alles freiwillig. Also ihr seid nicht von Lenovo gesponsert oder von IBM gesponsert, sondern ihr macht es absolut freiwillig. Übrigens, diese Episode ist auch nicht gesponsert, nur falls sich da jetzt jemand denkt, IBM steckt da dahinter, machen das alle freiwillig. Korrekt?",
      "start": 198844,
      "end": 213884,
      "confidence": 0.89932466,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, absolut. Also ich glaube, das ist auch so was, das musst du freiwillig machen, weil ansonsten würde das, glaube ich, kein Mensch machen.",
      "start": 213972,
      "end": 220588,
      "confidence": 0.9114392,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also lass uns mal ein bisschen über dein Fable, weiß nicht, wie ich es nennen darf, keine Ahnung, Special Interest ist auf jeden Fall zustimmend, aber lass uns mal ganz kurz darüber reden, wer oder was ist ein Thinkpad? Lass uns die Leute mal abholen, inklusive mir.",
      "start": 220644,
      "end": 238808,
      "confidence": 0.91347235,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Okay, wo fangen wir an? Also vielleicht grob zusammengefasst, ein Thinkpad ist halt einfach eine Marke eines Notebooks, das seit 1992 von IBM und seit 2005 von Denuvo hergestellt wird.",
      "start": 238904,
      "end": 250136,
      "confidence": 0.8862993,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also eigentlich wie so ein Mac, ein Laptop, auf dem ich arbeiten kann.",
      "start": 310208,
      "end": 312944,
      "confidence": 0.8985523,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, nur dass halt kein macOS drauf läuft, sondern halt eben du Intel oder AMD Hardware drin hast und dann natürlich Windows, Linux, was auch immer dir beliebt, darauf installieren kannst.",
      "start": 312992,
      "end": 321776,
      "confidence": 0.8968029,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und was macht Zink Pads jetzt so relevant, dass du diese Art von Computer sammelst und ein Museum aufbaust?",
      "start": 321848,
      "end": 328492,
      "confidence": 0.8972005,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich glaube, das ist wie so häufig, wenn Leute Dinge sammeln, so ein bisschen Selbsttherapie und nostalgisches Frönen in Erinnerung vielleicht. Also ich kann mich daran erinnern, dass es bei mir begonnen hat, als ich als Heranwachsender, so ich glaube 1213 war ich, hatten wir mal einen Versicherungsvertreter zu Hause und der hatte halt so einen Aktenkoffer, wie das halt Vertreterinnen so haben, die Geschäfte machen. Und den machte er auf und dann hatte er dieses schwarze Notebook, das irgendwie so ein bisschen mystisch aussah und nebendran halt auch einen Drucker und hat dann halt einfach Geschäfte gemacht, hat uns irgendein Vertrag rausgedruckt und konnte den dann vor Ort gleich unterschreiben. Und das hat mich irgendwie total abgeholt, weil das so eine Kiste war, die oberflächlich betrachtet vielleicht langweilig aussieht, weil schwarzes Gehäuse auf der anderen Seite, deswegen aber auch so ein bisschen mystisch. Und das war halt super praktisch. Da hatte ein Koffer, der konnte daraus komplett arbeiten. Der brauchte keinen Arbeitsplatz in irgendeinem Büro.",
      "start": 328556,
      "end": 379376,
      "confidence": 0.9153564,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das kann sich der Andi ja gar nicht vorstellen als alter Mac User, dass man, dass man für einen schwarzen Koffer so Liebe entwickelt oder da Gefallen dran findet. Und wenn nichts weiß ist, dann kann es sowieso nicht. Also besonders Andy, müssen wir beide jetzt ich als Thinkbed User natürlich als überzeugter heute mal auch erklären, wie das überhaupt eigentlich läuft.",
      "start": 379448,
      "end": 401068,
      "confidence": 0.8743589,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, also die Farbe ist natürlich auch wechselbar. Also es gibt auch ein paar Modelle, die nicht schwarz sind. Aber man muss auch sagen, so space graue MacBooks, die sieht man ja auch häufig. Also ich glaube, dunklere Farben sind mittlerweile in der Popkultur angekommen bei Notebooks.",
      "start": 401124,
      "end": 414368,
      "confidence": 0.9153164,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber hat dich dann der schwarze Koffer oder dieser Drucker im Koffer beeindruckt bei diesem Versicherungsvertreter? Weil ich glaube, der beeindruckt mich heutzutage immer noch.",
      "start": 414464,
      "end": 424460,
      "confidence": 0.9533128,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also es ist, glaube ich, die Mischung so aus beidem halt dieser Koffer, wo alles drin ist. Und ich habe so schräg am Tisch gesessen und habe dann halt gesehen, wie er auch dieses Gerät mit dem Checkpoint bedient hat. Also das hatte kein Touchpad, das war damals noch nicht so weit verbreitet. Und das war halt einfach knallrot. Und die Maustasten, die waren halt auch rot und blau. Und das ist natürlich schon schon so eine Akzentfarbe, die fällt natürlich auf. Und ich glaube, dieses, diese Gesamtmischung aus dieser interessanten Farbkombination und eben diesen praktischen Setup, das hat mich irgendwie begeistert. Und das hat dann halt auch dazu geführt, dass ich in meiner ersten Ausbildung dann das erste Azubi Gehalt ging dann halt für so ein gebrauchtes Gerät drauf. Und da war ich dann drin, würde ich sagen.",
      "start": 425040,
      "end": 463564,
      "confidence": 0.9401704,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Hol mich mal eben ab. Was ist ein Trackpoint?",
      "start": 463652,
      "end": 466092,
      "confidence": 0.89121,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Trackpoint, schön, dass du fragst. Das ist ein so eine Art Mini Joystick. So kann man sich vielleicht vorstellen. Eine gummierte, genoppte, rote Oberfläche, ein kleiner roter Punkt zwischen zwischen den Tasten G, h und b auf deiner Tastatur und ist ein Mausersatz, der den Vorteil hat, dass du die Finger nicht von der Tastatur nehmen musst. Also wir wissen ja alle Zeit des Gelds, ihr wisst das ganz besonders. Und wenn ich am tippen bin und kurz mal mit der Maus wohin will, dann kann ich während dem Tippen kurz mit einem Finger mit dem Checkpoint den Cursor an die richtige Stelle bewegen und kann dann weiter tippen. Fordert ein bisschen Eingewöhnung, muss man auch fairerweise sagen, aber war lange Zeit bevor es brauchbare Touchpads gab, eigentlich die Eingabemöglichkeit schlechthin auf dem Laptop.",
      "start": 466196,
      "end": 505184,
      "confidence": 0.9063567,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Verwendest du den heute noch?",
      "start": 505272,
      "end": 506944,
      "confidence": 0.99847,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jein, also ich benutze ihn schon noch hin und wieder, aber in den letzten vier, fünf Jahren hat Lenovo schon brauchbare, größere Glas Touchpads verbaut. Man muss sagen, ich habe zwischendrin auch einen Mac sehr lange genutzt. Also auch diese Aufnahme findet über ein er MacBook Pro statt. Also ich habe auch ein nicht Thinkpad in meiner Sammlung, wenn man so will. Und die haben halt einfach super grandiose Touchpads und Lenovo hatte super lange super schlechte Touchpads. Also das war wirklich absurd. Ÿousand, was für schlechte Touchpads die in echt teuren Business Geräten verbaut haben. Seitdem das aber der Fall ist, benutze ich den seltener, aber ich benutze ihn immer noch hin und wieder mal. Also z.b. wenn ich beengt im Zug sitze, finde ich das mit dem Checkpoint einfach angenehmer als mit dem Touchpad. Aber ansonsten, wenn ich an einem Tisch sitze und Platz habe, dann nehme ich auch gerne mal das Touchpad, weil ich.",
      "start": 507032,
      "end": 552558,
      "confidence": 0.92504865,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Habe ja glaube ich in meinem Leben noch nie jemand getroffen, der diesen roten .in irgendeiner Form sinnvoll findet und den auch verwendet. Sondern es kam immer die Frage auf, was macht dieses rote Teil eigentlich? Warum? Also manche Leute haben nicht gewusst, dass das ein Trackpoint ist, sondern dass man es wirklich verwenden kann. Also ich habe wirklich Leute kennengelernt, die haben den Computer bekommen und haben keine Ahnung gehabt, dass das eigentlich verwendbar ist. Was aber auch schon interessant ist, dass es trotzdem zu so einem Wiedererkennungsmerkmal geworden ist. Also sobald du diesen roten Punkt siehst, weißt du sofort, das muss ein Thinkpad sein. Also da führt kein Weg drumherum. Aber es würde mich wirklich interessieren, wie viele Leute den eigentlich überhaupt noch verwenden.",
      "start": 552574,
      "end": 593410,
      "confidence": 0.9014815,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Zweitausendein.",
      "start": 593450,
      "end": 593604,
      "confidence": 0.85869,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist ein guter Punkt. Da könnte man ja meine Umfrage auf Mastodon zu starten, denn da gibt es wirklich eine DieHard Community. Also es gibt diese ThinkPad Ultras, die nichts anderes benutzen und auch nur die alten Geräte, die gibt es wirklich. Und das ist schon interessant, wie der Welten aufeinander treffen. Du hast auf der einen Seite die Leute, die halt im Prinzip die guten alten IBM Geräte gewöhnt sind und auf der anderen Seite die Leute, die halt die neuen Geräte kaufen und auch nur die kennen, weil die Leute halt einfach Mitte 20 sind und nicht Mitte 50. Und das ist schon spannend, wenn sich die Leute dann austauschen, was für unterschiedliche Betrachtungswinkel man dann auf so ein Gerät hat.",
      "start": 593642,
      "end": 624248,
      "confidence": 0.90698975,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bei dem Trackpoint denke ich mir immer nur so okay, wie ist es denn für Leute, die wirklich schnell tippen können? Denn du hast ja gerade gesagt, der Trackpoint ist zwischen dem g h und dem B. Das bedeutet also auch, dass deine Tasten eine verkleinerte Größe haben bzw. Dass ein Teil dieser Tasten fehlt. Und wenn du dich wirklich an das Keyboard Layout gewöhnt hast und dann wirklich schnell tippen kannst, ich sag mal 10 Finger und so weiter, stört der dann nicht?",
      "start": 624304,
      "end": 648932,
      "confidence": 0.9237723,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Eigentlich nicht. Also ich meine, du nimmst es ja auch so ein bisschen peripher wahr. Also du siehst ja auch im Augenwinkel, wo deine Tasten liegen. Und ich glaube, man gewöhnt sich dran. Also es ist mir, glaube ich, bisher noch nicht passiert, dass ich beim schnell tippen auf den Trackpoint versehentlich geklickt hätte oder so. Also der ist schon so angebracht, dass er wirklich nur eine kleine Ecke von den Tasten wegnimmt, würde ich jetzt mal in Anführungsstrichen sagen. Also ich glaube, wenn du wirklich relativ mittig drückst und das sollte ja das Optimum sein, fällt es vermutlich nicht auf, wenn du so ein Kanten tipper bist. Ja, dann, dann hast du natürlich ein Problem. Das kann schon sein.",
      "start": 649036,
      "end": 679792,
      "confidence": 0.91028744,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also wäre mir auch noch nie passiert eigentlich. Und es ist ja schon so, dass du da recht viel Druck ausüben musst, dass sich da dann überhaupt was bewegt. Also das so versehentlich drankommen, bewegt eigentlich noch nichts. Und da hatte ich eher das Problem, dass ich mit dem Handballen auf dem Trackpad oder so irgendwas bewegt habe, versehentlich. Und da war ThinkPad auch mal eben, wie du richtig gesagt hast, Christian, die diese Zeit mit den katastrophalen Pads, die sie da eingebaut haben. Ich hatte auch mal so ein t S, glaube ich, war das Ÿousand, der so geklappert hat, wenn man drauf gedippt hat. Das war eine Katastrophe. Und also bin ich auch sehr froh, dass sie da wieder zu einem sinnvollen, sinnvollen Hardware zurückgekommen sind. Vor allem, wenn du dann keine Ahnung, damals zweieinhalbtausend Euro oder so gezahlt hast für so ein Ding und dann hast du so eine Klapperkiste da bekommen. War wirklich eine Katastrophe.",
      "start": 679896,
      "end": 727282,
      "confidence": 0.88235444,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das stimmt. Ja. Also es gab auch immer und das ist auch so eine Geschichte, die sich wiederholt. Es gab immer so Höhen und Tiefen. Es gab Produktserien, die sehr gut waren. Es gab welche, die nicht so gut waren. Und das variiert auch immer so ein bisschen. Also ich würde jetzt nicht sagen, dass es da Zeiten gab, wo richtiger Shot gebaut wurde. So schlimm war es jetzt nicht. Aber manchmal gab es schon Phasen und Produkte, da hat man gemerkt, ja, es musste anscheinend bei euch schnell gehen.",
      "start": 727346,
      "end": 749484,
      "confidence": 0.93732935,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Phasen und Produkte, das ist mein Stichwort. Ich hatte schon von einem sogenannten Thinkpad Museum gesprochen. Du hast auch einen eigenen Podcast zum Thema Thinkpads. Führ uns mal ganz kurz durch, was du da aufgebaut hast. Wie sieht deine Sammlung aus? Was ist da drin, was ist da nicht drin? Wie kommst du an das Zeug und wo teilst du dein Wissen? Und was hast du da inzwischen aufgebaut mit deinem Thinkpad Museum? Führen sie mal ganz kurz, ich sag mal audio technisch dadurch.",
      "start": 749652,
      "end": 777564,
      "confidence": 0.9141092,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also hier möchte ich noch mal betonen, dass ich natürlich jederzeit aufhören kann und kein Problem habe, aber möglicherweise war das eins meiner Corona Beschäftigungen. Man musste irgendwas machen im Lockdown. Und im ersten Lockdown habe ich mir einen Sprachassistenten und ganz viele mechanische Tastaturen gebaut. Und im nächsten Lockdown habe ich dann gesagt, gut, okay, irgendwie habe ich das jetzt durchgesetzt gespielt. Und dann habe ich, ich weiß gar nicht, wie das kam, aber ich habe irgendwie auf Kleinanzeigen nach einem alten Thinkpad gesucht, weil ich glaube ich an diese Geschichte mit diesem Versicherungsvertreter denken musste und habe dann genau so ein Gerät gefunden für €20 oder irgendwie sowas. Und dann hat der kleine Anzeigen Algo richtig mies reingekickt und hat mir jeden Tag tolle, ähnlich günstige Geräte vorgestellt und dann ist es irgendwie ausgeartet. Ich weiß auch nicht, wie es passieren konnte, aber ich habe chronologisch auch auf dem Blog, den du gerade erwähnt hast, dem thinkpad Museum dokumentiert, welche Geräte ich wann wie angeschafft habe. Und ich glaube, wenn man das visualisiert, sieht man halt schon Corona, okay, nächster Lockdown. Also da sind viele Geräte reingekommen und ich habe es mir zur Aufgabe gemacht, die interessanten Geräte, und von denen gibt es ja einige, einfach mal vorzuhalten. Also wichtig im Idealfall einzeln vorzuhalten und keine Duplikate zu haben. Und da gibt es halt einfach super viel Geräte, die auf ihrer eigenen Art außergewöhnlich sind. Also angefangen bei außergewöhnlichen Designs im Sinne von wie das Gehäuse vielleicht aussieht oder welche kuriosen Extras man z.B. eingebaut hat. Es gab z.B. relativ früh schon einen Thinkpad mit einer Titanium Legierung, wie wir das vielleicht alle vom iPhone 14 und 15 kennen und Leute sich darüber aufregen, dass da die Fingerabdrücke so schnell drauf kleben bleiben. Das haben sie 2006 auch schon. Also man hat damals eigentlich schon gewusst, dass das keine gute Gehäuselegierung ist. Und ja, es gibt auch einfach Geräte, die optisch sehr ansprechend sind oder die eine merkwürdige Tastatur haben oder wo das erste Mal eine spezifische Schnittstelle drin ist. Zweitausendein. Das hat halt dazu geführt, dass ich aktuell 56 unterschiedliche Notebooks und Tablets, drei PDAs und unzählige Dockingstations und Kabel und Akkus hier vorrätig habe.",
      "start": 777652,
      "end": 896136,
      "confidence": 0.9012882,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und stehen die dann auch alle in so einer Vitrine offen, wo man die dann so bestaunen kann? Weil da bräuchte man ja dann schon so 50 oder 100 Quadratmeter für, oder?",
      "start": 896208,
      "end": 904360,
      "confidence": 0.9278228,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also vitrinen wäre cool, aber ich glaube, dann müsste ich mir so eine mittelgroße Loftwohnung mieten und das sehe ich irgendwie finanziell als unrealistisch an. Von daher, also ich habe hier, das ist relativ unspektakulär, dann kann man bestimmt einen Link oder ein Bild irgendwie in die. Das ist halt so ein Ikea Aktenschrank und der ist halt voll mit Thinkpads und da sind halt so zwei Glastüren dran und dann kann man sehen, was da drin ist. Also das sieht wenig atemberaubend aus, glaube ich. Aber wenn man die Geräte dann so aufstellt und das kommt halt auch mal vor, dass Leute dann sagen, hier, du kennst doch aus mit diesen Notebooks, zeig mir doch mal so ein paar Geräte und die Unterschiede, dann wird das schön auf dem auf dem Esstisch ausgepackt und schön zur Schau gestellt, dann macht das schon was her. Und ja, das Ganze ist halt ein absolutes Rabbit Hole. Also wenn wir uns angucken, wie die Geräte gebaut wurden, welche Leute involviert waren und vor allen Dingen in puncto Design gibt es extrem viel Trivia. Also ich habe mich aufgrund dessen mit industriellem Produktdesign beschäftigt und das ist halt wirklich ein sehr großes rabbit Hole. Wenn man sich mal beschäftigt, wie Leute Produkte designt haben, aus welchen stoffen, warum, was die Metapher hinter den Gehäuseformen sind. Da habe ich mich vor ein paar Monaten mal mit Richard Zappa beschäftigt, der ja der maßgebende Designer hinter den Produkten ist und habe mir dann extra so ein Hochglanzbuch aus den USA importieren lassen, wo dann so Hochglanzbilder drin sind und die Stories dahinter, die zu Lebzeiten noch in dem Interview festgehalten wurden, das ist halt einfach, man man sieht dann die Welt mit anderen Augen, wenn man sich mit solchen Details aufhält. Und es scheint Leute zu geben, die das auch interessant finden, weswegen ich den Gedanken hatte, naja, Video ist super aufwendig, da habe ich nicht die Zeit für. Und das gibt es halt auch schon. Also da gibt es einen super interessanten Channel Laptop, Retrospective heißt der und der hat auch Interviews mit den ganzen Menschen von IBM und Lenovo geführt. Also der ist da sehr gut vernetzt. Aber warum etwas machen, was es schon gibt? So und dann dachte ich mir, dann wäre doch vielleicht so ein Podcast, so ein Format, das darf ich ja schon machen, hast du schon gesagt, den Focus on Linux Podcast ist der erste, den ich moderieren durfte mit Fax informalka haben wir auch eine sehr lustige Runde, die sehr viel Spaß macht. Aber so ein Ding alleine machen ist ja auch noch mal was, wo man was Neues lernt. Also das ist noch mal egal, wie viel Podcast zu vorher aufgenommen hast, wenn du im Prinzip alleine in so ein schwarzes Loch reinsprichst, das ist noch mal eine Umstellung, wie du es produzieren musst, wie du das Storytelling machst. Und deswegen dachte ich, nein, probier es mal aus und wenn die Leute Interesse daran haben, dann machst du es weiter. Und wenn du merkst, nach drei Folgen, das hört kein Mensch, naja, dann war es halt ein Versuch wert. Und naja, jetzt haben wir die achte Folge, habe ich gerade vor ein paar Tagen veröffentlicht. Also es scheint wirklich in dieser Nische und man muss ja sagen, Thinkpads ist eine Nische und das noch auf Deutsch, ist halt die Nische in der Nische. Und wenn du da trotzdem Leute findest, die sich das freiwillig anhören, dann scheint es da doch Interesse für zu geben. Und seitdem mache ich das seit knapp einem Jahr.",
      "start": 904480,
      "end": 1064958,
      "confidence": 0.91465837,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dieser Richard Zappa oder Zappa Zappa, Amerikaner.",
      "start": 1065094,
      "end": 1070366,
      "confidence": 0.68629146,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Vermutlich oder deutscher tatsächlich ein Bayer, der in Mailand dann gelebt hat und da ausgewandert ist, aber in Guatemala geboren wurde. Richtig wilde Lebensgeschichte. Auch spannend, weil seine Großväter auch alle Richard hießen. Zweitausendein.",
      "start": 1070398,
      "end": 1084056,
      "confidence": 0.91679823,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und der hat wirklich den ersten Thinkpad designt oder kam der dann erst später?",
      "start": 1084238,
      "end": 1089156,
      "confidence": 0.9044357,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Na, der war eigentlich so der leitende Designerberater von IBM. Der hat, ich glaube 79, wenn ich es richtig weiß, hat er angefangen und hat halt viele Designs übernommen aus der Zeit erstmal. Und damals hat halt IBM diese grau beigen Boxen gebaut und er hasste das Design unfassbar, weil er sagte, das sind so langweilige, hässliche Kisten ohne Emotionen, ohne Witz, überhaupt nicht sinnvoll designt. Und dann hat er halt so Designstudien gemacht, wie so Lehrgehäuse aussehen könnten. Ob da jetzt ein Server, eine Schreibmaschine oder Laptop drin ist, ist ja erstmal egal. Er hat quasi so die grundlegende Designsprache hat er erstmal definiert und hat dann im Prinzip Designs festgelegt, die seit dem ersten Thinkpad 1992 bis heute noch gelten. Also dieses schwarze Design ist bewusst eine Metapher auf so eine mystische Zigarrenbox auch. Also die ersten Laptops waren ja kleiner, das waren ja eher so vier zu drei Gehäuse, so 1010 Zoll. Und das war halt genau das Zigarrenschachteln Format. Und durch dieses schwarze Gehäuse sahen die Geräte mystisch aus, weil damals halt Sony und wie sie alle hießen, Toshiba halt super langweiliger graue Kisten gebaut haben. Und dadurch knallte halt auch die Farbe der ersten Farbdisplays mehr. Die waren damals nicht sehr gut, aber wenn das Außengehäuse schwarz ist und dann dann kommt halt auch nicht so geiles Farbdisplay ziemlich farbenprächtig rüber.",
      "start": 1089228,
      "end": 1166374,
      "confidence": 0.9089364,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und von welcher Ÿousand Zeit sprechen wir da jetzt jahreszahltechnisch?",
      "start": 1166462,
      "end": 1171204,
      "confidence": 0.773079,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also das erste kam 1992 raus und das war auch so das erste Design, das er da schon mitgeprägt hat. Also es kamen danach noch andere Geräte raus, die so ein bisschen mehr die alte Designsprache noch hatten. Das ist dann ein bisschen darauf zurückzuführen, dass die Geräte vielleicht schon länger in der Planung waren oder auch andere Firmen involviert haben. Denn das haben sie auch häufig gemacht, dass sie Kollabos gemacht haben mit Acer z.B. oder mit Cineth Data Systems ist auch eine grandiose Fehlkonstruktion gelungen und so weiter, Ÿousand. Aber seitdem ist eigentlich das Grunddesign unverändert, größtenteils.",
      "start": 1171292,
      "end": 1199226,
      "confidence": 0.9226106,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das heißt aber, es hat damals schon so Acer und Toshiba und solche Firmen auch gegeben, die Laptops gebaut haben.",
      "start": 1199298,
      "end": 1205970,
      "confidence": 0.8927905,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, genau. Also ich habe jetzt von Acer so die Jahre nicht im Kopf, aber z.B. nEC war eine Marke, die relativ früh Laptops produziert hat. Dann haben wir Compaq. Compaq ist ja groß geworden damit, dass sie den ersten Klon eines IBM tragbaren Rechners gebaut haben. Ich sage jetzt bewusst nicht Laptop, weil die sahen eher wie Nähmaschinen aus. Ÿousand. Es gibt viele Marken, die es schon relativ früh gab. Compact ist z.B. eine davon.",
      "start": 1206050,
      "end": 1225896,
      "confidence": 0.9146942,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "So einen hat die auch. Ich glaube, es war ein IBM. Ich habe den von meinem Bruder, der in der IT gearbeitet hat, mal mehr oder weniger geerbt. Keine Ahnung mehr, in was für einer Zeit das war. Das war so ein 15 Kilo Teil. Man hat die Tastatur so runtergeklappt und dahinter hat sich so ein mini Bildschirm versteckt. Der war, glaube ich so klassisch mit den grünen Farben, also schwarz grün, sehr schön. Da habe ich meine ersten Spiele gespielt ohne Festplatte, nur mit Floppy. Betriebssystem war auf der Floppy oben. Das waren noch coole Zeiten.",
      "start": 1225928,
      "end": 1253336,
      "confidence": 0.90636,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, absolut. Und da kommen halt diese ersten Designs her mit diesen grauen Kisten, die eher nicht so liebevoll gestaltet aussahen. Und diese Sprache endete dann halt eben einfach.",
      "start": 1253368,
      "end": 1262624,
      "confidence": 0.91854966,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du redest von Kiste und von welcher Größe reden wir denn jetzt gerade hier? Also du hast jetzt gerade mal so ein 1315 Zoll MacBook, da kann sich jeder, glaube ich, mal vorstellen, wie groß das ist, weil jeder schon mal im Apple Store war. Kann man irgendwie sagen, okay, von so einer Kiste, grauen Kiste, wie du gerade sprichst, ist das dann dreimal, viermal das Laptop in der Höhe, oder?",
      "start": 1262712,
      "end": 1282932,
      "confidence": 0.9271979,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also wir reden jetzt von diesen Lackables, also von diesen wirklich nähmaschinen großen Kisten, die so. So kann man sich das glaube ich vorstellen. Also das Gerät, das Wolfgang z.B. gerade meinte, das war halt eher so wie eine Nähmaschine. Das war also wirklich bewusst kein Laptop, weil deine Hüfte ist vermutlich oder deine Beine sind relativ schnell durch, wenn du da diese Maschine darauf abstellst. Das war eher sowas, das hast du ins Auto geschleppt oder in den Bus und dann wieder ins Büro und das hast du nicht lange alleine getragen.",
      "start": 1283036,
      "end": 1310528,
      "confidence": 0.87147933,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dann lass uns mal kurz über Notebook sprechen. Gibt es eine Kurzgeschichte zu den Thinkpads? Also wie kam es zum ersten, zum ersten Notebook? Was war überhaupt das erste Thinkpad, was man, wo man heutzutage zurückblickt, wirklich von ThinkPad reden kann? Weil wie gesagt, die Nähmaschinen die grenzen aus.",
      "start": 1310584,
      "end": 1327760,
      "confidence": 0.8660894,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, ja, also das erste Thinkpad, das erschienen ist, ist das T. Also 700 ist generell auch die erste Serie und das ist halt eigentlich sogar ein Slate Tablet gewesen. Also das sollte als limitiertes Notebook erscheinen. Hat er inoffiziell den Namen IBM 2521 ThinkPad. IBM hat wirklich ein Händchen dafür, sehr lange Produktnamen zu wählen, die sich kein Mensch merken kann. Das haben sie dann noch festgestellt und haben dann kurzerhand das Gerät noch umbenannt in T und im Prinzip aber gleichzeitig erschien halt eben auch das normale 700, was so ein 10 Zoll Gerät ist, mit einem er sowie die Farbversion 700 C. Das war eben das gleiche Gerät, nur mit dem mit dem ersten Farbdisplay. Das hatte nämlich schon 256 Farben bei 640 mal 480 Pixeln. Beides glaube ich, Werte, wo die meisten Zuhörenden sich jetzt denken, okay, cool. Und was macht man damit?",
      "start": 1327840,
      "end": 1378856,
      "confidence": 0.90364075,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Hilfe mal, was ist ein slate Tablet? Ist das irgendwie ein neues Jugendwort oder Slay?",
      "start": 1379008,
      "end": 1385824,
      "confidence": 0.88440335,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, das slate Tablet, das sollten wir jetzt mal als Marke eintragen lassen. Nee, Slate Tablet ist im Wesentlichen, stell es dir vor, so ein bisschen wie so ein iPad vielleicht. Also so ein Gerät, was jetzt keine Tastatur hat, sondern du hast halt hinten noch ports und kannst daraus dann Tastaturanschluss rausführen oder sowas, also wie so ein iPad, nur halt vermutlich so neunmal so dick.",
      "start": 1385952,
      "end": 1409712,
      "confidence": 0.90339446,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber die waren ja eigentlich damals schon verdammt klein. Also ich würde fast sagen manchmal, also waren vielleicht dicker als Notebooks heutzutage, aber sonst waren die ja kleiner als eine klassische Tastatur. Also die hatten ja teilweise Probleme, die Tastatur überhaupt unterzubringen. Zweitausendein von da, von der Breite und Höhe.",
      "start": 1409776,
      "end": 1426038,
      "confidence": 0.938772,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Absolut, ja. Also die ersten Geräte, die hatten wirklich relativ kleine Displays, so 10,4 Zoll. Klar, da ist noch ein bisschen Displayrand, aber trotzdem 10,4 Zoll, ich glaube, das ist in etwa das das Format, was auch so ein iPad im Moment hat. Ja, und wenn man sich da noch einen Rand rum denkt, dann ist es trotzdem noch relativ klein, weil auch IBM lange als Benchmark hatte, dass die Geräte noch auf so einem Tisch von so einem Flugzeugsitz passen sollen. Also deren Vorstellung war immer der Businessmensch, der im Flugzeug sitzt und während seinem zweistündigen Flug noch die letzte Präzi und die letzten Excel Zahlen da irgendwie klicken muss, für den waren die Geräte gedacht und natürlich haben sie deswegen auch genau die Größe dann erfüllt.",
      "start": 1426174,
      "end": 1463378,
      "confidence": 0.9074941,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Fun Fact, wo wir gerade bei Flugzeugen sind, es gibt auch so eine these im Podcasting Bereich, dass eine optimale Podcastlänge für eine Podcast Episode die Länge eines Inlandsfluges ist, eines deutschen Inlandsfluges.",
      "start": 1463434,
      "end": 1475922,
      "confidence": 0.9174388,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich dachte, die sind verboten, diese Inlandsflüge.",
      "start": 1476066,
      "end": 1478246,
      "confidence": 0.78058857,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, für Ryanair und Co. Wird sich das wohl bald legen. Aber du hast gerade gesagt T und C. Mit C hast du von der Farbversion gesprochen, gehe ich stark davon aus, dass dann C für Color steht und T steht dann für 700 Thinkpad oder wofür steht das T?",
      "start": 1478338,
      "end": 1495446,
      "confidence": 0.9099178,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das T ist für Tablet und das ist eine von diesen Postfixes, die dann auch immer noch relativ lange benutzt wurden. Also es gab auch später Geräte, die noch ein T hatten. P für Performance war sehr geläufig. Z.B. s für Slim hatte Wolfgang ja auch vorhin kurz mal erwähnt. Das sind so berühmte Abkürzungen, die dann noch mit reingebaut werden, damit man halt genau weiß, was für eine Ausprägung ist das Gerät dann. Ist es ein Standardgerät, ist es ein Tablet, ist es ein high Performance Gerät?",
      "start": 1495518,
      "end": 1520570,
      "confidence": 0.92581457,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber die gibt es immer noch, die prefixes?",
      "start": 1520650,
      "end": 1522322,
      "confidence": 0.9103513,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Die gibt es zum Teil immer noch. Also die S z.B. die sieht man häufig. P ist jetzt auch wieder in Teilen eingeführt worden. Zwischendrin gab es aber echt eine Reihe weiterer Postfixes, die es nicht mehr gibt, aus Gründen, die ich verstehen kann, weil wenn wir irgendwann das ganze Alphabet noch hinten dranhängen, dann wird es irgendwann schwer dann noch einen Unterschied raus zu lesen.",
      "start": 1522346,
      "end": 1539654,
      "confidence": 0.9128073,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und wie stark waren so die die ersten, so die er Serie? Was was für Prozessoren waren da drinnen?",
      "start": 1539702,
      "end": 1545798,
      "confidence": 0.8629163,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also bei der er Serie war ein Intel 80 er mit dekadenten 20 bis 25 MHz und du hattest mindestens vier maximal 16 MB RAM, das besagte 10 Zoll Display und ja, was soll ich sagen, 122 mb Festplatte. Das ist natürlich schon brachial viel gewesen damals bei 3,5 kg wohlgemerkt. Aber leicht war das Gerät definitiv nicht.",
      "start": 1545894,
      "end": 1568758,
      "confidence": 0.9036957,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "War das nicht Bill Gates, der sagte, man braucht nicht mehr Rechenpower?",
      "start": 1568814,
      "end": 1571694,
      "confidence": 0.9839992,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Für die Zukunft hat er vermutlich nicht an die Geräte damals gedacht, aber also.",
      "start": 1571742,
      "end": 1576606,
      "confidence": 0.92852217,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich finde es, ich finde es eigentlich ganz cool, weil wenn man jetzt so das ER 3 kg z.B. oder die c 3,5 kg ist alles noch verkraftbar. Also für gerade wenn man, wenn man sich überlegt, was 480 damals so als Desktop Variante gewogen haben mit dem ganzen Case und so weiter, das waren ja definitiv über 10 Kilo meistens oder sowas. Aber also da ist drei Kilo ja schon eigentlich eine sehr coole Entwicklung. Also auch gerade für die damaligen Verhältnisse, aber sogar für heute, weil das noch ja durchaus im Rahmen. Also irgendwelche Gaming Laptops wiegen wahrscheinlich immer noch so.",
      "start": 1576638,
      "end": 1610034,
      "confidence": 0.8427667,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, das stimmt. Also wir sind auch glaube ich echt verwöhnt. Also ich meine, wenn wir uns mal angucken, so ein übliches Laptop, dass du dir heute kaufst, egal ob es jetzt ein MacBook oder von einem anderen Hersteller ist, da hast du halt schon selten mehr als 2 kg. Also da musst du wirklich schon eine fette 1516 Zoll Workstation haben mit einer dedizierten Grafik, dass du darüber kommst. Und damals war das halt so ja, du willst ein 10 Zoll Gerät? Klar, kannst du haben, wiegt aber dreieinhalb Kilo und die Leute haben sich gefreut. Oh nur dreieinhalb Kilo? Das ist ja Wahnsinn.",
      "start": 1610122,
      "end": 1636630,
      "confidence": 0.897437,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja gut, aber ich kann mich noch daran erinnern, als ich CRT Monitore Solan Partys geschleppt hat. Also von daher, da würde ich mir auch ein dreieinhalb Kilo Laptop wünschen.",
      "start": 1637130,
      "end": 1644034,
      "confidence": 0.81471133,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Auf jeden Fall.",
      "start": 1644082,
      "end": 1644682,
      "confidence": 0.96504,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also zum Vergleich, weil ihr gerade aktuell ein TS bestellt habe, der wiegt 1,3 kg. Zweitausendein.",
      "start": 1644746,
      "end": 1650780,
      "confidence": 0.80451685,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja und das ist wirklich irre. 1,3 kg, das waren früher die Sub Notebook Klasse, da hat man so geringe Gewichtszahlen hinbekommen und mittlerweile kriegt man das in einem Standardgerät. Das ist schon beachtlich, was sich da getan hat in den letzten Jahren.",
      "start": 1650850,
      "end": 1662416,
      "confidence": 0.9329935,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "TS hast du gesagt Wolfgang, das T steht für was?",
      "start": 1662488,
      "end": 1666296,
      "confidence": 0.941849,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Think Bad, schätze ich mal, oder?",
      "start": 1666368,
      "end": 1668232,
      "confidence": 0.783525,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es gibt verschiedene Serien, deswegen gut, dass du das ansprichst. Es gibt die t Serie, das ist quasi so die Standardserie, eine der ersten Serien auch. Dann gab es relativ lange die r Serie, das war so Ÿousand für die Business Kundinnen, die jetzt schon Power haben wollten, aber jetzt nicht so ein hochwertiges Gehäuse mit edler Gummierung haben wollten, die also auch ein Plastikgehäuse in Kauf genommen haben. Dann gab es die x Serie, das waren tragbare, dünnere Geräte für die Leute, die viel unterwegs sind, im Zug oder im Flugzeug. Da gibt es eben viele dieser Serien und T ist halt so mit Abstand die bekannteste, könnte man sagen.",
      "start": 1668336,
      "end": 1700694,
      "confidence": 0.91844225,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ist auch immer die teuerste eigentlich so gewesen, oder? Groben und ganzen zumindest.",
      "start": 1700742,
      "end": 1704502,
      "confidence": 0.85813,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, also Ÿousand, die haben schon. Das ist mittlerweile glaube ich, anders. Mittlerweile sind ja diese x Carbon Produkte, das sind ja die Ultrabox, die lässt sich Lenovo mittlerweile echt vergolden. Also da ist, fangen die Preise bei 2000 an. Jetzt haben sie eine neue Edel Variante rausgebracht für 2800. Wenn du natürlich dir so eine 17 Zoll CAD Workstation mit dem zweiten Bildschirm oder so noch geklickt hast damals, dann warst du da deutlich drüber. Aber die t Serie ist jetzt bewusst so gewählt, dass sie schon teuer ist, aber dass man auch was fürs Geld kriegt und die Leute dann doch vielleicht eher geneigt sind, die T Serie und nicht eine r Serie zu nehmen, die heute übrigens L heißt.",
      "start": 1704566,
      "end": 1738850,
      "confidence": 0.92977107,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die T. Warum heißt die r Serie jetzt aber immer L Serie?",
      "start": 1742310,
      "end": 1745582,
      "confidence": 0.85399914,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Weil man das Branding irgendwann gewechselt hat. Also R hat man irgendwann sterben lassen und hat sich gedacht, dann nehmen wir vielleicht L. Ich weiß nicht, also das steht sicherlich nicht für low budget, aber es zeigt halt eben, dass es unterhalb der T Serie, weil T klingt ja auch schon so erhaben, so das ist ein t Modell, Ÿousand, das sagt man ja auch über die ein oder andere Automarke. Und ich glaube, dass man da halt einfach jetzt andere Buchstaben für genommen hat.",
      "start": 1745686,
      "end": 1767924,
      "confidence": 0.91025823,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt ist es so, jetzt habe ich im Intro gesagt, no one got fired for hiring IBM oder for buying IBM. Und das ist ja anscheinend immer noch wahr. Jetzt sprechen wir auch von Thinkpads und in meinem Kopf ist das immer IBM Thinkpads, aber du hast den Namen auch schon gedroppt. Irgendwie sprechen wir jetzt gerade auch von Lenovo. Kannst du den Knoten in meinem Kopf mal lösen?",
      "start": 1768052,
      "end": 1788020,
      "confidence": 0.9162668,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das ist lustig, weil das sagen alle Leute. Also alle Leute, die Thinkpads hören, sagen, ah ja, hier, diese IBM Geräte. Also da hat das Branding wirklich außerordentlich gut funktioniert, weil im Endeffekt die Geräte werden seit 2005 von Lenovo produziert oder das Geschäft ist endgültig seit 2005 bei Lenovo gelandet. Von daher, da geht es dir wie es vielen anderen geht. Ja, also sie haben halt 92 angefangen, diese Produkte zu fertigen und 2005 das ganze an Lenovo abgegeben. Und da gab es mehrere Gründe für. Also generell muss man sagen, das PC Geschäft ist halt, glaube ich, ein Markt, der ist hart umkämpft und der ist nicht so profitabel, wie er in den ER und in den ERN war. Also in den ERN ist natürlich IBM mit dem IBM PC groß geworden, haben super viel Umsätze gemacht. Und als dann aber die ersten Klone rauskamen und die so langsam besser wurden, dann hat sich das halt auch nicht mehr so richtig gelohnt. Also generell das Geschäft mit der Endkundschaft ist sicherlich nicht so profitabel, wie wenn du große Behörden oder andere Kundinnen hast, die halt einfach in Maßen abnehmen, dass du im Prinzip dir deine goldene Nase machen kannst. Also IBM hat halt gesagt, es gab geringe Margen, hohe Entwicklungs und Fertigungskosten, weil sie wollten ja auch einen gewissen Qualitätsstandard haben. Sie wollen ja keinen billigen Schrott verkaufen, weil damit dezimiert du ja deine eigene Marke, wenn du eine tolle, hochwertige Marke hast und dann billige Produkte raushauen musst, um noch genügend beizuverdienen. Plus die Konkurrenz war halt eben sehr aggressiv. Du hast ja wirklich auch im Consumer Bereich zu günstigen Preisen an der Ecke Notebooks bekommen. Und auf der anderen Seite sind wir natürlich auch ein Stückchen weit schuld. Wir wollen natürlich auch nicht €6000 für Laptop ausgeben. Also wir sagen ja schon über €2000, das ist die Schmerzgrenze, mehr wollen wir nicht ausgeben, prinzipiell, außer ist ein Apple Logo drauf, dann gibt man auch gerne noch mal mehr aus. Und ja, das war dann so das Problem, mit dem sich IBM konfrontiert saß. Es gab auch kein richtiges Alleinstellungsmerkmal mehr, weil halt einfach so viele auch ganz gute Laptops gebaut haben. Dann hat man irgendwann gesagt, naja, könnte das denn jemand vielleicht deutlich günstiger und in größerer Menge produzieren? Denn IBM hat halt auch lange sehr viel selbst produziert. Da hast du ja auch gewisse Kosten. Die Fabs wollen ja irgendwie beschäftigt werden, du hast das Personal, du hast die Materialkosten. Und dann hat sich herausgestellt, Lenovo ist sehr gut im PC Geschäft, die machen das schon eine Weile und dann führt er eins zum anderen. Und das hat, glaube ich, der Marke auch nicht geschadet, weil Lenovo konnte deutlich günstiger und in größeren Mengen produzieren, zweitausendein. Und es wurden halt bedeutend mehr Geräte produziert, als es früher bei IBM der Fall war, weil die halt eben einfach größere Fertigungsmengen hatten, einfach Prozesse hatten, die dann mit übernommen werden konnten. Und deswegen ist es auch so schwer. Das ist ja auch eine Frage, die viele Leute stellen. Was ist denn für dich so das letzte richtige IBM Thinkpad und was ist das erste Lenovo ThinkPad? Das ist schwer zu sagen, weil da gab es halt keinen harten Cut. Ist jetzt nicht so, dass die zum ein und dreiigster erster alles verkauft haben und ab dem 1. Feb. Lief das halt woanders vom Band. Das waren zum Teil dieselben Fähigungsstätten, das waren aber auch zum Teil dieselben Menschen, weil halt die Leute, die mit Begeisterung diese Produkte entwickelt haben, auch 20 Jahre lang, die sind dann halt mitgegangen, die hat man mit ans Boot geholt und die waren dann weiterhin Teil dieses großen Systems. Und deswegen war das eher so ein fließender Übergang, so fließend, dass viele Leute halt immer noch IBM mit der Marke verbinden. Heutzutage.",
      "start": 1788140,
      "end": 1975586,
      "confidence": 0.92394733,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Was ja auch viele, glaube ich, gar nicht wissen, ist, dass Lenovo eine rein chinesische Marke ist und zwar eine Riesenmarke. Also ich habe gerade nachgeschaut, 64 $62, Milliarden Umsatz und die haben sich ja mittlerweile eben IBM zuerst die PC Sparte unter den Nagel gerissen, dann NEC Medion, die klassische. Stimmt, Aldi Marke, Motorola. Dann haben sie die Server von IBM noch aufgekauft 2014, weil die hatte ja IBM dann noch selbst Fujitsu, NetApp. Also das ist wirklich ein riesen Unternehmen und komplett chinesisch und machen eine meiner Meinung nach immer noch sehr gute Qualität. Und ich möchte jetzt gar keine Werbung machen, aber nur, weil ich gerade ein Laptop bestellt habe bzw. Bestellen habe müssen. Schöne Grüße an den Dieb aus Spanien und viel Spaß mit meinem mit meinem C. Aber der neue, der wird customized innerhalb zwei Tagen produziert in China und wird dann innerhalb von ungefähr drei Tagen oder so nach nach Europa geflogen. Also es ist schon sehr cool, was die produzieren.",
      "start": 1975658,
      "end": 2035188,
      "confidence": 0.89679074,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt ist es natürlich so wie beim Essen, das Auge isst mit. Und ich muss zugeben, ich finde IBM Thinkpad oder Lenovo Thinkpads, sorry, aber schön ist anders.",
      "start": 2035284,
      "end": 2044180,
      "confidence": 0.89793,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, du bist ja ein Apple Fanboy. Come on, mit dir kann man ja nichts machen.",
      "start": 2044260,
      "end": 2048692,
      "confidence": 0.8818475,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich hatte früher aber auch mein Asus Laptop, die fand ich jetzt auch nicht schön, weil die auch drei Kilo gewogen haben und so weiter. Doch, das ursprüngliche Design von. Du hast zwar mit einer grauen Box angefangen, Christian. Inzwischen sind sie dann halt sehr wahrscheinlich schwarz. Aber das ursprüngliche Design, eckig, kantig, jetzt klar als Slim Variante verfügbar mit dem s Suffix, aber das ursprüngliche Design mit diesem Trackpad und so hat sich ja nicht viel geändert. Und klar komme ich aus der Apple Welt und ja, Johnny Ivy oder wie der Kollege heißt, wird sich glaube ich im Grabe umdrehen, wenn man sagen würde, ein Thinkpad ist schön. Doch jetzt musst du wir sind jetzt hier im Argumentierclub, versuch mich umzustimmen. So, erklär mir, was ist das für ein Produktdesign und was hat es wirklich mit diesem Markanten auf sich?",
      "start": 2048836,
      "end": 2095952,
      "confidence": 0.9101343,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das Schöne ist, dass die Geräte halt einfach zeitlos sind. Die waren damals schon minimalistisch, so ein bisschen mystisch, funktional und praktisch. Also es ist halt eine schwarze Box, die erstmal interessant aussieht, weil man nicht weiß, was ist, wenn ich sie aufmache? Ist was drin? Ist nichts drin? Ist vielleicht ein bisschen was drin? Sieht es gut aus, sieht es schlecht aus? Und du hast halt diese Designsprache, die halt einfach klar ist. Du hast wenig unnötige Verschnörkelungen, du hast keinen bling bling, keine Touch Bar mit OLED Display, obwohl ich die echt spannend fand, aber das nur als side Notice. Und es beschränkt sich auf das, auf das wirklich nötige und ist dabei halt einfach zeitlos. Also du hast halt auch so schöne Farbakzente, z.B. den roten Trackpoint, den du angesprochen hast. Du hast das Logo ist um, ich bin mir sicher, das wollt ihr alle wissen, -43 Grad angewinkelt, Ÿousand und der i Punkt, der ist natürlich rot und auf der Rückseite des Displays leuchtet dieser auch. Also so eine pulsierende Animation, wenn du im Standby bist. Und diese rote Farbe, die ist halt einfach ein wunderschöner Kontrast, weil sie dir zeigt, wo du interagieren kannst. Nämlich die Kante der Maustasten, die hat halt eben auch so eine kleine rote Zierde und dann weißt du, okay, da kannst du deine Finger drauflegen und der Trackpoint, der lädt natürlich auch ein, dass du ihn benutzt, wenn er dich schon rot anstrahlt. Das ist, glaube ich, man muss, glaube ich, diesen Minimalismus Style mögen. Man muss auch, glaube ich, so ein bisschen das Zeug mögen, das Richard Zappa designt hat. Zweitausendein, dann spricht einen das an.",
      "start": 2096016,
      "end": 2176350,
      "confidence": 0.9053264,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, es gibt halt einfach die, die das schöne Industrial Design verstehen und dann gibt es halt die, die diesen überteuerten Apfel kaufen.",
      "start": 2176470,
      "end": 2183090,
      "confidence": 0.91596437,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich wollte das eigentlich gar nicht in so einer Lenovo versus Apple Konversation abdriften lassen, weil ich habe auch Mac oder Apple Geräte, also ich bin auch ein großer Fan von iPhones und iPads und die finde ich auf ihre eigene Art und Weise auch Sehr schön. Aber das ist halt jetzt kein typischer er Jahre Minimalismus, würde ich es jetzt mal nennen.",
      "start": 2183550,
      "end": 2201738,
      "confidence": 0.9334851,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber mal ganz kurze Frage an euch beiden spricht es nicht schon Bände, dass wir hier Laptops konstant und Tablets auch mit Apple Geräten vergleichen? Also anscheinend ist das Branding da auch sehr gut.",
      "start": 2201794,
      "end": 2212234,
      "confidence": 0.9491209,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, aber weil du, weil du der große Apple Fanboy bist.",
      "start": 2212362,
      "end": 2215626,
      "confidence": 0.75468,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber Chris, ich habe nie gesagt, dass ich ein iPad habe, aber Christian vergleicht auch die ThinkPad Tablets mit iPads. Also verstehst du, das Branding ist halt da.",
      "start": 2215818,
      "end": 2223898,
      "confidence": 0.9624639,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, voll. Und die haben auch beide in ihrem Kontext ihre Daseinsberechtigung. Ich finde, Apple baut wunderbar hochwertige Geräte, die schick aussehen, die ihren erfüllen. Und ich würde auch garantiert nichts anderes als ein iPhone als Smartphone haben wollen. Aber wenn es halt um Rechner geht, da habe ich halt gern mein eigenes Linux Betriebssystem irgendwie drauf mit meinen ganzen Freiheiten, die ich so gerne habe. Und wenn das dann halt auch nur so ein schönes zeitloses Design ist und wunderbar zu der Tischlampe passt, die ich von Richard Zapper hier habe. Hey, dann ist das doch eine Win Win Situation.",
      "start": 2223994,
      "end": 2251266,
      "confidence": 0.92679334,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Was hast du für eine Tischlampe von von Zapper?",
      "start": 2251458,
      "end": 2254138,
      "confidence": 0.7776289,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Richard Zappa ich glaube, da können wir den den nächsten Themenblock mal kurz aufmachen, warum das auch so viel mit Thinkbet zu tun hat. Zweitausendein, das ist halt eben einer der wichtigsten Produktdesigner der zweiten Hälfte des zwanzigsten Jahrhunderts, kann man sagen. Der hat halt einfach so einfache und klare Form Design, die zeitlos und aber auch effizient waren. Also effizient im Sinne von man konnte die einfach produzieren, ohne dass man 20 Fertigungsschritte in der Fabrik brauchte, sondern hat immer das Versuch so zu bauen, dass es auch effizient und günstig zu produzieren ist.",
      "start": 2254234,
      "end": 2280792,
      "confidence": 0.90951264,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber der war nicht bei IBM angestellt, sondern der hat nur IBM beraten oder IM.",
      "start": 2280856,
      "end": 2285064,
      "confidence": 0.90460134,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau richtig. Ja, also der hatte ursprünglich mal angefangen in der Design Abteilung von Mercedes Benz und ist dann nach Mailand ausgewandert und hat da einfach mit vielen anderen Designern Partnerschaften gehabt und auch mit mit großen Firmen, die z.B. möbel oder Küchenutensilien hergestellt haben und hat dann halt eben einfach da seine Designs in Produkte gegossen. Also er hat auch mal angegeben, dass er Industriedesign mehr als Bildhauerei betrachtet, also nicht nur was Funktionales zu haben, sondern was ist vielleicht so ein bisschen auch die philosophische Metapher, die ich damit verbinden will. Und damit war er in meiner sehr erfolgreichen, hat in seinen ganzen Jahren sehr viel Preise gewonnen für Produkte, die es auch wirklich wert sind, nämlich z.B. einmal die Artemie de Tissue, die ich gerade angesprochen habe. Das ist so eine Tischlampe, man muss sagen, die kam 1972 raus. Also wir denken uns jetzt mal 50 Jahre in die Vergangenheit und das ist einfach so die erste Tischlampe, die ohne Federn und Schraubhalterung auskommt und dabei noch schick aussieht. Also das ist eine Lampe, die hat ein Gehäuse, da ist ein Trafo drin im Wesentlichen und sie hat einen sehr kleinen halogen Kopf, wo eben dann die Birne auch drin ist. Und man kann diesen Arm, der ist perfekt austariert. Man man man kann den an sich heranziehen oder von sich wegdrücken, ohne dass da so eine Federhalterung ist. Das kennt man vielleicht heutzutage von diesen Mikrofon Halterungen, die irgendwelche Leute haben, die streamen oder die andere Ÿousand arbeiten machen, Podcasting oder so. Dann nimmt man das ja auch gerne, weil das so eine Feder hat ja einen entscheidenden Nachteil, wenn die nicht perfekt angepasst ist oder richtig festgestellt ist, dann knarzt die, schlägt zurück oder schlägt das Mikrofon ins Gesicht. So und das hat er halt damals schon erkannt, dass das unschön ist und hat einfach eine Lampe gebaut, die man wirklich mit einem Finger wunderbar justieren kann, weil sie in Leichtbauweise ist und dann halt eben in der Position verharrt, weil sie mit Gegengewichten gut designt ist. Und sie kommt sogar ohne Kabel aus, weil das Ganze ist Niederschromspannung. Die ganze Elektronik verläuft innerhalb der Arme und somit sieht man auch keine lästigen Kabel. Das ist ja auch vielen Leuten immer Dorn im Auge, die gerne ein clean Desk haben.",
      "start": 2285112,
      "end": 2406752,
      "confidence": 0.9174217,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Moment mal, das Gehäuse steht dann unter Strom?",
      "start": 2406816,
      "end": 2408552,
      "confidence": 0.98643,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Könnte man so sagen. Es läuft halt innerhalb des Arms ab. Der da. Natürlich wird er noch geschützt sein. Also das in dem habe ich mir jetzt noch nicht angeschaut, aber mir ist auch nicht bekannt, dass Leute sich über über Stromschläge beschwert haben. Also da wird das sicherlich, wenn das.",
      "start": 2408656,
      "end": 2421120,
      "confidence": 0.89945704,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Niedervolt ist, also Niederspannung ist, ist es kein Problem, wenn das Gehäuse unter Strom steht.",
      "start": 2421240,
      "end": 2425308,
      "confidence": 0.82364666,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, Okay. Also da sagt der deutsche TÜV was anders.",
      "start": 2425364,
      "end": 2428600,
      "confidence": 0.724433,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Was glaubst du, wo du überall 12 v Anliegen hast, Andy, dürftest du das Auto auch nicht angreifen.",
      "start": 2430020,
      "end": 2435148,
      "confidence": 0.8732306,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber Richard Sapper, der hat ja auch diese rote Farbe, von der wir die ganze Zeit sprechen, mit diesem Trackpoint und so weiter. Die hat er ja auch irgendwie geprägt. Und so viel ich weiß, kommt die auch in anderen Elementen z.B. in der Lampe vor, oder?",
      "start": 2435244,
      "end": 2450284,
      "confidence": 0.93849534,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Richtig. Also wenn wir uns die Tease so angucken, ich bin mir sicher, da haben wir bestimmt auch noch einen Link in den Show Notes. Da sieht man halt, das ist auch halt auch wieder eine schwarze, relativ zeitlose Lampe und als Kontrast Element hast du halt überall da, wo du interagieren kannst, nämlich der an und Ausschalter oder an der Halogenlampe oben, da ist noch ein Abstandshalter, so eine kleine Metallspange, weil während der Ern gelebt hat und eine Halogenlampe hatte, der weiß, wenn man da dran fasst, das wird ganz schnell sehr heiß und tut weh. Und deswegen ist dann eine Abstandshalterung. Und damit er nicht nur so ein Metallstab raussticht, hat er an das Ende noch so einen roten Nupsi dran gemacht, dass man halt mit dem wunderbar die Lampe noch justieren kann. Und das ist eben jener Farbton, der auch im Checkpoint eben auftritt. Also das ist halt so ein Element, das er da schon zum ersten Mal drin hatte und das bis heute eben in den Notebooks noch zu sehen ist.",
      "start": 2450372,
      "end": 2496674,
      "confidence": 0.9013071,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt gilt ja rot eigentlich als Warnfarbe, im Westen zumindest. Jetzt bin ich mir nicht sicher, warum ich einen Mausersatz rot als Warnfarbe signalisieren sollte.",
      "start": 2496762,
      "end": 2508154,
      "confidence": 0.9142384,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist eine gute Frage. Also für viele Leute ist es sicherlich eine Warnfarbe. Wir haben ja eine rote Ampel z.B. damit wir die sofort sehen. Zweitausendein. Auf der anderen Seite haben wir aber auch den roten Porsche oder andere emotional behaftete Gegenstände, die die Farbe rot haben. Und das ist auch die Metapher, die er gewählt hat, weswegen er halt eben diese Interaktionsflächen mit rot oder blauen Signalfarben haben wollte. Und das führte auch übrigens dazu, kleiner kleiner Trivia Effekt an der Seite. Eigentlich sollte der Trackpoint gar nicht rot sein, sondern magenta Farben, denn die IBM corporate identity sagte rot ÿousand ist eine Gefahrenfarbe, das ist bei uns der Not aus für den Mainframe. Und das wollte Sapa aber so nicht hinnehmen. Deswegen hat er einfach folgendes gemacht er hat in seinem ersten Design den Magenta Farben gemacht, Farbcode TP 303 und dreiig übrigens und hat dann in den nächsten Iterationen halt einfach, weil die Leute gucken ja nicht drauf, was du ablieferst. Und dann hat er das so fünf, sechs, sieben mal immer neue Versionen rausgebracht und hat dann immer den Farbton bisschen angepasst, bis er halt signalrot war. Dann lief die Produktion an und dann hat die corporate identity gemerkt moment mal, das ist ja gar nicht magenta. Richard, was hast du gemacht? Und dann lief das leider schon los und die ersten Testberichte haben gesagt, was für eine wunderbar schöne, emotionale, sportliche Farbe das denn hätte und dass es ja Anmutungen eines Sportwagens hätte. Und dann hat er dann gesagt hier Moment mal, Leute, die Leute wollen das haben, also ihr könnt doch jetzt nicht wieder Magenta hier mit ins Spiel bringen.",
      "start": 2508202,
      "end": 2587814,
      "confidence": 0.92136544,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und das ist schon eine gute Entscheidung, meiner Meinung nach. Interessant ja auch, dass es einen Not aus eigentlich für Mainframes gibt.",
      "start": 2587862,
      "end": 2593622,
      "confidence": 0.89596957,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ob es denn immer noch Ÿousand generell. Also bei Server Racks hast du eigentlich immer bei großen Anlagen eine Not aus hinten, den du umlegen können musst, wenn du so eine Anlage wirklich mal ausknipsen musst. Und der ist natürlich dann rot aus guten Gründen.",
      "start": 2593726,
      "end": 2605924,
      "confidence": 0.8687838,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Umlegen. In der Regel ist das so ein Schalter, so ein Druckknopf, der einrastet, oder umlegen. Wir sind doch jetzt nicht im Hochspannungswerk, da wo du wirklich noch so klack was umlegen musst.",
      "start": 2606012,
      "end": 2616668,
      "confidence": 0.87299454,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich muss zugeben, ich sehe leider viel zu selten Rechenzentren von innen in meinem Job. Also ich habe sehr wenig noch mit echter Hardware zu tun und freue mich jedes mal, wenn ich echte Hardware sehe und so eine schöne große Anlage, die in einem Rack drin ist. Ja, also ich glaube nicht, dass es wirklich so ein großer Not aus ist, aber du hast auf jeden Fall Leisten, die du ausschalten können musst. Und die werden dann sicherlich auch eine rote Signalfarbe haben.",
      "start": 2616724,
      "end": 2637766,
      "confidence": 0.9275627,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also das ist jetzt Aufgabe für unseren befreundeten Wartungsfenster Podcast. Die sollen das mal rausfinden und uns das genau erklären, wie das mit den Notausschalten.",
      "start": 2637838,
      "end": 2646646,
      "confidence": 0.878338,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, bitte.",
      "start": 2646718,
      "end": 2647486,
      "confidence": 0.956205,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber was natürlich schon auch irgendwie Bände spricht und jetzt mal wieder ein Vergleich zu Apple, muss man ja leider sagen. Du hast auf der IBM, auf der Lenovo Seite Richard Zappa auf, der halt maßgeblich anscheinend für die Designs zuständig war, für diese kleinen Twists mit der mit der roten Farbe. Und war der auch irgendwie am Logo mit beteiligt? Weil das hat sich glaube ich, auch ein paar mal geändert, richtig?",
      "start": 2647638,
      "end": 2667534,
      "confidence": 0.9099227,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das weiß ich nicht. Also er war eigentlich eher so ein Produktdesigner. Er hat ganz viel Küchengeräte, Telefone, Fernseher, Laptops und so weiter designt. Ich glaube Logos hat er, wenn dann nur beiläufig gemacht.",
      "start": 2667622,
      "end": 2677574,
      "confidence": 0.9133124,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ÿousand und auf der Apple Seite hast du halt Johnny Ivy oder Johnny Eve, wie er heißt. Es schon faszinierend, dass es halt ganz wenige große Köpfe für doch schon, ja, wie soll man sagen, einen sehr großen Impact verantwortlich sind, oder?",
      "start": 2677582,
      "end": 2690596,
      "confidence": 0.8589355,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Absolut, ja. Also es ist auch wirklich bemerkenswert, wenn man sich damit beschäftigt, welche anderen Designs Zappa z.b. auch noch geprägt hat. Also jetzt auch nicht nur innerhalb des IBM, sondern auch andere Dinge. Also mir fällt da ein ganz ikonisches Design ein. Das ist im Prinzip ein Rechner, der designt wurde, bevor er zu IBM kam. Also hat ein nicht ganz fertiges Design übernommen und deswegen ist es noch so eine graue Box. Das ist der erste IBM PC Convertible 5140. Ich denke mal, auch da packen wir bestimmt Link in die Show Notes. Das sieht relativ unspektakulär aus, wenn man sich das Gerät von vorne anguckt. Das ist halt einfach so eine längliche Kiste und hat halt eine Tastatur, hat zwei Maus, hat zwei Diskettenlaufwerke und einen Bildschirm. Aber wenn man sich das Gerät von der Seite anschaut, dann hat das eine Metapher eines Krokodils. Und zwar sieht es von der Seite so aus, dass wenn man den Bildschirm anhebt, dann ist es wie die Schnauze, die Tastatur sind wie die Zähne, der Knopf zum öffnen des Displays sieht aus wie zwei Augen und optional konnte man hinten noch einen Thermodrucker dran hängen und der Papierauswurf war nach oben, sodass das aussieht wie so ein Schwanz von einem Krokodil. Und das sieht nicht nur witzig aus, sondern es ist eine Anspielung zweitausendein auf die Fertigungsstädte Boca Raton in Florida, wo es eine Alligatorplage gab zu der Zeit. Also quasi sinnvolles Design mit Wortwitz und einer Anspielung als Insider Gag. Das ist natürlich fantastisch.",
      "start": 2690708,
      "end": 2772914,
      "confidence": 0.9082683,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt hat er ja Thinkbad geprägt. Hat er was mit dem Namen auch am Hut oder wäre es mit diesem Namen angekommen oder war das einfach nur keine Ahnung, war sowieso normal damals.",
      "start": 2773002,
      "end": 2784554,
      "confidence": 0.9043912,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also das ist so ein bisschen zur Marke geworden. Das geht zurück auf den Slogan von Thomas J. Watson. Der leitete nämlich IBM oder CTR, wie sie früher hießen, zwischen 1914 und 1955 und hat 1911 im Prinzip den Slogan erstmalig schon benutzt. Er hat nämlich gesagt the trouble with everyone of us is that we don't think enough. We don't get paid for working with our feet. We get paid for working with our heads. Und das ist so ein Slogan, der ist halt sehr, sehr vage. Da kann man viel oder wenig rein interpretieren. Das hat er bewusst so vage gehalten und sagte halt, dass er im Prinzip Mitarbeitende zum Nachdenken anregen wollte, proaktiver zu sein, sich vielleicht auch so ein bisschen als Unternehmer im Unternehmen anzusehen, vielleicht keine Ahnung. So könnte man es interpretieren, dass du quasi mit allem, was du tust, mit dem wie beginnst du ein Gespräch? Was machst du mit der Kundschaft aus? Worüber wollt ihr euch unterhalten? Was sind die nächsten Schritte? Dass man halt alles noch mal über überdenkt. Und das ist dann irgendwie zur Marke geworden. Also die die interne mitarbeitende Zeitschrift hieß Think und dann wurde es halt auch zur Marke. Think Pad war eines der ersten, aber es gibt ja auch heutzutage noch Ÿousand, auch Produkte wie Thinkcenter, Think Vision für die Bildschirme. Und es zierte halt eben auch seitdem die Büros und die Mainframes. Also es stand ganz häufig auf den Mainframes irgendwie Think drauf und in jedem IBM Büro stand das sowieso als Metapher. Also das, was heute das latte Macchiato Wand tattoo ist, war damals bei IBM halt der Think Slogan an der Wand. So kann man sich glaube ich vorstellen.",
      "start": 2784642,
      "end": 2864074,
      "confidence": 0.90132093,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Andi, schreibt ihr den Spruch mal da irgendwo an die Wand?",
      "start": 2864162,
      "end": 2867242,
      "confidence": 0.84199727,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du kannst ich gebe zu, ich habe kein Latte Macchiato Wand tattoo. Hätte dann lieber lieber sowas.",
      "start": 2867306,
      "end": 2872452,
      "confidence": 0.77125293,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Dann Carpe Diem. Irgendeins davon haben doch alle heutzutage.",
      "start": 2872556,
      "end": 2875920,
      "confidence": 0.85836,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber Thomas J. Watson ist auch der Namensgeber Watson für diese Jeopardy KI, die IBM mal 2010 gemacht hat, oder?",
      "start": 2876500,
      "end": 2885100,
      "confidence": 0.9116225,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist auf jeden Fall eine Anspielung darauf. Da wird quasi der frühe CEO noch mal gewürdigt, weil er hat wirklich einen großen Einfluss gehabt. Also er galt als der beste Verkäufer der Welt, weil er wirklich systematisch die Konkurrenz ausgemerzt hat. Also das war, glaube ich, ein sehr aggressives Sales Ÿousand Gehabe, das er an den Tag gelegt hat. Aber damit war er erfolgreich, hat gut Geschäfte gemacht und hat dann aber auch so Dinge eingeführt wie z.B. es gab eine Firmenhymne, es gab ein Firmengesangsbuch und es gab eine Anzugspflicht für alle vertrieblichen Mitarbeitenden und Alkoholverbot auch in der Privatzeit. Also wenn der dich abends am Wochenende in der Kneipe gesehen hat, warst du deinen Job halt los.",
      "start": 2885180,
      "end": 2921386,
      "confidence": 0.93248075,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Firmengesangsbuch klingt so ein bisschen nach Kirche, oder?",
      "start": 2921498,
      "end": 2924070,
      "confidence": 0.9053463,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es klingt so ein bisschen nach Kirche und Sekte gleichermaßen. Ich glaube, das war kein angenehmes Arbeiten, retrospektiv betrachtet. Aber ich glaube, es ist schwer, das zu bewerten, weil wir natürlich in einer sehr privilegierten Zeit wohnen. Wir können uns auswählen, für wen wir arbeiten, wie lange wir arbeiten. Ich glaube, damals war das sicherlich gesellschaftlich ein anderes Thema.",
      "start": 2924530,
      "end": 2942660,
      "confidence": 0.92780036,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt existieren ThinkPads ja schon eine ganze Weile. Ich glaube, was haben wir gesagt? Anfang der ER 92 93 kam das erste ThinkPad und nicht jede Firma landet mit jedem neuen Modell einen Treffer. Die werden da sehr wahrscheinlich auch mal ein paar wilde Sachen gemacht haben, die jetzt nicht so gut angenommen sind. Was würdest du sagen, sind die wildesten Experimente, die IBM versucht hat auf dem Markt?",
      "start": 2942740,
      "end": 2962392,
      "confidence": 0.93521696,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es ist natürlich schwer, das singulär zu beantworten, aber ich habe mir mal fünf Dinge rausgesucht, von denen ich glaube, dass sie schon außerordentlich sind und auch Leute, die sich außerhalb dieses naja, esoterischen Rabbit Holes aufhalten, auch so wahrgenommen werden. Ich glaube, sehr auffällig ist der 701 C, also quasi der Nachfolger des ersten Thinkpads in der Farbversion, denn das hatte nämlich eine Butterfly Tastatur. Und jetzt fragt ihr euch vielleicht okay, Butterfly Tastatur, was soll das jetzt bedeuten? Naja, das war im Wesentlichen eine Tastatur, die sich zur Seite hin diagonal geteilt aufgeklappt hat, wenn man das Gerät hochklappt. Also im Wesentlichen hat man eine größere Tastatur, als eigentlich in das Gerät reinpassen würde. Auch hier wieder 10 Zoll Gerät Benchmark soll auf dem Tisch von einem Flugzeug funktionieren. Aber Leute haben bemängelt beim 700 ja, ist ja schön tolles Gerät, schöne Größe, aber da jetzt meine Excel Tapeten im Flug bearbeiten, da breche ich mir irgendwie immer die Finger ab. Und dann haben sie halt eine Tastatur eingebaut, die sich noch mal ganze 5 cm links und rechts rausklappt. Und der Mechanismus ist halt sehr aufwendig designt worden. Und wenn du den den Bildschirm hochklappst, dann klappt sich halt auch seitlich die Tastatur raus. Und wenn du den Bildschirm runter klappst, dann klappt sich die Tastatur auch wieder ein, so dass du ein schönes kleines Gerät hast. Und wenn du es ausklappst, halt eben eine vollwertige Tastatur, die in etwa so groß ist wie von einem 14 Zoll Gerät.",
      "start": 2962496,
      "end": 3040782,
      "confidence": 0.8883784,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber woher? Woher kommen da die Tasten? Also wo sind die dann versteckt im zusammengeklappten Modus?",
      "start": 3040886,
      "end": 3047174,
      "confidence": 0.89304125,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die Tastatur ist ja diagonal im Prinzip einmal durchgeschnitten und das wird, wenn du das Gerät zuklappst, dann klappt sich die Tastatur nach oben, also die rechte Hälfte nach oben und nach links, sodass es dann zusammengeschoben genau die Abmaße des Geräts einnimmt.",
      "start": 3047262,
      "end": 3061166,
      "confidence": 0.9118951,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also sie wird nur auseinandergezogen, auseinander und.",
      "start": 3061278,
      "end": 3063918,
      "confidence": 0.9094357,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Nach oben und dann zusammengeklappt quasi. So kann man sich. Ich weiß nicht, ob das auf der Tonspur Sinn ergibt, aber so würde ich es beschreiben.",
      "start": 3063934,
      "end": 3070622,
      "confidence": 0.90540844,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich schaue mir gerade die Bilder an und bin sogar auch mit den Bildern irgendwie überfordert, wie der Mechanismus funktioniert.",
      "start": 3070686,
      "end": 3075990,
      "confidence": 0.85672426,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Der Sitznachbar im Flugzeug, der hat sich.",
      "start": 3076030,
      "end": 3078142,
      "confidence": 0.9253314,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Natürlich gedacht krass, was ist das für ein Gerät? Wahnsinn, das will ich auch haben. Naja, ganz so war es leider nicht. Also das Gerät war kommerziell leider kein Erfolg, muss man sagen. Was daran hing, dass es mehrfach Ÿousand verschoben wurde zeitlich. Also es kam eigentlich 95 96 raus, hatte damals noch einen 486, obwohl es schon den Pentium gab. Da waren es halt einfach leider ein bisschen zu spät mit dem Gerät. Aber nichtsdestotrotz wurde das Gerät mit vielen Preisen gewürdigt und man findet das z.B. auch im Museum of Modern arts in New York oder halt bei mir im Museum. Aber ich glaube, New York ins MoMA zu fahren ist dann doch ein bisschen cooler, als bei mir vorbeizugucken.",
      "start": 3078166,
      "end": 3113748,
      "confidence": 0.93077755,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Stellst du das eigentlich hin und wieder irgendwo aus, deine Sammlung?",
      "start": 3113804,
      "end": 3116762,
      "confidence": 0.87507546,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also was ich schon ganz gerne mache, ist, wenn ich auf Konferenzen gehe, dass ich da mit einem besonderen Gerät mal präsentiere. Und was so mittel bis langfristig Mein Wunsch mit dem Museum auch ist, ist es ja schon, irgendwo vielleicht mal eine Gastausstellung zu bekommen. Also das ist vielleicht, das ist jetzt ein wilder Traum. Vielleicht wird er auch nie erfüllt, aber irgendwann mal in so einem Heinz Nixdorf Forum eine Gastausstellung zu haben mit den 20 bedeutendsten Thinkpads, so als als Kurator mit den ganzen Stories dazu, da hätte ich glaube ich schon Bock drauf.",
      "start": 3116876,
      "end": 3144134,
      "confidence": 0.90172166,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also wenn jemand zuhört vom Nixdorf Museum, dann einfach bei uns melden.",
      "start": 3144222,
      "end": 3149050,
      "confidence": 0.91671914,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du hast gesagt, du hast fünf Elemente rausgesucht, Experimente.",
      "start": 3150430,
      "end": 3153198,
      "confidence": 0.9032056,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, genau. Das nächste ist auch extrem interessant und zwar ist es das ThinkPad 550 BJ. Jetzt fragt ihr euch vielleicht, wofür möge jetzt bitteschön das 550 BJ stehen? Das ist Bubblejet und es ist tatsächlich ein Gerät mit einem eingebauten Drucker. Das war eine Kollabo 1993 zwischen IBM Japan und Canon. Und da ist ein eingebauter Canon Tintenstrahldrucker drin, der aber natürlich auch mit Papier noch befeuert werden muss. Also da ist jetzt keine Papierhülle noch mit dabei oder irgendwie ein Auffangbecken, sondern du legst im Prinzip die das Papier unterhalb der Tastatur ein und hinten hinter dem Bildschirm kommt dann das ausgedruckte Papier wieder raus. Und war glaube ich auch so mal ein Experiment, um zu gucken, ob es da einen Markt für gibt. Und ich glaube, da hätte es bestimmt den einen oder anderen Versicherungsvertreter gegeben, der da Interesse daran gehabt hätte. Aber das Gerät war absolut kein Erfolg. Also sie haben dann noch mal eine Nachfolge davon hergestellt, aber das war glaube ich ein bisschen weit auch seiner Zeit voraus vielleicht rein und so könnte ich mir vorstellen.",
      "start": 3153294,
      "end": 3214412,
      "confidence": 0.9024578,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und auch da wieder die Abmessungen sind wirklich der Wahnsinn. Ein und dreiig mal 25 cm, also ist super klein. Klar, 5 cm hoch ist auch ein Drucker und auch wieder nur um die drei Kilo schwer. Also technisch gesehen schon finde ich sehr, sehr große Meisterleistung, was die da so absolut.",
      "start": 3214476,
      "end": 3232288,
      "confidence": 0.9098335,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und 93, da war wirklich das ganze noch sehr limitiert. Die technischen Möglichkeiten, die man hatte, ordentliche Laptops zu produzieren, also 25 MHz und sechs MB RAM war jetzt vielleicht auch nicht so das beste Gerät, aber für die Zeit mit diesem extra sicherlichen Hingucker, was IBM auch eine Zeit lang gemacht hat, zwischen 97 und 2001. Und da würde mich mal eure Meinung interessieren. Wart ihr damals PDA Freunde?",
      "start": 3232344,
      "end": 3254872,
      "confidence": 0.9034169,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nein, ich kam mit Blackberrys auch nicht klar und PDAs nicht. Ÿousand einzig und allein habe ich mal, glaube ich, so ein Ding bei Rihanna im Musikvideo gesehen, wie sie mit Excel irgendwie eine Nachricht geschrieben hat. Aber sonst war ich da kein Freund von. Tut mir leid.",
      "start": 3255016,
      "end": 3268598,
      "confidence": 0.8465533,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Sehr schön, sehr schön. Ja, wie sieht es bei dir aus, Wolfgang? Du bist doch ein Freund.",
      "start": 3268654,
      "end": 3271670,
      "confidence": 0.88609296,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich hatte mal so einen Tungsten. Ja, was war das für eine Marke? Palm? Genau, Palm, die ganze Palm Serie. Genau. Ja, korrekt. Ja, die, die hatte ich mal, aber war auch schwierig. Irgendwie hatte ich so keine richtige Verwendung dafür. Ÿousand hatte auch mal auch wieder von meinem Bruder so Newton geerbt, ein Apple Newton an die Apple Geräte auch mal gehabt. Die waren unglaublich. Die hatten damals schon Handschrifterkennung und so in den ERN, glaube ich, war das. Also waren ihrer Zeit fast voraus, würde ich sagen. Habe dann irgendwo verkauft, so auf ebay Kleinanzeigen oder so. Wahrscheinlich zu billig, hatte wenig Ahnung noch.",
      "start": 3271710,
      "end": 3306612,
      "confidence": 0.87165815,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das ist ja das große Problem. Also es gibt diese, diesen Zeitpunkt, da sind Geräte veraltet, du kannst mit dir nichts anfangen und so 10 Jahre später denkst du dir ich Vollidiot, warum habe ich sie verkauft? Aber diese 10 Jahre durchzuhalten, das ist halt schwierig. Und ja, das war halt auch so das nächste Projekt. Sie haben nämlich die Palmen PDAs genommen und haben die als IBM Workpad verkauft. Das waren dann umgelebelte Palms. Da haben sie so fünf, sechs Stück von rausgebracht zwischen 97 und 2001. Und die konnte dann halt mit deinem Thinkpad auch gemeinsam benutzen, weil es gibt ja noch die Ultra Bay. Das sind diese Adapter, wo du ein CD ROM Laufwerk drin hattest früher oder wo du noch einen Akku reinschieben konntest. Die gibt es ja schon seit vielen Jahren nicht mehr, weil kein Mensch mehr Laufwerke haben will. Genau. Ich fand die auch cool. Und da gab es halt einen Ultra Bay Modul, wo du das konntest du rausziehen und da hattest du da eine vollwertige Dockingstation für so ein Palm PDA. Und deswegen hast du halt einen umgelabelten Palm als Workpad bekommen und konntest dann quasi deine deine wichtigen Arbeitsdinge unterwegs tun, deine E Mails schreiben, deine Aufgaben verwalten und dann den Rechner anknipsen, den PTA rein und dann. Ja, hast du das direkt auf dem Rechner gehabt. Das wollte halt glaube ich keiner mehr haben 2001. Also das war genau die Übergangszeit. Andy hat es ja gerade so schön gesagt, da gab es schon die Dinge wie die Nokia Communicator z.b. leute wollten halten Mobiltelefon und sowas wie ein PTA in einem haben, bevor wir Smartphones hatten. Deswegen wurde das dann eingestellt. Aber cool war es auf jeden Fall.",
      "start": 3306676,
      "end": 3388918,
      "confidence": 0.8864952,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wobei man muss ja auch sagen, eben damals hat es noch kein Bluetooth oder ähnliches gegeben. Du brauchst es eine Dockingstation. Ich glaube da in der er jahren war dann so infrarot eigentlich so das normale oder Ende der er, wie man kommuniziert hat mit einer Baudrate, die keine Ahnung mehr wie viel Zeichen man da pro S übertragen hat. Keine fünf wahrscheinlich oder so. Aber das war es dann auch.",
      "start": 3389014,
      "end": 3408978,
      "confidence": 0.8689027,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Absolut. Ja und das ist halt auch so ein Repitol. Also ich habe früher auch sehr gerne Palms benutzt. Ich habe in der in der Berufsschule da immer mein Hausaufgabenheft quasi drauf gehabt, weil ich einfach nicht so gut handschriftlich schreiben kann. Ich kann das meistens selbst nicht erkennen und ich war halt ein Freund davon. Ich habe halt für alles dann eine Software gehabt, z.B. outlook und da wollte ich meine Aufgaben drin haben mit Verbindlichkeiten, bis wann was fertig sein sollte und das habe ich halt konsequenterweise auch mit den Hausaufgaben gemacht und habe ich sehr sehr schätzen gelernt. Deswegen habe ich ja auch ein paar IBM Workpads in meiner Sammlung, habe leider nicht das Ultra Bay Modul, aber das Thema PTA ist halt auch so ein massives Rabbit Hole. Also da liebe Grüße an den Christoph von der tollen Webseite in love with PDA. Der hat auch IBM Workpads und ganz viele andere PDAs, unter anderem auch diese Apple PDA, die es früher kurzzeitig gab. Ich kenne keinen Menschen, der mit so viel Liebe PDA sammelt wie er.",
      "start": 3409074,
      "end": 3458666,
      "confidence": 0.90508485,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die Webseite selbst ist ein kleiner PDA. Geil.",
      "start": 3458738,
      "end": 3461290,
      "confidence": 0.970165,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist Hammer oder? Also tolles Design auch. Ja, dann gab es noch ein weiteres Kuriosum, das war so 1995 und sechs und neunzigste. Da gab es nämlich die ThinkPad er Serie. Also früher waren auch diese Serien so ein bisschen an BMW Modelle angelehnt. Also es gab z.B. er Serie ist das, was heute die t Serie ist. Das ist eine sehr hochwertige, sehr robuste Serie. Und dann gab es z.B. die ER Serie, die ein bisschen günstiger war. Das was dann zu R oder heute zur L Serie wurde. Und natürlich gab es dann auch die Oberklasse Geräte. Das war die ER Serie, weil er BMW ist ja auch das prestige Modell gewesen und dann gab es noch die ER Serie und die hatte, die hatte so richtig Dampf, weil in Anführungsstrichen, weil die hatte natürlich IBM powerpc CPUs, also Dinge, die wir halt vielleicht eher so aus dem Server oder Workstation Bereich kannten. Das heißt, da konnte man kein klassisches Windows oder Linux drauf installieren, wobei Linux schon, aber jetzt vielleicht nicht so ein Standard Windows, wo man auch sein Standard Office Paket installiert. Da lief dann halt nur NT in einer speziellen Version drauf beispielsweise. Und da war halt auch keine IDE Platte drin, sondern da war halt eine ordentliche SCSI Platte drin. Und das Ding kam halt mit IBM ix, also mit der eigenen Unix Variante, die IBM entwickelt hat. Das ist so kurios. Also Unix Workstations generell sind ja ein absolutes Kuriosum, der er kurz produziert. Kein Mensch wollte sie haben und IBM dachte ja, dann bauen wir sie Laptop ein, dann wollen sie Leute bestimmt haben. Kam halt leider auch nicht so, aber extrem selten diese Geräte. Da gab es nur so zwei, drei Modelle von und deswegen absolut kurios, dass sowas überhaupt existiert.",
      "start": 3461370,
      "end": 3551826,
      "confidence": 0.9127934,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dann mit Power PC 66 MHz. Möchte noch mal dazu sagen, also so richtig hardcore, da geht was weiter mit 66 MHz auf jeden Fall.",
      "start": 3551858,
      "end": 3560266,
      "confidence": 0.8317088,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie viel Akkulaufzeit hatten die denn dann?",
      "start": 3560378,
      "end": 3562234,
      "confidence": 0.90131855,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich glaube die Antwort ist nein.",
      "start": 3562322,
      "end": 3564030,
      "confidence": 0.97631836,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "SCSI Platte, Power PC CPU. Also du merkst schon, wohin das geht. Du kannst dein Haus mit heizen.",
      "start": 3565610,
      "end": 3572210,
      "confidence": 0.8078433,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, also die haben ja bewusst jetzt nicht die stärksten CPUs eingebaut, wie ja gerade schon gesagt wurde, was der PowerPC e und ja, können wir aber trotzdem vorstellen, dass Akkulaufzeit sich da eher als optional verstanden hat. Ich habe auch nie ganz verstanden, was der Use Case dafür war. Also Leute, die Unix machen auf einer Workstation mit irgendwie CAD, die haben vermutlich das nicht am Notebook gemacht, sondern die werden dann halt eine Unix Workstation gehabt haben, eine HP UX Kiste oder so eine Workstation, die IBM ja auch hatte. Also ich habe es nicht ganz verstanden, aber schön, dass sie es trotzdem getan haben und mal ausprobiert haben, wohin die Reise hätte gehen können.",
      "start": 3572370,
      "end": 3607972,
      "confidence": 0.892537,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, es gibt auch immer so Produkte, wo man einfach zeigt, was möglich wäre und ohne, ohne glaube ich im Hintergrund oder im Hinterkopf zu haben, dass die wirklich verkauft zweitausendein.",
      "start": 3608036,
      "end": 3616414,
      "confidence": 0.90518355,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, genau das ist es. Und das letzte Kuriosum, das ich mitgebracht habe, ist ein Thinkpad WDS oder WDS. W muss man sagen, ist war früher die Workstation Serie, deswegen das w. Heutzutage ist es die P Serie, die Performance Serie. Das sind halt die Geräte, die haben halt eine besonders starke CPU die haben ein größeres, ein helleres Display, die haben die stärkere Grafikkarte, die haben vielleicht auch noch einen Eingabestift oder dann eingebaut das Wacom Tablet, das du halt so zeichnen kannst z.B. das ist so das, was man damit abbilden wollte. Und das DS steht hier für dual screen, denn das Gerät hatte einfach einen zweiten Bildschirm, den du rechts noch herausziehen konntest. Und das ist halt wirklich, wirklich kurios, denn wenn wir mal gucken, wann das produziert wurde, es war so 2009 bis 2011. Naja, da gab es halt schon Workstations und vielleicht auch Bildschirme, die du dir halt eben auf deinen Tisch gestellt hast, aber da gab es noch keine mobilen Bildschirme, zumindest nicht, dass mir bekannt wäre. Zweitausendein. Und die haben halt einfach einen Bildschirm in das Gerät eingebaut, den du rechts noch quasi einfach rausziehen konntest. Also der war nicht standardmäßig mit ausgeklappt, das musstest du selbst tun und viele Leute haben das halt genutzt. Das Gerät hat auch 17 Zoll, also die sieben steht für 17 Zoll, um da z.B. die Toolbars abzulegen für deine CAD Software, für Photoshop oder was auch immer für eine Software du da gerade benutzt. Und das ist schon cool, einfach noch einen zweiten Bildschirm zu haben, wenn du ihn denn brauchst und wenn nicht, dann ist er halt einfach eingeklappt.",
      "start": 3616492,
      "end": 3698592,
      "confidence": 0.9203471,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ist ja glaube ich auch gar nicht lange her. Das war das Samsung oder so, die mal sowas präsentiert haben, irgendwie ausziehbar oder aufklappbar oder so. Das ist ja immer wieder gibt es so Dinge, um den Screen noch mal zu vergrößern? Also kommt scheinbar immer wieder.",
      "start": 3698696,
      "end": 3711720,
      "confidence": 0.86304295,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, ich meine, diese Experimente gibt es. War das nicht sogar MSI, die dieses Notebook vorgestellt haben, wo du eine zweite, wo du über der Tastatur einen zweiten Bildschirm hast oder unter der Tastatur irgendwas.",
      "start": 3711800,
      "end": 3723152,
      "confidence": 0.91472346,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Davon, glaube ich, irgendwie so zum dazu hängen oder so drüber stülpen, irgendwie so links und rechts.",
      "start": 3723216,
      "end": 3728964,
      "confidence": 0.79971766,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Da gibt es auch so alle. Ich meine auch alle zwei, drei Jahre kommt irgendein Hersteller um die Ecke und greift den Trend noch mal auf.",
      "start": 3729012,
      "end": 3736836,
      "confidence": 0.9088646,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich meine, da gibt es ja auch viele Dinge, die durchaus innovativ sein können. Z.B. aufklappbare Smartphones sind ja auch durchaus ein Thema, das einige Leute zu interessieren scheint. Und Lenovo hat z.B. auch die x Fold Serie und dann kannst du dir ein 16 Zoll Gerät kaufen, dass du aufklappst. Das hat also keine physische Tastatur, sondern du klappst das auf und dann hast du im Prinzip wie so ein auflaubbares Smartphone, nur dass es halt eben ein vollwertiger Laptop ist. Das hat natürlich auch sein seinen Preis. Und ich glaube, das ist auch nicht gewillt jeder sich zu kaufen. Aber mit diesem DS Design, dass du halt einfach noch einen zweiten Bildschirm hast, wenn du ihn dann brauchst und ihn physisch rausziehen kannst, das finde ich schon sehr verlockend. Aber das hatte natürlich auch hier seinen Preis, weil das Gerät wo halt einfach über 5,2 kg und das muss man halt auch echt wollen und das muss man vor allen Dingen auch tragen wollen und bezahlen können, denn das Gerät hat glaube weit über 5000 gekostet seinerzeit. Ja, aber sowas fehlt halt echt in meiner Sammlung. Also ich habe ein normales w und ich suche ja noch händeringend nach einem WDS oder WDS. Wenn da mal was zu finden sein sollte, dann würde ich mich da echt freuen.",
      "start": 3736908,
      "end": 3800746,
      "confidence": 0.9150609,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also nächster Aufruf, falls jemand sowas noch rumliegen hat.",
      "start": 3800898,
      "end": 3804954,
      "confidence": 0.88357776,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich stelle mir die ganze Zeit die Frage, thinkpads haben ja eine sehr hohe Relevanz oder Beliebtheit auch bei bei Softwareentwicklerinnen. Inwieweit geht es in die Richtung Anpassung? Weil viele Softwareentwickler und Softwareentwicklerinnen stehen ja auf Laptops, die man mit freiem BIOS bestücken kann, wo man wirklich viel, ich sag mal Hand anlegen kann, Modifikationen machen kann, wo vielleicht auch die modernen Chips sofort von Linux supported werden. Ja, da gab es ja auch immer wieder, ich sag mal Probleme auch mit modernen Windows Laptops ja noch. Inwieweit können sich denn da Thinkpads schmücken?",
      "start": 3805122,
      "end": 3835210,
      "confidence": 0.8925231,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also lange war der USP für die Geräte, dass sie halt bedienungsgut liefen und deswegen haben Leute die gekauft, weil du wusstest, wenn du dir hier so einen tfünf oder was auch immer kaufst, du legst da deine CD ein oder steckst dein USB Stick an und kannst ein beliebiges Linux installieren und fertig. Also IBM hat schon relativ früh erkannt, dass Linux ein Betriebssystem ist, das man ernst nehmen sollte und haben da auch Teams oder ein Team aufgestellt, die sich dieser Sache annehmen. Das gibt es auch heute noch. Das ist das Team rund um Mark Pearson, der sich da sehr intensiv mit beschäftigt und auch regelmäßig auf Open Source Konferenzen berichtet, was so die Themen sind, mit denen sie sich beschäftigen. Ich würde sagen, das gilt für die meisten Geräte heutzutage. Also wenn du dir so ein x, einen T, eine p Serie kaufst, die kannst du auch direkt mit einem Ubuntu oder einem Fedora kaufen. Und das ist auch der Aufruf, den Mark Pearson immer wieder setzt. Also du kannst, wenn du kein Betriebssystem installierst, dann sind es irgendwie €150, die dein Gerät weniger kostet. Wenn du dir einen Fedora drauf spielen lässt, dann sind es irgendwie, ich glaube €100 weniger. Dieses Gerät kostet. Also du subventionierst quasi dadurch, dass du es mit Linux bestellst, zeigst du, wir wollen das haben. Und mit diesen 50 subventionierst du auch so ein bisschen die Entwicklung. Also das ist nach wie vor schon noch ein Thema, dass das relativ gut läuft. Ich selbst habe auch eigentlich auf all meinen Thinkpads einen Linux installiert und das ist immer noch ein Thema. Und ich glaube, das ist auch der Grund, warum viele Hacker innen sich so gerne diese Geräte holen, weil sie halt prinzipiell mit Linux gut laufen. Das muss man natürlich sagen. Reparierbarkeit, da gibt es einen ganz großen Player, der denen so ein bisschen den Rang abläuft und das sind eben die Framework Laptops, denn da kannst du ja wirklich alles tauschen. Also vom Display über Mainboard, Tastatur, es gibt d Druckvorlagen, wenn du dir da irgendwas drucken willst, beispielsweise zweitausendein. Das hat natürlich so ein bisschen gelitten. Also wir haben es vorhin gesagt, diese Ultra Bay Module gibt es z.B. nicht mehr, aber es gibt trotzdem eine ganze Reihe an Teilen, die du selbst austauschen kannst. Man nennt das auch die CRUs, die Customer Replaceable Units. Das sind so Dinge wie Tastatur, Akku, irgendwie RAM Module oder auch W waren Karten. Da gibt es durchaus Sperrpatz, die kannst du dir einfach kaufen, kannst du wechseln, ohne dass deine Garantie flöten geht. Von daher kannst du die schon lange noch weiter benutzen, würde ich behaupten. Aber Lenovo hat auch eine lange Zeit RAM verlötet und ist jetzt aber gerade dabei, dass das nicht mehr der Fall ist. Und ich glaube, das spielt denen auch so ein bisschen in die Karten, dass sie sich zusammengetan haben mit Firmen wie z.B. dell, um einen neuen RAM Standard mit zu definieren, der sehr dünne Geräte und Module erlaubt, ohne dass man die verlöten muss, wie das beispielsweise ja auch Apple macht. Also Apple haben ja dieses Design, alles ist auf einem SoC, ist dadurch super schnell, aber dadurch kannst du es halt nicht mehr tauschen. Zweitausendein. Und mit dem LP Cam Standard, den Dell und Lenovo maßgeblich mit definiert haben, hast du im Prinzip RAM Module, die so dünn sind wie eine CPU und eher aufgeschraubt werden statt reingesteckt werden. Und dadurch hast du wieder sehr schnelle RAM Module, die aber wechselbar sind. Also das wiegt sich so ein bisschen auf. Es ist nicht mehr so ganz DIY, wie es früher war. Das macht Framework definitiv besser, muss man ganz ehrlich sagen. Aber es sind trotzdem noch hochwertige, langlebige Geräte und deswegen halt auch in Hackspaces ganz gerne anzutreffen.",
      "start": 3835290,
      "end": 4013854,
      "confidence": 0.9114556,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zweitausendein Treffen, aber im Framework selbst steckt jetzt keine thinkpad Hardware.",
      "start": 4013862,
      "end": 4017724,
      "confidence": 0.85673726,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nein, das ist einfach, das ist ein Hersteller, das ist ein ist ein noch. Das zählt glaube ich noch als Startup. Die sind noch keine fünf Jahre alt, die halt einfach gesagt haben, sie wollen Notebooks bauen, die man einfach selbst reparieren kann und wo du wirklich jedes Bauteil einmal bekommen kannst. Das heißt, du kannst, wenn du dir so ein Gerät heute kaufst und du merkst nach drei Jahren ja, dir reicht die CPU nicht mehr, dann kannst du dir ein neues Mainboard bestellen für dieses Gerät und kannst einmal das Mainboard tauschen und kannst den den Rest, das Chassis, die Tastatur, die webcam und so weiter beibehalten. Also das ist ein komplett anderer Ansatz, der da verfolgt wird.",
      "start": 4017812,
      "end": 4047854,
      "confidence": 0.9070544,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Man muss hier dazu sagen, ich hatte damals, wie ich meinen letzten ThinkPad wieder ausgewählt hatte, hatte ich auch ein Framework Laptop im Auge und das waren so die zwei Kandidaten Thinkpad oder Framework. Und am Ende ist es dann der Lenovo geworden, weil Lenovo eine wesentlich stabilere Aufhängung des Displays hat und der Framework scheinbar im Wind und so relativ viel wackelt. Die damalige Version zumindestens. Und das kennt man ja auch ganz klassisch von den von den Thinkpads, diese zwei Metall, richtig dicken Metalldinger, die das Display eigentlich halten und dadurch auch weniger wackeln dann schlussendlich.",
      "start": 4048022,
      "end": 4082374,
      "confidence": 0.9014065,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es ist spannend, dass du das sagst. Das haben ja nämlich die Tage auch andere Leute so gesagt. Aber da haben sie mittlerweile glaube ich, nachgeliefert. Ich glaube, es gibt jetzt gegen extra Geld noch mal richtige Vollmetall Display Hinges beim beim Framework. Also da haben sie auch durchaus nachgebessert. Kann man glaube ich auch noch austauschen. Aber das ich war vor zwei Jahren an der ähnlichen Situation wie du. Ich habe nämlich auch ein neues Gerät gebraucht und habe mir überlegt Mensch, was nimmst du jetzt so? Framework kam da gerade mit dem er neu um die Ecke bzw. Leicht war es damals auch noch das er und ich habe mir geschworen, kauf dir nie wieder Erstversionen von irgendwas. Also wenn jetzt eine neue Marke rauskommt, egal wie geil die aussieht, gibt er einfach mal vier, fünf Jahre. Und wenn es die in 45 Jahren immer noch gibt, dann überlege ich es mir dann beim nächsten Turn. Und mittlerweile bin ich, glaube ich, emotional viel zu befangen, dass ich da was anderes akzeptieren würde, sage ich ganz ehrlich. Also ich sehe diese Frameworks regelmäßig bei uns im Hackspace sind tolle Geräte. Mir fehlt der Trackpoint, der ist nicht mit mit drin. Aber davon abgesehen ist es ein tolles Design und ich denke, die werden sich sicherlich auch lange am Markt halten und sich beweisen und vielleicht werde ich irgendwann dann auch schwach.",
      "start": 4082422,
      "end": 4144962,
      "confidence": 0.8999808,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Vor allem der Grundgedanke ist natürlich wirklich zu supporten.",
      "start": 4145026,
      "end": 4147562,
      "confidence": 0.90384775,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Absolut.",
      "start": 4147626,
      "end": 4148098,
      "confidence": 0.97679,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, wir haben jetzt ziemlich viel über die Geschichte gesprochen, über die ersten Versionen und in meinem Studium habe ich gelernt, dass Produktlebenszyklen immer kleiner werden. Der VW Golf eins hatte eine andere Qualität als der VW Golf acht inzwischen. Und meine Frage ist natürlich, du meinst.",
      "start": 4148154,
      "end": 4163532,
      "confidence": 0.8990085,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Jetzt, die Qualität ist besser geworden oder schlechter? Nur dass man das mal.",
      "start": 4163556,
      "end": 4166964,
      "confidence": 0.87260926,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Eindeutig schlechter. Ja, bei Volkswagen und natürlich deutlich teurer. Und jetzt mal wieder zu meinem anderen Hobby, auch mit Stilgeräten. Also wir reden hier von Kettensägen und Motorisierung, motorisierten Freischneider. Ich hatte einen sehr alten motorisierten Freischneider, habe ich in die Werkstatt gegeben und sagte ja, so ein schönes Teil, das kriegt man heute sogar gar nicht mehr. Hat er den, hat er mir den Vergaser von dem Teil getauscht und habe ich immer nur gefragt doofe Frage, aber was kostet denn sowas, wenn ich jetzt sowas noch mal neu kaufen würde? Wenn ich jetzt mit dem mit der Leistung sowas stabiles, mehr so richtiger Bremser. Und jetzt frage ich mich natürlich, ist das bei Thinkpads auch so? Ja, werden die Geräte schlechter vom Produktlebenszyklus? Habe ich da mehr Plastik in der Hand, was ich mehr zerbrechen kann? Oder sagst du ach nee, das ist wie so eine Fritzbox, die wird auch einfach immer nur besser.",
      "start": 4167132,
      "end": 4215380,
      "confidence": 0.88483286,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Schöner Vergleich. Ja, Nee, also ich glaube, das ist generell einfach so ein Trend, den wir ja schon seit Jahren bei allerlei Produkten sehen, sei es jetzt Kettensägen, Autos und natürlich auch Notebooks. Produkte sind halt nicht mehr designt, dass du die dreiig Jahre benutzen kannst. Das ist halt glaube ich, liegt einfach in der Natur der Sache, dass wir viel zu viel in viel zu kurzer Zeit konsumieren und der Markt das halt wunderbar für sich adaptiert hat. Ich würde jetzt nicht sagen, dass das Schrott ist, der da mittlerweile produziert wird. Es ist natürlich, wenn ich mir so ein aktuelles Gerät angucke und dann habe ich so ein TP da liegen von 2009, das ist halt schon, das sind schon Unterschiede, das muss man ganz ehrlich sagen. Aber ich würde sagen, es ist alles noch auf einem Niveau, wo ich sagen würde, das kann man einsetzen jahrelang. Ich würde es aber nicht erwarten, dass das in dreiig Jahren noch so funktioniert wie jetzt z.b. so ein 700 C, das dreiig Jahre alt ist im Wesentlichen und noch benutzt werden kann und auch echt noch robust ist. Also weiß ich nicht, ob das auf die aktuellen Geräte so zutrifft. Sie sind nichtsdestotrotz noch gute Geräte, aber sie haben einige ihrer Langstellungsmerkmale eingebüßt. Die größte Kritik, die ich da geben muss, ist in Richtung der Tastaturen. Also ich bin ein großer Freund von haptischen, einwandfreien Tastaturen. Deswegen benutze ich auch ausschließlich mechanische Tastaturen außerhalb vom Noten. Und das ist, das waren früher einfach die besten Tastaturen, die du haben konntest, waren die von dem Thinkpad, weil die einen knackigen Anschlag hatten, wunderbar taktil waren und einfach es richtig spaß gemacht hat, auf denen zu tippen. Und jetzt, wo Geräte immer dünner werden, dann musst du halt auch andere Tastaturen verbauen. Dann hat es halt so eine Tastatur nicht mehr einen Tastenhub von 1,8 mm, sondern halt nur noch von 1,3. Und da merkst du einfach einen riesigen Unterschied. Das ist einfach Physik. Wenn Physik fehlt, dann merkt man das. Und das finde ich schade. Das müsste nämlich nicht sein. Ÿousand, ob das Gerät jetzt 0,5 mm dicker ist. Also ganz ehrlich, ich würde sagen, macht die Geräte lieber ein bisschen dicker und baut dafür wieder geile Tastaturen ein. Die sind jetzt nicht schlecht, die sind aber auch nicht besser als die anderen, die es am Markt gibt. Und das sollte eigentlich nicht das Benchmark sein. Das Benchmark sollte sein, wir haben die geilste Tastatur und wenn ihr gute Tastaturen wollt, dann gibt sie nur hier.",
      "start": 4216040,
      "end": 4335156,
      "confidence": 0.91618365,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, was soll ich sagen? Wahnsinns Abschlusswort, Christian. Wo kann ich mich, wenn ich mich weiter in dieses Thema reinnerden möchte, möchte, wo kann ich mich weiter erkundigen? Du hast so viele Modelle genannt. Es gibt, du hattest von einer Community gesprochen, im Vorgespräch hieß es von einem Thinkpack Forum gibt es auch und die hard community of mastodon. Wo steige ich ein und wo kann ich z.B. mein altes IBM thinkpad Gerät auch abgeben für einen Museumszweck?",
      "start": 4335228,
      "end": 4365398,
      "confidence": 0.8855401,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Moment, Andy, du hast aber keines, oder? Du meinst jetzt Hörer innen zweitausendein von uns?",
      "start": 4365494,
      "end": 4369588,
      "confidence": 0.8072553,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich gebe ja zu, ich hatte mal vier Monate von meinem Arbeitgeber eins. Genau, aber ich habe das nicht mehr, das muss ich zurückschicken.",
      "start": 4369684,
      "end": 4375764,
      "confidence": 0.9185321,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, also es gibt ja wirklich viele, viele Quellen. Ich finde das thinkpad Forum, das ist eine fantastische Anlaufstelle, denn da hast du wirklich Leute, die sich einfach austauschen zu dem Thema, wo du selbst Fragen stellen kannst, wo aber auch Nachrichten geteilt werden und auch die wildesten Leute ihre Hardware posten. Also ich hatte da auch mal ein Foto meiner Sammlung gepostet und da meinte einer so ach, das ist ja schön. So habe ich auch mal angefangen und postete halt ein Bild von dem Schrank, wo 100 Dreiig Laptops drin waren. Ich dachte mir so, Okay, alles klar, ich habe kein Problem. Das beruhigt mich total. Das ist eine tolle Anlaufstelle. Die bauen auch das Thinkwiki de. Das ist im Prinzip wie Wikipedia, nur für Thinkpads. Da gibt es halt wirklich Trivia und Bilder und Quellen zu allen möglichen Geräten. Das ist wirklich ein ein wahrhaftiger Traum, da mitzulesen. Ansonsten habe ich natürlich die Webseite Thinkpad Museum de, wo es halt eben die Podcast Episoden gibt. Und auch das versuche ich jetzt ein bisschen mehr zu machen. Artikel mit Hintergrundinformationen und man kann sich auch die Sammlung von mir anschauen. Also da ist im Wesentlichen alle Geräte habe ich da dokumentiert, wann ich die bekommen habe, was für Eckdaten, wann die produziert wurden, so ein bisschen die Informationen werden da konsolidiert. Ich habe auch neulich mal mit einem Freund einen Fotoshooting gemacht. Und nein, wir haben nicht mich fotografiert, sondern wir haben halt 500 hochauflösende Studiofotos von den ganzen Ÿousand Notebooks gemacht. Und die wollen, wenn sie denn bearbeitet sind, da auch alle auf die Webseite hochgeladen werden. Das heißt, da könnt ihr euch dann auch ein Auge von machen, wie der ganze Kram so aussieht. Und last but not least, weil du sagst so Spenden und Museum, ich kriege in letzter Zeit, seitdem ich auf Konferenzen war, weil ich war auf zwei Konferenzen diesen Sommer, auf eine haben wir uns ja getroffen, die letzte war letzte Woche und jetzt bin ich nächste Woche auch noch mal auf einer Konferenz und ich kriege inzwischen viele Nachrichten mit Spendenangeboten und viele davon muss ich mittlerweile dann leider ablehnen, weil ich halt einfach Geräte nicht doppelt und dreifach hier lagern kann. Ist limitiert. Ich habe den Deal mit meiner Partnerin, das ist mein Schrank, den kann ich füllen, wie ich es möchte. Und wenn dieser Schrank voll ist, dann passt da nichts mehr rein, dann ist der voll. Und das will ich natürlich nicht überaus reizen, aber ich habe mir gedacht, es wäre doch schön, wenn Leute untereinander eben ihre Hardware austauschen können. Deswegen bastel ich gerade noch an so einer Online Plattform, wo man dann die Geräte inserieren kann. Im Prinzip wie so eine Art Kleinanzeigen, nur ohne was letzter Preis und ohne Cousin holt ab im Fediverse. Da habe ich nämlich eine tolle Software entdeckt, die sich da integriert und da kann man reingucken. Und wir haben auch einen Matrix Chat. Also da sind echt so ein paar Leute, die glaube ich ähnlich drauf sind, auch gerne Thinkpad sammeln oder darüber reden. Und da finden echt erstaunlich interessante Gespräche statt. Da kann man natürlich auch gern vorbeigucken. Wenn man möchte. Zweitausendein.",
      "start": 4375812,
      "end": 4533230,
      "confidence": 0.9241336,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Gut, wir verlinken natürlich auch alles in den Show Notes. Christian, auch lieben herzlichen Dank von meiner Seite. Vor allem für mich ja super interessant die ganze Design Geschichte, weil Leute lachen mich ja schon immer aus, dass sie in Land rover Defender die die alten coolen eckigen Dinger so cool finde. Vielleicht hängt es zusammen, warum ich auch die Thinkbett so, so cool finde und die Leute dann immer sagen, das ist ja kein Design, das ist ja nur ein schwarzer Kasten. Jetzt kann ich sagen, Richard Zappa, ganz berühmter Designer, ist eigentlich ein perfektes Sammlerstück, was da unter meinen Fingern sozusagen liegt. Also vielen Dank dafür.",
      "start": 4533340,
      "end": 4564870,
      "confidence": 0.8631383,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Danke.",
      "start": 4564950,
      "end": 4565614,
      "confidence": 0.77602,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bei mir ist das trivia Wissen hängen geblieben, dass das Logo um 43 Grad gedreht ist.",
      "start": 4565782,
      "end": 4570286,
      "confidence": 0.8827325,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "-43 war das, oder?",
      "start": 4570478,
      "end": 4572334,
      "confidence": 0.9653675,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Minus. Ja, aber hey, die Zahl war richtig. Plus minus. Das sind noch bürgerliche Kategorien.",
      "start": 4572422,
      "end": 4577330,
      "confidence": 0.8988233,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Christian, vielen lieben Dank. Mir hat sehr viel Spaß gemacht und ja, ich. Wenn deine Sammlung mal irgendwo ausgestellt werden sollte, poste es bitte. Ich würde sie mir wirklich gerne ansehen. Vielleicht kriegst du hier mal irgendwie so einen Tisch oder zwei in einer anderen etwas niedrigen Konferenz, wie z.B. der Mechanicron zur mechanischen Tastaturen. Das ist ja auch so eine nische Geschichte. Vielleicht kannst du da mal, weiß ich nicht, so einen Subraum aufmachen. Also auf anderen Konferenzen gibt es ja inzwischen auch so eigene Tracks. Vielleicht machst du dann Lenovo Tracker.",
      "start": 4577790,
      "end": 4608854,
      "confidence": 0.8814615,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das wäre auf jeden Fall eine Idee. Und ich habe auch gehört, es gibt ja immer zwischen Weihnachten und Silvester den Kongress des CCCs und da hat letztes Jahr ein Vintage Thinkpad Festival wohl stattgefunden. Vielleicht muss ich da auch mal hin und einfach mal ein bisschen Hardware ausstellen. Und ja, vielleicht klappt es irgendwann mal mit so einer kleinen Gastausstellung. Ich werde auf jeden Fall berichten und.",
      "start": 4608902,
      "end": 4625738,
      "confidence": 0.90929765,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "An alle Hörerinnen und Hörern, falls ihr jemanden kennt, der auf einem Thinkpad arbeitet und ihr denkt, diese Person braucht auf jeden Fall noch ein bisschen Trivia wissen über den Hintergrund von dem Gerät, was da benutzt wird, diese Folge Ÿousand einmal weiterleiten. Wolfgang und ich danken Christian natürlich auch. Das war es mal wieder von uns in diesmal von uns dreien. Wir hören uns bald wieder und tschüss.",
      "start": 4625754,
      "end": 4646408,
      "confidence": 0.902242,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ciao, ciao.",
      "start": 4646504,
      "end": 4647480,
      "confidence": 0.59381,
      "speaker": "B",
      "channel": null
    }
  ],
  "confidence": 0.9061113,
  "audio_duration": 4595,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}