{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/7939722f-8bdf-4657-97c2-faade6e24ba6/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "8f4972a2-8304-4cd4-8631-2ee187760dc5",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen im Engineering Kiosk Adventskalender, heute zum fünften Türchen. In dieser Mini Episode geht es nicht direkt um Softwareentwicklung, sondern um dich, deine Arbeitsweise und deine Produktivität. Um das Thema entsprechend einzuläuten, starten wir mal mit einem Produktivitätstipp, wie du Bugs vermeidest. Ich glaube, dies war das beste Argument für den Dark Mode, was ich bisher gehört habe. Nun aber zum Thema Inbox Zero und wie du die Kontrolle über deine e Mails und dein E Mail Postfach bekommst. Los geht's.",
            "start": 5640,
            "end": 42402,
            "confidence": 0.89975494,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Andi, wie viele E Mails hast du in deiner Inbox?",
            "start": 42586,
            "end": 44538,
            "confidence": 0.866902,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Gerade eben, ich muss eben nachgucken, in meiner Inbox sind 8017 e Mails.",
            "start": 44594,
            "end": 49970,
            "confidence": 0.87319463,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Es ist super, dass ich in meinen Notes genau den Satz stehen habe. Ich habe 8000 E mails und du triffst es fast. Das ist nämlich ein Satz, den ich ganz oft höre von Leuten, die ganz stolz mit gestellter Brust erklären, ich habe ja 8000 E Mails in meiner Inbox und vielleicht sogar noch schlimmer, die sagen dann, und 3000 davon sind ungelesen. Ihr habt es gerade kürzlich gehört im doppelgänger Podcast bei Pip auch wieder, der jetzt Probleme mit Outlook hat, weil er 60 GB in seiner Inbox irgendwie hat und da Outlook Probleme macht. Und ich war ja selber auch so eine Person, ich hatte früher auch alles in meiner Inbox drin. Und wenn man sich so überlegt, durchschnittlich Statistiken sagen so je nach Statistik, 120 bis 170 E Mails bekommt man pro Tag als normaler Office. Das heißt, du musst dich mit 120 bis 170 E Mails jeden Tag herumschlagen und die in irgendeiner Form bearbeiten. Und das müllt natürlich deine ganze Inbox zu.",
            "start": 50010,
            "end": 99866,
            "confidence": 0.8986976,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "170 e Mails, da sind aber sehr wahrscheinlich eine ganze Menge von GitHub und von Jira, oder?",
            "start": 99938,
            "end": 104178,
            "confidence": 0.9338441,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also wenn ich GitHub E Mails von dir mitrechne, die du da triggerst, dann habe ich ja sowieso 500 E Mails jeden Tag in meiner Inbox.",
            "start": 104274,
            "end": 109930,
            "confidence": 0.8584558,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Produktiv nennt man sowas.",
            "start": 110010,
            "end": 111402,
            "confidence": 0.9423225,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Auf jeden Fall ist es super schwer, meiner Meinung nach zumindest. Und ich hatte das Problem selbst früher immer, diese e Mails in irgendeiner Form im Griff zu haben, weil es eben 100 bis 200 E Mails sind. Man versucht dann irgendwie mit gelesen Status, ungelesen Status, dann wird der gelesen Status wieder automatisch gesetzt. Man führt dann vielleicht noch Labels ein. Also es gibt schon Möglichkeiten, aber es ist super schwierig, meiner Meinung nach, das zu tracken. Und mein Kollege von mir, mit dem ich sehr viel zusammengearbeitet habe, der war wirklich unzuverlässig, weil es war wirklich schwierig, mit dem über E Mails zu sprechen. Wenn ich da gefragt habe, hast du die e Mail schon gesehen, welche e Mail? Oder die e Mail habe ich vergessen oder oh, die ist mir nach unten gerutscht, die war zwar umgelesen, aber die ist halt einfach nach unten gewandert mit den 200 E Mail Adressen und dann war sie halt irgendwann weg. Und die hatte dem Kollegen eigentlich schon immer was von Inbox Zero erklärt, aber ich konnte ihn nie überzeugen. Und irgendwann, es war gar nicht so lange her, hat er mal eine ganz wichtige E Mail wieder verpasst und wir haben darüber gesprochen und wir hätten da fast einen Deal verpasst dadurch. Und ich habe ihm dann gepitcht, ich habe ihm erklärt, schau, ich bin jetzt dein YouTube Berater und ich kann dir eine perfekte Methode verkaufen, die dein Leben verändern wird.",
            "start": 111466,
            "end": 178204,
            "confidence": 0.91188085,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Zweitausendein.",
            "start": 178252,
            "end": 178390,
            "confidence": 0.7277,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Und zwar bekommst du das um den Spotpreis von, und es ist Inbox Zero nennt sich das, diese super geheime Methode. Und er hat natürlich schon lange gewusst, was das ist, aber in dem Moment war er so frustriert, dass er gesagt hat, okay, wir beginnen jetzt damit, ich lösche alle meine E Mails, die nicht ungelesen sind, lösche ich bzw. Archiviere ich und starte jetzt frisch mit einer Inbox und nur die ungelesenen bleiben in meiner Inbox und die werden jetzt bearbeitet. Und genau da kommt dann das Inbox Zero System zum Einsatz. Also man sieht die Inbox da nicht als Lagerplatz, als endloser Speicher an, sondern als Arbeitsplatz. Das heißt, alles was in der Inbox liegt, in einer aufgeräumten Inbox, sind Dinge, um die man sich kümmern muss. Das heißt, es liegen mal schon viel weniger Dinge in meiner Inbox, weil ich eben nur die Sachen habe, die ich noch bearbeiten muss. Das heißt, es wird alles von der technischen Seite mal schneller. Also wenn ich so eine Box öffne, dann ist die super schnell offen. Ich brauche nicht irgendwie mit SMTP tausende E Mails synchronisieren. Das braucht wirklich und braucht auch Energie. Und es ist natürlich viel leichter, den Überblick zu bewahren, weil sobald ich eine E Mail beantwortet habe, bearbeitet habe, als dann markiert habe, wird die in ein Archiv geschoben oder in einen speziellen Folder. Ihr könnt natürlich da auch eure internen Folderstrukturen verwenden, aber heutzutage mit der perfekten Suche in allen Suchprogrammen ist es eigentlich kein Problem mehr, dass man es einfach alles in ein Archiv schiebt. Also was man da eigentlich macht, ist so eine Triage, kennen viele vielleicht so aus den Katastrophenfilmen, wo ganz viele verletzte Personen reinkommen und man macht dann eine Triage, was macht man mit dieser Person? Und dasselbe läuft eigentlich mit E Mails. Das heißt, ich blocke mir einmal am Tag oder zweimal am Tag eine Zeit, wo ich E Mails bearbeite und dann führe ich so eine Triage durch. Da gibt es das d Modell, delete, delegate, defer or done. Also da entscheide ich, lösche ich das ganze, ist es absolut unwichtig, kann ich das delegieren an irgendwen anderen im Team zweitausendein kann ich das weiter schicken, das heißt ich leite das E Mail weiter und schiebe es z.B. in den Folder delegate, damit ich das später auch überprüfen kann. Die FUR heißt auf später verschieben, das heißt ich kann es in einen speziellen Ordner verschieben, ich kann es in der Inbox belassen, ich kann es in meine to Do Liste überführen, was ich auch immer für ein internes System habe oder eben dann und sobald es dann ist, verschiebe ich die E Mail wirklich hinaus aus meiner Inbox in ein Archiv, weil braucht die die e Mail natürlich, damit die, wenn ich mal darauf zurückgreifen muss, die wieder finde. Also nicht löschen, in den Archiv verschieben, aber meine Inbox ist dann schön aufgeräumt und möglichst leer. Und ich kann das wirklich nur jedem empfehlen, also mein Kollege ist jetzt super effizient und er verliert wirklich aktuell keine e Mail mehr und er verwendet das schon viele Monate, also es funktioniert wirklich sehr gut, ich mache das selber seit Jahren so und alleine für dieses Gefühl, wenn man mal die Inbox gelehrt hat, wenn man weiß, okay, da ist nichts mehr zu tun, das ist einfach so ein tolles Gefühl im Vergleich zu 8000 E Mails, 3000 ungelesen, man findet die e Mails nicht mehr. Also es ist wirklich ein großer Unterschied und ich kann das nur jedem empfehlen. So Andi, jetzt bist du mal mit deiner Kritik dran, du sitzt schon da zitternd.",
            "start": 178420,
            "end": 358452,
            "confidence": 0.9153311,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Meine erste Frage, du hattest gerade gesagt, dass es positiv für den Server ist, wenn der SMTP Sync nicht starten muss, beziehungsweise nicht so viele E Mails runterladen muss. Meine Frage ist das in heutiger Zeit, wo man Gmail im Browser hat und eigentlich keinen Desktop E Mail Client mehr nutzt, zweitausendein, ist das überhaupt noch relevant?",
            "start": 358556,
            "end": 375906,
            "confidence": 0.8757954,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, vielleicht für dich nicht, aber es verwendet ja nicht jeder Gmail. Es gibt ganz viele Leute, die IMAP verwenden. Ich verwende seit Ewigkeiten schon IMAP und ich bin mit Gmail einfach nie warm geworden und ich vermute auch, dass andere Leute IMAP einfach bevorzugen als direktes Protokoll und man kann dann seinen Client des Vertrauens verwenden.",
            "start": 375978,
            "end": 393470,
            "confidence": 0.9573779,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Gut, aber er setzte Gmail durch jeden anderen E Mail Provider, der ein ordentliches Webinterface hat.",
            "start": 393810,
            "end": 398450,
            "confidence": 0.9060225,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Ja, aber auch der hat dann 7000 E Mails mit denen er hantieren muss. Natürlich wird er Optimierungsmöglichkeiten haben, nicht alle E Mails laden und solche Dinge aber grundsätzlich jedes mal wenn du in einen Hauptfolder, in dem du den ganzen Tag arbeitest, ständig aufmachst, hineinschaust, irgendwas herum scrollst, wenn da E Mails sind oder E Mails oder e mails, ist es sicher weniger effizient als wenn da fünf E Mails drin sind.",
            "start": 398490,
            "end": 421070,
            "confidence": 0.89528614,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Dann die zweite Geschichte wenn du Inbox Zero verfolgst, ist die E Mail Inbox ja deine To do Liste, deine To do Liste die von anderen gefüllt wird. Meine Kritik ist jetzt lässt man sich dann nicht von anderen treiben, dass also von anderen Leuten Items auf die eigene To do Liste setzen, auf wo man selbst die Tagesplanung in die Hand nehmen sollte und sich selbst nicht von anderen treiben lassen sollte um Produktivität zu erreichen.",
            "start": 421110,
            "end": 442886,
            "confidence": 0.92469114,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also es heißt ja nicht, dass du das an einem Tag erledigen musst. Zweitens, wenn jemand dich anruft, dann kann der dir ja auch ein Task geben am Telefon und mit dir sprechen. Deshalb sagst du jetzt auch nicht ich nehme keine Telefonate mehr ab und jedes mal wenn mein Telefon klingelt hebe ich Telefon nicht ab. Also du bekommst die die Informationen, die Tasks sowieso, aber die Idee ist ja, dass du auch wirklich die Zeit blockst, mehrmals am Tag oder zweimal am Tag und da konzentriert dann diese Triage durchführst, damit du eben schnell eine Einteilung machst. Was machst du mit den E Mails, um möglichst schnell die weiterzuleiten, zu löschen oder in eine to Do Liste überzuführen.",
            "start": 442958,
            "end": 477160,
            "confidence": 0.94224656,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und die dritte Frage die ich eigentlich hätte, dein Kollege macht jetzt Inbox zero, verschwendet, also nicht verschwendet, wendet also ziemlich viel Zeit auf seine Inbox sauber zu halten. Welchen positiven Erfolg hat das denn nach sich gezogen? Er hat jetzt eine saubere Inbox, alles schön und gut aber und er investiert ja sehr viel Zeit diese aufzuräumen, aber hat er jetzt mehr Beratungsaufträge, hat er jetzt mehr Freunde, hat er jetzt ein größeres Personal Branding? Also was ist das der Outcome davon, dass er da was aufräumt und das kontinuierlich?",
            "start": 477200,
            "end": 507978,
            "confidence": 0.9397787,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Also ich kann es natürlich nur von meiner Warte sagen, aber er ist viel zuverlässiger. Früher habe ich ständig erinnern müssen, hast du dieses E Mail schon beantwortet, was wir gemeinsam bekommen haben, hast du das schon erledigt? Und das ist einfach aus seinem Sichtfeld gerutscht. Ist ja auch verständlich, das war bei mir auch früher das Problem, man vergisst es einfach. Ich habe das teilweise sogar immer noch, wenn meine Inbox zu voll wird, wandern e Mails nach unten aus meinem Blickfeld und dann vergisst man sie wieder. Aber ich habe natürlich immer den Drang, meine Inbox aufzuräumen und dann kommen sie schneller wieder nach oben als drei Wochen später.",
            "start": 508074,
            "end": 538398,
            "confidence": 0.9434108,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Dass dir E mails durch die Lappen gehen, kann ich ganz offiziell durch die Zusammenarbeit mit diesem Podcast bestätigen. Aber Ÿousand, ich hoffe, du besserst dich auch mit deinem Inbox Zero verhalten. Und jetzt meine nächste Frage. Was ist denn die Grundregel, die du dir jetzt vorgenommen hast für 2025, dein Inbox Zero deutlich zu verbessern?",
            "start": 538454,
            "end": 556548,
            "confidence": 0.9322302,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Eine Grundregel, die ich lange nicht beachtet habe, die aber meiner Meinung nach super wichtig ist, viel schneller löschen. Ich hatte E Mails sehr lange teilweise in meiner Inbox liegen und habe mir gedacht, die kann ich später beantworten, später beantworten, später beantworten. Irgendwann ist es dann zu spät und ich lösche sie sowieso oder ich antworte irgendwie, dann ist es viel zu spät, sechs Monate später. Und da denke ich mir oft, wenn ich das schon am Anfang kategorisiere als zu unwichtig, wirklich bewusst entscheide, okay, da wird zwar eine Antwort erwartet, aber ich will keine Antwort geben und die verschiebt es ins Archiv, anstatt das über Wochen hinwegzuziehen und dann drei Monate später entscheiden, okay, jetzt ist es zu spät, jetzt antworte ich doch. Also da einfach kritischer umgehen mit dem und stärker die eigene Zeit priorisieren.",
            "start": 556604,
            "end": 598832,
            "confidence": 0.9181734,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also getreu nach dem Motto, wenn es.",
            "start": 598896,
            "end": 600296,
            "confidence": 0.87488145,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Wirklich wichtig ist, wird es wieder kommen.",
            "start": 600328,
            "end": 602208,
            "confidence": 0.8945786,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Okay, verstehe. Danke Wolfgang.",
            "start": 602264,
            "end": 603730,
            "confidence": 0.9222775,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Das war auch die Theorie damals, was ich mit meinem Kollegen gemacht habe. Der hat einfach mal alle gelesenen wegverschoben. Da waren garantiert welche dabei, die er noch beantworten hätte müssen, aber er hätte sie sowieso nicht mehr beantwortet, weil das einfach zu viele waren. Insofern einfach Schnitt machen und im Zweifelsfall eher mal was wegschieben. Wenn es wichtig ist, kommt es an.",
            "start": 603770,
            "end": 620858,
            "confidence": 0.9598338,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Alle Hörerinnen und Hörer, wenn ihr das tut, seid euch bitte bewusst, der Scheich, der euch ein Erbe übertragen möchte, der könnte dabei sein und der wird mir.",
            "start": 620874,
            "end": 629518,
            "confidence": 0.94408786,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Dann durch die Lappen gehen.",
            "start": 629534,
            "end": 630590,
            "confidence": 0.97335,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das war es auch schon mit der Episode. Wenn du noch ein paar andere Produktivitätstipps hast, komm doch gerne mal in unsere Discord Community und teile diese mit uns und der Community. Wenn du uns, also Wolfgang und mich, etwas produktiver gestalten möchtest, kannst du uns natürlich auch gerne einen Kaffee ausgeben. Beide links findest du wie immer in den Shownotes. Wir sehen uns morgen wieder zum nächsten Adventstürchen vom Engineering Kiosk Podcast. Bis bald.",
            "start": 630670,
            "end": 653590,
            "confidence": 0.931706,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.9184483,
    "audio_duration": 658,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}