{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/049f028f-f5e2-495c-a071-e2f1bc3ecd65/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "fc677c41-8ef3-4b16-b627-b46176c73a26",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Als Österreicher habe ich mir natürlich den 5. Dez. Ausgesucht, um euch am Krampustag zu begrüßen. By the way, wer keine Ahnung hat, was ein Krampus ist, ich habe noch ein schönes Video in den Shownotes verlinkt, in dem Christoph Waltz in der Jimmy Fallon Show das ganze Konzept erklärt. Und wie es sich für den Krampus Tag gehört, wird es in dieser Mini Advent Episode extrem und das ganz ohne Krampusse. Denn heute möchten euch Dino und Fabi von unserem befreundeten Podcast Encoding Buddies das extreme Programming Konzept vorstellen. Aber bevor wir starten, habe ich als Feuerwehrmenschen noch einen Dad Joke rausgesucht. Ich hoffe, ihr seid alt genug, um meinen bildschirmjourner Witz überhaupt zu verstehen. Zweitausendein genau aus der Zeit, in der Can Beck auch extreme Programming groß gemacht hat. Aber alles weitere überlasse ich jetzt Dino und Fabi.",
            "start": 9680,
            "end": 61110,
            "confidence": 0.88336635,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Halli hallo und herzlich willkommen zu einer Special Folge der Coding Buddies. Und zwar hier zu Gast beim Engineering Kiosk im Rahmen ihres Adventskalenders. Mein Name ist Tino und an meiner Seite ist der fantastische Fabi, den ich hier begrüßen mag. Fabi, grüße dich zur Special Folge.",
            "start": 61270,
            "end": 77222,
            "confidence": 0.91052043,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Halli hallo Tino. Na, wie geht's? Wir haben heute nicht so viel Zeit, deswegen lege ich gleich mal los.",
            "start": 77326,
            "end": 82198,
            "confidence": 0.8749005,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und zwar geht's, ich starte direkt rein.",
            "start": 82254,
            "end": 83950,
            "confidence": 0.6864086,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und zwar geht diese Special Folge etwas, was uns sehr am Herzen liegt und das ist extreme Programming. Extreme Programming kann man sich jetzt vielleicht darunter vorstellen, so eine Art Extremsport oder dass man halt 12 Stunden durchcodet. Aber das ist nicht extreme Programming, es.",
            "start": 83990,
            "end": 102202,
            "confidence": 0.90939957,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ist kein Coding Marathon, sondern ein agiles Framework mit sehr coolen Methoden, nach denen wir auch selbst arbeiten. Und da würde ich sagen, lasst uns doch einfach mal ein bisschen Ÿousand vorstellen, was extreme Programming ist und welche Methoden wir davon verwenden.",
            "start": 102226,
            "end": 116960,
            "confidence": 0.9154355,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, also es gibt ja auch andere Methoden wie z.B. scrum, also dass man es nochmal einordnen kann, weil Scrum kennen ja viele Leute und extreme Programming oder XP ist halt eben auch genauso ein agiles Framework wie z.B. scrum. Warum arbeiten wir gerne danach oder was mögen wir überhaupt daran? Also ich finde z.B. super cool, dass bei extreme Programming einfach ein hohes Maß an Kommunikation stattfinden soll. Es wird ein Fokus auf eine hohe Qualität gelegt. Im Endeffekt soll man halt auch gucken, dass man möglichst viel Feedback einholt während der Entwicklungszyklen. Ich habe danach auch schon eine ganze Zeit lang gearbeitet. Wir arbeiten eigentlich auch momentan danach. Und deswegen ist es einfach, man merkt halt einfach, dass es einfach funktioniert, würde ich sagen, zumindest in unserem Kontext.",
            "start": 117120,
            "end": 161670,
            "confidence": 0.92837936,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Genau, denn ein wesentlicher Aspekt dabei ist sozusagen der Mut und der Respekt innerhalb des Teams. Das heißt, man geht respektvoll miteinander um mit den Teammitgliedern. Es gibt auch keine klare Rollenverteilung wie in anderen Frameworks, sondern jeder springt auch mal für den anderen ein. Und vor allem der Punkt Mut finde ich halt extrem gut dabei, zu sagen, okay, es gibt Herausforderungen und die werden aktiv angegangen. Es werden Verbesserungen vorgenommen, es werden Änderungen angestoßen. Also man versucht immer das Bestmögliche rauszukriegen, auch wenn es denn vielleicht manchmal auch ein bisschen radikal erscheint. Aber das ist halt auch der Spirit dahinter.",
            "start": 161970,
            "end": 200598,
            "confidence": 0.9281091,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, das stimmt. Und man muss auch sagen, dass es ein hohes Maß an Disziplin erfordert, das auch so durchzuziehen, weil auch gerade, gerade wenn man guckt in Hinsicht auf die Praktiken, die man einsetzt innerhalb von XP, ist es z.b. so was wie Test Driven Development, was wir auch sehr, sehr gerne mögen oder starke Verfechter davon sind, genauso wie Pair Programming. Und das sind halt Methoden, die sehr interessant und spannend sind und natürlich auch dafür sorgen, dass du halt eben z.B. wissenssilos eliminierst im Team, aber auch z.B. eine hohe Code Qualität gewährleistest. Aber es erfordert, wie ich schon meinte, eine Menge Ÿousand an Disziplin, um das wirklich auch so durchzuziehen.",
            "start": 200694,
            "end": 239672,
            "confidence": 0.9248542,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, und Disziplin ist halt auch genau das richtige Stichwort, wenn man von Test driven Development spricht, weil da geht es ja darum, quasi zuerst seine Tests zu schreiben und dann zu implementieren. Und genau das erfordert viel Disziplin, weil ich denke, jede Entwicklerin und jeder Entwickler kennt das. Man will schnell mal was coden, schnell mal ein Feature umsetzen und nicht erst die Tests schreiben. Und genau da kommt dann dieser Punkt Disziplin rein. Aber welche vor und Nachteile Test driven Development haben, haben wir ja in unserem eigenen Podcast auch schon ausführlich diskutiert und beleuchtet.",
            "start": 239736,
            "end": 272988,
            "confidence": 0.9146927,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ich würde sagen, genau diese Punkte, wieso das sozusagen so viel Disziplin erfordert, was diese ganzen Praktiken und die einzelnen Punkte dieser Philosophie dahinter genau sind und was z.B. auch der Unterschied zwischen extreme Programming als agiles Framework und Scrum als agiles Framework ist und wann man was vielleicht sogar einsetzt, das wollen wir auch noch mal in einer eigenen Folge in unserem eigenen Podcast noch mal ganz genau beleuchten. Was meinst du, Tino?",
            "start": 273084,
            "end": 299996,
            "confidence": 0.91103363,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, also. Also, liebe Zuhörerinnen, lieber Zuhörer, falls dich das Thema interessiert, bist du herzlich eingeladen, dann mal bei uns im Podcast vorbeizuschauen. Alle Links zu unseren Plattformen findest du unter und dort wirst du dann auch eine umfangreiche Folge zum Thema extreme Programming finden.",
            "start": 300108,
            "end": 316992,
            "confidence": 0.89290154,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und am Ende auch noch ganz liebe Grüße an unsere Gastgeber, den Engineering Kiosk.",
            "start": 317056,
            "end": 322320,
            "confidence": 0.9138857,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, es ist eine verdammt coole Idee mit dem Adventskalender und wir werden uns auf jeden Fall auch die anderen Türchen anhören. Wirklich coole Idee, Jungs, macht weiter so.",
            "start": 322400,
            "end": 329572,
            "confidence": 0.95673347,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und in diesem Sinne wünschen wir allen noch eine wunderschöne Adventszeit und bis dahin eure coding Buddies gemeinsam besser.",
            "start": 329616,
            "end": 337868,
            "confidence": 0.9272742,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Vielen Dank an Dino und Fabi von den Coding Buddies. Und wenn ihr noch mehr hören wollt, die extreme Programming Episode der Coding Buddies haben wir natürlich in den Shownotes verlinkt. Was uns aber interessieren würde, nutzt du eigentlich extreme Programming und wenn ja, wie hat sich das positiv auf deine Arbeitsqualität ausgewirkt oder eben vielleicht auch negativ? Teile doch mal deine Erfahrungen mit uns über Mastodon oder auch in unserem Discord Community Channel. Schau einfach vorbei. Und jetzt wünsche ich dir noch einen schönen Tag, grüß mir alle Krampusse, die du heute antriffst und hoffentlich bis morgen zur nächsten Advent Ÿousand.",
            "start": 338044,
            "end": 375310,
            "confidence": 0.90571076,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.91122556,
    "audio_duration": 376,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}