{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/41917919-a255-46da-933d-6937e0925fbf/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "8ae9d5a9-2a87-450a-91e2-c9a391960128",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Das Engineering Kiosk Adventskalendertürchen Nr. Acht dreht sich um das Thema Kommunikation. Unser Podcast Motto ist technologie ist kompliziert, aber im allgemeinen ein gelöstes Problem. Die wahre Herausforderung sind die Menschen drumherum und Kommunikation ist dabei das Thema Nr. Eins. Das heutige Thema beschützt dich vor ausschweifender Kommunikation und kann dir unter Umständen mehr Struktur für deine Kommunikation verleihen. Besonders hilfreich und beliebt in Interviews und falls du noch in der gestrigen Advent Episode steckst. Genau, also raus aus der Endlosschleife der Programmierung und rein in die Kommunikation.",
            "start": 4280,
            "end": 44370,
            "confidence": 0.90780455,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Es ist mal wieder diese Zeit im Jahr Weihnachten, Besinnlichkeit, ganz viel Glühwein und der anstehende Jahreswechsel. Und das ist oft die Zeit, wo die ganzen Leute mal drüber nachdenken, was sie denn gerade aktuell so tun, was man sich denn nächstes Jahr so vornehmen kann, was man erreichen möchte, welche Ziele man hat und die Jahresvorsitzende und all sowas. Man geht halt mal so richtig in sich und vielleicht kommt dabei heraus, dass man sich einen neuen Job suchen möchte oder gegebenenfalls auch einfach nur mal seinen Marktwert checken möchte. Wie dem auch sei, bei beiden Optionen sieht man sich über kurz oder lang in einem Interview, in einem Bewerbungsgespräch. Viele Interviews bzw. Bewerbungsgespräche sind eine Art Frage Antwort Spiel. Natürlich gibt es dann auch noch so Lead Code Challenges und all sowas. Darüber sprechen wir jetzt nicht, sondern wir sprechen mal über dieses Frage Antwort Spiel. Und bei diesen Ÿousand Fragen gibt es verschiedene Fragentypen. Der Klassiker sind fachliche Fragen, also Fragen, die wirklich darauf abzielen, deine technischen Fähigkeiten zu bewerten und gucken, kannst du das denn nicht auch wirklich alles für den Job? Da wäre z.B. eins wie würden sie das Singleton Pattern in einer Programmiersprache wie Java implementieren und in welchen Situationen würden sie es denn einsetzen? Wissen wir ja alle, ne? Singleton niemals ist eben immer böse, aber sei dahingestellt. Dann gibt es noch den Fragetyp situative Fragen, also Fragen, die etwas hypothetisches darstellen und die stellen so ein bisschen deine Problemlösungsfähigkeit auf die Probe und wie du auch Entscheidungen triffst. Z.B. angenommen ein Teammitglied liefert wiederholt nicht die vereinbarte Arbeit ab. Wie würden sie damit umgehen? Ein weiterer Fragetyp ist die verhalten bezogene Frage. Das ist eigentlich der richtige Content jetzt hier. Das sind Fragen, die eigentlich deine vergangene Erfahrung beleuchten, um Rückschlüsse auf zukünftiges Verhalten zu ziehen. Hört sich an ein bisschen so, als möchte ich einen neuen Trading Algorithmus für börsennotierte Unternehmen machen. Ich schaue mir die Historie an und und predigte dann, wie sich das in Zukunft dann auswirkt. Davon reden wir jetzt nicht, sondern wir reden was kannst du mit deinen Erfahrungen machen? Wie hast du reagiert? Und so weiter. Ein Beispiel ist Beschreiben sie eine Situation, in der sie mit einem schwierigen Teammitglied zusammenarbeiten mussten. Wie haben sie dieses Problem gelöst? Besonders bei diesen verhalten bezogenen Fragen, die werden oft in Interviews gestellt und sehr, sehr oft sogar, umso größer die Firma, besonders bei so big tech Firmen. Ich weiß z.B. dass Zalando das macht. Die Recruiter geben dir noch mal so ein bisschen Tipps, wie man auf solche Fragen am besten antwortet. Und ein Tipp ist da oft die sogenannte Star Methode, wie man doch seine Antworten doch bitte formulieren sollte. Das ist natürlich nur eine Hilfestellung, aber eine sehr sinnvolle Hilfestellung. Die star Methode, was ist das? Das ist ein strukturierter Ansatz, um verhalten bezogene Fragen zu beantworten. StaR selbst ist ein Akronym, steht für Situation, Task, Action und Result. Und man splittet eigentlich seine Antwort in vier Teile. Und zwar einmal die Situation, man gibt also Kontext über die Ausgangssituation. Man beschreibt diese, in der wir uns befunden haben. Was war da eigentlich los? Dann task die Aufgabe was war deine spezifische Rolle bzw. Deine spezifische Verantwortung in dieser soeben beschriebenen Situation? Dritter Teil der Antwort ist a Action erkläre, welche Maßnahmen du konkret ergriffen hast, um die Herausforderung zu bewältigen, die du halt vorher beschrieben hast. Und dann der letzte Part ist Air Result, also das Ergebnis. Welche Ergebnis haben deine Handlungen erzielt? Und wenn möglich, verwende halt konkrete Zahlen und Erfolge, also ZDF Zahlen, Daten, Fakten. Und wenn wir die ganze Thematik jetzt mal an einem Beispiel durchspielen, dann könnte eine verhaltenbezogene Frage z.b. folgendermaßen erzählen sie von einer Situation, in der sie mit einer knifflichen technischen Herausforderung konfrontiert wurden. Wie sind sie vorgegangen, um das Problem zu lösen? Theoretisch steht dir da frei, jedes seiner vergangenen Projekte oder technischen Herausforderungen zu nehmen. Doch antworte in der Star Methode. Die Situation, also der erste Teil der Antwort, könnte wie folgt in einem meiner früheren Projekte hatten wir ein Problem mit der Performance einer Webanwendung. Die Ladezeiten selbst waren zu hoch, was zu Beschwerden von Endnutzern führte. Okay, zweite die Task. Also was war deine Aufgabe? Meine Aufgabe war es, die Ursache des Performance Problems zu identifizieren und eine effiziente Lösung zu finden, ohne den Projektzeitplan zu gefährden. Dann dritter was hast du gemacht? Die Action. Ich habe zunächst ein Profiling Tool eingesetzt, um Engpässe im Backend und in der Datenbank zu analysieren. Es stellte sich heraus, dass ineffiziente SQL Abfragen der Hauptgrund waren. Danach habe ich eine Optimierung der Abfragen vorgenommen und Indizes auf kritische Datenbanktabellen eingefügt. Zusätzlich habe ich mit meinem Kollegen das Caching Konzept überarbeitet. Und was hatte deine Aktion zur Folge? Was war also das Ergebnis? Die Ladezeiten der Anwendung konnten wir um 60 % reduzieren, was eine Kundenzufriedenheit erheblich steigerte. Außerdem habe ich aus der Analyse ein Best Practice Dokument erstellt, das wir in zukünftigen Projekten verwendet haben. Du merkst also, die Antwort auf die Frage, wo du eigentlich unglaublich ausholen könntest, war sehr, sehr strukturiert. Zweitausendein der Fragesteller hatte eigentlich alle Informationen bekommen, die er oder sie wollte. Doch warum macht diese Star Methode denn jetzt eigentlich Sinn? Oder beziehungsweise warum wird die oft von Firmen auch empfohlen, dass du als Kandidat so antwortest? Ja, im Endeffekt zielt die auf Klarheit und auf eine strukturierte Kommunikation ab. Ich meine, deine Antwort ist prägnant, du vermeidest unnötige Ausschweifungen. Dann Nachvollziehbarkeit, also du providest erst den Inhalt, was war die Situation, dann was war die Aufgabe, dann welche Aktion hast du getätigt und wie war das Ergebnis. Also ganz klare Struktur und natürlich auch durch die Struktur sehr, sehr nachvollziehbar. Und als drittes, und das ist eigentlich der Wert, den du auf einer Arbeit lieferst, du setzt den Fokus auf Ergebnisse bzw. Agierst ergebnisorientiert. Und deswegen ist es so wichtig, dass du im vierten Teil deiner Antwort wirklich Zahlen, Daten, Fakten präsentierst und nicht einfach nur es wurde besser, weil besser ist immer im Vergleich zu was. Und dann geht es halt immer tiefer, tiefer, tiefer. Und das kann halt echt zu einem langwierigen, anstrengenden Interview führen. Immer wenn du eine Frage in einem Interview bekommst, denk mal ganz kurz darüber nach, was ist das eigentlich für ein Fragetyp? Eine fachliche Frage, eine situative Frage oder eine verhaltensbezogene Frage? Und denk darüber nach, wie du darauf antwortest. Die Star Methode selbst kann dir selbst einen Schutz geben, um nicht den Fokus zu verlieren und wirklich gezielt und auf die Frage zu beantworten mit den relevanten Informationen. Denn besonders wenn du von dir weißt, dass du sehr anfällig dafür bist, abzuschweifen oder nicht zum Punkt zu kommen, dann kann die SA Methode dir halt echt eine Struktur geben. Denn auch eine etwas übereifrige Kommunikation, du möchtest so viel Input geben wie möglich und alles so detailreich wie möglich zu beschreiben, das kann sich negativ auf das Interview auswirken. Denn denk immer dran, die Person, die dich interviewt, hat eigentlich einen Zeitplan, hat sehr viele Fragen an dich und das muss halt getaktet sein. Und wenn du halt konstant 10 15 Minuten am Stück redest, ich überspitze jetzt mal, ich hoffe, das tut ihr nicht, dann kann sich dies wirklich negativ auf Interview auswirken. Also Star Methode, Akronym für Situation, Task Action Result. Teile deine Antwort in vier Teile und dann würde ich sagen, genieß die Weihnachtszeit, geh mal in dich und wenn du dir überlegst, mal deinen Marktwert zu checken bzw. Dir einen neuen Job zu suchen, denk an die Star Methode bei verhaltensbezogenen Fragen. Viel Erfolg beim nächsten Interview und tschüss.",
            "start": 44670,
            "end": 491140,
            "confidence": 0.9072502,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Danke Andi. Und wenn dir die Episode gefallen hat, leite diese doch mal an eine Kollegin oder an einen Kollegen weiter, der immer etwas zu weit ausholt. Vielleicht erkennt dann die Person den Wink mit dem Zaunpfahl. Und wenn du noch mehr Stoff zu Bewerbungen und Karriere hören willst, in den Shownotes findest du einen Link zu unseren Episoden, zu dem ganzen Themenkomplex, von unseren Kriterien für einen Traumjob bis hin zu weiteren Tipps für Interviews, egal ob du als Bewerber in oder als Hiring Managerin im Interview sitzt. Und damit wünsche ich dir noch einen kommunikativen Tag.",
            "start": 491520,
            "end": 521330,
            "confidence": 0.928644,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.90871364,
    "audio_duration": 529,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}