{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/6ff50f43-e269-46bc-85aa-a0f79abeaafb/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "87f0f1f4-3ea5-4b8e-b76b-c9a5e1712ce2",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Das neunte Türchen vom Engineering Kiosk Adventskalender hat wieder einen Community Beitrag für euch. Diesmal mit Dodo und Ellen vom Unmute IT Podcast. Aber zuerst etwas in eigener Sache. Etwas zum Lachen, um die Laune etwas hochzuheben. Also, bereit?",
            "start": 6160,
            "end": 21810,
            "confidence": 0.8942621,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Because they work below sea level.",
            "start": 25480,
            "end": 27540,
            "confidence": 0.93295,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Was ein Knaller. Ich hoffe auch du grinst etwas. Ich tue es auf jeden Fall. Wie dem auch sei, nun übergebe ich das Mikrofon an die beiden Damen. Viel Spaß.",
            "start": 28160,
            "end": 37024,
            "confidence": 0.96278167,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hallo zusammen, wir sind Ellen und Dodo. Wir sind der unmuted Podcast. Unmute it geschrieben, weil es verwirrend sein kann. Wir sind ein Podcast von und mit Frauen aus der IT für alle Nerds und Neugierige, die uns gerne zuhören möchten. Der Engineering Kiosk hat uns gefragt, ob wir eine adventskalender Folge für sie machen. Das machen wir natürlich sehr gerne. Und wir haben uns Grace Hopper ausgesucht, weil sie nämlich heute geboren ist. Am neunter Dez. 1906 in New York, also schon eine ganze Weile her.",
            "start": 37192,
            "end": 71736,
            "confidence": 0.9144329,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Grace Murray Hopper. Die hat einen zweiten Namen sogar. Oder auch Amazing Grace oder Grandma Cowboy. Genau. Wir haben uns das so überlegt, dass Doreen euch Grace Hopper einmal einordnet und euch ein bisschen was von ihrem Leben erzählt. Und ich habe mir dann noch mal zwei, drei Geschichten rausgesucht, die ich einfach noch mal mega cool fand, die so ein bisschen ihren Charakter beschreiben und die man vielleicht auch noch nicht gehört hat. Selbst wenn man Grace Hopper kennt, bleibt bis zum Ende dran.",
            "start": 71808,
            "end": 98208,
            "confidence": 0.8972442,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sie hat 1904 und dreiig in Mathematik promoviert an der Universität Yale. Das war ziemlich selten, auch für Männer der Zeit und ist dann neun Jahre später in die Marine eingetreten. Sie wurde zuerst abgelehnt, weil sie relativ klein ist, aber dann Gott sei Dank doch aufgenommen.",
            "start": 98344,
            "end": 116068,
            "confidence": 0.9425408,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Weißt du, was sie dazu gesagt hat?",
            "start": 116164,
            "end": 118148,
            "confidence": 0.9872,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Nee.",
            "start": 118244,
            "end": 118700,
            "confidence": 0.58201,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "All these years I've been trying to explain that i have Scottish ancestors. I'm lean and tough. I don't need to weigh one hundred forty pounds.",
            "start": 118780,
            "end": 128200,
            "confidence": 0.89889115,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "That's cute. Sie war auch ziemlich tough. Sie war nämlich in ewig in der Marine. Sie hat eine Ausbildung gemacht und wurde dann Leutnant und kam dann in den Kontakt mit Computern. Und zwar wurde sie nach Harvard versetzt und hat dort an einem der ersten Computer gearbeitet und damals auch den Begriff des Bugs geprägt. Das ist so eine der Sachen, eine der Geschichten, die man am häufigsten findet, wenn man sich mit ihr beschäftigt, ist, dass sie ein tatsächliches Insekt in dem Computer gefunden hat und das der allererste Bug war. Und sie deswegen den Namen bug geprägt hat.",
            "start": 129460,
            "end": 162028,
            "confidence": 0.93088007,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, Witzigerweise gab es den Begriff des Bugs auch schon, aber sie hat dann dem Begriff noch mal zu Berühmtheit geholfen. Und dieses Bild von dieser Motte in dem Logbuch, wo sie das eingeklebt hat, das ist halt super bekannt. Sie sagte dann, from then on when anything went wrong with the computer, we saddle had bugs in it. Und das war so ein bisschen das, was das ganze Ding dann so befeuert hat.",
            "start": 162084,
            "end": 184096,
            "confidence": 0.8826562,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Mark One übrigens, sie hat auch an Mark zwei und Mark drei noch gearbeitet.",
            "start": 184168,
            "end": 188248,
            "confidence": 0.8997507,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Wenn sie Anekdote aus erster Hand hören will, es gibt ein YouTube Video, in dem sie das erzählt, das werden wir euch verlinken.",
            "start": 188304,
            "end": 196108,
            "confidence": 0.88976175,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Grace Hopper ist an einer der stärksten Innovationen, finde ich, in der Informatik beteiligt. Sie hat nämlich Programmiersprachen entwickelt, die man tatsächlich lesen kann.",
            "start": 196264,
            "end": 205804,
            "confidence": 0.9487829,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist total geil.",
            "start": 205852,
            "end": 206700,
            "confidence": 0.972395,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, bevor es sie gab, waren das so kryptische Sachen. Niemand konnte damit was anfangen, man musste es ewig lernen. Und sie war so, das muss doch einfacher gehen. Sie hat dann 1952 Flowmatic entwickelt und das ist die erste Programmiersprache, die man lesen kann. Die hat dann später zu Cobol geführt. Und das ist eine Programmiersprache, die manchmal heute noch verwendet wird. Nicht von vielen Menschen, aber wenn ihr das könnt, könnt ihr sehr viel Geld verdienen. Auf jeden Fall. Und die war dann tatsächlich für Menschen auch lesbar. Also wenn man Sachen addiert, stand da add anstatt irgendwelche Nullen und Einsen.",
            "start": 206780,
            "end": 242656,
            "confidence": 0.94389933,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, und dementsprechend sind natürlich auch viele Compiler, Interpretierer und eben dann auch Programmiersprachen entstanden. Und auch da wieder eine Anekdote. Ich habe mir so ein paar YouTube Videos von ihr angehört. Das sind echt coole Sachen, die sie da erzählt, dass sie einfach keiner geglaubt hat, dass sie einen laufenden Compiler hatte und auch keiner wollte das anfassen. So, die haben ja dann erzählt, so Computer können nur Arithmetik, so lass uns mal in Ruhe quasi. Und das zeigt vielleicht auch noch mal, in was für einer Zeit sie da gelebt hat. Also wirklich eine Frau mit Durchhaltevermögen.",
            "start": 242728,
            "end": 276740,
            "confidence": 0.9076481,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, und sie wurde in den Zwangsruhestand versetzt, als sie 60 Jahre alt wurde. Aber sechs Monate später hat man sich gedacht, irgendwie brauchen wir sie doch.",
            "start": 276860,
            "end": 286180,
            "confidence": 0.9545063,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Das ist so gut.",
            "start": 286640,
            "end": 287860,
            "confidence": 0.853225,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und dann meinen sie, ja, für sechs Monate holen wir dich noch mal zurück. Aus den sechs Monaten sind dann 19 Jahre geworden, die sie noch weiterhin im Dienst geblieben ist und bis zum Admiral hochbefördert wurde.",
            "start": 288200,
            "end": 299552,
            "confidence": 0.9096897,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, und selbst danach ist sie dann noch Beraterin geblieben.",
            "start": 299616,
            "end": 302240,
            "confidence": 0.936112,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Das ist schon krass.",
            "start": 302320,
            "end": 303160,
            "confidence": 0.83188,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Ja, und ja, um da einmal direkt auch einzuhaken, apropos back und apropos Kobold, als Grace Hopper Flow Magic entwickelt hat, da waren wir ja noch in einer Zeit, in der Speicherplatz teuer war. Und sie hat sich dann gedacht, ja, ich mache mal die Jahreszahlen zweistellig, weil so lange wird meine Sprache hier sowieso nicht überleben. Das wurde dann aber auch in Cobol übernommen und hat dann, als dann die Jahrhundertwende kam oder eben auch die Jahrtausendwende, für ganz schöne Aufruhr gesorgt. Ich meine, wer war da acht? Also leider noch nicht so alt, dass man das mitbekommen hätte, aber ich glaube, hätte ich da schon gearbeitet, zweitausendein wäre spannend geworden. Ja, ich habe euch noch mal, ich habe schon so ein paar Zitate reingeworfen, aber ich habe noch mal welche mitgebracht, die auch zeigen, was sie für ein Mensch ist. Und zwar hat Grace Hopper auch gesagt, the most dangerous phrase in language ist, we've always done it this way. Zusammen mit, it's easier to ask forgiveness than it is to get Permission. Das hat sie auch gesagt. Ich finde, beides zeigt so ein bisschen, was sie für eine Einstellung brauchte. Und sie hatte auch Vorlesungen gegeben und da droht sie ihren Studierenden, sie zu verfolgen, wenn sie es wagen zu sagen, ja, das haben wir ja immer schon so gemacht, das finde ich irgendwie total geil. Und es ist halt echt eine Frau mit Charakter. Und hinter ihrem Tatendrang, so an den ganzen Sachen, die sie so gemacht hat, hat vor allem die Passion für Computer und deren Programmierung gesteckt. Also das können, glaube ich, alle, die schon mal einen Programmcode geschrieben haben, nachempfinden. Und sie hat sich z.b. selbst auch gar nicht so als Feministin bezeichnet. Trotzdem hat sie sich halt als IT Pionierin viel für Frauen getan. Und da wollte ich eine Anekdote erzählen, nämlich hat sie einer jungen Mutter, Betty Hoggers, erlaubt oder ermöglicht, sogar von zu Hause zu arbeiten. Und damals war Remote Work ohne Internet, sah das halt so aus, dass eben Computer, die eben Tonnen wogen, zweitausendein dann irgendwo hingebracht werden mussten. Also mega geile Geschichte auch. Leider haben sowohl Doreen als auch ich Grace Hopper ganz knapp verpasst. Die ist nämlich wann gestorben?",
            "start": 303240,
            "end": 431360,
            "confidence": 0.90423346,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Sie ist am 1. Jan. 1992 gestorben. Halbes Jahr.",
            "start": 431480,
            "end": 435312,
            "confidence": 0.8528422,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Es war sehr traurig, hätte es cool gefunden, hätte sich das ein bisschen überschnitten, aber wurde eben auch mit militärischen Ehren beigesetzt. Und ich meine, neben ihren ganzen Preisen und so, ist es, glaube ich, auch noch eine sehr heftige Ehre, die einem so zuteil wird. Grace Hopper ist ja einige von wenigen uns bekannten Frauen in der IT. Und ich habe mich noch mal so ein bisschen damit beschäftigt, warum ist das eigentlich so? Also gibt es nur so wenige oder kennen wir die einfach nur nicht? Und es ist, glaube ich, viel mehr dieses, man kennt sie einfach nicht. Zum einen, weil die Namen nicht dokumentiert sind und weil Frauen ja auch immer mal wieder so aus Science und Wissenschaft rausgedrängt werden. Und eine Sache habe ich nämlich gelernt, und zwar habe ich so einen Ausschnitt von einer Vorlesung von Dr. Roy casagranda gesehen. Der ist teilweise auch in seinen politischen Äußerungen ein bisschen kontrovers diskutiert. Aber den Fakt hier fand ich trotzdem spannend, weil er nämlich erzählt, dass Sokrates, der Philosoph, natürlich auch von irgendwem gelernt hat. Und das war eine Frau, und zwar Aspasia war ihr Name. Und da ist jetzt so ein bisschen die Frage, warum wissen wir das eigentlich nicht? Und ich habe auch mal die Wikipedia Einträge von beiden verglichen. Jetzt darfst du mal wieder schätzen, Doreen. Was glaubst du, wie viele Worte stehen in Aspasias Wikipedia Eintrag und wie viele Worte in dem von Sokrates?",
            "start": 435376,
            "end": 528590,
            "confidence": 0.91160023,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Also das von Sokrates ist bestimmt sehr viel, weil es wird auch oft in der Schule durchgenommen und dann ist das auch eine gute Summary. Das heißt, ich würde sagen, was hast du gefragt? Wie viele Wörter? Schon so Wörter. Und von aspasia vielleicht so ein guter Absatz, so 300.",
            "start": 528750,
            "end": 547490,
            "confidence": 0.9507144,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Also Sokrates über 16500 Worte und Aspasia 585 Worte. Und natürlich auch ein Abschnitt darüber, ob sie verheiratet ist oder nicht. Klar, also das muss man da wahrscheinlich noch von abziehen. Genau. Und noch heute gibt es auch Leute, die behaupten, dass Aspasia gar nicht existierte, obwohl Sokrates selbst halt von ihr berichtet, z.B. in Platons Menexenus, da beruft er sich auf Aspasia als seine Lehrerin der Rhetorik. Was eben dieser Professor in seiner Vorlesung erzählt, ist, dass wir Christen wurden oder als die Menschheit, als das Christentum erschaffen wurde, dass da den Männern halt nicht so gut gefiel, dass Frauen Lehrerinnen und auch Führerinnen waren und dass sie dann ganz systematisch Frauen aus den Büchern gelöscht haben, weil das halt ein bisschen besser in die patriarchale Ordnung passte. Also schon damals ist das passiert. Und deshalb umso wichtiger, dass wir heute auch mal über Role Models sprechen und auch ein bisschen über die nachdenken, die es schon damals auch gab. Das ist auch das, was unser Podcast ein bisschen macht. Also wir laden vor allem andere Frauen und weitere Minderheiten in der IT ein, um eben eine Plattform zu bieten. Also wenn ihr bei uns mal reinhören wollt, dann macht das doch gerne mal.",
            "start": 549390,
            "end": 630046,
            "confidence": 0.92675257,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und jetzt sagen wir vielen Dank an Andi und Wolfgang für diese schöne Idee für Adventskalender folgen. Und wir hoffen, ihr habt was gelernt und ihr hattet Spaß beim Zuhören. Falls ihr Interesse an vielfältigen anderen IT Themen habt, dann schaut mal bei uns vorbei. Ansonsten wünsche ich euch eine sehr schöne Dezember. Tschüss.",
            "start": 630198,
            "end": 651718,
            "confidence": 0.8968187,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Tschüss.",
            "start": 651854,
            "end": 652610,
            "confidence": 0.52909,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hier ist wieder Andy Engineering Kiosk. Vielen lieben Dank an Dodo und Ellen und Happy Birthday auch an Gracehopper. Wenn ihr also nun mehr von Dodo und Ellen hören wollt, schaut doch mal in die Shownotes. Da findet ihr die entsprechenden Links zum Unmuted Podcast. Ich entlasse euch nun in die Weihnachtszeit. Bis zum nächsten Mal. Tschüss.",
            "start": 653190,
            "end": 670990,
            "confidence": 0.88942105,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.9141307,
    "audio_duration": 688,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}