{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/1e012564-f613-4663-b84e-425e5c599c02/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "62b81ef3-5f5b-40c9-9281-5ede98cf1b7f",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Herzlich willkommen zu einem weiteren Türchen vom Engineering Kiosk Adventskalender. Heute dreht sich alles um das Thema Datenbanken. Wir starten mit einem wahren Kracher, um dir ein Lächeln ins Gesicht zu zaubern. Ich hoffe, die Query konnte sich noch einen Platz am Tisch sichern. Aber die Zeit um Weihnachten ist auch die Zeit für schöne Geschichten. Heute präsentiert Wolfgang euch eine schöne Weihnachtsgeschichte rund um Wichtel und Weihnachtswünsche. Wolfgang, gib alles.",
            "start": 8039,
            "end": 40570,
            "confidence": 0.93573564,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Die Weihnachtswerkstatt wie Die Wichtel mit optimistischem Locking Weihnachten retteten in der hochmodernen Weihnachtswerkstatt des Notebooks wird die Arbeit von einer riesigen Taskdatenbank gesteuert. Darin sind alle Weihnachtswünsche von 2 Milliarden Kindern gespeichert und tausend fleißige Wichtel arbeiten rund um die Uhr Ÿousand um diese Wünsche zu erfüllen. Um Chaos zu vermeiden, verwendet die Datenbank pessimistisches Locking. Sobald ein Wichtel wie Trixi einen Task aus der Datenbank zieht, wird dieser sofort gesperrt, damit kein anderer Wichtel denselben Task bearbeiten kann. Doch eines Nachts, als die Deadline bedrohlich näher rückt, passiert das Undenkbare. Neun, acht, sieben, sechs, fünf, vier, drei, zwei, eins. Bau eines magischen Spielzeugroboters für Andy in Duisburg wird gesperrt und bleibt gesperrt. Wichtel Max versucht die Aufgabe zu übernehmen, aber die Datenbank meldet das gesperrt. Zugriff verweigert. Das ist unmöglich. Ruft Max. Wer hat den Task gesperrt? Die Wichtel durchsuchen fieberhaft die Werkstatt, bis sie Trixi schlafend hinter einem riesigen Geschenksberg finden, noch mit ihrem Tablet in der Hand. Der Task ist immer noch gesperrt, obwohl Trixi längst eingeschlafen ist. Und die Deadline rückt näher und der Weihnachtsmann sieht besorgt auf die Anzeige. Task Q blockiert. Doch da kommt Wichtel Eller, die kluge IT Expertin, um die Ecke und schlägt eine radikale Lösung vor. Wir müssen auf optimistisches Locking umstellen. Wichtel Max runzelt die Stirn. Aber, aber, aber was, wenn zwei von uns denselben Task bearbeiten? Wird das nicht chaotisch? Ella holt ihr magisches IT Tablet hervor und beginnt zu erklären. Stell dir vor, jeder Task in der Datenbank hat eine Versionsnummer, die bei seiner Erstellung auf eins gesetzt wird, sagt sie und zeichnet ein Task Symbol in die Luft. Wenn jetzt ein Wichtel wie du oder Trixi den Task bearbeiten, wird diese Versionsnummer mitgelesen und gemerkt. Nehmen wir an, fährt sie fort. Du öffnest den Task 9000078 95321 Spielzeugroboter für Andi. Und Die Versionsnummer des Tasks ist erste du fängst an zu arbeiten und gleichzeitig öffnet auch Trixi denselben Task und sieht ebenfalls die Versionsnummer. Erste nehmen wir an, fährt sie fort. Du öffnest den Task 9000863 21 Spielzeugroboter für Andi und Die Versionsnummer des Tasks ist erste. Du fängst an zu arbeiten und gleichzeitig öffnet auch Trixi denselben Task und sieht ebenfalls die Versionsnummer erste. Ihr merkt beide nicht, dass ihr gleichzeitig daran arbeitet. Max nickt mehr oder weniger verständnisvoll, aber aber was passiert, wenn wir beide fertig sind? Ella lächelt. Und jetzt kommt die Magie des optimistischen Lockings. Beim Speichern prüft die Datenbank, ob sich die Versionsnummer des Tasks verändert hat, während ihr beide daran gearbeitet habt. Angenommen, Trixi speichert zuerst. Die Datenbank sieht, die aktuelle Versionsnummer ist eins, also wird die Änderung akzeptiert. Jetzt erhöht die Datenbank die Versionsnummer auf zweite. Ÿousand, wenn du danach speichern willst, erklärt Ella weiter, vergleicht die Datenbank die Versionsnummer eins, die du gemerkt hast, mit der aktuellen Versionsnummer zweite. Ah. Max schlägt sich mit der Hand auf die Stirn und wenn die Nr. Nicht übereinstimmt, merkt die Datenbank, dass ich mit veralteten Daten gearbeitet habe. Genau, sagt Ella. Dein Speichern wird abgelehnt und du bekommst eine Meldung, dass sich der Task geändert hat. Du kannst die neue Version laden und deine Änderungen erneut vornehmen, falls sie noch relevant sind. Das ist clever, ruft Max beeindruckt. So wird nichts gesperrt, aber wir arbeiten trotzdem sicher und merken es beim Speichern, wenn wirklich ein Konflikt entsteht. Ganz genau, lächelt Ella. Das nennen wir optimistisches Locking. Es setzt darauf, dass nicht ständig Konflikte passieren und nur wenn wirklich jemand anderer schneller ist, müssen wir eingreifen. So sparen wir uns unnötige und vor allem teure atomare Blockierungen und arbeiten viel schneller. Also scheint jetzt Weihnachten gerettet zu sein, denn dank optimistischem Locking laufen alle Tasks wieder reibungslos. Die Wichtel können mehr Aufgaben gleichzeitig bearbeiten und die Datenbank bewältigt den Ansturm ohne Sperrungen schneller und reibungsloser als je zuvor. Die Wichtel konnten ohne ständige Sperrungen arbeiten und selbst wenn mal ein Konflikt auftauchte, wurde dieser schnell und effizient gelöst. So war der magische Schlitten des Weihnachtsmann pünktlich beladen und die Deadline war gerettet. Als die Wichtel dann nach der hektischen Nacht versammelt am wärmenden Kamin saßen und den Erfolg feierten, sagte der Weihnachtsmann mit einem zufriedenen Lächeln. Es ist schön zu sehen, dass wir mit einer optimistischen Herangehensweise so viel Geschwindigkeit und Effizienz gewonnen haben. Unsere Datenbank hat uns etwas Wertvolles gelehrt. Man muss nicht immer auf den schlimmsten Fall vorbereitet sein. Wenn wir darauf vertrauen, dass Dinge gut gehen und nur dann eingreifen, wenn wirklich ein Problem auftritt, können wir viel produktiver und entspannter arbeiten. Und damit im Namen von allen Wichteln und dem Weihnachtsmann frohe Weihnachten.",
            "start": 41750,
            "end": 339716,
            "confidence": 0.912015,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Danke Wolfgang für diese schöne Weihnachtsgeschichte. Ich bin richtig froh, dass Weihnachten dank kluger Strategien nun für alle Kinder gerettet ist. Wenn ihr auch mal eine gute Tat tun wollt, empfiehlt diese Episode doch mal ein paar Freunden oder Kolleginnen weiter oder teilt diese auf Social media. Dies würde uns, Wolfgang und mich, ebenfalls sehr froh machen. Bis dahin eine schöne Adventszeit wünscht euch euer engineering Kiosk.",
            "start": 339868,
            "end": 363430,
            "confidence": 0.9315667,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.91533077,
    "audio_duration": 371,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}