{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/9b4314c9-d41b-4c73-9298-9fde72003393/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "00f35616-a8c4-42a1-8a78-76a6f3811cd9",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zum fünfzehnte Türchen des Engineering Kiosk Advent Kalenders. Aber bevor wir loslegen, habe ich noch eine schnelle Frage. Also falls ihr zu diesen Hackern gehört, lasst euch nicht dabei erfischen. Bei so vielen schlechten Witzen kann mir jetzt eigentlich nur mehr einer aus der Misere helfen. Zweitausendein. Genau, Christian Stankovic vom Focus on Linux Podcast, vom Faxinformatiker Podcast und Thinkpad Museum Podcast. Denn der hat es wirklich drauf, Content zu produzieren im Focus on Linux Podcast, aktuell im Advent sogar jeden Tag und nicht nur 10 Minuten. In dieser Episode hilft uns Christian aber bei einem ganz anderen Problem weiter. Vielleicht kennt ihr das auch. Seitdem Elon Musk Twitter kaputt gemacht hat, sind wir ja alle irgendwie auf der Suche nach einer ordentlichen Microblogging Plattform und darum gibt es jetzt mehr zum Fediverse. Los geht's.",
            "start": 9480,
            "end": 57410,
            "confidence": 0.88479984,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hallo liebe Zuhörende und herzlich willkommen zur heutigen Adventskalendertür des Engineering Kiosk Podcasts. Mein Name ist Christian Stankovic, ich bin IT Berater und Trainer und moderiere die Focus on Linux und ThinkPad Museum Podcasts und bin auch Teil des Faxinformatiker Quintetts. Heute möchte ich allerdings mal die Lanze für ein sehr spannendes und wichtiges Thema brechen, das mir vor allen Dingen auch am Herzen liegt, nämlich dem Fediverse. Aber was ist das Fediverse überhaupt? Nun, zunächst mal ist der Name ein Coverwort, bestehend aus Federated und universe, also im Prinzip ein föderiertes Universum verschiedenster Dienste. Und viele dieser Dienste sind eben open source nach Entwicklung von Diensten da draußen, die wir bereits kennen. Wenn ihr z.B. bisher gerne Twitter benutzt habt, dann habt ihr gerne einen Microblogging Dienst benutzt und von Diesen gibt es auch einige im Fediverse. Beispielsweise am prominentesten Mastodon, aber auch Pleroma und Firefish sind solche Tools. Wenn ihr eher so Generationen Facebook seid, dann habt ihr einen Makroblogging Dienst benutzt und auch diese gibt es mit Frantica und Hubsilla im Fertiverse. Wenn ihr aber lieber eher Bilder von eurem Essen oder von eurem Shiba Inu Welten gepostet habt, dann habt ihr das vermutlich bisher immer auf Instagram getan und das könntet ihr in Zukunft auch auf Pixel Fed tun. Auch Video Content gibt es im Fediverse. Hier haben wir zwar kein YouTube, aber mit Peertube gibt es eine Anwendung, die dem sehr nahe kommt. Und wenn ihr bisher Musik und Podcasts gerne über Spotify gehört habt, dann könnt ihr euch in Zukunft vielleicht mal die Tools Funkvail und Custopod anschauen. Und im nächsten Dienst erkenne ich mich häufig wieder, nämlich Reddit, ein sogenannter Link Aggregator, wo viele Links und kleinere Diskussionen vom Zaun gebrochen werden. Auch das gibt es hier, heißt hier eben nur Lemmy oder Ambin. Und das war wirklich nur eine ganz kleine Auswahl an verfügbaren Diensten. Es gibt sicherlich noch viel mehr dieser Tools und die habe ich euch auch alle mal in den Show Notes verlinkt, so dass ihr da im Nachhinein Nachgang, wenn es euch interessiert, einfach mal reinklicken und euch durch scrollen könnt. Aber die Liste wächst auch immer. Also ihr seht, das Fettiverse ist noch recht jung und es gibt hier immer noch Raum zur Optimierung und neue Tools sprießen auch immer noch aus dem Boden. Aber was bedeutet denn jetzt föderiert hier überhaupt in dem Kontext? Nun, es bedeutet, dass die Dienste von den Anbietern entkoppelt werden. Und das hat für euch einen Vorteil. Ihr seid nämlich Gängelungen nicht mehr schutzlos ausgeliefert, wie das z.B. zuletzt bei Twitter und Reddit mit API Beschränkungen der Fall war. Das heißt, ihr könnt einfach einen beliebigen Kleid benutzen und werdet hier nicht limitiert, um mal bei einem Beispiel zu bleiben. Föderiert bedeutet hier auch, dass es nicht nur ein Mastodon gibt, so wie es z.B. ein Twitter gibt, sondern viele Mastodon Server. Und man nennt das eben auch Instanzen. Und der Grundgedanke, der ist ja eigentlich überhaupt nicht neu, denn das war bei E Mail auch immer der Fall. Ihr könnt ja z.B. auch von einem Posteo e Mail Konto eine E Mail zu Google senden und umgekehrt. Wir haben es uns einfach nur im Laufe der Jahre abgewöhnt, weil es sehr viel komfortable, zentralisierte Dienste gegeben hat. Zu den weiteren Vorteilen zählt, dass ihr unabhängig vom Anbieter seid. Ihr könnt jederzeit eure Daten exportieren und auf eine andere Instanz migrieren. Ihr habt somit die freie Wahl des Servers und im Internet auf den Projektseiten gibt es meistens eine Liste verfügbarer Instanzen. Natürlich könnt ihr auch trotzdem weiterhin außerhalb eurer Instanz tätig werden und könnt z.B. inhalte anderer Instanzen lesen und auch dortigen Konten folgen. Das Gesamtsystem ist somit weniger anfällig wie Totalausfälle. Und ganz wichtig, es gibt keine kapitalistische Orientierung, keinen Algorithmus, der euch zum Doomscrollen einlädt. Vielleicht z.b. wenn ich um 23 Uhr noch mal meinen Mastodon öffne und nach Updates suche, dann gibt es da eben einfach nichts mehr, weil die meisten Leute einfach schon im Bett liegen wie ich es auch tun sollte und schlafen, statt sich im Internet umherzutreiben. Das Fettiverse ist dabei noch nicht mal neu. 2008 gab es mit Identica und Gnu Social die ersten beiden Dienste und seit 2016 ist das Fettiverse in aller Munde, was vor allen Dingen auch an Mastodon liegen dürfte. Die breite Aufmerksamkeit seit dem medienwirksamen Niedergang von Twitter seit 2022 haben dem Dienst nämlich sehr viel Aufmerksamkeit beschert. Und die Frage, die sich jetzt vielleicht stellt, ist, wie intensiv wird das Fediverse denn überhaupt genutzt? Da gibt es eine eigene Statistiken Datenbank und die besagt aktuell, dass es circa 11 Millionen User gibt. 7,5 Millionen davon allein auf Mastodon. User benutzen Lemmy, also den Reddit Klon, sind auf Peertube anzutreffen und teilen dort Videos und Leute teilen auf Pixelfat Bilder von EMs vermutlich. In Summe gibt es Instanzen und ein Mythos, der sehr häufig genannt wird, ist, dass man als Account mit weiter Reichweite das Fediverse ja gar nicht nutzen kann. Dafür ist ja die Infrastruktur überhaupt nicht stark genug und dafür braucht es eben sowas wie Instagram, Facebook oder Twitter. Dem würde ich so ein bisschen widersprechen wollen, denn dadurch, dass das System sehr verteilt und föderiert aufgebaut ist, habt ihr eben die Wahl, auf was für einem Server ihr euch herumtreibt. Und das kann natürlich auch zur Folge haben, dass es einfach Instanzen gibt, wo mehr und wo weniger los ist. Und die Instanzen können auch einfach unterschiedlich designt sein. Also hinter jeder Instanz steht irgendwo ein Server, der kann beliebig groß oder klein sein, je nachdem wie viele Inhalte dort geteilt und publiziert werden. Und es gibt z.B. auch eine Instanz des Bunds, das wäre Social Bund dE. Da haben auch einzelne Behörden schon ihre Konten und teilen da Informationen. Also auch das ist möglich und das wird intensiv genutzt. So eine richtige Influencer Instanz kenne ich jetzt persönlich nicht, aber auch Personen mit weiter Reichweite nutzen das Fettiverse. Da wäre jetzt als Beispiel einmal Jan Böhmermann zu erwähnen, der circa Follower innen hat und das skaliert trotzdem ganz gut. Also ich würde nicht behaupten, dass ich einen seiner Posts bisher verpasst habe und von Ausfällen aufgrund seiner Postings habe ich bisher auch noch nichts gehört. Also der Ausrede können wir glaube ich widersprechen. Weiteres Beispiel wäre auch noch der Postillon, sehr bekannte Satire News Cite, die mit Follower innen auch sehr viel Reichweite generiert. Dreh und Angelpunkt des Fediverse ist ein Protokoll mit dem Namen Activity Pub. Dieses wird seit 2018 vom WC spezifiziert und ist im Prinzip das Kommunikationsprotokoll. Und das WC, das ist das World Wide Web Consortium ist ein Gremium zur Standardisierung von Internet Techniken. Diese Spezifikation sieht vor, dass die Dienste untereinander kompatibel sein sollten. Das bedeutet, ihr könnt Podcasts, die über custom Pod gehostet werden, über Mastodon abonnieren. Oder ihr könnt auch in Mastodon oder einem anderen Client, den ihr benutzt, Pixel Fed Posts direkt sehen, ohne dass ihr die Webseite aufrufen müsst. Generell habt ihr dadurch eine breite Auswahl an Clients. Die gibt es für unterschiedliche Betriebssysteme. Neben den üblichen Smartphone Apps gibt es z.B. auch Desktop und sogar Kommandozeilen Clients. Wer also schon immer mal an einem Linux Server über SSH angemeldet sein wollte und dann auf der Kommandozeile ein paar Tools absetzen wollte, Bitteschön, ihr habt die freie Wahl. Die Frage, die ihr euch jetzt vielleicht stellt, ist, bedarf es des Feddiverse überhaupt? Und da würde ich sagen, es war nie wichtiger, Alternativen zu kapitalorientierten Diensten zu haben. Und ich würde euch hier motivieren, einfach mal den Mut zu haben, es auszuprobieren. Auch Firmen sollten das tun. Es gibt keine sinnvollen Argumente mehr, heutzutage noch ernsthaft auf Twitter unterwegs zu sein. Ich selbst habe vor circa drei Jahren den Schritt gewagt und ich kann euch sagen, mir hat das persönlich echt gut getan, denn das Doom Scrolling hat deutlich nachgelassen, weil kein Algorithmus dahinter. Ich reg mich auch ganz selten nur noch über irgendwelche Postings auf, weil mir eben ein fehlender Algorithmus keinerlei Inhalte mehr in die Timeline spülen kann, damit ich länger in der App bleibe. Und ich muss auch zugeben, dass ich sehr viel neue Kontakte durch die flauschige Community aufgebaut habe. Und da ist vielleicht der Einstieg auch ein bisschen schwierig. Viele Leute sagen, nun, das klingt ja alles schön gut, aber wo soll ich denn anfangen? Guckt am besten mal in die Show Notes. Da gibt es z.B. eine Liste verfügbarer Mastodon Instanzen. Und da könnt ihr einfach mal eintippen, was euch interessiert, welche Themen, wo ihr wohnt, ob ihr eher eine deutschsprachige Community wollt oder vielleicht eine internationale. Und dann werden euch Instanzen vorgeschlagen und dann könnt ihr einfach auf einer beliebigen mal starten. Und wenn ihr dann doch merken solltet, dass das einfach nicht eure Community ist, dann könnt ihr ja einfach euren Account umziehen und dann zur nächsten Instanz wechseln. Ich selbst bin auf Chaos Social. Das ist im Prinzip die inoffizielle Mastodon Instanz des Chaos Computer Clubs. Da treffe ich auch vor allen Dingen viel Gleichgesinnte, also Leute, die sich für Open Source, IT, Retro Computing, Nerdstuff und so weiter interessieren. Aber die Liste ist wirklich lang. Schau da gerne mal vorbei, zweitausendein. Ansonsten bedanke ich mich für die Aufmerksamkeit. Das Ganze ist jetzt natürlich nur ganz kurz angerissen worden in dieser Episode. Also wenn euch das Thema mehr interessiert, guckt einfach mal euch die verschiedenen Dienste an oder hört auch mal bei Focus und Linux vorbei, denn da haben wir letztes Jahr eine zweieinhalb Stunden Deep Dive Episode über das Fediverse veröffentlicht mit zwei tollen Expertinnen, die da schon wesentlich länger unterwegs sind als ich. Und die haben vielleicht auch noch den einen oder anderen Tipp für euch, zweitausendein. In dem Sinne, stay federated, probiert es aus und habt eine schöne weitere Adventszeit. Bis dahin.",
            "start": 63510,
            "end": 631650,
            "confidence": 0.9137167,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Vielen Dank, Christian, für die Episode. Wer mehr von Christian hören will, klickt sich am besten einmal in das Focus on Linux Podcast rein, wo es aktuell sogar auch jeden Tag eine Adventepisode gibt. Den Link findet ihr natürlich in den Shownotes. Und wenn ihr jetzt Lust bekommen habt, das Fediverse mal auszuprobieren, folgt uns doch einfach auf Mastodon und gebt uns Feedback, dass diese Episode euch auf die Plattform gebracht hat. Und den Christian findet ihr natürlich auch dort. Das war's von uns. Bis morgen.",
            "start": 637950,
            "end": 663840,
            "confidence": 0.90118486,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.9110229,
    "audio_duration": 668,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}