{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/675ff1a0-a2be-4113-97e1-9d054742caf2/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "80ecb1e6-98a7-4168-8daf-88f08953dbf0",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zum 20. Türchen des Engineering Kiosk Adventkalenders. Kennt ihr eigentlich diese Leute, die wahre Zauberer auf der Tastatur sind und die Maus oder das Trackpad gar nicht benutzen? Ich denke mir dabei immer wow, sowas würde ich eigentlich auch gern können, aber wer macht denn da die Arbeit? Ist es die taste Duo oder die Person selbst? Deswegen habe ich mich auch immer so haben wir das auch beantwortet. Aber zurück zu den Tastatur Zauberern in Person. Wie bekommen wir eigentlich hin, ohne Maus so produktiv zu sein? Das erklärt uns Philipp vom Klick Klack Hack Podcast in der heutigen Episode. Viel Spaß.",
            "start": 7560,
            "end": 47152,
            "confidence": 0.9214351,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Hello, der Philipp hier vom Klick Klack Hack. Andi und Wolfi haben mich gefragt, ob ich nicht ein Türchen im Engineering Kiosk Adventskalender beisteuern möchte. Und da kann ich natürlich nicht nein sagen. In der regulären Episode 147 durfte ich euch ja schon die Tür in das Wunderland der mechanischen Keyboards eröffnen. Und ich habe mir gedacht, ich eskaliere noch ein bisschen weiter und erzähle euch mal, warum ihr eigentlich keine Maus mehr braucht und eurem Keyboard mehr zutrauen solltet, als ihr es aktuell wahrscheinlich tut. Bei der Bedienung des Betriebssystems wird so 90 % der Fälle wahrscheinlich eine Kombination aus Tastatur und Maus benutzt, um bunte Fenster hin und her zu schieben. Nagelt mich aber bitte nicht auf die Zahl fest, es ist hier nur grobe Mutmaßung. Auch mutmaßen würde ich dass die Hörer innenschaft hier recht häufig vor Computern sitzt und damit arbeitet. Und ich spiele jetzt mal den unliebsamen Arzt, der euch sagt, dass ihr die Ergonomie nicht aus den Augen lassen solltet. Keine Sorge, das wird jetzt hier nicht zur Werbesendung für Stehschreibtische und ergonomische Stühle. Mir geht es hier diesmal eher um das, was auf dem Schreibtisch steht und das in Verbindung mit dem, was auf dem Bildschirm flackert. Zweitausendein, euer Betriebssystem bietet im Normalfall eine Tiling Option. Und wenn ihr unter Linux unterwegs seid, könnt ihr euch sogar einen Windows Manager aussuchen, der sich komplett dem Tiling verschrieben hat. Die Liste ist groß und Menschen, mit denen ich schon über Tiling Windows Manager geredet habe, wissen, dass ich jetzt als allererstes Ex Monat aufzähle. Ex Monat ist wunderbar, aber natürlich auch durch eine Basis auf Haskell. Nicht jeder Mensch Geschmack, aber die Liste ist riesig. I free awesome, Herbstluff und wie sie alle heißen. Hier zweitausendein gibt es wie zu allem auch eine wunderbare awesome List. Andi und Wolfi werden euch das in den Shownotes mit Sicherheit verlinken. Das sind Window Manager, die zum einen euren Platz auf dem Desktop optimal ausnutzen durch automatisierte Anordnung eurer Fenster, aber sie sind auch komplett über die Tastatur steuerbar. Und hier kommen wir zum zweiten Faktor, eure Tastatur und Mauskombination. Ein großer, in anführungszeichen Kraftakt ist der Wechsel zwischen Tastatur und Maus. Da wir keine Schmerzen in den Händen haben wollen und natürlich auf unsere Gesundheit achten wollen, ignorieren wir aber heute unsere Maus und verbannen sie vom Schreibtisch. Ja, wirklich. Als ich über mechanische Tastaturen im Engineering Kiosk schwadronieren durfte, hatte ich auch erwähnt, dass es Custom Firmwares für Tastaturen gibt. Hier ist es erstmal völlig egal, ob ihr direkt auf eine split Tastatur springt oder bei einer Full Size 104 Keys Tastatur bleibt. Es muss nur programmierbar sein. Hier gibt es ebenfalls ein relativ breites Angebot an Firmwares. QMK, ZMK, FAK, Divial und so weiter weiter und so fort. Die Unterschiede hier sind erst im Detail sichtbar. Manche können Bluetooth super, andere wiederum nicht. Die Firmware ist ja ausschlaggebend, weil sie uns Funktionen ermöglicht, die sonst nur über umständliche Hacks möglich sind. Die Tastaturen, die ich das letzte Mal erwähnt hatte, arbeiten aufgrund ihrer geringen Größe mit Layern, also mit verschiedenen Funktionsebenen der Keys. Und einige meiner Keyboards haben ein Navigationslayer. In diesem Layer sind Keys so konfiguriert, dass sie zum einen als Cursor Keys fungieren, aber auch als Mausersatz. Und das funktioniert überraschend gut. So kann man sich für Funktionen, die nicht über Default Keys bedient werden können, trotzdem schon eine mausähnliche Cursor Steuerung einbauen. Herrlich. Das ganze könnt ihr natürlich noch weiter treiben, indem ihr euch eine split Tastatur hinstellt, Tasten reduziert, Sculpted Keyboards nutzt, euch split Hälften an die Bürostuhlarmlehnen baut und so weiter. Ich kenne Menschen, die haben sich ihr Setup so optimiert, dass sie im Bett liegen können und trotzdem produktiv arbeiten können. Okay, ist vielleicht nicht unbedingt nötig, aber lustig ist es allemal. So, meine 5 Minuten sind bestimmt schon überschritten und ich hoffe, ich habe euch ein paar nette Projekte für die Vorweihnachtszeit ins Hirn gepflanzt. Viel Spaß dabei, euer Ergo Dr. Keyboard Nerd Philipp. Macht's gut.",
            "start": 47336,
            "end": 285924,
            "confidence": 0.9132289,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Danke dir, Philipp für diese Keyboard Eskalation. Wenn ihr tiefer in den Hasenbau zum Thema Tastaturen absteigen wollt, schaut doch mal beim Klick Klack Hack Podcast vorbei. Aber Achtung, es wird schwer, da wieder aus dem Hasenbau rauszukommen. Wer einen sanfteren Einstieg haben möchte, kann sich gern unsere Episode 147 mit Philipp reinziehen. Da erklärt er eine gute h eigentlich alles, was man zum Thema mechanische Tastaturen wissen muss. Und kleiner mechanische Tastaturen müssen nicht immer laut sein. Aber schreibt uns doch mal auf Social Media oder in unserer Discord Community, wie eure Tastaturen bzw. Maus Setup aussehen. Sehr gerne mit Bildern, wir sind da wirklich neugierig. Und für mich als i user, welchen Windows Manager ihr verwendet, auch natürlich ganz wichtig. Ansonsten vielen Dank fürs Zuhören. Bis morgen. Ciao.",
            "start": 286052,
            "end": 330810,
            "confidence": 0.9001963,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.9122978,
    "audio_duration": 337,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}