{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/2882ee29-d6fd-4f9e-8f6e-b25b0540d3f7/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "multichannel": null,
    "audio_channels": null,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_audio_quality": null,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 4,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "language_confidence_threshold": null,
    "language_confidence": null,
    "speech_threshold": null,
    "speech_model": null,
    "id": "1c666a40-88cd-47b4-b68a-47f4d625e445",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zum 23. Türchen vom Engineering Kiosk Adventskalender. Los geht es mit einem kleinen Witz zum Thema Kryptographie. An alle Windows Admins, sorry, aber der war wirklich nicht schlecht, oder? Also ich fand ihn grandios. Ich kann mich noch an meine erste Vim Nutzung zurückerinnern. Das war wirklich ein Zufallsdring, der beim Schließen entstanden ist. Nun gut, zurück zum Thema der Episode. Dieses Türchen wird euch vom Team vom workinggraph Podcast präsentiert. Ein Podcast, der seit 14 Jahren produziert wird. Höchster Respekt von unserer Seite. Deswegen übergebe ich das Mikrofon direkt an Shep und das Team. Los geht's.",
            "start": 4640,
            "end": 48454,
            "confidence": 0.9021342,
            "speaker": "A",
            "channel": null
        },
        {
            "text": "Liebe Hörer innen, wir sind der Working Graph Podcast und erscheinen jeden Dienstag mit einer neuen Folge zum Thema Frontend Development Zweitausendein. Vielen Dank von uns an Andi und Wolfi für die Idee des Engineering Kiosk Adventskalenders und dass wir dabei sein dürfen. Aus unserem Team sind dabei die Vanessa.",
            "start": 48582,
            "end": 65476,
            "confidence": 0.880434,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hallo.",
            "start": 65628,
            "end": 66196,
            "confidence": 0.92413,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Der Hans.",
            "start": 66308,
            "end": 67132,
            "confidence": 0.966065,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Hi.",
            "start": 67276,
            "end": 67960,
            "confidence": 0.57429,
            "speaker": "D",
            "channel": null
        },
        {
            "text": "Und ich bin der Schepp. Und wir wollen euch heute in aller Kürze einen Weg aufzeigen, wie ihr Frontend Engineering Metriken in eurem Team einführen könnt.",
            "start": 68380,
            "end": 76108,
            "confidence": 0.93743116,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Ja, frontend engineering Metriken. Man hört ja so viel, nicht nur aktuell, schon seit langer Zeit von datengetriebenen Arbeiten und wir müssen das tracken und wir müssen jenes tracken und wir müssen diese Daten auswerten. Ich denke dabei z.B. als erstes an A b testing Graphen bei Analytics Tools zu untersuchen und den damit verbundenen Entscheidungen in der Produktentwicklung. Aber diese wird dann eben meistens geführt von den Produktteams und das Engineering Team führt dann diese Produktideen aus. Daher meine Frage, was sind denn überhaupt Engineering Metriken und wie spielen diese hinein in diese Produktentscheidungen?",
            "start": 76244,
            "end": 114700,
            "confidence": 0.91580653,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Zweitausendein ja, also es gibt ja eigentlich in jedem Bereich Metriken. Generell kann man sagen, dienen dir immer der Verbesserung von Prozessen oder Produkten. Im Engineering Bereich misst man technischen Erfolg und Misserfolg, deckt vielleicht Probleme auf, die man anderweitig nicht sofort bemerken würde. Und generell kann man mit Hilfe von Metriken auch so ein bisschen technische Exzellenz versuchen anzustreben.",
            "start": 114780,
            "end": 140874,
            "confidence": 0.91475,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Genau, wenn wir da sind, ist es natürlich erstmal wichtig, die Frage zu stellen, wie findet man eigentlich die richtigen Metriken? Und was ganz wichtig ist, die Metriken, die man sich sucht, sollten auf jeden Fall dem Zweck des Produkts dienen. Beispielsweise ich arbeite jetzt an einer Video Streaming Plattform und da ist es natürlich wichtig, dass wir wenig Fehler beim Abspielen von Videos haben und dass es möglichst schnell losgeht, wenn man den Play Button klickt. Das sind für uns also die wichtigsten Engineering Metriken zweitausendein und aus Produktsicht tracken wir dann natürlich, wie viele Videos werden eigentlich geschaut und so weiter und so fort.",
            "start": 141042,
            "end": 173984,
            "confidence": 0.92109454,
            "speaker": "D",
            "channel": null
        },
        {
            "text": "Genau. Und dann gibt es noch spezifisch im Frontend Bereich weitere Metriken, die man beachten sollte bzw. Kann. Da hat man zum einen die von Google eingeführten Core Web Vitals, die meistens irgendeinen Performance Bezug haben. Dann kann man Accessibility Testing Reports generieren und dann gibt es auch die Möglichkeit, Tools wie Sentry auch im Frontend einzusetzen und ein Error Monitoring zu betreiben.",
            "start": 174112,
            "end": 200554,
            "confidence": 0.8957827,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Und wenn man das dann alles macht, sollte man auf jeden Fall darauf achten, dass man nicht die falschen Sachen misst. Beispielsweise gibt es halt Fehler in einer Applikation, die im Hintergrund auftreten und die die Benutzer nicht mitbekommen. Die sollten natürlich nicht den gleichen Stellenwert haben wie Errors, die direkten Einfluss auf die Nutzbarkeit der Applikationen haben. Zweitausendein und dann sprechen wir drüber, wie kann man das Ganze eigentlich wirklich im Team implementieren. Wenn man Metriken festgelegt hat, dann ist es wichtig, diese auch transparent zu kommunizieren. Zum einen, damit halt ihr im Team Bescheid wisst und jeder und jede auch weiß, welche Metriken sind die, die wir uns anschauen und die wir verbessern wollen. Und außerhalb des Teams ist es dann wichtig, beispielsweise zum Management zu kommunizieren oder anderen Teams [SOS/eOS], um halt auch Teamerfolge und Problemfelder sichtbar zu machen und darüber klar sprechen zu können. Dafür ist auch eine Zielsetzung notwendig. Also fragt euch, welche Metriken wollt ihr eigentlich verbessern und vor allem in welchem Zeitraum. Also setzt vielleicht langfristige und kurzfristige Ziele und vor allem müsst ihr eure Metriken jederzeit überprüfen oder zumindest regelmäßig überprüfen, um sicherzustellen, dass ihr keine sinnlosen oder längst überholte Ziele messt.",
            "start": 200682,
            "end": 276770,
            "confidence": 0.9213506,
            "speaker": "D",
            "channel": null
        },
        {
            "text": "Zusammenfassend überlegt euch, was ihr messen wollt, sprecht darüber in eurem Team und setzt euch Ziele dafür. Überprüft auch zu schauen, ob ihr das richtige messt und ob die Daten auch tatsächlich richtig ankommen. Und einer der wichtigsten Punkte vermutlich auch vergesst nicht, eure Erfolge zu feiern und klar zu benennen, wenn etwas nicht so gut läuft. Das wird euch Vertrauen bringen, falls ihr in eurem Team noch keinen konkreten Plan habt, wie ihr erfolgreich Metriken einführt. Hoffen wir, dass unsere Punkte euch weiterhelfen konnten. Wenn euch diese Kurzfolge gefallen hat, hört beim working draft podcast rein, da werden wir das Thema zeitnah noch mal vertiefen.",
            "start": 277150,
            "end": 316490,
            "confidence": 0.92808473,
            "speaker": "C",
            "channel": null
        },
        {
            "text": "Und damit sind wir auch schon durch mit unserer Kurzfolge. Vielen dank euch fürs reinhören. Und jetzt weiterhin viel Spaß beim Engineering Kiosk.",
            "start": 316650,
            "end": 325106,
            "confidence": 0.9135878,
            "speaker": "B",
            "channel": null
        },
        {
            "text": "Danke an das Working Graph Team für diese Episode. Mehr von der ganzen Truppe gibt es jede Woche im Working Graph Podcast. Den Link zum Podcast findest du natürlich in unseren Shownotes. Welche Metriken beobachtet bzw. Sammelt ihr von euch bzw. Von euren Teams oder euren Apps? Lasst es uns doch mal wissen. Ihr erreicht uns über alle möglichen Social Media Kanäle, via E Mail oder auch in unserer Discord Community. Über die kommenden Weihnachtsfeiertage werde ich wohl die Anzahl gegessener Klöße oder wie oft boah, bin ich voll gegessen gesagt wurde, tracken. Schauen wir mal, welche Zahlen da am Ende rauskommen. Das war's von unserer Seite. Genießt die Feiertage. Wir hören uns in der nächsten Episode. Bis bald und tschüss.",
            "start": 325218,
            "end": 365870,
            "confidence": 0.9074119,
            "speaker": "A",
            "channel": null
        }
    ],
    "confidence": 0.91349584,
    "audio_duration": 373,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}