{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/ZyPg2MjZSzpJqLW/download/ep176_3_jahre.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "multichannel": null,
  "audio_channels": null,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "4ccbc545-c1be-4c6d-8c9d-7ad49b3bf03b",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Als wir Anfang 2022 die erste Folge vom Engineering kiosk Podcast released haben, hätte ich mir auf jeden Fall nicht vorstellen können, dass ich jetzt hier drei Jahre weiter bin, Ende 2024 und den Quatsch immer noch mache. Denn ich bin sehr, sehr schnell von Sachen gelangweilt. Wenn ich weiß, wie die funktionieren, bin ich da relativ schnell gelangweilt. Und man muss zugeben, ich habe mir Podcasting aus der technischen Perspektive deutlich spannender vorgestellt, als es in der Realität ist. Es ist mal wieder relativ langweilig, wie so ein Podcast irgendwie erstellt wird und verteilt wird. Aber ich möchte Happy Birthday, Wolfgang. Happy Birthday zum Engineering Kiosk. Und theoretisch sollten wir jetzt eigentlich singen oder so einen AI generierten Happy Birthday Song irgendwie einspielen. Hättest du gedacht, dass wir jetzt drei Jahre weiter sind und die ganze Sache immer noch machen?",
      "start": 6320,
      "end": 61128,
      "confidence": 0.9132848,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich war eigentlich schon ziemlich froh, wie wir ein Jahr geschafft haben. Also drei Jahre ist schon was ganz was anderes. Also ja, fühlt sich gar nicht so lang an eigentlich. Aber du müsstest ja eigentlich wissen, du hast ja auch ganz viele Podcast und hörst auch so Influencer, die immer darüber sprechen, dass es ein hartes Business ist eigentlich und dass man da sehr viel Zeit investieren muss und das Produzieren dauert halt einfach und und braucht Zeit. Und beim Podcasten ist es halt genauso.",
      "start": 61264,
      "end": 84500,
      "confidence": 0.90774256,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist ja nicht mein erstes Projekt, was ich über drei Jahre lang mache oder beziehungsweise drei Jahre lang mache, doch es zeigt mir.",
      "start": 84600,
      "end": 90948,
      "confidence": 0.9231617,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Moment, was für Projekt machst du denn schon drei Jahre lang intensiv?",
      "start": 91004,
      "end": 93820,
      "confidence": 0.96921915,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Naja, ich habe etliche Seitenprojekte, die deutlich länger als drei Jahre laufen, die vielleicht noch nie wirklich released wurden sind. Aber das Meetup habe ich ja 11, das Meetup habe ich ja 11 Jahre lang gemacht und dieses Projekt zeigt mir auch wieder, dass es halt kein Sprint ist, sondern Marathon. Aber und jetzt habe ich mir natürlich die Frage gestellt, okay, wir werden jetzt drei. Wir wir beide und der Engineering Kiosk Podcast. Was sollte man denn so mit drei alles können, habe ich mich gefragt. Ich habe keine Kinder, deswegen habe ich einfach mal gegoogelt, was ein altersgerecht entwickeltes Kind mit drei Jahren so alles können sollte. Und siehe da, relativ viel kann man aufs Podcasting anwenden. Das Kind bildet z.b. einfache Sätze.",
      "start": 93900,
      "end": 130560,
      "confidence": 0.93639976,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das wirst du mir seit drei Jahren vor. Ich soll meine Sätze einfacher bilden. Stimmt.",
      "start": 130640,
      "end": 135568,
      "confidence": 0.93487865,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Es hat ein Verständnis von Fragen und deren Beantwortung würde ich sagen, ist auch relativ vorteilhaft fürs Podcasting.",
      "start": 135664,
      "end": 141496,
      "confidence": 0.90879333,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Durchaus.",
      "start": 141648,
      "end": 142356,
      "confidence": 0.60238,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Es erzählt einfache Geschichten. Würde ich auch sagen. Okay, cool. Und jetzt kommen wir zu den sozial emotionalen Fähigkeiten. Das Kind beginnt sich selbstständig anzuziehen. Fände ich auch ganz cool, wenn du jetzt nicht nackt hier im Videocall wärst. Das Kind kann Emotionen ausdrücken wie Freude, Ärger, Trauer und Angst. Gut, wir haben jetzt nicht so viele emotionale Stories.",
      "start": 142488,
      "end": 162596,
      "confidence": 0.91125476,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Hey, liest du unsere Slack Messages?",
      "start": 162668,
      "end": 164628,
      "confidence": 0.9299217,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber mit der Kombination aus Kind erzählt einfache Geschichten, vielleicht fangen wir jetzt im vierten Jahr dann langsam mal mit Storytelling an. Auch schön, es beginnt Freundschaften aufzubauen und es spielt zunehmend mit anderen Kindern gemeinsame Spiele. Das könnte man so ein bisschen auf die Podcast Community übertragen, denke ich, die wir jetzt unter anderem mit dem Adventskalender ja auch wieder ein bisschen getriggert haben. Und auch, es entwickelt die Fähigkeit zur Kooperation und Konfliktlösung. Und da hoffe ich jetzt, dass wir das natürlich auch beibehalten.",
      "start": 164804,
      "end": 194032,
      "confidence": 0.9036177,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Soziales Lernen ist da ja auch ein Thema, oder? In dem Alter dann, dass man von den anderen lernt. Es fühlt sich so unter den Podcastern auch so an und den Podcasterinnen. Keiner hat eigentlich eine. Alle sind irgendwie ins Wasser gesprungen. Jeder probiert irgendwie zu lernen und fragt zu den anderen, wie macht ihr das? Hast du es auch schon so erlebt? Und so weiter. Also es ist eigentlich für alle ein sehr neues Medium, muss man schon sagen.",
      "start": 194176,
      "end": 215148,
      "confidence": 0.917007,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und nachdem ich dann diese ganzen Punkte, diese sprachlichen Fähigkeiten und diese sozial emotionalen Fähigkeiten eines dreijährigen Kindes gesehen habe, habe ich mir gedacht, ist das hier gerade Confirmation Bias? Suche ich gerade etwas, was ich nehmen kann und für einen dreijährigen Podcast anwenden kann? Deswegen habe ich die ganze Sache mal ein bisschen umgedreht und habe mir angesehen, was ein Entwicklungsmeilenstein eines Hundes mit drei Jahren ist. Da sieht es alles ein bisschen anders aus. Und da fand ich einen Satz sehr, sehr schön, oder zwei Sätze fand ich sehr schön. Manche große Spätentwickler erreichen erst mit drei oder vier Jahren die erwachsene Reife. Aha, wir sind also jetzt schon erwachsen. Und jetzt kommt's. Bei vielen Hunden nimmt in dieser Phase das Interesse an anderen Hunden und auch das Spielverhalten merklich ab. Ja, so, was heißt das? Wir verlieren Lust am Podcasting oder wir verlieren Lust, Leute einzuladen oder was mit anderen Podcastern zu machen. Ich weiß, jetzt ist natürlich die Frage, was sind wir eher? Ein dreijähriges Kind oder ein dreijähriger Hund?",
      "start": 275244,
      "end": 329748,
      "confidence": 0.9105305,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, noch sind wir nicht ausgewachsen. Es steht ja drei bis vier Jahre bei dem Hund. Vielleicht kommt das jetzt im neuen Jahr.",
      "start": 329844,
      "end": 335196,
      "confidence": 0.96451914,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da haben wir dann erstmal natürlich jetzt den Confirmation Bias zerstört. Aber in dieser Episode geht es mal so ein bisschen um unseren dreijährigen Geburtstag, aber natürlich auch um den Jahresrückblick 2024. Wir wollen auf der einen Seite mal ein bisschen darüber erzählen, über dieses Projekt, den Engineering Podcast, aber auch das Engineering Kiosk Meetup, was der Wolfgang ja in Österreich betreibt. Wir sprechen so ein bisschen über die Episoden und was diese so bewegt haben. Der Wolfgang als alter Zahlenmensch hat glaube ich auch ein paar Zahlen zum Podcast Projekt selbst rausgesucht. Wir sprechen über Highlights, Low Lights und Neutrallights. Das sind die Sachen, die neutral sind. Neue Wort Kreierung.",
      "start": 335308,
      "end": 374548,
      "confidence": 0.909406,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wir haben auch noch was nachzuholen.",
      "start": 374604,
      "end": 376212,
      "confidence": 0.9054667,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Was nachzuholen haben wir auch und zwar in Episode 100 gab es nämlich einen Tech Rückblick auf das Jahr 22 und 23 und Tech Predictions auf das Jahr 2024. Wir sind jetzt endlich Ende des Jahres 2024. Und da ging es natürlich um einen Wetteinsatz und dann schauen wir mal, wer sich diesen Wetteinsatz holt.",
      "start": 376316,
      "end": 396160,
      "confidence": 0.8958031,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das war vor 76 Episoden haben wir seitdem aufgenommen.",
      "start": 396280,
      "end": 400520,
      "confidence": 0.96832776,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da bist du schon sofort in den Zahlen. Aber lass uns mal mit den emotionalen Punkten anfangen. Du als dreijähriger Wolfgang, du beginnst dich selbstständig anzuziehen und du kannst jetzt auch damit beginnen, einfache Geschichten zu erzählen. Also welche Geschichte fandest du am besten und hast du zugetragen bekommen auf Basis von jemandem, der eine Episode von uns gehört hat?",
      "start": 400680,
      "end": 422884,
      "confidence": 0.9259785,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Man hat natürlich ganz viele Geschichten eigentlich so über die Zeit und Episoden, aber die intensivste Episode war gerade kürzlich und das war eine Advent Episode und zwar die Episode 170, wo es um den 404 Statuscode gegangen ist. Und da habe ich initial eine Geschichte erzählt, dass wir eine Buslinie in Tirol haben, die 404 heißt. Und wir hatten am nächsten Tag nach dem Release von dieser Episode Meetup in Innsbruck. Und jetzt haben mich unzählige Leute auf dieser Episode angesprochen und haben mir erklärt, wohin dieser Bus fährt. Den kennen wirklich alle. Also es ist unglaublich, dieses 404 ist so in den Köpfen drin. Es haben sich so viele Leute sofort wiedergefunden und haben mir erklärt, wohin dieser Bus eigentlich fährt und dass sie ihn auch teilweise noch nie gesehen haben und so weiter. Aber sie kennen das auch vom Busschild.",
      "start": 422932,
      "end": 466084,
      "confidence": 0.9011614,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich frage mich gerade, ob das so eine Art Bermuda Dreieck bei euch in Österreich ist. Wenn du da einsteigst, weiß man nicht.",
      "start": 466182,
      "end": 471432,
      "confidence": 0.9723326,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wo man rauskommt oder man kommt nie mehr raus aus dem Bus. Gibt es bei dir irgendwelche intensivsten Episoden, Geschichten, die dir im Kopf geblieben sind?",
      "start": 471456,
      "end": 479800,
      "confidence": 0.9165319,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Leider habe ich den Ratschlag von mir selbst nicht befolgt und ich habe jetzt kein Brag Dokument über das Jahr vom Engineering kiosk geführt. Schade eigentlich, sollte ich mal tun. Aber wo wir gerade beim Thema Brack Document sind, was ich sehr, sehr schön fand, war in einer der letzten Podcast Episoden vom Index out of Bounds Podcast, ebenfalls in deren Jahresrückblick, da wurde positiv erwähnt, dass der Christian vom Index out of Bounds Podcast jetzt natürlich auch ein Breakdokument führt und das auch für sehr wertvoll erachtet und sagt, das kostet ja gar keine Zeit, das ist ja so wertvoll, man guckt ja immer rein und merkt man wirklich, was man geschafft hat und so. Und da habe ich mir gedacht, wow, also ich meine, ich bin ja auch nur ein Typ, der steht hier, spricht in so ein Mikrofon rein und jemand anders nimmt das ernst, wendet es an und hat eine positive Erfahrung damit. Und da muss ich zugeben, das verstehe ich nicht. Das freut mich sehr, aber ich verstehe das nicht, warum uns jemand zuhört. Aber das ist vielleicht so ein bisschen diese Art Impostor Syndrom. Aber ich habe schon von mehreren Leuten gehört, dass die diese Art Breakdockuments führen und ihre Erfolge mal aufschreiben und auch im Job, weil besonders natürlich jetzt gegen Jahresende diese ganzen Beförderungen, gehaltsgespräche stattfinden in vielen Firmen. Und da bin ich mal gespannt, ob da irgendjemand mal einen positiven Outcome von hat. Aber ich weiß von diversen Zuspielungen an Feedback, dass die Leute das auf jeden Fall probieren und das freut mich sehr.",
      "start": 479920,
      "end": 559990,
      "confidence": 0.92977744,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das ist ein gutes Stichwort, weil das, was ich am öftesten höre, was Leute eingeführt haben oder probieren, sind one on ones. Und wir predigen das ja in zahlreichen Episoden eigentlich die Geschichte. Und vielleicht ist das ist der Grund, warum ich dann so viel höre, dass das Leute einführen. Und in der Industrie ist es ja wirklich noch nicht Standard und auch in größeren Unternehmen. Ich habe gerade neulich wieder mit einem Kollegen diskutiert, der das nur einmal im Quarter macht, weil er es aus Zeitgründen nicht schafft. Ist auch verständlich in manchen Setups, was aber halt auch gerne als Ausrede verwendet wird. Und ich kenne wirklich einige Leute, die One on ones eingeführt haben, weil sie bei uns Episoden darüber gehört haben und auch sehr zufrieden sind, weil sie wirklich einen Mehrwert daraus generieren können.",
      "start": 560070,
      "end": 604468,
      "confidence": 0.9228392,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bei dieser Art von One on One würde ich gerne mal Mäuschen spielen, weil ich weiß selbst, wie meine ersten One on Ones waren. Und inzwischen würde ich sagen, schrecklich. Also ich würde da, glaube ich, auch grinsend neben sitzen. Aber es ist ja wie mit allem, man fängt mit etwas an, weiß, was funktioniert, merkt, was nicht. Funktioniert und lernt darüber, wie z.B. ich würde jetzt, wie z.B. ich habe die Tage mal in einer unserer ersten Podcast Episoden reingehört. Ich schäme mich in Grund und Boden, wenn man da mal reinhört, wie wir damals sprechen, zweitausendein, wie wir uns ausdrücken, Audioqualität und so weiter und so fort. Aber es ist ein ganz normaler Lernprozess. Deswegen, ich würde da schon gerne mal immer in diese One on ones mal Mäuschen spielen und auch mal von anderen lernen, weil ich weiß ja auch nicht, ob die One on ones, die ich so führe, wirklich tolle One on ones sind.",
      "start": 604524,
      "end": 645370,
      "confidence": 0.91472244,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Trotzdem werden unsere alten Episoden noch sehr stark gehört, auch wenn jetzt in die Zahlen springen, Andi, und du das ja gar nicht merkst, dass man irgendwo herumspringt in der Struktur. Aber es passt einfach so schön, weil 40 % unserer gesamten Downloads sind auf Episoden, die älter als 90 Tage sind und 10 % aller Downloads sind Episoden, die älter als 18 Monate sind. Also es gehen wirklich viele von unseren Hörerinnen scheinbar zurück im Katalog und finden da noch einen Mehrwert. Was uns natürlich auch immer super freut.",
      "start": 645410,
      "end": 675674,
      "confidence": 0.9347241,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Für alle Leute, die uns noch nicht so lange hören, wir verfolgen so eine Art Evergreen Strategie. Das bedeutet, wir versuchen relativ wenig aktuelle zeitliche Elemente in den Podcast zu heben, zweitausendein, so dass sie auch nach einer längeren Zeit immer noch gültig sind. Die meisten oder fast alle unserer Podcast Episoden sind wirklich zu einem Thema und haben Content, der auch noch nach einem Jahr gültig ist. Das komplette Gegenteil wären z.B. news Episoden, die wir bisher noch nicht gemacht haben. Und so langsam haben wir halt die Datenbasis, die der Wolfgang gerade vorgetragen hat. Und es ist natürlich schön zu sehen, dass diese Evergreen Strategie auch wirklich funktioniert. Das freut mich sehr, weil das ist halt schon, ich sag mal, ein bisschen nachhaltiger Content. Also man nimmt das jetzt nicht auf und dann hat das morgen keine Relevanz mehr, sondern man hat jetzt wirklich den Beweis, dass Zeug, was wir vor anderthalb Jahren aufgenommen haben, wirklich noch von 10 % unserer wöchentlichen oder monatlichen Downloads gehört werden. Also das freut mich riesig.",
      "start": 675722,
      "end": 730706,
      "confidence": 0.9343198,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das war übrigens ein schöner freudscher Versprecher, die Downloads, die uns hören. 10 % unserer Downloads hören uns noch. Sehr schön. Da stecken schon noch Menschen dahinter, Andi.",
      "start": 730778,
      "end": 740626,
      "confidence": 0.87484926,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ab und zu hat man so Spikes in den Metriken, da denkt man sich so, das waren auch jetzt irgendwie sieben Bots oder so. Also ich bin mir nicht sicher, ob alle unsere Downloads Menschen sind. Schauen wir mal. Hoffe ich natürlich, aber man weiß es ja nicht. Und das ist auch das Negative am Podcasting, muss man zugeben, wir haben leider keine Informationen, wo ihr uns hört. Am Anfang haben wir immer noch Fotos auf Twitter bekommen, wie jemand im Wald spazieren gegangen ist. Grüße an Sebastian, gehen raus. Aber ich würde natürlich gerne mal wissen, hört ihr uns auf dem Weg zur Arbeit, hört uns im Auto, im Flugzeug oder, oder, oder mit dem Hund spazieren oder während ihr die Küche sauber macht? Also das würde mich mal wirklich interessieren. Aber leider, wenn man Metriken aus dem Web gewohnt ist, wo man mit Google Analytics wirklich alles analysieren kann, dann sieht es im Podcasting Sektor sehr, sehr mau aus.",
      "start": 740818,
      "end": 786982,
      "confidence": 0.91068405,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also wenn jemand von euch wöchentlich einmal fliegt und da unsere Episode hört, dann schickt uns, dass ihr das im Flugzeug hat. Ja, also so wieder an die da. Es kommt natürlich also Bahn oder so oder Auto, aber Flugzeug natürlich.",
      "start": 787166,
      "end": 800188,
      "confidence": 0.8912329,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Im Podcasting Sektor gibt es eine Theorie, und zwar hat mal irgendjemand gesagt, die optimale Länge einer Episode ist genau die Länge eines Inlandsfluges, was dann 45 bis 60 Minuten sein soll. Ich weiß aber nie, ob das jemals bewiesen wurde oder irgendwie statistisch belegt, aber kann man ja jetzt auch gar nicht, weil man ja gar nicht weiß, wo man gehört wird.",
      "start": 800334,
      "end": 820320,
      "confidence": 0.9077189,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich habe das auch noch nie gehört. Also das höre ich immer nur von dir, diese Geschichte.",
      "start": 820360,
      "end": 824056,
      "confidence": 0.8051205,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Apropos statistisch belegt, zweitausendein. Wir hatten dieses Jahr eine Episode zum Thema return to Office. Und dieses Thema ist natürlich immer sehr, sehr subjektiv. Ja, das verbessert das Team, Zusammenhalt und man ist produktiver und so weiter und so fort. Was mich an dieser Episode sehr, sehr gefreut hat, dass wir uns 100 % objektiv auf dieses Thema gestürzt haben, mit etlichen Statistiken. Und immer wieder auf Social Media wird diese Episode von anderen Leuten unter irgendwelche LinkedIn Posts gemacht, wo jemand sagt, return to Office ist key und so weiter und so fort. Und da wird immer richtig gechellt. Und ich weiß auch, dass diese Episode in manchen Firmen als Management geschickt wurde, weil das Management return to Office irgendwie favorisieren wollte. Unter anderem mit der Begründung, weil das alle machen. Leider weiß ich nie, was aus diesen Challenges geworden ist, ob dann das Management zurückgerudert ist oder ähnliches. Aber da fand ich es mal wirklich, wirklich schön, denn return to Office betrifft irgendwie uns alle, aber jeder hat dann eine Meinung zu, aber kaum jemand hatte wirklich mal eine gute Datenbasis. Und die return to Office Folge, das war für mich so ein Highlight und ich freue mich immer wieder, wenn ich den Link unter irgendeinem LinkedIn Post sehe. Bringt mich immer zum Grinsen.",
      "start": 824208,
      "end": 897106,
      "confidence": 0.9250342,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ist die Episode 142 übrigens, falls sie jemand noch nicht gehört hat. Eine andere Episode, die ich ein bisschen unterschätzt habe in gewisser Weise, war die Episode zu Tandems. Also wenn man gemeinsam eine Position z.b. Übernimmt, irgendeine Leadership Position oder Jobsharing macht, haben wir mit der Anna in Episode 108 und Dreiig besprochen und ihr habt das eigentlich ein sehr interessantes Modell gefunden. Da haben wir gedacht, das ist cool, es kommt immer mehr. Hört man jetzt so langsam, dass das so ein Thema wird. Und dann habe ich mit einigen von meinen Freunden gesprochen und habe bemerkt, dass es das schon überall gibt und in Branchen, wo ich mir das nie vorstellen hätte können. Also in der Pflege z.B. in Krankenhäusern, in der Kunst, Theater, wo es Doppelspitzen gibt und die wirklich so einen Tandem machen in der Leitung. Und da habe ich erst gemerkt, dass es in der IT Bereiche gibt, wo wir gar nicht Vorreiter sind. Weil sonst hört man ja ganz oft, die IT sind Vorreiter, wenn es z.B. um das ganze agile Management geht, Retrospektiven, andere Branchen beneiden uns da immer. Und bei Tandems scheint es aber so, dass das nicht der Fall ist. Vielleicht hat es auch was damit zu tun, dass es doch einen sehr hohen Männeranteil gibt. Und da haben Andi und ich ja auch kürzlich in einer Mini Episode über BDFLs gestritten, ob es immer eine Führungspersönlichkeit sein muss oder ob es auch mehrere sein können bei Open Source. Also scheinbar, ich glaube, dass die IT da doch noch ein bisschen hinten ist im Gegensatz zu anderen Branchen.",
      "start": 897178,
      "end": 985800,
      "confidence": 0.9140712,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bei der Pflege verstehe ich das vielleicht noch, weil es da ja oft Schichtbetrieb gibt. Aber warum denn bei Theater? Haben die da auch Schichtbetrieb?",
      "start": 985880,
      "end": 993306,
      "confidence": 0.9692764,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das hat überhaupt nichts mit Schichtbetrieb zu tun. Das ist einfach die Leadership Positions, die teilen sich das ganz klassisch Tandem, wie wir es besprochen haben. Da geht es gar nicht um Schichten oder sonst was. Ich sag also, wir sind da nicht sehr fortgeschritten.",
      "start": 993418,
      "end": 1005698,
      "confidence": 0.9233429,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nun gut, eine Episode, wo ich ziemlich viel Feedback bekommen habe, waren diese Art von Rabbit Holes, also Themen, wo man sich wirklich reinnerden kann und sich wirklich vergessen kann. Und in diesem Jahr hatten wir davon ein paar Themen. Z.B. ich hatte super viel Spaß, mich ihnen Zeitberechnung einzuarbeiten in die Schaltsekunde. Wir hatten eine Episode zur Zeit Synchronisation mit NTP und dem PTP Protokoll. Und eins meiner Highlights, die auch wirklich sehr viel für Engagement bei euch allen gesorgt hat, war die Episode zu Doom. Direkt nach der Aufnahme oder nach der Veröffentlichung habe ich gedacht, geil, eigentlich müssen wir mal eine Episode machen, zu Rollercoaster Tycoon oder irgendwie sowas. Weil ich habe so das Gefühl, man hat so ein bisschen was bei euch geweckt. Ihr hattet wieder alle Bock, die Leute, die damals wirklich Doom gespielt haben, oh geil, da holt mich jemand zurück. Und danach hab ich auch nochmal eine Runde Doom gespielt, hab mir eins der modernen Forks runtergeholt von GitHub, Hubs installiert und es war super spaßig. Also ich hatte eine schöne Zeit und ich hatte auch das Gefühl, auf Basis eures Feedbacks, ihr hattet auch eine schöne Zeit mit der Doom Episode.",
      "start": 1005874,
      "end": 1070938,
      "confidence": 0.91771096,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und es ist vor allem interessant, wie viel Technik dann auch so drinnen steckt. Also gerade bei Doom haben wir dann zweitausendein einiges an Algorithmen auch besprochen. Und vor allem bei der Zeitepisode, da hat sich da Andi richtig reingenerdet. Und das ist ja wirklich ein ziemlich komplexes Thema. Hast du es langsam verstanden, Andi, jetzt mittlerweile?",
      "start": 1070994,
      "end": 1087200,
      "confidence": 0.8964961,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Immer wenn ich denke, ich verstehe es, dann kommt der nächste Zeit Bug und den habe ich dann wieder nicht verstanden. Wie z.B. in unserer letzten Episode wann wurde die Sommerzeit in Australien eingeführt? 1971. Ja, nicht 1970 mit der Unix Epoche, aber Brisbane hat seit 1992 gar keine Sommerzeitumstellung mehr. Also immer wieder solche kleinen nasty Dinger kommen dann und dann denke ich mir okay, ich habe noch nicht alles durchdacht.",
      "start": 1087320,
      "end": 1114514,
      "confidence": 0.9009229,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es ist ja auch teilweise, während man so eine Episode aufnimmt, gar nicht so einfach, weil man kommt da ja auch bei der Aufnahme teilweise auf einen Bug drauf, wie z.b. bei der Episode 107 und dreiig eben über diese genannte Schaltsekunde. Und man kann sich das gerne mal anhören und Andi, wenn du jetzt in den Temp folder gehst, da liegt ein Pfeil, das heißt andi MP. Kannst du dir das gerne mal anhören?",
      "start": 1114602,
      "end": 1135800,
      "confidence": 0.89995307,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ja, aber warte mal, klar. Also pass auf, wir sagen, wir fügen ja 1 s hinzu. Ja. Und dann hast du plötzlich so warte mal, time now.",
      "start": 1137060,
      "end": 1146484,
      "confidence": 0.90448284,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, weil die Zeit plötzlich größer ist. Die vergangene Zeit ist größer.",
      "start": 1146612,
      "end": 1152028,
      "confidence": 0.92487586,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wie kann die vergangene Zeit größer sein?",
      "start": 1152164,
      "end": 1154380,
      "confidence": 0.96345574,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das stimmt, das geht eigentlich nicht. Ja, nur bei einer Minus Schaltsekunde, aber. Na, aber das stimmt eben nicht. Bei der Minus Schalt S wird übersprungen. 60. Naja, wenn du, wenn du am Ende von der S bist, dann springst du eigentlich 1 S weiter, ist aber die 60 dazwischen und du machst dann eine Subtraktion.",
      "start": 1154460,
      "end": 1174120,
      "confidence": 0.8652432,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Weißt du was ich meine?",
      "start": 1174660,
      "end": 1175452,
      "confidence": 0.781698,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ne, das Problem ist die ER Implementierung. Wenn du die ER Implementierung nicht hast, ÿousand, dann läuft die Zeit rückwärts.",
      "start": 1175476,
      "end": 1183762,
      "confidence": 0.943281,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bei der Berechnung der Differenz zwischen zwei Zeitstempeln, die über die Schaltsekunde hinweg erfolgen, kann die Differenz negativ werden, wenn nicht korrekt mit der zusätzlichen S umgegangen wird. Z.B. wenn ein Zeitstempel unmittelbar vor und einer unmittelbar nach der Zeitschaltsekunde liegt, könnte ein einfacher Differenzierungsarmut sich nicht berücksichtigen. Eben.",
      "start": 1183906,
      "end": 1202858,
      "confidence": 0.90579283,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also mit dem 60 stimmt es, würde das stimmen, aber die meisten Implementierungen zählen ja nicht auf 60. Zweitausendein, sondern die ziehen dann wahrscheinlich 1 s ab.",
      "start": 1202954,
      "end": 1211528,
      "confidence": 0.9018774,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ist richtig.",
      "start": 1211584,
      "end": 1212560,
      "confidence": 0.9282233,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also die zählen eins und dann springt es eigentlich auf zwei, dann zählen sie wieder ab, dann ist wieder eins. Und wenn dann die Millisekunden falsch sind, dann hast du eine Minuszeit.",
      "start": 1212680,
      "end": 1222200,
      "confidence": 0.9416831,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, mit Berücksichtigung schalt. Hier ist es. Wo bist du?",
      "start": 1222240,
      "end": 1225992,
      "confidence": 0.761315,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ah, okay. In dem Fall ist es sogar mit 60. Ja, okay. Ja, genau. Ja, ich würde das gar nicht so genau erklären, weil es ist so brain. Also erklären schon, aber jetzt nicht wirklich einfach, dass die Zeit rückwärts läuft, weil du ja 1 s dazuzählst.",
      "start": 1226056,
      "end": 1242692,
      "confidence": 0.910974,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja. 2016 war was Interessantes, und zwar ist der Cloudflare DNS Server abgekachelt. Ja, da merkt man wirklich die Herausforderung des Audio Kanals, denn wären wir jetzt auf YouTube, hätten wir am besten mal was zeichnen können. Aber ja, es ist halt so. Und das ist halt diese Rabbit Hole Thematik, von der ich halt auch spreche. Du musst dich da reinnerden und auf einmal verlierst du dich da und du versuchst es wirklich zu verstehen. Zweitausendein. Und das Lustige ist ja, diese Schaltsekunde, viele Leute haben das ja gar nicht auf dem Zettel oder diese Zeitberechnung, aber irgendwie berechnen wir doch alle irgendwie täglich Zeiten. Ja, aber so geht das dann ab und zu mal, auch während der Podcast Aufnahme, dass wir uns da gar nicht einig sind, weil ihr kennt das, wenn man versucht etwas zu erklären, dann kommt wirklich erst ans Tageslicht, ob man es wirklich verstanden hat. Und ja, anscheinend hatte ich da einen.",
      "start": 1242796,
      "end": 1290618,
      "confidence": 0.8991766,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Hänger passiert, wir haben es gemeinsam gelöst, es hat schon gepasst.",
      "start": 1290634,
      "end": 1293882,
      "confidence": 0.9289845,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zweitausendein.",
      "start": 1293906,
      "end": 1294140,
      "confidence": 0.76039,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es war ja auch wirklich ein Brainfuck. Also diese Zeit ist nicht so einfach mit Minus, Plus und welche Richtung man da geht, ist ja schon bei der Zeitumstellung so schwierig, dass man nie weiß, ist jetzt 1 Stunde früher oder später und kann nicht länger schlafen oder weniger lang.",
      "start": 1294210,
      "end": 1307480,
      "confidence": 0.951347,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Meine Frau hat da einen tollen Merksatz, und zwar, wenn du auf Sommerzeit umstellst, stellst du die Gartenmöbel vor die Tür und also nach vorne. Du stellst die Zeit nach vorne und im Winter holst du die Gartenmöbel wieder rein, also gehst du zweitausendein zurück.",
      "start": 1307560,
      "end": 1323478,
      "confidence": 0.8991269,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber da muss ich mir doch immer erst ausrechnen, heißt es länger schlafen oder nicht? Das ist ja für mich das relevante eigentlich. Kann ich 1 Stunde länger schlafen oder nicht?",
      "start": 1323574,
      "end": 1330902,
      "confidence": 0.8837432,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Naja, wenn du die reinholst, kriegst du eine Zeit 1 Stunde geschenkt, weil du bist ja, du gehst ja zurück und somit hast du ja 1 Stunde mehr. Also zur Winterzeit stehst du länger.",
      "start": 1330966,
      "end": 1339558,
      "confidence": 0.8771994,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich merke schon, es ist nicht so trivial, aber es gibt natürlich auch Episoden, wo wir dann weniger vorbereiten müssen, vor allem ich weniger vorbereiten müssen. Die Folge über die Architektur von Andis Öltank war so eine Episode, weil der Andi mir da einfach Fragen gestellt hat und ich habe aus der Luft die Architektur mir ausdenken müssen, on the fly, wie in einem Interview.",
      "start": 1339614,
      "end": 1359954,
      "confidence": 0.92986244,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dabei muss ich jetzt noch mal sagen, Wolfgang und ich, wir stimmen uns schon sehr viel ab, welches Thema wir besprechen bzw. Zu welchem Thema wir eine Episode machen. Und in der Regel sind das immer so eine Art Mini Pitches. Der eine hat eine Idee und versucht den anderen zu überzeugen. Manchmal geht das relativ schnell und manchmal ist da halt echt viel Arbeit hinter. Denn wenn eine Person von uns wirklich überzeugt ist und bei dieser Episode, da war der Wolfgang jetzt auch nicht ganz so Feuer und Flamme, sagen wir es mal so nett. Am Ende frage ich ihn dann immer bei diesem Episoden, wo er nicht Feuer und Flammen ist, wie war es denn? Dann sagt er ja, ja, war besser als ich, als ich gedacht hatte. Wolfgang, wie stehst du jetzt zu der Design Diskussion zum Ölpreis Scraper? Also wir haben eine Architekturdiskussion gemacht, wie wir etwas ganz Spezielles implementieren würden. Zweitausendeinousand.",
      "start": 1360042,
      "end": 1407312,
      "confidence": 0.91127026,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, während der Episode war es ja eh lustig. Ich mache das ja gern. Das ist so ein Gedankenspiel, wie würde man was bauen? Und man baut ja gern Dinge so als Informatiker. Also das war dann eh ganz cool. Was mich wirklich überrascht hat und das meine ich jetzt nicht mal unbedingt sehr positiv, es gab sehr, sehr viele Rückmeldungen auf diese Episode. Es haben Leute diskutiert auf Discord, es haben uns Leute so kontaktiert, es haben uns Leute E Mails geschrieben mit irgendwelchen digitalen Geräten, die das Ganze noch unterstützen würden, wie man Öltank ausliest und so weiter. Also diese ganzen Dinge. Und da habe ich mir dann so gedacht, hey, da haben wir jetzt Episoden, wo wir stundenlang Recherche betreiben und verstehen diese dumme Schalt S zu verstehen und da machen wir einfach so eine Öltank Excel Sheet Auswertung und alle Leute finden es cool.",
      "start": 1407446,
      "end": 1454292,
      "confidence": 0.93133616,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Naja, es ist halt ein reales Problem. Du kriegst Anforderungen, die habe ich ja mitgebracht, Ÿousand, und wir müssen das jetzt in Software gießen, weil es löst ja ein reales Problem. Und du hast mich in der Episode ja auch so ausgelacht, ah, du heizt ja noch mit Öl, du sollst ja mal auf Wärmepumpen umstellen und allem drum und dran. Und dann kommt endlich mal Community Feedback, was ich außerdem sehr positiv finde. Und da haben wir wirklich Lösungen von Leuten bekommen. Wir haben Screenshots von Heimautomatisierung Systemen über Mastodon bekommen, dass jemand den Öltankstatus im Home Assistant oder in irgendeinem anderen Heimautomatisierungssystem anzeigt und so weiter. Verstehst du? Wir haben halt den Nagel auf den Kopf getroffen. Ja, das ist die Realität. Jetzt nicht nur in deiner, wir bauen mal hier alles neu, Legacy, Altstrukturen, so ist das halt. Das ist das reale Leben, Wolfgang. Aber ich finde es schön, dass so eine doch recht simple Applikation so viel Engagement hat. Und ich habe mich sehr gefreut über das ganze Feedback und auch sehr gefreut über die verschiedenen Lösungsansätze, denn da waren hier und da wirklich ein paar coole Lösungsansätze bei. Und zugegeben, ich habe die Software immer noch nicht gebaut, steht aber für den Januar an, dass ich die mal baue.",
      "start": 1454396,
      "end": 1520362,
      "confidence": 0.91612697,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Vielleicht sollten wir in Zukunft einfach so eine Antwort Episode machen. Leute schicken uns irgendwelche strangen Probleme und wir philosophieren dann über die Architektur.",
      "start": 1520426,
      "end": 1529450,
      "confidence": 0.9023025,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich finde es außerdem respektlos, wie du hier mit meiner Zeit und mit meiner Arbeit umgehst. Episode? Du meinst auch, ich habe das so alles mal eben. Och komm, ich bin kurz an meinen Computer gegangen und habe mir da ausgedacht. Nee, das war Recherche, war das.",
      "start": 1529530,
      "end": 1541566,
      "confidence": 0.88922125,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich möchte noch mal zitieren, du hast irgendwie gesagt, du bist jetzt mein Consultant, der mir die Lösung vorschlägt. Für was habe ich dich denn so in der Richtung?",
      "start": 1541678,
      "end": 1550222,
      "confidence": 0.922477,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich habe mir natürlich schon vorher Gedanken.",
      "start": 1550366,
      "end": 1551766,
      "confidence": 0.98261714,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Gemacht, aber ich habe mir ja auch mal die Zahlen angeschaut, was unsere Hörerschaft denn so gut gefunden hat. Also nicht nur wir, weil wir können ja was gut finden und andere finden es dann vielleicht weniger gut. Und die drei Ÿousand besten Episoden, also die am besten performt haben, waren einerseits natürlich die mit Pip, wo wir über Beteiligungsmodelle gesprochen haben. Und der hat wahrscheinlich einfach aus seiner Gefolgschaft recht viel natürlich mitgebracht. Ich glaube, er hat auf LinkedIn Follower oder sowas. Also das war mit Abstand die beste Episode. Doppelt so viele Downloads wie andere Episoden oder so, teilweise sogar mehr innerhalb kürzester Zeit. Und was ich natürlich extrem cool finde, auf Platz zwei der besten Episoden im letzten Jahr ist simplify your stack falsch statt Datenbanken. Die Episode 129.",
      "start": 1551798,
      "end": 1599652,
      "confidence": 0.9422153,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das hört sich jetzt so ein bisschen als klopft für dich selbst auf die Schulter.",
      "start": 1599716,
      "end": 1602068,
      "confidence": 0.755892,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das ist ja mein Lieblingsthema. Ist sehr umstrittenes Thema, aber finde immer cool darüber zu diskutieren und freut mich natürlich, dass da Leute auch dabei geblieben sind. Und an dritter Stelle auch sehr interessant, weil es eigentlich kein klassisches IT Thema ist. Zweitausendein, aber vielleicht gerade deswegen, weil es einfach jeden und jede betrifft. Die Episode 127 Impostor Syndrom und Peter Prinzip mit der Psychologin Fanny, die uns da die zwei Begriffe nähergebracht hat.",
      "start": 1602164,
      "end": 1628138,
      "confidence": 0.912524,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ganz starke Folge. Da muss ich auch wieder feststellen, ein bisschen Impostor ist halt vielleicht auch gesund. Aber wie wird das berechnet? Also woran hast du gesagt okay, das ist die erfolgreichste Episode?",
      "start": 1628194,
      "end": 1637682,
      "confidence": 0.91154635,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also das einfachste wäre natürlich einfach die Downloads zu nehmen. Finde ich aber eigentlich sehr schwache Metrik, weil es heißt noch lange nicht, dass die Episode gut ist.",
      "start": 1637746,
      "end": 1645402,
      "confidence": 0.9387071,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zweitausendein.",
      "start": 1645466,
      "end": 1645644,
      "confidence": 0.53265,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich habe probiert, so eine kombinierte Metrik zu nehmen. Und zwar nehme ich mir die Downloads bzw. Die Unique Listeners und kombiniere die mit der Durchhörrate, also wie lange die Leute dabei bleiben. Und dann vergleiche ich, wie viele unique Hörer innen noch nach drei, vier von der Episode dabei sind. Und diesen Wert verwende ich dann fürs Ranking. Also wie viele absolute Hörer innen haben mindestens 3/4 von der Episode gehört? Weil es kann ja natürlich sein, dass eine Episode einen super coolen Titel hat, alle klicken rein und hören aber nach 3 Minuten auf, weil sie uninteressant ist oder nach 10 Minuten. Darum diese Durchhörrate, also wie lange Leute dabei bleiben.",
      "start": 1645682,
      "end": 1685484,
      "confidence": 0.9044317,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, aber die Anzahl der Downloads werden dann prozentual gerechnet, oder? Wenn jetzt eine Episode 3000 Downloads hat, also die Anzahl der Downloads spielt da gar nicht so eine so eine richtige Relevanz, sondern nur die Durchhörrate ist eigentlich dann das Keymetric, richtig?",
      "start": 1685572,
      "end": 1701228,
      "confidence": 0.89506793,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nein, ist wirklich kombiniert 70. Wenn du, wenn du die Information hast, dass 70 % 3/4 der Episode gehört haben, dann nehme ich die unique Listeners, also die Hörer innen und multipliziere die mit den 70 %. Dann hast du wirklich einen absoluten Wert. Wie viele absolute Leute haben 3/4 der Episode gehört? Und so kombinierst du Downloads bzw. Hörer innen mit der Durchhörrate.",
      "start": 1701284,
      "end": 1725438,
      "confidence": 0.8681742,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, weil das beantwortet meine Frage. Sonst hätte ich nämlich als nächstes gefragt, was wäre, wenn ich eine Episode hätte, wo zwei Leute gehört hätten, die 100 % gehört hätten? Zweitausendeinousand.",
      "start": 1725534,
      "end": 1733352,
      "confidence": 0.9265784,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau deswegen, dass du damit raus.",
      "start": 1733406,
      "end": 1735268,
      "confidence": 0.700285,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, die Durchhörrate ist natürlich auch ein Motivationsfaktor für uns, denn uns interessiert natürlich hören die Leute überhaupt das, was wir hier zu sagen haben? Und klar, ich verstehe das immer, wir wissen nicht, wo wir gehört werden und ich merke das selbst oft, wenn meine Hunderunde irgendwie zu Ende ist und der Podcast läuft noch 10 Minuten, dann höre ich die Podcast Episode mit hoher Wahrscheinlichkeit jetzt auch nicht mehr zu Ende, sondern ich gehe einfach rein, putz den Hund, ab die Pfoten und dann beende ich den Podcast oder wenn ich aus dem Auto steige. Deswegen, man weiß es natürlich nicht, aber es ist natürlich ein gutes Zeichen, wenn die Leute so lange dran bleiben, weil das ist natürlich ein Indikator für interessanten Content und das motiviert zumindest mich sehr.",
      "start": 1735364,
      "end": 1769456,
      "confidence": 0.93769,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es bin ja nicht nur ich, der Statistiken pflegt, auch Andy berechnet da ein paar Statistiken. Wie lange ist die durchschnittliche Episode, wenn wir gerade dabei sind?",
      "start": 1769528,
      "end": 1777944,
      "confidence": 0.92348075,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Der Dezember hat die Statistik ein bisschen zerstört. In der Regel sind so 59 bis 60 Minuten ist das arithmetische Mittel pro Episode. Doch im Dezember haben wir 20 Episoden, die circa fünf bis 10 Minuten lang sind und deswegen sind wir gerade im arithmetischen Mittel auf 52 Minuten pro Episode über 71 Episoden für das Jahr 2024. Und da bin ich wirklich, wirklich stolz darauf, dass wir es geschafft haben, 73 Episoden zu releasen. Also 73 Episoden mit dieser Episode hier.",
      "start": 1778032,
      "end": 1808156,
      "confidence": 0.92971987,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber Andi, du rechnest ja auch meine absolute Lieblingsmetrik aus und zwar den Sprecheranteil. Wer wie viel Zeit von uns, soll ich sagen, contributed oder stiehlt oder ja, wie man das auch immer sieht. Also bitte verkünde mir doch diese tolle Statistik, weil du wirst mir immer vor.",
      "start": 1808268,
      "end": 1825052,
      "confidence": 0.9040227,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dass ich zu viele behind the scenes zanken wir uns immer so ein bisschen. Man soll doch mal zum Punkt kommen, man soll sich doch mal kürzer fassen und nicht wieder eine erneute Schleife drehen und wieder eine erneute Schleife drehen, damit man einfach mal 5 Minuten speaking time hat. Und irgendwann habe ich angefangen, da wir ja Transkripte haben, mit einer Speaker Recognition habe ich angefangen. Okay, wer hat wie viel Anteil an Reden? Und ja, im Jahr 2024 habe ich 20 Stunden gesprochen und der Wolfgang knapp 18 Stunden. Das ist korrekt. Wolfgang, wie viel Introansage hast du denn dieses Jahr gemacht? Weil das sind nämlich dann auch mal wieder immer gute zwei 3 Minuten.",
      "start": 1825076,
      "end": 1863344,
      "confidence": 0.94227743,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Bist du dir die Statistik in die richtige Richtung zu drehen?",
      "start": 1863392,
      "end": 1867300,
      "confidence": 0.8964982,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nö, wir bleiben einfach mal bei den Fakten. Wir bleiben einfach mal in Fakten. Du kannst nicht einfach hier Zahlen raushauen, ohne Kontext zu geben, so ja ja.",
      "start": 1867600,
      "end": 1875032,
      "confidence": 0.86962324,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber 3 Stunden Intros hast du auch nicht gemacht. Also ich bleib da eher bei den %. Andi hat drei und dreiig % und ich 29. %. Wer sich fragt, wo die anderen % geblieben sind, zweitausendein bei unseren Gästen, weil gerade wenn wir Interviews haben, dann hoffen wir schon, dass wir eigentlich weniger reden und primär unsere Gäste den interessanten Content liefern.",
      "start": 1875056,
      "end": 1896062,
      "confidence": 0.91921765,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber was uns natürlich auch freut, ist, dass das Engineering Kiosk Projekt selbst gewachsen ist. Also wir haben natürlich auch ein paar neue Follower auf Apple und Spotify bekommen. Freut uns doch sehr und motiviert uns auch sehr. Denn natürlich irgendwie machen wir das auch hier für uns so Wissen wiedergeben. Und der Podcast zwingt uns natürlich auch, uns immer wieder in neue Themen einzuarbeiten. Aber wenn wir positive Rückmeldungen hören, wenn wir gut durchhörraten hören, dann dann wissen wir natürlich ah, okay, da schaut auch irgendwer mal drauf und hört uns zu. Denn bei dieser Aufnahme hier, ich sitze gerade in einem dunklen Raum. Ja, es ist gerade Winter, ich spreche in ein Mikro und die Episode wird in einer Woche released. Also so, es ist ja kein direktes Feedback wie bei einem Twitch Livestream. Deswegen freut es natürlich sehr, auch ein gewisses Wachstum über das komplette Jahr zu sehen. Danke dafür und danke, dass du uns regelmäßig hörst.",
      "start": 1896246,
      "end": 1949356,
      "confidence": 0.9263325,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das ganze in Zahlen noch ausgedrückt. Also wir bringen jetzt keine Angst irgendwie einen Spotify Wrapped. Zusammenfassung, was wir als Podcaster ja auch bekommen von Spotify. Nur mal ganz schnell die nackten Zahlen. Also year to date dieses Jahr haben wir ungefähr Downloads bisher gehabt. Relatives Wachstum year on year, also Ÿousand, das heißt immer zum Vergleichszeitraum des Vorjahres hier und hier Downloads haben wir 72 % mehr. Vielleicht noch zur Information, wenn man im Podcastwesen von Downloads spricht, dann sind es immer unique Downloads. Also da wird die IP und der User Agent mit reingerechnet. Das heißt, wenn man da streamt oder fünf Downloads hat von derselben IP Adresse in einem gewissen Zeitfenster, dann wird es natürlich nur einmal gezählt. Also das kommt am nähesten an so eine Hörer innen zweitausendein Metrik eigentlich dran. Apple follower haben wir 87 % und Spotify follower haben wir 108 % Wachstum year und je. Also vielen, vielen Dank dafür. Das haben mittlerweile nicht mal mehr die die Hyper Growth Startups so 100 % Wachstum.",
      "start": 1949428,
      "end": 2012704,
      "confidence": 0.8789584,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Frau Wolfgang, was sind denn deine drei, vier Highlights? Was hat dir ganz besonders am Engineering kiosk Projekt in 2024 gefallen?",
      "start": 2012752,
      "end": 2021104,
      "confidence": 0.9114843,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Die Menschen.",
      "start": 2021192,
      "end": 2022020,
      "confidence": 0.98395,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Punkt. Vielen Dank für Ihren Beitrag. Das war's.",
      "start": 2023010,
      "end": 2025642,
      "confidence": 0.924545,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, also ich habe mir das zusammengeschrieben, was ich eigentlich cool gefunden habe. Und irgendwie geht es immer um reale Menschen. Also einerseits dieses Fostem Community Treffen, was wir in Brüssel gehabt haben, auf der größten Open Source Konferenz in Europa. Einfach echte Menschen zu sehen, Leute kennenzulernen, die uns hören und mit denen einfach mal drüber quatschen. Zweitausendein eben, wann die uns hören, warum sie uns hören, einfach was das für Leute sind. Dasselbe in der Community. Unsere Community hat jetzt mittlerweile 340 Member, ist wirklich auch selbstständig geworden. Da laufen Diskussionen ab und es wird Knowledge Exchange betrieben, ohne dass wir uns da groß irgendwie involvieren, was wir natürlich gerne machen. Aber es soll ja nicht nur um uns gehen, sondern es soll ja wirklich eine Community sein. Also auch da, wo sich die echten Menschen dann in irgendeiner Form treffen. Das hat mich sehr gefreut. Natürlich unser Meetup in Innsbruck, was ja auch unter dem Engineering Kiosk läuft, da auch, wo sich wieder echte Menschen treffen, wo dann auch wieder so Emotionen reinkommen. Gerade beim letzten Meetup hatten wir wirklich harte Diskussionen bei den zwei Vorträgen. Also in alle Richtungen. Ist einfach cool zu sehen, wenn sich Leute austauschen, ihre Zeit investieren und in so einer Community dazu beitragen, dass die Community lebt.",
      "start": 2025826,
      "end": 2098772,
      "confidence": 0.91918814,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn ich das Thema Menschen mal weiterführe, habe ich, sind mir zwei Stories aus dem Jahr 2024 hängen geblieben. Und zwar habe ich erstmals ein paar Leute aus der Community, aber auch andere Podcaster im realen Leben getroffen. Grüße gehen raus an Thomas vom Index out of Bound Podcast. Das fand ich sehr cool.",
      "start": 2098836,
      "end": 2116828,
      "confidence": 0.89329517,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also du meinst so richtig so in echt im Leben, so nicht videocall leben, sondern echt leben.",
      "start": 2116964,
      "end": 2121540,
      "confidence": 0.88936174,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ja, dieses mit diesem Anfassen und so.",
      "start": 2121660,
      "end": 2123880,
      "confidence": 0.90279377,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Angreifen, wie man bei uns in Österreich sagt Ÿousand.",
      "start": 2125900,
      "end": 2128014,
      "confidence": 0.8778033,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, angreifen ist ein bisschen schwierig in Duisburg, aber nun gut. Dann, was mich sehr, sehr positiv überrascht hat, war der Adventskalender. Denn wir haben einfach ein paar andere befreundete Podcasts angeschrieben und da war wirklich durchweg einfach jupp, ich bin dabei. Also einfach dieses, dieses die Community Gedanken. Super. Finde ich, finde ich klasse. Vielen lieben Dank an alle, die dabei waren. Und was mir in dem Adventskalender unglaublich viel Spaß gemacht hat, sind die Dad Jokes. Ich habe, ich habe zwei 3 Stunden habe ich mir nur Engineering, Software Engineering related Dad Jokes auf Reddit rausgesucht und ich konnte nicht mehr. Ich hatte am Ende eine Liste von 50 Witzen und musste wirklich selektieren und das war wirklich, wirklich schwierig.",
      "start": 2128092,
      "end": 2167598,
      "confidence": 0.88974625,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich habe gerade kürzlich einen Hörer getroffen und der hat auch so gemeint woher habt ihr die ganzen Dad Jokes? Wie kommt ihr dazu? Die sind super und ebn, keine Ahnung, macht alles da. Andi, keine Ahnung, was der wieder für Quellen aufgetrieben hat.",
      "start": 2167694,
      "end": 2179270,
      "confidence": 0.91255206,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also es ist langweiliger als gedacht. Also erstens gibt es einen geilen Subreddit, ich glaube Programming Humor heißt der. Da sind aber auch super viele schwache Witze bei, also da sind jetzt nicht nur Kracher dabei. Und dann gibt es etliche awesome Listen auf GitHub, die halt Programming Dad Jokes haben. Also da gibt es ein paar gute Quellen, sucht einfach mal danach.",
      "start": 2179350,
      "end": 2197454,
      "confidence": 0.8865902,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wer es übrigens nicht gemerkt hat, die Dad Jokes in den Adventkalender folgen sind AI generierte Stimmen und der Andi hat was für ein Tool dafür verwendet?",
      "start": 2197542,
      "end": 2207638,
      "confidence": 0.8764611,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "11 Labs, glaube ich. Aber bei AI generierten Stimmen ist das natürlich super, weil die sind halt so, so monoton. Ja, das war jetzt auch keine super Stimme, sondern wirklich so monoton Dad Joke. Ich hatte sehr viel Spaß. Dann eins meiner diesjährigen Highlights, wir hatten endlich mal Merchandise engineering Kiosk Tassen. Und die haben wir uns unters Volk gebracht. Das hat mich auch sehr gefreut.",
      "start": 2207774,
      "end": 2227944,
      "confidence": 0.86813134,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Schöne Geschichte übrigens. Jemand, der bei uns so eine Tasse erstanden hat bzw. Gespendet hat für die Tasse. Und ich habe es ihm dann persönlich übergeben, weil der auch in Tirol ist. Und der hat dann gemeint, es ist gar nicht für mich, er will die als Weihnachtsgeschenk verschenken. Und zwar für einen Gründer einer Firma, die schon sehr, sehr lange existiert und wo der Gründer im Prinzip den Grundcode geschrieben hat, der immer noch läuft. Also es wird mittlerweile sogar als Weihnachtsgeschenk verwendet. Und das hat mir persönlich natürlich gefreut, dass Andys Lieblingsspruch so einen Anklang findet und sogar jetzt als Weihnachtsgeschenk fungiert.",
      "start": 2228032,
      "end": 2261816,
      "confidence": 0.91568047,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich bin mal gespannt, wie das dann angenommen wird. Ein weiteres Highlight war, dass wir hier und da auch mal in den deutschen Technologie Spotify charts waren. Kleiner Fun Fact, Österreich ist so klein, Österreich hat gar keine Spotify Technologie Charts, die haben nämlich nur allgemeine Charts. Aber dies nur als kleiner Fun Fact.",
      "start": 2261888,
      "end": 2281364,
      "confidence": 0.93189424,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es gibt glaube ich insgesamt überhaupt nur fünf oder sechs Länder, die Unterkategorien haben bei Spotify weltweit.",
      "start": 2281412,
      "end": 2286628,
      "confidence": 0.9156065,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber uns freut natürlich sehr, dass wir dann auch teilweise mal in den Top 10 ein paar Tage waren. Was dann aber auch gleich direkt ein Lowlight ist, denn diese Charts sind so hart intransparent, was mich tierisch nervt. Ich verstehe nicht, wie diese generiert werden, ich verstehe nicht, was man tun muss, um da reinzukommen. Ich verstehe es einfach vorne und hinten nicht und das regt mich halt immer so tierisch auf. Auf der anderen Seite habe ich mich dann selbst mal gefragt, wie oft schaue ich denn in meiner Spotify App in die Spotify Technologie Charts und habe dann einen Podcast daraus gehört und die Antwort war noch nie. Also vielleicht sind die Spotify Charts für mich einfach nur völlig irrelevant. Ist es trotzdem schön zu sehen, dass man irgendwie drin landet. Und mein letztes Highlight, was ich nicht als selbstverständlich ansehe, ist, wir haben es, wie gesagt, dieses Jahr geschafft, 73 Episoden zu releasen. Jeden Dienstag kam eine Episode raus. Und das ist hier immer noch ein Zeitprojekt. Wolfgang und ich sind immer noch hauptberuflich anderweitig tätig. Wir machen diesen Podcast leider nicht hauptberuflich. Dazu reicht es bei weitem nicht. Und dieser bindet natürlich sehr viel Zeit, sehr viel Research, sehr viel Kommunikation mit anderen. Und darauf bin ich dann auch wirklich, wirklich stolz, dass man das noch ins normale Leben irgendwie unterkriegt.",
      "start": 2286684,
      "end": 2357838,
      "confidence": 0.9390851,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Jetzt bist du ja immer ein großer Fan von auch auf Punkte zeigen, die nicht so gut funktionieren. Also wenn wir Highlights haben, was waren dann deine Lowlights und dein neu eingeführter Begriff der Neutral Lights?",
      "start": 2357894,
      "end": 2368334,
      "confidence": 0.9034803,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ach so, ja, also ein key Low Light war natürlich die Charts, habe ich ja gerade gesagt, proprietäre Systeme. Ich würde mir schon wünschen, dass die Charts auch Open source werden, so wie der twitter Algorithmus, aber nur gut. Eins meiner Lowlights ist in Episode 111. Am 20. Feb. Haben wir nämlich mal eine Episode gemacht, wie wir diesen Podcast hier betreiben. Ziemlich viel mit Engineering, ziemlich viel mit Skripts. Und wir wollen uns natürlich irgendwie obsolet machen und das Pre und Post Production irgendwie aufwandstechnisch runterfahren. Und das war so ein Lowlight für mich. Nicht die Episode selbst. Die Episode selbst fand ich immer noch super und wir werden auch oft gefragt und die verlinke ich oft, aber diese Behind the Scenes Optimierung da, die haben wir in 2024 deutlich schleifen lassen. Wir haben uns sehr, sehr viel vorgenommen. Im Endeffekt haben wir da kaum was gemacht. Und das ist dann, das fühlt sich dann immer so ein bisschen an wie richtige Arbeit, diese Pre und Post Production und nicht wir optimieren uns hier weg. Und ja, vielleicht, vielleicht haben wir uns auch zu viel vorgenommen, weiß ich nicht. Weil das Highlight, habe ich ja gerade gesagt, 73 Episoden produziert und veröffentlicht. Deswegen, vielleicht ist es dann wieder so, man nimmt sich immer viel zu viel vor. Aber da müssen wir mehr Engineering machen. Wir programmieren hier zu wenig, Wolfgang. Das möchte ich sagen, ja.",
      "start": 2368462,
      "end": 2436822,
      "confidence": 0.9029662,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das können wir ja dann 2025 ändern. Gar kein Problem. Jetzt haben wir ja mal die ganzen Advent Folgen durch. Die haben doch echt viel Zeit gekostet, würde ich mal sagen. Dann haben wir jetzt Zeit für die.",
      "start": 2436846,
      "end": 2448894,
      "confidence": 0.96217,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Automation was ist denn dein Lowlight? Ich hoffe du hast nur eins. Ich hoffe du hast gar keins eigentlich.",
      "start": 2449022,
      "end": 2453478,
      "confidence": 0.94352156,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber korrekt, ihr habt gar keine Lowlights. Apropos Lowlight, mir fällt gerade auf, mein Licht ist so niedrig, siehst mir gar nicht mehr.",
      "start": 2453534,
      "end": 2460750,
      "confidence": 0.8252865,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Hast du mal die Frage gestellt, ob das vielleicht besser ist?",
      "start": 2460790,
      "end": 2463820,
      "confidence": 0.8759018,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich glaube, wir lassen das jetzt einfach drinnen am besten. So, wo wollen wir. Lowlight. Genau, Lowlight. Ich habe kein Low Light, weil ich bin ja ein Mensch, der sich immer auf die positiven Dinge fokussiert und gar nicht so mit den negativen so lang rumhängen will. Darum skippe jetzt einfach mal meine Lowlights und du kannst direkt zu deinen Neutral Lights gehen. Vielleicht sollten wir mal eine eigene Episode zu Neutral Lights machen.",
      "start": 2464600,
      "end": 2486400,
      "confidence": 0.8619196,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jeder, der schon mal etwas mit einer anderen Person gemacht hat, zweitausendein über einen längeren Zeitraum. Und dazu zähle ich auch die Ehe, ein Startup gegründet, von mir aus auch die pfadfindergeleitet, das ist mir völlig egal. Wenn ihr irgendwas mit anderen Menschen gemacht habt, dann ist es unausweichlich, dass es man irgendwann zu Streit, Diskussionen und Uneinigkeiten zwischen den Personen kommt. Und das ist natürlich bei diesem Projekt nicht anders. Also der Wolfgang ist so stur wie ein alter weißer Mann. Das ist unglaublich. Zweitausendein.",
      "start": 2486480,
      "end": 2517368,
      "confidence": 0.935582,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Moment, Moment, Moment, Moment. Dann geh mal in deinen Tempfolder und öffne an die zwei.",
      "start": 2517414,
      "end": 2522852,
      "confidence": 0.86328334,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wir haben bei unseren Dienstagsfolgen nie den Adventskalender erwähnt.",
      "start": 2523036,
      "end": 2525948,
      "confidence": 0.8943622,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich weiß, aber ist der 24. Müssen wir schon irgendwie.",
      "start": 2526044,
      "end": 2528596,
      "confidence": 0.749657,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Quatsch, oder?",
      "start": 2528708,
      "end": 2529452,
      "confidence": 0.989215,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Den 24. Müssen zumindest irgendwie erwähnen, warum wir da jetzt so eine GitHub Folge machen, oder?",
      "start": 2529476,
      "end": 2534012,
      "confidence": 0.86638874,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nee, wieso nicht?",
      "start": 2534116,
      "end": 2535300,
      "confidence": 0.58093,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wieso nicht ganz normale Folge machen ohne.",
      "start": 2535380,
      "end": 2538164,
      "confidence": 0.83600855,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, also ich.",
      "start": 2538292,
      "end": 2539244,
      "confidence": 0.80169,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Kein Abschluss vom Adventkalender.",
      "start": 2539292,
      "end": 2541280,
      "confidence": 0.81877,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die ganze Folge hat nichts mit Weihnachten zu tun. Zweitausendein.",
      "start": 2543180,
      "end": 2545190,
      "confidence": 0.914632,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Naja, was gemütliches, GitHub Kuriosität.",
      "start": 2545300,
      "end": 2547874,
      "confidence": 0.582954,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, da stirbt jemand, geht in den Knast, Fest der Liebe. Ich merke das schon.",
      "start": 2547922,
      "end": 2551370,
      "confidence": 0.9386207,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das ist ja da. Jesus ist doch eingestorben da, oder? Also auf die Welt kommen, ja, wieder auferstanden.",
      "start": 2551530,
      "end": 2557666,
      "confidence": 0.85198265,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja gut, ob das jetzt ein richtiger Streit war? Also wenn das ein richtiger Streit war, dann muss ich zugeben, dann ist das ja schon noch harmonisch.",
      "start": 2557858,
      "end": 2564390,
      "confidence": 0.9584352,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich wollte nur sagen, wer ist da der Sturkopf?",
      "start": 2565130,
      "end": 2567450,
      "confidence": 0.88474554,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du hast jetzt einmal. Du hast jetzt einmal Glück, dass ein Streit zweitausendein. Obwohl das war kein Stress, das war eine kleine Uneinigkeit, eine kleine Diskussion.",
      "start": 2567530,
      "end": 2575936,
      "confidence": 0.92582,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber in jeder Episode können wir diskutieren.",
      "start": 2576088,
      "end": 2579700,
      "confidence": 0.85488,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich muss ja jetzt auch mal ehrlich sein. Viele unserer Uneinigkeiten sind in geschriebener Form. Und das ist natürlich dann unglaublich schwierig, da Emotionen rauszulesen. Deswegen interpretiere ich da sehr viel rein. Aber na gut, wir streiten uns schon ab und zu wie so ein altes Ehepaar. Und das hat sich auch schon über die drei Jahre ein bisschen geändert. Das ist ein Neutralit, würde ich mal sagen, weil es gehört einfach dazu. Und ein Streitpunkt bzw. Eine kontinuierliche Diskussion ist natürlich der Inhalt dieses Podcasts. Und ein Format sind Interviews mit externen Gästen. Und da geht es natürlich oft darum, okay, zu welchem Thema suchen wir denn eine Expertin? Welche Person ist die richtige Person? Welche Person fragen wir an?",
      "start": 2580360,
      "end": 2615314,
      "confidence": 0.92341834,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wir haben natürlich da intern sehr viele Diskussionen, aber wir haben auch einige Punkte, wo wir uns ganz einig sind. Und wir wollten das auch noch mal ein bisschen transparenter darstellen, wie wir so zu Gästen kommen und welche Punkte wir da auch beachten. Weil es gibt schon so Grundpfeiler, die wir uns mal ausgemacht haben und die wir ganz stark befolgen. Und da geht es vor allem darum, wie gehen wir mit Vorschlägen um, die uns Leute schicken? Und gerade im letzten Jahr hat es extrem zugenommen, dass uns Leute irgendwie Vorschläge schicken. Und wir nehmen ganz gerne Vorschläge aus der Community an, gar keine Frage. Also wenn irgendwer eine gute Idee hat, wir nehmen das immer gerne auf Ÿousand, wo wir ganz, ganz vorsichtig sind, sind Agenturanfragen. Bekommen wir jetzt immer häufiger. Irgendeine Werbeagentur sagt, es gibt einen ganz tollen CTO, irgendwen, der ein Buch geschrieben hat und der kann über XY extrem gut reden. Da haben wir jetzt eigentlich den Approach, dass wir diese Leute einfach immer ablehnen. Und da hatten wir sogar eine Person, da haben wir eigentlich gedacht, das scheint schon eine sehr interessante Persönlichkeit zu sein. Hat auch ein gutes Buch geschrieben, Zweitausendein. Aber dann haben wir gemeint, okay, wir bleiben einfach unseren Grundsätzen treu. Wenn da so eine professionelle Werbeagentur im Hintergrund steckt, dann lehnen wir die Anfrage diese Person einfach ab. Und man glaubt gar nicht, wie viel e Mails wieder im Jahr bekommen, also von Werbeagenturen, von Leuten selbst teilweise. Es hat also wirklich stark zugenommen. Und man merkt es halt auch dann oft, wenn genau diese Leute, wo man die Anfrage bekommen hat von der Werbeagentur, die hat man dann womöglich in anderen Ÿousand Podcast Formaten. Und vor allem, was wir dann halt auch oft hören, ist oder eben nicht hören, dass das nicht transparent gesagt wird. Also es gibt ja durchaus Podcaster, die das sehr transparent sagen. Diese Episode ist unterstützt, gesponsert, wie man das auch immer nennt. Dann kann man sich vorstellen, dass da vielleicht im Hintergrund irgendwo Geld fließt. Das ist eine sinnvolle Transparenz. Aber wir hören halt dann diese Personen auch in irgendwelchen Podcasts und da sprechen wir auch von den teilweise größten Podcast in Deutschland, die Leute interviewen und dann sitzen da Leute drin und da wird überhaupt nichts transparent dargestellt, dass da im Hintergrund vielleicht, wir wissen es natürlich nicht, unter Umständen irgendwie auch Geld geflossen.",
      "start": 2615362,
      "end": 2744470,
      "confidence": 0.93858755,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nur zum Kontext für Leute, die noch nicht so tief drin sind. Es gibt inzwischen Agenturen, die sich nur ums tech Branding von irgendwelchen CEOs und CTOs von jeweiligen Firmen kümmern und dann natürlich diesen Outreach machen und versuchen, diese Leute aktiv irgendwo zu platzieren.",
      "start": 2744550,
      "end": 2762280,
      "confidence": 0.89750934,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Man merkt es auch, dass manche Firmen da richtig aggressiv rein starten, weil da hörst du den CTO in Tech Podcasts, den CEO in irgendwelchen Business Podcasts. Also da merkst du, dass diese Firma oder Organisation teilweise wirklich in allen Formaten plötzlich auftaucht. Und da merkt man dann schon, das muss irgendwie koordiniert sein und da muss mehr Druck dahinter stecken, als wenn man nur mal die sinnvollen Leute interviewt.",
      "start": 2762400,
      "end": 2786580,
      "confidence": 0.90947145,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich finde es auch generell nicht negativ, weil es ist ein Employer Branding, es ist ein tech Employer Branding und im war of Talent, also fähige Leute ranzuschaffen, brauchst du Sichtbarkeit. Also ich finde daran nichts verwerflich. Doch, ich stimme Wolfgang zu. Die Anfragen haben in 2024 enorm zugenommen. Also ich rede jetzt wirklich von, ich würde mal fast sagen, dreiig, fünf und dreiig e Mails haben wir es über das Jahr bekommen, zweitausendein, diversen Leuten von diversen Agenturen. Und es hat immer, wie gesagt, so einen kleinen faden Beigeschmack. Wir denken immer noch, jeder kann machen, was er möchte, jeder betreibt sein eigenes Projekt, wie er oder sie möchte. Wir versuchen immer, ich sag mal, auf der einen Seite bei der Sache zu bleiben, auf der anderen Seite natürlich auch Themen auszuwählen, wo wir richtig Lust drauf haben. Weil im Endeffekt geht es ja darum.",
      "start": 2786660,
      "end": 2831282,
      "confidence": 0.91018057,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es ist auch einfach eine Sache von Transparenz. Also es ist ja sogar offiziell so, dass Werbung gekennzeichnet sein muss zweitausendein. Und bei Podcasts passiert es aber ganz oft eben nicht. Und da spreche ich jetzt nicht von der klassischen Werbung, wo die eigentlich ja meistens klar sichtlich ist und irgendwie, dass das ein eingesprochener Text ist, eine klassische Werbung, sondern wenn eben Personen eingeladen werden und da dann vielleicht Geld fließt und es aber nie erwähnt wird, dass da die Person zahlt, dass sie in dem Podcast interviewt wird. Also da sehe ich eigentlich das größte Problem. Das geht so ähnlich wie im Journalismus oft, wo dann Redakteure irgendwie nicht bezahlt werden, aber sie werden in große Hotels eingeladen, um eine Reportage zu machen und so weiter. Und da kann man ja dann fast nicht mehr neutral sein. Also das muss man schon auch sagen, das kann man wollen, aber es wird dann schon schwierig, weil wenn du einfach mit den Personen in Kontakt bist, wenn du da vielleicht Geld bekommst, dann wird es einfach schwieriger, neutral zu bleiben. Wir sind jetzt keinen Politik Podcast, wo das natürlich viel, viel kritischer noch ist, aber man kann ja trotzdem möglichst integer bleiben. Und das haben wir uns halt intern auferlegt, dass wir da probieren, möglichst selbstständig zu agieren und auch möglichst transparent zu sein. Also wir hatten auch schon Firmen, die bei uns Werbung geschalten haben und von denen wir Personen interviewt haben. Aber bisher war wenigstens die Reihenfolge so, dass wir zuerst die Person hatten in dem Interview und dann ist der Kontakt zustande gekommen mit HR, mit Employer Branding und die haben dann auch Werbung geschalten. Also da war dann meistens eine größere Zeitspanne auch dazwischen und da war kein direkter Kontakt. Also das versuchen wir auch weiterhin auf jeden Fall so Hand zu haben und dass wir da also keinen direkten Einfluss auf unseren Content haben.",
      "start": 2831466,
      "end": 2929620,
      "confidence": 0.93161666,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und zum Thema Transparenz ist es ja wirklich so, ja, wir werden auch für die Werbung bezahlt, wir markieren das auch so, wir verdienen da jetzt keine goldene Nase mit, können es bei weitem nicht voll beruflich machen. Ich glaube noch nicht mal die Miete dafür zahlen. Von daher, also so viel, so viel kommt da jetzt nicht bei rum. Aber es ist halt so ein bisschen eine kleine Querfinanzierung, Finanzierung, dass wir halt nicht komplett für die Services, die wir hier für die Post Production haben, nicht so draufzahlen. Also da bekommen wir Geld zu, das ist das Transparenz. Aber wir haben uns noch nie für ein Interview bezahlen lassen. Wir haben da noch nie irgendwie eine voll gesponserte Folge zugemacht oder ähnliches. Und das, dem wollen wir auch treu bleiben.",
      "start": 2929700,
      "end": 2967014,
      "confidence": 0.90115464,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, also das werden wir auch in Zukunft nicht machen. Das ist eigentlich aktuell definitiv die Regel bei uns. Es gibt keine gesponserten Episoden in dem Sinne, dass unser Gast für das Auftreten in irgendeiner Form etwas zahlt. Also das ist immer komplett, wir zahlen nichts, die Gäste zahlen nichts. Soll wirklich also auf einer sinnvollen Ebene stattfinden. Und alles was bezahlt wird, sind unsere eingesprochenen Werbungen, die Werbeblöcke, die klar ersichtlich sind als Werbung.",
      "start": 2967062,
      "end": 2992346,
      "confidence": 0.93516576,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ab und zu bezahlen wir die Gäste schon. Also ich meine, wenn wir mal so einen Gast irgendwie im Real Life sehen, dann springt da schon mal ein Kaffee bei rum oder eine Pizza oder ähnliches. Also wenn wir die Zeit dann haben oder das eine oder andere Bier als Dankeschön.",
      "start": 2992458,
      "end": 3003958,
      "confidence": 0.89904135,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also stimmt, nachträglich ja, da bezahlt, aber wir hätten nicht die finanziellen Mittel, jetzt wirklich Leute zu bezahlen. Es haben übrigens auch einige Leute gefragt, ob der Pip in irgendeiner Form bezahlt war, weil Pip ist Multimillionär, warum kommt er überhaupt zu uns in den Podcast? Und auch da war meine klassische Antwort, ich glaube, wenn wir den irgendeine Kleinigkeit gezahlt hätten, darum wäre er sicher nicht zu uns in den Podcast gekommen. Also wir sind froh, dass er das gemacht hat und wir haben uns sehr gefreut darüber, aber auch da ist kein Geld geflossen.",
      "start": 3004054,
      "end": 3034198,
      "confidence": 0.90427643,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber immer wenn ich an Geld denke, denke ich an Wetteinsätze. Und wir hatten einen Wetteinsatz. Also es läuft ja noch eine Wette, die wir jetzt mal auflösen wollen. Und zwar bei Episode 100 hatten wir sogenannte tech Predictions. Was wir da gemacht haben ist, wir haben versucht, das Jahr 2024 vorherzusagen und jeder pickt sich so ein, zwei Aussagen, die dann entweder wahr werden oder falsch sind. Und da haben wir drüber gewettet und die Wette war, der Verlierer zahlt dem Gewinner einen Restaurantbesuch auf der Foster Konferenz, die jetzt Anfang Februar wieder in Brüssel ist, bzw. Man wird auf einen Restaurantbesuch eingeladen. Jetzt müssen wir das natürlich auch noch kurz auflösen. Gehen wir mal ganz kurz durch, welche fünf Predictions wir hatten. Wir hatten jeweils zwei Predictions und einen sogenannten Tie Breaker, falls wir irgendwie Gleichstand haben. Prediction eins der Wolfgang hat hervorgesagt, dass sehr viele Firmen sich aus der Cloud zurückziehen und wieder zu on prem gehen. Und mit sehr vielen Firmen haben wir uns auf fünf bis 10 große Mittelständler geeinigt, dass die das announcen. Wie schätzt du es selbst ein?",
      "start": 3034294,
      "end": 3101822,
      "confidence": 0.90775037,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich habe da natürlich Recherche betrieben. Es hat schon ein paar Umfragen gegeben, aber man muss sagen, so die klaren Messages irgendwie zurück zum Data Center hat es nicht gegeben, in der Menge zumindestens. Aber es gibt einen interessanten Report von IDC, die so über das Cloud Business auch viele Reports machen. Und die haben z.B. festgestellt, dass 8 % ihrer Kunden gewisse Teile komplett zurück ins eigene Infrastruktur legen wollen. Wobei das sind jetzt keine Hauptprodukte, sondern da geht es ganz oft um diese ganzen Backups, Storage natürlich auch, weil das am ehesten natürlich finanziell interessant ist, also dass man so Teile zurück ins Data Center transferiert. Aber immerhin 8, %, also das ist schon eine ganz ordentliche Menge. Also ich würde schon sagen, der Trend ist da, aber das klassische Announcement als großer Mittelständler, wir gehen komplett wieder on prem, hat es leider nicht gegeben.",
      "start": 3101886,
      "end": 3158882,
      "confidence": 0.8987475,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Schade Wolfgang, das tut mir sehr leid.",
      "start": 3159066,
      "end": 3161258,
      "confidence": 0.97884285,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Die zweite prediction von Andi war zum Thema finops. Andis Lieblingsthema alles ist nun mal finops. Er schnappt dann wieder irgendwie ein Keyword auf und dann ist es in aller Munde. Aber er hat natürlich recht, die Cloud Kosten werden immer größer. Das war ja auch mein Grundgedanke, warum die Leute wieder on prem gehen. Andys Grundgedanke war, die Firmen optimieren immer mehr, um diese Cloud Kosten zu senken und unter Kontrolle zu haben und da noch weiter zu optimieren. Und die Kernaussage bzw. Die Kernwette war dann eigentlich, dass der ARPU, der Average Revenue per User bei den großen Hyperscalern zweitausendein zurückgeht. Also die Hyperscaler machen nur mehr Geld mit neuen Usern, weil die alten User, die großen Kunden alles so optimieren, dass sie weniger zahlen müssen. Das heißt, der Revenue pro Großkunde geht nach unten. Und das ist eine klare Metrik, die man messen kann. Andy, hast du gewonnen oder nicht?",
      "start": 3161394,
      "end": 3215284,
      "confidence": 0.9171863,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, also subjektiv würde ich sagen, ja, ich habe gewonnen. Objektiv kann ich leider nicht beweisen. Also wo wir schon irgendwie beide ja sagen müssen, ist, dass das Thema Finops, auch mit der finops Foundation, da gibt es Zertifizierung und so weiter und so fort. Also das hat schon Relevanz gekriegt und ich kenne keine Firma, die sich nicht mit der Optimierung ihrer Cloud Kosten auseinandersetzt. So, da musst du jetzt mal leider sagen, Andy, du hast recht, ja, aber.",
      "start": 3215372,
      "end": 3237952,
      "confidence": 0.903342,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Trotzdem, die Firmen sollten ja eigentlich wachsen, wobei aktuelle Wirtschaftslage ist es natürlich schwierig. Insofern, du hast wahrscheinlich recht, aber ich habe auch selber gesucht, weil ich wollte natürlich beweisen, dass Andi nicht recht hatte. Ich habe eine halbe H gesucht und habe keine sinnvollen Informationen gefunden zu den Arpus. Teilweise werden Anzahl der User, der großen Customers noch ausgewiesen, letztes Jahr, dieses Jahr nicht mehr. Also auch das spricht für Andy, wenn die großen wie z.B. cloudflare nicht mehr ausweisen, wie viele Kunden sie eigentlich haben, dann spricht es schon für Andys Theorie, dass da vielleicht nicht mehr so viel ausgegeben wird. Es könnte schon sein, aber faktisch ist es so, es steht nirgends. Auch die großen Google und AWS, die sind ja nochmal Ÿousand schwieriger, weil die jeweils eingebettet sind in Alphabet oder in Amazon, da bekommt man noch weniger Informationen. Also ist es schwierig, da diese Metrik rauszufinden.",
      "start": 3237976,
      "end": 3289770,
      "confidence": 0.90907675,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich kann es leider nicht beweisen, wir haben die Kennzahlen nicht, deswegen leider falsch. Ist ein gutes Learning. Ja, wir haben uns auf eine Metrik gestürzt, die ich einfach nirgendwo ausgewiesen werde. Hätten wir vorher wissen müssen, muss ich zugeben.",
      "start": 3289810,
      "end": 3299842,
      "confidence": 0.871205,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Naja, letztes Jahr ist ja ausgewiesen worden, da wo es noch gut gelaufen ist. Aber das ist halt bei diesen Reports, da hat man ja auch eine gewisse Flexibilität. Und kann dementsprechend gewisse Sachen ausweisen oder eben auch nicht, weil sie freiwillig sind. Wenn jemand allerdings die Informationen hat, bitte schaut vorbei bei uns in der Discord Community. Würde mich natürlich freuen, wenn wir das beweisen könnten, dass Andy wirklich unrecht hatte.",
      "start": 3299866,
      "end": 3321188,
      "confidence": 0.9229007,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Prediction drei bzw. Deine zweite Prediction, du hast dich da so ein bisschen hype driven development angewandt. Ja, ich kann schon mal spoilern, leider nicht positiv, denn zweitausendein deine Prediction war AI löst SQL ab bzw. Hast du erwartet, dass man eine Art prompt oder eine spezielle AI spezifische Abfragesprache an die Datenbank schmeißt und dann kommen die Daten zurück und nicht mehr SQL schreiben musst. Und da war natürlich auch ein bisschen Diskussion drüber, was heißt das denn, wenn das jetzt eine Datenbank hat oder ähnliches? Wir haben gesagt, das muss eine SQL Datenbank sein. Ich habe gesagt, es kann auch ein SQL dialekt sein, wie z.B. cassandra SQL, das ist ja nicht rein ansi SQL. Dann haben wir gesagt okay, lass uns doch mal die Datenbanken, die dieses Feature haben sollten, das sollte dann alle unter modern SQL dot com sein. Das ist so BigQuery, Postgre, MySQL, SQLite. Und so haben wir gesagt Postgre Plugins zählen nicht.",
      "start": 3321244,
      "end": 3376598,
      "confidence": 0.9013313,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wir haben uns, glaube ich, auf eine Datenbank geeinigt, aber ich habe dann eh gemeint, wenn das sich durchsetzt, dann wird es so groß sein, dass man das überall verwendet und dann brauchen wir gar nicht diskutieren, ob ich das gewonnen habe oder nicht. In dem Fall gebe ich dir recht, ich habe es nicht gewonnen. Es gibt bereits einige Startups, die ja in dem Bereich unterwegs sind, die deine Data Lakes anbinden, über einen Chatbot automatisiert und über deine Prompts dann im Hintergrund SQL queries erzeugen, die dir dann automatisiertes ausspucken. Also du sagst irgendwie, wie war unser Umsatz im letzten Monat? Und dann wird im Hintergrund automatisch die SQL Query dazu erzeugt. Und so kannst du dann auch Sachen kombinieren. Also da gibt es bereits Startups, aber es hat sich weniger stark entwickelt, als ich mir gedacht habe. Aber man muss ja auch Predictions immer aufsetzen, die bisschen zukunftsorientierter sind und nicht nur so langweilige Outpour Predictions.",
      "start": 3376734,
      "end": 3426368,
      "confidence": 0.9169346,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, die Datenbank, die da vielleicht so ein bisschen in die Richtung geht, ist LloyDB von Google, aber ist ja proprietär, ist da nicht nicht open source. Aber gut, wir hatten auch BigQuery drin. Naja, Punkt ist verloren.",
      "start": 3426504,
      "end": 3437208,
      "confidence": 0.85405844,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Apropos verloren, da kommen wir gleich zu deiner nächsten Prediction, weil die war weder Matthias, der damals unsere Episode geleitet hat, unsere Rückblick Episode, ihm war nicht klar, was du willst. Mir war eigentlich nicht klar, was du willst. Eigentlich war niemandem klar, was du willst und wir haben da auch keine sinnvolle Metrik am Schluss definieren können, die das beweist. Aber was du irgendwie gesagt hast, die großen Kommunikationsplattformen wie Slack Metamos, Teams und so weiter, die bekommen ein ICQ Ÿousand, was wirklich die gesamte Oberfläche ändert, dass man so im ICQ Style mit diesen Plattformen kommunizieren kann.",
      "start": 3437304,
      "end": 3473826,
      "confidence": 0.9209772,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Was ich gesagt habe, ist, die großen Slack Metamorphs oder Teams können gesemed werden und es gibt Leute, die machen dann ein ICQ Theme oder Spotify kriegt ein Theme und jemand macht ein Winem Theme. So, das habe ich gesagt, ich bin immer noch Fan davon und ich würde es sogar machen. Und was man natürlich dieses Jahr mitgekriegt hat, zweitausendein Winamp ging in die Richtung, Winamp war kurze Zeit Open Source oder halt auch nicht Open Source, man weiß es nicht so ganz, was da so abging, aber naja, gut, verloren, schade, ich wünsche mir immer noch ein Slack ICQC.",
      "start": 3473898,
      "end": 3504360,
      "confidence": 0.9166208,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Mit diesem, ja, den Sound kannst du ja ändern, das haben wir damals in der Episode ja schon festgestellt.",
      "start": 3504400,
      "end": 3509456,
      "confidence": 0.95210946,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dann hat man noch eine Zusatzprediction, die ging um Open Source. Die ging eigentlich darum, dass mehr Open Source Projekte, mehr größere Open Source Projekte werden zur Business Source License oder zur Server side public license wechseln. Das ist eine nicht von der OSI anerkannte Open Source Lizenz und die verhindert eigentlich, dass dein Projekt von AWS und von Google monetarisiert wird und dass sie dann nicht dein eigenes Cloud Geschäft kaputt macht. Und da war die Wette, dass fünf größere Projekte mit einer gewissen Reichweite auf einer dieser non open source Lizenz wechseln. Wolfgang, da hast du mir zugestimmt, sagst du. Ja, das glaubst du auch.",
      "start": 3509528,
      "end": 3549288,
      "confidence": 0.8912699,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, da waren wir beide eigentlich der gleichen Meinung, dass das kommen wird. Glücklicherweise ist es eigentlich nicht so gekommen. Es hat sich alles ein bisschen umgedreht, muss man sagen. Und zwar, es gibt sogar eine Wikipedia Seite, list of formerly open source of free software, die dann eben kommerziell geworden ist. Die einzigen, die dort draufstehen fürs Jahr 2024, ist Andys Lieblingssoftware, würde ich fast sagen. Der alte Fanboy Andy, der Reddys natürlich von oben bis unten liebt. Zweitausendein Redis hat die Lizenz geändert, aber gleichzeitig muss man auch sagen, Elasticsearch, die ja den großen Move da gemacht haben, eigentlich in diese Richtung, die sind wieder zurückgegangen und die gibt es wieder unter AGPL, die ein bisschen stärker ist als die GPL, weil da geht es genau um diesen Hosting Aspekt, dass man auch diese Hosting Aspekte open source muss, aber die sind wieder zurückgegangen. Also scheinbar ist es doch definitiv keine anhaltende Welle gewesen, was mich persönlich extrem freut.",
      "start": 3549384,
      "end": 3605574,
      "confidence": 0.89731985,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Hoffen wir, dass das 2025 so bleibt. Das bedeutet, der Wolfgang hatte zwei Predictions, beide. Ich hatte zwei Predictions, leider auch alle beide negativ. Und wir hatten eine Prediction zusammen, die ist leider auch nicht eingetroffen. Oder zum Glück jetzt im Sinne zum Open Source, zum Glück nicht eingetroffen. Und dann kam der Matthias mit einem sogenannten Tie Breaker um die Ecke. Der sagte nämlich, was passiert denn, wenn ihr beide Gleichstand habt? Wer gewinnt denn dann? Wir müssen schon noch einen Gewinner haben. Matthias hat vorgeschlagen, dass wir die Programmiersprache mit dem größten prozentualen Wachstum benennen. Und zwar, welche Programmiersprache wird in 2024 am größten an Popularität wachsen? Und die Popularität wird definiert in die Anzahl an Programmiererinnen, die die Sprache nutzen, halt der prozentuale Zuwachs. Und da hat Matthias auch direkt den entsprechenden Report rausgeholt. Und zwar war das der State of the Developer Nation Report, weil sonst hätte man ja einfach jeden Report nehmen können. Der Wolfgang hat gesagt, Rust wächst am stärksten. Ich habe meine Hassliebe JavaScript genannt. Und Wolfgang, möchtest du das Ergebnis verkünden?",
      "start": 3605662,
      "end": 3670628,
      "confidence": 0.904791,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich möchte kurz über unser Vorgespräch informieren, weil Andy hat gemeint, ich habe sicher verloren, wie ich heute die Research betrieben habe, weil das JavaScript noch so viel wächst. Glaubt er auch nicht, weil eben die Base schon so groß ist. Aber zu meinem Entsetzen musste ich feststellen, dass JavaScript noch um 26 % gewachsen ist auf 25 Millionen User und Rust nur um, je nachdem von welchen Reports man rechnet, aber 8 % bis teilweise über 10, %, je nachdem, in welchem Vergleichszeitraum man das nimmt, weil Rust teilweise auch wieder gesunken ist zwischendrin auf 4 Millionen aktuell. Also Andy, es ist schwer für mich, aber du hast in dem Fall bei dieser dummen Schätzaufgabe recht behalten.",
      "start": 3670804,
      "end": 3716150,
      "confidence": 0.9159621,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das freut mich sehr und ich nehme den Sieg gerne an und freue mich natürlich auf das Abendessen am ersten Februarwochenende in Brüssel mit dir. Was ich bei der Auswertung aber gesehen habe, und das war mir damals gar nicht so bewusst, aber da alle Zahlen beinhalten das, und zwar in diesem Report wird gesagt, dass JavaScript CoffeeScript und TypeScript enthält. Und was dann auch wieder okay ist, ja, weil Typescript wird ja transpiliert und so weiter, das finde ich schon okay.",
      "start": 3716450,
      "end": 3743682,
      "confidence": 0.89908,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ein Coffeescript verwendet eh kein Mensch mehr, also finde ich schon absolut okay, dass.",
      "start": 3743746,
      "end": 3748042,
      "confidence": 0.87968,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "JavaScript immer noch um 26 % wächst. Hätte ich jetzt auch nicht gedacht, aber damals hatte ich gesagt, okay, wegen den ganzen Bootcamps und so weiter. Und jetzt mit ChatGPT, ich denke schon, dass ziemlich viele Leute sagen, bitte generieren wir mal eine react Component und so weiter. Also ich glaube, da kommt schon ziemlich viel JavaScript Code.",
      "start": 3748066,
      "end": 3762906,
      "confidence": 0.88555104,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, lern mal eine sinnvolle Sprache. Zweitausendein.",
      "start": 3762938,
      "end": 3764950,
      "confidence": 0.8682986,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "So, das war's. Ich freue mich auf Abendessen und natürlich, falls ihr diese Episode noch vor dem Feb. 2025 hört, erstes Februarwochenende Fostem in Brüssel, Belgien, einer der größten Open Source Konferenzen. Gratis. Ihr müsst nur nach Brüssel kommen, ihr müsst da nur euch an der Schlafunterkunft suchen und ihr könnt einfach auf dem Uni Campus auftauchen. Keine Registrierung notwendig, gratis. Und da lernt ihr mal ordentlich was über Open Source, denn da kommen ungefähr 20 dreiig 40 verschiedene Open Source Communities. Jetzt haben wir so viel über den Rückblick gesprochen. Jetzt hattest du gesagt, du bist Optimist. Optimisten schauen ja immer nach vorne. Was hast du denn für einen Ausblick für uns, Wolfgang, fürs Projekt, für das Engineering kiosk Projekt?",
      "start": 3765840,
      "end": 3806354,
      "confidence": 0.8865437,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, es gibt natürlich ganz viel Neues im neuen Jahr, vor allem neuen Content wird es geben, aber wir wollen ja auch immer mit neuen Formaten experimentieren. Und nachdem die turing Award Gewinner Staffel schon so perfekt gelaufen ist, okay, wir hinken ein bisschen hinterher, aber wir haben da noch einige auf der Liste. Zweitausendein könnte man eigentlich auch weitermachen. Falls ihr da übrigens irgendwelche Wünsche habt, gerne her damit. Aber wir probieren auch ein neues Format aus, wo wir ein bisschen in die praktische Welt eintauchen wollen.",
      "start": 3806402,
      "end": 3835032,
      "confidence": 0.9288179,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zum Kontext, wir haben mit Formaten rumgespielt und irgendwann war die ja, dann lass uns doch mal die Story von Turing Award Gewinnern erzählen. Ja, innerhalb der letzten drei Jahre haben wir drei Episoden dazu gemacht. Also das Format ist noch nicht ganz richtig durchgestartet, der Erfolg kommt noch. Wir hoffen natürlich, dass das neue Format Code mit Impact, das ist so der Arbeitstitel, vielleicht erfolgreicher wird. Schauen wir mal, was wollen wir da wirklich machen? Wir denken, dass ziemlich viele Leute sehr coolen Quellcode schreiben und ich möchte den Leuten oder wir wollen den Leuten wirklich zeigen, was sie für einen Impact in der realen Welt haben. Und jede Fachdomäne, für die man Software programmiert hat ihre eigenen Tücken, Herausforderungen und auch ihre eigenen Stories irgendwie, die wollen wir mal an die Frau und an den Mann bringen. Also wie ist das denn z.B. wenn man Software für Kreuzfahrtschiffe schreibt oder für Mähdrescher oder für Raketen oder, oder, oder. Ja, welche Herausforderungen kommen da? Was für coole Story sollen die Leute erzählen? Oder ist das vielleicht doch alles JavaScript, was von SpaceX betrieben wird. Ich weiß es nicht. Ja und sonst ausblick haben wir noch nicht ganz so viel, was in 2025 kommt. Das ist einfach relativ ÿousand einfach erklärt. Wir machen jedes Quartal immer eine Retrospektive. Ja, die hatten wir einfach noch nicht. Die Retrospektive für das Quartal vier kommt halt einfach in Quartal eins 25. Also können wir eigentlich sagen, zwei alte weiße Männer machen es so, wie wir es schon immer gemacht haben. Wir schauen mal was wird.",
      "start": 3835176,
      "end": 3919280,
      "confidence": 0.9295455,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich bin ja sehr gespannt, was diese Episode für eine Durchhörrate hat. Für alle, die jetzt aber noch dabei sind und solltet ihr noch nicht in unserer Discord gucken Community sein, bitte schaut einfach in unserer Discord Community vorbei. Da finden die ganzen Diskussionen statt und man kann auch gerne mal mit einer Frage um die Ecke kommen, wenn man irgendwie eine Software sucht oder wenn man irgendwie ein Rat braucht zu irgendeinem Thema. Alles kein Problem. Sonst die ganzen Social Media links sind natürlich auch in den Shownotes, inklusive den ganzen Referenzen zu den Episoden, die wir erwähnt haben. Und war es bei mir gerade ganz live aufgebaut ist die Message Klaus Bought five coffees inklusive dem Comment. Danke für die informativen Podcasts, Themenauswahl, Gäste und Länge und auch die Shownotes sind immer gut gepflegt. Klaus, vielen lieben Dank für den Kaffee, aber auch die Info, dass jemand unsere Shownotes liest, freut uns wirklich sehr, weil wir da viel Zeit investieren. Und wenn ihr euch dem Klaus anschließen wollt, den Link zur Buy me a coffee Plattform findet ihr natürlich in den Shownotes.",
      "start": 3919360,
      "end": 3975316,
      "confidence": 0.90372336,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das war's von uns. Ich hoffe ihr begleitet uns im Jahr 2025. Genauso wie ihr uns im Jahr 2024 begleitet habt. Vielen lieben Dank. Bitte vergesst nicht, ihr seid der Grund, warum wir hier das machen. Wir freuen uns natürlich immer über Feedback, das treibt uns an, das motiviert uns und auch wenn ihr Vorschläge habt, welche Themen wir in Zukunft behandeln sollen, droppt uns mal eine e Mail. Ansonsten würde ich sagen vielen Dank fürs Jahr 24, vielen Dank für die letzten drei Jahre. Wir sehen uns im neuen Jahr. Bis bald. Tschüss.",
      "start": 3975388,
      "end": 4003372,
      "confidence": 0.95777863,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ciao.",
      "start": 4003556,
      "end": 4003900,
      "confidence": 0.91767,
      "speaker": "B",
      "channel": null
    }
  ],
  "confidence": 0.9130804,
  "audio_duration": 3952,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}