{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/Lx9q5jY9QDAq4CM/download/ep_kreuzfahrt.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "multichannel": null,
  "audio_channels": null,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "6079ca7d-8c3b-4ce4-84aa-1c395ec2823a",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Mit dieser Episode starten wir mal ein neues Format. Dieses Format hat zum Ziel, allen Software Engineers mal ihren Impact vor Augen zu führen. Was meine ich damit? Ich finde, Softwareentwickler und Softwareentwicklerin zu sein, ist halt irgendwie von Haus aus ein total frustrierender Job. Du sitzt stundenlang meist vor einem schwarzen oder dunklen Screen, tippst da irgendwas ein, nach 3 Stunden Texteingabe drückst du auf compile ÿ und der Computer meckert dich an, Semikolon fehlt und du denkst dir so, wollt ihr mich eigentlich verarschen? Aber auf der anderen Seite gibt es dann noch andere Software Engineers, die bauen vielleicht den ganzen Tag nur irgendwelche Kontaktformulare. Was ich mit dieser Folge oder mit diesem Format mal bezwecken möchte, ist, dass wir Softwareentwickler und Softwareentwicklerinnen wirklich großes Zeug und großes Zeug im wahrsten Sinne des Wortes, wenn ihr weiter dran bleibt, bewegen können in der Welt. Mein Traum war mal ein Hackathon zu organisieren, wo du drei oder vier verschiedene Teams hast. Jeder kriegt eine Teilaufgabe, die müssen etwas programmieren, definiert den Input, definierten Output, so ganz klassisch nach Pflichten und Lastenheft und so weiter und so fort. Und dann geht man mit der ganzen Gruppe nach dem Hackathon vor die Tür. Da ist so ein riesengroßer Vorhang und der Wolfgang zieht diesen Vorhang weg. Und was steht da? Da steht eine mobile Schrottpresse.",
      "start": 80,
      "end": 78392,
      "confidence": 0.9063591,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist wieder typisch, dass ich nur den Vorhang vorziehen darf. Bin wieder nur für das grundlegende Zustände.",
      "start": 78456,
      "end": 83888,
      "confidence": 0.89377886,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du bist der Showmaster. Das ist ja nicht grundlegend.",
      "start": 83984,
      "end": 86548,
      "confidence": 0.90456444,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Achso, ich hab gedacht, das macht der große Thomas Grundwald.",
      "start": 86564,
      "end": 90724,
      "confidence": 0.903578,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Hör mal auf zu brabbeln. Lass uns zurück zu den Hackathon Teams kommen. Team Nr. Eins sieht zu, dass neben der mobilen Schrottpresse, da steht nämlich ein Auto, ein altes Auto, was verschrottet werden kann, was fahren kann. Team eins hat eine Software gebaut, was das Auto zur mobilen Schrottpresse fährt. Team zwei hat irgendwas gebaut, Ÿousand, was auf einen Knopf drückt auf die mobile Schrottpresse. Oder vielleicht haben wir auch das Glück, einen Raspberry Pi an die Schrottpresse anzuschließen. Auf jeden Fall, Team drei sieht zu, dass die Schrottpresse den Kran nimmt und das Auto in die Schrottpresse packt. Und Team vier drückt einfach oder beginnt den Schrottpressenprozess. Heißt das so? Ich weiß es nicht. Das fände ich mal so geil. Und um zu zeigen, was eure geschriebene Software denn wirklich in der realen Welt bewirken kann, fangen wir mit dieser Episode dieses neue Format an.",
      "start": 90852,
      "end": 141738,
      "confidence": 0.93328846,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und nachdem Schrottpressen und Autos zu klein waren für uns, haben wir gedacht, wir suchen was, was noch größer ist. Korrekt.",
      "start": 141834,
      "end": 148618,
      "confidence": 0.93183476,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Richtig, um die spiegel Dokumentation von YouTube zu zitieren. Wir kümmern uns heute um die dicken Pötte und zwar um Kreuzfahrtschiffe. Ich war zwar schon auf einem Kreuzfahrtschiff, aber ich habe noch nie ein Kreuzfahrtschiff gefahren oder habe noch nie für ein Kreuzfahrtschiff programmiert. Und deswegen haben wir uns jemanden eingeladen und ich bin sehr glücklich, dass diese Person dieser Einladung gefolgt ist. Hallo Sebastian, du hast nämlich schon mal für Kreuzfahrtschiffe programmiert, ist das richtig?",
      "start": 148754,
      "end": 175162,
      "confidence": 0.91915077,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, moin. Das ist korrekt. Ich habe jetzt 10 Jahre lang ungefähr für Kreuzfahrtschiffe, also für die Software an Bord gesorgt und entsprechend dann auch Software für Kreuzfahrtschiffe programmiert.",
      "start": 175266,
      "end": 187050,
      "confidence": 0.92740554,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du warst also sozusagen in der realen Welt für die großen Pötte zuständig, wenn man so möchte.",
      "start": 187170,
      "end": 191802,
      "confidence": 0.8909712,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Von den kleinen bis zu den ganz großen. Ja, aber die ganz großen sind wirklich groß.",
      "start": 191906,
      "end": 196342,
      "confidence": 0.9665375,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Bevor wir da einsteigen und klären, wie groß die dicken Pötte wirklich sind, mal ganz kurz, wer du eigentlich bist. Und jetzt kommt etwas, wo ich wirklich, wirklich, wirklich stolz drauf bin. Das sage ich nicht nur so, das meine ich wirklich so. Du bist Hörer der ersten H. Du hast uns im Vorgespräch gesagt, du bist bei Episode 10 eingestiegen. Das war im Mär. 2022 haben wir die Episode 10. Ÿousand veröffentlicht. Ich fühle mich ein bisschen beschämend, ich möchte glaube ich, nicht mehr reinhören. Aber da ging es damals um One on ones und du bist auf diesen Podcast aufgemerksam geworden, weil einer deiner Kollegen oder dein Vorgesetzter gesagt hat, hey, ich würde gerne One on One mit dir machen. Hör dir doch diese Podcast Episode an.",
      "start": 196486,
      "end": 233188,
      "confidence": 0.9186717,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist korrekt. Hier grüße an Uli, der mir damals gesagt hat, du, wir müssten mal One Once machen. Also es war ein Mitarbeiter von mir. Ich habe mir dann die Folge angehört und seitdem dann auch tatsächlich one ones eingeführt in dem Unternehmen. Und ich glaube, sie werden bis heute fortgeführt.",
      "start": 233244,
      "end": 245788,
      "confidence": 0.944714,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich finde, das hört sich so richtig an wie so eine schöne Story, weil das ist auch so Impact, was wir mit dem Podcast haben, weil das kriegt man ja so nicht mit. Wahnsinn.",
      "start": 245884,
      "end": 253372,
      "confidence": 0.98036,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also dann danken wir auch gleich mal Uli für das Weiterempfehlen und für das Anstoßen, dass da one on ones jetzt entstanden sind.",
      "start": 253476,
      "end": 260460,
      "confidence": 0.8546313,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber Sebastian, zurück zu dir. Du hast einen Dr. In Ingenieurswissenschaften an der von der Uni Bielefeld. Du bist aktiv bei den Pfadfindern, soweit ich das sehen konnte. Du bist groß im d Druck Game unterwegs. Also Ingenieurswissenschaften machst du auch als Hobby sozusagen gefühlt. Wenn du da mal ein paar CAD Zeichnungen. Sind das CAD Zeichnungen? Sind das CAD Konstrukte? Die du da baust und Drucks ja auch.",
      "start": 260620,
      "end": 283760,
      "confidence": 0.9047071,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also fertige Objekte und selber Design irgendwann dann auch angefangen.",
      "start": 283840,
      "end": 287224,
      "confidence": 0.909167,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du hast 10 Jahre bei Getslash gearbeitet. Das ist eine Firma, die unter anderem Software für Kreuzfahrtschiffe macht oder beziehungsweise Infotainment Software für Kreuzfahrtschiffe. Da reden wir gleich drüber. Aber inzwischen kümmerst du dich nicht um die großen Pötte, sondern eigentlich vielleicht eigentlich auch um die kleinen Pötte. Du bist nämlich Technical Project Lead bei Miele. Wer kennt sie nicht, die guten alten Waschmaschinen und Staubsauger. Das ist zumindest das, was ich noch von Miele kenne.",
      "start": 287352,
      "end": 311970,
      "confidence": 0.92443025,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, Waschmaschinen, Staubsauger. Ich selber bin gerade eher bei Dunstabzughauben, Kochmulden, also Kochfelder und Kaffeemaschinen im Einsatz. Konkret. Aber Waschmaschinen kommen auch vor.",
      "start": 312130,
      "end": 322242,
      "confidence": 0.878917,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Sind die jetzt auch schon smart alle?",
      "start": 322386,
      "end": 324090,
      "confidence": 0.9492729,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die sind alle smart, die sind alle verbunden mit dem Internet. Konkret bin ich nämlich auch in der App Abteilung von Miele und sorge eben dafür, dass alle Maschinen, die jetzt quasi hergestellt werden, mit der App Ÿousand bedienbar sind und dann eben auch den Mehrwert des IoTs genießen.",
      "start": 324210,
      "end": 338912,
      "confidence": 0.91902286,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also ich weiß nicht, ob meine Dunstabzugshaube eine App braucht, aber vielleicht bin ich auch einfach nur ein alter weißer Mann und weiß nicht, was ich damit bedienen soll.",
      "start": 339016,
      "end": 346688,
      "confidence": 0.96572584,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, bei den Abzaubern kann man vielleicht streiten. Bei den Waschmaschinen macht es Sinn, dass einfach z.B. dein Kind die Nachricht bekommt, wenn sie fertig ist, dann kann das einfach automatisch ausgeräumt werden. Das ist so ein bisschen Automatisierung auf persönlichem Level. Dazu nutze ich das zumindest.",
      "start": 346824,
      "end": 358740,
      "confidence": 0.9218436,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Moment, die Automatisierung besteht dann, dass das Kind die Waschmaschine ausräumt. Habe ich das richtig verstanden? Ah ja, das ist ja noch besser. Also das ist digitale und echte Welt verbinden und dann dadurch Automatisierung zu schaffen, ist noch smarter. Aber kommen wir zu den Kreuzfahrtschiffen zurück. Die Waschmaschinen werden zwar auch super interessant oder die Abzugshauben, aber wir müssen uns ja auf eine Thematik konzentrieren und fokussieren. Also bleiben wir mal bei den ganzen Schiffen. Wenn du so zurückdenkst, das waren ja mehr als 10 Jahren. Ich vermute, du hast auch irgendwie Kontakt mit den Schiffen an sich gehabt. Du bist nicht nur im Keller gesessen, wie Andy erwähnt hat, und hast an der Software geschraubt. Wenn du dich so zurückerinnerst, was war irgendwie die coolste oder schrägste Situation, wo du mal mit Schiffen zu tun gehabt hast in deinem Arbeitsumfeld?",
      "start": 359040,
      "end": 400478,
      "confidence": 0.9232828,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also für mich war immer das beeindruckendste, wenn man so ein Schiff betritt, was sich im Trockendock befindet. Also muss ich vorstellen, man macht ja irgendwie Software und dann muss diese Software irgendwie aufs Schiff. Dafür fährt man natürlich auch hin, also fahren manche von den Mitarbeitern hin, einfach um das zu betreuen. Und wenn man dann in dieses Trockendock geht mit seinem Bauhelm, Sicherheitsschuhen, Sicherheitsbrille, man geht unter dem Schiff her, also unter diesem riesigen Schiff, klettert dann so eine, naja, Bautreppe hoch und geht dann so auf, ich weiß es nicht, 1020 dreiig Metern Höhe in diesen Schiffsbauch rein, über so eine Planke, so wie man sich das vorstellt und hofft einfach, dass wir diese kleinen Holzblöcke unten unter dem Schiff halten, weil die sind doch relativ klein im Verhältnis zu diesen Riesenkahen. Und um einen rum wird halt geschweißt, gesägt, geschraubt. Also diese Sicherheitsbrille kann man anfangen belächeln, aber wenn man dann durch die Gänge geht und wirklich da gearbeitet wird, ich sag mal richtig gearbeitet wird, nicht nur mit Software zweitausendein, dann ist man doch ganz froh um die ganzen Sachen, die man da als Sicherheitsausrüstung bekommt.",
      "start": 400574,
      "end": 457032,
      "confidence": 0.917483,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Hattest du da so einen personalisierten Helm, so einen Helm mit deinem Namen oder sowas?",
      "start": 457136,
      "end": 461104,
      "confidence": 0.94777465,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich habe meinen Namen draufgeklebt. Also wir haben natürlich von der Firma welche gestellt bekommen. Ich habe dann einen Namen draufgeklebt, weil sonst verschwindet der auch mal, findet nicht so schnell wieder, weil alle haben halt diese Helme.",
      "start": 461192,
      "end": 469272,
      "confidence": 0.91105396,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ist das jetzt, was man öfters macht, kommt man da wirklich öfters mit Schiffen in Kontakt oder ist es eher so eine Seltenheit, dass man da einmal im Jahr vielleicht und wenn überhaupt mal irgendwo was sieht?",
      "start": 529336,
      "end": 538664,
      "confidence": 0.9459113,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Kommt ein bisschen natürlich auf die Stelle im Unternehmen an. Das muss dazu sagen, das Unternehmen ist massiv gewachsen, als sie angefangen hat, weil wir glaube ich zu 15 am Ende dreiig, 40, 50, weiß nicht wie es jetzt sind. Und am Anfang war natürlich jeder Mitarbeiter eigentlich bei jedem Schiff mit dabei. Ich meine, bei fünf Leuten ist die Wahl nicht so groß, wer hinfährt. Zwei gehen hin, zwei kommen noch nach und dann hat man relativ viel Kontakt. Am Ende hat man sich das natürlich aufgeteilt, gerade weil die auch weltweit einfach liegen in den Trockendocks und dann kommt man nicht mehr so oft in Kontakt. Aber wenn man sich freiwillig meldet, kommt man da auch hin.",
      "start": 538752,
      "end": 568292,
      "confidence": 0.9303237,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und warum musstest du jetzt auf das Schiff, wenn das Schiff im Trockendock liegt? Also ich meine, nur mal ganz kurz zum anschauen, was habt ihr da gemacht? Habt ihr da wirklich die, habt ihr eine CD in der Hand gehabt und ich, ich installiere jetzt die Software auf so ein und da geht so ein CD ROM Laufwerk auf und rein damit, oder?",
      "start": 568356,
      "end": 582100,
      "confidence": 0.9050441,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Da sieht man jetzt, dass du wirklich alt bist, Andi. CDs, hallo.",
      "start": 582560,
      "end": 585944,
      "confidence": 0.9337867,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wir reden von Schiffen.",
      "start": 586072,
      "end": 586832,
      "confidence": 0.990125,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wo bist du?",
      "start": 586856,
      "end": 587488,
      "confidence": 0.9193367,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, wir reden von Schiffen. Vielleicht müssen wir da einen Schritt zurückgehen. Wenn wir von Software auf Schiffen reden. Wir waren als unsere Firma verantwortlich für Infotainment. Das heißt, das ist die gesamte Software, die auf den Fernsehern läuft, die dafür sorgt, dass man ins Internet kommt. Also alles, womit der Gast direkt in Berührung kommt, entweder auf dem Gerät auf der Kabine, also dem Fernseher, den Digital Signages, die in den Fluren hängen oder aber auch die eigenen bring your own devices, das heißt Handy, Tablet, was man sonst so hat. Jetzt ist es so, dass so ein Schiff, das bestellt man bei einer Werft und sagt, ich hätte gern ein Schiff, dann baue die einem ein Schiff und bauen da auch schon Fernseher rein. Aber was sie nicht machen, sie installieren keine Software. Das heißt, die Fernseher müssen erst mal mit Software versorgt werden. Die Server stehen irgendwo im Serverraum, auch die müssen mit Software versorgt werden. Und grundsätzlich zweitausendein schmeißt man da kein LAN Kabel auf dieses Schiff oder man macht viel vor Ort, einfach weil Internet ist nur per Satellit vorhanden. Und so geht man eigentlich, wenn man gerade große Datenmengen hat, am Anfang selber einmal auf das Schiff drauf mit seiner Crew, hat noch Monteure mit dabei, die nachher durch jede Kabine rennen und die Fernseher passend einstellen und verbringt dann typischerweise ein bis zwei Wochen auf diesem Schiff, um die gesamte Software zu installieren, zum Laufen zu bringen, Netzwerkprobleme auszuräumen und auch ganz die ganze drittanbieter Software mit anzubinden. Das ist also wirklich Handarbeit und ja nicht CDs, aber USB Sticks.",
      "start": 587584,
      "end": 663914,
      "confidence": 0.9122798,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe schon so viele Fragen, aber lass uns noch mal einen ganz kurzen Schritt zurückgehen, weil du hast gesagt, du hast dich um die kleinen Pötte und um die ganz großen gekümmert. Von welcher Art von Schiffen sprechen wir? Sprechen wir hier von Wolfgangs privatem 10 Mann Katamaran oder sprechen wir hier von der Ever Given, die sich im Suezkanal einmal quer gestellt hat? Also von von welcher Art von, ich weiß nicht, ob Kreuz, ob Logistikschiffe bzw. Containerschiffe auch Infotainment Systeme haben. Keine Ahnung, kenne ich mich zu wenig aus. Also von welchen Schiffen sprechen wir hier?",
      "start": 664042,
      "end": 692270,
      "confidence": 0.91202444,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also wir sprechen grundsätzlich von Kreuzfahrtschiffen, das heißt, es sind immer Gäste an Bord. Es geht nicht um Containerschiffe, es geht nicht um private Schiffe, es geht wirklich um die Schiffe, wo man als Gast sich wie in einem Hotel einbuchen kann, um dann seinen Traumurlaub dort irgendwie zu verbringen. Das fängt an bei ganz kleinen. Also es gibt so kleine Flusskreuzfahrtschiffe, die fahren ja so rhein, main oder hoch und runter. Das sind glaube es fängt so an mit 100 Gästen, also ist wirklich klein und gemütlich. Die müssen, dürfen auch nicht so lang sein, sonst kommen sie nicht um die Kurven und dürfen nicht so hoch sein, sonst kommen sie nicht unter die Brücke. Manchmal sieht man bei YouTube wieder Videos, dass der Kapitän seine Höhe unterschätzt hat und dann da hängen bleibt. Und das geht aber weiter bis zu den ganz, ganz großen, also die man so, ja, wenn man die irgendwo sieht. NCL hat wirklich große Schiffe mit zum nachgucken. Ich hatte, das größte, was wir hatten, waren glaube ich dreieinhalbtausend bis 4000 Passagiere. Und dazwischen liegen dann, vielleicht besser bekannt in Deutschland, diese Tui Mind Schiffe, das sind so Mittelklasse, das sind so 2000, 2500 Passagiere, die an Bord sind.",
      "start": 692370,
      "end": 750734,
      "confidence": 0.92072934,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Mein Schiff ist so ähnlich sowas wie AIDA und so, ne?",
      "start": 750922,
      "end": 753310,
      "confidence": 0.9158273,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, okay.",
      "start": 753350,
      "end": 754350,
      "confidence": 0.99025,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich bin im ganzen Business nicht so drin, wie ihr merkt, aber Okay. Und jetzt hattest du gesagt, du oder ihr habt euch primär um Infotainment Systeme gekümmert. Kannst du uns mal einen Überblick geben, welche IT Systeme überhaupt auf so einem Schiff vorhanden sind? Klar, das Ding hat einen riesen Dieselmotor, aber da muss ja auch Software gesteuert sein für, weiß ich nicht, gibt es da vielleicht ein Sonar und so weiter?",
      "start": 754470,
      "end": 772782,
      "confidence": 0.923347,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das fängt bei den Kreuzerschild damit an, dass sie eigentlich komplett autark sind. Heißt, die bringen alles mit, was man irgendwie, sag ich mal, aus dem Internet kennt. Die müssen natürlich irgendwie Infrastruktur bereitstellen, das heißt Netzwerkkabel, Switches, Serverräume, unabhängige Stromversorgung und den ganzen Kram. Das heißt, es gibt normalerweise ein bis zwei Serverräume, die sind aus Redundanzgründen einfach eingerichtet bei den großen Schiffen. Auf kleinen Schiffen kann das auch mal eine Abstellkammer sein, wo ein Rack drin steht. Und dann gibt es an Software einmal die ganze Marine IT, also alles was sich darum kümmert, dass so ein Schiff fährt. Da muss man wissen, es gibt nicht mehr so dieses große Steuerrad, was mit so einem Kabel hinten das Ruder irgendwie nach links und rechts dreht. Tatsächlich haben aktuelle Schiffe gar kein Steuerrad mehr. Ich weiß von einem Kapitän, dass er sich nachträglich eins einbauen lassen hat, weil er nicht ohne fahren wollte. Die werden also auf Knopfdruck und mit Computern gesteuert. Dann gibt es die ganze Security Infrastruktur an Bord, also Überwachungskameras, alles was so dazu gehört. Dann ist das ja ein schwimmender Hotelbetrieb, also alles was im Hotel ist, mit Ÿousand Buchungen, mit Landausflügen, mit Restaurants, das muss ja auch alles auf diesem Schiff sein, weil wir sprechen von einem schwimmenden Hotel. Das heißt, man hat die Hotel IT mit der Touristik und dann hat man natürlich noch, weil die ganzen Gäste belustigt werden wollen, so eine ganze Armada von Showsystemen dort, dass man wir haben ja Bühnen an Bord, die haben Theater an Bord, sie haben öffentliche Bereiche und wenn dann die Bowlingbahn irgendwie noch Fernseher braucht, dann ist da noch so ganze, die ganze Showsysteme dort, die alle bespielt werden mit ich glaube AIDA hat eigene Fernsehprogramme, die sie an Bord produzieren und so weiter und so fort. Und unser Teil ist tatsächlich noch mal ein anderer. Das ist wie gesagt dieser Infotainment Bereich, das ist, womit der Gast direkt in Berührung kommt. Das prominenteste Beispiel ist der Fernseher, der in der Kabine hängt. Wenn ich als Gast auf so meine Kabine komme und den Fernseher anschalte, dann steht er zuerst hey, hallo, willkommen Sebastian, schön, dass du da bei uns bist. Dein Captain ist, keine Ahnung, Hans Kunz, ich weiß es nicht. Das heißt, man wird dort begrüßt. Diese ganzen Systeme sind angeschlossen an die Hotelsysteme und man kann dort, ähnlich wie ihr es von Amazon Prime oder Netflix kennt, halt Videos angucken, irgendwie Musik hören, aber auch dann kreuzfahrtspezifische Sachen angucken. Z.B. die Seekarte ist ein ganz beliebte Sache, dass man sieht, wo ist das Schiff gerade und was ist um mich rum und was ist der nächste Hafen? Es geht um die Reise, Reiseverlauf, also was ist der nächste Hafen, wie ist das Wetter am nächsten Hafen? Auch ganz Riesenthema, weil man muss sich ja vorbereiten auf seinen Landausflug, bis hin dazu, dass man sich irgendwelche Tickets buchen kann oder einfach nur in sein Bordkonto, was habe ich schon ausgegeben? Weil typischerweise an Bord handelt man nicht mal mit Euro Scheinen, sondern hat halt so ein Bordkonto, da wird alles draufgebucht und am Ende muss man dieses Bordkonto begleichen. Das heißt, alles das, wo der Gast direkt mit in Berührung kommt, das haben wir programmiert. Das Ganze nicht nur auf dem Fernseher, sondern eben auch auf dem eigenen Handy, was man natürlich inzwischen dabei hat oder Tablet und was auch dann in den Gängen steht, diese Digital Signages, wo dann auch wieder Werbung gemacht wird oder einfach Deckpläne angezeigt werden. Das gehört quasi alles zu diesen guest facing Interaktionspunkten, die wir dort haben.",
      "start": 772886,
      "end": 950974,
      "confidence": 0.91923314,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das bedeutet, ich kann mir auch aus der Kabine irgendwie einen Tisch im Restaurant reservieren?",
      "start": 951022,
      "end": 954180,
      "confidence": 0.90748733,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, auf dem Fernseher mit deiner Fernbedienung.",
      "start": 954310,
      "end": 956944,
      "confidence": 0.8713943,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und du sagtest auch gerade, dass man dann irgendwie auf sein Schiffskonto gucken kann, wie viel Geld ich schon ausgegeben habe. Das bedeutet ja eigentlich, dass euer System Schnittstellen zu anderen Firmen oder zu anderen Software Systemen braucht, weil ihr ja, z.b. das Geldmanagement aus Bezahlmanagement in den Restaurants ja nicht macht, oder?",
      "start": 957032,
      "end": 972400,
      "confidence": 0.91538453,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Korrekt. Wir haben uns nie darum gekümmert, selber abzurechnen, weil dann bräuchte man auch irgendwelche, muss man lizenziert sein, bräuchte irgendwelche Bescheinigungen, was auch immer. Das haben die aber typischerweise an Bord und das ist dann das zentrale PMS System, also Property Management System, wo dann alle Daten zusammenfließen. Das sind die Gastdaten, also wer bist du, wie heißt du, wo wohnst du, teilweise auch hast du vor kurzem geheiratet, damit dich der Rezeptionist direkt empfangen kann, auf welcher Kabine wohnst du, wer ist noch mit auf deiner Kabine, welchen Status hast du vielleicht, aber auch alles, was rund um deine Reise ist, also wie viel Geld hast du schon ausgegeben, wo hast du es einen Restaurantplatz gebucht und ja, alles, was man so auf diesem Schiff und von diesem Schiff organisiert machen kann.",
      "start": 972520,
      "end": 1015364,
      "confidence": 0.9249718,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt gehe ich davon aus, dass im Infotainment Bereich es mehrere Player auf dem Markt gibt, die das machen, was ihr tut. Und dann gehe ich natürlich auf der anderen Seite auch davon aus, dass das PMS, das Kundenmanagement System und allem drum und dran auch, dass da mehrere Player sind. Das bedeutet, entweder gibt es da einen globalen schiffskunden Austausch Standard oder ihr habt wirklich komplett proprietäre APIs mit allen PMS Systemen eingebaut. Ist das korrekt?",
      "start": 1015412,
      "end": 1041472,
      "confidence": 0.90672314,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Zweiteres, wir haben uns selber zu diesem Schiffsstandard gemacht, weil wir gemerkt haben, dass einmal müssen wir es eh machen, weil so ein Schiff ist ein Sammelsurium aus verschiedenen Softwareanbietern und jedes Mal ist es ein anderer, weil natürlich jede Reederei irgendwelche Vorlieben hat, welche Software sie einsetzt oder teilweise eigene einsetzt. Und wir haben das tatsächlich zum Geschäftsmodell gemacht und gesagt, wir sind die Middleware auf dem Schiff und jeder, der neu dazu kommt, kann sich eben auch an unsere Mittelwehr anschließen und muss nicht diese proprietäre, also unsere ist auch proprietär, aber er muss zumindest nicht die andere proprietäre API anbinden, was zum Vorteil hat, dass wir Sachen einfach vereinheitlichen können.",
      "start": 1041576,
      "end": 1077232,
      "confidence": 0.89627427,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das klingt schon sehr danach, als wäre das so eine ganz eigene Welt, also die dann irgendwie abgekapselt ist von der restlichen Welt, weil die stellen mir das ja auch so vor, dass ich da jetzt nicht direkt eine ganz normale Internetadresse abrufen kann oder vielleicht schon, keine Ahnung, ist es dann irgendwie was lokales, gibt es da lokale Domains Auflösung an Bord, weil es kann nicht jeder, also es wird ja nicht jeder Request wahrscheinlich durchs Internet geleitet, wie es ja sonst üblich wäre eigentlich bei so einem System.",
      "start": 1077416,
      "end": 1104424,
      "confidence": 0.90877265,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, Internet ist das spannende Thema. Internet ist quasi nicht vorhanden, kann man erstmal von ausgehen. Man muss sich vorstellen, dass selbst große Schiffe mit tausenden von Gästen Internetanbindung haben. Ich glaube wir reden von 50 bis 100 Mbit. Also das ist so die Ansage mit 1000 Gästen plus der gesamten Crew, die natürlich auch an Bord Internet benutzt. Für ihre normalen Aufgaben ist Internet an Bord erstmal nicht gegeben. Davon sind wir immer ausgegangen. Das heißt, alle Systeme an Bord funktionieren auch ohne Internet. Das ist ein ganz, ganz wichtige Sache. Wenn wir jetzt noch gerade mal zurückdenkt an die Seekarte, das heißt auch das gesamte Kartenmaterial von der gesamten Welt ist an Bord. Wir können nicht Google Maps nehmen, wir können keine Tiles nachladen, wir haben die gesamte Seekarte mit an Bord, was man sonst so gewöhnt ist, dass man einfach dann nur den Bereich anguckt, den man möchte, den lädt man gerade runter, das ist alles lokal gehostet und funktioniert auch alles immer noch, wenn kein Internet da ist. Das gilt auch für alle anderen Dienste, das heißt auch alle lokalen Abrechnungsdienste, Restaurantbuchungsdienste, Fernsehshows, Video on Demand, Audio on demand ist alles lokal in den Rechenzentren vor Ort, weil eben das Internet nur über Satellit typischerweise hergestellt wird und diese Verbindung A sehr langsam und b auch nicht sehr zuverlässig ist.",
      "start": 1104512,
      "end": 1175072,
      "confidence": 0.9255793,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber du hast jetzt auch erwähnt, bring your own device zweitausendein, verwende jetzt mein Handy und will da auf irgendeinen Dienst zugreifen, dann funktioniert das ja wahrscheinlich auch über einen browser Großteils, oder?",
      "start": 1175256,
      "end": 1185398,
      "confidence": 0.8908103,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau. Also du hast ein Intranet, vielleicht kann man es am besten mit einer großen LAN Party. Ich weiß nicht, die, die LAN Partys gemacht haben, dort gab es immer Intranets. Ich meine, das sind in den Folgen schon ein paar mal vorgekommen mit irgendwelchen Buchungssystemen für Wettkämpfe oder sonst was. Zumindest kenne ich das noch. Auf einer LAN Party hatte man einen lokalen Webserver, wo man halt sich dann melden konnte. Damals waren LAN Partys noch ohne Internet und vielleicht ist das so die moderne große LAN Party, wo eben auch noch alles erstmal lokal funktioniert. Es gibt dann lokale URLs, die man aufruft, wo man dann eben auf das Onboard Portal geleitet wird mit seinem Handy. Also sobald du dich in das WLAN anmeldest, kommst du ein sogenanntes captive Portal. Das ist ein mehr oder weniger Standard, wie man es auf manchen Cafés auch kennt oder Hotels, dass man erstmal eingefangen wird und dann auf so eine Startseite geleitet wird. Und auch von dieser Startseite kommt man eben weiter erstmal zu den ganzen internen Diensten oder wenn man möchte auch zu bezahltem Internet. Dann kommt man quasi raus aus diesem Captive Portal, was auch Teil Ÿousand unserer.",
      "start": 1185494,
      "end": 1238288,
      "confidence": 0.90537864,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Gesamtlösung war ganz kurz, Internet bedeutet eigentlich, ihr habt irgendwie Satelliten Internet, das Starlink von Elon Musk oder ähnlich zur Verfügung?",
      "start": 1238344,
      "end": 1248752,
      "confidence": 0.85987717,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also zu den Zeiten, wo ich dort, also vor ein, zwei Jahren, wo ich dort noch gearbeitet habe, war Starlink noch nicht für Schiffe freigegeben. Das ist jetzt relativ neu, dass Starlink gerade kommt. Für die Schiffe davor reden wir von, ich sag mal, richtigem Satellitenternet, also von den geostationären Satelliten. Das heißt, auch wenn man ein bisschen, ich bin nicht gut in Physik, aber so ein bisschen Physik hatte ich. Allein durch die Lichtgeschwindigkeit redet man von Pingzeiten von 500 Millisekunden. Das ist zum Spielen total ungeeignet, zum Video gucken noch okay. Und auf eine Webseite wartet man manchmal 5 s. Man merkt auf jeden Fall in dem Moment auf dem Schiff, wer seine Webseiten optimiert hat und wenn nicht, PS Google hat sie massiv optimiert, die funktionen immer noch richtig gut, während andere Webseiten dann gar nicht mehr funktionieren bei schlechtem Internet.",
      "start": 1248856,
      "end": 1286148,
      "confidence": 0.9244003,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und die Bandbreite hast du ja genauso begrenzt bei Starlink. Also du hast ja trotzdem nur deine, keine Ahnung, 100 Mbit oder so, es wird ja deswegen nicht automatisch mehr.",
      "start": 1286244,
      "end": 1294378,
      "confidence": 0.8656113,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, glaube die sind einfach dazu hingegangen, einfach 10 Starlink Satelliten dahinter Antennen hinzustellen. Und Starlink hat eine Latenz von unter 50 Millisekunden, die haben tieffliegende Satelliten. Also man ist, also Starlink, soweit ich die Erfahrung kenne von Kollegen, sagen die, das ist normales Internet. Also vielleicht nicht zum zocken, aber zum Surfen merkt man den Unterschied nicht. Richtiges Satelliten Internet merkt man deutlich den Unterschied.",
      "start": 1294524,
      "end": 1317894,
      "confidence": 0.90666395,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "An alle Firmen, die ihre Webseite optimieren und die noch Tester suchen, ich stelle mich gerne zur Verfügung, um auf Kreuzfahrtschiffen ihre Webseite zweitausendein für sie zu testen. Gar kein Problem. Meine Kontaktdaten finden sie in den Shownotes.",
      "start": 1318022,
      "end": 1330120,
      "confidence": 0.9023129,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das heißt, du wirst auf Kreuzfahrtschiffe gehen, Andi, jetzt redest du so gescheit, wenn dann irgendwelche Angebote kommen, dann wirst du wieder nur da in deinem Duisburg rumhängen. Kenn ich.",
      "start": 1330780,
      "end": 1339364,
      "confidence": 0.83597434,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Stell mir das schon spannend vor.",
      "start": 1339532,
      "end": 1340972,
      "confidence": 0.94295335,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber nun gut, es gibt schlimmere Arbeitsorte, kann ich zugeben.",
      "start": 1341036,
      "end": 1344804,
      "confidence": 0.959109,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also hast du selber mal eigentlich eine klassische Kreuzfahrt gemacht oder bist du immer nur beruflich auf den Schiffen unterwegs gewesen?",
      "start": 1344932,
      "end": 1352136,
      "confidence": 0.91683716,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Privat war ich nie auf einem Kreuzfahrtschiff, immer nur beruflich, weil privat zieht es mich eher in Richtung Wandern, Aktivurlaub. Ich kann mir das nicht vorstellen, da zwei Wochen nichts zu tun oder mich umherkutschieren zu lassen. Deswegen war ich tatsächlich nur beruflich auf Kreuzfahrtschiffen. Wir als Drittanbieter sind immer Gäste gewesen auf dem Schiff. Das hat den großen Vorteil, man ist in Gastkabinen untergebracht, nicht in Kuhkabinen. Man darf die öffentlichen Bereiche besuchen, man darf quasi sich verhalten wie ein Gast an Bord, mit allen Annehmlichkeiten, die dabei kommen, mit Restaurantbesuchen bis zu, ich nenne es mal Go Kart File, weil wir mussten ja die Buchung testen.",
      "start": 1352228,
      "end": 1385004,
      "confidence": 0.93738586,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das heißt aber, man ist nicht nur immer in den Trockentocs unterwegs, sondern fährt da auch mal einfach mit.",
      "start": 1385092,
      "end": 1390700,
      "confidence": 0.9001716,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, also grundsätzlich, wenn die ganze Software installiert ist, dann muss sie auch an Bord bedient werden, weil die sind erstmal auf sich gestellt. Es gibt eine IT an Bord bzw. Die ganze Touristik muss ja auch die ganz Buchensysteme bedienen können oder Content Management Systeme bedienen können. Was wir immer angeboten haben, was auch wirklich, glaube ich, für die Crew ganz wichtig ist, dass die erste Reise mit Gästen eines Schiffes nach dem Umbau von uns begleitet wird. Das heißt, man sagt, die erste Woche sind wir mit an Bord, wir gucken dir über die Schulter, wir zeigen dir, was passiert, was machst du, wenn ein Fernseher nicht mehr geht, was machst du, wenn irgendwas geändert werden muss, was passiert, wenn das Internet ausfällt, einfach um da zu sein. Und es hat sich einfach auch gezeigt, dass vorher sind alle Fragen geklärt, alles kein Problem. Wenn sie dann aber auf See sind und auf einmal der Druck entsteht, dass da 10 Gäste vor der Rezeption stehen, die alle sich beschweren, weil sie Internet gekauft haben und irgendwelche Probleme haben, hat sie sich einfach bewährt. Wenn ein Mitarbeiter von nebensteht und ganz schnell sagen kann, das lösen wir jetzt hier, lösen wir da, das können wir umbuchen, hier können wir schnell was ändern. Das ist quasi das Service Angebot, was wir mit angeboten haben. Und das ist dann wirklich auch eine Gästereise am Ende. Das ist die erste Reise des Schiffes, die machen Gäste auch mit und da ist man ganz normal Gast mit an Bord, muss natürlich arbeiten, je nachdem wie gut man alles vorbereitet hat, mehr oder weniger.",
      "start": 1390780,
      "end": 1462116,
      "confidence": 0.9263624,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt klingt das für mich alles sehr nach ganz klassischer, traditioneller Industrie, auch was man so aus dem Autobau kennt oder so. Und es klingt alles nicht sehr agil. Ÿousand gibt es da irgendwelche Auswirkungen auf die Softwareentwicklung, dass das viel mehr wasserfallorientiert dann auch abläuft, weil man eben diese Deadline hat, wenn das Schiff noch im Trocken Dock ist, dass man dann alles klärt, bevor es ausläuft und so weiter. Also merkst du da dann irgendwelche Auswirkungen auch auf der Software Seite, dass du diese ganzen Einschränkungen hast?",
      "start": 1462308,
      "end": 1491354,
      "confidence": 0.88744676,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also der Bau eines Kreuzfahrtschiffes ist nicht agil, das ist ein Wasserfallprojekt, da steht ganz genau fest, wann dieses Schiff das Dock verlässt, wann dieses Schiff die Werft verlässt, wann es fertig ist, wann es übergeben wird. Zweitausendein, da muss man sich nichts vormachen. Wer meint, dass er da agil, mit agilen Methoden was bewirken kann, der wird sehr schnell auf die Grenzen stoßen, weil jeder Tag im Dock, jeder Tag in der Werft kostet einfach hunderttausende Millionen von Euro. Und wenn man dann als Dienstleister sagt, ja, aber unsere Software will noch nicht, dann wird man sehr schnell hinzitiert und kann das vor Ort lösen. Ein Kunde hat immer gesagt, für euch haben wir immer eine Kabine frei, so lange bis es läuft, das ist gar kein Problem. Die Welt ist aber ja geteilt. Auf der einen Seite kann man sich als Firma aber auch hinsetzen und sagen, grundsätzlich unsere Feature Entwicklung, die machen wir agil. Das heißt, als Firma haben wir ja nicht nur angeboten. Die Software, die wir angeboten haben, ist eine sogenannte White Label Lösung. Die hat erstmal Features an sich. Das heißt, wir bieten jedem Kunden an, aus unserem Katalog auszuwä möchtest du Video on Demand, dann klick hier. Möchtest du Audio on demand, möchtest du eine Seekarte, möchtest du das Bordkonto? So ein bisschen so ein Modulbaukasten, so wie man das vielleicht von WordPress kennt, mit seinen Plugins. Und der Kunde wählt daraus aus, was für ihn passt, was er seinen Kunden anbieten will. Und dann geht es in so einen Spezialisierungs Workshop, wo wir mit dem Kunden zusammen das CI übertragen auf unsere Software Vorgänge anpassen. Vielleicht hat der eine Kunde noch ein Rewardsystem, wo irgendwie dann beim Willkommensbildschirm eine goldene Krone angezeigt werden soll, weil das ein besonderer Kunde ist, der in dieser Kabine ist oder weil besondere Kabinen, die besonders teuer sind, sich ein bisschen anders anfühlen sollen im Infotainment. Das heißt, man arbeitet mit dem Kunden dann darauf hin, dass unser System angepasst wird an den Kunden, weil am Ende soll man nicht mehr merken, dass es ein System von der Stange ist. Was es aber im Hintergrund schon ist, weil wir entwickeln die Feature nicht immer nur für einen Kunden. Unser Credo war schon, Features entwickeln wir für alle, alles andere sind dann Change Requests und lassen wir uns entsprechend bezahlen.",
      "start": 1491442,
      "end": 1602926,
      "confidence": 0.93060213,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es hat ja jeder Arbeitsbereich oder jede Domäne ihre eigenen Herausforderungen. Und mich würde mal interessieren, welche besonderen Herausforderungen gibt es bei Software und bei dem Betrieb auf See denn auf See, auf den Weltmeeren vielleicht? See hört sich so an, als würde ich es auf den Gardasee irgendwie schippen, aber was würdest du sagen, das ist schon eine einzigartige Herausforderung für eine Infotainment Software auf einem der dicken Pötte?",
      "start": 1602998,
      "end": 1630648,
      "confidence": 0.8748826,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Der große Unterschied zu jeglicher anderer Software ist, dass sich Software auf Kreuzfahrtschiffen bewegt, und zwar physikalisch. Also der Ort, wo sich diese Software befindet, ändert sich. Das klingt vielleicht erstmal nicht so schlimm, aber dann kommen Dinge wie Zeitzonen ins Spiel. Zeitzonen sind meiner Meinung nach immer noch der Endgegner der Informatik, weil jeder, der behauptet, dass er Zeitzonen wirklich verstanden hat, den stelle ich gerne auf die Probe und nenne zwei, drei Beispiele, wo man dann ins Grübeln kommt, ob man es wirklich verstanden hat. Es fängt damit an, dass Zeitzonen nicht von -12 bis plus 12 gehen, sondern ich glaube von -12 bis vierzehnte. Das Heißt, wir haben da ein bisschen Overlap am Ende wegen Sommerzeit und einzelnen Inseln, die sich gedacht haben, wir sind lieber 1 Stunde in der Zukunft. Das geht weiter damit, dass Zeitzonen politisch sind. Das heißt, sie hängen gar nicht an dem Ort. Jeder kann in seinem Land entscheiden, welche Zeitzone dort herrscht. Das heißt, wenn Deutschland sagt, wir wollen jetzt in sechs sein, dann sind wir im plus sechs. Das ist also eine reine Willkür der Regierung. Ÿousand Zeitzonen. Man hat sich so ein bisschen darauf geeinigt, dass das ungefähr passt mit dem, wo man sich gerade befindet. Und als so ein Schiff fährt man ja, während man sich übers Meer bewegt, durch diese Zeitzonen. Und tatsächlich entscheidet der Kapitän, in welcher Zeitzone man gerade ist. Der sagt seine IT heute Nacht stellen wir um von minus drei auf minus zweite. So, und dann geht die IT nachts hin, stellt alle Systeme um, man kriegt das auf so einer Master Clock mit. Da wird einem gesagt, jetzt ist andere Zeitzone zweitausendein und man muss irgendwie damit umgehen.",
      "start": 1630744,
      "end": 1715902,
      "confidence": 0.9180044,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ist es ein eigenes Service? Also oder ist das ein klassischer NTP Dienst oder ist das dann wirklich was customized?",
      "start": 1715966,
      "end": 1723046,
      "confidence": 0.8170445,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Customized ist jetzt wieder für Kreuzfahrtschiffe oder für Schiffe generell, gibt es einfach die sogenannte Master Clock, die sagt eben an, welche Uhrzeit ist und in welcher Zeitzone man gerade ist. NTP ist es nicht unbedingt, weil NTP. Ich glaube in der Folge, wir hatten keine Zeitzonen bei NTP, soweit ich weiß. Das interessiert NTP nicht, deswegen kann man es damit nicht so richtig machen. Aber diese Master Clock sagt eben allen Systemen an Bord, in welcher Zeitzone sich das Schiff gerade befindet. Und jetzt kommt als Besonderheit dazu, dass manche Systeme oder manche Firmen von diesen Anbietern, die auch auf diesem Schiff sind, die wir mit anbinden, gedacht haben, das ist uns so kompliziert. Wir machen Zeitzonen, lose Zeiten. Die sagen einfach, wenn 12 Uhr Landgang ist, ist 12 Uhr Landgang. Ihr wisst schon, was wann 12 Uhr ist. So, dann sitzen wir wieder dort mit einem Zeitzonen behafteten System und müssen irgendwie rumrechnen. Wann ist denn 12 Uhr? Beispiel Wecker, ich will um 6 Uhr geweckt werden. Ist das 6 Uhr alte Zeit, neue Zeit? Was passiert, wenn der Captain der Nacht das doch nicht entscheidet? Das sind so die spannenden Fragen, die auf einmal anfangen, weil man ein Feature von dem Fernseher ist, dass der angeht und dich mit einer lustigen Melodie weckt irgendwie. Weil an Bord deine Uhr kann man eigentlich vergessen, du hast keine Lust, dein Handy immer umzustellen. Man lässt das eigentlich in der Zeit, tut es eh in den Safe und dann verlässt man sich auf die Uhrzeit eben auf dem Boardportal. Deswegen hat unsere Webseite auch immer eine kleine Uhrzeit oben gehabt, obwohl es eigentlich redundant ist. Zweitausendein und der Fernseher auch, weil eben diese Bordzeit immens wichtig ist, weil alles läuft nach Bordzeit. Restaurantszeiten, irgendwie Aktivitäten an Bord, Landausflüge, alles ist Bordzeit.",
      "start": 1723118,
      "end": 1807116,
      "confidence": 0.90396935,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was hat das für einen Grund, dass der Kapitän die Zeitzone unabhängig vom Standort des Schiffes bestimmen kann?",
      "start": 1807268,
      "end": 1814492,
      "confidence": 0.9258722,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also grundsätzlich bestimmt der Kapitän alles an Bord. Vielleicht ist das auch so eine Seemannsfrage, ich weiß es nicht. Er macht es natürlich anhand der ungefähr der des Ortes, aber wenn er wollte, könnte auch entscheiden, bei seiner mehrtägigen Reise, wo man nicht an Land kommt, könnte man die Zeitzone auch zwei Tage lang einfach lassen und am letzten Tag 2 Stunden springen. Das ist grundsätzlich möglich, weil es macht für dich an Bord keinen Unterschied, weil du lebst ja in einem geschlossenen System und wenn du keinen Kontakt zur Außenwelt hast, ist es einem Menschen völlig egal, in welcher Zeitzone lebt. Das ist ja nur, weil wir mit einem bestehenden System, in diesem Fall Häfen, interagieren wollen. Und da wäre es blöd, wenn wir in einer anderen Zeitzone vom Schiff kommen, als wir im Hafen kommen. Deswegen sorgt der Kapitän dafür immer, dass spätestens wenn man im Hafen ankommt, man sich in derselben Zeitzone befindet wie das. Ja, wie die Örtlichkeit.",
      "start": 1814596,
      "end": 1858138,
      "confidence": 0.92927754,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und du hast natürlich auch noch die Sonne, die in irgendeiner Form mit reinspielt, oder? Du wirst es ja so ungefähr synchron halten. Aber es gibt ja auf dem Meer auch keine definierten Zeitzonen grundsätzlich, oder?",
      "start": 1858274,
      "end": 1869642,
      "confidence": 0.93756473,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich glaube nicht. Ich glaube, es wird einfach nur eine gerade Linie nach unten gezogen. Also bei Inseln wird ein bisschen drumherum gemalt, glaube ich, wenn ich jetzt das Bild richtig in Erinnerung habe. Und der Kapitän hält sich da schon grob dran, aber es ist halt, es ist nicht vorgegeben. Also Zeitzonen sind nicht vorgegeben von irgendwem. Das ist immer eine lokale Entscheidung, sowohl bei Ländern als auch eben auf dem Schiff dann.",
      "start": 1869746,
      "end": 1889346,
      "confidence": 0.91700894,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es gibt ja auch so Länder wie China, die einfach nur eine Zeitzone haben, die sagen, überall ist dieselbe Zeit. Obwohl China jetzt nicht so das kleine Land ist.",
      "start": 1889378,
      "end": 1896714,
      "confidence": 0.94347894,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau. Und dann kommt ja noch dazu, manche Länder machen so Zeitzonen wie 10, 1/4, oder man muss nicht volle Stunden haben, ist auch ganz spannend in der Softwareentwicklung. Das sind Zeitzonen, stellt man in Sekunden ein oder halt Millisekunden, kleinste Einheit, nicht in Stunden. Das ist auch eine Sache, die man irgendwann dann merkt, wenn auf einmal so ein Schiff in der Zeitzone, keine Ahnung, 10 dreiviertel ist. Und Zeitzonen ändern sich mehrfach im Jahr. Es gibt eine Mailingliste, glaube ich, wo das immer veröffentlicht wird. Man sieht das unter Linux, wenn man Zeitzonen, TZ Data heißt es glaube ich, Das Paket, wenn man ein Update bekommt, teilweise vier, fünf mal im Jahr ändern sich Zeitzonen, wenn irgendwelche Länder beschließen, z.B. keine Winterzeit mehr zu machen oder Ÿousand, ja, andere sich einfach mal aus ihrer Zeitzone wegbewegen wollen.",
      "start": 1896802,
      "end": 1938000,
      "confidence": 0.90033233,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wie läuft es in der Praxis jetzt wirklich ab, diese Master Clock? Ist es, ist es was physikalisches? Gibt es da eine HTTP API, die einfach abfragen kann? Also wie funktioniert das dann wirklich in der Praxis?",
      "start": 1938160,
      "end": 1949832,
      "confidence": 0.87906474,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genauso, man hat eine API, die man abfragen kann. Das macht man mehrmals pro h oder pro Min, je nachdem wie genau man das braucht. Typischerweise kann man kurz vor und nach der vollen H anfragen, auch wie wenn man zu Hause die Zeit umstellt. An Bord wird auch zu einer Stunde volle h die Zeit umgestellt, einfach um es allen leichter zu machen. Die Gäste kriegen auch meistens einen netten Zettel auf ihr Bett gelegt, irgendwie, wo dann steht, Achtung, morgen hat sich alles ein bisschen verschoben und dann stellen sich halt alle Systeme um. Bei uns werden dann alle Wecker neu gestellt natürlich entsprechend. Aber wo das Ganze dann nämlich noch richtig spannend wird, was ist denn die Zeitzone in fünf Tagen? Weil ich bin in fünf Tagen fünf Häfen weiter, das heißt, ich muss auch dort schon gucken, in welcher Zeitzone wird der Hafen sein, an dem ich in fünf Tagen bin, damit ich die Uhrzeit für den Landausflug richtig anzeigen kann, wenn er nicht in lokaler Zeit gespeichert ist. Und jetzt kommt man vielleicht auf die Idee, warum es doch nicht so schlecht ist, lokale Zeiten zu speichern und sagen, Zeitzonen interessieren uns nicht. Alle Gäste verlassen um 12 das Schiff, weil da muss man sich diesen ganzen Problem nicht rumschlagen.",
      "start": 1949936,
      "end": 2006812,
      "confidence": 0.9377968,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, ich wollte gerade fragen, wenn du doch sowieso eine, ich sag mal, bestimmte Zeitzone hast und der Kapitän setzt sie fest und ihr selbst, wie du sagtest, ihr lebt in einem geschlossenen System, hört sich an wie bei Fallout, so nach dem Motto, irgendwie, wer die Sendung oder die Serie noch nicht kennt, die leben in so einem Silo. Aber dann ist es doch eigentlich einfacher, komplett ohne Zeitzonen zu leben, oder? Denn habe ich einen Abendtisch fürs Abendessen reserviert um 18 Uhr, dann ist das halt immer 18 Uhr.",
      "start": 2006916,
      "end": 2035872,
      "confidence": 0.9183255,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Für die Gäste ist das einfacher. IT Systeme, gerade Datenbanken, tun sich schwer, ohne Zeitzone zu arbeiten.",
      "start": 2035936,
      "end": 2041704,
      "confidence": 0.86355704,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, aber ihr habt doch keine Connection nach außen. Klar, Internet ist gegebenenfalls da und man kann das dann vielleicht nutzen, aber die Systeme connecten sich auch nicht ins Internet, oder?",
      "start": 2041792,
      "end": 2050110,
      "confidence": 0.9306313,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Jein. Auch da, was passiert, wenn ein Gast im Vorhinein schon einen Landausflug gebucht hat, den er ein Land gebucht hat, der dann ans Schiff synchronisiert wird? Es gibt also schon eine Verbindung zum Land. Beispiel sind auch e Mails. E Mails kommen ja auch irgendwie mit einer Zeitzone rein. Sie müssen also auch entsprechend angezeigt werden an Bord. Wenn man dann nicht die passende Zeitzone hat, wie die von Land, dann kommt man dort auch durcheinander. Also bei jeglicher Interaktion mit dem Land, egal in welcher Form, brauchst du schon irgendeine Zeitzone an Bord, weil sonst funktioniert diese ganze Computerwelt nicht mehr.",
      "start": 2050280,
      "end": 2078978,
      "confidence": 0.9524566,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und ihr stellt wirklich die Zeitzone um, nicht die Uhr an sich, die bleibt auf UTC quasi und ihr stellt nur um, jetzt ist plus drei, plus 10, 1/4 oder was auch immer dann?",
      "start": 2079074,
      "end": 2090114,
      "confidence": 0.9144685,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ne, wir haben tatsächlich unsere Server immer auf UTC laufen lassen und bei allen Diensten quasi nur intern unserer Software die Zeitzone verrechnet, damit wir nicht durcheinander kommen.",
      "start": 2090202,
      "end": 2099362,
      "confidence": 0.934895,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, und die wird dann auch auf allen Devices natürlich umgestellt, oder? Überall muss ja dann auch die Timezone.",
      "start": 2099466,
      "end": 2106642,
      "confidence": 0.92310315,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dementsprechend eingestellt werden, ne, auch dort, die Fernseher laufen auch immer in irgendeiner Zeit, aber das, was wir anzeigen, das ist dann die Zeitzone oder die Zeit aus unserem System. Das heißt, in welcher Zeitzone und Fernseher? Die interne Uhr wird man ja nirgendswo sehen, das heißt, die zeigt man einfach gar nicht an. Auch dort haben wir wieder eigene APIs, wo man sagen kann, wie spät ist es denn gerade, die eben diese Master Clock weitergeben an die Fernseher, um eben die Schiffszeit anzuzeigen und zu verrechnen.",
      "start": 2106666,
      "end": 2130524,
      "confidence": 0.91925377,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Immer wenn ich an Zeitzonen denke, denke ich auch an verschiedene Länder. Immer wenn ich an verschiedene Länder denke, denke ich an Länder außerhalb der EU. Und immer wenn ich an Länder außerhalb der EU denke, denke ich immer an GDPR, DSGVO, Datenschutz und Co. Sehen wir jetzt gerade wieder im ganzen AI Game, dass super viele Sachen innerhalb von Europa nicht verfügbar sind, aus welchen Gründen auch immer. Wie ist das denn bei den rechtlichen, ich sag mal DSGVO und Accessibility und all diese ganze Thematik bei Kreuzfahrtschiffen? Woran orientieren wir uns? Orientieren wir uns an den Datenschutzrichtlinien, der Flagge, unter die das Schiff läuft oder in dem Land, wo wir im Hafen sind oder in dem Land, woher der Kapitän herkommt. Also das habe ich jetzt mir die Frage gestellt, wenn der Kapitän die Zeit schon einstellen kann, dann kann das ja auch sein.",
      "start": 2130612,
      "end": 2183970,
      "confidence": 0.9145116,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wir orientieren uns garantiert nicht daran, unter welcher Flagge das Schiff fährt, weil das sind ja meistens irgendwelche armen Inselstaaten, wo einfach keine Steuergesetze gelten. Deswegen, da gelten auch ganz andere Gesetze nicht. Deswegen gibt es ja zum Glück beim DSGVO die Regel, wenn es Menschen aus der EU betrifft, nicht wenn dieser Ort in der EU ist. Das heißt, die DSGVO zählt in dem Moment, wo ich als EU Bürger das Schiff betrete. Genauso wenn ein US amerikanischer Bürger das Schiff betritt, gelten für ihn die Rechte. Das heißt, eigentlich haben wir das Schlechteste aus allen Welten. Wir müssen aus der einen Seite die DSGVO natürlich erfüllen mit Datenlöschung, Datenanfrage und alles was dazu gehört. Auf der anderen Seite aber auch die ganzen Accessibility Regeln der USA, die extrem hoch sind, mit Untertitelanzeigen, Digital Signages, müssen aus dem Rollstuhl bedient werden. Man muss sich vorstellen, da hängt ein Fernseher an der Wand, der fängt so auf einen M Höhe an, geht dann auf 2 m Höhe und dann muss man eben trotzdem im Rollstuhl sitzend den Touchscreen komplett bedienen können. Das heißt, alle Elemente müssen z.b. nach unten kommen oder ähnliches. Man hat alle Anforderungen, die die Reederei einem eigentlich weitergibt. Das heißt, wenn sie Gäste aus den USA unter EU transportieren wollen, muss man auch auch diese ganzen Regeln erfüllen. Das gibt einem die Reederei typischerweise aber vor DSGVO haben wir einfach für uns gesagt, machen wir pauschal, was auch gar nicht so schlecht war, weil die ganzen Amerikaner hatten das lange nicht auf dem Schirm und sind natürlich froh über eine deutsche Firma, die einfach sagt kennen wir, machen wir eh, können wir mitarbeiten.",
      "start": 2184050,
      "end": 2267408,
      "confidence": 0.91582686,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber habt ihr als Infotainment System überhaupt Pii Data, also persönlich identifizierbare Informationen?",
      "start": 2267504,
      "end": 2272888,
      "confidence": 0.89243305,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, wir haben die gesamten Informationen über den Gast in der Kabine, um ihn einfach begrüßen zu können z.B. im einfachsten Fall. Und wir buchen ja für ihn auch. Das heißt, wenn du etwas buchst, passiert das immer auf den Namen und deine Kabine.",
      "start": 2273064,
      "end": 2283960,
      "confidence": 0.9231232,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, da ist dann sehr wahrscheinlich dann auch abhängig davon was du buchst, vielleicht auch noch die Personalausweisnummer dabei und so weiter und so fort, oder?",
      "start": 2284080,
      "end": 2290024,
      "confidence": 0.9081423,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, oder beim Login, was ganz gerne benutzt wird, ist halt Kabine, Vorname, Nachname und Geburtsdatum einfach nur für den zum authentifizieren gegenüber dem Schiff, dass man einfach sagt, ich will mein Bordkonto gucken, dann sagt man so, dann bitte noch mal dein Geburtsdatum hier zu bestätigen. Also ja, wir haben mit den ganzen Daten zu tun, wir verarbeiten sie auch und wir halten sie auch nach, um eben dann Leute wiedererkennen zu können.",
      "start": 2290112,
      "end": 2312236,
      "confidence": 0.9220742,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt kommen wir ja aus der Webwelt primär und da fixt man irgendeinen Bug, wenn es ein Problem gibt, wenn das irgendwann auftritt. Und dann drückt man da auf den Knopf und dann wird da alles gepusht. Im Hintergrund wird ein Image gebaut, dann wird es da schnell ausgerollt und dann ist es in der Cloud für alle Kunden sofort verfügbar. Ich könnte mir vorstellen, es ist schwieriger mit einem Schiff. Wie macht ihr Bug Handling?",
      "start": 2312428,
      "end": 2334408,
      "confidence": 0.913863,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also die gute Nachricht, auch so ein Schiff lebt zum Großteil in der Webwelt, weil das Bordportal ist natürlich eine Webseite, quasi alle Smart TVs, die gerade auf dem Markt sind, haben eigentlich nur einen Vollbildbrowser, wo sie halt auch eine Website, dieses Bordportal darstellen können und bieten dann APIs, um mehr Sachen anzubieten, wie z.B. videos abzuspielen oder anschalten, ausschalten. Nachteil, es ist meistens ein Chrome dreiig, vielleicht so das Alter, also wenn man noch. Wir sind bei 120, 110, ich glaube ja, das ist relativ alte Browser, die man unterstützen muss. Das ist vielleicht das eine Problem, mit dem man direkt rechnen kann, wenn man dort irgendwie entwickeln will. Und wenn es dann ums Rollout geht, hilft gute Vorbereitung. Also man muss sich wieder vorstellen, fürs Rollout wird man nicht zu einem Schiff fahren, zumindest nicht für ein Update. Für das initiale Rollout sind wir natürlich vor Ort, da kann man alles machen, aber spätestens für das Update wird keine Reederei der Welt die Anreisezahlen, nur weil wir auf Hawaii vielleicht noch ein paar Wochen Urlaub machen wollen.",
      "start": 2334524,
      "end": 2392868,
      "confidence": 0.8903026,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Schade.",
      "start": 2392924,
      "end": 2393476,
      "confidence": 0.48996,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, schade. Also größere Updates, dann kann man sich wieder anbieten. Aber die typischen Bugfix Releases, die passieren remote. Das muss man sich so vorstellen. Wir haben wieder Internet über Satellit, das heißt, wir müssen wieder daran denken, diese Verzögerung. Man kommt grundsätzlich über VPNs auf die Schiffe drauf, kann also seine Server an Bord erreichen und spielt dann möglichst automatisiert die gesamte Software aus, also Deployed Software, zweitausendein über Satellit. Man kann noch absprechen vorher mit dem Schiff, dass sie mal alle Gäste aus dem Internet schmeißen für eine bestimmte Zeit. Oder typischerweise nimmt man Zeiten, wo wenig Gäste an Bord sind, das ist Landtage z.B. dann ist dann ab 9 Uhr das Schiff mehr oder weniger leer. Dann bietet es sich auch an, Software einzuspielen, weil eben dann kein Gast merkt, dass der Fernseher für 1 Stunde nicht funktioniert z.b. das spricht man dann ab. Auch wieder auf Zeitzonen achten, dass man sich nicht vertut. Passiert dann auch ganz oft, dass man irgendwie doch die falsche Zeitzone erwischt hat. Absprache mit dem Schiff, weil die leben ja in ihrer Zeit, die wissen das gar nicht so. Man ist irgendwo in Deutschland und spielt dann halt die Software auf, während die Gäste nicht da sind. Und wenn die wiederkommen, dann sind die Fernseher aber neu gestartet und alles ist wie vorher, der Bug ist behoben.",
      "start": 2393628,
      "end": 2458682,
      "confidence": 0.91321224,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wie geht ihr damit um, dass ihr keinen Zugriff auf die Hardware habt? Weil im schlimmsten Fall kann ich immer noch in mein Datacenter gehen und auf den Reset Button drücken oder habe vielleicht sogar remote Zugriff dazu. Gibt es das dann auch oder habt ihr da Remote Hands vor Ort, irgendwelche technischen Leute, die euch helfen können?",
      "start": 2458746,
      "end": 2477146,
      "confidence": 0.9127715,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, es gibt eine IT Crew an Bord, bei größeren Schiffen ein oder mehrere IT Admins, die kann man zur Not ganz normal anrufen, also dann ruft man auch über Satellit für die, aber ruft sie einfach an, bespricht das mit denen oder macht mit denen, keine Ahnung, Teams Meetings, wo man das besprechen kann oder schreibt E Mails und Tickets und dann sind die auch sehr hilfsbereit und führen das auch aus. Die sind werden kommen z.B. auch zum Einsatz, wenn neue Filme an das Schiff geliefert werden. Zweitausendein, Andi hat es vorhin gesagt, die CD oder USB Stick, in diesem Fall sind es Festplatten. Das heißt, Filmlieferungen kommen einfach über die Festplatte an Bord, die werden per Post an den Hafen geschickt, dann kommen sie irgendwann bei dem IT Admin an, der schließt sie an dem Server an und dann werden sie in unser System eingespielt, weil es einfach Datenmengen sind, die man über Satellit nicht übertragen möchte. Das sind ja GB terabyteweise Daten teilweise.",
      "start": 2477258,
      "end": 2521940,
      "confidence": 0.9268584,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und gibt es da dann Unterschiede, wie viel die dürfen? Weil klassischerweise probiert man ja irgendwie alles wegzubekommen, wegzukapseln und dass man zweitausendeinousand möglichst eigenständig, also von der Entwicklerseite damit arbeiten kann und dass irgendwie fremde Leute kaum Zugriff haben, aber da kann es ja sein, dass der Kunde dann schon vielleicht mehr Zugriff haben will oder braucht. Gibt es da Unterschiede zur klassischen Web Softwareentwicklung?",
      "start": 2522280,
      "end": 2547206,
      "confidence": 0.88526654,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die IT Admins bekommen relativ weitreichende Rechte auf unser Backend System, das heißt, sie haben eine Admin Oberfläche, über die man unter anderem halt das Content Management System natürlich aussteuern kann. Man kann aber auch die ganzen Fernseher steuern, das heißt, sie können dort auch einen Neustart vom Fernseher z.B. machen oder neu Fernseher provisionieren, wenn sie mal, wenn ein Fernseher ausfällt, dann hängen die einfach neuen an die Wand, richten den auch wieder ein. Und Sie können selbstverständlich auch gerade beim Internetthema nachgucken, wann welcher Gast wo, also nicht wo gesurft hat, sondern wie viel er gesurft hat, weil man einfach dann, die große Streiterei geht los, wenn das Handy im Hintergrund ein Android iOS Update macht und der GB oder das GB einfach verbraucht ist. Zweitausendein nach einer Stunde, dann kommt der Gast natürlich an und sagt so, hier, ich habe meine €20 bezahlt für einen GB, das ist einfach weg. Dann kann der IT Admin eben mit Hilfe unseres Systems nachweisen, ja, das ist schön, aber die hast du auch verbraucht von dann bis dann. Guck doch mal nach, was du da gemacht hast.",
      "start": 2547398,
      "end": 2597644,
      "confidence": 0.9052811,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du hattest gerade Fernseher provisionieren gesagt. Kann ich mir das so vorstellen, dass der IT Admin irgendwie Software in Terraform oder Ansible hat und dann eure Software auf dem Fernseher aufspielt, oder? Ich meine, im Endeffekt ist es ja nur so, wenn du sagst, moderne Fernseher haben einen Browser, dass doch eigentlich nur eine Webseite geöffnet werden muss, oder?",
      "start": 2597732,
      "end": 2615272,
      "confidence": 0.9280873,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist richtig, das muss man dem Fernseher einmal beibringen, dass er eben diese lokale Webseite öffnet, dass er sich im sogenannten Hotelmodus befindet. Das ist die eine Sache, die er im Fernseher machen muss. Und dann muss man ihm ja noch sagen, in welchem Raum, in welcher Kabine er sich befindet, damit er eben danach weiß, wer seine Gäste sind. Das heißt, Schritt eins ist, den Fernseher konfigurieren und eben sagen, deine, sag ich mal, deine Startadresse ist eben unser Bordportal. Und das zweite ist dann, wenn er die gefunden hat, wird er durch so ein Wizard geführt und sagt so, in welcher Kabine bist du, was für ein Fernsehtyp bist du, bist du Paks, also Gastfernseher oder Crew Fernseher, weil die haben z.B. unterschiedliche TV Kanäle und dann gibt man dem Fernseher einfach Informationen über sich selber, die wir im Backend dann wieder benutzen können, um gezielt einzelne Fernseher, einzelne Ebenen des Schiffes, einzelne Kabinengruppen anzusteuern oder anzuspielen.",
      "start": 2615376,
      "end": 2660628,
      "confidence": 0.90050554,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die Passagierzuordnung pro Fernseher, pro Kabine funktioniert aber zentral. Also da muss jetzt keiner durch die Kabinen rennen und das dann über die Tatsache Fernbedienung eingeben, oder?",
      "start": 2660724,
      "end": 2669558,
      "confidence": 0.91480815,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nein, man gibt einmal an der fernseher Kabine 500, damit können wir im PMS nachfragen, wer ist gerade in Kabine 500, was unter anderem auch wichtig ist beim Gästewechsel. Das heißt, wir müssen auch mitkriegen, wenn sich die Gäste, wenn die Gäste von Bord gehen, neue kommen, damit eben nicht die alten Daten anzeigen. DSGVO, wieder ein großes Thema. Da gibt es quasi eine zentrale Stelle, die sagt, Achtung, der Gast hat gerade die Kabine oder das Schiff verlassen, ist nicht mehr an Bord, es kommt neuer. Auch dann müssen z.B. die Fernseher neu gestartet werden, automatisiert, damit die gesamten alten Daten auf dem Fernseher irgendwo gelöscht sind, die dann noch im Cache?",
      "start": 2669654,
      "end": 2698682,
      "confidence": 0.9288881,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Z.B. du hattest jetzt auch erwähnt, dass das Schiff ja eigentlich ein schwimmendes Data Center ist, dass die Server da sind, der Storage ist da, die Kinofilme, die ich mir abends in der Kabine reinziehen kann, sind da. Wie sieht die in die Infrastruktur aus in Bezug auf Stabilität und ich sag mal Redundanz? Weil eine Festplatte, die Festplatte weiß ja nicht, dass sie irgendwie gerade auf dem Schiff ist und nicht kaputt gehen darf, sondern die geht immer dann kaputt, wenn Murphy das möchte. Wie sieht das denn dann aus?",
      "start": 2698806,
      "end": 2724510,
      "confidence": 0.91296387,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Mindestens die großen Schiffe haben einfach alles doppelt. Die haben einfach zwei identische Rechenzentren, die dann gespiegelt sind mit irgendwelchen Hypervisorn, also VMware und ähnlichem. Die lassen es quasi die gesamte IT einfach doppelt laufen. Bei den kleineren Schiffen, wenn das wirklich nur die Abstellkammer ist, wo so ein Rack steht, ja, da gehen Festplatten kaputt und dann muss wer raus und die ersetzen und dann muss das System neu aufgespielt werden. Auch da kommt wieder Automatisierung bei uns ins Spiel. Das heißt auch Neuprovisionierung haben wir damals schon komplett automatisiert gemacht, sodass man nachher noch quasi den Deckplan einspielen musste, muss man sagen. Das ist so ein Schiff von dem Typ mit dem Netzwerkadressen, aber die ganze Software Installation wird dann über Ansible automatisiert vorgenommen.",
      "start": 2724980,
      "end": 2764628,
      "confidence": 0.92173135,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Weißt du zufällig, ob es da eigentlich irgendwelche Unterschiede in der Langlebigkeit gibt? Weil dieses Schiff bewegt sich ja und klassischer Serverraum bewegt sich weniger, hoffentlich ist das irgendwie ein Problem für hardware? Wird da öfter was kaputt? Also früher bei den spinning discs könnte ich mir vorstellen, dass das noch mehr ein Thema war. Wobei so einen klassischen schock gibt es wahrscheinlich weniger auf hoher see. Keine Ahnung, die Dinger sind ja doch recht schwer. Aber kennst du da zufällig irgendwas, ob das statistisch dann öfters kaputt geht?",
      "start": 2764764,
      "end": 2792652,
      "confidence": 0.87858313,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich habe keine Zahlen bislang gehört, tatsächlich. Aber Schock ist vielleicht gar nicht das Problem. Die dauerhafte Vibration kann ich mir vorstellen, dass die ein Problem ist. Also gerade bei den älteren Schiffen, die noch die ja die große Welle haben, also wo das ganze Schiff wirklich so ein großer Motor irgendwo diese Welle antreibt, diese Welle, wie das ganze Schiff geht, die vibrieren doch deutlich. Die neueren Schiffe haben hinten sogenannte Assipods, wo die Motoren direkt an dem Ruder sind, die vibrieren nicht mehr so stark, aber gerade bei den älteren mit Festplatten, ich glaube schon, dass sie regelmäßig ausfallen, kann man nur auf Raid null ganz oft setzen.",
      "start": 2792756,
      "end": 2824056,
      "confidence": 0.9320484,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube, da sollten wir mal jemanden von Backblaze fragen. Die bringen doch, glaube ich, jedes Quartal diese Hard Drive Failure Rates Test raus.",
      "start": 2824168,
      "end": 2832940,
      "confidence": 0.8789046,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, aber ob die eine Kategorie für Schiffe haben, ist die andere Frage.",
      "start": 2833400,
      "end": 2836120,
      "confidence": 0.82484615,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ÿousand, du 1. Apr. Kommt bald wieder. Aber wie sieht es denn bei Notfällen aus? Denn ich meine, wir hatten ja mal vor ein paar Jahren dieses Problem mit der Titanic. Ich glaube, da gab es noch kein Infotainmentsystem, so wie es heute gibt. Aber was ist denn, wenn jetzt hoffentlich das Schiff jetzt mal keinen Eisberg rammt, sondern, weiß ich nicht, einfach nur irgendwas ausfällt und trotzdem die Crew und alle Passagiere evakuiert werden müssen. Wie reagiert das System darauf? Wie bindet ihr das überhaupt ein, wenn der Kapitän den großen roten Knopf auf dem, auf der Brücke nennt sich das, auf der Brücke drückt?",
      "start": 2836160,
      "end": 2870120,
      "confidence": 0.9091084,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also erstmal, er hat wirklich einen großen roten Knopf, den gibt es, das ist ja ernsthaft, ich weiß nicht, ob der groß und rot ist, aber er hat einen Knopf, das ist der Generalalalarm Knopf. Wenn der gedrückt wird, werden quasi alle Lautsprecher auf dem Schiff durchgeschaltet zu ihm, dass er, wenn er redet, dass das auf allen Lautsprechern gehört wird. Das ist auch laut. Und zusätzlich dazu haben wir die Anforderung immer, dass dann natürlich kein Fernseher mehr funktioniert in dem Moment. Das heißt, unser System ist auch angeschlossen an diesen Generalalarm. Das ist einfach nur, ich glaube, 12 v, 24 v Leitung, die fällt eben ab oder nicht, dann muss man halt auf die Flanke hören und dann darauf reagieren. Und wir teilen allen unseren Fernsehern mit, Videos werden pausiert, es gibt so ein Overlay, Achtung, Generalabnahmen, bitte hören sie auf den Captain und gucken gerade nicht aus dem Fenster zweitausendein, sondern das ist gerade was wichtiges.",
      "start": 2870200,
      "end": 2917472,
      "confidence": 0.9070967,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das greift ihr dann aber direkt von dieser Leitung ab. Also ihr habt da jetzt keine HTTP Schnittstelle wieder oder sonst irgendwie eine Notification, sondern ihr greift direkt physikalisch diese Leitung ab und prüft die Spannung.",
      "start": 2917536,
      "end": 2929488,
      "confidence": 0.93373305,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, wir kriegen die Leitung gestellt, es gibt dann kleine Hardware, die eben daraus einen HTTP Service macht, die bringen wir aber mit. Also wir kriegen als Dienstleister erstmal nur so ein Kabel, sagen, hier sind 24 v drauf und dann gibt es, ich glaube, sie heißen Moxa Boxer, bin mir nicht ganz sicher. Dann kann man die da anschließen und die machen daraus einen HTTP Service draus.",
      "start": 2929624,
      "end": 2947252,
      "confidence": 0.8842662,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die kauft man aber zu oder entwickelt man sowas dann auch selber und ihr sendet dann über die klassischen Wege, über euer klassisches Intranet dann zu allen Fernsehern die Informationen. Sofern dieses Internet noch funktioniert natürlich.",
      "start": 2947356,
      "end": 2960172,
      "confidence": 0.88907665,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, richtig. Und dann sind alle Fernseher erstmal außer Gefecht gesetzt. Der Gast kann sie auch nicht mehr benutzen, teilweise nicht mal mehr ausschalten. Also dann legen wir auch die Fernbedienung komplett lahm. Das können wir in diesem Hotelmodus und der Gast muss halt zuhören, was der Kapitän sagt.",
      "start": 2960236,
      "end": 2972664,
      "confidence": 0.93284774,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie funktioniert das rein technisch, um da mal abzutauchen? Weil ihr müsst ihm ja irgendwie eine Push Message schicken oder wie funktioniert das auf der technischen Seite ganz konkret?",
      "start": 2972792,
      "end": 2982360,
      "confidence": 0.8913403,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sockets, Websockets? Genau, also ich glaube eine Implementierung sind Websockets. Wir haben immer noch ein Fallback über Longpolling quasi, um das wirklich nicht zu verpassen. Aber dadurch, dass man eigentlich innerhalb von einer S reagieren muss, ist Websocket die erste Wahl. Und dann, ich glaube, Der Fernseher alle paar Sekunden fragt dann nochmal nach den Status Ÿousand, um eben wirklich mitzukriegen, ob er gerade an sein darf oder nicht. Weil das ist auch harte Bedingungen quasi von, ich weiß nicht, Schiffssicherheit oder wie die auch immer heißen, die lassen dann Schiffe auch nicht rausfahren, wenn solche Sachen nicht funktionieren.",
      "start": 2982440,
      "end": 3011438,
      "confidence": 0.89064264,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie sieht denn eigentlich eure Entwicklungsumgebung aus? Ich glaube nicht, dass ihr ein Schiff vorm Büro stehen gehabt habt. Also emuliert ihr alles? Habt ihr z.B. eine solche Leitung wie die Notfallleitung dann da irgendwo im Büro liegen? Und diese Ÿousand Box, von der du gerade gesprochen hast, also wie entwickelt man diese ganze Thematik überhaupt?",
      "start": 3011614,
      "end": 3031540,
      "confidence": 0.91989356,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also grundsätzlich ist ja alles virtualisiert, das heißt, wir reden von einer Horde von virtuellen Servern, die wir mitbringen, die wir natürlich bei uns im Labor auch alle aufgesetzt haben. Also pro Kunde hatten wir immer ein Set an virtuellen Servern im eigenen privaten Netzwerk. Da konnte man dann seinen Fernseher anschließen und sich ja quasi seinen Rechner reinwählen und dann entsprechend die Sachen alle ausprobieren. Das heißt, zu jedem, jeder Reederei, zu jeder Schiffsklasse haben wir einen kompletten Nachbau bei uns im Rechenzentrum lokal gehabt, einfach im Büro, im Keller. Die ganzen Sondersachen muss man dann gucken, wie weit man die überhaupt simulieren möchte. Also gerade wenn es darum geht, nur an Ausschalter für den Generalalarm, den haben wir mit in die Software eingebaut, einfach, dass man ihn auch per Hand triggern kann. Schwierig wird es dann bei den ganzen Drittsystemen, die werden meistens nämlich aus Lizenzgründen nur von dem Kunden dann bereitgestellt. Das heißt, man muss irgendwo aus dem Internet dann das PMS System anbinden, da.",
      "start": 3031660,
      "end": 3081058,
      "confidence": 0.9130899,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Kriegt ihr dann irgendwie Entwicklerzugänge oder ähnliches. Okay.",
      "start": 3081074,
      "end": 3084050,
      "confidence": 0.7830575,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber wir haben wirklich von jedem Schiff einen eins zu eins Nachbau für eben Staging und Entwicklung und auch Testing auf den Fernsehern im Keller dann die Landschaft stehen und wir haben auch jeden Fernsehertyp und das sind eine ganze Menge. Wir hatten dann einen Raum mit 50 Fernsehern, die gelagert waren. Unser Tester hat halt 10 Fernseher immer aufgebaut und wenn dann ein Schiff eben ein neues Release bekommen hat, hat er die Fernsehtypen von dem Schiff, das sind mehrere, weil natürlich verschiedene Kabinengrößen, verschiedene Ÿousand, einen großen Fernseher dort hängen, haben die alle aufgebaut und das auf allen Fernsehern durchgetestet.",
      "start": 3084170,
      "end": 3112984,
      "confidence": 0.9140574,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also responsive Webdesign ist da schon essentiell.",
      "start": 3113072,
      "end": 3116024,
      "confidence": 0.8156329,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, und vor allem als Herausforderung vom Handy bis zum Fernseher, weil ein Fernseher ist ja auch kein Touchscreen. Man muss also auch mit der Fernbedienung dasselbe benutzen können, was man auch auf dem Handy mit den Fingern benutzen kann.",
      "start": 3116112,
      "end": 3127664,
      "confidence": 0.945451,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Kannst du ein bisschen was über den tech Stack von von Eurosoftware sagen? Du sagtest, war webbasiert gut, jetzt habe ich eine HTTP Schnittstelle vorne, die dann eine Webseite anzeigt auf dem auf dem Chrome dreiig war das? Ich habe gerade mal nachgeschaut, wir sind bei Chrome 101 und dreiigste. Also ich bin mir nicht sicher, welche modernen Web APIs Chrome dreiig noch hat oder die mein 100 dreiig nicht mehr hat, sagen wir es mal eher so. Aber wie wie sah denn der tech Stack aus bei euch?",
      "start": 3127752,
      "end": 3153956,
      "confidence": 0.8773257,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also backend ist ein c backend, einfach aus Performancegründen auch und weil sich C natürlich gut abtesten lässt und zweitausendein sich relativ vorhersagbar verhält, sage ich mal, im Gegensatz zu vielleicht anderen Sprachen. Dieses backend ist wie gesagt die Middleware, die stellt eine HTTP API bereit, von der eben alle Dienste, die es noch möchten, auf dem Schiff dort zugreifen, aber auch unser Frontend. Das heißt, das Frontend, was auf den Fernsehern, was aus dem Handy läuft, nutzt dieselbe API wie andere Dienste vielleicht auch auf dem Schiff. Durch diese zentrale Middleware können wir eben auch bestimmen, wie das für uns am besten passt. Und wir haben dann das absichtliche hart getrennt, so dass wir dasselbe backend mit verschiedenen Frontends benutzen können. Pro Kunde ein anderes Frontend. Das heißt, jeder Kunde ist ein eigenes Frontend Projekt, weil er eben seine individuellen Anpassungen braucht und möchte und seine eigenen Farben, Schriftarten, alles was dazu gehört. Das Frontend selber ist dann ja klassisch HTML, JavaScript, CSS und als Framework ist dort Angular im Einsatz, was erstaunlicherweise sehr rückwärtskompatibel ist. Also die machen einen guten Job, auch in alten Browsern noch ordentlich zu lernen.",
      "start": 3154068,
      "end": 3216580,
      "confidence": 0.90364313,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, ich habe mir gerade die Frage gestellt, ob ihr so ein ähnliches Problem habt wie ziemlich viele Agenturen für eine ganz lange Zeit, dass die den Internet Explorer sechs noch supporten mussten. Aber eigentlich, ich meine, so ein Vue JS oder Ein Svelte oder ähnliches könnt ihr ja fast gar nicht einsetzen. Das bedeutet, dependency technisch seid ihr ja schon in irgendeiner Art und Weise limitiert aufgrund der alten chrome Version, oder?",
      "start": 3216710,
      "end": 3238096,
      "confidence": 0.9272063,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, Angular kapselt sehr viel weg. Das hat immer recht gut funktioniert. Unsere Entwickler haben immer sehr bei CSS geflucht. Da sind viele Sachen, die irgendwie doch in den letzten Jahren dazu gekommen sind, die das Leben sehr viel einfacher machen, die dann auf einmal auf dem Fernseher nicht mehr funktionieren. Da muss man dann eben mit so Weichen tatsächlich arbeiten, dass man, sagen wir mal, die coolen neuen Features von CSS auch nutzen kann. Ganz beliebt in meiner, wenn ich mich richtig erinnere, sind Schatten. Schatten auf Fernsehern funktionieren echt schlecht, weil sie die Performance drücken, weil die halt vielleicht keine GPU haben, wo die Schatten berechnet werden. Das heißt, bitte keine Schatten benutzen auf Fernsehern.",
      "start": 3238208,
      "end": 3271704,
      "confidence": 0.92116344,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wenn wir jetzt mal von der Technik noch mal weiter oben kommen, ins Abstraktionslevel, war das für dich eigentlich dann immer eine coole Abwechslung, da auch mal auf Schiffe zu gehen? Oder war das dann mühsam mit der Zeit? Wird man da dann, kommt man da dann an irgendeinem Punkt, wo einem das zu viel wird? Oder sagst du, das waren schon immer coole Erlebnisse an Bord, ganz abseits vom klassischen Development, was man ja, was wir alle so haben.",
      "start": 3271792,
      "end": 3294638,
      "confidence": 0.94182277,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich hatte Kollegen, die haben sich im Keller wohlgefühlt und die wollten da auch bleiben. Ich selber habe es immer geliebt. Das hängt einmal zusammen. Man sieht was von der Welt. Also das ist ja nicht nur, dass man jetzt nach Hamburg fährt, was auch oft passiert und da dann eben in die Werft geht. Man fliegt einfach um die ganze Welt. Man kann irgendwie im Mittelmeer die erste Reise mitmachen. Eine Reise war von Dubai nach Limassol. Also einmal quer durch die Welt wirklich. Man sieht einfach ein paar Orte. Man kann auch, wenn der Laden läuft in dem Moment dann natürlich auch die Landausflüge mitmachen und einfach mal einen Tag im Hafen verbringen. Und man trifft immer meiner Erfahrung auf, auch auf eine extrem hilfsbereite und motivierte Crew an Bord. Also ich habe selten so gute Teams erlebt eigentlich. Das fängt damit an, dass man dann, keine Ahnung, nett begrüßt wird, dass der IT Admin einen mitnimmt beim Speedboot fahren, weil er ja seinen Führerschein gerade gemacht hat und dann die Gäste fahren muss. Dann kommt man eben noch mit aufs Board und kann einfach mitfahren. Das geht weiter mit so kleinen Gefälligkeiten, brauchst du eine Palette Cola z.B. oder so, dann organisiert der IT Admin das halt. Das ist wirklich, man kommt da rein, wird sofort, gerade bei kleineren Schiffen, also bei kleiner rede ich jetzt von 350, 500 Gästen, wird man sehr schnell in dieses Team aufgenommen, akzeptiert und ist dann mit da drin und kann auch einfach dieses Schiffsleben einfach mit genießen. Das fand ich extrem schön.",
      "start": 3294744,
      "end": 3371512,
      "confidence": 0.917722,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt hört man ja immer, dass so Leute, die da an Bord arbeiten, das nur für eine Reise machen oder die halt so in der Gastro arbeiten oder so. Aber ich vermute, die IT Admin Ÿousand, die sind dann, die sind dann da wirklich ständig dort. Also das sind dann lange Zeit Mitarbeiter, die dort angestellt sind bei diesen Reedereien, oder wie kann ich mir das vorstellen?",
      "start": 3371576,
      "end": 3391742,
      "confidence": 0.9116188,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, die, die ich erlebt habe, sind länger da. Man muss da vielleicht unterscheiden, IT Admins sind, ich weiß nicht, ob sie schon Offiziere sind, aber sind sehr hoch in der Rangfolge, sind meistens ein, zwei, drei unterm Captain. Das heißt, sie sind von der Rangfolge an Bord, an Bord gibt es feste Rangfolgen, also wirklich feste Rangfolgen, sind die sehr weit oben. Sie genießen dann Privilegien wie Kabine mit Fenster z.B. oder Einzelkabinen. Sie dürfen in Gästebereiche mitgehen. Sie haben wirklich viele, viele Vorteile als IT Admin, die sie einfach dort haben, die eben z.B. auf die Servicekräfte im Restaurant oder bei der Kabinenreinigung nicht zutreffen. Dort habe ich es eben auch öfter gehört, dass viele das nur ein, zwei Schichten schaffen, also dann drei oder sechs, also eine Schicht sind dann drei Monate meistens, dass sie nach zweimal an Bord sein eigentlich sagen, das ist mir zu viel, ich möchte nicht mehr, ich möchte runter. IT Admins habe ich erlebt, die fünf, sechs, sieben Jahre diesen Job machen und die das einfach gerne machen, also die ja wirklich von leben und dann da auch, ja, die ganzen Privilegien auch mitnehmen.",
      "start": 3391846,
      "end": 3448956,
      "confidence": 0.9184104,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber die sind dann angestellt bei der Reederei? Also wenn ich jetzt bei, du hast gerade, du hast vorhin TUI mein Schiff erwähnt. Die sind da jetzt nicht angestellt bei TUI, sondern bei der Reederei, der das Kreuzfahrtschiff gehört, oder?",
      "start": 3449068,
      "end": 3460802,
      "confidence": 0.8745775,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist ja tui in diesem Fall. Hängt ein bisschen von ab tatsächlich. Also es gibt verschiedene Modelle. Manche Reedereien stellen die Leute selber an oder es gibt sogenannte Vermittler, ich glaube die heißen Sea Chefs z.B. die vermitteln einfach Crew an Schiffe und dann ist man dort angestellt.",
      "start": 3460916,
      "end": 3475574,
      "confidence": 0.9414896,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich immer, also ich finde es faszinierend, ich spreche immer mit verschiedenen Leuten und ich habe immer gedacht, oder ich denke immer wieder okay, das ist jetzt das Ende dieser IT Welt, das kann ich jetzt machen. So IT ist zwar breit gefächert und dann kommst du um die Ecke, Sebastian und sagst mir, es gibt Leute auf IT Admins auf irgendwelchen Schiffen. Mega. Aber ich habe noch mal eine Frage zum zum Bugfixing. Du hast gesagt okay, es kann sein, dass ihr da mal mitfahrt oder beziehungsweise wenn ein Schiff in der Reederei ist oder im Trocken Dock, trocken Deck, Trocken Doc, das ihr die ganze Sache installiert und irgendwann kommt dann Bug. Ich meine, das ist ja schon harter Druck, oder? Ich meine, du bist auf dem Schiff und du musst irgendwie versuchen, diesen Bug zu fixen. Zweitausendein oder? Also ich meine, du musst ja schon eine komplette Übersicht über die komplette Architektur haben und ein komplettes Verständnis über den Data Flow und Co, dass du wirklich sagen kannst okay, ich habe eine Idee, wo es ist. Oder hängst du dann wirklich am Telefon und sagst okay, ich hole jetzt mal das ganze Team in warum und wir versuchen jetzt zu debuggen.",
      "start": 3475662,
      "end": 3530940,
      "confidence": 0.89278233,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das hängt ein bisschen von ab, wer an Bord ist, wie viel Erfahrung er mitbringt und welche, also was er quasi im richtigen Leben an Land macht. Wir haben teilweise dann jemanden an Bord, der einfach dieses System mitprogrammiert hat. Der kennt sich natürlich sehr gut aus, der weiß genau, wie dieses ganze System funktioniert, wie die Drittstellen funktionieren, wie vielleicht Netzwerk noch funktioniert. Aber wenn wir zu bugs kommen im Netzwerk, z.B. ein beliebtes Beispiel hatten wir Fehler in Anführungszeichen intelligenten Switches und immer fünf vor der vollen H sind alle Filme abgebrochen. Hat zwei Wochen gedauert, hat etliche Netzwerkexperten auf den Plan gerufen. Am Ende haben wir es dann doch gelöst. Das ist eine wilde Kombination aus Einstellungen und Ÿousand, fälschlicherweise Intelligenz auf Switchen gewesen. Da holt man natürlich einfach das ganze Team zusammen. Da ist man eben erstmal Kanalisation für das Schiff. Das heißt, wenn die sagen, wir haben ein Problem, das geht gar nicht, vielleicht regen sie sich auch ein bisschen auf, dann nimmt man das erstmal entgegen. Oder wenn man ja bei größeren Rollouts ist dann immer Projektleiter mit dabei, dann sammelt der das erstmal für einen und dann macht man halt den Call mit zu Hause und sagt so, jetzt müssen wir alle überlegen, wie können wir diesen Fehler einfach beheben? Also man ist ja nicht alleine und natürlich die kleineren Sachen. Klassiker sind Content Management, Dinge, die man umsetzen will, wie ich will z.b. diese Schrift noch ein bisschen größer machen hier, damit das besser wirkt. Das machen die direkt an Bord und zeigen das auch den IT Admins direkt an. Bord.",
      "start": 3531020,
      "end": 3607276,
      "confidence": 0.91476,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt bist du ja nicht mehr in der Branche und ganz unabhängig davon, was die Gründe sind, würdest du das anderen Leuten empfehlen? Ich glaube, ich kann deine Antwort schon vorhersehen, so wie du geschwärmt hast über deine Speedboat Ausflüge, aber würdest du das Leuten empfehlen und zweitausendein, jetzt wo du auch wieder an Land bist, sozusagen mehr unter Anführungszeichen, siehst du da irgendwo Unterschiede oder Dinge, die in so einer Industrie wie der Schiffsfahrtindustrie dann ganz anders sind oder auch vielleicht coole sind oder besser sind?",
      "start": 3607468,
      "end": 3636234,
      "confidence": 0.90076417,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also grundsätzlich kann ich das jedem empfehlen. Man muss, wenn man wirklich das erleben möchte, auch ein bisschen bereit sein zu reisen. Das hängt natürlich so ein bisschen von der persönlichen Situation ab, ob man Familie zu Hause hat, Kinder oder ähnliches. Aber gerade dieses Reisen habe ich immer als eine besondere ja Belohnung quasi gesehen, dass man halt irgendwie irgendwo hinreisen kann, damit diesem doch luxuriösen Schiff vielleicht, also ich bat zeitlang zuständig für so fünf Sterne plus Kreuzfahrtschiffe, wo man also hingeht und der vielleicht der Butler auf dem Flur nur war, darauf wartet, deine Kabine sauber zu machen, was immer zu leichten Irritationen geführt hat, wenn ich mit meinem abgehalfterten Rucksack dann dort an der Rezeption stand zum einchecken, wenn ich den bin, wo ich hin möchte. Das ist zweitausendein wirklich eine Erfahrung, die werde ich so privat glaube ich nicht mehr machen, weil ich könnte es mir einfach nicht leisten. Wir reden von Preisen 500 pro Nacht aufwärts pro Person, also das sind so die unteren Kategorien, wo man dann €1000 bei zwei Personen pro Nacht zahlt mit den ganzen Annehmlichkeiten. Das Eindrucksvollste, was mir aufgefallen ist dabei, es gibt dann eine minibar und der Inhalt der Minibar hat sich nach ein paar Tagen an das angepasst, was ich gerne trinke. Also die haben die Getränke selber rausgenommen, die ich anscheinend nicht trinke und haben sie mit denen aufgefüllt, die ich trinke. Da hab ich gesagt, das ist ein Luxus, ja, da kann ich mich dran gewöhnen. Also das ist schon ganz nett, wenn man so dieses Unauffällige sich um das sich so unauffällig um einen gekümmert wird. Das ist schon eine spannende Erfahrung, die werde ich glaube ich privat nie machen, weil ich mir das nicht leisten möchte. Das ist nicht mein Urlaubstyp, aber das ist so eine Sache, die kann man dort einfach erleben, weil man dort wie gesagt aufgenommen wird, man ist Gast an Bord, man wird genauso behandelt, man sieht einfach andere Welten.",
      "start": 3636322,
      "end": 3729642,
      "confidence": 0.9103504,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ist das der neue Qualitätstest mit der Minibar, so nach dem Motto ist das hier ein luxuriöses Etablissement? Wenn ja, man trinkt die Minibar leer und schaut, was in den nächsten zwei, drei Tagen aufgefüllt wird.",
      "start": 3729706,
      "end": 3740458,
      "confidence": 0.93111223,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich glaube, es ist ein Benchmark, den ich ansetzen würde. Kann ich mir vorstellen. Also zusätzlich dazu, dass man z.B. persönlich begrüßt wird an der Rezeption, bevor man. Wenn man das zweite Mal da ist, ist der Name bekannt.",
      "start": 3740554,
      "end": 3750138,
      "confidence": 0.9475882,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Gut, alternativ könnte es auch Alkoholiker werden, aber ich möchte hier keinen zum Minibar lehren aufschauen.",
      "start": 3750314,
      "end": 3756466,
      "confidence": 0.79469186,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ihr müsst einfach öfters zu uns kommen nach Tirol. Da ist es ganz klar immer der Fall in den kurzen Hotels.",
      "start": 3756538,
      "end": 3762480,
      "confidence": 0.88701,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Welchen Tipp Würdest du denn den Leuten geben, die sich nach dem Podcast mal überlegen, in diese Industrie zu wechseln? Also wo würdest du sagen okay, wo sind Ankerpunkte? Ich gehe jetzt nicht auf Stepstone und suche IT System Administrator auf Kreuzwortschiffen.",
      "start": 3762820,
      "end": 3773772,
      "confidence": 0.8647269,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, es gibt ja zwei Wege, die man einschlagen kann. Entweder ich möchte als Crewmitglied auf diesem Schiff arbeiten. Das ist ja die eine Möglichkeit. Also ich werde wirklich IT Mitarbeiter auf dem Schiff und fahre quasi immer mit, bin zweitausendein. Typischerweise ist man drei Monate an Bord, ein Monat der zu Hause und dann wieder drei Monate an Bord. Da gibt es einfach Einschläge Portale, C Chefs, ähnliches. Da sind die Stellen ganz normal ausgeschrieben, da bewirbt man sich und hat dann Glück oder Pech und kommt dann auf so ein Schiff und wird dann dort zugewiesen. Ja, die Alternative ist natürlich, sich eine Firma zu suchen, die im Software für Kreuzfahrtschiffe herstellt. Hat den großen Vorteil, man ist eben nicht dauerhaft auf einem Schiff. Man hat also normales Leben eigentlich und kann nur das als Bonus mitnehmen, auf diese Schiffe zu reisen. Da gibt es gar nicht so viele Anbieter, wie man denkt. Zumindest im Infotainment Bereich nicht. Aber wie gesagt, Getstash ist einer davon. Ansonsten muss man ein bisschen googeln. Ich weiß gar nicht, was das. Ja, also am Markt gibt manche rein Räder reinmachen, die Software auch selber. Also müsste man sich direkt dort bewerben.",
      "start": 3773836,
      "end": 3829854,
      "confidence": 0.89923227,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe gerade mal auf Sea chefs geguckt. Also zurzeit sucht TUI Cruises mein Schiff, einen IT Administrator und einen IT Manager.",
      "start": 3829942,
      "end": 3837950,
      "confidence": 0.8705645,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Andi, das wäre doch was für dich, oder? Kannst du da endlich. Jetzt hast du gerade gesagt, du bist da auf die Kreuzfahrtschiffe.",
      "start": 3838070,
      "end": 3843616,
      "confidence": 0.81006306,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich weiß es nicht mehr, wie es jetzt ist. Ich hatte das damals einmal zum Spaß irgendwie kurz nach meinem Studium mich dort beworben, wurde dann nicht genommen aus anderen Gründen. Bin dann halt aber in der anderen Firma gelandet, die lustigerweise auch wieder mit Kreuzfahrtschiffen zu tun hat. Sie bezahlen sehr, sehr gut und brutto gleich netto, weil sie sind ja meistens irgendwie. Also man zahlt keine Steuern, soweit ich das weiß. Das ist also kann sich lohnen. Man darf nicht vergessen, während der Zeit, wo man dort arbeitet auf dem Schiff, braucht man keine Wohnung. Man kriegt Essen gestellt, man kriegt alles gestellt. Man muss quasi nur das Geld aufwenden, was man zum Spaß an Land verbraucht. Also da haben sich glaube ich, manche, mit denen ich gesprochen habe, ihr Häuschen oder ihr Studium finanziert mit dem Job.",
      "start": 3843728,
      "end": 3881354,
      "confidence": 0.94759643,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich finde die Benefits schön. Kostenlose Reinigung der Uniform.",
      "start": 3881442,
      "end": 3884682,
      "confidence": 0.8901878,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ist ein Offiziersprivileg. Also da haben die ja, ja, was wurde mir gesagt? Das finden manche komisch und machen das nicht, weil du musst ja deine Kollegen bitten, quasi deine Kabine zu reinigen. Das fanden manche dann doch komisch von den IT Admins, die ich kennengelernt habe.",
      "start": 3884786,
      "end": 3899828,
      "confidence": 0.9354567,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das verstehe ich. Die Links oder die Webseite packt man natürlich auch in den Shownotes, falls mal irgendwer was Neues sucht. Mein Kopf explodiert gerade wieder. Ich finde es wieder immer faszinierend, wie breit doch die IT gefächert ist. Sebastian, vielen lieben Dank für für diese Podcast Aufnahme und für diesen für diese Insights. Jetzt habe ich natürlich das Riesenproblem, immer wenn ich ein solch großes Schiff sehe, sehe ich das Schiff jetzt mit anderen Augen. Wenn ich da mal draufgehe, sehe ich den Screen, den ich an der Rezeption sehe, mit anderen Augen. Und ich werde natürlich nächstes Mal auch versuchen, irgendwie auf die Webseite in meinem Laptop zu kommen, die auf dem Fernseher angezeigt wird, um zu gucken, was da so los ist. Deswegen weiß ich nicht ganz, ob dieses Gespräch jetzt so vorteilhaft war für alle Infotainment Software Companies. Aber ich glaube, wenn du auf der größten LAN Party mit zwei, drei, 4000 Leuten bis auf einem Kreuzfahrtschiff, dann kann man da auch mal ein bisschen links und rechts gucken und gucken, was sein Netzwerk so abgeht. Aber ich hoffe, dass die IT am Instant an Bord nicht an die Tür klopfen. Du, du, du, hast du den Netzwerkscanner hier am Laufen?",
      "start": 3899924,
      "end": 3960182,
      "confidence": 0.90885776,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber nun gut, das ist vielleicht auch eine Sache, die mich immer gereizt hat an Kreuzfahrtschiffen, wenn man dort nachher auf diesem Schiff ist und man sieht, was man geschaffen hat. Ganz am Anfang hast du es gesagt, man ist oft so Kellerprogrammierer, macht irgendwas, sieht das Ergebnis nicht. Dort sieht man das Ergebnis. Man kriegt relativ viel Feedback von eben der Crew oder auch Gästen. Und auch dieses Gefühl, wenn man dann einmal zum Testen auf 1000 Fernsehern gleichzeitig einen Film abspielen lässt und eben mal so die Gigabit Interfaces der Server ein bisschen ausreizt, also wo dann eben 40, 50 Gigabit anliegen auf einmal, weil jeder Film gleichzeitig gestreamt wird auf allen Fernsehern, dann kriegt man so ein Gefühl von dem, was man da eigentlich erschaffen hat, sage ich mal. Es ist so ein bisschen dieser Gottkomplex, den Informatiker dann ausleben. Also die Kontrolle über 1000 Fernseher.",
      "start": 3960366,
      "end": 4005896,
      "confidence": 0.91504776,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Du bist dann aber nie in einer Bar gesessen oder so auf dem Schiff und dann haben sich irgendwelche Gäste neben dir unterhalten über die schlechte UI oder so von ihrem Fernseher oder wie sie das Portal nicht bedienen können oder sowas.",
      "start": 4006058,
      "end": 4017520,
      "confidence": 0.96396357,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wurde mir tatsächlich direkt nicht gesagt. Vennet ist mir natürlich zu Herzen genommen und geändert. Was wir aber gemacht haben, solche Späße, wenn wir wissen, dass Kollegen an Bord sind, vielleicht haben wir sie mal mitten in der Nacht mit einem lustigen Lied auf ihrem Fernseher geweckt. Könnte passieren.",
      "start": 4017940,
      "end": 4030240,
      "confidence": 0.91513306,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Oh, seid ihr fies, seid ihr fies. Was ich mir aber schon vorstellen kann, dass bei diesem Job man schon eine ganze Menge lernt. Also auf der einen Seite, wie du sagtest, ich glaube wirklich, das ist wirklich so eine Art du merkst, dass du Impact hast oder dass du das Leben von von Leuten annehmlicher machst, also von zumindestens den Passagieren. Auf der anderen Seite hast du natürlich schon in irgendeiner Art und Weise direkten Kundenkontakt, würde ich fast sagen, weil ich weiß jetzt nicht gerade, wer der Kunde ist, sehr wahrscheinlich dann der Kapitän oder Passagier, aber ist ja auch egal für.",
      "start": 4031020,
      "end": 4060408,
      "confidence": 0.9180594,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Uns, was immer der Passagier, der Kunde.",
      "start": 4060424,
      "end": 4062068,
      "confidence": 0.91776,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und du lernst natürlich enorm unter Grenzen zu arbeiten. Du hast ja kaum Internet auf dem Ding z.B. oder oder du musst wirklich dein Design und deine Architektur wirklich mal durchdenken. Was kannst du hier machen? Weil einfach mal eben die Amazon Cloud anfragen ist halt nicht Wahnsinn. Sebastian, vielen Lieben Dank, dass du dir die Zeit genommen hast, mit uns zu sprechen und uns diese Insight gegeben hast. Ich hatte sehr viel Spaß. Für alle Leute, die sich auch dafür interessieren, Sebastians Kontaktdaten stellen wir natürlich auch in die Show Notes. Wenn ihr immer danke sagen wollt, kommt gerne in unsere Discord Community und sagt einfach mal danke für diese Episode. Wir reichen auch jedes Feedback weiter an Sebastian. Wenn ihr noch irgendwie dedizierte Fragen habt, leiten wir diese auch gerne weiter. Ansonsten würde ich sagen vielen Dank für die Episode, vielen Dank für deine Zeit, Sebastian und wir wünschen noch einen schönen Tag. Tschö.",
      "start": 4062184,
      "end": 4107494,
      "confidence": 0.9101568,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ciao, ciao.",
      "start": 4107622,
      "end": 4109050,
      "confidence": 0.691835,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber dann kommen Dinge wie Zeitzonen ins Spiel. Zeitzonen sind meiner Meinung nach immer noch der Endgegner der Informatik, weil jeder, der behauptet, dass er Zeitzonen wirklich verstanden hat, den stelle ich gerne auf die Probe und nenne zwei, drei Beispiele, wo man dann ins Grübeln kommt, ob man es wirklich verstanden hat. Zweitausendein.",
      "start": 5056280,
      "end": 5073240,
      "confidence": 0.8771226,
      "speaker": "C",
      "channel": null
    }
  ],
  "confidence": 0.914181,
  "audio_duration": 5014,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}