{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/cgbdoCssidsxAFH/download/ep181_business_models.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "multichannel": null,
  "audio_channels": null,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "aa6c6340-e5a0-4484-bced-0d08c0c9b4c8",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Wir sind kein Wirtschaftspodcast.",
      "start": 240,
      "end": 3086,
      "confidence": 0.87561,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Gut, dass du das erkannt hast.",
      "start": 3238,
      "end": 4646,
      "confidence": 0.9732583,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dieser Podcast beschreibt sich als deutschsprachiger Software Engineering Podcast. Aber ab und zu schauen wir mal über den technischen Tellerrand. Man könnte auch fast sagen, wir zwingen unsere Hörerinnen und Hörerinnen, sich mal ab und zu mit nicht technischen Themen zu beschäftigen. Und Wolfgang, jetzt zeige ich dir mal einen Trick. Und zwar mit einem Satz werden wir jetzt 50 % der Hörerinnen und Hörer für diese Folge verlieren. Heute geht es mal um ein halbes Wirtschaftsthema.",
      "start": 4718,
      "end": 30062,
      "confidence": 0.9113752,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Warum nur ein halbes?",
      "start": 30126,
      "end": 31076,
      "confidence": 0.955785,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Weil ich denke, dass das Thema heute mit einem Job zu tun hat.",
      "start": 31198,
      "end": 34960,
      "confidence": 0.95538,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Zumindest mit meinem Job. Das ist keine halbe Sache. Das gleich mal vorweg.",
      "start": 35040,
      "end": 38936,
      "confidence": 0.76565,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du bist Berater. Ob das ein richtiger Job ist, weiß ich nicht. Deswegen aber mit dem Job von klassischen Softwareentwicklerinnen. Denn in der Regel, und das verallgemeinere ich jetzt also ein bisschen sehr stark, viele Arbeitnehmer haben ein oder vielleicht sogar zwei Ziele. Das erste Ziel wäre irgendwie eine Beförderung auf ein höheres Level. Viele Leute möchten vielleicht Senior oder Staff Engineer werden. Ist ja auch so eine Art Anerkennung, wenn man befördert wurde. Aber was viele Leute nicht ganz so auf dem Schirm haben, ist, dass mit einem höheren Level auch ein höherer Impact erwartet wird. Und Impact in diesem Kontext bedeutet oft nicht, die App 5 % schneller zu machen, sondern eher die aktive Beeinflussung von Business KPIs. Merkst schon, fallen schon die ersten Wörter zum Wirtschaftspodcast.",
      "start": 39008,
      "end": 76968,
      "confidence": 0.9254752,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich sehe, du hast bei meinem Vortrag vor ein paar Tagen beim Meetup in Düsseldorf aufgepasst.",
      "start": 77064,
      "end": 81272,
      "confidence": 0.8737406,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich passe immer auf, Wolfgang, wenn du was sagst, klebe ich an deinen Lippen. Aber zurück zu den Business KPIs. Das klingt, wenn ich das so sage, halt super langweilig, kann aber, wenn man dies positiv sieht, auch eine richtige, richtige Herausforderung sein. Denn die Keyfrage ist, wie kann ich mit Softwareentwicklung aktiv Mehrwert, aka spürbaren Wert, spürbaren Value fürs Unternehmen schaffen? Wenn man sich mal so Career Frameworks ansieht, was muss ich tun, wie muss ich mich verhalten, vom Midlevel Engineer zum Senior engineer zu werden, dann steht auch oft da drin Business Verständnis und Business Value. Und umso höher man geht, desto mehr wird Wert auf diesen Punkt gelegt.",
      "start": 81336,
      "end": 119656,
      "confidence": 0.9109956,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ist es nicht extrem langweilig? Wir sind ja Techniker, wir zwei.",
      "start": 119728,
      "end": 122744,
      "confidence": 0.93218726,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich habe gesagt, ich klebe an deinen Lippen. Du klebst anscheinend nicht an meinen Lippen. Ich habe ja gesagt, es könnte langweilig klingen, aber es kann auch eine wahre Herausforderung. Aber bleibt dran, wir helfen euch dabei. Aber das zweite Ziel ist mehr Gehalt. Denn es gibt immer Leute, die möchten mehr verdienen, denn die wenigsten von uns arbeiten für Luft und Liebe, glaube ich zumindestens. Also ich tue es nicht, ich arbeite nicht für Luft und Liebe. Manche Anna hat vielleicht sogar ein persönliches Ziel, man will die verdienen oder halt einfach nur nicht alles von der Inflation auffressen lassen. Denn inflationsjahre waren, glaube ich, in Österreich, habe ich gestern auch nachgeguckt, in 22 und 23 so acht bis 9 % pro Jahr. Ich weiß nicht, wer im Jahr 22 eine 8 % Gehaltserhöhung bekommen hat und im Jahr 23 9 % Erhöhung. Wird glaube ich langsam schwierig, oder ihr habt relativ viel den Job gewechselt, da ist sowas relativ gut möglich. Punkt ist, wenn ihr im Jahr 2022 und 23 keine acht bzw. 9 % Gehaltserhöhung bekommen habt, dann habt ihr eigentlich die gleiche Arbeitsleistung gebracht für weniger Geld. Denn die Inflation hat natürlich eine ganze Menge aufgefressen. Zurück zum Punkt. Wenn man aber jetzt mehr Geld möchte, muss man auch mehr Wert stiften. Und wenn man sich das Ganze mal ganz simpel durchrechnet, du verdienst jetzt, ich nehme jetzt einfach mal, weil es einfacher zu rechnen ist, der Arbeitgeber zahlt aber dein Bruttogehalt plus Lohnnebenkosten, also Lohnsteuer, Sozialversicherung und so weiter und so fort. Das bedeutet, was der Arbeitgeber zahlt, was die Firma eigentlich für dich zahlt, ist eigentlich Faktor 1,25, 1,28, 1,3 für dich. Also eigentlich zahlt der Arbeitgeber. Bis oben drauf kommen dann noch benefits wie Büro, der Obstkorb.",
      "start": 122832,
      "end": 220570,
      "confidence": 0.90635365,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Moment, das Büro ist schon der Benefit bei dir? Man merkt, du bist Remote Worker, da ist das Büro schon der Benefit.",
      "start": 220690,
      "end": 226670,
      "confidence": 0.89955956,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber das Büro muss ja halt auch gezahlt werden. So ein Obstkorb Büro, Equipment, Overhead, Kosten, Verwaltung, wie z.B. die Buchhaltung oder HR muss man halt irgendwann haben. Wenn man das alles dazu rechnet, dann ist der übliche Faktor von einem Arbeitnehmer eigentlich so 1,3 bis 1,6 des Bruttogehalts. Also eigentlich kann man sagen, wenn du verdienst, zahlt der Arbeitgeber 100 dreiig bis für deine Stelle.",
      "start": 227010,
      "end": 249974,
      "confidence": 0.8797868,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das wiederum, also nicht nur 100 dreiig bis 160, die 100 Dreiig zahlt einmal fix mit den Lohnlebenkosten und dann kommt das ganze noch on top. Also man ist schon eher bei der oberen Zahl. Auch wenn du jetzt remote z.B. arbeitest, dann hast du ja Anspruch auf dem Schreibtisch, Stuhl und die ganzen Dinge. Es kommt ja alles, alles oben drauf. Also ich würde schon sagen, mit 150 ist man auf jeden Fall dabei.",
      "start": 250062,
      "end": 273130,
      "confidence": 0.9095768,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und wenn man jetzt die Euro nimmt und du stiftest für die Firma, du bringst der Firma Euro pro Jahr, dann bist du eigentlich net neutral. Aber oft ist es halt so, dass es eine for Profit Firma ist. Und somit solltest du eigentlich mehr Wert stiften, als du kostest. Also eigentlich nehmen wir mal von den solltest du dann Euro an Value für die Firma stiften. Und wenn du jetzt noch eine Gehaltserhöhung möchtest, dann solltest du zusehen, dass du deinen aktuellen Wert für deinen Arbeitgeber nochmal steigerst. Und jetzt ist die große was hat das alles mit dieser Episode zu tun? Was hat das alles mit dieser halben Wirtschafts Podcast Episode zu tun? Die Keyfrage ist ja, wie machen wir das eigentlich? Wie bekommen wir mehr Gehalt oder eine Beförderung auf ein höheres Level? Eine Antwort kann sein, zu verstehen, wie die Firma eigentlich Geld verdient und welche Herausforderungen mit dem Businessmodell eigentlich einherkommen. Oft sieht man irgendwie eine Webseite und man fragt sich, wie verdienen die eigentlich Geld? Und oft ist das gar nicht so sichtbar, zumindest auf den ersten Blick.",
      "start": 273250,
      "end": 333090,
      "confidence": 0.9132004,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und es ist natürlich nicht nur der Arbeitgeber, der Geld verdienen will. Oft ist es ja auch so, dass wir irgendwelche side Projects haben. Und die Idee von vielen Leuten ist ja auch so, mit irgendeinem side Project, side Hustle mal Geld zu verdienen, auch wenn es jetzt nicht zu viel ist. Aber natürlich ist da das dann auch hilfreich zu verstehen, wie kann man denn Geld machen und was ist überhaupt möglich zu machen? Und was sind auch Kosten, wenn man z.b. eine Mitarbeiterin natürlich anstellt?",
      "start": 333170,
      "end": 355602,
      "confidence": 0.9174994,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Zweitausendein. Ich würde sagen, dann steigen wir mal mit dem ersten Business Modell ein bzw. Wie eine Firma Geld verdient. Und ich habe mir als erstes mal ein Modell rausgesucht, wo ich am Anfang, zumindest 2013, erst mal lernen musste, wie diese Firma Geld verdient. Denn ich denke, das war nicht von Anfang an wirklich so sichtbar für mich. Und zwar ist das unser ehemaliger Arbeitgeber Trivago. Nur zum Kontext, wer die Firma nicht kennt, das ist ein Hotelpreisvergleich und darüber findet man den besten Preis für ein Hotelzimmer. Kann man ähnlich sehen wie Idealo oder Check oder ähnliches. Und deren deren Key Business Modell nennt sich eigentlich Cost per Click oder Cost per Sale. Also Cost per Click wird CPC abgekürzt und Cost per Sale wird CPS abgekürzt. Die solche, solche Abkürzungen werdet ihr sehr wahrscheinlich in der ganzen Episode noch mal hören. Der Wolfgang wird da glaube ich, noch gleich ein paar mehr nennen. Aber im Endeffekt erhält Trivago Gebühren von Buchungswebseiten für Klicks, die über die Plattform generiert werden. Also wenn Trivago mich als Kunden zu einem Partner z.B. auf Booking oder Hotels Dot Com weiterleitet, dann hat Trivago Booking eigentlich Traffic beschert und kriegt dafür Geld. Wenn ich jetzt das Hotelzimmer auf Booking buche, dann bekommt Trivago eigentlich noch mehr Geld. Und zu Spitzenzeiten, also das ist alles öffentlich einsehbar, wurde damit circa €1 Milliarde an Umsatz pro Jahr gemacht. Also das ist natürlich schon eine relativ große Hausnummer.",
      "start": 355626,
      "end": 442772,
      "confidence": 0.9033501,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also viele kennen das vielleicht auch unter dem Begriff Affiliate. Das ist eigentlich nur die professionelle Variante von so einem klassischen Affiliate Modell, wo man einfach irgendwie Leute weiterleitet und Sachen vermittelt.",
      "start": 502836,
      "end": 513236,
      "confidence": 0.9491913,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das bedeutet Trivago und Check und Iallo sind nicht professionell.",
      "start": 513308,
      "end": 516852,
      "confidence": 0.829186,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Doch, die sind professionell, aber Affiliate, diesen Begriff Affiliate hört man meistens eher so im kleinen Stil, wenn es um irgendeine Webseite geht oder man macht so ein Referral für eine Bank oder sowas auf der privaten Webseite oder empfiehlt es Freunden, dann spricht man ganz oft von Affiliate und im professionellen Bereich sagt man dann einfach keine CPC Model oder professionellen Preisvergleiche. Aber im Prinzip ist es ein ganz klassisches Affiliate Marketing, was da betrieben wird. Und vielleicht haben das auch manche gerade gehört. Kurz ich hat es diesen Skandal geben mit mit diesem Honey Plugin, was dir die Cookies klaut. Also üblicherweise läuft es ja in irgendeiner Form über Cookies oder Identifier. Also du musst hier irgendwie tracken, wie kommt ein Besucher dann auf booking dot com und bucht ein Hotel dort? Also muss das in irgendeiner Form tracken. Und da hat es eben diese Honey Plugin gegeben, dass dir auch Preise verglichen hat, glaube ich, ist es ursprünglich gewesen. Und das hat dir dann aber wirklich illegal diese Cookies geklaut und hat dann für sich beansprucht, ich war eigentlich der Affiliate, der dir das Hotel vermittelt hat und hat dann anderen Webseiten diese Cookies geklaut. Also im Prinzip funktioniert es überall gleich, egal ob es eine riesen Webseite ist wie Trivago oder wirecutter z.B. die die empfehlen. Gadgets ist so eine internationale große Seite, die gehört der New York Times oder auch die ganz kleine Popel Webseite, würde ich mal sagen, die irgendwie drei Links oben hat. Auf der Webseite funktioniert eigentlich alles gleich, nur in einem anderen Scale. Also die kleine Webseite kommt wahrscheinlich selten auf 1 Milliarde Revenue.",
      "start": 516956,
      "end": 602980,
      "confidence": 0.89824045,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Meines Wissens nach war das Honey Plugin kein Preisvergleich, sondern hat Coupon Codes von Influencern angegeben und hat sich dann aber kurz vor dem Sale den Couponcode selbst auf sich geschrieben, um den Affiliate zu kriegen. Aber war ein Riesending. Finanzfluss ist noch mal eine andere Plattform. Die machen das ähnlich. Die verdienen auch hauptsächlich Geld für Affiliate, primär mit mit Konten vergleichen und so weiter. Vielleicht wer zur Corona Zeit irgendwie mit ETF Investments oder ein bisschen mit Finanzen sich auseinandergesetzt hat, kennt Finanzfluss auch sehr groß, auch im YouTube Sektor.",
      "start": 603060,
      "end": 636248,
      "confidence": 0.8761371,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Im Prinzip ist es ja eigentlich immer ein Content Creator. Also man könnte ja sogar sagen, Trivago ist in irgendeiner Form Content Creator. Du erzeugst Content, Informationen zu Hotels, in dem Fall ist es ein Preisvergleich, also den Vergleich zum Preis. Aber du sammelst Informationen, die scheinbar irgendwo anders nicht verfügbar sind. Sei es in einem YouTube Video, sei es über ein Gadget auf Wirecard, sei es ein Hotel. Und darüber erzeugst du Mehrwert für irgendwelche User und sendest es weiter und dafür bekommst du eigentlich bezahlt.",
      "start": 636344,
      "end": 665636,
      "confidence": 0.9263692,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "So weit, so klar. Und jetzt kommt einer der Key Herausforderungen, die mir am Anfang nicht bewusst war. Und zwar nehmen wir mal das Beispiel Trivago. Trivago bekommt Geld von seinen Partnern, also Booking Dot Com oder Hotels Dot Com, also eigentlich BB Geschäft, business to business. Trivago muss aber zusehen, dass die Website und somit auch den Traffic auf Endkunden optimiert wird. Also auf BC, also auf den Wolfgang, auf mich und so weiter. Und was jetzt gerade so einfach klingt, ist aber ein riesen Zwiespalt für die Produktentwicklung, denn du optimierst für eine Zielgruppe, von der du eigentlich nicht das Geld später bekommst. Eigentlich würdest du natürlich erwarten für die Zielgruppe, von der du final das Geld bekommst. Also bist du immer hin und hergerissen, okay, was mache ich jetzt? Optimiere ich jetzt die Webseite für mehr Traffic? Optimiere ich jetzt die Webseite, damit ich immer nur Klicks auf den teuersten Partner bekomme oder oder.",
      "start": 665708,
      "end": 720046,
      "confidence": 0.9193626,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das geht halt dann schon in den Graubereich rein. Also bist du dann noch ehrlich oder bevorzugt du dann deinen Kunden, der am meisten zahlt? Also auch bei Influencern ist es ja ein klassisches Problem, wenn die Werbung für irgendwas machen, machen die noch ein echtes Review von diesem Produkt. Oder auch Wirecard z.B. wirecard macht Reviews zu Gadgets, ist wirklich eine riesen Seite, macht 50 Millionen einen Umsatz pro Jahr. Da stellt sich natürlich schon die Frage, kannst du das noch objektiv bewerten oder nimmst du dann dieses Gadget, was dir am meisten Geld bietet oder den höchsten Affiliate Prozentsatz? Und was natürlich viele probieren, gerade im professionellen Umfeld, sowas wie Wirecard, die sagen zweitausendein, unsere Redaktion ist komplett unabhängig von der Werbeabteilung. Das heißt, die machen den Deal und wir machen wirklich nur redaktionellen Inhalt. Wir testen die Gadgets, wir kaufen die Gadgets unabhängig von der Werbefirma. Das ist natürlich für einen Influencer schwierig, wenn du eine Ein Personen Firma bist, als Influencer, YouTuber oder wir als Podcaster, wir haben keine eigene Person, die sich nur um die Werbedeals kümmert. Also da ist es dann schon viel schwieriger, das auseinanderzuhalten.",
      "start": 720198,
      "end": 783872,
      "confidence": 0.91621757,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist das eine Risiko. Das andere Risiko ist natürlich, jetzt nehmen wir mal einen Produktvergleich, zweitausendein werden Produkte, wo kein Affiliate ausgeschüttet wird, überhaupt dargestellt, weil im Endeffekt hat dann in dem Fall, jetzt nehmen wir mal Finanzfluss, kein Interesse daran, ein Konto mit in den Vergleich zu nehmen, was gar kein Affiliate ausschüttet. Vielleicht sagen sie okay, wegen der Transparenz nehmen wir das mit rein und machen einen fairen Vergleich. Das ist richtig. Es ist aber nicht transparent, wie viel jetzt Finanzfluss von jedem Konto bekommt und so weiter. Deswegen weiß man das natürlich nie. Ich werfe jetzt niemanden was vor Finanzfluss, so viel ich weiß, machen das ziemlich viel, aber nehmen wir mal Versicherungsmakler. Versicherungsmakler, die die Allianz und andere Versicherungen verkaufen, die werden mit hoher Wahrscheinlichkeit nur Versicherungen im Portfolio haben, die Affiliate ausschütten. Und ich glaube z.B. die HDI Group gibt keinen Affiliate raus und deswegen werden ziemlich viele freie Versicherungsmakler die HDI nicht verkaufen. Nur mal so als als Gedankenstütze. Und wenn man dieses ganze Affiliate natürlich jetzt ein bisschen weiter denkt, dann entsteht da auch nicht nur die Herausforderung, von wem man eigentlich Geld bekommt und für wen man optimiert, wie wir gerade besprochen haben, sondern auch ein Riesenrisiko. Was ist, wenn ein Partner, ein Affiliate Partner so groß bei dir wird, dass der für einen mittleren prozentualen Anteil von deinem Revenue wirklich verantwortlich sagen wir mal 2025 % und der bricht dir auf einmal weg. Der sagt auf einmal hey, ich stampfe mein Affiliate Programm ein oder ich reduziere die meine Affiliate Kosten oder ähnliches. Und auf einmal hast du so eine große Abhängigkeit zu dem einen Partner und musst dann vielleicht sogar Leute entlassen, weil dir auf einmal 20 % des Revenue fehlen. Zweitausendein, das kann natürlich auch ein riesen Risiko sein, wenn du dich da nicht breit genug aufstellst.",
      "start": 783976,
      "end": 888212,
      "confidence": 0.8990148,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, aber hast du es nicht bei jedem Business, wenn du Großkunden hast und denen Großteile mal ausmachen, egal was es für ein Businessmodell ist.",
      "start": 888276,
      "end": 895052,
      "confidence": 0.8572256,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und zwar habe ich mal in einer Webagentur gearbeitet, da habe ich dieses Konzept auf jeden Fall auch wiedererkannt, denn du hast Kunden, für die du Webprojekte machst und die bringen dir einen prozentualen Anteil an Umsatz für das Geschäft. Und wenn dieser Anteil halt wächst, dann haben wir diese immer a Kunden genannt. Natürlich müsste die Geschäftsführung dann dazu sehen, dass du mehrere a Kunden hast und nicht nur einen. Wenn ein Kunde 50 % des Business macht und sich dann mit dem nächsten Pitch für eine andere Agentur entscheidet, dann würde ich sagen, gerät so eine Agentur relativ schnell in Schieflage. Also korrigiere ich glaube ich meine Antwort, wenn ich gerade so drüber nachdenke. Und wenn du immer mit Partnern arbeitest, dann könnte das Risiko wirklich bei jedem Partner bestehen, bei jedem Business Modell. Entschuldigung, aber wenn du die Frage stellst, kennst du irgendeine mögliche Lösung, wie man das irgendwie ausbalancieren kann? Geschäftsmodell wechseln ist vielleicht jetzt gerade nicht die beste Lösung.",
      "start": 895076,
      "end": 943944,
      "confidence": 0.88652843,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich glaube, es gibt keine sinnvolle Lösung, außer natürlich mehr Kunden zu haben, mehr Partner, einfach das Risiko zu verteilen. Also nicht nur auf ein Pfad setzen, ganz klassisch. Und gerade wenn man klein ist, hat man da oft dieses Problem, weil da bekommt man einen Großkunden und dann fokussiert man alles nur mehr auf diesen Großkunden und alle anderen lässt man klein bleiben oder klein werden oder die droppen dann raus und dann jedes Feature wird dann nur mal für den Großkunden entwickelt und am Ende hat man diese Abhängigkeit. Also man kann glaube ich früh versuchen, gar nicht so sehr in diese Abhängigkeit zu kommen und da einfach immer ein breites Feld zu haben. Ist aber auch leichter gesagt als geht dann, weil wenn du so einen Hauptpartner hast, der dir da einfach das Geld in den Rachen wirft, dann musst du erstmal so stark sein und sagen, nö, wir machen jetzt auch ein Feature, was nicht für dich ist.",
      "start": 943992,
      "end": 986828,
      "confidence": 0.93678087,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Der Wolfgang, der alte Kapitalist, immer höher, schneller, weiter. Nee, mal im Ernst, aber was können wir denn jetzt als Softwareentwicklerinnen daraus lernen? Das bedeutet, wenn ihr z.B. in einer kleineren Firma arbeitet und ihr merkt, okay, alle Ressourcen werden auf einen Partner gesetzt, vielleicht sogar für eine recht lange Zeit, sucht da einfach mal das Gespräch mit eurer Managerin oder vielleicht sogar mit der Geschäftsführung und fragt einfach mal nach, wie sehen denn die Zahlen aus? Du hast da was im Podcast gehört, dass das ein A Kunde ist und du machst dir schon Gedanken, ob sich die Firma gerade in eine Disbalance zu dem A Kunden bewegt, proportional zu dem Umsatz und holt einfach mal ein bisschen Informationen ein. Die müssen ja keine sagen, ja, wir haben nächsten letzten Monat so und so viel gemacht, sondern eigentlich zeigt den Leuten, hey, du denkst jetzt nicht nur an deinen Teil, sondern du denkst auch ein bisschen firmenübergreifend und an die Firma und nicht firmenübergreifend Team übergreifen bzw. An die Firma. Und ja, im Endeffekt ist das auch in einer kleinen Firma eine Frage, wie sicher ist denn mein Job hier? Was ist, wenn der Partner wegbricht? Muss man vielleicht nicht ganz so brutal formulieren, aber ist mal eine Frage, die mir zumindest ab und zu mal durch den Kopf schießt.",
      "start": 986924,
      "end": 1051726,
      "confidence": 0.8731759,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber genau das ist der Knackpunkt, den wir, glaube ich, in der Entwicklung ja auch ganz oft erleben. Da kommen diese Requests rein, hey, unser großer Kunde, der braucht irgendwie einen schnellen Hack, einen schnellen Fix und dann muss es möglichst schnell durchgehen und dann leidet die Code Base darunter, dann leidet die Qualität darunter, die ganzen üblichen Sachen. Und es gibt natürlich jetzt die Variante, man schaltet da stur und sagt, okay, das ist aber schlecht für unsere Codebase, man macht nichts, aber es hat natürlich schon Relevanz, will die auch einen großen Kunden zufriedenstellen? Und da hat man, glaube ich, einen großen Hebel, wenn man das sinnvoll umsetzen kann in der Codebase, dass man sagt, okay, das ist jetzt ein Hack, wie kann ich den am besten umsetzen? Wie können vielleicht auch andere Kunden davon profitieren? Und da haben wir aber der technischen Seite, glaube ich, auch mehr Einblick. Und da ist es gut, wenn man mit dem Business, mit den Product Ownern, Product Managern einfach dementsprechend auch sprechen kann und sagen, okay, könnten wir das vielleicht leicht adaptieren, dann können wir es jedem Kunden anbieten oder dann haben wir da vielleicht irgendwo anders eine Möglichkeit und das einfach sinnvoll zu integrieren und sinnvoll auf Augenhöhe mit denen sprechen, weil dann haben alle was davon, dann hat der Großkunde was davon, dann haben vielleicht andere Kunden was davon und die Code Base leidet auch nicht darunter. Ÿousand. Also auch da in dem guten Verhandlungsmodus zu sein und das Business zu verstehen, hilft einem sehr stark, um dann auch die Codebase zu verbessern im Endeffekt.",
      "start": 1051798,
      "end": 1127700,
      "confidence": 0.91415244,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Lass uns mal zum nächsten Business Modell wechseln, denn diese Horrorstory, wir driften uns hier gerade in so eine Negativspirale. Es gibt keine Lösung, es ist alles ein Akkunde, die Firma geht pleite, die nächsten Layoff Welle kommt bestimmt, das ist.",
      "start": 1127780,
      "end": 1139892,
      "confidence": 0.82477903,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Perfekt, dann wechseln wir jetzt zum Werbemodell, was nicht funktioniert. Noch besseres Businessmodell.",
      "start": 1139916,
      "end": 1144132,
      "confidence": 0.9138423,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, wir sprechen über zweitausendeinundzwanzig Werbung und jetzt ist natürlich die Frage, betrifft mich das? Habe ich überhaupt einen Adblocker? Ja, ich habe auch einen Adblocker.",
      "start": 1144196,
      "end": 1151570,
      "confidence": 0.85737693,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das wäre jetzt gleich meine Frage gewesen, hast du einen Adblocker an dir?",
      "start": 1151610,
      "end": 1154506,
      "confidence": 0.7372408,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, habe ich, aber es gibt auch diverse Seiten, wo ich den Adblocker deaktiviert habe, weil die mich dann sonst gar nichts mehr machen.",
      "start": 1154538,
      "end": 1159410,
      "confidence": 0.94295585,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich wollte gerade sagen, weil sie dich gezwungen haben. Ja, ich spreche ganz oft mit technischen Leuten und die erklären mir immer Adblocker und verstehe auch irgendwo, dass sie Adblocker verwenden, weil sie sagen, die Werbewirtschaft ist böse, verstehe auch irgendwo das ganze Tracking. Aber ich persönlich habe ja auch ein größeres side Project, ein sehr altes side Project, was werbefinanziert ist. Und ich komme halt von einer anderen Richtung und sehe, wie schwer das ist, mit einem werbefinanzierten Modell überhaupt irgendwie über die Runden zu kommen. Und darum tut mir das im Herzen immer weh und darum habe ich keinen Adblocker bei mir, einfach aus Überzeugung. Und ich schaue auch gern, wenn ich auf irgendwelchen News Seiten bin, die Werbung an bzw. Lasse sie mir einfach einblenden, weil ich irgendwie die andere Seite auch verstehe.",
      "start": 1159450,
      "end": 1198956,
      "confidence": 0.8878222,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ab und zu mache ich aber auch mal das Experiment und schalte meinen Adblocker mal aus und versuche dieses Internet so natural zu genießen. Und dann gehst du mal irgendwie auf spigl.de oder t nde oder ähnliches. Meine Güte, da blinkt ja überall was. Also du kannst dich ja kaum noch konzentrieren, um den Text zu lesen, weil du im Augenwinkel links und rechts alles was blinkt und dich bewegt. Ich bin ja froh, dass die Browser keinen Autosound mehr anhaben.",
      "start": 1199038,
      "end": 1220992,
      "confidence": 0.93257,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, aber du könntest ja auch ein Spiegel Abo kaufen, dann hast du keine Bubble. Qualitativer Journalismus kostet, da bin ich ja.",
      "start": 1221016,
      "end": 1227960,
      "confidence": 0.90144,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Voll und ganz bei, aber ich glaube, so viel lese ich dann den Spiegel jetzt auch nicht.",
      "start": 1228000,
      "end": 1231256,
      "confidence": 0.9354788,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Von daher, ja, es ist immer so dieses zweischneidige Schwert, aber ich kann es natürlich verstehen. Und wenn man dann einmal den Netzwerk Tab aufmacht und sieht, wie viel tausende Requests da im Hintergrund gesendet werden, kann es natürlich schon irgendwo nachvollziehen.",
      "start": 1231328,
      "end": 1243648,
      "confidence": 0.86646354,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber noch mal ganz kurz, weil du sagtest, die Werbeindustrie ist böse. Ich denke, es ist völlig legitim, Marketing zu machen, Werbung zu schalten, auf sein Unternehmen, auf sein Produkt aufmerksam zu machen. Das Problem ist bzw. Die große Herausforderung natürlich für die Firmen, a ist das Abrechnungsmodell, auf was wird abgerechnet? Das erklärst du uns in einer Min und B natürlich auch die Messbarkeit der ganzen Thematik. Wie viele Leute kamen jetzt von dieser Webseite, wo ich Werbung gestaltet habe, um dann natürlich später Rückschlüsse drauf ziehen zu können. Hat sich mein Werbungsinvestment auf tn de in diesem Fall jetzt gelohnt? Mache ich das nächsten Monat wieder? Und aus wirtschaftlicher Sicht oder aus unternehmen Sicht muss man natürlich zweitausendein schon sagen, das macht schon irgendwie Sinn, wenn du datengetrieben arbeiten möchtest, wenn du kluge Entscheidungen haben möchtest, wenn du Signale haben möchtest, ob du die Investition wieder gemacht hast. Natürlich kannst du ein Bauchgefühl haben, aber dafür musst du halt ziemlich viel Tracking haben und dann mit den Cookies und jada jada jada, was das da nicht alles gibt. Deswegen sagen wir, ist böse, aber wenn ich jetzt Werbung schalte, frage ich mich auch, hat das jetzt Sinn gemacht? Und also es ist so ein, ja, mal wieder ein Zwiespalt und es ist.",
      "start": 1243744,
      "end": 1311018,
      "confidence": 0.89730096,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja auch das allgemeine Problem, du kannst das beste Produkt haben, Zweitausendein, wenn niemand davon weiß, wird es auch niemand kaufen. Und kennt vielleicht jeder, der mal ein Open Source Projekt gestartet hat, man ist sehr überzeugt, man hat das beste Produkt, den besten Source Code im Idealfall, aber das heißt noch lange nicht, dass es irgendwer verwendet und du musst fast nach außen gehen und es irgendwo posten, bewerben und so weiter. Anders funktioniert es einfach sonst nicht. Und Firmen müssen das natürlich auch machen. Also man kann es meiner Meinung nach nicht so schwarz und weiß sehen.",
      "start": 1311034,
      "end": 1338272,
      "confidence": 0.9364272,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt habe ich gerade schon über Investments gesprochen, was gibt man denn für Werbung aus, bzw. Wenn du ein größeres side Projekt hast, wie reich bist du denn schon von Werbung geworden?",
      "start": 1338376,
      "end": 1347488,
      "confidence": 0.8928519,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also das kann ich schon mal vorweg sagen, das ist ein Irrglaube, dass Leute noch immer glauben, dass sich Webseiten oder irgendwelche Dienste mit Werbung finanzieren können. Also es geht weder im Journalismus bei großen Seiten, es geht eigentlich nirgends mit klassischer banner Werbung, also display Werbung meine jetzt natürlich. Es gibt ja viele Arten von Werbungen und Affiliate ist ja auch eine gewisse Art von Werbung, dass das irgendwie viel Geld einbringt, stimmt einfach seit der Dotcom Bubble nicht mehr. Also in den ERN hat es vielleicht noch gestimmt, aber heutzutage ist es eigentlich nicht mehr der Fall. Also wenn ich von meinem side Project spreche, von meinem größeren, das ist f Online, das ist so eine Online Lernplattform für den österreichischen Führerschein, wo man sich so vorbereiten kann auf diese Computerprüfung. Ist kostenlos, rein werbefinanziert und wir haben z.B. pro Tag ungefähr gelernte Fragen, also Leute klicken sich dadurch mit den Fragen und wir haben da Fragen, die da bearbeitet werden. Circa 2 Millionen Requests pro Tag und haben einen Marktanteil von 25 bis dreiig %. Also jede vierte Person in Österreich ist irgendwie durch unsere Plattform gegangen in den letzten 10 Jahren. Jetzt würde ich schon sagen, große Plattform, Schätz mal Andi, was haben wir Umsatz durch unser werbefinanziertes Modell pro Tag, pro Woche, pro Monat ist mir egal, aber pro Monat ist es einfach 2 Millionen.",
      "start": 1347584,
      "end": 1426534,
      "confidence": 0.91082305,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Requests pro Tag, pro Monat macht ihr 1205 und dreiig Euro.",
      "start": 1426582,
      "end": 1431238,
      "confidence": 0.8839673,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ist eigentlich eine ziemlich gute Schätzung. Ich würde sagen, im Schnitt ist es nicht vierstellig, also es ist unter €1000.",
      "start": 1431334,
      "end": 1437798,
      "confidence": 0.9172338,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Während du das gerade alles erzählt hast, muss ich mal eine Aussage relativieren. In 2024 oder 2023 kann man nicht mehr mit Werbung Geld verdienen. Google hat in 2023 nur mit Werbung 208 und dreiig Milliarden US Dollar gemacht. Zweitausendein. Jetzt sagst du 208 und dreiig. Harte Nr. Google. Die Zahl ist impressiv. Jetzt kommt aber das Erstaunliche. Die Gesamtumsätze von Google in 23 lagen bei €305 Milliarden. Andi, schmeiß mich nicht mit Zahlen zu. Prozentual bedeutet das, 2023 hat Google 78 % nur mit Ads gemacht. Klar, Extrembeispiel, gar keine Frage. Ÿousand ist eine Ad Company, alles gut. Dennoch auf dem Scale 78 % auf Werbung oder mit Werbung zu verdienen oder umzusetzen, viel wichtiger würde ich sagen, relativiert deine Ausgabe.",
      "start": 1437854,
      "end": 1492746,
      "confidence": 0.8855309,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das stimmt natürlich. Es gibt zwei Player, die an Werbung sehr gut verdienen. Das ist der Meta Konzern und Google. Ich habe jetzt leider akut keine Zahlen rausgesucht, aber ich glaube mal, die machen wahrscheinlich 80 % des weltweiten Display Marktes aus. Höchstwahrscheinlich. Und rate mal, woher wir unseren Umsatz.",
      "start": 1492818,
      "end": 1509890,
      "confidence": 0.9007996,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bekommen von den beiden.",
      "start": 1509930,
      "end": 1511294,
      "confidence": 0.957765,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Von Google? Ja, weil Google hat natürlich auch ein Ad Display Netzwerk. Das heißt Google organisiert uns die Werbung, schneidet da mit, keine Ahnung, was die so verdienen dran. Wahrscheinlich nicht wenig. Und dann bekommt wir halt hinten raus noch ein bisschen was, was hinten dran hängt.",
      "start": 1511382,
      "end": 1525926,
      "confidence": 0.8982577,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, nur noch mal um das zusammenzufassen. Du sagtest, du hast 2 Millionen Anfragen Requests pro Tag. Sind 2 Millionen Anfragen gleich 2 Millionen ausgespielte Werbung?",
      "start": 1525998,
      "end": 1536830,
      "confidence": 0.91378117,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Nein, wir zeigen nicht so Hardcore Werbung an.",
      "start": 1536910,
      "end": 1539126,
      "confidence": 0.86337,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Auf wie viel Request werden dann Werbung angezeigt?",
      "start": 1539198,
      "end": 1541150,
      "confidence": 0.87445,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich schätze mal irgendwie so.",
      "start": 1541230,
      "end": 1542770,
      "confidence": 0.781604,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, das würde bedeuten, auf dem Monat mit ein und dreiig Tagen bist du bei 15, 15,5 Millionen Requests, die Werbung ausspielen. Dafür kriegst du knapp vierstellig, sagen wir €1000. Das bedeutet, was hat man da für eine Abrechnung? Weil Werbung wird ja so viel ich weiß, in tausender Kontaktpunkte abgerechnet. Und das bedeutet, du hast eine Werbung 1000 Leuten gezeigt und für diesen tausender Block wirst du bezahlt. Was kriegst du pro tausender Block?",
      "start": 1544030,
      "end": 1570182,
      "confidence": 0.876776,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Dann hast du es jetzt nicht gerade ausgerechnet.",
      "start": 1570206,
      "end": 1571942,
      "confidence": 0.830715,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bei mir komme ich auf €15, ist das richtig?",
      "start": 1572006,
      "end": 1574062,
      "confidence": 0.94400114,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das wäre sehr schön, wenn ich €15.",
      "start": 1574166,
      "end": 1576206,
      "confidence": 0.8958271,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bekommen würde, dann habe ich mich einfach stark verrechnet gerade.",
      "start": 1576238,
      "end": 1579006,
      "confidence": 0.960615,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich vermute mal, du hast irgendwie Tag und Monat da noch irgendwo ein Problem. Auf jeden Fall. Ich kann es ganz konkret sagen. Also der sogenannte RPM, das ist revenue per mille. Ÿousand. Man sagt immer per mille hat nichts mit der Million zu tun, sondern auf italienisch und Französisch mille heißt 1000. Das heißt, man rechnet immer pro tausend Kontakte, pro 1000 Klicks, was es auch immer ist.",
      "start": 1579118,
      "end": 1601508,
      "confidence": 0.9047587,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Man sagt aber auch im Deutschen korrekterweise du hast eine Mille, das bedeutet wirklich, du hast 1000 und nicht 1 Million.",
      "start": 1601644,
      "end": 1608244,
      "confidence": 0.92014474,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ihr seid komisch in Deutschland. Also der Revenue Per Mille, also 1000 Impressions, tausendmal ein Banner angezeigt z.B. auf der Webseite liegt aktuell, was wir von Google bekommen, ungefähr bei €0,13, €0,14, €0,12, €0,10, sowas in der Größenordnung. Ganz allgemein gesprochen würde ich sagen, liegt der DKB, also der 1000 Kontaktpreis, was jetzt Agenturen zahlen, liegt irgendwo so bei einem Euro drei, manchmal vielleicht auch fünf. Wenn man so bei großen News Portalen wie Spiegel oder so reinschaut, sind da wahrscheinlich Listenpreise von 15 drin. Glaube aber nicht, dass die irgendwo erreicht werden. Also was dann bei der Webseite am Ende ankommt, ist dann eher im unteren Bereich. Und wenn man z.b. diese Full Screen Ads, die kennst du vielleicht vom Handy, diese ganz nervigen Ads. Keine Ahnung, ob es die bei euch gibt im Apple Universe, aber im Android Universe machen die dann auf, wenn man so Games hat oder egal wie, haben die auch beim beim Führerschein alle 20 dreiig Fragen machen wir so eine Fullscreen Ad auf, die nimmt dann den ganzen Bildschirm ein, spielt dann teilweise leider Musik ab. Ich glaube, das ist jetzt wenigstens unterbunden worden, dass das übersteuert werden kann, da wenn du es leise geschalten hast. Und da kriegst du dann schon teilweise so einen Euro bis €3, je nachdem wie gut das Ganze performt und was du natürlich für Zielgruppe hast. Aber wir sprechen auf jeden Fall von sehr, sehr niedrigen Preisen in diesem Segment. Umso spezifischer natürlich deine Zielgruppe ist, umso mehr kannst du auch verlangen. Also Der Spiegel bekommt sicher höhere Preise. Wir als Podcaster z.b. bekommen auch höhere Preise, weil wir natürlich euch, da ihr uns gern zuhört, dankenswerterweise ist eine sehr spezielle Zielgruppe Entwickler innen. Da bekommen wir natürlich höhere DKB Preise für unsere Werbung. Aber klassische display Werbung im Internet ist einfach null wert. Also das ist wirklich. Kannst du vergessen eigentlich.",
      "start": 1608372,
      "end": 1717574,
      "confidence": 0.90936,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber sind jetzt Leute, die den Führerschein machen, nicht eine sehr spezifische Zielgruppe?",
      "start": 1717662,
      "end": 1721206,
      "confidence": 0.91749847,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, die sind aber noch nicht so kaufkräftig mit 17. Die werden das erst und scheinbar werden die nicht so geschätzt. Und das geht halt einfach über das Google Netzwerk bist du halt einfach nur Maße. Wenn wir jetzt das direkt vertreiben, würden, wird es vielleicht anders aussehen. Aber klassisch, wenn du einfach sagst, Google, gib mir ein paar Ads und macht das alles für mich, dann kommt man mit sehr niedrigen Zahlen raus. Wobei natürlich, man muss schon auch sagen, Google z.b. in der Suche, die verlangen ganz andere Preise, weil die haben das CPC Modell wieder, wie Trivago auch, klick cost per klick. Das heißt, wenn du irgendwo drauf klickst, dann zahlst du da bei Google, wenn du dort Werbung schaltest, zwischen eins und teilweise geht es rauf bis zu €15 für einen Klick. Und das wird dann im Hintergrund umgerechnet wieder auf 1000 Views. Darum schwankt dieser Preis auch. Also der ist nicht irgendwie fixiert, sondern der errechnet sich durch die Klickpreise und durch das Bidding bei Google, weil da wird immer drauf geboten, wie viel bin ich bereit zu zahlen für einen Klick.",
      "start": 1721318,
      "end": 1774754,
      "confidence": 0.9019928,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber kannst du nicht Cost per Click auch abrechnen in deinem f Online Fahrschulwebseiten Seitenprojekt?",
      "start": 1774842,
      "end": 1779650,
      "confidence": 0.768576,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ihr habt da auch natürlich CPC Preise drinnen. Das wird einfach immer gegengerechnet. Du kannst ja jeweils das umrechnen, je nachdem wie viele klicks du hast. Aber die eigentliche Währung ist das Klickmodell. Weil auch wenn ich jetzt bei Google irgendwas buche, dann will ich ja eigentlich Klicks erreichen. Ich will ja Leute auf meine Webseite bekommen oder Leads vielleicht noch, sollte sogar ein Sign up dann passieren und daraufhin optimiert auch Google automatisch im Hintergrund und ich sage, mir ist ein Klick €1 wert, wenn der Klick über meine Webseite kommt, heißt es noch lange nicht, dass ich den Euro bekomme. Google bekommt den Euro.",
      "start": 1779730,
      "end": 1810140,
      "confidence": 0.90684366,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und wenn ich jetzt Werbung auf YouTube mache, ist das auch display Werbung und spreche ich da auch über Cent Beträge pro 1000 YouTube ausspielungen?",
      "start": 1810220,
      "end": 1817936,
      "confidence": 0.915172,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das haben vielleicht auch schon einige mal gehört. YouTube ist gerade für Creators eigentlich jetzt rein von dem Werbemodell, was YouTube fährt, auch eher uninteressant, weil wenn man da von einer Million YouTube Views spricht. Wir haben damals in Episode 123 mit Hendrik Kleinwächter, der ja der Brad Code macht, auch darüber gesprochen, weil der ist ja auch ein YouTuber, der sehr stark ist, zweitausendein und bei YouTube hast du üblicherweise ungefähr 1000 bis $6000 für 1 Million Views. Und das musst du erst mal schaffen, ein Video, das 1 Million Views hat, also da musst du schon sehr gut sein. Und dann hast du wahrscheinlich auch noch vereinzelte Videos, die so viel haben und dann verteilt über vielleicht Monate. Also auch da, dass man über YouTube Werbung reich wird als Content Creator, kannst du auch vergessen. Die bekommen dann eher über irgendwelche Affiliate Links z.B. das Geld, weil es wesentlich besser funktioniert.",
      "start": 1818048,
      "end": 1867486,
      "confidence": 0.9109579,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und da sind wir wieder beim ersten Business Modell mit den Affiliate Links, wenn du so möchtest. Wenn ihr z.B. mal ziemlich vielen Youtubern, die ich sag mal Holzbearbeitung machen oder ähnliches oder Tools testen, so wie Werkzeug.",
      "start": 1867558,
      "end": 1878374,
      "confidence": 0.8744237,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Z.B. komisch, dass du immer mit diesen Werkzeugbeispielen kommst.",
      "start": 1878422,
      "end": 1881702,
      "confidence": 0.95827556,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich kaufe sehr viel Werkzeug, aber ich habe ein Hobby Werkzeug kaufen und es nicht zu benutzen, so wie Bücher. Ich habe das Hobby Bücher kaufen und nicht lesen. Aber wenn ihr in den YouTube Beschreibungen immer guckt, dann sind da meist irgendwie alle Amazon Affiliate Links zu den Tools drin und das ist deren Haupteinnahmequelle. Aber das, das bedeutet natürlich jetzt auch, dass das komplette Werbegame, sei es Display Ads, sei es YouTube, ja eigentlich nur über Maße bzw. Volumen geht, oder?",
      "start": 1881806,
      "end": 1907762,
      "confidence": 0.883734,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Oder eine sehr spezifische Zielgruppe oder ein sehr spezifisches Werbeprodukt dann. Ja. Aber sonst die einzigen, die an der Werbung verdienen, ist Matter und Google oder Alphabet und alle anderen. Also ich kenne kein Produkt oder einen Service, was nur mit Werbung sich irgendwie sinnvoll finanzieren kann, weil wir waren bei den Kosten von so einem Mitarbeiter. Jetzt musst du mal rechnen, wie viele Millionen oder Milliarden Views du wahrscheinlich brauchst, um mal Euro im Jahr reinzuholen über Werbung.",
      "start": 1907866,
      "end": 1936694,
      "confidence": 0.90045214,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und Google und Meta verdienen dadurch, weil die die großen ad Server zur Verfügung stellen, weil die, die das Bidding hinten drauf machen und dann die Werbung auch ausspielen, um das ganze Tracking zu übernehmen.",
      "start": 1936862,
      "end": 1945758,
      "confidence": 0.908462,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und weil die einfach Monopolisten sind, muss man auch ganz klar sagen. Also die verdienen natürlich bei allem mit, logisch. Aber Google ist ja auch selber eine Webseite, die Werbung anzeigt in den Suchergebnissen und darüber machen die halt die meiste Kohle. Also ihr Ad Network ist wahrscheinlich nicht so stark wie die Suche selbst. Natürlich. Also die können halt einfach die Preise aufrufen und wenn du nach einer Versicherung googlest, dann kostet halt ein Klick da oben auf so eine Werbeseite, also auf so einen Werbelink, kostet dich dann als Versicherung mal vielleicht 15 ein Klick.",
      "start": 1945854,
      "end": 1975434,
      "confidence": 0.93935126,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich habe mal gehört, besonders im Oktober rum, weil ganz, ganz lange galt ja im Oktober oder November kannst du die Autoversicherung wechseln. Das ist inzwischen aufgehoben worden. Du kannst die Autoversicherung ganzjährig jetzt wechseln.",
      "start": 1975522,
      "end": 1989058,
      "confidence": 0.9404451,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber jetzt ist der Preis das ganze Jahr teuer, oder?",
      "start": 1989114,
      "end": 1991802,
      "confidence": 0.866319,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, das weiß ich jetzt nicht, aber zu dieser Zeit war wirklich das Keyword Auto, Autoversicherung und so weiter, ist halt für diese Zeit damals durch die Decke gegangen, weil das natürlich ein Run war. Weil Autoversicherung denkt sich jeder kann nicht Geld sparen, zweitausendein CPC und um das.",
      "start": 1991866,
      "end": 2005568,
      "confidence": 0.92296344,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Noch abzuschließen mit einem Adblocker, 20 % ungefähr unserer User haben Adblocker eingeschaltet. Also die 20 % mehr werden zwar nicht zu bekommen, werden uns aber auch jetzt nicht mehr irgendwie finanziell sehr viel besser stellen.",
      "start": 2005584,
      "end": 2017720,
      "confidence": 0.90006,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, dann gehst du von 15 auf 18, liegen €0,18 pro Promille.",
      "start": 2017800,
      "end": 2022784,
      "confidence": 0.74022084,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Die Promille sind natürlich nur die, die wirklich angezeigt werden. Aber wir würden mehr Impressions haben. Natürlich. Also würden vielleicht 20 % mehr Impressions haben. Auf jeden Fall, was wichtig ist, jeder der ein side Project hat und glaubt, dass er das werbefinanziert irgendwie weiterbringen kann, sollte sich das mal durchrechnen. Also man kann damit ein bisschen Geld reinbekommen, aber das irgendwie sinnvoll zu machen, ist echt schwierig.",
      "start": 2022912,
      "end": 2046076,
      "confidence": 0.92093414,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da sind wir dann wieder beim Problem des ersten business Modells, das wir hatten. CPC und Co. Diversifikation anscheinend. Das hilft. Also Werbung kannst du als guten Inka machen, wie z.B. reddit hat es ja zweitausendein lange so gemacht. Reddit war ja auch eine Werbeplattform, wenn du so möchtest. Reddit hat natürlich auch das zugesätzliche Problem, dass Entwickler sehr, sehr gut sind oder beziehungsweise tech affine Leute und das sind eigentlich die Leute, die auf Reddit rumtouren, dass die Werbung sehr gut erkennen. Jetzt mit der ganzen KI Thematik hat Reddit aber ein zweites Standbein, und zwar kuratierten Content zu verkaufen, Training von LLMs und allem drum und dran. Und das Ÿousand macht ihn natürlich gerade sehr, sehr interessant im Börsenaspekt. Die hatten glaube ich letztes oder vorletztes Jahr auch ein IPO, also da muss man schon zusehen, da haben die sich auch schon diversifiziert. Zugegeben vielleicht auch ein bisschen Glück, dass die LLM Thematik dann kam und die KI Thematik, aber. Aber hey, ein bisschen Glück gehört ja auch dazu.",
      "start": 2046148,
      "end": 2103312,
      "confidence": 0.8912649,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und bei denen sieht man eigentlich auch ganz gut, die haben eine sehr spezifische Zielgruppe, weil die natürlich sehr genau sagen können, wer die Zielgruppe ist, also was für ein Ÿousand Themenbereich, zumindest durch die Subreddits. Und sie haben ein sehr spezifisches Werbeprodukt. Die zeigen dir nicht nur x beliebige Banner an, sondern da musst du dich ja anmelden und speziell textbasiert und so weiter meistens Werbung machen. Das heißt, die haben schon ein sehr spezialisiertes Produkt und trotzdem, meines Wissens ist Reddit nicht gewinnbringend, obwohl die ein sehr spezifisches Produkt haben. Und darum verkaufen sie ja auch die LLM Models ihr Zeug, weil sie nach Revenue Streams suchen. Zweitausendein.",
      "start": 2103376,
      "end": 2137015,
      "confidence": 0.9010321,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Im Intro habe ich zwar gesagt, das wird nur eine halbe Wirtschaftsepisode, aber ich widerlege mal wieder eine Aussage von dir, Reddit ist nicht gewinnbringend. Ich habe gerade mal nachgeguckt, die Quartalzahlen für Quartal drei im Jahr 24, die hatten eine Groß Margin von 90 %. Klassische SaaS, also Software as a Service Betriebe sind so ungefähr bei 75 80 und das ist schon top notch und einen Groß Profit zweitausendein von 313 Millionen, soviel ich das jetzt hier richtig interpretiere. Also dass die nicht gewinnbringend sind, weiß ich jetzt nicht. Ich weiß natürlich nicht, kommt das aus der Werbung? Das ist immer das Riesenproblem bei diesen ganzen Firmen. Das wird oft nicht ausgesplittet. Das ist genauso wie bei Amazon. Amazon gibt auch nicht immer raus, wie viel jetzt aus dem Retail Geschäft und aus dem Cloud Geschäft kommt. Ah doch hier und zwar Advertisement Revenue 300 fünfzehnte. Also die machen schon sehr, sehr viel aus ihrem Revenue, aus ihrem.",
      "start": 2137077,
      "end": 2196174,
      "confidence": 0.8935445,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wie viel ist der Prozentsatz dann?",
      "start": 2196262,
      "end": 2197654,
      "confidence": 0.8218833,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ah doch, ich habe gerade noch mal nachgeschaut, ich musste im Sheet ein bisschen runterscrollen. Reddit sieht 90 % aus ihrem Ads als Revenue. Aber ich würde zur Verteidigung deines Statements würde ich auch sagen, Reddit zählt ganz klassisch in das Volumen bzw. Massengame, weil auf Reddit ist ja schon echt viel los.",
      "start": 2197742,
      "end": 2217990,
      "confidence": 0.8611185,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ÿousand und sie haben relativ hohe CPM oder TKB Preise von fünf bis $8. Das ist natürlich schon dann auch ganz gut. Aber wie man da sieht, man braucht die spezielle Zielgruppe und natürlich auch spezielle Werbung. Also das klassische ich zeig einfach mal einen Banner an, wie es in den er waren funktioniert nicht mehr, weil in den ERN vielleicht noch zu Informationen waren die DKB Preise teilweise so 15 bis dreiig Euro. Also da konnte man mit einer kleinen Webseite auch noch gar verdienen.",
      "start": 2218030,
      "end": 2245238,
      "confidence": 0.88369673,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Lass uns mal zu einem Modell gehen, was wir alle kennen. Wenn du auf dein Konto guckst und dir die Monatsansicht einschaltest, wie viel Abbuchungen hast du regelmäßig jeden Monat zwischen drei und 25?",
      "start": 2245294,
      "end": 2258110,
      "confidence": 0.8960738,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich habe gar nicht so viele, aber ich habe gerade in letzter Zeit viele Abos abgeschlossen und jetzt bin ich an dem Punkt angekommen, wo ich merke, diese konkurrieren um meine Zeit gegenseitig. Also ursprünglich, wenn man sich so ein Abo Modell ja ausrechnet, kann ich das nutzen? Macht es Sinn? Dann kommt man meistens noch so zu einem Punkt okay, es macht Sinn, aber irgendwann hat man dann die Zeit nicht mehr, um alles zu nutzen. Und das ist bei mir jetzt gerade so der Fall.",
      "start": 2258120,
      "end": 2280618,
      "confidence": 0.94238424,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ihr habt es vielleicht schon selbst mitgekriegt, wir sprechen über Abo Modelle oder wenn man online unterwegs ist im Software as a Service Bereich, da fällt sowas drunter wie Netflix, Spotify, Amazon Prime, aber auch SaaS Anbieter wie Atlassian, Gyra Slack, Dropbox, vielleicht habt ihr bei Hetzner irgendeine Storagebox oder sowas, ist ja auch SaaS, wenn du so möchtest. Infrastructure as a Service, wenn du so möchtest, wenn ich mir da TB buche oder Amazon S oder ähnliches. Man kann das auch eigentlich als der Traum eines jedes Software Engineers, Indie Hackers beschreiben, weil das wird im Internet immer so als das passive Einkommen bezeichnet, aus dem Grund, weil es natürlich ein Multiplikationsfaktor ist. Du schreibst die Software oder das, was du da im Abo machst einmal, gilt natürlich nicht für Zeitungsabos, muss man auch suchen, eine Zeitung muss man jeden Tag neu machen oder jeden Monat oder jedes Quartal. Aber wenn man jetzt eine Software z.B. hat, dann schreibt man einmal eine Rezeptplattform und verlangt dafür Zugang monatlich Geld. Also das wird immer so als das passive Einkommen, als Einnahmequelle, monatliche oder jährliche Abonnentengebühren versprochen.",
      "start": 2280714,
      "end": 2348596,
      "confidence": 0.8949606,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wobei bei einer Zeitung ist es schon eigentlich dasselbe, weil du produzierst die Zeitung einmal ÿousand, egal wie viele Leute sie lesen, das heißt umso mehr Leute sie lesen, umso besser ist natürlich dein Revenue. Wo es ein bisschen anders ist, wäre jetzt als Fitnessstudio, weil du hast nicht unendlich viele Leute Platz in einem Fitnessstudio. Wobei die Idee bei einem Fitnessstudio Abo ist ja auch, dass die meisten Leute es dann nicht nutzen und einfach trotzdem zahlen. Das heißt du hast es auch wieder einen ähnlichen Effekt, aber die Skalierung ist natürlich bei einem digitalen Produkt am leichtesten, muss man schon auch sagen.",
      "start": 2348708,
      "end": 2378290,
      "confidence": 0.89084786,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, was ich spezifisch meine ist das, was du gerade Äpfel mit Bieren verglichen hast, Ÿousand, eine Zeitung, Tageszeitung musst du jeden Tag neu produzieren, du hast da nichts mit passivem Einkommen. Wenn du jetzt aber eine Software as a Service hast oder ein Fitnessstudio, du hast einmal den Initialaufwand, du stellst das Produkt dahin, deine Fitnessgeräte und dann läuft das. Und machst du jetzt mal drei Tage nichts am Fitnessstudio, also tauscht die Geräte aus oder machst keinen Code commit an deiner SaaS Plattform, dann kommt das Geld ja trotzdem rein. Das meine ich mit passivem Einkommen und so weiter und so fort.",
      "start": 2378370,
      "end": 2408244,
      "confidence": 0.8857194,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Was natürlich voraussetzt, dass du an deinem SaaS nichts ändern musst. Und jeder, der schon mal sinnvoll programmiert hat und mit sinnvoll programmieren meine ich jetzt seine Dependencies managt, weiß eigentlich, dass er nicht nichts ändern kann.",
      "start": 2408312,
      "end": 2422324,
      "confidence": 0.86534566,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Bitte platzieren sie hier irgendeinen Dad Joke über Node, JS und Dependencies, vielen Dank.",
      "start": 2422412,
      "end": 2426340,
      "confidence": 0.837145,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Auf das habe ich jetzt eigentlich nur gewartet, dass du mit Node JS um die Ecke kommst.",
      "start": 2426420,
      "end": 2429524,
      "confidence": 0.8743765,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du hast natürlich recht. Also das, was du da ansprichst, ist natürlich jetzt nicht nur applicable auf ein SaaS, auf eine Software, sondern auch für ein Fitnessstudio. Denn im Endeffekt hast du bei einem Abo Modell jeglicher Form natürlich enorme Herausforderung, wie z.B. kundenbindung durch kontinuierlichen Mehrwert. Die wenigsten Kunden schließen ein Abo ab und haben dies nach anderthalb Jahren noch. Wenn du nicht über die anderthalb Jahre Mehrwert geschaffen hast oder neue Features oder neuen Content oder neue Fitnessgeräte oder neues Zeitungsdesign oder neue Artikel, wie vor anderthalb Jahren, als du es abgeschlossen hast, dann hast du natürlich die große Herausforderung von Churn, also auf gut Deutsch Kündigungen. Leute, die dann Abo abgeschlossen haben, kündigen das Abo aus welchen Gründen auch immer. Vielleicht, wie du beschrieben hast, weil sie keine Zeit mehr im Leben haben, alle Abos zu nutzen. Vielleicht weil die letzte Preiserhöhung zu viel war. Vielleicht weil sie Netflix einfach durchgeguckt haben und sagen hey, da kommt jetzt keine neue Serie oder weil es einfach viel.",
      "start": 2429652,
      "end": 2485340,
      "confidence": 0.9277178,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Konkurrenz gibt und dann gibt es vielleicht bessere Produkte und selber hat man ja ein Produkt nicht weitergeschraubt.",
      "start": 2485380,
      "end": 2489788,
      "confidence": 0.8580267,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, ich glaube, ich glaube Netflix ist so das beste Beispiel mit den ganzen streaming News, Ÿousand, Netflix war einer der Flaggschiffe am Anfang, würde ich mal sagen, als das alles aufkam. Und jetzt hast du Disney und Apple Plus und RTL Plus und wie die Streaming Dienste alle haben. Und ich hab super viele Freunde, die sagen, ich kündige mein Netflix Abo auf monatlicher Basis, wenn ich sehe, da ist eine neue Serie, dann hole ich mir das wieder und wo es früher eigentlich war, ja, die €10 lass halt laufen, aber inzwischen sagen die ja Moment, dann habe ich Disney Plus, weil meine Tochter gerne Mickey Mouse guckt oder oder weil ich Star Wars Fan bin und dann hat der andere irgendwie Apple, weil die neue Silo Serie da läuft oder oder oder. Also ja, Churn und knallhart. Konkurrenz ist real, denn auch besonders bei diesen Streamingdiensten, hohe Investitionen für Inhalte sind da glaube ich maßgeblich. Und bei SARS oder beim Fitnessstudio wäre es dann neue Features.",
      "start": 2489844,
      "end": 2541052,
      "confidence": 0.89726955,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das einzige, was du glaube ich, machen könntest und das ist, was am ehesten funktioniert, ist bei Kreatoren. Heißt es so auf Deutsch? Kreatoren klingt schrecklich.",
      "start": 2541236,
      "end": 2549680,
      "confidence": 0.88197076,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Creators, Content Ersteller, Inhalteersteller.",
      "start": 2549720,
      "end": 2552752,
      "confidence": 0.74025,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, gar nicht nur um je nachdem, wie du Inhalte siehst, aber wenn du schaffst, irgendwie Inhalt zu erstellen, der lange konsumiert werden kann. Also unsere alten Engineering Kiosk Podcast Folgen natürlich, die werden ja viel konsumiert, aber ist die Frage, wie lange die konsumiert werden, wenn wir keine neuen nachschießen. Aber so ein ganz klassisches Modell, was funktioniert, sind z.B. musiker, die wirklich einen Hit haben, der über Jahrzehnte gespielt wird. Da hast du dann wirklich passives Einkommen. Oder wenn du vielleicht ein YouTube Video schaffst über einen historischen Inhalt, der nie veraltet und dadurch viel geschaut wird. Aber das sind so absolute Nischen, wo das vielleicht möglich wäre. Und sogar dann ist die Frage, ist die Aufbereitung vom YouTube Video nicht bald veraltet und es macht wieder jemand anderer neu?",
      "start": 2552776,
      "end": 2594020,
      "confidence": 0.91934955,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Gegenfrage wie viele Leute schaffen das? Von welchem prozentualen Anteil reden wir da? 0,000000. Ja, also dass jedes Jahr Wham mit einem Christmas Song um die Ecke kommt. Also ich glaube, das haben die sich auch nicht träumen gelassen.",
      "start": 2594100,
      "end": 2608768,
      "confidence": 0.90591305,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber das ist ja immer der Traum, den man so hat als als SaaS, vor allem als Entwickler. Ich denke mir das auch immer, dann macht man SaaS und dann wird es von Millionen von Leuten genutzt. Aber es ist. Ich würde sagen, es ist möglich, aber die Chancen sind natürlich auch sehr gering.",
      "start": 2608864,
      "end": 2622688,
      "confidence": 0.9292144,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, und da sprichst du eigentlich direkt auf einen anderen Irrglauben an, neben dem ich muss es erst mal schaffen, denn sorry, nicht jeder, der eine Firma gründet, macht das nächste uber ÿousand. Das, das ist, glaube ich, die ganz, ganz wenigsten. Ich glaube, es werden viel mehr Bands gegründet, die noch nie einen Hit hatten oder Start ups oder side Projects, die nie erfolgreich werden. Aber der Irrglaube ist eigentlich, dass du z.B. mit einem Abo Modell im allgemeinen Zeit gegen Geld entkoppelst. Du bist jetzt Berater, du bist Freelancer. In der Regel machst du brutal Zeit gegen Geld. Vielleicht hast du andere Angebotsmodelle. Ja, du machst projektbasiert, blablabla. Vielleicht rechnest du aber auch stundenbasiert. Das bedeutet, du arbeitest nicht, kein Geld kommt rein. Und der Irrglaube ist bei mit einem Abo Modell, da entkoppel ich den Value, den Gewinn, den ich bekomme, von meiner reingesteckten Zeit.",
      "start": 2622784,
      "end": 2674576,
      "confidence": 0.883103,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das stimmt natürlich auf der einen Seite auch, muss man ja dazu sagen. Was aber dann viele bei der Rechnung vergessen, ist die Zeit, die du schon bisher reingesteckt hast. Weil du hast vielleicht zwei Jahre Zeit reingesteckt, bis du zu dem Punkt kommst, wo du mal Kunden hast. Und das ist dann ein klassisches Investment und ein Game. Hast du dann viele User oder nicht? Und funktioniert es am Ende? Oder macht es dann jemand anderer nach, der gemerkt hat, oh, das Businessmodell funktioniert. Ist eigentlich ganz simpel. Kann das Ganze nachbauen, bin ich auch Entwickler und dann hast du schon einen Konkurrenten, der das ein bisschen weniger anbietet und bam sind deine zwei Jahre Investment wieder weg.",
      "start": 2674648,
      "end": 2707484,
      "confidence": 0.93729377,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, wenn du das so simpel sagst, Investment, dann klingt das so, ja ich mache mal Wochenende. Meines Erachtens nach, um das wirklich auf die Straße zu bringen, ist ein sehr hohes Pre Investment notwendig und das führt die ganze Sache natürlich wieder ad absurdum mit dem passiven Einkommen, denn ja das Einkommen ist nicht an die Zeit gebunden, die du letzte Woche reingesteckt hast, das ist richtig, sondern der Zeitraum den du betrachten musst, wird einfach nur ein bisschen gestretched, das halbe Jahr, das Jahr was du da reingesteckt hast oder vielleicht machst du das Projekt schon mehrere Jahre, das ist eigentlich die Zeit die du runter rechnen musst und wenn du dann Einkommen rechnest, dann bist du weit unter Mindestlohn denke ich mal. Ÿousand relativ schnell, wenn es denn erfolgreich.",
      "start": 2707572,
      "end": 2744476,
      "confidence": 0.9147027,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und es ist auch gar nicht so leicht und da haben wir glaube ich auch schon öfters darüber gesprochen, Sales Kunden an Land zu ziehen, das musst du ja immer machen, weil die Churn Rate, wie du gesagt hast, also die Leute die kündigen, die hast du ja immer und ich habe gerade mit einem Freund gesprochen, der ein sehr gutes SaaS Business eigentlich hat und es gut läuft und er irgendwie gemeint hat, er hat irgendwie dreiig % Neukunden ungefähr pro Monat und dann hat er gemeint, aber es sind halt auch ungefähr dreiig % die Journey, das heißt eigentlich hast du am ende null, du hast ganz viel investiert, dreiig % Neukunden gewonnen, aber wenn dreiig % auch abspringen, ist so ein AI SaaS Modell, weil die halt einfach nicht mehr brauchen oder nicht mehr wollen, dann bist du halt bei null. Das heißt du musst mal erst schaffen mehr Neukunden zu generieren und zu bekommen, als die weglaufen und das ist natürlich gerade im BC Bereich oder in dem Bereich, wo du sehr sehr kleine Abo Summen hast, also irgendwie €9, €10, €20, ist es natürlich schon schwierig so viele Neukunden an Land zu ziehen.",
      "start": 2744548,
      "end": 2799728,
      "confidence": 0.89887786,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wie sagte ein Philosoph, wer nicht mit der Zeit geht, geht mit der Zeit und ja, die kontinuierliche Entwicklung ist halt notwendig, damit du nicht so viel churn hast und überhaupt noch relevant am Markt zu bleiben. Du hast auch andere Investments wie z.B. support, man kennt das ja immer, die Leute, die nichts im Abo Modell zahlen, vielleicht noch im Premium Tier sind oder ähnliches, die machen den meisten Support, aber da wollen wir jetzt gar nicht so tief reingehen. Es gibt aber auch dann eine Möglichkeit und zwar wenn wir immer von Abo Modell sprechen. Wir haben gerade Fitnessstudio genannt, Netflix, Spotify. Da sprechen wir natürlich über BC, Business to consumer Beziehungen. Ich mache ein Seitenprojekt oder der Wolfgang macht sein. Macht sein Führerscheinprojekt und die Kunden sind dann end consumer, also Privatleute nennen wir es mal. Wenn man da zweitausendein recht erfolgreich sein möchte, dann geht es in der Regel nur über niedrige Preise und hohes Volumen. Also hohes Volumen bedeutet eine sehr große Anzahl an Kunden. Und jetzt muss man sich einfach mal die geografische und demografische Lage ansehen. Der Wolfgang betreibt sein Führerscheinprojekt in Österreich. Als Faustregel sagt man, Österreich ist immer zehnmal kleiner als Deutschland. Wir haben circa. Wir Deutschen haben circa zweitausendein. 82 Millionen Leute sind wir glaube ich aktuell. Somit sind wir bei 8,2 Millionen in Österreich. Stimmt das, Wolfgang?",
      "start": 2799824,
      "end": 2881038,
      "confidence": 0.91338,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Mittlerweile sind es neun, aber die Zehner Daumenregel, der zehner Faktor passt noch immer ganz gut.",
      "start": 2881094,
      "end": 2885710,
      "confidence": 0.78281,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "So, jetzt hat der Wolfgang eine Führerschein Plattform. Jetzt muss man rechnen, von diesen 9 Millionen, wie viele Leute machen einen Führerschein ungefähr im Jahr? Und das ist jetzt eigentlich deine potenzielle Zielgruppe.",
      "start": 2885830,
      "end": 2899988,
      "confidence": 0.8624627,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau.",
      "start": 2900094,
      "end": 2900584,
      "confidence": 0.57418,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und wenn du jetzt einen pro Account hättest?",
      "start": 2900672,
      "end": 2903340,
      "confidence": 0.87434125,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Haben wir auch. Also da bekommst du dann keine Werbung.",
      "start": 2903640,
      "end": 2906080,
      "confidence": 0.896109,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wahnsinn. Von diesen. Ist eine schöne zu rechnende Zahl. Wie viele Leute haben dann diesen pro Account? Wir haben ja gerade gelernt, mit Werbung verdienst du ja nichts.",
      "start": 2906200,
      "end": 2916232,
      "confidence": 0.87823963,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist eine gute Frage. Da habe ich jetzt auswendig gar keine Zahlen.",
      "start": 2916376,
      "end": 2919824,
      "confidence": 0.8538177,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, aber.",
      "start": 2919912,
      "end": 2920360,
      "confidence": 0.72144,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber dreiig % haben wir User ungefähr, also Marktanteil von diesen und. Und wir verdienen auf jeden Fall weniger als mit der Werbung von unseren Paid Usern. Also das ist wirklich eine Handvoll im Monat.",
      "start": 2920400,
      "end": 2933106,
      "confidence": 0.8907466,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du hast einen guten Aspekt gebracht. Die machen ja einen Führerschein in Österreich. Das heißt ja nicht, dass die auf deiner Plattform sind, sondern du hast dreiig % Marktanteil. Das bedeutet, bei dir sind. Und jetzt sagst du, du verdienst noch weniger über das pro Modell. Also von diesen, keine Ahnung, sagen wir mal handvoll.",
      "start": 2933178,
      "end": 2949130,
      "confidence": 0.8877826,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also es ist niedriger, zweistelliger.",
      "start": 2949170,
      "end": 2951366,
      "confidence": 0.976216,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Okay, sagen wir mal 10. %.",
      "start": 2951498,
      "end": 2953062,
      "confidence": 0.843615,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, sind es gar nicht. Also ich glaube, wir sind eher bei 1 % in der Größenordnung. Vor allem wenn du 17 bist, wirst du nichts zahlen. Ganz einfach. Also die meisten, die Zahlen sind bei uns, glaube ich, irgendwelche Leute in der Middle Life Crisis, die den Motorradführerschein nachholen.",
      "start": 2953166,
      "end": 2966070,
      "confidence": 0.8376162,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und genau das ist es ja. Du brichst das so weit runter, dass du eigentlich nur einen Ausweg siehst, über Massevolumen zu gehen. Und das ist die Internationalisierung. Du musst also deine Reichweite erhöhen.",
      "start": 2966150,
      "end": 2979070,
      "confidence": 0.9566721,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ÿousand.",
      "start": 2979110,
      "end": 2979384,
      "confidence": 0.38582,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und jetzt kommt's. Was hast du denn für ein Produkt bei Führerscheinfragen? Der Führerschein sieht in Österreich anders aus als in Deutschland, als in Spanien, als in Italien und so weiter und so fort. Das bedeutet, die Internationalisierung ist unglaublich schwierig, weil du neue Content hast. So, das ist aber noch nicht alles. Jetzt stell dir mal vor, du hast ein Content Business, was sich leichter internationalisieren lässt als deine Führerscheinfragen. Dann musst du erstmal lernen, dass andere Kulturen das Internet anders verwenden, dass die Webseite anders aussieht, dass vielleicht das Farbspektrum anders aussieht. Vereinigte arabische Emirate, Zweitausendein oder oder Hebräisch, die die lesen von rechts nach links, glaube ich. Wir lesen von links nach rechts und so weiter und so fort. Also Thema Accessibility spielt eine Rolle. Und da bin ich jetzt nur im Web, da bin ich noch gar nicht physikalisch unterwegs, blablabla. Man merkt schon, das ist eine unterschätzte Herausforderung, was man beim passiven Einkommen wenn du deinen SARS machst, also immer wenn ihr sowas auf YouTube hört, rennt bitte.",
      "start": 2979462,
      "end": 3030882,
      "confidence": 0.91948014,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber jetzt kommt ja der Influencer auf YouTube um die Ecke und sagt, du kannst ja BB machen und dann bekommst du ja richtig Fettkohle.",
      "start": 3030946,
      "end": 3038122,
      "confidence": 0.9228528,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die Aussage ist auch nicht falsch, doch ich bringe mal ein bisschen Realismus rein. Wenn du als Business, also du als Firma mit Endkunden kein Geschäft machst, machst du mit anderen Businesses, mit anderen Geschäften Geschäft. So und hier ist es, wo ich gesagt habe, BC, niedrige Preise, hohes Volumen machst du bei BB reicht. Wenige Verträge bringen sehr viel Geld, da mit Firmen meist hochpreisigere Angebote da sind und du deswegen ein niedrigeres Volumen brauchst. Zweitausendein. Aber, jetzt kommt das Große aber, die Lead Times für BB Verträge sind oft sehr lang. Eine Lead Time ist eigentlich die Dauer, wo du das Gespräch mit einem potenziellen Kunden begonnen hast, bis der Vertrag unterzeichnet ist, bis klar ist, diese Firma gibt Geld bei dir aus. Je nach Modell kann das mal locker sechs bis 12 Monate Lead Time für einen Kunden sein. Das bedeutet natürlich nicht, dass du jeden einzelnen Kunden sequenziell behandeln musst. Das bedeutet nicht, dass du im Worst Case über drei Jahre Sales machst und hast du drei Kunden, kannst natürlich etliche Kunden parallel fahren. Was ich nur sagen möchte ist, du musst erstmal den Atem haben. Du musst erstmal den Atem haben, E Mails, Follow up und so weiter. Du musst dich erstmal da verkaufen und sagen, welchen Wert du eigentlich schaffst, damit der Kunde eigentlich weiß, wer soll mit dir reden.",
      "start": 3038306,
      "end": 3110016,
      "confidence": 0.92508507,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, oder du musst dich selber finanzieren oder den Sales Menschen, den du anstellst als Firma jetzt z.b. das heißt, du stellst ein Jahr eine Salesperson ab, die dann vielleicht irgendwann mal Revenue bringt. Das heißt, du musst extrem in Vorleistung noch gehen.",
      "start": 3110088,
      "end": 3122282,
      "confidence": 0.91818863,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nehmen wir mal wieder gesagt, die Salesperson kriegt dann blablabla. Mit den Benefits kamen wir gerade in der Podcast Episode auf. So, das bedeutet, im Worst case hast du eine Person für da sitzen und nach 12 Monaten ist der Vertrag unterzeichnet. Dann kam aber noch kein Geld rein, weil ja dann erst die Abodauer beginnt. Das ist z.B. unter anderem ein Grund, warum Sales Leute oft auf Provision bezahlt werden. Sie kriegen Cut von der Vertragssumme, die abgeschlossen wurden. Das incentiviert diese Leute natürlich auch recht früh wert für die Firma zu stellen. Ist nicht das einzige, nicht der einzige Grund, aber so läuft auf das sales Modell. Also falls ihr Vertriebler habt, die Vertriebler kriegen in der Regel ein Festgehalt und einen guten Anteil an Provision pro Vertragsabschluss.",
      "start": 3122386,
      "end": 3169074,
      "confidence": 0.8973767,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Es ist übrigens auch oft der Grund, warum die ganzen Enterprise Tarife bei Plattformen, obwohl dieselbe Leistung zweitausendein unter Anführungszeichen dieselbe Leistung angeboten wird, wesentlich höher sind. Also das ist oft gar nicht, um die Firma auszunützen, weil es eine Firma ist und die höhere Preise verlangen kann. Teilweise natürlich schon auch, aber wenn man das unter dem gesamten Aspekt sieht, wie viel Arbeit es ist, überhaupt mal ein Sales abzuschließen, da hast du viel mehr Kommunikation. Du musst wahrscheinlich mehr Videocalls machen mit einer Firma. Die erwarten sich auch was ganz was anderes von dir. Ich habe z.b. so mal eine Geschichte gehört von einem Service im Podcast Umfeld. Die haben dieselben Preise für Endkunden und Businesskunden, weil sie sagen, wir haben ja dasselbe Service, was wir anbieten. Es ist ja wirklich dasselbe Produkt, wir wollen da nicht höhere Preise verlangen, das wäre unethisch. Und die sagen aber, sie wollen jetzt keine Firmenkunden mehr haben, weil die sind so kompliziert, denen musst du nachrennungen Geld, die bezahlen die Rechnungen nicht, da musst du dort bei der Buchhaltung anrufen, dann wollen die irgendwelche speziellen buchhalterischen Dinge ständig wissen. Du hast viel mehr E Mails und so weiter. Klar, der Service ist dasselbe, was angeboten wird, aber der Aufwand mit einer großen Firma ist ein ganz anderer. Und darum gehen die jetzt wieder zurück auf die Endkunden, weil die gesagt haben, das ist komplizierter mit den Firmenkunden, anstatt die Preise zu erhöhen. Ist natürlich eine Einstellungsfrage, aber da sieht man einfach, wie viel mehr Aufwand das eigentlich ist und dass das eine andere Welt ist, diese BB Welt. Also ist nicht automatisch ganz viel Geld, es ist mehr Geld, aber auch viel mehr Aufwand.",
      "start": 3169122,
      "end": 3253628,
      "confidence": 0.91530395,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wir sprechen nicht so negativ darüber. Das heißt nicht, dass ihr es nicht versuchen sollt. Also vielleicht seid ihr einfach deutlich besser als alle anderen und ihr gebt Gas. Man muss sich aber einfach nur bewusst werden, warum die Lead Times so lange sind. Und zwar Firmen haben oft laufende Verträge mit anderen Firmen, vielleicht mit Services, die was ähnliches machen oder da müssen Details geklärt werden. Beispiel bei irgendeinem Cloud Business, wenn die irgendjemand eine Cloud Datenbank nimmt, dann ist es oft so, dass die Firma bereits irgendwelche jährlichen Commitments mit Google oder Amazon hat. Und dann muss man da ein bisschen gucken, okay, wie kommt man da, wie kommt man da rein, blablabla. Also das ist natürlich dann schon, aber versucht es. Aber das ist so ungefähr der Unterschied. BC niedrige Preise, hohes Volumen, hohe Anzahl Kunden. BB hohe Preise, niedriges Volumen.",
      "start": 3253724,
      "end": 3296704,
      "confidence": 0.8953477,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Jetzt haben wir drei Businessmodelle besprochen. Es gibt natürlich zahlreiche andere Business Modelle noch. Also wir haben ja im Podcast schon öfters über Open Source Business Modelle im speziellen gesprochen. Also kann man überhaupt mit Open Source Geld verdienen? Z.B. gibt es da irgendwelche Modelle? Haben wir in Episode 59 besprochen, zweitausendein mit dem Frank Karliczek von Nextcloud haben wir mal gesprochen über sein Businessmodell mit Support und Lizenzen. Episode 86 sponsorware Model. Eine neuere Art von Business Modell haben wir in Episode 76 besprochen mit Martin Donath, der ein Open Source Produkt entwickelt. Es gibt natürlich abseits der Open Source Welt natürlich auch ganz viele Thematiken noch. Was ist, wenn ich z.B. hardware mitverkaufe, nicht nur Software? Wie schaut es mit dem ganzen Freemium Modell aus? Wer bezahlt mir diese kostenlosen Accounts, die wir überall bekommen bei Cloudflare und Co. Man kann natürlich Marktplätze aufbauen, das ist noch mal ein eigenes Thema für sich, wo es ganz viele Variationen gibt. Oder es gibt auch so Business Modelle, die irgendwie entstehen und teilweise gar nichts mit dem Kerngeschäft zu tun haben. Z.B. bei AWS, die das Cloud Business erfunden haben mehr oder weniger und eigentlich von Büchern verkaufen oder Produkte verkaufen, bei Amazon kommen. Oder auch wer z.B. about you kennt, diese Plattform ÿousand, die ja auch Kleidung, Schuhe und so Zeug verkaufen. Die haben auch mittlerweile Scale, das ist so eine Shop Plattform, die im Hintergrund verkauft wird. Und da sagt man heutzutage auch schon, dass die unter Umständen fast gleich viel wert ist wie das eigentliche Business. Slack ist damals aus einer Game Firma raus entstanden, also die Kommunikationssoftware, sowas gibt es auch immer, ist natürlich dann ganz was anderes, aber so entstehen dann auch neue Businessmodelle unter Umständen.",
      "start": 3296792,
      "end": 3391656,
      "confidence": 0.917152,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und vielleicht noch ein paar Beispiele für die Businessmodelle Hardware plus Service, was der Wolfgang gerade erwähnt hat, zu nennen. Tesla und Apple sind da natürlich ganz vorne dabei, aber auch Paletten und sowas bringt natürlich dann andere Herausforderungen mit sich.",
      "start": 3391728,
      "end": 3403164,
      "confidence": 0.8688971,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Die hat schon längst Pleite.",
      "start": 3403252,
      "end": 3404356,
      "confidence": 0.713146,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja genau, das ist ja nämlich die Herausforderung. Warum hatten die so einen Dip? Warum sind die, warum denkt Wolfgang, die sind pleite? Und zwar haben die initial diese teuren Fahrräder, ich sag mal mit einem großen iPad verkauft und der Service hinten dran ist das Abo Modell, dann irgendwie mit Fitnesskursen und Co. Und Spinning und allem drum und dran. Und natürlich haben die sehr viel Marge gemacht an diesen Fahrrädern, aber irgendwann hatte jeder ein Fahrrad und dann ging es nur noch auf diese Abo Modelle. Und dann musst du natürlich gucken, okay, wie erholt sich denn eine Firma von diesem Hypergross, den du initial hast? Da gibt es nämlich auch so ähnliche andere Firmen, wie z.B. irgendwie Fitnessspiegel. Das ist eigentlich ein Spiegel mit einem Tablet drin und der zeigt dir dann nicht nur Wetterdaten an, sondern wie du dich bewegen sollst und so. Also das hat dann ganz andere Herausforderungen. Oder Freemium Modelle. Wie schaffst du es eigentlich, dein Free Tier so attraktiv zu halten, dass es genutzt wird, aber nicht zu attraktiv, damit alle Leute nur das Free Modell nutzen, sondern auch in den Paid Service gehen und so weiter sofort.",
      "start": 3404468,
      "end": 3458584,
      "confidence": 0.9008828,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber um mal zurückzukommen zum technischen Bereich, was hilft mir jetzt als Entwickler, als Entwicklerin, dieses ganze Wissen, diese ganze Business Bullshit?",
      "start": 3458672,
      "end": 3468264,
      "confidence": 0.91231227,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wolfgang, als erstes änderst du meine Attitüde und streichst das Wort Business Bullshit mal aus deinem Sprachgebrauch. Besonders wenn wir darüber reden, dass du mehr Gehalt zweitausendein haben möchtest und dass du in Seniority advancen möchtest und vielleicht eine Beförderung. Denn ich als dein Manager, wenn du mir ankommst und sagst, kannst du mir den ganzen Business Bullshit mal erklären? Dann sage ich, geh mal nach Hause, ich glaube, wir sprechen uns nächste Woche noch mal wieder. Wenn du deine Attitüde überarbeitest, kannst du dich damit identifizieren, okay, Andy, wie kann.",
      "start": 3468352,
      "end": 3496886,
      "confidence": 0.8902178,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich jetzt dieses umfangreiche Business wissen, was ich mir jetzt erarbeite, sinnvoll und taktisch einsetzen in meiner täglichen Arbeit? Und auf was muss ich arbeiten zweitausendein?",
      "start": 3496918,
      "end": 3505960,
      "confidence": 0.92940617,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "So Wolfgang, jetzt reden wir miteinander. Also im Endeffekt fragt euch einfach mal, okay, die Firma, für die ich arbeite, wie verdient ihr jetzt einfach Geld? Klar, wenn ihr jetzt irgendwie für ein Amt arbeitet, für den deutschen Staat ist das glaube ich, ein bisschen anders. Die müssen ja nicht wirklich Geld verdienen, bzw. Die Steuergelder sind da und da ist nicht die Herausforderung, wie kriege ich mehr Steuergelder hier rein, wobei da auch die.",
      "start": 3506070,
      "end": 3527052,
      "confidence": 0.9280987,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Frage ist, wie kann ich was optimieren und nach was werde ich bezahlt? Weil auch die Steuergelder werden irgendwie aufgeteilt. Also eine Uni bekommt vielleicht Steuergelder, je nachdem, wie viele Studenten es dort gibt oder wie viele Studierende abgeschlossen haben. Also es gibt schon immer irgendwelche Metriken, die auch am Ende dieses Geld in irgendeiner Form beeinflussen, auch bei staatlichen Organisationen.",
      "start": 3527076,
      "end": 3547560,
      "confidence": 0.9147567,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, das stimmt schon, aber vielleicht ist das Ministerium nicht in der Lage, immer den Entscheidungsprozess, wie viel Budget einem Ministerium zur Verfügung steht, zu beeinflussen, weil das irgendwie drei Level höher bestimmt wird. Also Beispiel ist jetzt gerade Krieg, dann wird mit hoher Wahrscheinlichkeit das Verteidigungsministerium nächstes Jahr Jahr ein bisschen mehr Geld kriegen, um sich dann wieder zu schützen, weil es dann immer für so Hype Themen in der Politik geht. Aber das schieben wir jetzt mal zur Seite, weil das ist ein sehr spezieller Case. Was man aber machen kann, ist erstmal okay, wie verdient mein Arbeitgeber eigentlich Geld? Und was ich viel wichtiger finde, welche Herausforderungen gibt es da eigentlich? Also womit kämpfen die Führungspositionen und Manager denn wirklich den ganzen Tag? Denn das, was wir gerade so ein bisschen erzählt haben mit diesen Herausforderungen, das ist ein Key Part der Arbeit von den Top Managern in der Hierarchie über euch. Das ist die eine Baustelle. An die zweite Baustelle würde ich sagen, versuch mal das Business Lingo so ein bisschen zu verstehen. Wenn ihr mal durch euer Wiki klickt oder vielleicht seid ihr irgendwie public listed und wenn ihr euch durch diese Reports mal guckt, klickt, die ihr dann jedes Jahr oder jedes Quartal veröffentlichen müsst, dann werdet ihr da so zahlen wie Customer Acquisition Cost, nennt sich Kack oder LTV Lifetime Value, also Customer Lifetime Value oder Retention und Conversion Rate zweitausendein sehen oder Cost per Müll, Cost per Klick, CPS, was wir jetzt auch in diesem Podcast mal gedroppt haben. Versucht diese Key Kennzahlen, die im Top Management Dashboard eigentlich präsent sind, mal zu verstehen.",
      "start": 3547600,
      "end": 3634468,
      "confidence": 0.9090064,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und das sind meistens auch genau die, wo du gesagt hast, die Challenges, mit denen sich dieses top Management beschäftigt, sind meistens genau diese Metriken. Also das hängt meistens in irgendeiner Form zusammen, sonst sind es eigentlich die falschen Metriken. Also die Metriken bestimmen das ja auch in der irgendeiner Form. Darum ist es auch so wichtig, die zu verstehen.",
      "start": 3634564,
      "end": 3650748,
      "confidence": 0.93649167,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und als zweiten Schritt, wenn ihr wisst, was diese Zahl bedeutet, dann fragt doch mal eure Vorgesetzten nach einem Revenue Breakdown per Abteilung oder per Business unit. Denn wenn ihr mehrere Produkte anbietet, wenn ihr mehrere Services anbietet, dann gibt es in der Regel keine Ahnung, ihr habt ein werbungs Business und dann habt ihr noch ein hardware Business und dann habt ihr noch irgendwas anderes. Dann gibt es meistens einen Revenue Breakdown, dass das Hardware Business 50 % einspielt und die anderen beiden 25 und so weiter. Ÿousand, um einfach mal zu verstehen, wer ist eigentlich der Revenue Driver hier? Was ist mehr oder weniger Research Development oder Innovation und ist die zukünftige Wette von der Firma? Weil so könnt ihr euch dann auch mal positionieren ein bisschen für die Zukunft. Wollt ihr lieber am Revenue Driver, am Core Produkt arbeiten oder wollt ihr mehr innovativ arbeiten? Das ist aber dann eher auch eine Wette, weil wenn es der Firma schlecht gehen kann, werden diese Innovationsprojekte oft eher abgesägt und das kann dann auch im Worst Case zu Layoffs führen. Aber wenn ihr das versteht, wie die Firmenstruktur und wie die Revenue Struktur eurer Firma anhand der Key Metriken aufgebaut ist, dann könnt ihr euch natürlich auch so ein bisschen positionieren. Das klingt jetzt so ein bisschen sehr egoistisch, aber im Endeffekt ist es auch hilfreich für die Karriere, auch an den top Projekten mitarbeiten zu können.",
      "start": 3650844,
      "end": 3724514,
      "confidence": 0.92582166,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und wenn man es schafft, in irgendeiner Form einen Wunsch oder ein Projekt, das man selbst hat, zu connecten mit diesen Key Metriken zweitausendein mit diesen KPIs, die es irgendwo gibt. Wenn ich beweisen kann, dass mein Refactoring jetzt irgendwo einen Impact hat oder auch die time to market z.b. verringern kann, dass sie einfach mehr Features rausbringen kann. Und das ist ein großes Problem, dass es so eine lange Feature Liste gibt und habe da irgendwelche Blogs drinnen, die dann lösen kann. Wenn ich das schafft, dann werde ich mich auch viel leichter tun in irgendwelchen Diskussionen oder Argumentationen mit meinem Po, mit der Projektmanagerin, was es auch immer.",
      "start": 3724562,
      "end": 3759696,
      "confidence": 0.9145002,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und wenn ihr die Revenue Struktur habt, dann könnt ihr mal anfangen, eure tech Entscheidungen zu den ganzen thematischen Bereichen zu connecten. Denn dann könnt ihr auch wirklich sagen okay, in meiner Business unit, in meiner Abteilung, daher kommt das Geld, wenn ich das optimiere, hat das einen positiven Einfluss auf die Stelle da links und das hätte Möglichkeit, die top KPI zumindestens für unser Department zu verbessern und so weiter.",
      "start": 3759848,
      "end": 3786640,
      "confidence": 0.95214844,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also es geht aber auch in die andere Richtung, muss man sagen. Ich glaube, dass es auch wichtig ist, dass man als technische Person versteht, dass vielleicht die Optimierung an irgendeiner Ecke um 0,005 % einfach keinen großen Impact hat gerade. Oder wenn man ein kleines Feature entwickeln will, wo man sagt ja, das ist ja nur eine Woche, wir sind zu zweit, wir machen das in einer Woche, wenn man das jetzt umrechnet mit unserem Jahresgehalt, dann sind wir da irgendwo bei Euro. Und da musst du schon mal sagen, hat es wirklich €8000 Wert? Und wenn es dann heißt, z.B. ich kann jetzt da irgendwo €100 einsparen, weil irgendwo ich kann den Server einsparen um €100 irgendwo, dann musst du bei Euro schon mal fünf Jahre diesen Server haben, damit sich das überhaupt rendiert am Ende. Also man kann das schon relativ hart rechnen und es ist manchmal auch gar nicht schlecht, so eine Rechnung durchzuführen.",
      "start": 3786680,
      "end": 3835042,
      "confidence": 0.9254578,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und jetzt kommt noch was, was ich über die Jahre gelernt habe. Immer wenn ich mit Mitarbeitern über diese Themen gesprochen habe und die waren doch alle immer sehr interessiert dran, dann mehr zu wissen und auch zu wissen, was habe ich denn für einen Impact? Weil im Endeffekt ist das, was du später in deinem Performance Review, in deinem jährlichen Performance Review beweisen musst, welchen Impact hattest du? Dann sagen die, ja, aber ich kann die Zahl ja gar nicht auslesen, weil ich kenne die ganzen Gehälter ja von meinen ganzen Mitarbeitern jetzt nicht. Ja, das stimmt wahrscheinlich. Es sei denn, ihr arbeitet irgendwie bei einer Firma, wo Gehälter transparent sind oder nach Tarif bezahlt wird, alles gut. Es ist aber auch so, es geht da nicht um die absolute Zahl, es geht um eine Hausnummer, es geht um einen Überschlag. Ÿousand verzaht euch nicht auf die absolute Nachkommastelle oder auf den Euro oder ähnliches. Denn wenn es um die KPIs geht, dann wird meist in Hunderter oder Tausender oder Zehntausender oder teilweise sogar in Millionen Schritten gedacht. Wenn ich jetzt mal an Thyssenkrupp denke oder sowas und die irgendwas am Hochofen optimieren, da sprechen die nicht über €100, da sprechen die über Millionen. Deswegen meist reicht ein Daumen über Schlag oder nicht Pima Daumen, Pima Auge reicht ja auch. Von daher, dann macht ihr drei Rechnungen, einmal eine Worst Case Rechnung, einmal eine Best Case Rechnung und dann eine Median oder eine arithmetische Mittelrechnung einfach in der Mitte, damit man wenigstens mal eine Spanne hat und weiß, wovon man redet.",
      "start": 3835106,
      "end": 3910582,
      "confidence": 0.91231763,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Jetzt haben wir natürlich sehr viel über Business Metriken und so gesprochen und die auch sehr positiv dargestellt. Mir ist schon wichtig auch zu sagen, man soll nicht alles anhand dieser Metriken berechnen, das haben wir ja oft genug besprochen. Es geht auch darum, dass die Leute glücklich sind, dass man vielleicht eine Codebase hat, wo man Spaß damit hat und nicht nur immer hardcore businessorientiert arbeitet und die Code Qualität ist komplett egal und man ist dann nur mein Code Monkey am Ende. Also es ist schon die Balance da, aber wir haben jetzt sehr stark auch darauf hingewiesen, weil es oft komplett weggelassen wird und es gehört meiner Meinung nach einfach zum Kontext dazu. Man muss das einfach mitdenken und es ist vielleicht nicht alles, aber es ist ein sehr wichtiger Wort Punkt oder Bereich dem einfach mitdenken muss, wenn man sich überlegt was macht man, was macht man für Projekte und wieder Andy zu Beginn gesagt hat, wenn man in Staff Senior Plus level einsteigt, dann wird es einfach immer immer wichtiger und das ist einfach dieser Mindset Shift, den man langsam vollziehen muss, dass Technik nicht alles ist. Es ist viel, aber auch Business ist viel, weil irgendwer muss am Ende die Euro und hat Euro pro Mitarbeiter in.",
      "start": 3910646,
      "end": 3976920,
      "confidence": 0.91862625,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die Zahlen, die wir genannt haben sind Beispielzahlen. Wenn ihr jetzt keine verdient, macht euch bitte keinen Druck sind halt einfach prozentual unglaublich einfach zu rechnen, damit ich das schnell im Kopf zahlen kann, denn ich bin anscheinend zu blöd auch CPM Werte und Cost per Mail für Wolfgangs Ad Business auszurechnen. Also von daher macht euch da keinen Druck. Zwei Sachen noch eine Sache ist ihr müsst nicht immer höher schneller weiter Midlevel Engineer zu bleiben ist völlig fein, Senior Engineer zu bleiben ist völlig fein. Zweitausendein also diese Stellen werden auch gebraucht und wenn ihr da happy seid, seid ihr da happy. Ihr müsst nicht immer höher schneller weiter.",
      "start": 3977100,
      "end": 4011326,
      "confidence": 0.91536695,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wobei es da auch nicht schadet ein bisschen Business Verständnis zu haben.",
      "start": 4011438,
      "end": 4014622,
      "confidence": 0.90991,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja schaden tut sowas nicht, ganz klar. Und die zweite Thematik ist macht euch bitte nicht den Druck die ganze Thematik innerhalb von einer Woche zu lernen. Ich habe Wirtschaftsinformatik studiert. Allein dieses Bachelorstudium, was laut Wolfgang Knoxler Vater kein Studium ist, aber ist eine andere Geschichte. Allein das ist dreieinhalb Jahre und ja diese dreieinhalb Jahre sind nicht nur Wirtschaft und nicht nur Customer Lifetime Value und allem drum und dran auch gut, aber die ganze Sache zu verstehen, mit Leuten zu sprechen, sich eigene Fragen zu überlegen und wirklich tief zu verstehen braucht einfach Zeit. Gebt euch einfach ein zwei drei Monate, wo ihr mal ein bisschen drüber nachdenkt, vielleicht ein bisschen mit ChatGPT darüber sprecht. Sucht einfach mal das Gespräch zu eurem Vorgesetzten, zu eurer Vorgesetzten. In der Regel sind die sehr glücklich, wenn ihr mit solchen Fragen ankommt. Es zeigt natürlich intrinsische Motivation außerhalb deiner.",
      "start": 4014686,
      "end": 4059576,
      "confidence": 0.910935,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Java Code und wenn wir erwarten, dass unsere pos z.B. unsere technischen Metriken verstehen, dann ist es ja nicht zu viel verlangt, dass wir auch die Business Metriken verstehen. Also ich glaube das ist einfach eine gegenseitige Wertschätzung wenn man zusammenarbeitet.",
      "start": 4059608,
      "end": 4074906,
      "confidence": 0.91512734,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "That's it. Und wenn du diesen Satz noch hörst, dann bist du einer der 50, %, die ich in den ersten 5 Minuten nicht verloren. Vielen Dank, ich hoffe, das war interessant. Gibt uns doch mal Feedback, was ihr davon haltet, weil es nicht technisch war, jetzt auch nicht wirklich wirtschaftlich, muss ich zugeben, war eher so halbding. Aber im Endeffekt, meines Erachtens nach, kann man die ganze Sache zu einem späteren, erfahrenen Zeitpunkt nicht mehr trennen. Und auch wenn ihr mal irgendwann selbstständig sein wollt oder werden wollt.",
      "start": 4074978,
      "end": 4100270,
      "confidence": 0.9150244,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Oder mit eurem side Project.",
      "start": 4100350,
      "end": 4101582,
      "confidence": 0.947076,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Oder mit eurem side Project, dann kommt ihr um sowas nicht herum. Und wenn ihr noch mehr Episoden haben wollt, dann müsst ihr uns ab und zu mal mit Koffein füttern. Ihr könnt uns auch mal einen Kaffee ausgeben unter buy me a coffee. Den Link findet ihr in der Show Notes, aber auch natürlich alle anderen Links, die wir hier genannt haben. Zweitausendein. Ansonsten würde ich sagen, hab Einen schönen Tag, bis später und tschüss.",
      "start": 4101646,
      "end": 4121388,
      "confidence": 0.92285866,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ciao.",
      "start": 4121484,
      "end": 4121700,
      "confidence": 0.56235,
      "speaker": "B",
      "channel": null
    }
  ],
  "confidence": 0.9058414,
  "audio_duration": 4063,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}