{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/j9Je45ddtsG3k3d/download/ep186_kunst.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "multichannel": null,
  "audio_channels": null,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "8071d453-4e34-4a00-aefa-7ebcb6e9828e",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Ab und zu gibt es so Momente im Leben, da kommt ein Thema einfach mal wieder, was irgendwie ganz selten auf deinen Tisch kommt. Und zwar geht es heute um folgendes. 2014, also vor knapp 11 Jahren, war ich mal auf einem Hackathon in Hamburg. Ich glaube, der hieß Geekets Hackathon. Das ist eine Frauenvereinigung oder ein Verein für Frauencoding und ich glaube, die kommt mal aus der Ruby Ecke. An diesem Hackathon hat ein Projekt gewonnen, was ein Kunstwerk genommen hat und zwar eins von Pete Mondrian. Wer ist pete Mondrian? Pete Mondrian war ein niederländischer Maler der klassischen Moderne, der mit der Pane köken und auf den Vietz fährt. Und der hat ein Bild, das nennt sich Komposition mit rot, blau und Gelb. Und wer das nicht kennt, der kann auch mal in die Show Notes springen, da haben wir einen Link, wie das Bild aussieht. Im Endeffekt ist das ein Bild mit Rechtecken und Quadraten und die sind aneinandergereiht und haben dann rot und grün und blau als Farbe. Also jetzt eigentlich jemand wie ich, der nichts von Kunst versteht, wird sagen, okay, bunte Quadrate. Auf jeden Fall war das hackathon Projekt dann so, die haben sich das Bild genommen, haben das dann irgendwie in DJs oder Graph Js oder sowas gepackt und haben dann durch die Größe dieser Rechtecke und der Quadrate und durch die Farbe das Wetter visualisiert. Also wurde dann irgendwie mehr blau, dann gab es heute mehr Regen und irgendwie mehr gelb und mehr rot, dann war es irgendwie fröhlich und da gab es irgendwie so Sonne und so. Und die haben diesen Hackathon gewonnen und ich saß in der, ich saß nicht in der Jury, ich saß im Publikum und fand mega geil, sowas würde ich mir auch zu Hause hinlegen. Ich verstehe zwar nichts von Kunst, aber das finde ich cool, weil das ist halt schon irgendwie so, du versteckst so ein bisschen Informationen, dass das sieht ein bisschen schick aus, ist dynamisch, also es ist auch nicht langweilig, wenn ich das in der Küche hänge. Wahnsinn, habe ich mir gedacht. So, und dann bin ich halt nach Hause gefahren und dann habe ich von dieser Art von Programmierung eigentlich nie wieder was gehört. Wie gesagt, das war 2014 und wenn ich jetzt sage die Tage, dann meine ich in Anführungszeichen die Tage. Ich mache jetzt gerade hier so in Anführungszeichen mit den Händen, kam der Wolfgang um die Ecke mit einer Person aus diesem Bereich. So, Wolfgang, wen hast du vorgeschlagen für.",
      "start": 88000,
      "end": 217270,
      "confidence": 0.90977645,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Diesen Podcast aus diesem Bereich? Das klingt so aus diesem fremden Kosmos, aber es stimmt ja schon, man hat da ja auch als technische Person irgendwie weniger mit zu tun. Aber wir haben halt Sabine zu Gast. Bei uns. Und ich habe Sabine auch so ähnlich wie dein Hackathon eigentlich kennengelernt, und zwar auf einem Event in München. Und wenn ich mich richtig erinnere, Sabine, hast du da echte Bilder umgewandelt in gescribbelte Bilder, die aber automatisch gedruckt wurden auch. Und ich kann mich noch erinnern, dass bei deinem Drucker eine Riesentraube stand. Also es war ja irgendwie so Innovation schlag mich tot vom Media Lab Bayern, so ein großes Event, wo wirklich aus der medienszene Gott und die Welt vor Ort war, aber die richtig große Traube war bei deinem Stand eigentlich und bei deinem Druck. Ich persönlich hätte ja auch gern so was gehabt, aber ich habe ja gar nicht durchschlagen können zu dir. Vielleicht kannst du kurz erklären oder zuerst mal willkommen bei uns im Podcast. Aber was hast du da gemacht? Kannst du es noch mal in deinen Worten fassen und nicht meine laienhafte Darstellung?",
      "start": 217310,
      "end": 279806,
      "confidence": 0.92482346,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja. He, freut mich sehr, dass ich da sein darf bei euch. Genau, das war das Media Innovation Festival in München. Genau, das Projekt heißt Pattern Portrait und ich habe da so einen Stiftplotter dabei. Also so, ich glaube, wer d Drucker kennt, der kann sich ein bisschen was vorstellen. Also ein Gerät, was so in drei Achsen verfahren kann. Man kann einen Stift reinklemmen, kann ich das mit dem Computer steuern und dann kann das zeichnen. Und ich hatte noch eine kleine, ganz alte, schlimme Webcam dabei. Damit kann ich kleine Fotos von Leuten machen. Das läuft durch einen Algorithmus von mir durch. Das ist so ein kleines neuronales Netz, das ist trainiert auf so Scribbles von mir. Und dann zeichnet das, man muss sagen, sehr verfremdete Porträts der Leute, die ich da abfotografiere.",
      "start": 279918,
      "end": 321658,
      "confidence": 0.9154893,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Da hast du dann Porträts von den Leuten gemacht, oder? Und die wurden dann D gedruckt?",
      "start": 321754,
      "end": 327880,
      "confidence": 0.9092381,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, also die werden gezeichnet. Also du kannst dir das vorstellen. Also ist ein bisschen wie ein d Drucker, also ein Gerät, was verfahren kann im Raum, aber du kannst da halt einen Stift reinstecken, statt dass Filament rauskommt. Ja, so kriegst du halt was aufs Papier und dann zeichnet das Gerät.",
      "start": 327960,
      "end": 340408,
      "confidence": 0.92406267,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also ist das irgendwie so ein Mix zwischen C, C Fräse und d Drucker mit Stift?",
      "start": 400504,
      "end": 404520,
      "confidence": 0.93492186,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, also CNC Fräse trifft es ziemlich gut auch. Ja, genau.",
      "start": 404600,
      "end": 407740,
      "confidence": 0.9421727,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube, es ist das, was die ganzen Präsidenten so haben, um ihre Unterschriften zu machen. Weil ich kann mir kaum vorstellen, dass die so viele Unterschriften machen. Das macht sicher schon eine Maschine.",
      "start": 408320,
      "end": 416700,
      "confidence": 0.9534835,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also es gibt echt so signature Geräte, die machen genau das da. Die können genau unterschreiben, einfach nur Dokumente.",
      "start": 417740,
      "end": 424660,
      "confidence": 0.94445366,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube, wenn du, wenn du, ich glaube, in Deutschland, wenn du vier oder fünf Kinder hast, ich glaube, dann wird irgendwie der Bundespräsident irgendwie auch automatisch irgendwie so halb Pate von deinem Kind oder so.",
      "start": 424740,
      "end": 433028,
      "confidence": 0.9380447,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Und dann Moment, was habt ihr da in Deutschland? Ich muss mein Kind abgeben, wenn ich fünf Kinder kriege.",
      "start": 433084,
      "end": 437720,
      "confidence": 0.8864732,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Nur wenn du ein Kind hast und einen Paten hast, heißt das ja nicht, du musst dein Kind an den Paten abgeben, sondern wenn du halt irgendwie ganz viele Kinder hast, vier oder fünf oder drei, dann wird der Bundespräsident automatisch paten und der muss dann auch immer eine Karte unterschreiben und dann kriegst du auch eine Karte nach Hause. Sehr wahrscheinlich sind das dann solche Maschinen. Aber wir sind schon eigentlich mitten im Thema. Deswegen möchte ich ganz kurz noch eine Sache vorziehen. Und zwar möchte ich den Hörerinnen und Hörern einfach mal vorstellen, wer du denn eigentlich bist. Weil wir sprechen jetzt gerade so, als hätten wir schon sieben Kaffee hinter uns und sind gerade nämlich beim ersten Schnaps. Aber Sabine, wer bist du? Die meisten Leute kennen dich unter dem Namen Blieb Track. Das ist nämlich dein Künstlername. Und wenn man danach googelt, dann findet man auch sehr viele Artikel und Videos und so weiter und so fort über deine Arbeit, denn du sprichst sehr viel über deine Arbeit. Z.B. habe ich dich in der Vorbereitung beim ach C gefunden. Das ist der Chaos Computer Club Kongress, der dieses Jahr wieder stattgefunden hat. War glaube ich, die acht und dreiigste Version in Podcast, wie bei Frauen und Technik beim Dev Env Podcast. Du warst sogar mal im lokalen Fernsehen. Bei Regio TV habe ich dich auf YouTube gefunden. Du hast teilweise Erwähnungen und Artikel im heise Magazin Make. Du warst Teil beim Girls Day, dem Mädchen Zukunftstag und hast da ein bisschen was über Kunst und kreative Kunst und so weiter auch erzählt. Aber in deinem, kann man sagen, realen Leben oder akademischen Leben hast du Medieninformatik studiert und dann dich in deinem Master auf Machine Learning fokussiert. Das hast du alles an der Universität in Ulm gemacht. Aktuell bist du Doktorandin im Institut für Neuroinformatik und beschäftigt mich mit Achtung, computational creativity. Was das letzte ist, schauen wir gleich auch noch mal. Du verbringst somit sehr viel Zeit mit dem Wort generativer Kunst. Das kannte ich auch noch nicht. Jetzt sind wir gerade schon im Buzzword Bingo mit Maschinen learning, generativer Kunst und Co. Selbst bezeichnest du dich als freelancing creative technologist. Und das habe ich jetzt erst mal versucht zu übersetzen. Freischaffende kreative Technologistin. Ich weiß gar nicht, ob es dafür irgendeine Übersetzung gibt. Und vor kurzem dazu möchte ich dir auch noch gratulieren wurdest du zum open Hardware Fellow der Open Source Hardware Association gekürt. Meine erste Frage was ist die Open Source Hardware Association und was macht die und welche Aufgabe hat ein Open Hardware Fellow?",
      "start": 438540,
      "end": 570252,
      "confidence": 0.9176926,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Oshwa Genau, genau. Die machen praktisch ein NGO aus den USA, wie man schon sagt, Open Source Hardware ist so ein bisschen erstmal so ein weirder Misch. Ich glaube, Open Source in der Software ist wahrscheinlich allen Hörer innen bekannt irgendwie. Und das gleiche Konzept wird halt auf Hardware übertragen. Also was muss passieren, damit Hardware für jeden irgendwie einsehbar und auch vielleicht replizierbar ist? Und da haben die sich halt mal irgendwie schöne Guidelines überlegt. Da geht es darum, wie veröffentliche ich Schematiken für Platinen, wie veröffentliche ich die Firmware von Platinen. Und die machen halt auch einmal im Jahr so einen großen Summit, so ein großes Treffen. Und die Fellows sind eigentlich Leute, die halt gerne mehr irgendwie in diese Hardware Ecke einsteigen möchten. Da kann man sich drauf bewerben mit dem, was man so gemacht hat und dann finanzieren die einem eigentlich halt die Reise und man hat dann auch so ein bisschen Connection Möglichkeiten, kriegt so ein paar Mentoren an die Hand, mit denen man sich unterhalten kann und sowas. Genau, aber im Grunde ist es das Open Source Prinzip von reiner Software übertragen im Grunde auf alles. Also man darf jetzt auch nicht nur Hardware denken als Hardware in Platine oder in Computer oder so, sondern keine Ahnung, Hardware in wie destilliere ich Parfüm oder sowas. Also da gibt es die wildesten Sachen, die da auch eingereicht werden. Also im Grunde, wie kann ich möglichst alles, was physisch ist, so veröffentlichen, dass es replizierbar wird?",
      "start": 570316,
      "end": 655312,
      "confidence": 0.92225146,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Immer wenn du an Parfüm destillieren, wenn du das versprichst, dann erinnert mich das an diesen Roman Das Parfüm, den habe ich in der Schule und dann gibt es auch einen Film vor und dann irgendwie komme ich immer wieder auf diese Massenorgie, die der dann da macht, wie die diesem Parfüm. Aber das sollte jetzt nicht Teil des Podcasts werden.",
      "start": 655416,
      "end": 670891,
      "confidence": 0.8953913,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Okay, probiere mal schnell abzulenken von diesem Thema. Schlimm genug. Meine Frage wäre noch, vielleicht ist das auch der Grund, warum ich einen Podcast habe. Mich interessiert ja immer eigentlich alles und ich möchte auch immer alles verstehen. Und das erste, was ich natürlich immer verstehen will, ist die Herkunft von irgendwie Wörtern und Namen. Und bei Bleep Track habe ich mir natürlich auch gedacht, Moment, hat es irgendwas zu tun mit deiner ganzen Kunst oder woher kommt das Wort oder ist es ein banaler Grund? Damals dein Username aus deiner Jugendzeit, ja.",
      "start": 670915,
      "end": 703692,
      "confidence": 0.9140997,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "So ein bisschen ist es ja. Es ist im Grunde der Username aus meiner Jugendzeit, nur nicht ganz der Username, sondern der Webradio Sendungstitel im Grunde. Also es gab hier so eine lokale, lokale Social Media Plattformen und eine davon hatte so ein Webradio, Webradio Community, die Hannah, die hat sich zusammen bei der GEMA angemeldet, dass man das halt legal machen darf und da durfte jeder, der Lust hatte so ein bisschen naja, Online Radio, Online Musik auflegen und ich habe Retro Computerspielmusik aufgelegt und genau das hieß dann blieb Track, also Track wieder Musik Track und blieb wie naja, wie halt so alte Midi Mucke klingt. Genau da kam das her. Da hatte ich dann die domain registriert und das ist dann kleben geblieben, einfach als Nickname. Genau.",
      "start": 703716,
      "end": 745750,
      "confidence": 0.9122769,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also Andi, das hast du eindeutig vergessen. Midi DJ, das hätte schon in die Intro noch reingehört.",
      "start": 745830,
      "end": 751750,
      "confidence": 0.8922388,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, beim Girls Day hattest du das so beschrieben. OK, blieb ist so aus den alten DOS Spielen, aus den Arcade blieb blob. Ja, Track kommt dann auch so aus der, aus der Musikthematik. Das aber auch interessant. Aber wir sprechen schon so viel darüber, deswegen kannst du mir mal ganz kurz erklären, was generative Kunst ist, was ist kreativ coding? Weil für mich, wie bereits in Der Intro sagte, ich habe mit diesem Begriff eigentlich noch nie Berührung gehabt, bis auf dieses Hackathon Projekt, was von diesem Mondrian Bild, ich glaube das fällt darunter, das weiß ich aber jetzt erst 11 Jahre später. Das wusste ich damals noch nicht. Deswegen, was ist das oder was ist das nicht?",
      "start": 751830,
      "end": 790470,
      "confidence": 0.9078294,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also generative Kunst ist eine Kunstsparte, die ist eigentlich sogar schon verhältnismäßig alt, wenn man, ich glaube die Wikipedia Definition momentan, ich weiß nicht, ob die immer noch so ist, die klang total verkorkst. Das las sich so wie Kunst, die durch einen autonomen Prozess erzeugt wird oder so. Finde ich irgendwie kann man sich da so gar nichts drunter vorstellen. Das kann so alles und nix sein. Und ich finde immer ganz gut, Kunst, die durch ein Regelwerk erzeugt wird, finde ich immer so ein bisschen besser. Also ich könnte mir selber ein Regelwerk auferlegen und ich habe hier einen Würfel und wenn ich eine gerade Zahl würfel, mache ich rote Linien und wenn ich eine ungerade Zahl Würfel, zeichne ich blaue Linien oder sowas. Das wäre dann schon generative Kunst ohne Computer mit Zufall drin z.B. und genau so Regelwerk lässt sich halt hervorragend in Code gießen logischerweise. Und entsprechend ist halt das mittlerweile sehr verknüpft mit Kunst, die durch einen Algorithmus erzeugt wird, in welcher Form auch immer. Das kann dann irgendwie ziemlich hardcoded sein, aber da würde eigentlich auch jetzt die ganzen generative AI Sachen im Grunde auch drunter fallen. Und creative Coding ist eigentlich noch mal so die Community drüber oder außen rum. Also da muss es auch gar nicht mehr um Regeln gehen. Also Creative Coding umfasst eigentlich alles, was irgendwie spielerisch, kreativ mit dem Medium Code zu tun hat. Ich weiß nicht, ob ihr die Demo Szene kennt, das würde da auch reinfallen.",
      "start": 790570,
      "end": 871584,
      "confidence": 0.91960293,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Z.B. was ist die Demo Szene?",
      "start": 871632,
      "end": 873520,
      "confidence": 0.90844166,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Die Demo Szene ist noch so eine SZE, die kommt noch so aus der frühen Cracker Szene eigentlich. Ich weiß nicht, ob wenn jemand so ein Spiel gecrackt hat, dann kommt so ein Installer mit heftiger Midi Mucke irgendwie. Das war meine Jugend, das hängt da so ein bisschen mit drin. Naja und früher haben sich die Leute halt gegenseitig so ein bisschen gebettelt, wer kann die coolere Grafikanimation programmieren und das wurde dann halt ausgetauscht und hin und her geschickt. Dann gibt es da auch richtige Wettbewerbe und Treffen mittlerweile. Also das ist ziemlich, eine ziemlich krasse Szene auch. Also das sind die totalen Grafik Nerds. Also ich finde es absurd, weil da ist dann auch nicht nur, es muss besonders geil aussehen, sondern es muss vielleicht auch in möglichst wenig kurz passen oder so. Dann hast du so Competitions mit vier KB irgendwie und da muss dann irgendwie die crazy Animation rausfallen mit Musik und allem. Also das ist hardcore. Genau, und das ist die Demo.",
      "start": 873600,
      "end": 929756,
      "confidence": 0.91047823,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die Demo Szene, das fällt dann auch unter Creative Coding.",
      "start": 929788,
      "end": 932668,
      "confidence": 0.887963,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das würde ich sagen, passt gut zu Creative Coding auf jeden Fall.",
      "start": 932764,
      "end": 936652,
      "confidence": 0.9576825,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Gibt es eigentlich das Wort Cracker noch? Ich höre das eigentlich kaum.",
      "start": 936756,
      "end": 940480,
      "confidence": 0.9249517,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich will jetzt nicht sagen, dass ich vielleicht kürzlich mal nach Spielen gegoogelt habe, aber das ist schon noch ein Ding.",
      "start": 940900,
      "end": 948572,
      "confidence": 0.9629218,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber die Szene heißt auch noch so.",
      "start": 948716,
      "end": 950764,
      "confidence": 0.9998114,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich kenne keinen anderen Begriff gibt es da.",
      "start": 950932,
      "end": 953480,
      "confidence": 0.8698344,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Es ist mir irgendwie, keine Ahnung, nie mehr so zugetragen worden. Aber ich kenne natürlich von früher klar, warum man das noch. Wo ich noch mehr mit Games zu tun hatte auf jeden Fall.",
      "start": 954020,
      "end": 963390,
      "confidence": 0.8745226,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber jetzt noch mal ganz kurz zum Thema generative Kunst. Das bedeutet, wenn ich mir das jetzt mal vorstellen kann, da ist jetzt kein, also du hast jetzt keinen Pinsel in der Hand, wenn du Kunst machst, sondern so wie wir eigentlich auch alle, eine Tastatur wahrscheinlich oder einen d Drucker oder eine CNC Fräse oder ähnliches. Und bei der Vorbereitung hast du auch das Wort generative Kunst erwähnt, habe ich zu meinem Video gefunden. Und dann hast du das Beispiel mit Minecraft gebracht, dass Minecraft wohl auch unter generative Kunst fällt. Und jetzt muss ich mich einmal outen, ich habe noch nie Minecraft gespielt. Ich weiß, ich kenne das Spielprinzip nicht. Ich habe mal gehört, das ist ein Spiel, was programmiert wurde, damit man lernen kann. Hat sich ein bisschen anders entwickelt. Aber kannst du mal für Leute, die noch nie Minecraft gespielt haben, erklären, warum Minecraft unter generative Kunst fällt?",
      "start": 963510,
      "end": 1012250,
      "confidence": 0.922155,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also bei Minecraft ist es so, man startet eine neue Welt und dann rödelt da ein paar Sekunden lang ein sehr interessanter Algorithmus rum und der erzeugt eine riesige Spielwelt, die aus kleinen Klötzen besteht. Ein bisschen so lego mäßig zusammengebaut. Es gibt halt Klötze, die sind Gras und Klötze, die sind Stein und Klötze, die sind Wasser und sowas. Und naja, die werden halt so arrangiert, dass da eine richtig coole Landschaft mit richtigen klimatischen Regionen rauskommt. Also es entstehen Seen und Berge und Täler und Wüsten und Dschungel und genau, also diese Generierung, die da stattfindet, die würde man genau auch unter generative Kunst klassifizieren. Und in der Spielentwicklung wäre das dann halt prozedurale Generierung, wäre das passende Schlagwort dazu. Aber wenn du z.B. kein Bild von Minecraft im Kopf hast, vielleicht hast du ein Bild von, was ist denn noch typisch? Oh, ich sehr alt, Diablo eins oder sowas. Genau, wenn du in den Dungeon gegangen bist, dann sieht er auch jedes mal ein bisschen anders aus, aber ist ja ein kohärenter Dungeon irgendwie. Es gibt irgendwie Treppen, mit denen man hoch und runter gehen kann, Gegner werden platziert, Räume werden erstellt. Genau, also das ist auch so ein Vorgang, der da genauso reinpasst.",
      "start": 1012330,
      "end": 1083502,
      "confidence": 0.93142563,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe vor kurzem auf der FOSDEM, das ist die Free and Open Source Developer Europe Meeting in Brüssel, einen Lightning Talk gesehen. Da ging es auch darum, da hat ein Spieleentwickler über die Problematik von NPCs gesprochen. Und auf Basis der Konversation, dass die Konversation, die du mit den NPCs führen kannst, halt nicht immer so langweilig ist oder nicht immer gescriptet, und hat er irgendwas entwickelt und hat halt so ein LLM reingepackt. Das bedeutet, jeder NPC ist eigentlich ein volles LLM. Ist das nicht eigentlich auch schon irgendwie so ein bisschen generative Kunst? Weil klar, du hast dann irgendwie AI und so weiter dahinter, aber im Endeffekt kann ja jeder dann das Spiel oder die Konversation in eine andere Richtung bewegen, oder?",
      "start": 1083566,
      "end": 1123740,
      "confidence": 0.91891974,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, würde ich, also würde da auch noch, würde auch noch gut zur Definition passen. Würde ich auch sagen.",
      "start": 1124120,
      "end": 1129760,
      "confidence": 0.9390279,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wenn man sich deine Projekte ansieht und was du so machst und ich habe es ja schon erwähnt mit dem Präsidenten Unterschreibstift quasi. Jetzt hast du sehr viel Connection auch immer zur realen Welt. Gibt es da dann auch irgendwie einen Begriff, wenn man das ganze connected oder ist es einfach auch generative Kunst? Oder wenn man da jetzt d Drucker, CNC fräsen, keine Ahnung, was noch irgendwie anbindet, oder? Weil für mich klingt ja generative Kunst eher klassisch, nach ganz klassischer Software. Und was du ja auch ganz viel machst, ist dann irgendwie die Brücke in die unter anführungszeichen reale Welt nach außen zu machen.",
      "start": 1129880,
      "end": 1162802,
      "confidence": 0.91211206,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich glaube, so ein richtig coolen Begriff, der das jetzt direkt verbindet, gibt es nicht. Also was es gibt, wäre Digital Fabrication. Also wenn es um die reine Herstellung geht, da fallen dann alle Maschinen drunter, die sich halt so schön Computer steuern lassen. Also eben gerade CNC Fräse, D Drucker, Laser Cutter. Genau, aber das ist dann die reine Herstellungsart. Aber ich glaube, so einen richtig coolen Begriff, der die beiden Sachen so zusammenführt, gibt es nicht. Sollte man vielleicht einfach mal etablieren. Tangible, generative Art, keine Ahnung.",
      "start": 1162866,
      "end": 1191250,
      "confidence": 0.92633414,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Für mich tut sich da natürlich immer sofort die Frage auf, gerade wenn man jetzt auch über diese ganze digital Fabrication sprechen und die maker Szene, die da dran wo würdest du dich denn da einordnen in diesen ganzen Szenen? Du sagst selber, du bist Künstlerin mittlerweile, zumindest was ich so gehört habe aus deinen Interviews, war das nicht immer so. Aber wo fängt denn die maker Szene an? Wo hört die auf? Wann ist was Kunst? Wenn ich mir jetzt mein d Modell einfach daheim erzeuge und irgendwas damit mache, ist es schon Kunst? Brauche ich was Generatives? Wie blickst denn du auf die Sachen? Wo ordnest du dich selber in dem ganzen Spektrum eigentlich?",
      "start": 1191910,
      "end": 1230576,
      "confidence": 0.9320781,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das ist ehrlich gesagt alles voll schwierig. Also genau, ich stelle mich mittlerweile als Künstlerin vor. Ich fand das ganz lang ganz schwierig, weil ich mich sehr damit identifiziert habe, Informatik studiert zu haben. Da war ich halt, ich war mir auch am Anfang sehr unsicher, ob ich das überhaupt kann. Bin ich geeignet dafür irgendwie? Kann ich programmieren irgendwie, weiß ich nicht. Also ich habe mir da am Anfang vom Studium viel Gedanken drüber gemacht, ob ich das überhaupt kann und ob ich da gut genug für bin. Was im Nachhinein irgendwie ein bisschen, bisschen albern war, aber es liegt mir schon sehr, es macht mir sehr viel Spaß. Entsprechend habe ich mich da aber sehr viel mit identifiziert irgendwie. Und dann zu sagen, du bist Künstlerin, das sind ja, weiß ich nicht, das steht in meinem Kopf, war das andere Ende von einem Spektrum. Ich weiß nicht, mittlerweile finde ich aber, es passt hervorragend zusammen. Ich sag sehr gerne Künstlerin, aber das habe ich halt auch nur gemacht, weil mich andere so genannt haben. Also ich habe mir nicht selber den Titel Künstlerin gegeben, weil ich das genau, war so eine Dissonanz bei mir irgendwie. Mittlerweile finde ich, das passt gut und Maker oder Makerin passt da auch sehr gut rein. Aber wo jetzt da die Grenzen liegen, was Kunst ist oder nicht, ist voll schwierig, weil ich glaube, das ist sehr individuell. Also ich glaube, wenn jemand was von Thingiverse runterlädt, auf seinen d Drucker schmeißt, einen Druck, dann ist das jetzt erstmal vielleicht noch keine Kunst, aber das kann es vielleicht halt auch sehr schnell werden, keine Ahnung. Vielleicht will man ja auch eine Aussage treffen. Vielleicht lädt man halt mal alle Sachen runter, die, weiß ich nicht, eine Schildkröte sind und guckt mal, wie sehen eigentlich alle Thingiverse Schildkröten aus. Und dann kann das schon wieder eine ziemlich coole Reihe sein. Also ich glaube, das ist schwierig, hart abzugrenzen, was da Kunst ist und was nicht.",
      "start": 1230738,
      "end": 1326978,
      "confidence": 0.9208774,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und seit wann bist du jetzt Künstlerin?",
      "start": 1327114,
      "end": 1329218,
      "confidence": 0.8812243,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich würde sagen, seit wahrscheinlich 2019. Da hatte ich eine solo Ausstellung, die mir sehr unerwartet zugeflogen kam sozusagen. Genau, da wurde ich dann auch das erste Mal so richtig als Künstlerin von außen bezeichnet. Und genau, seitdem gab es noch einen kleinen Prozess in mir, bis ich das so richtig ganz annehmen konnte. Und genau, seitdem würde ich sagen, bin ich Künstlerin.",
      "start": 1329394,
      "end": 1352610,
      "confidence": 0.9307005,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also ich habe auch mal kurz probiert, es gibt ja wahrscheinlich auch allgemeine Definitionen oder sowas, aber das ist glaube ich, immer sehr, sehr schwierig, was ist Kunst? Und man kennt es ja sehr selbst, wenn man in irgendeinem Museum steht, dass man dann oft sagt, ist das jetzt Kunst oder wie auch immer. Und es gibt ja scheinbar die Rezeptionstheorie, nennt sich das, was ja genau du erwähnt hast. Sobald andere Leute sagen, dass es Kunst ist und sich dafür interessieren, ist es Kunst. Oder die andere Seite wäre die intentionsbasierte Definition. Das heißt, wenn du sagst, es ist Kunst, ist es eigentlich Kunst. Also es gibt ja keine wirkliche Definition, aber ich kann das nachvollziehen natürlich, wenn man, wenn man seinen eigenen Titel in irgendeiner Form ändern muss oder seine eigene Beschreibung, dass das natürlich ein großer Prozess ist. Aber du siehst dich immer noch als Informatikerin, wenn ich das richtig verstehe.",
      "start": 1353110,
      "end": 1402138,
      "confidence": 0.9193661,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau. Also ehrlicherweise, ich stelle mich auch ein bisschen unterschiedlich vor, je nachdem, vor wem ich stehe oder um was es geht. Also wenn ich jetzt, keine Ahnung, Vorträge eher darum halten soll, dass ich irgendwie vielleicht auch mal jugendlichen programmieren beibringe oder sowas ein bisschen, dann stelle ich mich vielleicht noch eher als Informatikerin vor und wenn es eher um das Thema Kunst geht, eher als Künstlerin. Also das schwankt vielleicht auch mal, aber ich sehe mich als beides. Und tatsächlich überwiegt Künstlerin momentan fast, weil das halt mehr weiß auch nicht, trifft Meistens, vielleicht in den meisten Momenten mehr momentan.",
      "start": 1402234,
      "end": 1437030,
      "confidence": 0.92630464,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Nur zur Einordnung, du machst das aktuell Vollzeit, oder?",
      "start": 1437450,
      "end": 1440114,
      "confidence": 0.9300822,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, richtig, genau.",
      "start": 1440202,
      "end": 1441506,
      "confidence": 0.98248,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Warum bist du keine klassische hochbezahlte Programmiererin? Weil im Endeffekt mit deinem Master in Machine Learning und generative Kunst, also ich weiß ja nicht, gibt es für dich gerade eine bessere Zeit in der Industrie mit, weiß ich nicht, AI, KI und wie sie alle heißen? Also was treibt dich daran an, halt nicht, ich sag mal, im klassischen Angestelltenverhältnis oder das nächste Startup zu gründen mit dem neuesten, weiß was ich, Big O Modell, keine Ahnung, wie die heißen.",
      "start": 1441618,
      "end": 1473710,
      "confidence": 0.90884787,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich bin da auch, glaube ich, ein bisschen reingewachsen in diese Art Selbstständigkeit. Und ich habe nach dem Studium eine Promotion, also du hast ja schon gesagt, ich bin noch Doktorandin, aber ich hatte eine andere Promotion angefangen und war da irgendwie sehr unglücklich in der Art, wie das in diesem Institut ablief und hab da so nach einem guten Jahr hingeschmissen, ehrlicherweise einfach. Und hatte dann sehr viel Zeit übrig, weil ich war nicht für die Forschung angestellt, sondern ich hatte eine reine Lehrestelle da praktisch, die mich finanziert hat und die war unabhängig von dieser Promotion. Deswegen konnte ich die Lehre einfach weitermachen, auch wenn ich das Forschen dann eingestellt habe nach einem Jahr an der Stelle. Und da hatte ich dann im Sommer auf einmal auch sehr viel Zeit übrig und konnte da echt eintauchen in diese generative Art Thematik, die mich da irgendwie gerade. Da habe ich mich so ein bisschen festgefressen dran. Und ich habe das dann halt auch so über die Zeit gemerkt, dass mir das mich selber sehr glücklich macht, mich damit zu beschäftigen und meiner intrinsischen Motivation da nachzugeben. Ich habe habe aber andererseits auch gesehen in diesem einen Jahr in einem Institut, wenn ich da von außen eine Aufgabe bekomme, die ich umsetzen soll, die mich vielleicht gar nicht so sehr interessiert, dann finde ich das sehr anstrengend und ermüdend und hatte da wenig Spaß dran. Das klingt jetzt so blöd, weil so funktioniert halt Angestelltenverhältnis. Ich bekomme halt eine Aufgabe, die ich dann halt auch umsetzen muss. Und ich habe aber halt gemerkt, dass ich selbstständig meine eigenen Sachen umsetzen kann und damit überleben kann. Und das war dann für mich praktisch die schönere Variante, als zu ich gehe in ein Angestelltenverhältnis, wo ich das nicht kann und von außen Aufgaben bekomme, die ich nicht machen möchte unbedingt.",
      "start": 1474400,
      "end": 1575690,
      "confidence": 0.9309881,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie überlebst du denn gerade? Wie finanzierst du dich? Also wie zahlst du deine Miete?",
      "start": 1575850,
      "end": 1580714,
      "confidence": 0.93440133,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Gefühlt ganz unterschiedlich. Also ich habe mehrere Säulen. Ich mach einmal Vorträge und Workshops, dann kriegt man da irgendwie ein Honorar für. Z.B. ich mache noch den klassischen Künstler innen weg und bewerbe mich auf Förderungen. Also es werden dann oft vom Land oder vom Bund oder manchmal auch von Firmen, das ist ein bisschen unterschiedlich, werden halt Kunstprojekte ausgeschrieben, wo man mit seiner Idee sich drauf bewerben kann. Mal macht man irgendwie Kooperationen mit anderen Künstlerkollektiven, wo irgendwie Budget da ist im Grunde eben auch, weil die sich auf irgendeine Förderung beworben haben und da irgendwie man gut mit reinpasst. Ich mache ein bisschen YouTube und ein bisschen Patreon, so die online, wie sagt man, Influencer trifft es ja nicht. Influencer ja nicht so richtig, aber die online Content Creator Schiene praktisch. Da kommt dann doch auch ein bisschen was rein. So sammelt sich das aus unterschiedlichen Säulen eigentlich zusammen.",
      "start": 1580762,
      "end": 1630030,
      "confidence": 0.9160913,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wie viel Zeit verwendest du, um so Bewerbungen oder Ausschreibungen da mitzumachen? Weil ich kenne es ja aus meiner Uni Zeit noch, wo man ständig auf Fördergeld angewiesen ist, wo man schon sehr viel Zeit eigentlich in Anträge schreiben verbringt und ständig eigentlich, wenn man einen Antrag bekommen hat, ist man schon im Kopf wieder im nächsten, weil man wieder halt einfach das nächste Geld einwerben muss. Ich könnte mir vorstellen, dass es in deinem Fall wahrscheinlich noch schwieriger ist und weil man halt wirklich davon leben muss.",
      "start": 1630110,
      "end": 1662186,
      "confidence": 0.9219952,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, also ich glaube auch das ist nicht unerheblich. Ich versuche halt oft Projektausschreibungen zu finden, wo die Bewerbung nicht furchtbar schlimm aufwendig ist. Es gibt halt echt welche, wo es richtig schlimm ist, mit langen Ausarbeitungen schon am Anfang. Die versuche ich zu vermeiden eigentlich. Es ist aber auch manchmal so bei Künstlerausschreibungen, dass du praktisch nur eine sehr kleine Idee formulieren, also da ist der Aufwand gar nicht so groß. Du musst nur eine sehr kleine erstmal die Idee so ein bisschen anreißen, ein bisschen formulieren, den schicken und wenn die dann ja, du bist jetzt in den top fünf ausgewählten, dann bezahlen wir dich dafür, das final groß auszuarbeiten und dann suchen wir uns daraus den letzten aus. Also das gibt es auch manchmal, wenn es besonders große Projekte sind, dass so ein Zwischenschritt sogar bezahlt wird. Das finde ich ziemlich krass cool eigentlich, dass das geht. Und der andere große Trick ist halt tatsächlich Künstlerkollektive zu haben, wo im Grunde jeder mal sich auf so eine Ausschreibung bewirbt, aber halt für die Gruppe praktisch und das heißt, ich schreibe einen, aber das Künstlerkollektiv hat sich aber auf sieben Sachen beworben oder sowas. Und dann verteilt sich natürlich die Last halt auch wieder stark. So was geht auch gut.",
      "start": 1662378,
      "end": 1730362,
      "confidence": 0.93117154,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Sind es dann so Förderprogramme, die speziell für digitale Kunst sind oder allgemein Kunst Kunst oder vielleicht sogar Informatikerförderungen, die in irgendeiner Form passend gerade sind oder die man breiter auslegen kann?",
      "start": 1730466,
      "end": 1743786,
      "confidence": 0.9019344,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, also es geht beides gut. Also es gibt direkt Kunstförderungen manchmal, die direkt auf Digitalthemen zugeschnitten sind. Jetzt gerade läuft z.B. eine für KI und Kunst vom Bund ist die glaube ich, Bund Deutschland ist die glaube ich ausgeschrieben. Genau. Es gibt aber auch so was wie den Prototype Fund, wo ich mich auch schon mehrfach beworben habe, die dann eigentlich eher eine Softwareförderung sind, aber thematisch passe ich halt vielleicht an der Stelle noch gut genug rein, um ein Projekt fördern zu lassen. Genau. Das eine künstlerische Ausprägung hat oder so. Genau.",
      "start": 1743938,
      "end": 1775200,
      "confidence": 0.9243263,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das Förderprogramm, was KI und Kunst heißt, das ist ja wie für dich gemacht, oder?",
      "start": 1775280,
      "end": 1778624,
      "confidence": 0.9697973,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, genau. Also da ist nur gemein, was heißt gemein, aber da darf man sich z.B. auch nicht als Einzelperson bewerben. Also da durften sich auf jeden Fall, glaube ich, nur Gruppen oder Institutionen drauf bewerben.",
      "start": 1778712,
      "end": 1788880,
      "confidence": 0.9430564,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Blicken eigentlich andere Künstler innen so aus der klassischen Künstlerinnen Szene irgendwie herab auf diese ganze Coding und Informatik Szene, die so sagen, ist ja keine echte Kunst und wir malen da und keine Ahnung, wir bauen irgendwas oder wir sind Bildhauer innen?",
      "start": 1788960,
      "end": 1805054,
      "confidence": 0.88570255,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich glaube schon, dass es das gibt. Ich habe es wenig selber an mir erlebt, also mir hat das jetzt selten jemand irgendwie direkt gesagt. Ich hatte tatsächlich einen krassen Moment. Ich hatte im Museum Ulm dann eben eine solo Ausstellung und habe da Führungen durch meine Ausstellung gegeben praktisch und hatte dann einen Herren da, der ist da irgendwie, weiß ich nicht, ein 2 Stunden mit ein 2 Stunden Anfahrtszeit gekommen und hat dann eigentlich 40 Minuten lang meine Führung nur gehäkelt, also permanent. Das ist doch keine Kunst. Wieso ist das hier, wieso machen sie das? Das ist ja furchtbar. Total absurd. Also das gibt es schon, aber ich würde sagen, im Großen und Ganzen wird es eigentlich schon anerkannt. Und es gibt ja auch, also es gibt ja auch ganze Museen, die sich dann auf digitale Themen fokussieren oder so. Ich glaube eigentlich wird es im Durchschnitt schon gut anerkannt, würde ich sagen.",
      "start": 1805182,
      "end": 1854250,
      "confidence": 0.93740344,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und dem alten Herrn hast du dann den funky Finger in die Hände gedrückt?",
      "start": 1854290,
      "end": 1858030,
      "confidence": 0.8959036,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Den gab es da noch nicht, aber ja, wäre gut gewesen. Man, der war hart. Also den fand ich schon, den fand ich schon echt grenzwertig.",
      "start": 1858530,
      "end": 1867818,
      "confidence": 0.92552805,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ich meine, der Begriff Kunst ist ja auch sehr weit, ich sag mal, dehnbar. Also ich meine, wenn ich teilweise sehe, dass irgendwelche Leute und jetzt tue ich der Kunst auch was ungerechtes, irgendwie eine Banane an die Wand kleben mit so Gaffa Tape und das als Kunst bezeichnen, sage ich okay. Oder die Tage habe ich auf Instagram so ein Meme gesehen, da ist jemand durch so eine Kunstausstellung und ist gestolpert, hat seinen Schuh da liegen lassen und auf einmal stellen sich Leute um den Schuh. Also steht in dem Raum nur ein Schuh. Kunst ist halt, was du daraus machst, glaube ich. Aber du sagtest gerade, du fühlst dich nicht als Influencerin, aber du machst ja schon irgendwie sehr viel Marketing, du hast einen großen YouTube Kanal, du bist gefühlt, also wenn ich nach dir google, dann finde ich auch auf Seite drei, da wo man eigentlich Leichen versteckt, auch noch was. Und du machst ja schon viel, du sprichst sehr viel über deine Projekte. Und da frage ich mich halt, okay, hilft dir das, dass du diesen Track Record aufbaust und deine Projekte vorstellst? Und hilft dir das eigentlich dann bei der Finanzierung des nächsten Projektes? Natürlich, wenn du dann jetzt private Auftraggeber hast, vielleicht, die sind dann über sowas aufmerksam geworden. Aber interessiert jetzt die Kunststiftung des Bundes sich dafür zum, dass du jetzt keine neue Künstlerin bist, sondern das schon ein paar Jahre machst?",
      "start": 1867994,
      "end": 1938982,
      "confidence": 0.92226416,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist eine gute Frage. Ich bin mir da gar nicht so sicher. Also wie du sagst, wenn das jetzt irgendwie jemand privat, also was heißt privat, aber wenn, ich glaube, es kommt darauf an, wie die Jury funktioniert oder was das Ziel ist. Also ich habe sicher schon einige Gigs sozusagen bekommen, weil ich irgendwo einen coolen Vortrag hatte und der dann irgendwie ein bisschen Werbung für mich war. Also ich mache ja Werbung für mich dann im Grunde. Ich bewerbe ja mich selber sozusagen. Genau. Aber ich glaube, wenn man sich jetzt beim Bund oder so krass groß bewirbt, glaube ich, also denen ist es egal, ob ich einen YouTube Kanal habe, glaube ich. Ich glaube, da ist es dann oft interessant. Also die klassische, wie soll ich sagen, Künstler innen Vita. Also ich habe mich auch mal auf eine Ausschreibung beworben, da musste man halt auch echt so ein Lebenslauf und so ein Portfolio gedruckt per Post hinschicken. Und dann habe ich den auch geschrieben. Hast du gemeint, Leute, ich weiß nicht wie, also es macht null Sinn bei mir. Ich meine, klar kann ich ein paar Sachen ausdrucken, aber es macht null Sinn. Das macht absolut keinen Sinn. Warum muss ich euch das gedrückt? Ja, das ist halt unser Verfahren. Keine Ahnung. Also ich glaube, manchmal trifft man da auch noch so auf Steinzeit Bürokratie und dann ist es halt echt eine was will die Jury sehen und wie möchten die arbeiten? Und vielleicht wollen die halt die klassische Künstler Vita mit. Wie viel Solo Ausstellungen hat es schon gegeben? Wie viel andere internationale Ausstellungen hat es schon gegeben? Und welchen Preis hat man gewonnen? Und dann gucken die sich das an und dann entscheiden die danach. Gibt es sicher auch.",
      "start": 1939046,
      "end": 2022040,
      "confidence": 0.92847556,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber du siehst es jetzt nicht wirklich als Marketing Channel oder sowas?",
      "start": 2022500,
      "end": 2026970,
      "confidence": 0.9538975,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ja und nein. Also ich sehe schon, dass es mir Vorteile bringt. Und ich meine, wenn ich mich nicht bewirb, macht es ja niemand anderes. Also ich muss ja für mich sprechen irgendwie. Aber das ist glaube ich nur die eine Hälfte, warum ich das mache. Also ich möchte auch eigentlich schon gerne Wissen weitergeben. Also auf meinen YouTube Videos versuche ich, auch wenn ich das gerade echt nicht häufig mache, aber ich versuche halt schon auch Projekte so ein bisschen zu dokumentieren, dass man halt ein bisschen was Entstehungsprozess sieht oder irgendwie Fragen, die andere haben, könnten da vielleicht schon drin beantwortet werden. Also ich verweise dann halt auch immer gerne auf ein Video, wenn jemand hey, cooles Projekt, gibt es da Infos? Hier, guck mal, da habe ich eine Videodoku, kannst du dir angucken. Also das ist dann die andere Hälfte, glaube ich, warum ich das interessant finde.",
      "start": 2027870,
      "end": 2071812,
      "confidence": 0.9403718,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und machst du das dann gern, vor der Kamera zu stehen?",
      "start": 2071956,
      "end": 2074388,
      "confidence": 0.98453546,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich stehe gern vor der Kamera, aber es kommt auf die Situation an. Also diese YouTuber, ich stehe mitten in einer Menschenmenge und quatsche in meine eigene Kamera. Finde ich schon schlimm. Aber an sich, also ich vor Kameras stehen mache ich schon gern und ich schneide auch eigentlich ganz gern Videos. Ich bin jetzt nicht so super gut drin, aber fand ich eigentlich schon immer cool. Ich hatte auch als Kind so ein kennt ihr die noch, diese dv Kassetten, diese kleinen Videotapes? Damit habe ich angefangen. Hat ewig gebraucht, die irgendwie auf dem PC rüber zu ziehen zum schneiden damals, aber die waren cool. Da hatte ich einen Camcorder. Fand ich als Kind schon witzig.",
      "start": 2074484,
      "end": 2108620,
      "confidence": 0.9244429,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe ja zuerst schon die funky Fingers kurz erwähnt. Es werden jetzt die meisten keine Ahnung haben, was damit gemeint war. Für den alten Herrn in der Ausstellung, der dich da angeflegelt hat, kannst du das mal kurz erklären? Weil das war ja auch sehr öffentlichkeitswirksam eigentlich. Also keine Ahnung, ob das so geplant war, aber scheinbar hast du ein gutes Händchen dafür.",
      "start": 2109370,
      "end": 2127218,
      "confidence": 0.9339159,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ursprünglich entstanden ist das während Corona. Da wurden für viele selbstständige Sparten dann Hilfsgelder ausgeschrieben. Genau, um die Leute halt irgendwie über diese Lockdown Zeit zu retten. Und da ist natürlich auch vielen Künstlerinnen flöten gegangen. Mir ehrlicherweise muss ich ganz ehrlich sagen nicht so, weil ich arbeite digital und ich hatte da. Meine Ausstellung war gerade vorbei, als der Lockdown angefangen hat. Also mich hat es ehrlicherweise auch einfach nicht so sehr erwischt irgendwie in dem Moment. Ich habe aber halt beobachtet, wie so Künstlerhilfen ausgeschrieben wurden. Die wurden zum Teil halt richtig, richtig scheiße ausgeschrieben, muss man so sagen. Also in der Art, wie die Regelungen festgelegt wurden, sind halt einfach ganz viele Leute rausgefallen. Also es ist einfach nicht mit Künstlerinnen entstanden, sondern irgendjemand hat gesagt, ja, da muss man man jetzt eine Hilfe machen. Das formulieren wir irgendwie, passt schon. Also z.B. musstest du halt x Jahre voll selbstständig sein und durftest auch gar kein Anstellungsverhältnis haben. Das ist halt echt der Knackpunkt, weil ich kenne halt ganz viele, weiß ich nicht, Musiker innen z.B. die haben noch so einen ganz kleinen Nebenjob an der Musikschule, weil das halt auch so ein Basiseinkommen bringt. Also das haben super viele und das hat die ganzen Leute sofort aus diesen ganzen Hilfen rausgekillt. Also echt bescheuert. Naja und dann wurde mal eine ausgeschrieben, die war richtig gut formuliert für junge Künstler innen. Du musstest auch nicht mal. Also der Nachweis, dass du Künstlerin bist, war nicht so drastisch wie es sonst oft ist. Du konntest kleine Nebenjobs haben, blabla. Also war richtig gut ausgeschrieben. Dann hat der bayerische Minister für Wissenschaft und Kunst den Applaus eingeheimst und dann ist einfach ein dreiviertel Jahr lang nichts passiert. Und dann war ich schon sauer, weil mein dreiviertel Jahr ist halt ein dreiviertel Jahr irgendwie mit viel Lockdown und die Leute irgendwie rotieren alle. Das fand ich frech. Genau, und da kamen diese funky fingers her. Das sind praktisch durch einen Algorithmus erzeugte generative kleine Stinkefinger Bildchen, könnte man sagen. Die habe ich dann als Sticker gedruckt, als Unique Sticker. Jeder kleine Sticker ist ein Unikat gewesen, mit schön selber produziert. Ich habe die dann ein bisschen verteilt. Genau, das ging so ein bisschen durch die Lokalmedien. Und dann nach diesem dreiviertel Jahr kam irgendwann die e Mail mit ja übrigens, diese Förderung, die ist jetzt auf einmal ein Stipendium. Okay, warum auch immer, man darf sich jetzt darauf bewerben. Dann habe ich das gemacht und dann habe ich einen Anruf bekommen. Ja Frau Wieluch, sie wurden jetzt als eine von 10 Personen ausgewählt, weil man musste dann so eine Projektidee beschreiben auf einmal, statt dass es einfach eine Corona Hilfe war. Okay, Ihr Projekt ist ja so toll, sie müssen da jetzt ein bisschen Händeschütteln kommen nach München. Beim Minister dachte ich oh nein, jetzt haben die mich ausgesucht, ich, der den ganzen Terz vorher gemacht hat. Und die wussten das aber, glaube ich, auch einfach nicht. Naja, da musste ich da hingehen. Mein Plan war auch eigentlich ganz viel Sticker mitzubringen und an die Medien Presse zu verteilen. Hatte so kleine Flyer gemacht und so. Und stellte sich dann aber raus, dass halt auch einfach echt nur die Hauspresse da war. Es war niemand da. Es waren diese 10 Künstler, eine Moderatorin und der Herr Minister. Und das war's dann. Es war sehr bitter.",
      "start": 2127314,
      "end": 2306878,
      "confidence": 0.91424185,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Hat der Minister wenigstens einen Finger bekommen.",
      "start": 2306974,
      "end": 2309890,
      "confidence": 0.89511573,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich hatte das noch irgendwie versucht und es hat sich dann nicht gut ergeben. Und es war. Es gibt ein Foto, wo ich es im Saal hochhalte. Naja, aber also auch mein offizielles Foto, wo ich diese blöde Urkunde kriege, da habe ich es mit in der Hand. Aber es ist, naja, schön.",
      "start": 2310550,
      "end": 2326078,
      "confidence": 0.9473685,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Dem Minister so einen Mittelfinger geben, auch schön. Aber wenn wir über die Kombination von Software und Hardware sprechen, dann stelle ich mir natürlich immer die Frage, okay, man braucht ja sehr viel d Drucker, CRC Fräse und so weiter. Und also die Rüstzeit oder die Rüstkapazität, wie nennt man das in der Wirtschaft, ist schon sehr hoch. Und da frage ich mich natürlich, kann man das nicht einfach alles mit einer Pucksäge machen, die man schön im Baumarkt kaufen kann? Und da bin ich über ein Projekt gestoßen, was, glaube ich, nicht ganz mit der Pucksäge machbar ist oder vielleicht doch, wenn man zu viel Zeit hat. Und zwar ist das ein Stuhl, den du generativ erzeugt hast unter dem Namen Jenchair. Kannst du uns mal erzählen, was das für ein Stuhl ist, bzw. Was davor vor sich ging?",
      "start": 2326094,
      "end": 2369670,
      "confidence": 0.92328495,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das war ein spannendes Projekt, bei dem ich mich massiv selbst überschätzt habe.",
      "start": 2369750,
      "end": 2374730,
      "confidence": 0.9713364,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wegen der Bucksäge, oder?",
      "start": 2375550,
      "end": 2377190,
      "confidence": 0.7935275,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, so ungefähr. Also, oh Gott. Naja, also die Idee war, ich wollte mir einen schönen Gartenstuhl fräsen mit einer. Ich hatte mir davor mit meinem Freund zusammen so eine, aus so einem Kit, so eine CNC Fräse zusammengeschustert. Die hat ganz okay funktioniert und dachte mir, naja, da fräsen wir einen coolen Gartenstuhl draus. Der soll aber ein tolles Muster haben, der soll schon irgendwie besonders schick aussehen. Und ich bin über ein Paper gestolpert, das beschreibt, wie man Adernwachstum in Blättern simulieren kann. Klingt jetzt erstmal irgendwie ganz aufwendig, in Wahrheit ist das irgendwie total simpel, aber ihr kennt es, wenn man so im Herbst spazieren geht und man kommt an so vertrockneten Blättern vorbei und es bleibt nur noch dieses Gerippe von dem Blatt stehen. Also man sieht halt echt nur noch die Adern. Eben. Ich mag die Struktur, die da entsteht, echt gerne. Das sieht cool aus. Dann habe ich das halt irgendwie mal nachimplementiert und das in so einem Quadrat wachsen lassen, praktisch diese Simulation. Und das ist dann die Stuhlrückenlehne. Und die Sitzfläche ist also so ein Mustergeflecht mit sehr viel Abbiegungen, einer sehr großen Oberfläche und ja, also große Oberfläche ist dann schon das Stichwort. Das reine Fräsen hat ewig gedauert. Also ich glaube für einen, für die Rückenlehne an sich war die Fräszeit waren irgendwie, oh Gott, ich weiß gar nicht mehr, sechs, 7 Stunden oder so? Klingt ja nicht so schlimm, macht ja die Maschine. Aber jetzt ist das so eine Eigenbau CNC Fräse, die man nicht alleine lassen kann und wo die keine automatische Absaugung hat. Das heißt, du stehst halt da 7 Stunden dabei und guckst, dass das Ding nicht abbrennt. Das hat ewig gedauert. Genau, das mal zwei und dann noch zwei bisschen Füßchen unten ausgefräst und dann stellt sich natürlich zum Schluss auch noch raus, die CNC Fräse hat schon einen guten Job gemacht, aber naja, es ist halt roh aus Holz gefräst, so ein bisschen abschleifen sollte man das schon noch. Und jetzt hat es halt lauter winzige Winkel. Und dann saß ich da irgendwie noch mal zwei Tage mit ganz dünnen Schleifpapierstreifen und hab versucht, irgendwie alle Holzspäne Ecken noch mal irgendwie nutzbar zu machen. Das ist ein sehr schicker Stuhl geworden. Er lebt leider nicht mehr. Der hat meinen letzten Umzug leider nicht überlebt, aber er stand wenigstens schon im Museum.",
      "start": 2377310,
      "end": 2503360,
      "confidence": 0.91720676,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ich habe mir das Projekt angesehen und wenn ich das richtig verstanden habe, du hattest eine dünne Holzplatte, die hast du gefräst und davon hast du mehrere Holzplatten gefräst und dann aufeinander geleimt. Ist das korrekt?",
      "start": 2503700,
      "end": 2517440,
      "confidence": 0.9365703,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Fast. Also ja und nein. Die sind schon verleimt, die Platten. Das sind diese typischen Multiplexplatten aus dem Baumarkt. Genau, die sind schon. Genau, die haben schon so Leimschichten. Genau. Und da habe ich praktisch vier Teile gefräst. Also Sitzfläche, Rückenlehne. Die beiden Fußstücke sozusagen. Genau. Und das wird verleimt. Genau. Und dann gibt es einen Stuhl.",
      "start": 2518100,
      "end": 2537004,
      "confidence": 0.92165333,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und dann hattest du das Problem, dass die Adern so dünn waren, als du dich drauf gesetzt hast, dass sogar die Sitzfläche teilweise gebrochen ist, oder?",
      "start": 2537052,
      "end": 2544574,
      "confidence": 0.9232635,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, vorne ist ein Stück gebrochen. Und ich hatte auch ursprünglich mal gedacht, dass ich die Fußstücke aus diesem Muster wachsen lasse. Und das habe ich einmal probiert und das war so fragil, dass ich es direkt auch gelassen habe, weil das hätte nie überlebt irgendwie. Genau. Und ein Stück ist gebrochen. Ja, tatsächlich, das stimmt. Eine Ecke hat es nicht gepackt.",
      "start": 2544662,
      "end": 2561890,
      "confidence": 0.95427406,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wie kam das Kunststück oder den Stuhl, ich weiß nicht, wie du es selbst bezeichnest, dann jetzt ins Museum?",
      "start": 2562230,
      "end": 2568638,
      "confidence": 0.870595,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Da gab es eine Ausschreibung bei mir an der Uni für den Förderpreis junge ulmer Kunst. Das ist so lokaler Kunstpreis, der wird alle zwei Jahre in unterschiedlichen Sparten vergeben. Und genau, da hatte ich mich eben gerade angefangen, mit generativer Kunst so mehr zu beschäftigen. Dann meinte ein Kumpel, stupste mich so im Flur, meinte, guck mal, da kannst du dich doch bewerben mit deinen Sachen. Und ich dachte, na, das sieht doch eh keiner als Kunst an, was ich mache. Und dann, wie es da manchmal so läuft und an einem Abend irgendwie Fernsehgucken, war mir dann doch langweilig. Dann habe ich so ein PDF zusammengeschustert und den geschickt, um dann mal wieder so einen netten Anruf zu kriegen. Guten Tag, Frau Wieluch, sie haben jetzt hier diesen Preis gewonnen. Herzlichen Glückwunsch, sie müssen jetzt dann aber eine solo Ausstellung machen. Genau, und der Stuhl war praktisch eben Teil dieser Bewerbung auf diesen Preis.",
      "start": 2568734,
      "end": 2613804,
      "confidence": 0.9094988,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was genau ist eine solo Ausstellung?",
      "start": 2613932,
      "end": 2615948,
      "confidence": 0.94932336,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also eine solo Ausstellung sagt eigentlich nur, dass es eine reine Ausstellung mit einem Künstler ist. Also es dreht sich um die Werke dieses einen Künstlers oder dieser einen Künstler. Und das ist halt immer etwas prestigeträchtiger, weil da liegt ja der Fokus dann auf dir in dem Fall irgendwie.",
      "start": 2616044,
      "end": 2632978,
      "confidence": 0.9146734,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber hast du dann neue Sachen gemacht oder hast du dann irgendwie alle deine bisherigen Kunstwerke da ausgestellt?",
      "start": 2633074,
      "end": 2639938,
      "confidence": 0.9234972,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, da hatte ich alles, was ich zu dem Zeitpunkt mal gemacht hatte, ausgestellt, genau.",
      "start": 2640114,
      "end": 2644050,
      "confidence": 0.9438393,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, cool. Und wie lange dauert sowas dann, wenn man so eine Solarausstellung gewinnt in dem Fall?",
      "start": 2644130,
      "end": 2649390,
      "confidence": 0.81396586,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich meine, dass die vier Monate lang aufgebaut war, so um den Dreh zumindest. Vielleicht waren es fünf, aber es müsste genauso. Um den Dreh waren das? Ja, ich meine so November bis Februar war das, glaube ich.",
      "start": 2650650,
      "end": 2663502,
      "confidence": 0.8885445,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wir nehmen jetzt Anfang März auf. Das bedeutet, der Frühling steht vor der Tür. Wer also jetzt gerade noch einen Gartenstuhl sich selbst fräsen möchte, dann gibt es die SVGs auf der Webseite zum Download, habe ich gesehen. Sehr schön. Meine nächste Frage ist, wo kriege ich jetzt eine Eigenbau CNC Fräse her? Aber das ist dann die nächste Thematik. Aber ich glaube, da kann man im Hackerspace oder Makerspace seiner Wahl vielleicht mal 14 Stunden, 21 Stunden ein bisschen fräsen.",
      "start": 2663606,
      "end": 2689592,
      "confidence": 0.92829645,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Bekommst du eigentlich so anfragen irgendwie, dass jemand gerne solche Stühle hätte, irgendwie professionell hergestellt oder so? Oder ist es dann auch, was man üblicherweise nicht macht, weil das Einzelstücke bleiben sollen? Oder wie siehst du das?",
      "start": 2689656,
      "end": 2701780,
      "confidence": 0.93518054,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich bekomme ab und zu anfragen, aber ich muss dann meistens weiterverweisen, weil ich, also ich finde, ich fände es voll geil, wenn die jemand repliziert. Also das fände ich das allerbeste, ehrlicherweise. Es muss gar kein Einzelstück bleiben, aber ich, also ich will mir halt persönlich nicht noch mal den Stress geben, irgendwie da 20 Stunden zu fräsen. So viel Spaß hatte ich dann am reinen Fräsprozess auch nicht. Und genau deswegen gebe ich dann halt lieber so was her wie die Dateien. Stell dir einfach online, sag Hey, wenn du das geil findest und du kriegst es irgendwie hin, hast eine Fräse oder willst es irgendjemand geben, der dir das ausfräst, dann bitteschön, bau dir dein eigenes eigenen. Das mache ich dann ganz gern. Aber genau, also der Zeitaufwand einen neuen zu machen, wäre halt so riesig, dann müsste man den Stuhl ja auch für absurde Preise verkaufen, die ja dann auch ehrlicherweise einfach keiner zahlen will.",
      "start": 2702320,
      "end": 2745954,
      "confidence": 0.8915966,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Auch Kunstliebhaber, da würde ich jetzt erstmal gar nicht so negativ drüber nachdenken, denn es gibt Leute, die zahlen für Kunst sehr, sehr viel Geld. Also es ist ja das, was der Markt hergibt. Von daher ist auch wahr.",
      "start": 2746122,
      "end": 2759218,
      "confidence": 0.96348155,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja.",
      "start": 2759234,
      "end": 2759794,
      "confidence": 0.90183,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Man könnte ihn ja auch professionell herstellen lassen, damit man professionellen CNC Fräse oder.",
      "start": 2759962,
      "end": 2764168,
      "confidence": 0.91021645,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Sowas sind auch sicher nicht 20 Stunden.",
      "start": 2764224,
      "end": 2766200,
      "confidence": 0.9127629,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, hoffentlich.",
      "start": 2766360,
      "end": 2767704,
      "confidence": 0.94364,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn wir mal auf das Thema industrielle Fertigung eingehen, da gehen wir dann in meinem Kopf zumindest sehr schnell in den Bereich Massenfertigung. Und da gab es nämlich ein Projekt, was du, glaube ich, generative PCBs nanntest. Pcbs sind, und jetzt kommt der Hardware noob, das sind die Platinen.",
      "start": 2767832,
      "end": 2786584,
      "confidence": 0.9366369,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Richtig?",
      "start": 2786632,
      "end": 2787048,
      "confidence": 0.67901,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also PCBs sind eigentlich die Boards, die man selbst designt und dann zum Ätzen gibt, wenn man, weiß ich nicht, irgendwas an Arduino klatschen möchte, so ein Arduino hat oder Raspberry Pi hat oder ähnliches.",
      "start": 2787144,
      "end": 2800338,
      "confidence": 0.8868997,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Richtig?",
      "start": 2800354,
      "end": 2800738,
      "confidence": 0.90168,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau. Ist einfach die Platine. Genau. Ich wollte mir vor ein paar Jahren einfach mal beibringen, wie man eigentlich so eine Platine entwirft. Es war nie Teil, so richtig Teil meines Studiums, also stimmt nicht ganz. Ich hatte da mit einem Kumpel mal eine Platine geätzt im Keller der Uni. So ganz, was heißt altmodisch, aber ganz traditionell praktisch. Aber so richtig Plan davon, was ich da gerade tue, hatte ich irgendwie nicht. Vor allem was diesen Entwurfsprozess angeht, da war ich damals gar nicht so beteiligt. Ich wollte es immer mal lernen, wie machen das Leute? In der maker Community ist das ja auch echt gängig mittlerweile zu ich entwerfe mir deine eigene Platine für dieses Projekt. Und es ist alles mittlerweile echt billig herstellbar und schon abgefahren. Genau. Und mein Gedanke war dann, ich mache ein kleines Projekt. Projekt ganz simpel, soll wie eine Mini Tastatur sein, mit drei Knöpfen praktisch. Ich soll die am PC anstecken können und dann kann ich die Knöpfe mit irgendwas belegen, was weiß ich, lauter, leise, mute, unmute oder sowas. Nachdem ich aber so viel generative Sachen mache, dachte ich mir, naja, das geht ja noch cooler, da machen wir eine schicke Platine. Draußen habe ich ein kleines Programm geschrieben, was drei Planetenmuster erstellen kann. Also drei sehr abstrakte Planeten und noch ein bisschen Swirls aussenrum, eine kleine Rakete und bla. Und diese Planeten, die wurden dann zur Kapazität Touch Buttons. Also ich habe keine physische Taste mehr wie auf der Tastatur, sondern es geht nur darum, man kann die berühren und das wird einfach schon registriert als, wie soll ich sagen, als Tastendruck sozusagen.",
      "start": 2800834,
      "end": 2885240,
      "confidence": 0.9269619,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau.",
      "start": 2885320,
      "end": 2885672,
      "confidence": 0.77656,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das bedeutet aber auch, dass du eigentlich die Platine Raw exposen musst. Also du kannst ja jetzt kein Gehäuse mehr drum bauen, weil sonst kannst du ja die Planeten nicht mehr drücken, oder?",
      "start": 2885736,
      "end": 2893336,
      "confidence": 0.9216724,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, genau, also die muss dann irgendwie sichtbar bleiben. Also ursprünglich dachte ich, ich mache so nach unten noch so ein Gehäuse dran, vielleicht habe ich ehrlicherweise am Ende auch nie gemacht, aber hätte man machen können.",
      "start": 2893408,
      "end": 2904146,
      "confidence": 0.93568027,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau, und dann musste ich einmal stark lachen, weil ich bin nämlich auf deinem YouTube Kanal ein bisschen versunken. Und da kam ich über dieses Projekt, dass du sagst, ja, PCBs sind eigentlich total doof generativ herzustellen, denn PCBs werden günstiger, desto mehr du bestellst. Und das ist eigentlich genau das Gegenteil von dir, was du da machen möchtest, weil die sind ja dann nicht mehr unique.",
      "start": 2904218,
      "end": 2923970,
      "confidence": 0.92274463,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, genau. Also das ist der krasse Widerspruch. Und ich habe dann irgendwie versucht, zu eine Mittellösung zu finden und ich habe dann immer pro Variante 10 herstellen und bestücken lassen. Und was mir auch noch geholfen hat, ist der Teil, wo die Elektrokomponenten liegen praktisch, der ist sehr fokussiert an einem Ende und der bleibt auch gleich. Das heißt, im Herstellungsprozess, es gibt dann immer so ein Stencil, also es gibt eine kleine Metallplatte, bei denen Eckchen ausgeschnitten werden, wo die diese Lötpaste drüber ziehen, also wie beim Siebdruck, da wird das einmal so drüber gerade. Die kann dann gleich bleiben bei allen. Das heißt, man muss nicht auch noch für jede Platine da eine neue machen, sondern man konnte die für alle benutzen. Genau. Das hat den Preis dann ein bisschen besser gemacht zumindest. Genau.",
      "start": 2924050,
      "end": 2970820,
      "confidence": 0.9044019,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wenn ich das richtig sehe, probierst du ja möglichst unique pro Einheit, pro Stück zu sein. Und es gibt ja ein anderes Projekt bei dir, Tab Art, wo vielleicht die Produktion billiger war, weil du NFC Chips verwendet hast, aber trotzdem uniqueness bei jedem Stück eigentlich gehabt hast. Ich weiß nicht, ob das der Hintergrund war von dem Projekt, dass du das erreichen wolltest, aber kannst du da mal erklären, was du dort gemacht hast?",
      "start": 2971320,
      "end": 2995832,
      "confidence": 0.9267029,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, gerne. Also genau, Uniqueness war auf jeden Fall ein Ziel. Also das sind Sticker, ich habe hier auch gerade, ich meine, ihr kennt die ja, ich habe auch welche hier tatsächlich neben mir liegen gerade. Das sind quadratische Sticker, die sind so fünf x 5 cm groß ungefähr. In der Mitte steht sehr prominent Tab vor Art drauf und mit einem kleinen Symbol, das so andeuten soll, dass man mit dem Handy diesen Sticker scannen kann. Und in dem Sticker versteckt sich eben so ein NFC Tag, wie man die kennt von, ich weiß nicht, Eintrittssystemen, vielleicht von so Entry Karten oder von Mobile Pay im Grunde auch mittlerweile. Am Handy ist ja auch NFC. Genau, wenn man das mit dem Handy scannt, kommt man auf eine Webseite und auf der Webseite wird ein sehr geometrisches, kleines Bild oder überzeugt. Wenn das sich jemand angucken will, können wir auch eigentlich gerne einen Link da lassen, dann kann man da mal selber draufdrücken und das mal ausprobieren oder so. Der Witz ist, praktisch jeder NFC Sticker, der hat ja eine ID, das heißt, der ist identifizierbar. Und diese ID, die nehme ich als Randomness Seed für die Farben und für einen Teil der Anordnung oder für so Grössenanordnungen praktisch. Deswegen macht jeder Sticker, erzeugt eigene Bilder, die anders aussehen. Jeder hat seine eigenen Farben und sowas. Und was ich nämlich auch kürzlich gelernt hatte, diese NFC tags, die können selber mitzählen, wie oft sie schon ausgelesen wurden. Das war mir auch völlig neu, dass das ein Feature ist. Ich wusste das gar nicht.",
      "start": 2995896,
      "end": 3080690,
      "confidence": 0.9173055,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die speichern das intern ab. Also du hast keinen zentralen Server, der das irgendwie mitzählt, sondern wirklich der Tag selbst.",
      "start": 3081310,
      "end": 3087974,
      "confidence": 0.917891,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau, der Tag selbst kann es mitzählen, man muss es aktivieren, aber dann muss man halt irgendwie die App des Herstellers nehmen zum Beschriften. Dann gibt es da so ein Häkchen, das man setzen kann und dann, genau, dann zählt der brav mit. Das ist cool. Und genau Die Zahl kann ich eben auch als zweiten Seed benutzen und dann damit eben immer noch mal so ein bisschen mehr Randomness reinbringen. Also deswegen macht jetzt jeder Sticker seine farblich visuell eigene Reihe an Bildern und jeder Scan erzeugt eben ein neues Bild in dieser Reihe. Und genau, wenn man das dann eben mit dem Handy ausliest, dann kann man sich diese Reihe angucken, die bisher erzeugt wurde. Im Grunde läuft es alles lokal. Die ID und dieser Counter, die werden beim Scannen in die URL mitgemirrort. Das heißt, die sind einfach ein Get Parameter, wo dann oben die ID und die Nr. Drin steht. Von da hole ich mir die ab und erzeugt dann. Von da werden die Bilder erzeugt. So läuft das.",
      "start": 3088062,
      "end": 3136754,
      "confidence": 0.9099997,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und diese Sticker, wo sind diese Sticker genau?",
      "start": 3136842,
      "end": 3140194,
      "confidence": 0.9261675,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also die Sticker, ich verteile die Street Art mäßig, ganz fleißig. Wer unbedingt welche haben will, kann auch mal auf Webseite vorbeigucken. Ich habe die in einem Shop gerade noch drin. Und es gibt halt ein kleines Manko, da habe ich ein bisschen zu spät geschalten. Die Idee war ja schon, dass die Street Art werden. Also ich kann die halt überall einfach irgendwo hinkleben. Das Problem an den NFC tags ist, wenn die nahe an Metall sind, sind die nicht mehr auslesbar. Das heißt, auf Straßenschildern, auf Laterne kleben ist nicht. Es gibt eigene Sticker, die haben dann so eine Ferritschicht, dann geht es wieder. Aber diese sind massiv viel teurer leider. Genau, deswegen lassen die sich, die ich jetzt gerade bisher gemacht habe, leider nicht auf Metall kleben.",
      "start": 3140242,
      "end": 3180768,
      "confidence": 0.9338565,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was kostet denn so ein Sticker eigentlich so? Auch wenn man große Abnahmemengen abnimmt? Du bedruckst die ja auch noch mit deinem.",
      "start": 3180864,
      "end": 3188688,
      "confidence": 0.92767775,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau. Also ich habe so eine Riesenrolle. Ich habe jetzt 1000 Stück gekauft und da bin ich, glaube ich, bei €0,25 pro Stück ungefähr zwischen 20 und 25.",
      "start": 3188864,
      "end": 3199100,
      "confidence": 0.90995795,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber die sind schon bedruckt, oder?",
      "start": 3199440,
      "end": 3200808,
      "confidence": 0.98665,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du bedruckst, das ist der reine Tag sozusagen, den ich ihnen. Also der reine Tacker Sticker sozusagen, den ich in den reinleg. Genau, ich druck dann selber noch mal das Sticker Cover praktisch und die kriegen dann noch so eine UV Schutz Folierung obendrauf, damit die nicht gleich sterben, wenn man sie zweimal anfasst oder schräg anguckt oder Wasser drauf kommt oder so.",
      "start": 3200864,
      "end": 3220616,
      "confidence": 0.89066714,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wie viele Sticker hast du da jetzt schon in Umlauf gebracht?",
      "start": 3220688,
      "end": 3223704,
      "confidence": 0.90811,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das müssten irgendwie zwischen fünf und 600 sein. Also ich hatte davor eine er Rolle, die habe ich leer gemacht und dann waren es noch so ein paar Teststücke. Also genau, irgendwo zwischen fünf und 600 müssten wir gerade sein.",
      "start": 3223832,
      "end": 3235722,
      "confidence": 0.909227,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das bedeutet aber auch, du kannst jetzt nicht auf eine Laterne kleben, sondern das muss halt schon irgendwie ein anderer Untergrund sein. Das bedeutet, ich kann ja jetzt auch nicht auf mein MacBook kleben, weil MacBook hat ja auch ein Alu Gehäuse. Also das funktioniert dann auch nicht richtig?",
      "start": 3235826,
      "end": 3248090,
      "confidence": 0.91966224,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Richtig, das funktioniert leider gerade nicht. Also was ich mittlerweile noch besorgt habe, sind so Stick Teile, die man unten drunter kleben kann. Das ist eben auch gerade diese Ferritschicht, die es wieder auslesbar macht, die gibt es auch einzeln. Da habe ich ein paar. Also wenn jetzt jemand sagt, ich will welche haben, aber ich muss die unbedingt auf Metall kleben, dann kann ich da welche mitschicken, das ist kein Problem. Aber es ist leider, Ferrit ist so ein komisches Material, was absurd teuer ist. Ich weiß nicht warum, wahrscheinlich ist es irgendwie crazy in der Herstellung, keine Ahnung. Genau, aber die blanken Sticker gerade gehen leider weder auf dem MacBook noch direkt auf der Laterne.",
      "start": 3248250,
      "end": 3279820,
      "confidence": 0.9309505,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was ich aber schön finde als Analogie, und jetzt nicht, weil du damit Probleme hast, sondern es ist schon so ein bisschen wie in der Softwareentwicklung, oder? Du versuchst etwas zu machen und du hast vorhin auch gesagt, du hast dich ein bisschen überschätzt und jetzt kommt immer so dieses kleine eine Problem. Du hast ein NFC Tag in einem Sticker. Verflixt, den Sticker, wo packt man das hin? In der Regel an eine Laterne. Scheiße, kann ich dann nicht mehr scannen wegen dem Metall bei dem Holzstuhl. Verflixt, jetzt habe ich hier alles generiert und alle Kurven und jetzt muss ich die noch schleifen. Also das ist ja schon wirklich eins zu eins wie in der Softwareentwicklung. Sondern erst wenn du anfängst, die ganze Thematik zu machen, dann kommen dir diese Detailfragen, diese Probleme und vielleicht musst du dann halt irgendwann noch mal alle drucken mit dieser, wie heißt das? Ferrit Schicht.",
      "start": 3280960,
      "end": 3331922,
      "confidence": 0.92069006,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, genau.",
      "start": 3331986,
      "end": 3332870,
      "confidence": 0.79413,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Weißt du, was dieses Ferrit eigentlich ist? Weil es muss ja irgendwie das Magnetfeld entkoppeln. Eigentlich macht man das ja wieder mit Metall, oder?",
      "start": 3334010,
      "end": 3341714,
      "confidence": 0.92398334,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, genau. Also das ist. Ich kann es leider, glaube ich, nicht so richtig gut erklären. Ich glaube, also ich versuche mal das, Physiker werden mich hauen dafür, aber es sind im Grunde kleine magnetisierte Eisenstückchen, die irgendwie in so ein Epoxid gebettet werden. Und ich glaube, das ist aber selber nicht magnetisch. Habe ich auch schon mal ausprobiert, was mich irritiert hat, weil ich dachte, das wäre magnetisch, dann vielleicht ist es nicht irgend sowas. Also genau, sehr funky Material und offensichtlich irgendwie aus Gründen unerfindlich teuer.",
      "start": 3341802,
      "end": 3373732,
      "confidence": 0.9297602,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Okay, falls wir Physiker innen bei uns in der Community haben, bitte kommt vorbei und erklärt uns das mal, was es genau ist. Ich habe es auf die Schnelle mit Google auch nicht rausfinden können.",
      "start": 3373876,
      "end": 3382884,
      "confidence": 0.89153343,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Eine Frage habe ich aber noch mal zum tech Stack, denn du machst ja ziemlich viele Bildergenerierung und das packst du dann in sehr wahrscheinlich SVGs oder ähnliches. Wie programmierst du das? Was steckt dahinter? Welchen tech Stack nutzt du? Welche Libraries?",
      "start": 3382972,
      "end": 3400108,
      "confidence": 0.897765,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also der tech Stack ändert sich oder hat sich über die Zeit ein bisschen geändert. Genau, da war es schon bei den Käfern. Am Anfang habe ich gerne Processing genommen oder P Js ist praktisch die JavaScript Variante davon. Processing ist so ein mittlerweile sehr alt gediegenes, ist ja nicht nur ein Framework, eine ganze Programmierumgebung mit IDE im Grunde, die sich so für die Creative Coding Szene etabliert hat. Das ist immer noch ziemlich geil, also soll jetzt gar nicht abwertend sein, ist einfach sehr etabliert. Damit habe ich angefangen, um dann festzustellen, dass die Umgebung sich nicht so gut eignet, Vektorgrafiken zu erzeugen. Und ich interessiere mich halt schon sehr für Vektorgrafiken, gerade weil ich sage, vielleicht landet es zum Schluss auf der CNC Fräse oder im Laser Cutter. Da hilft mir eine Pixelgrafik einfach nicht weiter. Und deswegen bin ich dann gewechselt zu paperjs. Das ist eine JavaScript Library, wer hätte es gedacht, die sich eben gerade auf Vektorgrafikerzeugung spezialisiert hat. Also wer schon mal Inkscape oder Illustrator oder sowas benutzt hat, im Grunde ist es das nur skriptbar. Also alle Funktionen, die man da so gängigerweise findet, kann ich da halt in Code ausführen und abbilden.",
      "start": 3400204,
      "end": 3471734,
      "confidence": 0.93187946,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Paperjs, the Swiss army knife of vector.",
      "start": 3471862,
      "end": 3474822,
      "confidence": 0.84039426,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Graphics, wird auch immer noch weiterentwickelt, aber stockt manchmal so ein bisschen, aber hat eine aktive Community auf jeden Fall noch.",
      "start": 3474886,
      "end": 3483290,
      "confidence": 0.9739905,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Die meisten Projekte von dir sind ja auch auf deinem GitHub Profil zu finden. Und ich war natürlich in der Vorbereitung auch auf deinem GitHub Profil und habe gesehen, da sind 58 Repositories in deinem GitHub Profil. Und was man ja üblicherweise macht oder was üblicherweise der Fall ist, dass da ganz viele Forks und so weiter drin sind. Und was ich immer mache, um schnell festzustellen, wie viel Code eigentlich eine Person da publisht, ist dann zu filtern auf wirklich Sources, was sind eigene Repositories. Und die Zahl ist gleich geblieben bei dir. Also die 58 Repositories sind alle von dir. Machst du das immer so, dass du alles open source stellst und die ganzen Projekte immer public zur Verfügung hältst?",
      "start": 3483590,
      "end": 3524838,
      "confidence": 0.92336494,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich versuche das schon. Das ist mein Ziel eigentlich alles Open Source, open Source zu haben. Ich muss aber gestehen, ich bin nicht so gut darin, gut zu dokumentieren. Also viele, das hast du wahrscheinlich auch gesehen, wenn man so durchklickt, viele Repositories sind so ein bisschen, ich sag mal, verwaist im Sinne von der Code ist da, aber sonst nicht so viel Info. Ich gebe mein Bestes, ich versuche mich zu bessern, aber es ist mir schon wichtig, Code auch zu veröffentlichen und zwar auch möglichst mit Lizenzen, die die Nutzung, also eigentlich im Grunde jegliche Nutzung erlauben. Also ich habe so ein paar Sachen, wo ich auch noch keine richtige Lizenz dran habe, weil ich das immer, ich finde Lizenzen immer so ein bisschen schwierig, aber im Grunde möchte ich eigentlich, dass das jeder irgendwie davon lernen kann und eigentlich auch selber weiter benutzen kann, wenn er das möchte.",
      "start": 3524934,
      "end": 3569846,
      "confidence": 0.9431512,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ist das deine Art und Weise, wie du digitale Kunst archivierst? Durch eine Open Source Lizenz zur Reproduktion und dann, ich sag mal in der Hoffnung, dass GitHub nicht das nächste Sourceforge wird?",
      "start": 3569958,
      "end": 3580086,
      "confidence": 0.9074435,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Im Grunde schon, also ich hoffe zumindest, dass es hilft. Also ich kenne halt auch andere Medienkünstlerinnen, die da eine ganz andere Schiene fahren, die sagen z.B. mein Code ist, den zeige ich gar niemandem, den veröffentliche ich vielleicht posthum oder sowas, dann kann man auch machen, aber ich hoffe eigentlich schon, dass so besser erhalten bleibt oder auch, dass einfach mehr Leute was davon haben, weil irgendwie ich lebe ja von öffentlichen Mitteln und dann finde ich auch, dass das irgendwie wieder der Allgemeinheit zugeführt werden sollte und auch wenn, keine Ahnung, kann ja auch mal sein, ich aus welchen Gründen auch immer, meine Server, wo das irgendwie deployed ist, sind irgendwann nicht mehr online, dann kann es sich zumindest jemand anderes schnappen und wieder deployen irgendwie oder halt, weiß ich nicht, in 300 Jahren den Text noch mal so überarbeiten, dass es wieder auf dem Quantencomputer läuft oder so.",
      "start": 3580158,
      "end": 3626622,
      "confidence": 0.9372196,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wer weiß, vielleicht sollte man mal ein Backup von GitHub auf irgendeinen Planeten oder so schießen, da werden immer so Mozartstücke und so ins Weltall geschossen. Vielleicht sollte man ein GitHub Mirror mal da irgendwie aufbauen, das wäre cool.",
      "start": 3626726,
      "end": 3642130,
      "confidence": 0.8708074,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Gibt es das eigentlich Archive Org? Also ganz gibt es so ein GitHub Back, also ich hoffe, dass GitHub selbst irgendwelche Backups hat, aber ich meine so Archive org, ich glaube die archivieren ja Internetwebseiten und auch Bücher und ganz viele andere Sachen. Archivieren die eigentlich auf Source Code?",
      "start": 3642710,
      "end": 3658130,
      "confidence": 0.91023487,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Gute Frage, gute Frage, bin ich mir.",
      "start": 3658210,
      "end": 3660034,
      "confidence": 0.9769943,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Auch nicht sicher, aber wäre eigentlich ein guter Ort, was hinzulegen, auf jeden Fall. Also stimmt eigentlich.",
      "start": 3660042,
      "end": 3665378,
      "confidence": 0.9310024,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich habe gerade kürzlich gelesen, dass OpenAI scheinbar alle oder ich glaube Copilot war es Copilot alle Repositories, die co public waren, gecrawlt hat und auch verwendet, auch wenn du es im Nachhinein wieder private gesetzt hast und das scheinbar ziemliches Problem ist, dass sogar Microsoft interne Repositories, die versehentlich mal irgendwie 2 Stunden online waren, jetzt in Copilot verwendet werden.",
      "start": 3665474,
      "end": 3689326,
      "confidence": 0.9395918,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und wie sind die da rangekommen.",
      "start": 3689398,
      "end": 3690942,
      "confidence": 0.8952683,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ist ja GitHub Copilot crawled intern, sobald irgendwie ein Repository public ist, wird das scheinbar gecrawlt und intern verwendet als und das kann halt auch nur sehr.",
      "start": 3691006,
      "end": 3701740,
      "confidence": 0.8858893,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Kurz online sein, der Begriff Copilot. Ich glaube, jede dritte Applikation heißt gerade Copilot, deswegen. Okay, du meinst GitHub Copilot.",
      "start": 3701780,
      "end": 3709660,
      "confidence": 0.9100795,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "GitHub Copilot, ja, können wir gerne verlinken. Ist gerade vor ein paar Tagen, glaube ich, rausgekommen.",
      "start": 3709820,
      "end": 3714668,
      "confidence": 0.9035356,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber Sabine, jetzt möchte ich auch selbst Sticker herstellen und jetzt möchte ich auch mir meinen eigenen Gartenstuhl fräsen oder vielleicht nicht Käfer generieren lassen, sondern Katzen. Welchen Tipp gibst du mir als wirklicher Kunstbanause, wie ich in der ganzen Thematik starten kann? Also was sagst du mir? Welchen Tipp gibst du mir, dass ich loslegen kann?",
      "start": 3714764,
      "end": 3739724,
      "confidence": 0.8907772,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich glaube, am besten ist es, mit der möglichst geringen Hürde loszulegen. Also wenn du jetzt schon, ihr habt ja, ihr seid ja alle auch Coder, das heißt, ihr habt ja schon irgendwie die Sprache eures Vertrauens. Dann ist glaube ich, der erste nächste Schritt, sich irgendwie da die passende Grafik, Grafikumgebung oder Grafik Library rauszusuchen und einfach mal anzufangen. Es ist irgendwie der Standardspruch, aber ich glaube einfach einfach mal anfangen und ausprobieren ist glaube ich das allerbeste. Und ansonsten finde ich sehr schön als Ressource ist the Coding Train. Das ist Daniel Schiffman, der hat ewig lange YouTube Tutorials, trifft es nicht, aber der pickt sich immer so kleine Themen, so kleine Creative Coding Themen und setzt die mal um und da kann man sich sehr viel Inspiration holen und Sachen abgucken. Das kann ich empfehlen. Und wenn man ich bin gar nicht auf so eine Sprache festgelegt, ich weiß überhaupt gar nicht, wo ich überhaupt, vielleicht programmiere ich noch gar nicht oder so. Dann würde ich auch sagen, ist Processing und die Community rund um Processing hat ganz viele Ressourcen, auch mit sehr schönen Einstiegs Workshop, also Online Tutorials und Workshops, wo man sich mal einfach durchklicken kann und mal ausprobieren kann.",
      "start": 3739892,
      "end": 3808454,
      "confidence": 0.9249992,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und wenn man jetzt glaubt, man hat irgendwie was Kunstähnliches erschaffen oder man definiert es einfach selbst als Kunst, was ja offiziell dann auch Kunst ist. Wie kommt man in so eine Ausstellung? Hast du da irgendwie einen Tipp, wie man da das quasi auf Next Level kommt? Wen kann man kontaktieren? Gibt es da Anlassstellen? Wie kommt man rein in diese Szene?",
      "start": 3808542,
      "end": 3829782,
      "confidence": 0.9210108,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich glaube, da gibt es gar das ist schwierig, ich weiß es nämlich manchmal auch nicht, weil mir ist das immer so ein bisschen passiert, aber ich glaube, was man machen kann, ist im Grunde sich auf Wettbewerbe zu bewerben. Da gibt es halt oft welche, die explizit ausgeschrieben sind für Newcomer im Grunde. Also das kann man machen. Es gibt halt auch viel so Kunstmessen, das finde ich oft irgendwie mal gar nicht so cool. Vielleicht habe ich einfach schlechte Erfahrungen mitgemacht, aber so Kunstmessen, reine Kunstmessen fand ich immer gar nicht so toll irgendwie. Oder ich weiß nicht, wenn hier, also der Softwareecke spricht auch nichts dagegen, einfach mal im Hackspace eine eigene kleine Vernissage abzuhalten irgendwie, wenn sich da 10 Leute finden, die irgendwie alle irgendwie mal was cooles gebaut haben, einfach eine eigene Ausstellung machen, finde ich eigentlich noch viel geiler, glaube ich.",
      "start": 3829926,
      "end": 3876358,
      "confidence": 0.9195299,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber ist das nicht eigentlich wie immer im Leben? So nach dem Motto, du machst was, kommunizierst das und irgendwann stößt da jemand drauf, der hat cool, die Sabine, die brauchen wir in der Ausstellung hier. Also so nach dem Motto, das ist eben Zufall ist. Also ich meine, es gibt ja auch einen Artikel von einer recht bekannten Internet Person, die sagt, auf Deutsch sagt man, dass die Oberfläche deines eigenes Glück ist. So nach dem Motto, dass du Glück doch beeinflussen kannst, denn umso mehr du über deine Arbeit kommunizierst, desto eher förderst du das Glück, dass andere Leute das sehen und dich dann ansprechen. Wenn du alles nur in einem stillen Kämmerlein machst, dann erhöhst du nicht deine Oberfläche des Glücks, wenn man so möchte. Kann ich auch auch unten in den Shownotes verlinken. Sehr interessanter Artikel. Geht jetzt, also hört sich total tief an und poetisch und so weiter und so fort, ist aber eigentlich nur das, was du machst. Mach mal ein YouTube Video raus. Gefühlt. Also YouTube ist vielleicht jetzt schon Königsklasse, weil auch Sabine, du machst das sehr gut. Ich habe ja schon erwähnt, dass ich mich da in der Vorbereitung auch zwei, drei 4 Stunden in dem YouTube Kanal verloren habe.",
      "start": 3876414,
      "end": 3935500,
      "confidence": 0.9047903,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also vielleicht für alle, die natürlich nicht in unserem Vorgespräch dabei waren, aber Andi hatte Sabine gerade ausgequetscht über ihr Tiny House, wie die Anschlüsse waren, wie das gebaut wurde, der Kran und so weiter. Kann man übrigens sehr viel auf YouTube auch nachschauen. Gleich wie das kleine Elektroauto, also Auto unter Anführungszeichen, sagt glaube ich nur drei Räder, wenn ich das richtig im Kopf habe. Da hast du jetzt auch einige Videos dazu gemacht. Also Andi ist schon super großer Fan von deinem ganzen YouTube Kanal. Den verlinken wir natürlich auch noch.",
      "start": 3935500,
      "end": 3965080,
      "confidence": 0.9133219,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Naja, können wir das mal ganz kurz ausführen, warum? Erstens, ich war genauso baff wie Sabine in ihrem Video was zur Hölle ist ein City L? Und für alle, die es nicht wüssten, ich habe es nachgeguckt, ein dreirädriges, Leichtfahrzeug mit Elektroantrieb für eine Person, das auch als Cabrio gefahren werden kann. Und warum sprechen wir darüber? Das war einer deiner letzten Projekte. Du hast ja so ein Ding besorgt und hast das wieder fit gemacht. Ich weiß jetzt nicht, inwieweit das mit Kunst zu tun hat oder ob du nur Bock drauf hattest, aber ich war jetzt schon Fan und laut Wikipedia fährt das Ding 57 bis 63 km h. Im Video sagst du, weil du die Batterie geupgradet hast, fährt das Ding inzwischen 70 km h. Und dann ist natürlich als guter Deutscher fragt man hä moment, das Ding hat eine Straßenzulassung, was ist denn da mit TÜV? Und in dem Video fährst du dann sogar noch zum TÜV. Und du hast so beschrieben, als hatte der TÜV Beamte gar keine, keine Plan, was der da vor sich sieht, oder?",
      "start": 3965120,
      "end": 4027442,
      "confidence": 0.9021025,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, im Grunde schon. Ich habe den überrumpelt. Das war so ein Freitag früh, erster TÜV Termin. Der war glaube schon eh in Wochenendstimmung und hat das Ding dann gesehen. Also das Ding, ihr müsst euch ein Foto angucken, man kann sich schlecht beschreiben. Es ist so ein bisschen wie eine Badewanne mit Deckel drauf. Sieht ganz obskur aus, das Ding. Genau, das habe ich ihm halt hingestellt und meinte so, hab ihm gar nichts gesagt, habe einfach nur gesagt so braucht TÜV. Und dann war er irgendwie sehr verunsichert und hat sich reingesetzt, ist einmal im Kreis gefahren, hat die Hupe gedrückt, hat gebremst, hat die Handbremse gezogen, geguckt, ob der Blinker geht. Und dann ist er ausgestiegen und hat doch glaube ich, irgendwas zum Meckern gesucht. Dann hat er die Reifen gesehen. Das Ding stand halt 20 Jahre lang in der Garage davor irgendwie. Es waren halt noch die alten Reifen drauf. Ja, ja, aber die Reifen müssen neu, sonst passt es schon. 5 Minuten gedauert und dann hatte ich eine TÜV.",
      "start": 4027546,
      "end": 4078582,
      "confidence": 0.93385404,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Vor allem dieses Ding ist erst den ERN. Also oder ich weiß nicht, wann deines Baujahr ist, aber.",
      "start": 4078726,
      "end": 4083650,
      "confidence": 0.883115,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Er Baujahr glaube ich. Genau. Und erste Zulassung war 94. Ja, genau. Der ist wirklich alt und der stand halt auch jetzt wirklich lang rum einfach.",
      "start": 4085550,
      "end": 4092118,
      "confidence": 0.93988883,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber das Video ist sehr, sehr schön, denn in dem Video zeigst du auch, wie du die alte Elektronik rausreisst und wie du jetzt mehr Platz in dem Ding hast, unter dem Sitz und so weiter, weil die ganzen Elektronikteile natürlich deutlich kleiner wurden. Klar, jetzt zeige ich das nochmal, Radio rausgerissen und so, was du dann vielleicht nicht mehr hast. Alles gut. Aber solche, solche Projekte machst du ja auch, oder? Du hast hier ein Tiny House gekauft und was es dann für Möglichkeiten im Tiny House gibt. Und dann ein Jahr Resümee, was toll ist und was nicht toll ist.",
      "start": 4092294,
      "end": 4118768,
      "confidence": 0.934174,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also du hast nicht nur ein Tiny House gekauft, du lebst auch darin.",
      "start": 4118904,
      "end": 4122368,
      "confidence": 0.94451076,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ja, korrekt, genau. Also mit meinem Partner. Genau. Und man muss vielleicht ein bisschen dazu sagen, es ist jetzt nicht dieses Bauwagen Tiny House, es ist nicht ganz so winzig, schon ein bisschen größer. Ist am großen Ende vom Tiny House Spektrum. Genau. Hervorragend. Ich wohne drin, ich sitze hier gerade in meinem Minibüro. Genau.",
      "start": 4122464,
      "end": 4138430,
      "confidence": 0.9567018,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber was meine ursprüngliche Frage war, bevor Andi da jetzt ins Detail gegangen ist, was wirklich coole Projekte sind, startest du solche Projekte mit irgendeiner Intention oder startest du einfach mal los, ist irgendwie ein cooles Projekt, du machst YouTube Videos und dann kommt irgendwer um die Ecke und macht vielleicht auch noch Kunst daraus oder so. Oder hast du da irgendwie Struktur oder wie findest du deine Ideen überhaupt? Oder planst du da irgendwas oder schießt du einfach drauf los?",
      "start": 4138590,
      "end": 4164032,
      "confidence": 0.9090623,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich glaube, ich schieße viel drauf los. Also ich habe schon so eine Anfangsidee, über die man dann mal ein bisschen nachdenkt und sagt, sowas wäre ja mal cool. Und manchmal liegt die Idee dann auch irgendwie drei Jahre in so einem Notizbuch rum, bis sich bestimmte Teile zusammenfügen. Manchmal fehlt mir Wissen irgendwie was, keine Ahnung, also mit dem Platinen z.B. da fehlt mir einfach ganz, hat mir ganz viel Wissen gefehlt und hat es sich eben ergeben, dass ich Leute auf einmal im Freundeskreis hatte, die ich da ganz viel fragen konnte dazu und dann genau, dann hat es auf einmal funktioniert. Drei Jahre vorher hätte ich das nicht machen können, ich mir das wahrscheinlich nicht so richtig gut selber hätte aneignen können, das Wissen komplett. Aber ich schieße schon viel drauf los und guck mal, ob es funktioniert oder nicht. Es gibt auch Sachen, die dann einfach nicht klappen, die man dann halt wieder verwirft, weil man nach 2 Stunden programmieren oder rumprobieren merkt, ah ne, irgendwie die Idee war nett, aber es wird nichts mehr.",
      "start": 4164136,
      "end": 4213562,
      "confidence": 0.92564505,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Was ist denn so die Ratio von Projekten, die du anfängst und dann wegschmeißt?",
      "start": 4213666,
      "end": 4217810,
      "confidence": 0.954245,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Boah, schwierig zu sagen. Also ich glaube so im sehr frühen Stadium schmeiße ich wahrscheinlich schon viel weg, aber da ist es halt echt noch oft so reine Konzeption oder sitze ich mal 2 Stunden da und denke so ein bisschen rum und recherchiere ein bisschen, merkst oh ne, OK, haut gar nicht hin, da habe ich sicher viele Sachen und wenn ich dann anfange umzusetzen, dann ist es, ich glaube dann sind es gar nicht mehr so viel. Dann sind es vielleicht, ich sage jetzt, weiß nicht, ob es ganz stimmt, aber ich würde mal sagen so 1/4 Viertel fliegt vielleicht so in den ersten paar Tagen wieder raus, weil man irgendwie anfängt zu bauen und merkt, oh ne, aber das, ich sag mal. Und danach ist dann aber oft schon so viel Zeit investiert, dass ich es schon in irgendeiner Form zu irgendeinem Abschluss bringe. Manchmal wird es halt nicht so cool, wie man sich gedacht hat. Passiert ja auch mal, aber man kann dann doch noch irgendwas draus machen. Aber viele Projekte sind ja auch, die ziehen sich dann echt lang. Also z.b. diese Bugs Beatles Sachen, die habe ich halt auch zu 1000, oh Gott, ich weiß gar nicht mehr, 18 oder so gestartet. Und ich habe eigentlich fast jedes Jahr mal noch irgendwas damit gemacht oder weiterentwickelt. Ich habe letztes Jahr ganz viel, habe ich eine Laser Cutter Variante davon gemacht für eine Veranstaltung. Die wollten da, da ging es um Bug Bounty Programm, die wollten da Veranstaltungsbadges für haben, z.B. also sowas lebt dann.",
      "start": 4217890,
      "end": 4290382,
      "confidence": 0.90965945,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Auch oft weiter, das ist ja super schön, Security Bugs und dann so unique, das ist ja eine super, super schöne Analogie.",
      "start": 4290406,
      "end": 4297719,
      "confidence": 0.91277957,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, fand auch, das hat super gut gepasst. Die kamen auch echt gut raus. Die kamen gut an, das war sehr cool.",
      "start": 4297799,
      "end": 4302599,
      "confidence": 0.9486041,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Jetzt kann ich natürlich jedem empfehlen, deinen YouTube Kanal mal anzuschauen und auch deine Webseite, da sind natürlich alle Projekte und so weiter verlinkt. Hast du noch irgendwelche anderen Quellen, wo du sagst, wenn man sich für digitale Kunst im Allgemeinen interessiert, das sind Anlaufstellen, abseits von deinen ganzen Kanälen, die irgendwie cooles Zeug machen, wo man auch informiert wird oder irgendwelche Museen, die sich speziell auf Digital Kunst spezialisiert haben oder so, die du einfach gerne auch besuchst?",
      "start": 4302759,
      "end": 4332004,
      "confidence": 0.92340255,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also was ich persönlich gerne mag, ist z.B. in Deutschland das ZKM, das Zentrum für Kunst und Medien in Karlsruhe. Die haben eine ganz tolle Dauerausstellung und dann halt immer noch einen Teil, der wechselt und der ist echt sehenswert. Also wer mal irgendwie in Karlsruhe Umgebung ist, da mal kurz hinzugehen, also kurz ist gut, damals am Nachmittag hinzugehen und sich das anzuschauen, kann ich auf jeden Fall Fall echt empfehlen. Und wer sonst irgendwie kunsttech affin ist, es gibt am ZKM einmal im Jahr die Gulasch Programmiernacht. Das ist aus der Chaos Communication Bubble raus oder aus der, aus der Chaos Computer Club Bubble raus. Eine Veranstaltung, die relativ groß ist eigentlich schon.",
      "start": 4332132,
      "end": 4372242,
      "confidence": 0.89931864,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Moment, Gulasch. Gulasch, so wie das Essen.",
      "start": 4372346,
      "end": 4374834,
      "confidence": 0.84234285,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Gulasch, ja. Also ehrlicherweise, ich kenne die Story hinter dem Namen gar nicht so richtig gut, aber ich gehe mal davon aus, es gab halt immer Gulasch und deswegen heißt es jetzt so. Es gibt auch jedes Jahr immer noch gulasch, mittlerweile auch mal zwischendrin vegan oder vegetarisch, zumindest ist eine schöne Veranstaltung, muss man kein Ticket für kaufen, kann man auch einfach mal auch so einen Tag vorbeigehen. Das geht eigentlich immer über vier Tage. Ist eine sehr schöne Veranstaltung, die ist auch sehr empfehlenswert. Wow. Ansonsten ist es, also vor ein paar Jahren hätte ich noch gesagt, Twitter war eine echt gute Anlaufstelle mit dem Hashtag Plotter Twitter. Das ist jetzt halt tot einfach. Das hat sich so ein bisschen verlebt und halt verteilt. Also man findet die Leute jetzt halt dann unterschiedlich auf Mastodon, auf Blue Sky, auf Instagram oder so. Es ist aber so ein bisschen zerfasert.",
      "start": 4374882,
      "end": 4417550,
      "confidence": 0.941943,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Wenn du einen Wunsch hättest von was du dir von Deutschland oder der Community wünschen würdest für dich, für digitale Kunst, für generative Kunst, für Kunstförderung, für vielleicht auch einfach, weiß ich nicht, falls du pommes mit Mayonnaise essen möchtest, weiß ich nicht. Aber was würdest du dir von Deutschland oder der Community wünschen, wenn du was frei hättest?",
      "start": 4417630,
      "end": 4437420,
      "confidence": 0.91569865,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das ist eine ganz schön schwierige Frage. Also ich finde die Community insgesamt eigentlich sehr angenehm und sehr offen, deswegen bin ich da sehr glücklich mit. Ich glaube, ich glaube, ich würde mir vielleicht wünschen, dass es noch mehr Angebote für Kinder, Jugendliche, junge Erwachsene gibt, z.B. Über Creative Coding mal ins Programmieren einzusteigen, weil ich glaube, das ist eine sehr gute Richtung, das Leuten nahezubringen, die vielleicht sonst gar kein Interesse am programmieren hätten und einfach da mal Angebote zu haben, einfach zum ausprobieren, fände ich, glaube ich ziemlich cool.",
      "start": 4437500,
      "end": 4473212,
      "confidence": 0.93249404,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber da machst du ja auch was, oder? Du tingelst ja gerade auch durch Klassen und machst mit denen ein Coding.",
      "start": 4473356,
      "end": 4479724,
      "confidence": 0.93104523,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Genau, also ich mache immer wieder Workshops, auch mit Jugendlichen, aber das hat immer eine Finanzierungsfrage. Also manchmal zahlt es auch echt irgendwie, ich weiß mal an Schulen, dann zahlt es irgendwie so dieser Schulförderverein praktisch immer diese Freunde der Schule so und so oder sowas. Das mache ich schon hin und wieder. Genau. Aber ich glaube, das irgendwie, weiß ich nicht. Also ich könnte, keine Ahnung, ich finde, jeder sollte mal kurz programmiert haben, also eine Form von Programmieren. Das muss auch gar nicht irgendwie programmieren as in. Ich schreibe hier typischen Programmcode. Ich finde auch sowas wie scratch oder so blockmäßiges Programmieren eigentlich schon ziemlich cool. So was müsste eigentlich jeder mal gemacht haben. Und das vielleicht einfach in so ein Schulwesen besser zu integrieren und dann eben halt auch über mehrere Richtungen zu gucken. Ich finde gerade diese Kunst Creative Coding Richtung ist halt eine, die catcht halt echt noch mal viele Leute, die vorher gesagt haben, fand ich eigentlich immer voll langweilig, aber so war es, das hat mir jetzt Spaß gemacht und das ist eigentlich schon das Beste, was rauskommen kann, zu ey, es macht ja Spaß. Cool, habe ich das mal gemacht.",
      "start": 4479852,
      "end": 4538150,
      "confidence": 0.913077,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Erfahrung reicher Langeweile kommt auf keinen Fall auf. Wenn man sich mal deine Projekte anschaut, und die lege ich jedem Hörer und hörer mal ans Herz. Wenn ihr diese Podcast Episode hört, springt heute Abend auf den YouTube Kanal kleiner macht das nicht, wenn ihr 5 Minuten Zeit habt, sondern eher 50. Ist eine super interessante Geschichte, auch sehr, sehr viel zu lachen. Sabine, oder blieb track. Vielen lieben Dank, dass du die Zeit genommen hast, uns in diesem Bereich mal ein bisschen zu erleuchten. Ich habe auf jeden Fall Lust. Und jetzt ist die kaufe ich mir sofort einen d Drucker oder eine CNC Fräse? Ich weiß es nicht. Mein Geldbeutel wird mir, glaube ich, nicht danken. Die Schuld gebe ich dir, aber ich hoffe, das ist okay. Wo kann man dich das nächste Mal sehen? Live?",
      "start": 4538310,
      "end": 4580282,
      "confidence": 0.92526555,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Live und in Farbe. Das nächste mal. Die nächste Veranstaltung wäre Edinburgh, die Open Source Hardware Summit. Tatsächlich. Da bin ich. Oder im Sommer.",
      "start": 4580426,
      "end": 4590970,
      "confidence": 0.87893,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Man muss dann nach Schottland fahren.",
      "start": 4591050,
      "end": 4592778,
      "confidence": 0.8990567,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da muss. Da müsste man nach Schotter fahren. Ich habe in Deutschland gerade gar nichts richtiges anstehen. Vermutlich. Es gibt noch ein großes Hacker Camp in Amsterdam im Sommer, da bin ich noch. Das sind, glaube ich, gerade die großen nächsten Veranstaltungen, die ich so auf dem Schirm habe.",
      "start": 4592954,
      "end": 4607410,
      "confidence": 0.932679,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Und sonst hier einfach folgen. Man wird dann sicher informiert, wenn du irgendwo.",
      "start": 4607410,
      "end": 4610338,
      "confidence": 0.95125383,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Auf jeden Fall.",
      "start": 4610434,
      "end": 4611310,
      "confidence": 0.92631334,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Aber das bedeutet auch, wenn jetzt irgendeine Firma mal so ein bisschen die engineering Community fördern möchte, die können dich auch anschreiben, dass du da mal eine Aufstellung machst oder mal einen Workshop gibst oder ähnliches, oder?",
      "start": 4612250,
      "end": 4623074,
      "confidence": 0.90811133,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Sehr gerne, auf jeden Fall.",
      "start": 4623162,
      "end": 4624306,
      "confidence": 0.99792,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Kontaktdaten findet wir wie immer in den Shownotes natürlich inklusive allen Links zu P, JS Paper, JS Coding, Train Processing, natürlich auch wie Piet Mondrian Komposition mit rot, blau und gelb aussieht. Dann auch den Jens Share Talks über Operation Mindfuck Volume sieben auf dem Chaos Computer Club Kongress und so weiter und so fort. Natürlich auch den Cityl, ganz wichtig. Der City L taucht da mal ein. Sehr, sehr faszinierende Thematik. Sabine, vielen lieben Dank für deine Zeit und wir sagen tschüss, bis bald.",
      "start": 4624378,
      "end": 4659770,
      "confidence": 0.88393897,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Danke, dass ich da sein durfte. Macht's gut. Ciao, ciao, ciao.",
      "start": 4659850,
      "end": 4662410,
      "confidence": 0.9309109,
      "speaker": "C",
      "channel": null
    }
  ],
  "confidence": 0.9203421,
  "audio_duration": 4515,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}