{
  "language_code": "de",
  "audio_url": "https://cloud.inlupus.at/s/oFpFp4iwkcxbijB/download/ep187_sea_sheperd.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "multichannel": null,
  "audio_channels": null,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_audio_quality": null,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "language_confidence_threshold": null,
  "language_confidence": null,
  "speech_threshold": null,
  "speech_model": null,
  "id": "14146bf4-b650-4dc8-acfe-582e45d91320",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Vor gar nicht allzu langer Zeit haben wir in diesem Podcast ein neues Format gestartet und wir haben das unter dem Arbeitstitel Code mit impact gestartet. Und damals war die Prä okay, lass uns doch mal schauen, wie Source Code und Softwareentwicklung einen Impact auf die reale Welt hat, indem wir einfach mal einen Einblick in verschiedene Arbeitsdomänen geben. Wir hatten, wie man für Kreuzfahrtschiffe Software programmiert. Vor kurzem hatten wir etwas im Bereich generative Kunst. Und heute geht es mit, wenn ich schon von Schiffen rede, auch in irgendeiner Art und Weise um Schiffe bzw. Um Wasser. Und wie bin ich auf dieses Thema gekommen? Und zwar jedes Jahr gibt es ein Filmfestival, nennt sich das. Ich nenne das eigentlich mal einen Kinofilm. Das nennt sich International Ocean Filmtour. Die schnappen sich Filme, die mit Wassersport, dem Meer, dem Ozean und der Unterwasserwelt zu tun haben. Die schnappen sich die Filme und machen daraus ein, wie ich sag mal, Sammelsorium und schneiden dann die sechs besten Filme in so 15 bis 20 Minuten Videos zusammen. Und dann machen die daraus so einen kleinen Kinofilm und touren durch Kinos. Und da bin ich eigentlich fast jedes Jahr, weil ich das sehr spannend finde zum Surfen, Kanu und so weiter und so fort. Ich schaue mir das immer in der Lichtburg in Essen an. Das ist so ein altertümliches Kino. Sehr, sehr schön. An diesem Filmfestival gibt es auch immer Sponsorenstände beziehungsweise Organisationen, die halt ziemlich viel mit dem Thema, ich nenne es mal Wasser und Meeresbiologie und Co. Zu tun haben. Und da ist auch immer ein Stand von der Organisation Sea Shepherd. Und irgendwann saß ich mal, ich glaube letztes Jahr, in dem Kinofilm und da Moment mal, die müssen doch auch irgendwas mit Technologie und IT und Software und so weiter zu tun haben. Und da sind ja keine fünf Mann mehr oder fünf Frauen, sondern ist ja inzwischen schon eine Riesenorganisation. Steckt ja auch ordentlich Kapital hinter, wenn ich die ganzen Dokumentationen mit diesen riesen Schiffen sehe. Deswegen, okay, wen spricht man denn da mal an und wo kriegt man denn mal Insights, wie die denn die ganze Technologie nutzen? Und da habe ich einfach mal irgendwann eine e Mail an, ich glaube, Info Shepherd Deutschland oder Marketing oder sowas gesendet. Einfach mal so nach dem Motto wer fragt, der kriegt auch eine Antwort. Und ich habe gedacht, die geht eigentlich irgendwo unter die e Mail, aber nee, ich habe eine Antwort bekommen. Und was mich richtig, richtig freut, nach ein paar Gesprächen sind wir jetzt in diesem Podcast gelandet, in dieser Podcast Aufnahme. Und die Antwort damals kam von Flo, Florian Stadler. Hallo Florian.",
      "start": 88320,
      "end": 235252,
      "confidence": 0.92098033,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, moin.",
      "start": 235316,
      "end": 236360,
      "confidence": 0.830775,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Du hast mir damals geantwortet und jetzt ist natürlich die wer hat mir da geantwortet? Und zwar hat mir jemand geantwortet, der bereits seit 15 Jahren für Sea Shepherd aktiv ist. Seit fünf Jahren hast du das Privileg, bei Sea Shepherd Deutschland fest angestellt zu sein. Wenn man deinen Namen googelt, findet man ein Porträt von ProSieben von 2021 von dir auch auf YouTube, verlinken wir natürlich auch in den Shows. Da bezeichnest du dich selbst als Sehaktivist. Aktuell bist du Kampagnenleiter von C Deutschland. Das ist auch der Grund, warum du auf meine E Mail geantwortet hast. Vielen Dank nochmal dafür. Und jetzt natürlich die warum kannst du denn jetzt über die Themen Software, softwareentwicklung bzw. Wie ihr Daten für C nutzt, reden? Du hast unter anderem vorher Elektro und Informationstechnik studiert im Fachbereich medizinische Elektronik bzw. War das deine Spezialisierung im Master. Ist das alles korrekt oder habe ich irgendwas ganz wichtiges vergessen?",
      "start": 237420,
      "end": 295562,
      "confidence": 0.937568,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ne Andi, das ist absolut richtig. Genau so ist es.",
      "start": 295626,
      "end": 298698,
      "confidence": 0.894317,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt stellt sich mir natürlich sofort die liest du da alle E Mails, die an diese e Mail Adressen, Info oder Marketing, wo sich der Andi hingeschrieben hat, gehen? Oder ist es an dich weitergeleitet worden aufgrund deines Backgrounds und weil du Kampagnenleiter bist?",
      "start": 298754,
      "end": 312490,
      "confidence": 0.9233027,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau, das wird mir dann weitergeleitet. Also ich habe meinen eigenen Bereich als Kampagnenleiter, da kümmere ich mich ja um die ganze operative Arbeit, das heißt die Planung und die Durchführung der Einsätze und alles, was damit zusammenhängt. Aber gerade wenn solche Anfragen kommen und die denken, dass ich die am besten beantworten kann, dann kriege ich die weitergeleitet und dann kümmere ich mich drum. Ich muss aber auch dazu sagen, dass wir ein super kleines Team sind. Also wir sind in Deutschland nur eine Handvoll Angestellter, werden jetzt immer mehr, weil wir natürlich auch wachsen und immer mehr Aufgaben auch in Norden Ostsee aufnehmen. Aber da sind die Wege nicht weit, dass das mal bei mir auf meinem Schreibtisch oder auf meinem Handy oder auf dem Schiff landet.",
      "start": 312570,
      "end": 350214,
      "confidence": 0.95919305,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt hast du schon Einsätze gesagt. Was war dein letzter Einsatz oder wie kann man sich sowas vorstellen?",
      "start": 350262,
      "end": 354678,
      "confidence": 0.931195,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Mein letzter Einsatz, der Einsatz war im November letzten Jahres auf Rügen. Und zwar war das ein undercover Einsatz, weil dort eine unüblich hohe Anzahl von Kegelrobben tot aufgefunden wurden mit einem sehr starken Verdacht, dass es mit einem Fanggerät in der Nähe zu tun hat. Genau. Neben den geplanten Einsätzen, die wir jedes Jahr durchführen, die Kampagnen, haben wir dann auch solche spontanen Einsätze, wo wir versuchen, eben Kriminalfälle auf See, was Meeresumwelt angeht, zu verfolgen und unseren Beitrag zur Aufklärung zu leisten.",
      "start": 354774,
      "end": 388942,
      "confidence": 0.9181808,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn du sagst undercover Einsatz, das darf ich mir aber jetzt nicht so vorstellen wie im Tatort, wo man dann in der Nacht mit dunklen Mänteln durch die Straßen zieht, oder doch?",
      "start": 449086,
      "end": 458930,
      "confidence": 0.95056564,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja doch, das kann man sich tatsächlich auch schon so vorstellen. Wir sind ja in den Bereichen auch sehr gut ausgerüstet und haben uns auch selber immer wieder weitergebildet und neue Skills zugelegt, um solche Sachen zu machen. Und da geht es natürlich vornehmlich darum, Informationsbeschaffung zu machen und müssen wir auch tief in die Trickkiste greifen manchmal.",
      "start": 459270,
      "end": 479722,
      "confidence": 0.966175,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt ist es so, der Name Sea Shepherd, den hat man bestimmt schon mal hier und da im Internet gelesen oder auf irgendeiner Zeitung, vielleicht auch auf der Titelseite der Bild Zeitung, man weiß es nicht, aber vielleicht können nicht alle Leute den Namen einordnen. Was ist Sea Shepherd genau? Was ist die Mission und wie unterscheidet sich da unter anderem auch Sea Shepherd Deutschland z.B. von dem Namen Sea Shepherd als globale Organisation?",
      "start": 479866,
      "end": 503742,
      "confidence": 0.93008393,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also erstmal unterscheiden wir uns gar nicht von Sea Shepherd global oder den ganzen anderen Sea Shepherd Chaptern. Das ist im Endeffekt ein Verbund unter der Schirmherrschaft von Sea Shepherd Global. Da gibt es eben diese Landesgruppen, da zählen natürlich Länder wie Deutschland dazu, Italien, aber auch z.B. australien. Und zusammen machen wir zwei Sachen. Also wir kümmern uns um den aktiven Meeresschutz, einmal vor unserer eigenen Haustür, das heißt jetzt bei uns in Deutschland konkret Nord und Ostsee. Aber wir unterstützen auch Sea Shepherd Global, die die großen Schiffe betrie, die du anfangs schon angesprochen hast, die jetzt z.B. auf dem Weg in die Antarktis sind, indem wir mit unserer Arbeit natürlich Spenden sammeln und diese Spenden dann auch zu einem großen Teil an global weiterreichen, wo es dann darum geht, diese großen, aufwendigen und teuren Kampagnen auch mit zu finanzieren. Was uns aber von anderen Organisationen unterscheidet ist, dass wir keine typische Kampagnenarbeit im Sinn von Lobbyarbeit machen, dass wir keine Petitionen stemmen oder Demos organisieren, sondern unsere Arbeit bezieht sich wirklich auf das Inter intervenieren und das verändern vor Ort. Und das bezeichnen wir eben als direkte Aktion. Das heißt, alle Kampagnen, die wir durchführen, haben einen direkten Ansatz mit dabei, wo wir versuchen auch direkt eine Veränderung hervorzurufen. Ob das jetzt bedeutet, dass man Vergehen dokumentiert, zur Anzeige bringt, an die Öffentlichkeit bringt oder z.B. auch in Regionen wie in Westafrika direkt einschreitet und illegale Fischerei unterbindet, indem man die Wilderer an die Kette legt.",
      "start": 503866,
      "end": 595906,
      "confidence": 0.9129753,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das bedeutet, das Wort Kampagne ist gleichzusetzen mit Einsatz?",
      "start": 595998,
      "end": 599498,
      "confidence": 0.9869689,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Genau, richtig. Genau. Das nennen wir, das ist historisch so gewachsen. C ist der Begriff für unsere Missionen, Einsätze, je nachdem wie man es definiert.",
      "start": 599594,
      "end": 611162,
      "confidence": 0.9120744,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber seid ihr da dann selbstständig eigentlich als Organisation jetzt die deutsche Organisation oder ist es immer in dem internationalen Kontext eingebettet? Oder ist es, weil ihr ja, wir haben gerade im Vorgespräch gehört, der Andi hat schon Nordsee und Ostsee verwechselt. Also in Deutschland gibt es ja ein Me im Gegensatz zu Österreich. Ich habe aber gerade gesehen, Sea Shepherd austria gibt es auch. Also wie funktioniert denn diese Zusammenarbeit zwischen international und lokaler Organisation?",
      "start": 611306,
      "end": 636934,
      "confidence": 0.8978117,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also wir sind natürlich ein eigenständiger Verein, ein eingetragener Verein und arbeiten auch unabhängig hier in Deutschland. Wir müssen uns da jetzt keine großen Genehmigungen holen, um jetzt hier vor Ort aktiv zu sein. Genauso ist es halt dann so, dass Länder wie Österreich dann einen anderen Schwerpunkt haben. Also die haben natürlich durch die Landlocked Position keine Möglichkeit, direkt Meeresschutzkampagnen selber durchzuführen. Aber die entsenden dann natürlich auch Volunteers auf unsere Schiffe oder auf unsere Kampagnen. So haben wir z.B. auf der Baltic Sea Kampagne auch immer wieder Freiwillige aus Österreich und der Schweiz mit dabei, die natürlich dann auch die Möglichkeit haben, in Italien aktiv zu werden, auf Kampagnen, Griechenland oder eben auf den global schiffen.",
      "start": 637062,
      "end": 679006,
      "confidence": 0.9222592,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und ihr seid genauso auf natürlich anderen Kampagnen unterwegs, nicht nur jetzt in Deutschland.",
      "start": 679038,
      "end": 683350,
      "confidence": 0.9035807,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau, das ist richtig. Das ist auch ein ganz guter, ganz guter Punkt und eine ganz gute Möglichkeit, sich weiterzubilden und als Aktivist und Aktivistin zu wachsen, neue Skills anzueignen, dadurch, dass man eben auch auf andere Kampagnen kommt, da andere Taktiken kennenlernt, andere Arbeitsweisen und sich so auch immer wieder weiterbilden.",
      "start": 683470,
      "end": 705078,
      "confidence": 0.9238867,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt hattest du ja schon gesagt, Deutschland hat die glückliche Lage, dass wir doch am Wasser gelegen sind, zumindest der hohe Norden. Ich jetzt hier im Stahl dreckig.",
      "start": 705174,
      "end": 714062,
      "confidence": 0.9229832,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Du hast den Rhein, Andi.",
      "start": 714126,
      "end": 715454,
      "confidence": 0.786456,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, ich habe den Rhein, das ist richtig. Aber wie gesagt, verschmutzt. Ja, haben wir im Vorgespräch ja auch schon gesagt. Falls ich mich in den Rheinschmeisse, wo lande ich dann? In der Ostsee, in der Nordsee?",
      "start": 715502,
      "end": 726206,
      "confidence": 0.9286384,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich vertausche schon wieder erstmal durch Holland durch und dann in die Nordsee.",
      "start": 726318,
      "end": 731022,
      "confidence": 0.9051715,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber jetzt frage ich mich natürlich, was macht die Ostsee und Nordsee denn so spannend? Das Einsatzgebiet überhaupt für uns? Oder warum sagt man, okay, ich gehe dahin und ich gehe jetzt nicht, weiß ich nicht, ich fokussiere mich nicht auf andere Gewässer?",
      "start": 731166,
      "end": 742810,
      "confidence": 0.8966251,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also bei uns ist natürlich so, die Ostsee ist ein sehr spezielles Meer. Das ist ein sogenanntes Binnenmeer mit relativ wenig Verbindung zur Nordsee. Man kennt das ja, wenn man sich die Karte anguckt oder wenn ihr euch die vorstellt oder vor euch habt, seht ihr ja durch die Bälde und den Sund bei Dänemark. Das sind die einzigen Zuflüsse in die Ostsee und dadurch ist die sehr sehr abgekapselt. Also das Wasser braucht mindestens drei Jahrzehnte, bis es sich in der Ostsee ausgetauscht hat und das sagt halt auch viel darüber aus, wie die Bedro ist, nämlich dadurch, dass wenig Wasser sich durchmischt, akkumulieren sich eben Probleme, ob das jetzt Giftstoffe sind, Plastik oder Überangebot von Nährstoffen, das z.B. auch über die Flüsse und die Landwirtschaft in die Ostsee getragen werden und dadurch sehen wir Probleme, die wir in anderen Regionen haben, deutlich verstärkt in der Ostsee. Dadurch ist die Ostsee leider zu einem der bedrohtesten Meeresgebiete der Welt geworden. Das zeigt natürlich auch die Dringlichkeit, dass sich hier was ändern muss und von daher ist es ein sehr sehr wichtiger, sehr sehr wichtiger Angriffspunkt hier auch akt werden. Wenn man sonst über Meeresschutz redet, über Ausbeutung, dann fallen uns ganz viele Regionen ein, ob das jetzt Afrika ist oder die Ausbeutung durch die chinesische Hochseeflotte und solche Geschichten. Aber wenig Leuten ist wirklich bewusst, dass bei uns vor der eigenen Haustür auch die Probleme enorm sind, dass man sich darum natürlich auch direkt kümmern muss.",
      "start": 742890,
      "end": 827330,
      "confidence": 0.93973064,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt sind wir ein technischer Podcast und das eigentliche Thema ist ja auch die Technik hinter dem Ganzen. Jetzt bist du schon, wenn ich Andis Einleitung zugehört habe, fünf Jahre in dem ganzen Business dabei sozusagen und aktiv. Wie hat sich denn von deiner Warte so das Ganze entwickelt in den letzten 15 Jahren? Wie wichtig ist heutzutage die Technik oder war sie vor 15 Jahren schon? Wie siehst denn du auf diese ganze Entwicklung und wie beeinflusst auch das ganze die Durchführung von Kampagnen oder die Planung? Also wie wichtig ist für euch eigentlich Technik mittlerweile?",
      "start": 827490,
      "end": 861998,
      "confidence": 0.9373898,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also Technik spielt ja immer eine riesige Rolle. Das fängt ja bei unserer Geschichte von vor knapp 50 Jahren an. Sea Shepherd hatte damals natürlich genau wie heute auch nur begrenzte Ressourcen und man musste sich halt das kaufen, was man sich leisten konnte, nämlich meistens irgendwelche alten Schiffe, die man dann z.B. mit der Kraft und dem Wissen und den Skills von Freiwilligen so weit auf Vordermann gebracht hat, um damit Einsätze zu fahren. Damals war natürlich, also gerade in den er Jahren, als es angefangen hat, das Thema Digitalisierung und Technik halt einfach noch nicht vorrangig. Da ging es einfach darum, dass ein alter Dieselmotor irgendwie läuft und vielleicht ein Radarsystem funktioniert. Da haben wir natürlich jetzt durch den technologischen Fortschritt, aber auch eben durch die durch die Erschwinglichkeit von solchen Techniken auch einen ganz anderen Stand. Ich möchte natürlich auch sagen, dass sich Sea Shepherd in den letzten Jahrzehnten auch massiv professionalisiert hat und sich da an die Zeiten und die Veränderung auch mit anpassen musste. Wenn ich mir heute z.B. unser Schiff ansehe, die Triton, das ist ein sehr modernes Schiff. Das haben wir vor drei Jahren gekauft aus Gibraltar. Das war damals Polizeischiff, quasi das Flaggschiff der königlichen Polizei von Gibraltar. Und die haben das abgestoßen, nachdem es eigentlich nur sieben Jahre alt war und wir haben das jetzt in Betrieb genommen und das ist schon ein sehr hoch vernetztes Stück Technik. Also wir haben hier nicht nur nicht nur unsere Generatoren und unsere Motoren mit drin, sondern wir haben eine ziemlich ausgefeilte Navigationstechnik mit drin. Wir haben Scanvorrichtungen wie ein Multibeam Sonar System, mit dem wir den Boden abscannen können und wir haben natürlich auch Server mit an Bord und IT Technik, um unsere Arbeiten überhaupt erledigen zu können.",
      "start": 862094,
      "end": 966610,
      "confidence": 0.9318387,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und das habt ihr dann dementsprechend umgebaut oder so unterwasser Scans? War das schon Polizeiequipment sozusagen davor?",
      "start": 966730,
      "end": 974546,
      "confidence": 0.8686435,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Das war es nicht. Das war genau eine der Investitionen, die wir getätigt haben, weil wir eben für die Arbeit in der Ostsee auch einen sehr großen Schwerpunkt auf das Auffinden von Geisternetzen legen und deswegen wir so einen Scanner brauchten und der wurde dann eingebaut.",
      "start": 974658,
      "end": 990464,
      "confidence": 0.95449346,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Kannst du kurz erklären, was Geisternetze sind?",
      "start": 990512,
      "end": 992768,
      "confidence": 0.9403629,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Geisternetze sind verloren gegangenes Fischerei Equipment, mal ganz grob gesagt. Das geht auf verschiedene Arten verloren, indem es z.B. abreißt und unter Wasser verdriftet, bis es irgendwo hängen bleibt oder Fischer über Wracks und andere Hindernisstellen drüberfahren mit ihren Schleppnetzen, die sich verhaken und die die einfach nicht mehr an die Oberfläche bekommen und dann einfach abschneiden und am Meeresgrund zurücklassen. Das ist ein Riesenproblem für Meeresgebiete, weil sich da nicht nur die Netze als Plastikquelle massiv anlagern, sondern weil Netze unter Wasser ja genau das tun, was Netze tun sollen, nämlich Meerestiere fangen. Und auch wenn da kein Mensch mehr hinten dran hängt und die Netze wieder an die Oberfläche holt und entleert, fangen diese Netze über Jahrzehnte, Jahrhunderte weiter und setzen da quasi so eine tödliche Spirale in Gang, die wir unterbinden wollen. Und deswegen suchen wir quasi gezielt an Hackerpositionen, also potenziellen Hindernissen unter Wasser nach solchen Netzen und bergen die dann eben auch mit dem Tauchteam.",
      "start": 992904,
      "end": 1056346,
      "confidence": 0.9169036,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Was ist eine Hackerposition?",
      "start": 1056458,
      "end": 1058410,
      "confidence": 0.9117625,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Als Hacker bezeichnen eigentlich Fischer sämtliche Unterwasserstellen, wo ihr Netz mal gehakt hat. Die sagen dann nicht haken, sondern die sagen hacken. Und die haben das dann früher in ihren Seekarten selber verzeichnet, wo sie wussten, ja, da unten muss irgendwas sein, da sollte ich vielleicht besser Bogen drum machen, damit meine Netze nicht kaputt gehen, wenn ich die z.B. Über ein Steinfeld oder über ein Wrack ziehe. Heutzutage ist es leider so, dass sehr viele Fische auch immer wieder an diese Hackerpositionen gezielt ranfahren, weil der Meeresuntergrund in der Ostsee eigentlich wüstenähnlich ist. Das ist in großen Bereichen einfach nur flacher, flacher Sand. Und Leben sammelt sich ja da an, wo irgendwelche Objekte im Wasser sind. Ob das jetzt Steine oder Felsen sind oder ein Wrack, ist dem Leben da eigentlich relativ egal. Aber große Wracks sind auch Schutzräume für sehr viele Fische. Und dadurch, dass die Fänge halt in den letzten Jahren massiv zurückgegangen sind, sind die Fische auch immer wieder näher an diese Position mit rangefahren, um da Fische abzufangen. Dabei gingen halt super viele Netze verloren. Also wir reden heute davon, dass im Jahr zwischen fünf und Stück Netzteile in der Ostsee alleine verschwinden jedes Jahr.",
      "start": 1058570,
      "end": 1129172,
      "confidence": 0.9133986,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wie ist es rein rechtlich? Müssten eigentlich die Fischer die Netze mitnehmen oder wieder bergen oder zumindest vermerken, dass es da ein Netz gibt oder sie verloren haben?",
      "start": 1129356,
      "end": 1139840,
      "confidence": 0.88493145,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Logisch wäre es, weil wir haben überall bei uns in unserer Gesellschaft ein Verursacherprinzip. Also wenn ich heute mit dem Auto, keine Ahnung, in die Leitplanke fahre, dann kriege ich danach eine hübsche Rechnung, weil ich einen Schaden angerichtet habe und das bitte begradigen muss. Das ist aber tatsächlich auf dem Meer und gerade bei der Fischerei nicht so. Also die verlieren ihre Netze und damit ist es abgehakt. Die melden es vielleicht der Versicherung, kriegen eine Erstattung, aber die sind nicht verantwortlich zu machen im Moment für den Verlust. Die müssen nicht die Bergekosten bezahlen, die bekommen keine Strafe dafür. Ja, sie kümmern sich dann im Endeffekt auch nicht. Also das heißt, die Netze sind unten und dadurch, dass die Netze selber nicht markiert sind, ist es auch sehr schwer, wenn man die an der Oberfläche hat, die dann einem Fischer zuzuordnen. Das heißt, die verursachen da unten massiven Schaden und fahren dann einfach weiter.",
      "start": 1140860,
      "end": 1188594,
      "confidence": 0.92075354,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und wie findet ihr jetzt wirklich die Netze? Also wie funktioniert so ein Scan und was macht ihr dann?",
      "start": 1188682,
      "end": 1194258,
      "confidence": 0.9599879,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also ein Sonarsystem ist im Endeffekt eine Scanvorrichtung, die akustisch funktioniert. Das Wasser ist ja ein optimales Trägermedium für Schall. Das sendet quasi Schallimpulse aus, die am Meeresgrund reflektiert werden, zurückkommen und über einen Algorithmus dann über die Laufzeit in Distanzen umgerechnet werden. Und dadurch baut man sich quasi ein d Bild zusammen von dem, was unterm Schiff ist. Und da sich das Schiff durchs Wasser bewegt und wir kontinuierlich messen, bauen wir quasi ähnlich wie ein CT oder MRT Schnittbilder auf, die wir dann zu einem d Bild zusammenfügen können. Und dann sehen wir z.B. dass da unten ein Wrack ist oder wir sehen z.B. dass da unten eine Struktur ist und können dann je nach Qualität und je nach Wind und Welle und Tiefe dann teilweise auch sehen, ob ob da Netze im Wasser oder in der Wassersäule hängen. Und danach entscheiden wir dann, ob wir da vor Ort tauchen gehen oder ob wir da einen Unterwasserroboter erstmal runterschicken, um das auszukundschaften. Und wenn wir da was finden, dann wird natürlich geborgen.",
      "start": 1194394,
      "end": 1262680,
      "confidence": 0.9273351,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wie dick ist denn so ein Netz denn? Also ein Netz hat ja Leinen und dann Löcher dazwischen. Also es ist ja nicht so, als liegt da unten etwas. Keine Ahnung. Ein Schiff erkennt man ja anders. Das reflektiert ja die Radar oder so nah, wie nennt man das, Signale anders als so ein Netz. Die würden ja teilweise sogar da durchgehen, weil sind ja auch kleine Löcher drin. Also welchen Detailgrad hat denn diese Analyse?",
      "start": 1262760,
      "end": 1286002,
      "confidence": 0.9689259,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das kommt wirklich darauf an. Also so ein Netz ist ja nicht nur immer nur das Netzmaterial, sondern man hat ja da große Taue auch mal mit dran, man hat die Grundleinen mit dran oder Scherbretter, die reflektieren. Und vor allem diese Netze haben auch Schwimmer mit drin, weil wenn man die über Meeresboden zieht, dann müssen die in alle Raumrichtungen offen gehalten werden. Heißt eine schwere Kette mit Rollen dran hält es am Boden. Die Scherbretter, falls vorhanden, ziehen das Netz zur Seite auf und Schwimmer an der Oberseite ziehen das Netz nach oben, um damit die Öffnung zu haben. Und wenn so ein Netz hängen bleibt, was ganz oft passiert ist, die Schwimmer ziehen das Netz dann weiterhin im Wasser nach oben und man sieht dann z.b. eine Wrackstruktur. Und auf dem Scan sieht man dann z.b. so eine Art, ja, so eine Art Turm oder so eine Art Erhebung, die eigentlich zu rund ist für das, was das Wrack bieten kann. Und das ist dann, ist dann schon ein starker Hinweis. Aber in den allermeisten Fällen wissen wir dann erstmal, aha, da unten ist was, das ist vielleicht ein Wrack oder wir erkennen sogar einen Wrack und können dann quasi anhand von dem Scan eine optimale Abwurfposition für unsere Shotline festlegen. Das ist quasi ein Abstiegs Seil mit einer Boje dran für die Taucherinnen und Taucher, damit die genau an der Stelle tauchen, wo natürlich auch das Wrack oder das vermutete Netz ist. So können wir quasi gezielt die Position finden, wo wir Netze vermuten.",
      "start": 1286066,
      "end": 1369018,
      "confidence": 0.9366838,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Es ist aber rein manueller Prozess, also schaut man da auf den Monitor und probiert es dann zu interpretieren? Oder gibt es da irgendwelche Algorithmen, die da schon irgendwie Bilderkennung machen oder das irgendwie automatischer matchen?",
      "start": 1369114,
      "end": 1381786,
      "confidence": 0.8519719,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also im Moment ist es so, das ist ein rein manueller Prozess. Also wir haben auf der Brücke einen Monitor, da sitze ich dann, während der Schiffsführer das Schiff über die Position schickt, die wir uns vorher rausgesucht haben. Notfalls sucht man dann in einem Suchmuster aussenrum so lange, bis man einen Ausschlag hat und dann scannen wir das so lange ab, bis wir ein sehr scharfes Bild haben und das Ganze dann einigermaßen interpretieren können.",
      "start": 1381898,
      "end": 1404198,
      "confidence": 0.9421705,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber woher bekommt ihr die ursprüngliche Position? Weil du gesagt hast, ihr habt da schon eine Position, die ihr dann versucht abzubilden oder zu scannen?",
      "start": 1404254,
      "end": 1412038,
      "confidence": 0.9157732,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also es gibt Datenbanken, z.B. das Bundesamt für Seeschifffahrt und Hydrographie führt eine Wrack Liste oder eine Hindernisliste unter Wasser. Die haben wir mal zugesteckt bekommen, ist eine Liste mit sehr vielen GPS Positionen oder Koordinaten und die sollen dann z.B. die Stelle sein, wo ein Schiff gesunken ist oder wo eine Schützstelle ist oder wo vielleicht z.B. auch nach den Weltkriegen Munition verklappt wurde. Diese Liste habe ich digitalisiert und danach die Koordinaten exportiert und in Seekarte importiert. Da muss man ein bisschen Tricks, weil die Formate ja immer wieder unterschiedlich sind. Das heißt, man muss einen Unterschied wahrscheinlich über drei oder vier Konverter gehen, bis man das in der digitalen Seekarte hat. Und dann haben wir quasi eine Arbeitsliste, anhand von der sehen wir dann z.B. wo überall Verdachtspositionen sind und die suchen wir dann systematisch ab.",
      "start": 1412134,
      "end": 1466764,
      "confidence": 0.93770236,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ihr habt nur den Verdacht, dass bei diesen Hack Positionen höchstwahrscheinlich auch Netze liegen könnten. Also ihr wisst jetzt nicht konkret, das ist kein Verdacht auf ein Netz, sondern nur weil da ein Wrack oder sonst irgendwie eine Hackfleisch.",
      "start": 1466852,
      "end": 1478660,
      "confidence": 0.892811,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau, also im Endeffekt ist jede Hackerposition für uns eine Verdachtsposition, weil es kann ja überall ein Netz dranhängen und wir finden wirklich in sehr vielen Fällen sind da Netze mit dran oder waren Netze mit dran.",
      "start": 1478850,
      "end": 1492992,
      "confidence": 0.9499987,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Was ich hier gerade super schön finde, ist, der Wolfgang lernt während des Podcasts neues Vokabular und nutzt das wieder. Das finde ich gerade so schön.",
      "start": 1493056,
      "end": 1503200,
      "confidence": 0.9000119,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ich habe es eh falsch gesagt, das ist ja Hacker, nicht Hack Position. Es die tiroler aussprache Hack.",
      "start": 1503280,
      "end": 1510202,
      "confidence": 0.7404179,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Während ihr sprecht, google ich auch Scherbretter und gehe dann auf die Google Bilder Suche, um einfach zu gucken, okay, was ist das? Wovon spricht der hier?",
      "start": 1510346,
      "end": 1518570,
      "confidence": 0.8645033,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das wäre auch schon eine Frage von mir gewesen, als Andi. Jetzt kannst du es erklären.",
      "start": 1518690,
      "end": 1522830,
      "confidence": 0.89665186,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, also Scherbretter, wenn ich das so sehe, du hast ein Netz und das Netz hat eigentlich so, ich sag mal, zwei Hauptleinen und die Scherbretter hängen oben an diesen zwei hauptsächlich Hauptleinen, sollen anscheinend so eine Art Führung irgendwie geben, damit die Hauptleinen nicht sich überkreuzen und so weiter. So verstehe ich das irgendwie.",
      "start": 1523170,
      "end": 1542142,
      "confidence": 0.9173302,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Das sind wie Flügel unter Wasser. Ja, genau. Die werden angeströmt und dadurch ziehen die in eine Richtung und zwar nach außen und ziehen das Netz in der horizontalen quasi auf. Das ist die Aufgabe von diesen Scherbrettern. Und klar, wenn so ein Netz absinkt oder an einem Wrack hängen bleibt, bleibt, dann bleiben oft diese Scherbretter, also bleiben diese Scherbretter entweder auch mit unten oder wenn die Wassertiefe nicht so groß ist, dann holen die die auch gerne noch mal mit rauf und schneiden halt dann dahinter das Netz ab.",
      "start": 1542286,
      "end": 1572238,
      "confidence": 0.9286656,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt darf ich als Deutscher natürlich auch Spaß und Fun über Deutschland machen. Du hast gesagt, du hast die Liste zugespielt bekommen und dann hast du die Liste digitalisiert. Doofe Frage, hast du da ein Blatt Papier oder einen Brief bekommen oder oder, oder? Und hast dann, da sind dann Adressen drin oder ich meine, ist die Digitalisierung wirklich, du bist in Zeile 25 und hast du das in eine excel Liste gepackt? Oder wie darf man sich das vorstellen?",
      "start": 1572294,
      "end": 1596200,
      "confidence": 0.9175506,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also anfangs schon tatsächlich. Also wir machen jetzt das fünfte Jahr. Im ersten Jahr hat uns jemand eine ausgedruckte Liste vorgelegt und das sind unsere Hackerpositionen. Die waren dann auch immer schon, wo sie selber schon waren, durchgestrichen. Die habe ich abfotografiert und habe sie danach durch ein Texterkennungsprogramm gejagt und daraus dann ein CSV gemacht und das CSV dann in eine, weiß ich nicht, KMZ Datei exportiert und diese dann in eine GP Datei, die man dann in Seekarten importieren kann, mal blöd gesagt. Wir haben aber dann auch zwischenzeitlich einen aktuellen Auszug in digitaler Form bekommen. Da musste ich dann nicht manuell sämtliche Koordinaten ausbessern, weil das irgendwelche Texterkennungsprobleme mit sich gebracht hat. Also von daher sind wir da schon ein gutes Stück weiter. Aber wäre das ein komplett manueller Prozess, wäre ich heute wahrscheinlich noch nicht fertig, weil in Nord und Ostsee, ich glaube insgesamt, ich müsste meine Liste gucken, sind das über 6000 Positionen.",
      "start": 1596280,
      "end": 1654862,
      "confidence": 0.9283615,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt sprechen wir schon die ganze Zeit über Geisternetze und du hast vorhin die Baltic Sea Campaign angesprochen. Ist das genau das? Das bedeutet, ihr sagt, okay, wir fahren jetzt ein halbes Jahr raus und unsere Aufgabe ist es, so viele Geisternetze wie möglich in der Ostsee zu fangen oder zu fangen, haha, Geister, okay. Zu sammeln in der Hinsicht. Also war das euer Ziel oder ist das eure generelle Hauptaufgabe von der Suborganisation Sea Shepherd Deutschland?",
      "start": 1654926,
      "end": 1681984,
      "confidence": 0.942783,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, also die Baltic sea kampagne machen wir jetzt seit fünf Jahren. Das Hauptziel dieser Kampagne ist das Auffinden von Geisternetzen. Es kommt eben daher, weil wir eben geguckt haben oder wie wir halt z.B. an solche Kampagnenplanungen mit rangehen, ist, wir gucken uns ein Meeresgebiet an und gucken halt erstmal, was die Wissenschaft sagt, was sind denn die Bedrohungslagen vornehmlich für die für diese Gebiete und versuchen dann für die einzelnen Bedrohungsszenarien zu gucken, welche können wir denn mit der Arbeit oder der Art zu arbeiten, wie wir es machen, nämlich mit direkter Aktion, mit beeinflussen. Und da kamen wir dann eben auch darauf, dass natürlich die Ostsee massiv überfischt ist, die Fischerei ein Riesenproblem darstellt für immer kleiner werdende Fischpopulation. Und dann ist es auch relativ irrelevant, ob das jetzt kleinere Küstenfischerei ist oder größere Fischerei mit Schleppnetzkuttern oder mit Trawlern. Und haben natürlich auch gesehen, dass unter der Fischerei auch massiv Meeressäugetiere leiden, also Seehunde, Robben und Schweinswale und sind da natürlich auf diese Beifang Thematik gestoßen. Und diese Tiere verheddern sich natürlich nicht nur in Netzen, die gerade aktuell in Gebrauch sind, sondern die jagen natürlich auch unter Wasser an Wracks, weil da Fische sind. Und wenn da Fische in diesen Netzen festhängen, dann lockt das natürlich auch Raubtiere an und die können sich dann natürlich wiederum in diesen Netzen verhängen und dann da qualvoll, qualvoll sterben. Und da haben wir gesagt, okay, wir wollen die Ostsee, soweit es uns möglich ist, Geisternetz frei zu machen, um sicherzustellen, dass die Tiere, die sich quasi da in diesem Habitat aufhalten, die da jagen, dass die nicht die Gefahr laufen, unter Wasser sich zu verheddern und da da zu sterben. So kam das zustande und deswegen ist es heute noch ein sehr wichtiger Bestandteil unserer Arbeit und deswegen haben wir da auch sehr groß investiert in den letzten Jahren.",
      "start": 1682032,
      "end": 1795270,
      "confidence": 0.93229026,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wenn ihr das jetzt schon seit fünf Jahren macht, ich meine, ich habe gerade mal nachgeguckt, wie groß die Ostsee eigentlich ist. Die Ostsee ist mit dem Kattegat, das Kattegat, muss ich gerade auch erst googeln, was das ist. Der Kattegat ist der obere Teil der Ostsee, wo es vor bzw. Nach der Verengung, je nachdem welche Perspektiven man sieht zwischen Dänemark und Schweden. Also ich sag mal so die Ausfahrt oder Einfahrt der Ostsee. Und die ganze Thematik ist Quadratkilometer groß. Also da kann man jetzt mal eben nicht kurz mit dem Fernglas rüber gucken. Und wenn ihr da jetzt schon seit fünf Jahren, ich sag mal, rumfahrt, ihr habt eine Initialliste an Hacker Punkten gehabt. Welche Daten speichert bzw. Erfasst ihr denn jetzt seit diesen fünf Jahren? Wie verwaltet ihr diese Vielzahl an Daten und was dokumentiert ihr denn da? Bild, Ton, Video? Weil du hast gerade gesagt, ihr taucht ab und zu und ihr habt anscheinend auch einen Roboter darin. Also wie stellt ihr sicher, dass wir nicht zweimal über denselben Punkt fahrt?",
      "start": 1795350,
      "end": 1859436,
      "confidence": 0.90193295,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wir führen da mehrere Listen, also das machen wir zum Glück sauber und digital. Und ein Tool dafür ist es wieder mal Excel. Wir haben natürlich eine umfassende excel Liste von diesen ganzen Hacker Positionen und die sind natürlich alle Benams. Die haben Code Nr. Dahinter, die schnell findbar und auffindbar ist. Das heißt, die bezieht sich immer auf die Region, wo wir sind und dann ist die fortlaufend durchnummeriert. Z.B. keine Ahnung, die kieler Bucht ist mit K nummeriert und dann ist halt das die Nr. K ist z.B. dieses Wrack, das im zweiten Weltkrieg gesunken ist. Und da gehen wir dann hin, gehen wir tauchen und wenn wir da ein Netz gefunden haben, dokumentieren wir natürlich auch in der Zeile ganz einfach mit, an der Stelle haben wir das und das vorgefunden. Es war vielleicht ein metallernes Wrack, ungefähr die und die Ausmaße, die besonderen Vorkommnisse, diese Todfunde und so und so viel Netz haben wir da geborgen. Und das Ganze dokumentieren wir natürlich auch gewichtsmäßig mit. Das heißt, jedes Mal, wenn wir wieder im Hafen sind, werden die einzelnen Fänge, so wie du vielleicht vorhin gesagt hast, von Geisternetzen in Big Packs gewogen, damit wir wissen, wo wir welche Menge an Netzen runtergeholt haben und das auch für uns in der Dokumentation mit ersichtlich ist. Dann haben wir natürlich jedes Mal auch ein Mediateam mit an Bord. Das ist eine Fotografin und ein Videograf, die die Einsätze eben mit dokumentieren. Dann kann man quasi auch immer anhand der Liste und dem Datum und den Uhrzeiten auch in unserer Media Datenbank nachgucken, was denn an dem Tag passiert ist und findet da natürlich auch die Bilder und die Videos zu den einzelnen Einsätzen.",
      "start": 1859548,
      "end": 1959030,
      "confidence": 0.92763585,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber leben diese Daten dann nur in deinem Excel oder sind es auch irgendwelche Public data, die man einsehen kann? Also verwendet ihr da auch irgendwie die Community vielleicht auch als Input, wo es neue Wracks gibt, keine Ahnung, es gibt ja wahrscheinlich auch viele, könnte man vorstellen, Hobbytaucher oder so, die Interesse an so Wracks haben und versuchen da Sachen aufzuspüren und finden. Also gibt es da irgendwie eine Community, die verwendet wird?",
      "start": 1959110,
      "end": 1984434,
      "confidence": 0.89567256,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, die gibt es mit Sicherheit und die Daten werden wahrscheinlich für einige von den Leuten auch sehr interessant. Aber es ist natürlich so, dass nicht jedes Wrack verzeichnet ist und vor allem nicht bei jedem Wrack dabei steht, was es denn früher war. Das hat auch archäologische Gründe. Also einige von den Wracks sind Unterwasserdenkmäler und man will natürlich verhindern, dass da unglaublich viele Hobbytaucherinnen und taucher hingehen und dann eventuell auch diese Wracks mit beschädigen oder die einfach geplündert werden. Von daher werden wir jetzt die speziellen Daten nicht nach außen geben. Was wir allerdings machen ist, wir veröffentlichen zumindest innerhalb der Community von Organisationen, die selber sich auch um Unterwasser Bergungen kümmern, also auch Geisternetze bergen, Positionen, an denen wir waren und sicherstellen oder sicher sagen können, da ist kein Netz oder da ist kein Netz mehr, um eben zu sagen, hier muss niemand mehr hinfahren und dann sich unnötig doppelte Arbeit machen. Das machen wir natürlich schon und wir dokumentieren auch in einer Sea Shepherd internen App, die die ganzen Fundstellen und so weiter wieder damit auch global zu sehen ist, welche Kampagnen haben denn welchen Impact, was ist da geleistet worden, wie viele wie viele Tiere wurden z.B. befreit, welche Funde hatten wir da, wie viele Netze kamen raus? Und die App wird auf jeden Fall auch zum Logging in unserer internen Welt mitbenutzt.",
      "start": 1984602,
      "end": 2072242,
      "confidence": 0.93436885,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und die ganzen Sonardaten, werden die eigentlich aufgezeichnet? Also ich könnte mir vorstellen, dass das eigentlich auch sehr wertvoll ist, vielleicht auch jetzt noch nicht, aber könnte ja dann auch in Zukunft, wenn es keine Ahnung, irgendwelche Algorithmen gibt, die dann irgendwas automatisch erkennen oder so. Also ihr kartografiert ja da im Prinzip den Meeresgrund, wenn ich das richtig verstanden habe.",
      "start": 2072306,
      "end": 2091852,
      "confidence": 0.9065213,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Absolut richtig. Das ist tatsächlich gerade ein Projekt am Laufen am Geomar Institut in Kiel, die sich gerade damit beschäftigen. Und zwar arbeiten die mit einem Softwareunternehmen zusammen, die einen Algorithmus entwickeln, um Geisternetze automatisiert anhand von Scandaten erkennen zu können. Und dafür heben wir natürlich diese Daten mit auf. Also wir sind dann auch auch quasi Datenspender. Wir geben dem Geomar unsere Daten mit weiter und versuchen dann natürlich auch mit unserer Expertise ein bisschen weiterzuhelfen, auszuhelfen, weil wir ja beide Sichtweisen kennen. Also wir sehen, was wir auf dem Sonar sehen und wir wissen, wie es dann unter Wasser wirklich ausgesehen hat, weil wir da direkt beim Tauchen waren und das dementsprechend auch mit dokumentiert haben. Und die Hoffnung ist, dass man in Zukunft diese Daten auch automatisiert auswerten kann kann, weil nicht alle Netze hängen nämlich an Wracks. Ganz viele von diesen, gerade diesen Stellnetzen, die mit Bojen an der Oberfläche markiert sind und die der Fischer in der Regel alle 24 Stunden rein und wieder rausholt, auch die reißen gerne mal ab und treiben dann am Meeresgrund umher und die sind deutlich schwerer aufzufinden. Und da will man natürlich mit solchen Algorithmen deutlich effizienter werden, weil man eben diese großen Gebiete nicht mit Tauchern absuchen kann und diese Stellnetze auch deutlich dünner und dünnmaschiger sind, weil die aus so angelschnurartigem Material bestehen und damit deutlich schwerer zu finden sind.",
      "start": 2092026,
      "end": 2180826,
      "confidence": 0.92560107,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt hast du schon erwähnt, ihr tauscht da viele Daten aus mit anderen Organisationen. Gibt es da irgendwelche Standards oder schickst du da einfach auf gut deutsch die excel Liste herum?",
      "start": 2180898,
      "end": 2190714,
      "confidence": 0.9326513,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ne, Standards gibt es da nicht. Es gibt eine andere Organisation, die betreibt ein GIS System, also ein Geoinformationssystem, wo sie die Daten mit Lager, aber der Zugriff darauf ist natürlich auch nicht öffentlich. Und Daten an andere Organisationen zu spenden und dann aber keinen Einblick zu haben, ist halt auch ein bisschen schwierig. Deswegen habe ich das ganz einfach gemacht. Ich habe alle Positionen, die von uns quasi schon untersucht wurden, in eine Google Map reingehauen und den mit den entsprechenden Leuten geteilt. Und da können die natürlich jetzt auch sehen, wo wir schon waren und haben natürlich selber auch die Möglichkeit, da ihre eigenen Daten mit einzutragen, weil das ja für uns auch interessant ist. Also wir wollen ja auch nicht unnötigerweise in Gebiete fahren, die schon quasi von Geisternetzen befreit wurden.",
      "start": 2190762,
      "end": 2234090,
      "confidence": 0.9454367,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wie läuft es praktisch? Ist es einfach, du gibst es manuell ein in der Google Map oder ist es irgendwie automatisiert?",
      "start": 2234170,
      "end": 2241578,
      "confidence": 0.8265476,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich exportiere einfach die Positionsdaten und importiere sie dann als eine Ebene in Google Maps.",
      "start": 2241754,
      "end": 2247706,
      "confidence": 0.9404347,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also man kann Ebenen in Google Maps importieren. Eigene Layer machen?",
      "start": 2247818,
      "end": 2251034,
      "confidence": 0.97978365,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau, richtig. Also ich kann ein neues Layer machen oder eine Ebene und kann dann da CSV oder Excel Daten mit importieren. Und damit kann ich quasi jedes mal meine Liste updaten. Vermutlich geht das auch automatisch irgendwie. Also man kann sich mit Sicherheit irgendwelche Skripte basteln, aber dafür hat mir erstens bislang die Zeit gefehlt und das war jetzt auch noch kein Projekt, was ich angehen konnte. Aber das wäre auf jeden Fall mal was Spannendes.",
      "start": 2251082,
      "end": 2276640,
      "confidence": 0.9039995,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Was sind denn allgemein die technischen großen Herausforderungen, die ihr eigentlich habt, wenn wir gerade dabei sind? Also was würde euch weiterhelfen?",
      "start": 2276720,
      "end": 2284056,
      "confidence": 0.94067407,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Naja, ich glaube man weiß erst, wenn man was für einen großen Nutzen Tool hat, wenn man es dann mal hatte und dann vergleicht mit der Zeit, in der man es nicht hatte. Allerdings versuchen wir natürlich selber auch uns da irgendwie auf dem Laufenden zu halten. Aber ich denke mal, große, große Baustellen sind ja eigentlich immer so Sachen wie Cyber Security. Das ist ja nichts, was man jetzt einmal aufs setzt und sagt, jetzt haben wir Cyber Security und damit ist es erledigt und in 10 Jahren machen wir neue Cyber Security, sondern das ist halt ein fortlaufender Prozess und gerade auch in der heutigen Zeit, in der auch NGOs glaube ich immer mehr unter Druck geraten, ob das jetzt durch Hacking Angriffe sind oder z.b. auch durch staatliche Eingriffe oder Eingriffe von nichtstaatlichen Organisationen, ist es halt wichtig, dass man sich da auch immer weiter aktuell hält, um sowas eben zu unterbinden oder zumindest so schwer wie möglich zu machen. Ich meine, wir haben natürlich auch immer mit sensiblen Daten zu tun, ob das jetzt Personendaten, Crew Daten sind, ob das Bilder und Videos sind, bis hin zu Beweismitteln, die wir z.B. in Gerichtsfällen verwenden und verwenden müssen. Die müssen natürlich auch ausreichend geschützt sein und ja, da ist glaube ich egal an welchem Punkt man ist, immer Luft nach oben.",
      "start": 2284168,
      "end": 2362718,
      "confidence": 0.93144315,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Jetzt hast du Cyber Security erwähnt, um eure Daten zu schützen. Wie sieht es denn in die andere Richtung aus? Also keine Ahnung, wie weit du da natürlich was sagen darfst, aber vielleicht machen das ja auch andere Leute, einfach externe, die euch dann die Informationen weitergeben. Aber wie weit seid ihr da auch irgendwie involviert in die, man kann es auch Open Source Intelligence nennen, aber auch die Intelligenz, um irgendwo Daten von vielleicht halb illegal oder im Graubereich zumindest zu organisieren, auch wenn es um illegale Fischerei z.B. geht oder um Beweismittel in irgendeiner Form zu bekommen auf digitalem Wege.",
      "start": 2362814,
      "end": 2396716,
      "confidence": 0.90655434,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also wenn wir selber Daten beschaffen, dann sind die natürlich immer legal. Nicht dass da jemand irgendwas anderes denkt, aber natürlich Open Source Intelligence spielt schon eine sehr, sehr große Rolle, weil gerade auch in diesen Undercover Aktionen oder oder wenn es darum geht, Informationen über Fischereiunternehmen oder ihre Arbeitsweisen zu besorgen, sind heutzutage super viele Informationen im Internet aufrufbar. Man muss sie nur richtig interpretieren und finden, dann nutzen wir schon auch die Möglichkeiten, die wir haben. Z.B. eine wichtige Datenquelle, die wir da nutzen, ist z.B. global Phishing Watch. Das ist eine Organisation, die sich zur Aufgabe gemacht hat, die Fischerei mittels Machine learning und künstlicher Intelligenz zu überwachen, indem sie Satellitenbilder und AIS Daten und Radardaten nimmt, die übereinander legt und im Endeffekt auch somit eine lückenlose Überwachung der Fischerei global sicherstellen kann. Und allein an den Bewegungsmustern kann man natürlich schon sehr, sehr viel rauslesen. Also ich kann z.B. sehen, ob ein Fischer immer seine automatische Schiffserkennung, also das AIS oder VMS System an hat oder ob er es auf See einfach mal ausschaltet oder ob er sich anhand seines Bewegungsmusters irgendwie einem Schutzgebiet nähert, wo er so nicht rein darf und danach erstmal kurz davor sein Tracking ausmacht und auf dem Heimweg wieder anmacht.",
      "start": 2396828,
      "end": 2483002,
      "confidence": 0.92596066,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da stellt sich ja für mich immer die Frage, die Fischer dürfen das ja wahrscheinlich nicht ausmachen offiziell, oder?",
      "start": 2483066,
      "end": 2488074,
      "confidence": 0.9108158,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Genau, richtig.",
      "start": 2488162,
      "end": 2489018,
      "confidence": 0.805505,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Da gibt es keine offiziellen Stellen, die das irgendwie überprüfen, oder? Weil das wäre ja relativ einfach alles. Also von technischer Sicht mal zu checken, wenn mitten auf See das für eine halbe H aus ist, dann muss ja was falsch sein, oder?",
      "start": 2489114,
      "end": 2502456,
      "confidence": 0.9181923,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, das ist halt die Frage, wie stringent da kontrolliert wird. Also eigentlich müsste man es durchgehend beobachten, glaube ich, um das zu sehen. Und im Notfall kann man sagen, gut, ich hatte einen Stromausfall oder das Gerät spinnt, ich weiß es nicht, muss zum Service. Ich glaube die Ausflüchte sind da oft sehr groß und meine Erfahrung ist zumindest, dass es, wenn es um die Überwachung der Fischerei geht, auch oftmals nicht allzu genau hingeguckt wird. Also ich habe Aussagen von Fischereiaufsichtsbeamten, die gesagt haben, also mir gegenüber sogar gesagt haben, sie müssten ihre Fischer gar nicht kontrollieren, weil die kennen sie ja alle. Und dementsprechend ist halt das immer die was will man verfolgen? Wem will man auf die Finger schauen? Wem? Und bei wem drückt man die Augen zu und guckt einfach weg? Also wir haben das z.B. selber beobachtet vor zwei Jahren, da waren wir auf einem undercover Einsatz in Polen und wussten, dass es in dem Jahr neue EU Regulierung gibt, die verbietet Stellennetze in den Wintermonaten auszubringen zum Schutz von Schweinswalen. Und wir wussten aber, dass diese dass diese Fischer immer wieder rausfahren. Wir haben das anhand von Webcams z.B. gesehen, die im Hafen aufgestellt waren oder bei der Gemeinde, dass die dass die Fischer immer wieder rausgefahren sind und nach ein paar Stunden wieder reinkamen und wir uns gedacht haben, was macht er da draußen? Der darf ja eigentlich nicht fischen, also warum fährt er trotzdem raus und fährt anderthalb Tage später noch mal raus und kommt sofort wieder rein? Das ist so die, das war so die Frage. Und deswegen haben wir uns mit dem Boot dahin gelegt, haben uns undercover selber einen Eindruck davon verschafft und haben dann tatsächlich auch beobachtet, wie ein polnischer Trawler auf einmal ein Kurs abgedreht hat mit dem Netz draußen und ist eine schöne Schleife durch den Nationalpark gefahren und danach wieder raus. Und solche Sachen passieren natürlich ständig. Man muss sie halt beobachten und man muss sie dann halt dementsprechend verfolgen. Aber wir haben den Vorfall natürlich gemeldet, haben da auch Anzeige erstattet, aber bis heute noch nicht viel davon gehört. Das heißt, die Frage ist, ob sie das wirklich verfolgen wollen oder nicht. Hängt natürlich ganz stark auch von den Behörden ab.",
      "start": 2502528,
      "end": 2632114,
      "confidence": 0.9252147,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ein Trawler ist ein ein Trawler ist.",
      "start": 2632202,
      "end": 2634402,
      "confidence": 0.8919186,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ein Schleppnetzfischer, also ein Fischer, der das Fangnetz aktiv hinter dem Boot herschleppt.",
      "start": 2634426,
      "end": 2641506,
      "confidence": 0.9357585,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich finde das, wenn ich euch beiden zugehört habe, finde ich das super amüsant, weil ich frage mich nämlich, warum sollte es bei euch Sea Shepherd anders sein, wie in jeder normalen Firma? Ihr schickt Excel Listen rum und allem drum und dran und nutzt einfach Google Maps, wo ihr einfach mal so Marker hinsetzt. Finde ich, finde ich sehr schön und besonders, wenn man dann auch mit anderen Behörden und Organisationen arbeitet. Also es scheint wirklich so zu sein. Achtung, das ist jetzt nicht wörtlich gemeint und auch kein Wortwitz, aber alle kochen nur mit Wasser.",
      "start": 2641618,
      "end": 2669440,
      "confidence": 0.94311816,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Aber nun gut, ist halt auch ein pragmatischer Ansatz, würde ich sagen. Also muss man starten.",
      "start": 2669780,
      "end": 2675580,
      "confidence": 0.9053375,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja und wir sind ja auch schon sehr, sehr weit damit. Also wenn ich mir z.B. anschaue, wie die Kommunikation mit Behörden funktioniert, da heißt es ja schön, dass ihr Beweisvideos und Fotos habt, aber könnt ihr die bitte auf den USB Stick packen und uns per Post schicken? Weil wir können nichts runterladen. Das heißt, selbst wenn wir die ganzen Sachen z.B. schön sauber auf einer gesicherten Cloud liegen haben und Share Link erstellen für Behörden, wir sagen, hier sind die Beweismittel, sagen ne, das geht nicht. Könnt ihr uns die Fotos ausdrucken und den Rest bitte per Device auf den USB Stick schicken. Also von daher sind wir natürlich mit Excel und solchen Geschichten schon sehr, sehr weit.",
      "start": 2675740,
      "end": 2714384,
      "confidence": 0.92758185,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also wenn ich jetzt aus deiner Perspektive, stimme ich dir bestimmt zu, ihr seid sehr, sehr weit aus der Perspektive von sogenannten Tec Natives. Hört sich so an, ja, ihr seid mitten in der Digitalisierung. Das Projekt ist 20 % fortgeschritten und deswegen klar, hier clashen gerade Welten aufeinander. Alles super. Eine Frage zu diesem Schiffstracking. Du sagtest okay, da gibt es dann irgendwelche Sender auf den Schiffen und die Leute können das dann ausmachen. Und meine Frage sind die Daten irgendwie öffentlich zugänglich bzw. In so einer offenen Datenbank? Denn wir haben ja vor gar nicht allzu langer Zeit mitgekriegt, dass es Leute gibt, die sogar den Privatjet von Elon Musk tracken können auf Twitter. Oder hast du vielleicht schon mal gesehen, wenn irgendwo der Super Bowl ist oder das Burning man, wie die ganzen Privatjets dann irgendwie aus Amerika so wegfliegen. Hast du vielleicht schon mal gesehen. Und wenn die Leute sowas tracken können, dann frage ich mich, Moment mal, sind Schiffe nicht genau das gleiche? Oder man hat ja damals, als im Suezkanal dieser eine Frachter sich gedreht hat, hat man ja auch auf Karten gesehen, wie viel da vor dem Suezkanal stehen und warten und wie viel dann irgendwie die den großen Umweg gefahren sind nach Rotterdam, glaube ich, oder ähnliches. Da frage ich mich, hä, kann man das nicht alles tracken? Und wenn da irgendwo ein Gap ist, dann ist es doch das einfachste, ein kleines Skript zu loop mal über alle Schiffe und sag mir, wo ein Schiff nicht im Hafen steht und wo kein Signal war, oder?",
      "start": 2714552,
      "end": 2808514,
      "confidence": 0.9304473,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ja, sowas gibt es. Das nennt sich AIS, also automatisches Identifikationssystem oder Automatic Identification System. Das ist mittlerweile was, was die allermeisten schiffe haben. Also das ist für kommerzielle schiffe und für schiffe ab einer bestimmten größe vorgeschrieben. Das haben die meisten privat yachten, boote, segelboote schon mit an bord. Das ist eigentlich gedacht zur kollisionsverhütung. Also das ist ein System, das funktioniert digital, analog oder umgekehrt. Denn das Ding liest quasi aus deinen Schiffsdaten die wichtigsten Sachen aus. Also wie z.B. welchen Kurs fährst du? Welche Geschwindigkeit, an welcher Position bist du? Das sind so dynamische Schiffsdaten, aber auch dann statische Daten, wie z.B. wie heißt dein Schiff? Was für eine Kennung hat es? Wie groß ist es? Was für einen Tiefgang hat es? Und die ganzen Daten werden gesammelt über VHF, also über Funk verbreitet. Das ist quasi eine spezielle Funkfrequenz, die dafür freigehalten wird. Und andere Empfänger fangen diese Funksprüche quasi wieder auf. Die werden dann wieder digitalisiert und dann kannst du die z.B. auf einer Seekarte sehen. Das heißt, du siehst dann, wenn du dir die Seekarte anguckst, ein kleines rotes Dreieck und das zeigt dir dann an, wenn du drauf klickst, das ist das Schiff mit dem Namen, das ist der Kurs, den es fährt, das ist die Geschwindigkeit, die es fährt. Und das System berechnet dann quasi anhand deiner eigenen Bewegungsmuster und der aktuellen Bewegung von dem Schiff Schiff, ob man sich, also wie nah man an sich vorbeifährt. Z.B. nennt sich das dann closest point of approach. Da sagt er dann, die Schiffe kommen sich auf 500 m nahe und dann schneiden sich die Wege und dann entfernt man sich wieder voneinander. Und wenn das Ganze, diese Zahl vom CPA null ist, also quasi man denselben Ort zur gleichen Zeit beanspruchen würde wie das andere Schiff, dann bekommt man eine Kollisionswarnung und wird angehalten, irgendwas an seinem Kurs gerade zu ändern oder an seiner Geschwindigkeit, damit das eben nicht passiert. Und das System ist weltweit im Einsatz. Die Sache ist nur, dass ganz viele Fischerboote davon befreit sind unter einer bestimmten Größe. Und gerade diese kleineren Kutter sind immer so, die sind, wenn die, wenn das ab 12 Metern vorgeschrieben ist, 12 m Länge, dann sind die halt 11,99 lang und sind dann nicht mehr, sind dann nicht mehr ausrüstungspflichtig. Die nutzen dann ein anderes System, ein Vessel Monitoring System oder VMS. Das ist aber nicht öffentlich einsehbar. Also das ist quasi ein System, das nur den Fischereiaufsichtsbehörden und der Polizei, Wasserschutzpolizei zugänglich ist. Das heißt, da können wir nicht direkt mit drauf sehen. Das ist quasi so ein bisschen ein schwarzes Loch.",
      "start": 2808682,
      "end": 2973978,
      "confidence": 0.92244923,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber ist es dann wirklich verschlüsselt oder ist es. Also ist ja auch nur ein analoges Signal vermutlich, oder?",
      "start": 2974074,
      "end": 2979882,
      "confidence": 0.8765168,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Soweit ich weiß, ist das ein Satelliten, eine Satellitenkommunikation. AIS ist ja super anfällig. Also es gibt super interessante Vorträge dazu zum Thema AIS spoofing. Also man kann z.b. diese Daten selber generieren und selber über Funk verbreiten in der Nähe von der Empfangsstation und damit wird es an alle Schiffe weitergegeben. Da kann man Schiffe virtuell erstellen, die eigentlich gar nicht da sind oder Schiffe über andere Schiffe drüberlegen, um eins zu maskieren. Also da gibt es ganz viele Möglichkeiten. Das ist super, super Hacking und spoofing anfällig. Aber das VMS System ist da ein bisschen ein bisschen anders aufgebaut. Das ist quasi was, wo wir auch gerne mal einen Blick reinwerfen würden, weil das wäre auf jeden Fall noch mal eine Informationsquelle, die direkt auf die Fischerei auch geht, wo wir auch selber sehen könnten, was da vor Ort passiert. Aber auch da haben wir das Problem natürlich, dass die, dass das System auch einfach mal abgeschaltet werden kann.",
      "start": 2979986,
      "end": 3038126,
      "confidence": 0.93707275,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Welcher Use Case hat AIS spoofing? Also ich kann mir vorstellen, dass wenn ich jetzt so ein, wie heißt das? Trawler. Wenn ich einen Trawler fahre, dann habe ich ein Interesse AIS spoofing zu betreiben. Ich glaube, wenn ich einen Schiff Scooter fahr, weiß ich nicht, ob ich die technischen Möglichkeiten dazu habe.",
      "start": 3038198,
      "end": 3056430,
      "confidence": 0.92282677,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also im Endeffekt braucht man nur wie früher so eine PCI Radiokarte und Laptop und ein kleines Programm, das man sich schreibt und schon kann man das selber spoofen, das geht relativ easy. Aber ich glaube, das ist auch erst mal so eine Sache, wo Leute gesagt haben, geht das und was kann ich damit machen? Und ich weiß z.B. von einem Vortrag, dass eine Gruppe von Leuten auf einmal vor Nordkorea einen amerikanischen Flottenverband erscheinen haben lassen, der da eigentlich nicht ist und geguckt haben, was dann passiert. Also solche Geschichten wurden damit halt ausprobiert.",
      "start": 3056510,
      "end": 3091160,
      "confidence": 0.9280309,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ob ich das wissen möchte, was dann passiert. Keine Ahnung, welche Weltkrieg Nr. Also das.",
      "start": 3092540,
      "end": 3098892,
      "confidence": 0.9148567,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "War schon ein paar Jahre her. Ich glaube, jetzt ist die politische Lage gerade außenpolitisch so angespannt, da würde ich sowas nicht machen. Aber das wurde, es wurde z.B. versucht, wir nutzen also wir z.B. haben da hätten da jetzt nichts davon, aber man könnte halt, wenn ich jetzt selber ein Schiff habe, das ich, das ich verstecken will, dann würde ich einfach das AIS ausmachen und sagen ja, das System hat einen Fehler, anstatt mir da jetzt ein virtuelles Schiff oben drüber zu legen, das nicht wirklich existiert. Aber nur so viel. Also es ist halt natürlich möglich und Betrug damit ist natürlich auch möglich.",
      "start": 3098916,
      "end": 3133712,
      "confidence": 0.9205854,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Und was du zuerst erzählt hast, dass die Geräte ausgeschaltet werden und ihr es trackt, ist das AES, was ihr dann verwendet oder welche Basis habt ihr, wenn ihr irgendwie probiert ein Schiff zu tracken?",
      "start": 3133816,
      "end": 3146080,
      "confidence": 0.9009897,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Natürlich Das erste und logischste ist natürlich, wir sind irgendwo in der Nähe und können es natürlich, können es beobachten bzw. Wenn es außer Sichtweite ist, natürlich mit Radar verfolgen, indem wir wissen, das ist das Schiff, was wir gerade angeguckt haben und dann sehen wir es auf dem Radar, wissen, wo es hinfährt außerhalb der Sichtweite. Ansonsten natürlich ist AIS die einzige Möglichkeit für uns. Also wir empfangen natürlich diese AIS Signale und solange die an sind, können wir natürlich auch sehen, was die gerade machen. Und anhand von dem Bewegungsmuster wissen wir dann ja auch grob, was sie tun. Also wenn ein Schiff, sag ich mal so ein Kutter jetzt seine Fahrt von 15 Knoten auf drei Knoten verringert und dann im Zickzackmuster fährt, dann ist es klar, dass die gerade ihre Netze ausgeworfen haben und mit der Geschwindigkeit das Netz durchs Wasser ziehen in dem Gebiet und gerade versuchen irgendwie einen Fischwarm einzufangen. Da kann man quasi, kann man schon auch ein bisschen was rein interpretieren.",
      "start": 3146160,
      "end": 3201768,
      "confidence": 0.91220176,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Inwieweit kannst du dir denn vorstellen, wie Softwareentwickler und so Entwicklerinnen helfen könnten, diese ganzen Big Data Datensätze mittels Echtzeitanalysen so einzusetzen, dass illegale Aktivitäten schneller oder vielleicht sogar überhaupt aufgedeckt werden können?",
      "start": 3201864,
      "end": 3218990,
      "confidence": 0.83658427,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Also ich denke, da gibt es super viele Möglichkeiten. Also ich habe ja vorhin schon mal global Phishing Watch mit angesprochen, die ja sowas im Endeffekt ja schon machen. Also die nutzen verschiedene Datenquellen und machen quasi ein Overlay davon. Also die gucken z.B. das Schiff ist an der Position, das wissen wir von den AIS Daten, dann gleichen die die automatisiert mit Satellitendaten ab und folgen eigentlich nur dem Punkt auf den Satellitendaten und wissen, wo die hinfahren. Nachts haben die ihre Lichter an, auch wenn sie nachts fischen, sind die sehr gut auch über Satellit zu erkennen. Und dann kann man die auch nachts verfolgen. Und selbst wenn die ihr AIS dann ausschalten würden oder in den Bereich kommen, wo keine Abdeckung mehr ist, dann kann man das Schiff trotzdem weiterverfolgen und kann es weiter identifizieren. Und die nutzen das z.B. um sogenannte Loitering Events festzustellen. Das heißt, da kommt z.B. ein Gefrierfrachter an und der fährt seit tagen mit gleicher Geschwindigkeit und dann bleibt er auf einmal stehen und dann fährt er wieder weiter. Und der einzige Grund, warum die sowas machen ist, weil sie illegal Fänge auf See mit übernehmen. Weil das natürlich illegal ist, kann man quasi anhand der Daten feststellen, okay, da ist ein Schiff, ist rausgefahren in die Richtung, dann machen die AIs aus und das andere große Schiff bleibt auf einmal stehen für zwei 3 Stunden und fährt dann weiter. Dann ist halt relativ klar, dass die sich auf See getroffen haben, um z.B. illegale Fänge entgegenzunehmen und die dann mit legalen Fängen mischen, die Logbücher, die Fangbücher oder die Aufnahmedaten fälschen und damit illegal gefangenen Fisch in einen legalen, in Anführungszeichen, an einem Hafen zu entladen und damit auf den Markt zu bringen. Solche Sachen kann man auf jeden Fall raussuchen und zwar auch automatisiert. Also man kann z.B. auf der Karte von denen ganz gut auch nach solchen Events filtern und kann verstehen, wie das ganze funktioniert.",
      "start": 3219110,
      "end": 3325736,
      "confidence": 0.9228076,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber wenn du jetzt sagst, man kann, wird es schon gemacht oder es wäre theoretisch möglich automatisch zu machen?",
      "start": 3325848,
      "end": 3331480,
      "confidence": 0.97653633,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also es wird automatisch gemacht. Das Problem ist halt immer ganz klar die rechtliche Aufarbeitung und die Strafverfolgung, weil es immer eine Frage der Zuständigkeit auf der einen Seite ist. Also wenn das außerhalb der nationalen territorialen Gewässer passiert, dann gibt es da eigentlich keine Jurisdiktion mehr. Das heißt, die können auf hoher See was Illegales machen, aber da wo das stattgefunden hat, das ist im Endeffekt, gibt es keine Strafverfolgung. Das könnte dann höchstens der Flaggenstaat kontrollieren und verfolgen. Aber ganz viele von diesen von diesen Schiffen sind jetzt nicht in Ländern registriert, die vielleicht auf die Strafverfolgung großen Wert legen würden, sondern die haben dann sogenannte flags of convenience oder billig Flaggen nennen die sich auch, wie z.B. flagge von Liberia oder Panama oder sonstigen Ländern, auch ganz oft Ländern, von denen man überhaupt nicht denkt, dass sie überhaupt ein Schiffsregister haben, wie in der Mongolei. Und die verfolgen das natürlich dann nicht nach und damit bleibt das relativ ungestraft. Und das ist ein Riesenproblem auf See. Also auch wenn man weiß, dass da Straftaten passieren, ob es dann zu einer Anklage und letzten Endes dann auch zu einer Verurteilung kommt, ist wirklich eigentlich leider immer noch die Ausnahme. Das heißt, die einzige Möglichkeit, die sich halt da bietet, ist z.B. das, was Sea Shepherd vor ein paar Jahren gemacht hat, nämlich in der Antarktis einen illegalen Trawler aufgestöbert, der antarktischen Zahnfisch, also schwarzen Seehecht, illegal gefangen hat, den aus der Antarktis vertrieben hat und über fast vier Monate lang verfolgt hat, bis der Kapitän keine andere Möglichkeit mehr gesehen hat, als er sein Schiff vor der Küste von Sao Tome prinzipiell zu versenken, um die Beweise zu vernichten, um der Strafverfolgung zu entgehen. Das kann schon wirklich auch massiv eskalieren.",
      "start": 3331560,
      "end": 3434508,
      "confidence": 0.91923475,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Habt ihr eigentlich Internentwickler innen, die euch wirklich Sachen auch coden und Software entwickeln, um solche Probleme dann irgendwie zu automatisieren oder zu lösen?",
      "start": 3434604,
      "end": 3444146,
      "confidence": 0.9491779,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ja, tatsächlich. Also wir haben einige Crewmitglieder bzw. Auch Freiwillige, die uns da unterstützen für so kleine Projekte, auch gerade mal, wenn es so um Open Source Intelligence Aufgaben geht, wie z.B. wir wollen irgendwie eine Hafeneinfahrt automatisiert mit einer Webcam angucken und sehen, was da passiert. Bis hin zu Leuten, die uns auch Software Tools bauen, weil viele von den Tools, die wir eigentlich brauchen, die existieren zwar draußen, die sind aber hochskaliert für irgendwie große Reedereien und sind dementsprechend natürlich auch teuer. Also die haben ja, wie es heute üblich ist, oftmals irgendwelche sauteuren Abo Modelle, die man sich kaum leisten kann. Und das ist halt die Kanone, die auf Spatzen schießt für uns. Und dementsprechend haben wir dann auch Leute, die uns unsere eigenen Tools bauen, z.B. fürs Schiffsmanagement oder für Wartungspläne oder fürs Crewing, weil wir halt sehr viel mit unterschiedlichen Leuten und hunderten an Freiwilligen arbeiten müssen, die wir dann für bestimmte Einsätze und Kampagnen mit einplanen. Und da werden schon auch einige Software Tools selbst geschrieben und damit so spezialisiert, dass sie eben genau auf unsere Einsatzzwecke passen.",
      "start": 3444338,
      "end": 3513296,
      "confidence": 0.9243171,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Wie funktioniert die Zusammenarbeit mit diesen Freiwilligen? Habt ihr da keine Ahnung? Ist das dann Open Source? Ist das sehr persönlich oder wie funktioniert denn so eine Zusammenarbeit?",
      "start": 3513408,
      "end": 3523370,
      "confidence": 0.8949521,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Also das ist sehr persönlich. Also Sea Shepherd ist schon sehr abgegrenztes Environment, möchte ich mal sagen. Das heißt, die Leute, die dann auch den Zugriff auf die Daten bekommen, mit denen sie arbeiten sollen und so weiter, das sind meistens Leute, die schon lange irgendwie für den Verein oder für die Organisation tätig sind und die zusätzlich diese Skills mitbringen. Aber wir haben jetzt nicht oder wir haben bislang noch nicht irgendwelche Programmieraufträge nach draußen gegeben.",
      "start": 3523710,
      "end": 3551212,
      "confidence": 0.9276818,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Hat es irgendwelche speziellen Gründe?",
      "start": 3551276,
      "end": 3553440,
      "confidence": 0.787776,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich glaube einfach, dass man den Need ganz gut sehen muss und erkennen muss, weil es auch sehr speziell ist. Und das heißt, die Anwenderinnen und Anwender bzw. Die Leute, die gesagt haben, ich brauche ein Tool dafür, die arbeiten dann in der Regel sehr, sehr eng mit den Leuten zusammen, die dann diese Tools für uns ent.",
      "start": 3553780,
      "end": 3571144,
      "confidence": 0.93556863,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Aber das eine schließt das andere nicht aus. Also jetzt gerade Open Source technisch, wenn jetzt, keine Ahnung, irgendwas entwickelt, dass ich eine Webcam überwache und da gewisse Sachen aufzeichne, sowas könnte ja vielleicht open source technisch sehr gut auch für andere Zwecke dann verwendet werden, ohne dass ich jetzt auf die Daten wirklich zugreife. Da geht es ja wirklich dann um, wie kann ich Webcam Daten sinnvoll verarbeiten.",
      "start": 3571332,
      "end": 3593424,
      "confidence": 0.91152334,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Z.B. genau, also solche Sachen würden mit Sicherheit gehen. Es ist immer der bequeme Weg, man kennt die Leute, die einem das vielleicht programmieren können, die dein Skript bereitstellen können. Hey, was denkst du, ist es machbar? Könntest du da was basteln? Und dann passiert es eben und wir bringen es dann eben in die Anwendung.",
      "start": 3593472,
      "end": 3611120,
      "confidence": 0.9266539,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ich stelle mir gerade so vor, ihr seid auf einer Kampagne, seid auf dem Schiff unterwegs, sitzt einer mit dem Laptop, hey, wäre das nicht cool? Und dann auf einmal entsteht so ein kleiner Hackathon irgendwie in eurem, in eurer, nennt man das Kantine, da wo man halt ist oder im Aufenthaltsort?",
      "start": 3611200,
      "end": 3623072,
      "confidence": 0.93180597,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Messe. Wie Messe nennt sich das auf dem Schiff?",
      "start": 3623136,
      "end": 3625664,
      "confidence": 0.87547445,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Messe. Ah meine Güte.",
      "start": 3625712,
      "end": 3628100,
      "confidence": 0.9609225,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Schiffsbegriffe sind super speziell. Also da kann man ganze Wörterbücher schreiben.",
      "start": 3628840,
      "end": 3633424,
      "confidence": 0.96245456,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Mit ich fühle mich so, als kann ich gleich einen Bootsführerschein starten, habe das Vokabular schon drin. Wie denkst du denn, wenn sich jetzt Leute hören jetzt diesen Podcast und sag, pass mal auf, der Flo, der kommt mir recht sympathisch rüber, mit dem möchte ich mal mehr zu tun haben. Wie können Leute sich engagieren, vielleicht sogar mit einem Software Background oder ähnliches, um eure Mission zu unterstützen bzw. Euch vielleicht sogar mit ein paar Skripten zu helfen, die dir vielleicht auch die Google Maps Overlays einfacher machen oder ähnliches?",
      "start": 3633472,
      "end": 3664500,
      "confidence": 0.9550789,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Andi du bist gut, vielleicht mit einem Software Background. Ich glaube bei uns alle Zuhörer innen haben irgendwie einen Software Background.",
      "start": 3664580,
      "end": 3670324,
      "confidence": 0.8906224,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Naja, aber es gibt ja auch Leute, die wollen in ihrer Freizeit mal was anderes machen. Wenn die 8 Stunden vor dem PC hocken und programmieren da und drücken auf compile und der meckert dich an, da fehlt ein Semikolon, dann kann ich schon verstehen, warum man die ganze Thematik einfach nur in die Ecke schleudert und vielleicht einfach draußen in der Natur Geisternetze aus dem Wasser holen möchte und einfach mal nicht am Computer sitzen. Diese Leute, denke ich.",
      "start": 3670372,
      "end": 3693610,
      "confidence": 0.9209445,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Da haben wir tatsächlich auch einige bei uns in der Crew, auf die das genau so zutrifft. Das ist witzig, dass du sagst. Ja, genau. Aber wenn Leute sich bei uns beteiligen wollen, wir suchen natürlich immer Freiwillige, die auch skills mitbringen, die uns als Verein weiterbringen, die unsere Arbeit weiterbringen und die vielleicht auch hey, da gibt es Verbesserungsmöglichkeiten, die einem selber gar nicht klar werden. Die einfachste Möglichkeit ist dann natürlich über unsere Bewerbungsformulare zu gehen, über die Website oder eine Mail an die Info shepard de schreiben und sagen Hey, ich habe die und die Skills oder ich würde mich gerne einbringen. Wir sammeln natürlich dann auch diese Anfragen und wissen dann eben, wenn wir ein spezielles Problem haben oder in Austausch gehen wollen oder vielleicht irgendwann mal so wirklich so ein Hackathon oder so auf, weiß ich nicht, Chaos Computer Kongress organisieren mit Leuten, die sagen hey, habt ihr Ideen für den Meeresschutz? Let's go. Dann wissen wir, wen wir da anschreiben müssen. Das heißt, die Leute quasi in der Datenbank zu haben oder in der Crew zu haben oder als Freiwillige für den Verein mit denen zusammenarbeiten zu können. Das sind natürlich immer spannende Geschichten und daher gerne, gerne melden, gerne bewerben und wer weiß, vielleicht sieht man sich dann wirklich auf dem Schiff beim Programmieren zusammen.",
      "start": 3695510,
      "end": 3770902,
      "confidence": 0.9205444,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Noch mal noch mal ganz kurz, auf dem Schiff selbst habt ihr so eine Art Server oder wo ihr Software drauf laufen habt?",
      "start": 3770966,
      "end": 3777286,
      "confidence": 0.939217,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, ja, genau. Also die ganzen Systeme auf dem Schiff sind ja alle miteinander vernetzt. Also ob das jetzt z.B. radarsysteme sind, Actus, also die elektronische Seekarte oder Sonarsysteme bis hin zu den ganzen Sensoren wie den Satellitenkompass oder GPS System, bis hin zu unserem Onboard Infotainment, wenn man das so nennen kann, WLAN, Internetantennen, das ist alles schon zusammen und wir haben natürlich auch da oder müssen natürlich da auch die Möglichkeit haben, die Daten zu speichern und die natürlich dann auch zu sichern. Wir haben da einen Nasspfeiler mit an Bord, wo dann die ganzen Daten sicherheitshalber immer wieder ins Office gespiegelt werden, sollte mal am Schiff irgendwas kaputt gehen, dass unsere Daten auch nicht flöten gehen. Von daher versuchen wir das schon immer wieder zu optimieren.",
      "start": 3777478,
      "end": 3827426,
      "confidence": 0.924543,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Apropos kaputt gehen. Im Vorgespräch hattest du mal erwähnt, dass es auch Situationen gibt, wo du dann auf irgendeinen Mast klettern musst, weil irgendeine Antenne kaputt kaputt ist, oder?",
      "start": 3827538,
      "end": 3839924,
      "confidence": 0.88584,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, das passiert durchaus. Also wir haben z.B. tatsächlich dafür auf den großen Schiffen, wo wir natürlich auch deutlich mehr Crew haben als auf der Triton jetzt, auch immer ein comms officer, also Communications Offizier. Und die Person kümmert sich dann darum, dass sämtliche elektronischen Sachen an Bord laufen. Also das heißt, die Karten Updates von Karten Updates auf die elektronische Seekarte spielen, bis über die Server warten und Software Tools entwickeln bis hin zu ich muss Kabel ziehen oder muss am Monkey Deck, also quasi das Deck über der Brücke, wo die ganzen Antennen sind und Radaranten oder sogar am Mast oben irgendwelche Funkantennen auswechseln. Das gehört dann alles dazu. Also da ist es dann schon, man ist dann quasi nicht auf sein Kämmerlein mit seinem Laptop beschränkt, sondern man muss dann auch manchmal ganz schön hoch hinaus. Natürlich sind wir da gesichert. Also das ist selbstverständlich, dass da keiner hoffentlich tief runterfällt. Aber schwindelfrei sollte man auf jeden Fall sein.",
      "start": 3840012,
      "end": 3901144,
      "confidence": 0.91790724,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Das bedeutet Lötkolben nicht vergessen und bitte mit einpacken.",
      "start": 3901232,
      "end": 3904904,
      "confidence": 0.8555933,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ja, haben wir immer dabei. Auch Gaslötkolben für die Orte, wo man löten muss und keine Steckdose zur Verfügung hat. Wir haben an Lötkolben haben wir alles.",
      "start": 3904952,
      "end": 3914184,
      "confidence": 0.9010844,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Also ich habe in dieser Podcast Episode mehr Fischarten gelernt als in den sechs, sieben Jahren Biologieunterricht, die ich hatte. Ich habe mehr über das Schiffsvokabular gelernt, als ich jemals in irgendwelchen International Ocean Film Tour gehört habe. Und sehr, sehr interessant. Excel ist everywhere, sogar bei Sea Shepherd, um Geisternetze rauszuholen. Finde ich mega spannend. Und Google Maps kann Karten overlays. Und jetzt ist meine Frage wo kriege ich diese Karten? Ich glaube, da muss ich mal rumspielen. Ja, Flo, vielen lieben Dank. Vielen lieben Dank für diese Insights, für alle Leute, die diesen Podcast hören. Wir haben natürlich in den Show Notes ein paar Links zu Sea Shepherd selbst, zu der Vorstellung des Schiffs Triton, falls ihr das mal sehen wollt. Da gibt es ein tolles Bild, aber auch für Link, Bundesamt für Seeschifffahrt und Hydrographie und Global Fishing Watch, was AIS spoofing ist und so weiter und so fort. Und falls ihr wirklich noch ein bisschen Freizeit habt und denkt okay, das ist wirklich was, wo ich mitwirken möchte, meldet euch bitte bei Flo bei C Deutschland. Wolfgang, wie viele Wörter hast du gelernt?",
      "start": 3914312,
      "end": 3990860,
      "confidence": 0.905141,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Ich hab natürlich super viel gelernt. Super spannendes Thema auch. Ich habe auch jetzt wirklich schon irgendwie würde mir wünschen, da ganz viel mit den Daten und mit den Techniken zu machen, weil ich glaube auch ein Open Source Ansatz oder Technik könnte da schon viel weiterhelfen. Also mir kribbelt schon ein bisschen unter den Fingern, muss ich schon ganz klar sagen. Hoffe, dass sich da vielleicht auch irgendwas entwickelt. Wir haben ja doch tausende Leute da, die uns jetzt in irgendeiner Form zuhören und sehr viel Erfahrung haben im technischen Bereich. Also das wäre natürlich cool, wenn sich da irgendwo irgendwas ergeben würde. Jetzt meine Frage wäre noch flo, hast du irgendwas, das du gern unseren Zuhörer innen mitgeben willst, wenn du schon mal bei uns bist und jetzt direkt vor allem ganz viele Informatiker innen ansprechen kannst?",
      "start": 3991020,
      "end": 4037196,
      "confidence": 0.9078466,
      "speaker": "C",
      "channel": null
    },
    {
      "text": "Ich finde es klasse, dass sich Leute, die ja wirklich auch und da erzähle ich mich auch ein bisschen mit dazu, eigentlich aus dem Ingenieurs Background kommen und sich dafür interessieren, was denn, was für Anwendungsmöglichkeiten das da draußen gibt. Und wenn es da Leute gibt, die jetzt das gehört haben, gesagt haben hey, da fallen mir schon 2000 Verbesserungsmöglichkeiten ein oder ich weiß, wie ich da unterstützen kann. Bitte meldet euch gerne. Wir freuen uns über jede Art Unterstützung, ob es mit einer Spende ist oder mit einem Merch Kauf oder im Endeffekt mit wertvollem Input, Ideen freuen uns riesig drauf, die Leute dann auch mal mit an Bord begrüßen zu dürfen. Die Möglichkeit wird es auf jeden Fall auch geben.",
      "start": 4037388,
      "end": 4080198,
      "confidence": 0.91202277,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Dann danken wir auch im Namen aller Hörerinnen und Hörer für deine Zeit, für falls ihr ein bisschen Feedback für Flo habt, könnt ihr das natürlich gerne direkt an den Flo senden. Ihr findet ihn unter Sea Shepherd Deutschland. Falls nicht, droppt uns das doch einfach mal in die Community und wir leiten es sehr gerne weiter. Das war's von uns.",
      "start": 4080294,
      "end": 4098452,
      "confidence": 0.9137367,
      "speaker": "A",
      "channel": null
    },
    {
      "text": "Wir wünschen euch einen schönen Tag und tschüss dann. Schönen Tag euch allen.",
      "start": 4098476,
      "end": 4102916,
      "confidence": 0.9416015,
      "speaker": "B",
      "channel": null
    },
    {
      "text": "Ciao, ciao.",
      "start": 4102948,
      "end": 4103780,
      "confidence": 0.737645,
      "speaker": "C",
      "channel": null
    }
  ],
  "confidence": 0.92362946,
  "audio_duration": 3957,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}