{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 4367,
  "audio_url": "https://cloud.inlupus.at/s/BWF2S9Pxw5H6wCk/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9233045,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "2c940229-3681-4c5b-a13f-c2b91821fa3e",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 4,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "confidence": 0.92381,
      "end": 208034,
      "speaker": "A",
      "start": 3680,
      "text": "Ab und zu gibt es Momente in diesem Podcast, wo man merkt, dass Interviewgäste ein hundert Prozent für ihr Thema brennen. Man sieht die ungebremste Motivation für die Arbeit in ihren Augen und wie viel Freude diese dabei haben, über das Thema zu sprechen. Und das erzeugt ein konstantes Grinsen in meinem Gesicht. Diese Podcast Episode ist eine solche. Es geht um die Weltmeisterschaft in Microsoft Excel. Wenn du dir nun what the heck? Ganz genau. Das war auch mein erster Gedanke. Ich wusste nicht, dass wir Excel eSport brauchen, aber nun bin ich hyped. Zu Gast haben wir Jean und Benni. Beide spielen relativ weit oben bei der Microsoft Excel Weltmeisterschaft und waren sogar bei den Final Games in Las Vegas. Mit ihnen klären wir, was die Microsoft Excel Weltmeisterschaft eigentlich ist, wo die Unterschiede zwischen dem Financial Modeling und dem Excel eSport liegen, welche Arten von Herausforderungen gelöst werden sollen, was Map Cases sind und natürlich, ob man cheaten kann, was klassische Fallstricke bei komplexen Excel Aufgaben sind, was das Ganze mit Advent of Code zu tun hat, ob man diese Art von E Sport auch trainieren kann, aber auch, welche Excel Funktionen mehr Anerkennung verdient hätten. Wir springen rein, los geht's. Viel Spaß. Jeder, der in irgendeiner Art und Weise mit Computern arbeitet, kommt um dieses Programm nicht herum. Jeder, der in irgendeiner Art und Weise sein Geld als Arbeitnehmer verdient, hat bestimmt schon mit einer Abteilung zusammengearbeitet, die Dateien dieses Programms schön per E Mail rum versendet. Und weil ich auch mal für einen Datenbank as a Service Provider gearbeitet habe, kann ich mit Fug und Recht behaupten, dieses Programm ist der größte Konkurrent jeder Datenbank und ich würde fast sagen, auch der größte Konkurrent von sehr vielen Apps bzw. No code apps. Wir sprechen heute mal über Excel und ihr hört das vielleicht von meiner Stimme, ich grinse schon wieder so, weil das heutige Thema, ich weiß gar nicht, ob man das im Nerdigkeitstum übertreffen kann. Ich war irgendwann mal bei mir im Wohnzimmer, saß auf der Couch, natürlich wieder völlig ungesund, krummer Rücken und so weiter, so wie man sich mal gepflegt in ein Sofa fletzt, und hab Doomscrolling auf Instagram gemacht oder YouTube shorts oder auf irgendwo diese fünfzehn Sekunden Videos. Und irgendwann bin ich auf ein Video gestoßen, da sieht man eine große Halle Computer auf einer Bühne, Riesenleinwände, und da werden Leute gefeiert wie Rockstars, gefühlt wie Taylor Swift. Gut, vielleicht jetzt nicht so groß, aber gefühlt. Und dann zoomt jemand raus und dann stand da fett Excel Weltmeisterschaft. Ich denke so, what the fuck. Ist das denn? Du kannst sagen, es gibt den Excel in der Weltmeisterschaft und dann was macht man natürlich? Man geht auf YouTube und und dann geht man eine excel Weltmeisterschaft ein. Ja, dann sind zwei Stunden ins Land gegangen und ich war vollkommen fasziniert, dass es Weltmeisterschaften in Excel gibt. Und was macht man als guter Podcaster? Man recherchiert, man geht auf die Webseite, man schaut sich die Rankings an. Glücklicherweise sind in den Rankings auch nicht nur die Namen der Kandidaten, sondern auch die Länder der Kandidaten. Und deswegen bin ich sehr, sehr, sehr, sehr glücklich, dass wir einen Deutschen, einen Österreicher in den Rankings gefunden haben, die sehr weit oben mitspielen bzw. Mitges haben in der letzten Saison nennt man das, glaube ich. Und die haben wir heute als Gast eingeladen. Hallo Jo. Hallo Benni."
    },
    {
      "confidence": 0.90577,
      "end": 208546,
      "speaker": "B",
      "start": 208082,
      "text": "Hallo."
    },
    {
      "confidence": 0.9709864,
      "end": 212850,
      "speaker": "C",
      "start": 208658,
      "text": "Ist dir ein Österreicher zu wenig, Andi, dass du jetzt auch andere Österreicher einlädst?"
    },
    {
      "confidence": 0.92883086,
      "end": 237386,
      "speaker": "A",
      "start": 212930,
      "text": "Ich habe mir mal gedacht, da du bei den ganzen Wetten und Gewinnspielen hier, die wir immer gemacht haben, immer verlierst, habe ich gedacht, du brauchst mal Unterstützung. Aber da ich immer noch einen unfairen Vorteil hab, Bennys Google Drive oder Google Avatar ist ein schalke Logo. Und wo sind wir bei schalke? Sind wir bei Gelsenkirchen. Und wo sind wir bei Gelsenkirchen? Da sind wir da im Pott. So, also würde ich sagen, die Zeichen stehen für mich."
    },
    {
      "confidence": 0.9282885,
      "end": 244554,
      "speaker": "C",
      "start": 237458,
      "text": "Ja, das ist eigentlich Verrat an der Krone, oder Benni? Was ist da los? Kein österreichischer Club da als Unterstützer?"
    },
    {
      "confidence": 0.96522784,
      "end": 261220,
      "speaker": "D",
      "start": 244682,
      "text": "Der österreichische Verein, den ich unterstützt habe, das ist mein lokaler Verein, der ist von Mattersburg und der existiert leider Gottes nicht mehr. Also da hat es Finanzprobleme gegeben vor fünf Jahren mittlerweile. Also bleibt nur mein deutscher Verein über und das ist der FC schalke."
    },
    {
      "confidence": 0.9126951,
      "end": 318084,
      "speaker": "A",
      "start": 261560,
      "text": "Also ich habe gerade mal geguckt, der FC schalke spielt leider auch in der zweite Bundesliga. Besser als der MSV Duisburg, zugegeben. Aber naja, Fußball ist heute nicht unser Thema, denn es ist ein viel geileres Thema. Es ist Excel. Deswegen mal ganz kurz für die Hörerinnen und Hörer, wer seid ihr eigentlich? Du hast angefangen Mathe zu studieren, hast dann abgebrochen, hast dann ins deutlich spannendere Feld Finanzmanagement gewechselt. Verstehe ich zwar nicht, aber okay, erklärst du uns gleich. Und da hast du den Einstieg in Excel gefunden, weil es ein Modul Excel für Finanzmanagement gab. Beruflich warst du mal bei der BASF unterwegs, ich glaube, das ist ein Chemiekonzern, soviel ich weiß, im Bereich Business Reporting. Und inzwischen bist du Prozessexperte, SAP und Reporting. Und du kommst aus Brandenburg, nahe unserer Hauptstadt. Und du warst zumindest in der letzten Saison zwei tausend vier und zwanzig im Halbfinale und bist dort unter die Top vier und zwanzig gekommen. Herzlichen Glückwunsch dafür nochmal."
    },
    {
      "confidence": 0.87555,
      "end": 318724,
      "speaker": "B",
      "start": 318132,
      "text": "Dankeschön."
    },
    {
      "confidence": 0.92205966,
      "end": 357606,
      "speaker": "A",
      "start": 318772,
      "text": "Benni, wer bist du? Du kommst aus dem Burgenland, aus Österreich. Ich musste erst mal googeln, wo das Burgenland überhaupt ist. Es ist ganz an der ungarischen Grenze in der Nähe von Wien. Du bist immer noch Student. Hoffentlich schließt du das auch im Sommer diesen Jahres ab. Du studierst ein wunderbares Fach Wirtschaftsinformatik. Glückwunsch dazu. Du tust das in Wien an der Fachhochschule. Und ja, was soll ich sagen? Du warst bzw. Bist Gewinner der Studentenvariante der excel Weltmeisterschaft und du bist ebenfalls in die Top vier und zwanzig der Profis, nennen wir es mal der großen, der nicht Studenten in der letzten Säge gekommen. Auch Glückwunsch dazu. Ist das richtig?"
    },
    {
      "confidence": 0.87367666,
      "end": 362358,
      "speaker": "D",
      "start": 357718,
      "text": "Ja, das ist soweit richtig. Und danke natürlich auch von meiner Seite für die Glückwünsche."
    },
    {
      "confidence": 0.8838727,
      "end": 367526,
      "speaker": "A",
      "start": 362454,
      "text": "Kommen wir kommen wir mal zum Thema. Wie würdet ihr Excel in drei Worten beschreiben?"
    },
    {
      "confidence": 0.93583137,
      "end": 379554,
      "speaker": "D",
      "start": 367638,
      "text": "Umfassend ist wahrscheinlich das erste Wort. Ich schummel jetzt mal. Einfacher Einstieg in ein Wort und hohe Maximalfähigkeit in ein drittes Wort."
    },
    {
      "confidence": 0.8423886,
      "end": 381634,
      "speaker": "A",
      "start": 379602,
      "text": "Joe, gehst du da mit oder mitgehen?"
    },
    {
      "confidence": 0.94124055,
      "end": 393058,
      "speaker": "B",
      "start": 381682,
      "text": "Schon, aber ich habe jetzt direkt an spannend und atemberaubend gedacht und dann noch vielseitig. Also für mich ist das wirklich ein Tool, mit dem man so viel machen kann und was mir auch einfach viel Spaß bereitet."
    },
    {
      "confidence": 0.9084026,
      "end": 415784,
      "speaker": "A",
      "start": 393154,
      "text": "Also für alle Leute, die uns gerade im Auto hören, ich hoffe, ihr habt keinen Unfall gebaut, nachdem jemand Excel als atemberaubend beschrieben hat. So, ich habe in der Intro gesagt, diese Episode kann man an Nerdtum nicht übertreffen und deswegen gehen wir da mal tiefer rein, weil ich finde das wirklich spannend. Ich finde es super toll, wie sich jemand damit eine ganze Zeit lang effektiv beschäftigen kann."
    },
    {
      "confidence": 0.91835976,
      "end": 430308,
      "speaker": "C",
      "start": 415952,
      "text": "Aber genau das ist eigentlich stellt sich sofort mir die Frage, wie kommt man auf sowas? Also arbeitet ihr alle mit Excel den ganzen Tag und habt euch dann überlegt, irgendwie, okay, gibt es vielleicht auch Meisterschaften dazu? Also wie kommt man auf so ein Thema?"
    },
    {
      "confidence": 0.9076569,
      "end": 547888,
      "speaker": "D",
      "start": 490484,
      "text": "Für meinen Teil persönlich habe ich einfach in der Schule schon angefangen, Excel einfach zu verwenden, dann im Privatbereich ein bisschen auch dann in Google Sheets abgedriftet und mehr oder weniger einfach diese, was ich gerade vorhin auch schon erwähnt habe, die Maximalfähigkeit einfach kennengelernt und den einfachen Einstieg. Und das ist eben genau dieser Punkt. Und dann war ich auch wie der Andi auch irgendwann mal Doomscrolling und habe darüber zufällig herausgefunden über TikTok, dass es einen excel Weltmeisterschaft gibt und mir in diesem Kontext einfach gedacht ja, ich google es mal und bin auf ähnliche Resultate wieder angestoßen. Nur war meine Indikation nicht, ich habe einen Podcast, ich frage die mal an, sondern meine Indikation war, ich melde mich einfach einmal an. Und ja, dann habe ich es ausprobiert und es hat sich als relativ richtig herausgestellt und glaube dadurch, dass ich durch die Weltmeisterschaft, durch das ganze als Wettkampf dann noch einmal ein bisschen mehr Zeit in Excel investiert habe und dadurch einfach noch besser geworden bin."
    },
    {
      "confidence": 0.9321824,
      "end": 567228,
      "speaker": "C",
      "start": 547984,
      "text": "Du bist der Mann, der Verrat an der Krone, kommt mir vor. Du hast gesagt, du bist Google Sheets abgedriftet. Darf man das überhaupt sagen als Excel Profi? Weil das ist so, um in andis Worten zu sprechen, wenn ich Bauer bin und irgendwie einen Traktor habe und dann probiere mit irgendeinem mini probiere mein Feld zu pflügen oder so in der Richtung."
    },
    {
      "confidence": 0.9145503,
      "end": 579084,
      "speaker": "D",
      "start": 567324,
      "text": "Es ist tatsächlich von manchen als Hochverrat angesehen worden. Das ist absolut richtig. OK, also aber ich bin ja wieder zurück auf den richtigen Pfad gekommen, um es mal so zu formulieren."
    },
    {
      "confidence": 0.91703,
      "end": 581372,
      "speaker": "C",
      "start": 579132,
      "text": "Okay, also du verwendest jetzt kein Google Sheets mehr?"
    },
    {
      "confidence": 0.9180414,
      "end": 603432,
      "speaker": "D",
      "start": 581396,
      "text": "Nein, jetzt verwende ich kein Google Sheets mehr. Es war einfach nur vor allen Dingen aufgrund des Online Zugriffs, der war damals relativ relevant und der war bei Google Sheets oder ist bei Google Sheets besser, als es teilweise Excel Web ist. Aber wenn du es eher lokal verwendest, dann ist es Excel deutlich überlegen gegenüber Google Sheets."
    },
    {
      "confidence": 0.9211063,
      "end": 662110,
      "speaker": "B",
      "start": 603576,
      "text": "Bei mir war es halt, dass ich im Studium angefangen hatte mit Excel, also ich hatte Finanzmanagement als Studienfach und dort gab es halt dieses Modul und das hat halt als Einführung gereicht, war dann auf der Arbeit schon relativ früh der Beste, hab relativ früh angefangen Schulungen zu geben und bin dann halt reingekommen, mich auch privat weiterzubilden. Und dann, wie man halt diese Weltmeisterschaft findet, bei mir war es YouTube, jetzt nicht die Shorts, sondern man folgt seinen YouTube Kanälen, wo man halt lernt, also man kennt bestimmt Leila Guarani, es gibt verschiedene. Und dort habe ich dann halt irgendwann ein Video gesehen, wo einer von den Top Profis eine Challenge gelöst hat, die dem eigentlich ein Jugend YouTube Kanal owner eine Woche, glaube ich, Zeit gekostet hat und er hat es halt in wenigen Minuten mit Funktionen gelöst. Und das hat mich halt so beeindruckt, dass ich mir den Kanal angeguckt habe von ihm und bin dann halt drauf gekommen und habe halt gesehen, ah OK, es gibt eine Weltmeisterschaft und das hat dieses rabbit Hole geöffnet, dass man sich das anguckt, dass man anfängt zu üben und irgendwann dann halt auch mitmacht."
    },
    {
      "confidence": 0.92557985,
      "end": 684664,
      "speaker": "A",
      "start": 662190,
      "text": "Was macht ihr denn beruflich mit Excel bzw. Macht ihr beruflich überhaupt was mit Excel? Also ich meine, jo, ich hatte gerade gesagt, du machst was im Bereich Reporting. Haben die Leute auf der Arbeit jetzt mitbekommen, hey, der ist bei der excel Weltmeisterschaft, dem drücken wir jetzt einfach jede Reporting Aufgabe, weil der macht die ja, weiß ich nicht, so wie ein zehn x engineer, du bist der zehn x Exler oder ähnliches, oder?"
    },
    {
      "confidence": 0.93534684,
      "end": 743072,
      "speaker": "B",
      "start": 684832,
      "text": "Das beschreibt sehr gut. Also es war halt am Anfang so, dass ich halt schon relativ viel gemacht habe. Ich habe meine eigenen Aufgaben gemacht. Man kann ja auch mit Excel in verschiedensten Arten Sachen automatisieren. Es gibt VBA, es gibt Power Query, es gibt Office Scripts, also man kann sehr, sehr viele Sachen nutzen, um seine Aufgaben zu vereinfachen. Und ich war halt im internen Newsletter auch, weil ich dann halt nach Las Vegas geflogen bin, dort auch relativ erfolgreich. Also ich sag mal, man hat ein bisschen Preis bekommen, das war schon erfolgreich. Und da bin ich halt auch dann geteilt worden durch den Newsletter. Und es war schon vorher so, dass ich halt intern im Team relativ viel gemacht habe. Seitdem kommen halt Anforderungen aus jedem Bereich des Unternehmens und oft sind Sachen, die halt relativ einfach sind, aber es ist wirklich genau das. Also man spricht sich rum und die Leute stellen sich glaube ich oft das falsche vor. Also ich bin gespannt, ob ihr die richtige Vorstellung am Ende habt, aber es ist halt schon wirklich auf Arbeit bei mir sehr, sehr relevant, weil ich sehr viel mit Excel mache. Nicht nur, aber es ist halt schon das Tool, mit dem wir am meisten machen."
    },
    {
      "confidence": 0.9060529,
      "end": 771908,
      "speaker": "A",
      "start": 743136,
      "text": "Dann lass uns mal direkt einsteigen. Ich habe im Intro gesagt Excel Weltmeisterschaft, jetzt ist das glaube ich so der umgangssprachliche Term. Das Ding heißt vielleicht sehr wahrscheinlich anders und offen gesprochen fake ich das natürlich. Ich weiß, dass das Ding anders heißt. Deswegen Benjamin, vielleicht gibst du uns mal ein bisschen Licht ins Dunkle. Was ist genau die Microsoft Excel World Championship und wie ist sie entstanden und wie sie aufgebaut? Vielleicht gibst du morgens mal ein bisschen Insights."
    },
    {
      "confidence": 0.92235523,
      "end": 843632,
      "speaker": "D",
      "start": 772004,
      "text": "Also angefangen hat das ganze in den frühen er Jahren mit einer Model of Weltmeisterschaft, das hat damals so geheißen und war damals sehr, sehr stark auf Finanzmodellierung spezialisiert. Und diesen Bereich dieser Finanzmodellierung wurde dann irgendwann beendet, zwei tausend neunzehn und im Jahr danach, zwei tausend zwanzig hat sich der Financial modeling World Cup gegründet. Das ist die Organisation, die das ganze aktuell organisiert. Und im ersten Jahr haben sie auch mal den Schwerpunkt, den Fokus auf diesen Finanzmodellierungsteil der Weltmeisterschaft gelegt. Im Jahr danach, also zwei tausend ein und zwanzig, wurde dann zum ersten Mal die Financial modeling World Cup Open, also FMWC Open ins Leben gerufen. Das war dann Excel wirklich als eSport. Und im Jahr danach, zwei tausend zwei und zwanzig, ist dann Microsoft auch als Sponsor und Namensgeber eingestiegen. Und seitdem gibt es die offene, die Microsoft Excel World Championship. Die findet jetzt zwei tausend zwei und zwanzig. War sie rein online noch? Nein, zwei tausend ein und zwanzig noch rein online. Zwei tausend drei und zwanzig, vier und zwanzig war sie dann vor Ort im Finale in Las Vegas. Und seit zwei tausend ein und zwanzig gibt es auch die Microsoft Excel Collegiate Challenge, also die Studentenausgabe dieser Weltmeisterschaft."
    },
    {
      "confidence": 0.9652336,
      "end": 850140,
      "speaker": "C",
      "start": 843696,
      "text": "Und was ist jetzt Excel eSports? Also eSports sagt mir jetzt noch was, aber Excel eSports oder wo ist da der Unterschied?"
    },
    {
      "confidence": 0.91532415,
      "end": 904962,
      "speaker": "B",
      "start": 850220,
      "text": "Genau, also grundsätzlich, es gibt halt zwei Meisterschaften, also FMWC oder Financial Modeling World Cup, das ist ein Unternehmen grundsätzlich und die haben zwei Meisterschaften. Es gibt halt FMWC, also den Financial Modeling World Cup und es gibt die MEWC, was die Microsoft Excel World Championship ist. Und der Unterschied ist, wie Benni meinte, das eine wäre oder ist sehr financial Modeling lastig und das andere, dieses MEWC, da spricht man von Excel esports. Das ist ein bisschen kurzweiliger. Es geht mehr darum halt, dass man nicht das Hintergrundwissen benötigt von diesen Finanzthemen. Also bei dem tatsächlichen Financial Modeling, da ist es sehr, sehr empfehlenswert, wenn man, wenn Cashflow für einen halt ein Begriff ist, mit dem man umgehen kann, als Beispiel. Oder Leasing. Es gibt verschiedene Themen dort, die halt wirklich sehr thematisch auf Finanzen bezogen sind. Und Microsoft Excel World Championship, das ist diese esports Meisterschaft, wo es eigentlich nur darum geht, Probleme in Excel zu lösen und das mit Zeitdruck."
    },
    {
      "confidence": 0.984199,
      "end": 907586,
      "speaker": "C",
      "start": 905026,
      "text": "Und hast du da ein Beispiel? Wie sieht sowas aus?"
    },
    {
      "confidence": 0.91683793,
      "end": 993766,
      "speaker": "B",
      "start": 907658,
      "text": "Ja, es gibt viele Beispiele. Also grundsätzlich, man unterscheidet die Fälle nach Art. Es gibt Mapfälle zum Beispiel, das heißt halt Excel theoretisch, du hast immer Spalten, Zeilen, also du hast deine Bezüge und man kann die ja navigieren. Also es gab letztens eine Challenge von einem Teilnehmer, der hat eine First Person shooter Fall sozusagen versucht zu erstellen in Excel. Und dann ging es darum, dass du halt die Winkel nicht direkt berechnen musstest, aber du hattest halt die Eingaben in der Tastatur, musstest gucken, wo du hinguckst und wenn jemand im Blick fährt, hast du halt erschossen. So eine Sache halt. Also das wäre so ein Mapfeil, der halt vielleicht greifbar ist für jemanden, der sonst nicht so viel sich darunter vorstellen kann. Andere Sachen sind halt Datacases, also das ist das, womit man wahrscheinlich am meisten zu tun hat, wenn man wirklich in Excel arbeitet, man hat halt verschiedene Tabellen, also Excel ist ein Tabellenkalkulationsprogramm, sprich ich habe eigentlich alles als Tabelle, aber natürlich die Strukturierung ist schon entscheidend. Und dort hast du halt dann Sachen, dass du Sachen zusammenbringen musst. Du musst halt verschiedene komplexe Logiken, meistens ist es so, es fängt leicht an, wird recht schnell kompliziert und musst halt dort dann im Endeffekt Probleme lösen. Also dieser eine Fall, den wir vor kurzem mal bekommen haben von einem lokalen Chapter aus Großbritannien, da ging es darum, dass man zweier Paidei, der vierzehnter März, und da gab es einen Fall, dass man über pi sozusagen eine Art Verschlüsselung erstellt hat. Das war dann auch meiner Meinung nach Datafeil, weil es eigentlich nur darum geht, dass du eine gewisse Logik hast, die du implementieren musst. Und dann ging es darum, Wörter zu verschlüsseln über Pi."
    },
    {
      "confidence": 0.921217,
      "end": 1023766,
      "speaker": "A",
      "start": 993878,
      "text": "Du hast jetzt gerade gesagt, okay, da gibt es jetzt zwei Bereiche, Financial Modeling und Excel esports. Du hast gesagt, das eine ist kurzweiliger. Was Heißt das? Heißt das, dass im Financial Modeling die Aufgaben über mehrere Stunden gehen und dann wirklich so, berechne mir die Zinsrate von das und das mit dem Cashflow und du hast ein großes Unternehmen und dann ist das wirklich so, ich muss mich jetzt vier, fünf Stunden da konzentrieren und die anderen Sachen sind so fünf Minuten Dinge oder wie darf ich mir das vorstellen?"
    },
    {
      "confidence": 0.9311571,
      "end": 1086686,
      "speaker": "B",
      "start": 1023878,
      "text": "Genau, so theoretisch nicht viel fünf Stunden, sondern man hat bei dem Financial Modeling zwei Stunden Zeit, um drei Fälle, die meistens eigenständig sind, zu behandeln. Das ist auch da so, dass der erste Fall heißt meistens speed it up, also das ist eine Sache, die relativ wenig Zeit kostet, gibt auch verhältnismäßig wenig Punkte. Dann gibt es einen zweiten Fall, der komplexer ist und dann gibt es meistens einen Fall, der eine gewisse Thematik hatte. Also ich glaube das letzte mal war Immobilienmodell. Immobilien, genau, also Immobilien, wenn man Sachen baut, wenn man die vermietet, liest und so weiter, wann sich das halt rechnet. Also im Endeffekt Modell, ich glaube das war über zehn Jahre, da hat man dann halt für diese drei Fälle zwei Stunden und bei diesen esport Sachen, die ganzen Online Runden sind immer eine halbe Stunde. Und dort ist es halt so, du hast, also früher waren es mal fünf Level, jetzt sind es halt sieben Level, die eigentlich meistens zusammengehörig sind, zumindest bauen sie zu einem gewissen Teil aufeinander auf. Oft ist es auch so, du hast die ersten fünf Level, die ein Bereich sind und vielleicht Level sechs und sieben nochmal in eine etwas andere Richtung, aber grundsätzlich hast du halt eine halbe Stunde Zeit, um Probleme zu lösen. Unabhängig von diesem fachlichen Aspekt der Finanzmodellierung."
    },
    {
      "confidence": 0.9324726,
      "end": 1097966,
      "speaker": "A",
      "start": 1086798,
      "text": "Ihr beide, wenn ich das jetzt richtig raushöre, seid dann nicht im Financial Modeling unterwegs, sondern wirklich im eSports in diesen, ich nenne es jetzt mal kleinere Aufgaben, aber nicht weniger komplex. Ist das richtig?"
    },
    {
      "confidence": 0.9364297,
      "end": 1138168,
      "speaker": "D",
      "start": 1098078,
      "text": "Ja, also wir sind beide im Finanzbereich zwar Teilnehmer, aber bei weitem nicht so erfolgreich und erfolgreicher oder deutlich besser und auch mehr Spaß haben wir beide an den eSport Aufgaben. Also das war auch das, wo die Weltmeisterschaft ist. Diese gesamten YouTube Shorts, TikToks etc. Die Videos, die man sieht, die sind auch in neun und neunzig Prozent der Fälle von Excel als eSport, einfach weil es deutlich spannender für uns zumindest zum teilnehmen ist, aber darüber hinaus natürlich auch einfach zum zuschauen deutlich spannender ist. Es gibt meistens auch so ein kleines Animationsvideo, wo der Case vorgestellt wird und in diese Richtungen geht es einfach beim Ex esport und nicht so sehr beim Finanzmodellieren."
    },
    {
      "confidence": 0.9348585,
      "end": 1147256,
      "speaker": "C",
      "start": 1138264,
      "text": "Und man ist da wirklich vor Ort irgendwo? Also man sitzt da wirklich dann physikalisch irgendwo gemeinsam oder ist es dann auch remote? Also wie läuft denn das im Detail dann wirklich ab?"
    },
    {
      "confidence": 0.91472,
      "end": 1180276,
      "speaker": "D",
      "start": 1147328,
      "text": "Also das Finanzmodellierung ist zur Gänze online und das Excel als eSport gibt es zwei Phasen im Prinzip. Also es gibt über die gesamte Saison, über das gesamte Jahr hinweg diverse Online Wettkämpfe, wo man sich dann qualifiziert und die besten von den diversesten Online Qualifikations qualifizieren sich für das Finale in Las Vegas. Und das ist das, was der Andi auch in der Einleitung bereits erwähnt hat. In Las Vegas auf einer Bühne, man ist physikalisch vor Ort, hat einen high End Gaming PC vor sich und löst damit Microsoft Excel Aufgaben."
    },
    {
      "confidence": 0.9478231,
      "end": 1183492,
      "speaker": "A",
      "start": 1180468,
      "text": "War das jetzt ein Witz oder hat man wirklich ein high End Gaming PC vor sich?"
    },
    {
      "confidence": 0.89228815,
      "end": 1196464,
      "speaker": "D",
      "start": 1183596,
      "text": "Man ist in einer eSport Arena, wo sonst Wettkämpfe in den High End Gaming supertollen spielen mit super viel FPS etc. Stehen. Macht dort Microsoft Excel auf wirklichen high End gaming PCs?"
    },
    {
      "confidence": 0.9124,
      "end": 1200720,
      "speaker": "A",
      "start": 1196592,
      "text": "Hat sich schon mal ein Teilnehmer beschwert, dass ein Excel geleckt hat oder ähnliches?"
    },
    {
      "confidence": 0.977016,
      "end": 1211340,
      "speaker": "D",
      "start": 1200800,
      "text": "Ich habe es tatsächlich vor Ort zusammengebracht mit einer Kalkulation, Excel zum Abstürzen zu bringen, weil sie zu rechenintensiv war, was ich auf diesen Rechnern nicht für möglich gehalten hab."
    },
    {
      "confidence": 0.847808,
      "end": 1215040,
      "speaker": "A",
      "start": 1211640,
      "text": "Was war denn der limitierende Faktor? RAM oder CPU Cycles?"
    },
    {
      "confidence": 0.8885006,
      "end": 1221840,
      "speaker": "D",
      "start": 1215200,
      "text": "Ich glaube CPU war das Problem, aber es war auch einfach eine sehr, sehr schlecht optimierte Funktion meinerseits."
    },
    {
      "confidence": 0.8710265,
      "end": 1239868,
      "speaker": "A",
      "start": 1221920,
      "text": "Jetzt hatte der Jean gerade schon, ich glaube, diesen Map Case genannt. Kannst du mal zwei, drei Beispiele geben, Benjamin, was für Aufgaben man da erwarten kann. Also was ist jetzt eine speed up Aufgabe, eine leichte Aufgabe hatte es glaube ich genannt, so am Anfang. Und wo geht es dann, ich sag mal, dahin?"
    },
    {
      "confidence": 0.89817524,
      "end": 1325554,
      "speaker": "D",
      "start": 1239964,
      "text": "Also Klassiker sind eben Map Cases, wie Jean und du jetzt gerade schon erwähnt hast. Diese Data Cases sind natürlich ein Klassiker. Was auch relativ häufig vorkommt, sind zum Beispiel Spiele, also ganz klassisch Poker, Schach etc. Solche Spieler, dass man quasi diverse Pokerhände zur Ausgabe bekommt und man aufgrund dessen ermitteln muss, wer hat jetzt den Jackpot gewonnen, zum Beispiel, sowas in die Richtung. Aber eben gerade auch Map Cases, zum Beispiel ich selber schreibe auch Cases für die Weltmeisterschaft und habe letztes Jahr einen Case, also Case, so heißt das Gesamte, was man dort löst, geschrieben über Ship the World, also über Schifffahrt im Prinzip. Und da ging es darum, man hatte eine Karte, das ist wirklich eine excel Tabelle, wo einzelne Zellen blau für Wasser eingefärbt waren, grün für Land. Und das Ziel war es, den möglichst kürzesten Weg zwischen zwei Punkten auf dieser excel Karte, also von B zu E, zu finden möglicherweise. Allerdings kann ein Schiff natürlich nicht über Land fahren, sondern muss durchs Wasser fahren. Das heißt, man muss sich quasi die Karte, die Excel Referenzen vorstellen, was ist quasi der kürzeste mögliche Weg? Und dann kam in dem Case noch ein paar Data Aspects dazu. Es ging darum, diverse Kosten zu ermitteln, wie teuer ist es, dass das Schiff von dort nach hinten transportiert, wie viel Waren kann es transportieren etc. Und wie."
    },
    {
      "confidence": 0.9166511,
      "end": 1351648,
      "speaker": "C",
      "start": 1325642,
      "text": "Macht man das dann wirklich in der Praxis? Für mich als Excel Laie, ich kann ja irgendwie nur eine Formel pro Zelle machen, mache ich dann irgendwie ganz viele generische oder eine generische Funktion, die dann pro Zelle ausgewertet wird? Oder verwendet man da Makros? Darf ich da ganz klassisch auch programmieren? Gibt es da Limitierungen diesbezüglich? Oder wie schaut denn so eine mögliche Lösung für so einen Use Case aus, wo man das Schiff herumschippern lassen muss?"
    },
    {
      "confidence": 0.9419535,
      "end": 1419900,
      "speaker": "D",
      "start": 1351744,
      "text": "Grundsätzlich vielleicht vorneweg schicken, es ist alles erlaubt im Prinzip. Also man darf Excel, normale Excel Funktionen verwenden, man darf die Lambda Funktion, die relativ neu ist, in Excel verwenden, man darf vorgefertigte Lambda schreiben, man darf Python in Excel, was auch relativ neu ist, die Integration verwenden, man darf VBA verwenden, man darf verwenden, was man möchte, man darf auch vordefinierte Funktionen für häufige Aufgaben in Verwendung nehmen und mit denen das Ganze lösen. Praktisch gibt es ziemlich sehr, sehr viele unterschiedliche Möglichkeiten, um das zu lösen. Ein Ansatz ist es einfach in einer Form, in einer Zelle, siebzehn verschiedene Funktionen zu kombinieren zu einer und dann darüber die Lösung zu bekommen. Das ist natürlich dann aber auch sehr fehleranfällig. Man kann aber auch, gerade bei den Karten ist es oftmals möglich, dass man die Karte voll füllt mit einzelnen Zellreferenzen und sagt, wie weit ist diese Zelle von der benachbarten Zelle entfernt und dann quasi so für die gesamte Karte ermitteln, wie weit die jeweilige einzelne Zelle von der Startzelle entfernt ist. Das ist ein möglicher Ansatz, gerade für solche Karten, für solche Map Cases."
    },
    {
      "confidence": 0.9347631,
      "end": 1476326,
      "speaker": "B",
      "start": 1419980,
      "text": "Genau, das letzte, das war halt dieses iterative. Du hast halt theoretisch, du kriegst einen Zirkelbezug, wenn sich eine Zelle auf das, also sich selbst bezieht oder auf eine Zelle bezieht, die sich schon auf meine Zelle bezieht. Wenn ich in A eine Funktion habe, die sich auf B bezieht und in B auf A habe ich einen Zirkelbezug. Also wenn ich das nicht aktiviere, es gibt in den Excel Einstellungen die Möglichkeit, iterative Berechnungen zu aktivieren, dann hast du halt ein Problem und es wird halt einfach null ausgeben. Aber mit dieser iterativen Berechnung funktioniert das halt so, dass es bis zu einem Grenzwert gegen einen Wert konvergiert. In dem Fall bei der Entfernung ist es relativ einfach und dadurch hast du halt nicht das Problem, dass du null ausbekommst, sondern er kann dir halt über diese Zirkelbezüge sagen, wie weit er entfernt ist. Also du hast halt wirklich immer, du nimmst den Schritt, standardmäßig ist eins, wenn es einfach eine Zelle ist, wenn diagonal ist das noch ein bisschen anders, aber grundsätzlich, du hast halt einfach diese Funktion, die sich mehr oder weniger selber dann aufruft. Es gibt auch inzwischen eine echte Rekursion in Excel, aber in dem Fall ist es diese iterative Berechnung, die das halt relativ simpel macht, wenn man weiß wie."
    },
    {
      "confidence": 0.92824787,
      "end": 1487348,
      "speaker": "C",
      "start": 1476478,
      "text": "Und wie funktioniert die iterative Berechnung? Also wird er dann eine Zelle nach der anderen ausgeführt, da gibt es eine Reihenfolge, also wie kann ich das Ganze steuern?"
    },
    {
      "confidence": 0.93229526,
      "end": 1552542,
      "speaker": "B",
      "start": 1487444,
      "text": "Also für mich ist es spekulativ, aber von dem, wie es sich behebt, du hast halt einen Anfang. Bei dem iterativen ist es immer ein bisschen schwer nachzuvollziehen, was zuerst ausgewertet wird. Deswegen funktionieren auch Standardfunktionalitäten in Excel nicht mehr, wenn du iterative Berechnungen an hast. Also weiß nicht, ob man das geht zu Fenster, beziehungsweise es gibt verschiedene Sachen, die einfach nicht funktionieren, wenn du das an hast. Dementsprechend, da müsste ich jetzt raten, aber was halt eigentlich ist, du kannst sagen, wie oft diese Iterativität auftreten kann. Also Standard sind ein hundert Sachen und in dem Fall ist es halt einfach so, bei so einer Map, du musst ja irgendwo den Start definieren und meistens ist es halt so, dass du sagst, wenn diese Zelle der Start ist, also das kannst du einfach über eine Bedingung machen, wenn das dem Zellbezug zum Beispiel entspricht, dann möchtest du null und sonst, da wäre das, was Benni meinte, machst du einfach das Minimum von allen Zellen aussenrum erste. Das wäre genau wie du es halt machst. Und in dem Fall würde ich jetzt sagen, dass er halt zuerst mehr oder weniger diese null einmal finden muss, also er berechnet alle, die null ist der, der feststeht und aussenrum wird es dann immer weiter plus eins gerechnet. Also wenn du halt keinen Anker hast, in dem Fall ist diese null der Anker, und ich ein hundert mal einfach das Minimum plus mache, habe ich halt danach nach ein hundert Iteration einfach ein hundert drin, weil ich halt null plus ein hundert mal eins sozusagen rechne."
    },
    {
      "confidence": 0.97468823,
      "end": 1558158,
      "speaker": "D",
      "start": 1552606,
      "text": "Ich glaube Excel würde dir in dem Fall einen Fehler schmeißen, aber grundsätzlich, er rechnet tatsächlich weiter."
    },
    {
      "confidence": 0.9356994,
      "end": 1581606,
      "speaker": "B",
      "start": 1558214,
      "text": "Also wenn du keinen Anker hast, dann wird es halt immer einfach um eins weiter erhöht. Und das ist halt, manchmal wundert man sich, warum habe ich jetzt ein hundert nach der nächsten Berechnung. Also dieses Iterative heißt halt auch wieder, dass er bei jeder Änderung immer neu berechnet. Das heißt also, ich habe ein Hundert, zwei hundert, drei hundert und du hast keinen Wert, gegen den er halt läuft und deswegen musst du halt einen Anker setzen, damit er im Endeffekt nicht in die Unendlichkeit dreht."
    },
    {
      "confidence": 0.8693717,
      "end": 1592806,
      "speaker": "A",
      "start": 1581718,
      "text": "Ihr hattet gerade gesagt, es ist eigentlich alles erlaubt, VBA, Python, du sagtest gerade irgendwas von der Lambda Funktion und ist die einzige Regel, man darf Excel nicht verlassen."
    },
    {
      "confidence": 0.983134,
      "end": 1594450,
      "speaker": "B",
      "start": 1592998,
      "text": "Selbst das gibt es nicht."
    },
    {
      "confidence": 0.9062606,
      "end": 1606126,
      "speaker": "A",
      "start": 1595630,
      "text": "Das bedeutet, ich mache eine IDE auf PyCharm oder VS Code oder von mir aus auf den Texteditor, wenn ich auf Windows unterwegs bin und kann da Python rumhacken oder meine PowerShell oder ähnliches."
    },
    {
      "confidence": 0.93781346,
      "end": 1675880,
      "speaker": "B",
      "start": 1606238,
      "text": "Also python gibt es ja explizit auch eh in Excel, dementsprechend da brauchst du gar nicht irgendwie in eine andere IDE gehen. Also ich bin der Meinung, auch gehört zu haben, dass Leute schon künstliche Intelligenz genutzt haben für verschiedene Probleme grundsätzlich, in diesem Fall zum Beispiel, wo jetzt Python sehr hilfreich war, also es war ein Fall, der sehr leicht erklärt ist, er hieß auch Simple Case, weil grundsätzlich ging es darum, normale Arithmetik mit Zahlen zu machen, die aber zu groß waren, dass Excel die Präzision darstellen kann. Also Excel ist nur bis fünfzehn Stellen genau und das waren halt Zahlen, die im Endeffekt fünfzig Zeichen lang waren. Heißt also, ich hab die fünfzehn ersten Zeichen, die sind genau und danach habe ich noch fünf und dreiig Nullen gehabt, wenn ich es in eine Zahl umgewandelt habe. Deswegen waren halt diese Zahlen als Text da und du musstest halt dann diese Zahlen von mir aus addieren, subtrahieren, multiplizieren und dann die Quersumme bilden. Sehr leicht erklärt, schwer in Excel, weil es halt nicht funktioniert. Ich kann nicht einfach fünfzig Zeichenzahl plus fünfzig Zeichenzahl machen, weil halt diese Präzision nicht passt. In dem Fall war die einfachste Lösung, ich mache es in Python, weil Python hat dieses Problem nicht. Und dann gehe ich halt einfach in meine Zelle, mach pi, wandel den String in eine Zahl um, addiere, mache die Quersumme und bin fertig. Deswegen, also in dem Fall, es ist tatsächlich sehr, sehr viel einmal in Exit schon möglich und andererseits ist auch da relativ viel erlaubt."
    },
    {
      "confidence": 0.9104836,
      "end": 1700200,
      "speaker": "C",
      "start": 1675960,
      "text": "Jetzt ist mir gerade eine Frage eingefallen, weil du Genauigkeit erwähnt hast. Wir hatten gerade kürzlich die Episode zu Mainframes und da hatten wir die Diskussion, dass es eine native Implementierung gibt von Kommazahlen, also Kommastellen, gerade im Finanzwesen ja sehr wichtig. Kann Excel sowas oder hast du da immer diese Rundungsfehler? Ist ja g, klassisches Problem in der Finanzwelt eigentlich, wenn ihr jetzt schon mal Spezialisten da sitzen habt."
    },
    {
      "confidence": 0.9469313,
      "end": 1727368,
      "speaker": "B",
      "start": 1700940,
      "text": "Genau, also theoretisch, diese Rundungsfehler, die man hat, die sind nicht in dem Bereich, dass es für Finanzzahlen unbedingt bei mir zumindest wichtig ist. Einerseits sind die Beträge nicht hoch genug und diese Rundungsdifferenzen, also wenn ich jetzt an das Richtige denke, ist es halt sehr weit hinter Komma und wenn ich bei Geldbeträgen bin, runde ich halt meistens auf zwei Stellen. Dementsprechend, wenn ich jetzt die Frage richtig verstanden habe, würde ich sagen, dass es in dem Fall kein Problem ist, außer ich bin bei sehr, sehr hohen Beträgen, was bei mir öffentliche Dienst jetzt aktuell nicht der Fall ist."
    },
    {
      "confidence": 0.93588614,
      "end": 1751872,
      "speaker": "A",
      "start": 1727484,
      "text": "Das bedeutet, ich kriege die Problemstellung in Excel, ihr habt gesagt, man darf alles anwenden und ist die Lösung dann eigentlich immer nur eine Zahl oder ein Wert oder ähnliches und den trage ich dann in irgendein Formularfeld ein, Benni? Oder wie kann ich mir das vorstellen, wenn ich nicht alles in Excel lösen muss und die ganze Sache, die Lösung vielleicht auslagere, was mache ich dann mit der Antwort?"
    },
    {
      "confidence": 0.913649,
      "end": 1802444,
      "speaker": "D",
      "start": 1752016,
      "text": "Also es gibt grundsätzlich ist es eben in sieben level strukturiert, wo man jeweils einen Input hat und einen Output bekommt und dieser Output wird im Excel Sheet dann zusammen kalkuliert und zusammengerechnet und zu einem String verkettet, mehr oder weniger. Und diesen String gibt man dann als Abgabe, als Antwort in ein Onlineformular während des Wettkampfs ein. So funktioniert das im Prinzip. Das heißt, es ist grundsätzlich auch de facto möglich und auch eigentlich erlaubt, Excel zu verlassen und theoretisch, wenn man die Daten vernünftig auslesen kann und vernünftig berechnen kann, dass das Ganze in externer Software oder ähnliches, die möglicherweise dafür besser geeignet ist, zu lösen. Das Problem ist, hier muss man natürlich den Datenimport, Datenexport dann natürlich zusätzlich zeitlich bedenken und das Ganze ist zeitlich mit der halben Stunde eigentlich relativ eng bemessen."
    },
    {
      "confidence": 0.9403784,
      "end": 1832710,
      "speaker": "B",
      "start": 1802492,
      "text": "Und wichtig vielleicht in den Online Runden ist das so, da ist es halt auch sehr schwer, das nachzuvollziehen, aber in den live Finalen, also als das in Las Vegas war, da hieß es glaube ich schon, dass wir eigentlich nur in Excel machen sollen und dürfen. Aber auch da, also es gibt halt Leute, also habe den Namen jetzt nicht im Kopf, aber es gab einen, der bei den Qualifikationsrunden tatsächlich nur Python in Excel genutzt hat und damit auch sehr gut gefahren ist. Er ist zwar dann, wie gesagt, auch trotzdem noch in Excel unterwegs gewesen, aber grundsätzlich ist es halt so, man darf zu Hause, würde ich sagen, relativ viel machen, wenn es live ist, dann wird es strenger."
    },
    {
      "confidence": 0.9139419,
      "end": 1851634,
      "speaker": "A",
      "start": 1832790,
      "text": "Okay, also today I learned, Python geht in Excel. Dann die nächste wonach gewinnt man denn? Also was sind die Kriterien? Ist das time to complete, also wirklich, wer das am schnellsten macht? Gibt es Genauigkeits genauigkeitslevel oder ähnliches? Was ist das Kriterium, wonach man Punkte kriegt?"
    },
    {
      "confidence": 0.917314,
      "end": 1897070,
      "speaker": "D",
      "start": 1851682,
      "text": "BENNY also es gibt eben sieben Schwierigkeitslevel, die meistens dann eben die einzelnen Punkte sind. Insgesamt gibt es Punkte zu erreichen, ein tausend Punkte für die regulären sieben Schwierigkeitslevel und zwei hundert fünfzig für fünf separate Bonusfragen. Und das Ziel ist es, innerhalb von der gegebenen Zeit, innerhalb von dreiig Minuten, möglichst viele Punkte zu erreichen. Und ganz abhängig davon, wie schwierig der jeweilige Case ist, gibt es Cases, wo Leute die volle Punkteanzahl innerhalb von fünfzehn Minuten schaffen teilweise. Dann zählt die Zeit, in der man es completed hat. Wenn aber nach einer halben Stunde noch niemand fertig ist oder noch niemand komplett fertig ist, dann zählt die Anzahl der Punkte, die man erreicht hat, also quasi Punkte. Und bei Gleichstand zählt die Zeit, in der man das ganze erreicht."
    },
    {
      "confidence": 0.8997006,
      "end": 1908238,
      "speaker": "A",
      "start": 1897150,
      "text": "Joe du hattest gerade gesagt, eine dieser klassischen Fallstricke ist, dass Excel maximal fünfzehn Nachkommastellen berechnen kann, glaube ich waren das. Was sind denn noch so klassische Fallstricke, die eigentlich immer wieder irgendwie vorkommen?"
    },
    {
      "confidence": 0.94276464,
      "end": 1984558,
      "speaker": "B",
      "start": 1908334,
      "text": "Genau, also dieses Thema ist tatsächlich auch so ein Problem, man rechnet mit ein paar normalen Zahlen, macht sich keine Sorgen und auf einmal, also was Benni meinte, am Ende wird deine Antwort verkettet, also sprich der Textwert. Man muss ja in Excel unterscheiden, es gibt den Wert in der Zelle und es gibt das Format auf der Zelle. Meistens hast du es so, von mir aus Level eins, da gibt es zwanzig einzelne Fragen, die man möglichst mit einer halbwegs automatisierten Lösung beantwortet. Also entweder ich mache eine Formel, ich mache eine Datentabelle, irgendwas und du hast halt ein Format auf der Zelle. Wenn ich jetzt, bei mir hatte ich das ganz, ganz oft, das Format der Zelle ist so, dass ich halt einfach nur eine ganze Zahl sehe, aber der Wert dahinter ist halt keine ganze Zahl, sondern es ist eine Zahl mit Nachkommastellen, die ich aber leider nicht sehe, weil das Format halt ganze Zahl ist. Und wenn ich dann aber meine Zahlen verkette, also als Textwert angebe, sehe ich alle Nachkommazellen und habe halt dann die Antwort falsch, weil halt in dem Tool, wo man diese Antworten dann reinkopiert, also es ist meistens halt online, das heißt Flexiquiz, ich denke, das können wir sagen, da ist es halt, du hast deine Fragen, Antwort, kopierst du den Antwortenstring rein und kriegst dann halt am Ende mehr oder weniger die Punkte. Und das ist einer der Striche, allgemeinen Runden, die mir sehr, sehr oft schon ein bisschen die Beine gestellt hat, weil man halt einfach, okay, ich beantworte die Frage, ich komme aufs Beispiel, aber leider Gott, das habe ich vergessen zu runden, aber das Format sagt halt, dass alles stimmt."
    },
    {
      "confidence": 0.897143,
      "end": 2014124,
      "speaker": "A",
      "start": 1984654,
      "text": "Das ist ja was ganz Klassisches. Ich meine, Data Wert versus Datenrepräsentation, wie umgeht ihr das? Also stellt ihr erstmal das ganze Excel Sheet irgendwie, keine Ahnung, erstmal alle Zeilen, alle Spalten erst mal auf RAW Format oder auf Text um und oder ich meine, du musst das ja konstant irgendwie haben, du musst ja konstant irgendwie immer im Sinn haben, okay, das ist jetzt eine Textzelle, das ist jetzt eine Zahlzelle, das ist eine Flowzelle oder mit was ihr auch immer da agiert. Und castet ihr das dann in den Funktionen? Also sind das ganz klassische Typecasting Probleme wie in der Softwareentwicklung oder wie darf ich mir das vorstellen?"
    },
    {
      "confidence": 0.94012976,
      "end": 2111862,
      "speaker": "B",
      "start": 2014252,
      "text": "Genau, also das ist nicht ganz, also in Excel, du hast nicht, da würde ich fast sagen, es ist rb python, also du definierst ja nicht den Typen im Endeffekt von einer Zelle. Du kannst zwar das Format machen und das kann schon hilfreich sein, das Format zu entfernen, persönlich mache ich es aber nicht, weil ich halt inzwischen ein bisschen Routine halt auch wenn du das erste mal bei so einer Runde mitmachst, dann bist du von allem überfordert. Aber man lernt halt ein bisschen genauer zu lesen, man weiß auch, okay, meistens ist es irgendwas zu runden und man kennt ja auch die Probleme. Also ich habe dreimal von mir aus nicht gerundet, beim vierten Mal wird es halt dann nicht mehr passieren, weil ich mache mir meine Notizen, also klingt blöd, aber ich habe irgendwie ein hundert Seiten Notizen inzwischen in meiner OneNote, die ich halt lessons learned habe von irgendwelchen Sachen, die ich mir selber falsch gemacht habe, die ich mir irgendwo angeguckt habe. Und das hilft halt schon. Aber grundsätzlich dieses Casten, also es gibt natürlich schon dann Thematiken. Es gibt zum Beispiel Sachen, die ich mir wünschen würde. Manche Funktionen arbeiten mit Bereichen in Excel, manche nur mit dynamischen Arrays, also dynamischen, wie würde ich das übersetzen auf Deutsch? Also ein Bereich in Excel hat einen Bezug, ein Cell Bezug, aber es gibt natürlich auch diese Arrays, die keinen Bezug mehr haben. Also wenn ich zum Beispiel innerhalb von einer Funktion irgendwas berechne und das nicht ausgebe, habe ich in dieser Funktion keinen Bezug zu einer Zelle. Und zum Beispiel eine zählen wenn s Funktion kann nicht mit so einem berechneten Array, mit einem berechneten, wie auch immer man Array übersetzt, arbeiten, sondern es braucht einen Zellbezug, man kriegt halt einen Fehler. Das sind so Sachen, wo man schon aufpassen muss, mit welchem Typ Daten man arbeitet. Aber es gibt jetzt keine unbedingte. Also es gibt natürlich eine Wertfunktion, es gibt eine Text zu Wert Funktion, aber ich würde nicht sagen, dass man die Sachen casten muss, weil man sonst Probleme bekommt. Das geht."
    },
    {
      "confidence": 0.91797465,
      "end": 2142674,
      "speaker": "D",
      "start": 2111996,
      "text": "Excel ist in dem Bereich auch sehr automatisiert teilweise unterwegs. Also zum Beispiel, wenn man Zahlen wirklich als Text gespeichert hat und nicht als Zahl selbst und dann die Summe Funktion darauf anwendet, erhält man null, weil Excel mit Summe das nicht kombinieren kann. Wenn man jedoch Summe berechnet, dann wandelt das die Texte automatisiert in Zahlen und man kann mit Summe minus minus Zahlen, die als Text gespeichert sind, quasi einfach in Zahlen umwandeln und kann es so ganz simpel und einfach summieren."
    },
    {
      "confidence": 0.914334,
      "end": 2164637,
      "speaker": "C",
      "start": 2142722,
      "text": "Also ich habe in der auch kurz nachgegoogelt, Excel unterstützt es eben nicht, so wie Cobol zum Beispiel, das war unser Beispiel bei Mainframes, wenn du null Komma eins und null Komma zwei zusammenzählst, dann bekommst du halt irgendwie einen Rundungsfehler, null Komma drei und ganz hinten irgendwo eine andere Zahl. Und wenn du halt ganz viele Zahlen zusammenzählst, dann bekommst du dann durch irgendwelche Unschärfen, darum im Bankwesen natürlich ein kritisches Problem."
    },
    {
      "confidence": 0.90700096,
      "end": 2174910,
      "speaker": "A",
      "start": 2164733,
      "text": "Jetzt seid ihr im eSport Bereich. Unterwegs oder in der esport Sparte der ganzen Thematik. Wenn ich an eSport denke, denke ich an Cheater. Und jetzt frage ich mich natürlich, wie."
    },
    {
      "confidence": 0.8866608,
      "end": 2178542,
      "speaker": "C",
      "start": 2175030,
      "text": "Moment, warum denkst du da an Cheater? Wo ist da der Zusammenhang?"
    },
    {
      "confidence": 0.9183788,
      "end": 2204958,
      "speaker": "A",
      "start": 2178606,
      "text": "Ja, ich kriege immer einen auf die Mütze, wenn ich online spiele und es kann nicht sein, dass alle Leute besser als ich sind. Deswegen beschimpfe ich die als Cheater und irgendjemand fliegt dann immer vom Server mit. Bei Counter Strike heißt das wegbannen. Man wird eigentlich komplett für die Ewigkeit gesperrt und dann muss man sich einen neuen Steam Account machen. Also es ist wirklich böse. Auf jeden Fall passiert das ab und zu mal. Und da habe ich mich natürlich gefragt, kann man bei Excel eSport eigentlich auch schicken?"
    },
    {
      "confidence": 0.938005,
      "end": 2210814,
      "speaker": "C",
      "start": 2204974,
      "text": "Benjamin, ich glaube, das muss jetzt schon beantworten, weil bei uns in Österreich, wir machen das nicht. Also, oder Benni?"
    },
    {
      "confidence": 0.92437845,
      "end": 2215130,
      "speaker": "D",
      "start": 2210942,
      "text": "Austria ist too small country for good doping, sage ich da nur. Also."
    },
    {
      "confidence": 0.9579783,
      "end": 2219390,
      "speaker": "C",
      "start": 2217750,
      "text": "Den verstehen jetzt nur Insider, aber."
    },
    {
      "confidence": 0.73072,
      "end": 2220010,
      "speaker": "D",
      "start": 2219430,
      "text": "Ja."
    },
    {
      "confidence": 0.97630286,
      "end": 2224650,
      "speaker": "A",
      "start": 2222150,
      "text": "Hol uns mal ab. Ich verstehe nicht."
    },
    {
      "confidence": 0.89350134,
      "end": 2242692,
      "speaker": "D",
      "start": 2225020,
      "text": "Das war ein Ausspruch vom ehemaligen ÖSV, also österreichischen Skiverband Präsident. Nachdem ein Doping Skandal bei den österreichischen Langläufern und Biathleten bei den olympischen Spielen zwei tausend sechs, glaube ich, aufgetreten ist, hat er den Ausspruch getätigt. Austria so too small country for good doping."
    },
    {
      "confidence": 0.9252634,
      "end": 2254468,
      "speaker": "A",
      "start": 2242756,
      "text": "Ja, okay. Ich glaube, über Doping sollten sich die Deutschen auch nicht wirklich beschweren, wenn wir Jan Ulrich ansehen und Co. Deswegen schieben wir das Thema mal beiseite. Lass uns mal weg von den ganzen Substanzen, sondern eher hin zu Sheets gehen. Kann man bei Excel cheaten?"
    },
    {
      "confidence": 0.91590565,
      "end": 2314332,
      "speaker": "D",
      "start": 2254564,
      "text": "Also ich glaube, mit Substanzen ist es auch jetzt nicht so erfolgreich, damit zu dopen oder zu cheaten. Aber wir hatten letztes Jahr, also zwei tausend vier und zwanzig, einen Cheating Skandal mehr oder weniger. Und zwar hat einer, ein Teilnehmer bereits im Vorhinein, also vor den Aufgaben, die Aufgaben erhalten und daraufhin, wenn man die Aufgaben natürlich bereits im Vorhinein hat, dann kann man natürlich bereits seine Lösungen vorbereiten und die entsprechenden Modelle erstellen und ist dann natürlich nicht nur deutlich schneller, sondern auch natürlich deutlich besser und deutlich richtiger unterwegs. Und daraufhin hat dann ein Teilnehmer aus Madagaskar, der im Vorhinein diese Aufgaben durch Tester erhalten hat, sich bereits seine Aufgaben vorbereiten können und war dann auf einmal die beiden Bewerber davor nicht so überragend. Und dann hat er drei, vier mal hintereinander die volle Punkteanzahl. Und daraufhin kam dann raus, dass er die Aufgaben im Vorhinein hatte und wurde dann für die gesamte Saison letztes Jahr und aktuell auch für diese Saison disqualifiziert."
    },
    {
      "confidence": 0.9298388,
      "end": 2318968,
      "speaker": "A",
      "start": 2314426,
      "text": "Gegen wie viele Leute tretet ihr da so an? Wie groß ist die excel Weltmeisterschaft Szene."
    },
    {
      "confidence": 0.9260355,
      "end": 2344120,
      "speaker": "D",
      "start": 2319064,
      "text": "Also auf der Studentenweltmeisterschaft steht, dass sich Leute angemeldet haben. Ich glaube, bei den wenigsten Wettbewerben nehmen aber volle Teilnehmer teil, aber es wächst zunehmend. Also im Schnitt bei den Online Runden haben wir vier hundert Teilnehmer, sowas um den Dreh. Bei der finalen Weltmeisterschaft, bei der finalen Qualifikationsrunde kann es dann auch schon in die ein tausend Teilnehmer hineingehen."
    },
    {
      "confidence": 0.899674,
      "end": 2368148,
      "speaker": "C",
      "start": 2344280,
      "text": "Und wenn ihr da jetzt so eine Weltmeisterschaft habt und dort teilnimmt, bereitet man sich dann da irgendwie vor, ganz viel Isostar trinken oder also vielleicht auch eher auf der inhaltlichen Seite, macht man dann ganz viele Excel Übungen vorab oder trainiert man das das ganze Jahr oder wie sieht es aus? Ist es wirklich ein Sport in dem Sinne? Denkt ihr jetzt schon an die nächste Meisterschaft?"
    },
    {
      "confidence": 0.93487775,
      "end": 2458808,
      "speaker": "B",
      "start": 2368244,
      "text": "Grundsätzlich bei mir ja, ich denke schon dran. Also mir macht das halt Spaß und man lernt halt viel. Und dieses sich selbst weiterentwickeln war mir früher nicht unbedingt wichtig, aber es fing halt dann an. Und wie gesagt, das macht unglaublich spaß. Und grundsätzlich ist es bei mir so, ich übe schon sehr viel. Also es geht halt darum, vergangene Fälle zu machen. Es gibt inzwischen eine gute dreistellige Zahl an Fällen, die man halt machen kann, schon allein in diesem FMWC Universum. Dann ist es halt einfach, diese Dinge kann man üben, schnappt man sich, guckt, ob man eine Lösung findet und man lernt dadurch dann verschiedene Funktionen kennen. Mit dem, was Benni meinte, es gibt ja inzwischen auch relativ neue, sehr, sehr starke Funktionen, die es auch erlauben, die eigene Formeln dann zu erstellen. Also eine Funktion ist was, was ich aufrufe, eine Formel ist was, wo ich ein bisschen andere Logik noch mit reinbringe. Die let Funktion wäre da zu nennen. Mit let, wie auch in anderen Sprachen, kann ich halt Sachen benennen und dann halt eine Berechnung mir sozusagen für später merken aufrufen und kann halt so sehr komplexe Sachen innerhalb von einer Zelle berechnen. Also gibt halt diesen Single Cell Report, der dann das ganze Blatt von mir aus befüllt, weil ich halt diese eine Zelle so komplex, so gut kompakt aber geschrieben habe, dass es halt die ganze Logik reinbringt. Und diese Sachen übt man also bei mir relativ viel, auch auf Arbeit halt, wenn ich halt Probleme habe. Und zum Beispiel gibt ja auch Power Query als Teil von Excel. Wenn ich sage, ich möchte jetzt Power Query üben als Teil von meiner, ja, von meinem wachsenden Excel, wie auch immer, dann kann ich halt, oder mache ich das halt so, dass ich mir sage, ich benutze jetzt nicht die Dinge, die ich schon kenne, sondern ich gehe in dieses Teil von Excel rein, wo ich vielleicht noch nicht so stark bin und probiere dann die Probleme halt in dem Tool zu lösen."
    },
    {
      "confidence": 0.9293936,
      "end": 2473928,
      "speaker": "C",
      "start": 2458984,
      "text": "Ein Freund von mir war mal so verrückt und hat bei Advent of Code Excel verwendet zum lösen der ganzen Aufgaben. Er ist nicht so weit gekommen, aber es war ein Data Scientist und er wollte es unbedingt machen. Macht ihr das dann auch? Verwendet ihr Excel für Advent of code? Habt ihr das mal probiert?"
    },
    {
      "confidence": 0.9427194,
      "end": 2531290,
      "speaker": "B",
      "start": 2474024,
      "text": "Ich schon, ja. Also ich habe das bei uns gibt jemanden, der, also sein YouTube Kanal heißt Excel Wizard, ist halt auch ein tatsächlicher Excel Wizard. Also er ist, wenn es rein um diese Excel Fähigkeiten geht, einer stärksten Leute, an die ich denke, wenn ich halt an Excel Profi denke. Und der macht das halt jedes Jahr. Und manche von den Problemen hat er jetzt auch noch nicht. Also in vier und zwanzig hing er zum Beispiel sehr lang an Tag siebzehn, unabhängig was für ein Problem ist, aber er hat das alles geschafft und er macht dann halt wirklich das meistens auch in einer Single Cell. Also das ist immer noch die Highbar. Also Low Bar ist erstmal überhaupt das Problem zu lösen und dann geht es darum, wie optimiere ich das und wie kriege ich am Ende eine Formel, wo ich einfach nur mein Input mache und dann alles fertig ist. Und da genau, also ich mache das auch, habe halt oft auch mal ein paar Stunden drin gesessen. Ab und zu komme ich auch nicht weiter. Dann habe ich ja aber zum Glück diesen Excel Wizard, wo ich mir das Video angucke und dann geht es mir halt immer darum, ich brauche den Ansatz und wenn ich dann weiß, so kann ich rangehen, versuche ich es auch mal selber und meistens klappt es dann halt auch. Und wenn nicht, gucke ich halt weiter."
    },
    {
      "confidence": 0.93538535,
      "end": 2560026,
      "speaker": "A",
      "start": 2532230,
      "text": "Moment mal, du sagtest gerade highbar und dann gibt es ja wahrscheinlich hoffentlich auch eine low bar. Also du möchtest mir sagen, ihr selbst klassifiziert den Lösungsweg selbst noch mal in WoW. Hut ab, das ist eine mega geile Lösung. Und okay, das Python Skript hätte jetzt jeder schreiben können. Und da ist die high bar wirklich dieses verschachtelte Funktion in Funktion in Funktion in einer Zelle, das ist die Königsklasse. Ist das richtig, Benjamin?"
    },
    {
      "confidence": 0.91411656,
      "end": 2599204,
      "speaker": "D",
      "start": 2560138,
      "text": "Ja, also das ist auf Alle Fälle gibt es da wirklich Experten. Der Excel Wizard ist einer von denen. Diamond Ali ist ein anderer Vertreter mehr oder weniger dieser Schule, die wirklich, wo man dann teilweise vor den YouTube Videos sitzt und sich denkt, als selbst, der sich ja durchaus auch relativ gut mit Excel auskennt. Wie bitte? Was zur Hölle machst du da und wie funktioniert das Ganze? Hier und dann probiert man selbst aus und kommt dann auch auf ähnliche Ansätze, aber denkt sich, das ist wirklich eine unglaubliche Lösung, die wirklich einfach sehr, sehr toll ist und man wirklich nur in Staunen gerät. Und atemberaubend, wie Shaw in der Einführung."
    },
    {
      "confidence": 0.91995114,
      "end": 2624160,
      "speaker": "A",
      "start": 2599252,
      "text": "Gesagt hat, bevor wir miteinander geschrieben haben, habe ich euch natürlich auch gegoogelt, um zu gucken, okay, wie viel public Information finde ich denn? Und da bin ich speziell über Johns Namen ziemlich viel über YouTube Kommentare gestolpert. Also es scheint auch wirklich so, als gibt es eine rege Excel Weltmeisterschafts Community, die sich dann die Lösungswege auch gegenseitig anschaut und dann auch auf die Videos kommentiert. Ist das richtig?"
    },
    {
      "confidence": 0.94643533,
      "end": 2660088,
      "speaker": "B",
      "start": 2624340,
      "text": "Das ist sehr richtig, genau. Es gibt inzwischen relativ viele Kanäle, auch am Anfang, also für mich, der große war Diamond Early, der auch letztes Jahr zum Beispiel diesen Financial modeling World Cup gewonnen hat. Der ist halt, wie Benni gerade meinte, einer von den Leuten, wo man auch, oh mein Gott, verrückt. Und die teilen halt ihr Wissen wirklich offen auch. Also es gibt viele Leute, die verschiedenen Ansätze und man kann dann das alles für sich aufnehmen und damit dann lernen und wachsen. Und das ist wirklich, also für mich war das Game Changer, die Leute, die Community, das Wissen darunter. Also sehr, sehr beeindruckend."
    },
    {
      "confidence": 0.97409564,
      "end": 2666952,
      "speaker": "A",
      "start": 2660184,
      "text": "Du hattest gerade schon gesagt, es gibt diese let Funktion. Du hast so beschrieben, als kann man da irgendwie so eine Variable deklarieren."
    },
    {
      "confidence": 0.971396,
      "end": 2668460,
      "speaker": "B",
      "start": 2667016,
      "text": "Ja, nicht nur eine. Genau."
    },
    {
      "confidence": 0.93695855,
      "end": 2687668,
      "speaker": "A",
      "start": 2668880,
      "text": "Was würdest du sagen, und das klingt jetzt so stereotypenhaft, was sind die fünf besten oder vielleicht sogar unterschätzten Funktionen, die ihr so kennt, wo ihr sagt, okay, das ist so eine Funktion, die habe ich letzte Tage auf der Arbeit ausgepackt und da sind allen Leuten die Kinnlatte runtergefallen. Oder im Wirtschaftsinformatikstudium beim Benjamin."
    },
    {
      "confidence": 0.95062566,
      "end": 2761716,
      "speaker": "B",
      "start": 2687764,
      "text": "Es ist schwer. Es gibt viele neue Funktionen, die sehr, sehr mächtig sind. Wenn ich sagen würde unterschätzt, also persönlich muss ich ein bisschen, ist ein bisschen ein Cop out, aber ich finde, wenn mit Boolean Logik sehr stark, weil grundsätzlich in Excel ist es so, dass jede Zahl, die nicht null ist, als wahr ausgewertet wird. Also zum Beispiel minus null, Komma fünf wird als wahr ausgewertet, null wird halt als falsch ausgewertet. Und dann kann ich halt mit mathematischen Berechnungen mir Sachen ermöglichen, die gegebenenfalls über eine Funktion nicht möglich sind. Also es gibt ja die und Funktion und ist vom logischen her ein Produkt, weil wenn ich sage, ich habe eins und eins, muss beides wahr sein, damit es im Nachhinein immer noch wahr ist. Ein und, ein oder wäre eine Addition. Und wenn ich und aber nutze, ist es ein Aggregator, also eine und Funktion, gibt dir grundsätzlich nur ein Ergebnis aus, so wie eine Summe. Es ist egal, wie viele Zahlen ich habe, wenn ich die Summe nehme, kriege ich ein Ergebnis aus. Es ist egal, wie viele Boolean, also Logikwerte ich habe. Ein und gibt mir entweder wahr oder falsch aus. Mit dieser Boolean Logik in dem Sinne kann ich aber halt Zahlen addieren und multiplizieren und kann damit halt Berechnungen machen, die früher gar nicht gingen. Inzwischen gehen sie über den Umweg, aber damit hat man halt wirklich die Möglichkeit, Dinge zu machen, die vorher relativ komplex waren. Deswegen bin ich einfach bei der Standard wenn Funktion mit dieser Boolean Logik."
    },
    {
      "confidence": 0.764572,
      "end": 2762900,
      "speaker": "A",
      "start": 2761748,
      "text": "Benni, was ist dein Highlight?"
    },
    {
      "confidence": 0.91521466,
      "end": 2796356,
      "speaker": "D",
      "start": 2762980,
      "text": "Ich würde einfach mal noch definitiv eine Menschen für Let, was Shaw eben vorher schon erwähnt hat, und Lambda, was wir auch vorhin bereits erwähnt haben. Darüber hinaus bin ich noch ein sehr, sehr großer Fan der relativ neuen Filterfunktion. Hört sich auch sehr, sehr unspektakulär an, weil man filtern kann man ja einfach mit Klick. Der entscheidende Punkt ist zum Beispiel, man hat einen Datensatz, wo ein Name zehnmal vorkommt und mit einem klassischen Sverweis, der ja mittlerweile auch durch einen x Verweis deutlich besser ersetzt geworden ist. Ich habe jetzt ein paar Funktionen moment."
    },
    {
      "confidence": 0.942866,
      "end": 2797464,
      "speaker": "C",
      "start": 2796388,
      "text": "Was ist der x Verw."
    },
    {
      "confidence": 0.932291,
      "end": 2869990,
      "speaker": "D",
      "start": 2797612,
      "text": "Der x Verweis ist der Sverweis in besser? Also zum einen, wenn man die Sverweislogik kennt, dann muss man einen Suchwert eingeben und einen Array und dann die Rückgabezelle. Das heißt, man braucht quasi einen Array, in dem man sucht und da muss der Wert, den man sucht, immer in der linkesten Zelle sein und der Rückgabewert kann immer nur rechts davon stehen. Mit x Verweis gibt man einen separaten Sucharray an und einen separaten Rückgabe Array. Das heißt er er kann rechts stehen, er kann links stehen, er kann aber auf einem komplett anderen Sheet sein. Einfach ausführen kann sein Tabellenblatt, kann der Rückgabewert stehen. Das ist der große Vorteil von Xverweis. Das Problem ist, wenn wir jetzt einen Datensatz haben, wo jetzt zehn Namen drin stehen und die und der gesamte Datensatz hat zwanzig, dann bekomme ich immer mit xlookup oder xverweis nur den ersten oder den letzten, je nachdem welchen Modus ich verwende. Mit Filter kann ich den gesamten Datensatz allerdings filtern nach dem Namen und ich erhalte dann genau alle Ergebnisse, wo dieser entsprechende Name vorhanden ist. Und das ist über eine dynamische Funktion. Als ich das das erste Mal herausgefunden habe, war das tatsächlich auch sehr überraschend für mich, dass das geht. Und das geht tatsächlich auch eben noch nicht allzu lange."
    },
    {
      "confidence": 0.9063611,
      "end": 2908428,
      "speaker": "A",
      "start": 2870150,
      "text": "Ich möchte allen Hörerinnen und Hörern nur noch mal kurz einen Einblick in diese Aufnahme hier geben. Benjamin hat gerade über die Filterfunktion gesprochen und man sieht bei den beiden hier, bei Jean, bei Benny, unglaublich das Feuer in den Augen. Benni hat über die Filterfunktion gesprochen und Jo ist am nicken und Daumen hoch zeigen. Richtig, richtig geil, Jungs. Ich finde das, ich find euch klasse. Man sieht euch an, ihr sprecht über ein Herzensthema, ihr brennt dafür und das begeistert mich. Ich grinse und nehme mir das nicht übel. Ich mache mich nicht darüber lustig. Ich finde das einfach nur beneidenswert, wie man sich dafür begeistern kann. Ich finde das Wahnsinn. Hut ab. Richtig, richtig geile Sache."
    },
    {
      "confidence": 0.92838645,
      "end": 2953050,
      "speaker": "B",
      "start": 2908524,
      "text": "Ich würde noch hinzufügen zur Filterfunktion bei dem Autofilter, den Benni angesprochen hat. Also Autofilter ist es, wo ich die Möglichkeit habe, auf dieses kleine Dropdown und ich wähle mein Objekt, da kann man nur ein logisches Unfilter. Ich habe nicht die Möglichkeit, ein oder zu filtern. Also wenn ich sage, ich habe von mir aus eine Spalte Geschlecht, grenzen wir es ein auf männlich und weiblich und habe das Alter. Wenn ich sage, ich möchte Frauen oder über fünfzig, kann ich das mit dem Autofilter schon nicht machen, weil sobald ich auf Frau gefiltert habe, ist alles, was männlich ist, auch wenn es vielleicht über fünfzig war, schon weg. Das funktioniert mit einer Filterlogik, die halt auch diese Boolean Logik, die ich beschrieben habe, genutzt hat oder nutzt, weil ich halt die Werte addiert kann. Deswegen ist es schon, wie Benni sagte, auch eine von diesen gamechanger Funktionen, wenn man das so sagen möchte, weil es halt Sachen ermöglicht, die vorher schwerer waren."
    },
    {
      "confidence": 0.90501046,
      "end": 2977750,
      "speaker": "A",
      "start": 2953210,
      "text": "Jetzt sprecht ihr die ganze Zeit von den deutschen Funktionsnamen und ich als Excel Noob bin da schon mal drüber gestolpert, beziehungsweise ist bei Google Sheets ab und zu auch so, dass wenn ich die deutschen Funktionsnamen nutze, dass sie nicht existieren und dann muss ich die englischen Funktionsnamen nutzen. Gibt es sowas bei Excel auch oder gibt es so eine Einstellung ja, ich nutze jetzt deutsche Funktionsnamen, weil die sitzt ja in Las Vegas vor einem Computer und ich gehe stark davon aus, dass es ein englischer eingestellt."
    },
    {
      "confidence": 0.92274344,
      "end": 3077890,
      "speaker": "D",
      "start": 2977910,
      "text": "Also es gibt deutsche und englische Funktionsnamen, ganz grundsätzlich. Zum Beispiel, ich habe es vorhin xverweis, xlookup ist der englische Name, Vlogup ist der englische Name für Sverweis und so weiter. Es gibt einige Funktionen, let zum Beispiel heißt, glaube ich, im Deutschen auch let und im Englischen auch let. Also es gibt welche, wo es genau gleich ist, welche, wo es eben unterschiedlich ist. Ich für meinen Teil habe, bis ich angefangen habe, Excel wettbewerbsmäßig, um es mal so zu formulieren, habe ich die deutschen Funktionen verwendet, weil ich die einfach gelernt habe, die kannte. Und dann in Vorbereitung auf das Finale von der Studentenweltmeisterschaft, nicht letztes Jahr, sondern das Jahr davor, also zwei tausend, drei und zwanzig, wurde uns gesagt, wir müssen vor Ort die englischen Funktionen verwenden. War damals auch so. Und daraufhin habe ich mein Excel dann komplett geswitcht und bin auf die englischen Funktionen umgestiegen. Deswegen weiß ich gerade auch bei den neueren Funktionen teilweise nicht, wie die deutschen Namen dazu sind. Was aber tatsächlich vorhat, hat das alles geklappt und seitdem bin ich eigentlich komplett auf Englisch. Was aber tatsächlich auch noch eine andere Herausforderung, besonders vor Ort in Las Vegas letztes Jahr war, ist de facto, dass es im deutschen Excel das Semikolon, das Trennzeichen e bei Funktionen ist. Und im Englischen ist es grundsätzlich ein normales Komma und ein Punkt ist das Trennzeichen zwischen zwei Zahlen, was bei uns das Komma ist. Und das Ganze ist dann natürlich insbesondere in Kombination mit einer englischen Tastaturlayout eine sehr, sehr große Herausforderung. Es war aber in Las Vegas erlaubt, dass wir sowohl unsere eigene Tastatur mitnehmen, als auch vor Ort alle Einstellungen, auf die wir Lust haben, in Excel lokal ändern. Das heißt, ich habe vor Ort zwar mit englischen Funktionen, aber mit Semikolon als Trennzeichen und auch mit meiner eigenen Tastatur, die ich über den Atlantik mitgenommen habe, gespielt."
    },
    {
      "confidence": 0.8918276,
      "end": 3127434,
      "speaker": "A",
      "start": 3077970,
      "text": "Okay, eigene Tastatur, kommen wir mal wieder zurück zum Thema Sheeten. Und zwar hatten wir mal eine Podcast Episode zum Thema mechanische Keyboards. Ich weiß nicht, wie firmen ihr mit mechanischen Keyboards seid. Achtung, firm ist jetzt auch ein Wortwitz. Wortwitz ist kein Wortwitz, wenn ich ihnen erkläre. Wie dem auch sei, wenn man eine mechanische Tastatur aber selbst zusammenba dann kann man auch eine custom Firmware auf die Tastatur spielen und dann kannst du auf die Firmware natürlich auch deine Makros und Shortcuts und alles drum und dran machen. Du kannst also eigentlich deine Tastenanschläge programmieren. Und das bedeutet natürlich, dass du da kurzum deine Shortcuts machen kannst und dann Vorsachen programmieren kannst. Aber ich glaube, das kann man, glaube ich, bei Excel bei der Weltmeisterschaft sowieso, oder? Du hast gerade gesagt, du darfst irgendwie prädefinierte Funktionen mit reinnehmen. Spielt die auf dem USB Stick ein oder wie da vielleicht was vorstellen?"
    },
    {
      "confidence": 0.9056045,
      "end": 3156266,
      "speaker": "D",
      "start": 3127482,
      "text": "Ja, im Prinzip werden die einfach ganz regulär über USB Stick oder sonstige Drive oder ähnliche Datenquellen einfach auf den Rechner gespielt. Das ist dann im Prinzip ein Excel File, was man dann ganz einfach importiert in das Wettbewerbs File. Und in dem Fall sind dann einfach alle benutzerdefinierten Funktionen, ich hab dreiig vierzig solche benutzerdefinierten Funktionen aktuell wahrscheinlich und die spielt man sich dann quasi so hinein und sind dann einfach im Excel sofort verfügbar. Verfügbar inklusive gegebenenfalls auch Makros oder ähnliche."
    },
    {
      "confidence": 0.99382,
      "end": 3157818,
      "speaker": "A",
      "start": 3156378,
      "text": "Was sind das für Funktionen?"
    },
    {
      "confidence": 0.9123285,
      "end": 3232198,
      "speaker": "D",
      "start": 3157914,
      "text": "Das sind diverseste Funktionen. Also manche zum Beispiel ist einfach, ich habe eine Funktion, die ich xmin genannt habe, das ist einfach ein für mein Gefühl besseres Min Funktion, also das ist eine Min Funktion, also den Minimalwert herauszulesen, aber gleichzeitig ist relativ oft auch die Fragestellung bei Bonusfragen von allen Aufgaben, bei welchem Wert ist der niedrigste Eingabewert? Gib aber nicht den Eingabewert zurück, sondern die Game Number. Das heißt, ich mache quasi einen Look up mit dem min und damit ich da nicht drei Funktionen schreiben muss, habe ich das quasi in eine Funktion gepackt und damit gebe ich nur einfach den minarray und den Rückgabe Array. Es gibt aber auch komplexere, deutlich komplexere Funktionen, zum Beispiel habe ich einen Maze Solver Lambda, was im Prinzip eine Eingabezelle mir gibt, dann aufgrund dieser Eingabezelle alle umliegenden Zellen absucht und mir die Zellenadresse der niedrigsten oder der maximalen oder was auch immer ich dann für Eingaben eben tätige, die Zellenadresse dessen gebe. Das heißt, wenn ich jetzt zum Beispiel eine Aufgabe habe, wo ich irgendeine Maze, also ein Labyrinth lösen muss, dann kann ich das damit deutlich einfacher lösen und das ist dann wirklich auch ein Gamechanger."
    },
    {
      "confidence": 0.869054,
      "end": 3243000,
      "speaker": "C",
      "start": 3232294,
      "text": "Was ist denn Lambda Funktion? Weil ihr das jetzt schon ein paar mal erwähnt habt, ich kenne das aus Python zum Beispiel oder halt Amazon Lambda, also irgendwie funktional meistens. Was heißt das bei Excel?"
    },
    {
      "confidence": 0.92515,
      "end": 3315192,
      "speaker": "B",
      "start": 3243080,
      "text": "Ja, Lambda ist eine Funktion, wo du deine eigene Logik mitschreiben kannst. Also im Endeffekt hast du die Möglichkeit halt Lambda, gibst dir parameter, wie du möchtest, baust deine eigene Logik ein und kannst sie dann in dem Fall, wie Benny's jetzt meinte, benennen und kannst sie dann wie eine ganz normale Funktion aufrufen. Also Lambda erlaubt es dir, eigene Funktionen zu schreiben im Endeffekt. Man kann damit echte Rekursionen in Excel einbauen, man kann damit halt einfach eine neue Funktion, zum Beispiel auch im Standard, du hast ein Wort und möchtest das in alle Buchstaben aufteilen, gibt es halt nicht standardmäßig. Es gibt da zwei Möglichkeiten, es gibt ja inzwischen Regex und Excel, darüber kann man es machen. Oder man nutzt den Trick Teilsequenzlänge aber es ist halt nicht unbedingt Standard. Und dafür kannst du halt ein Lambda machen, wo du dann halt sagst, okay, das ist der Input, mein Text, und den möchte ich halt als Ausgabe spillen, jeden einzelnen Buchstaben. Und damit ich halt nicht immer Teilsequenzlänge oder Regex extrahieren, ist es in meinem Fall, weil ich ex auf Deutsch habe, kann ich das halt als Lambda von mir aus Letters oder Buchstaben oder irgendwas nennen und habe dann mein Buchstaben ist gleich, übergebe den Text und kriege die Antwort. Und das ist auch dieses Mace Solver, wo halt wahrscheinlich vielleicht ein Reduce, vielleicht auch eine Rekursion, weiß ich nicht, aber da ist wahrscheinlich was drin, was ihm halt erlaubt, im Endeffekt diese Zellen, die wir vorhin über dieses iterative navigiert haben, per Formel zu navigieren."
    },
    {
      "confidence": 0.95171946,
      "end": 3319368,
      "speaker": "C",
      "start": 3315336,
      "text": "Aber so ein x min ist dann auch lambda, also ist einfach ein anderer Name für Custom Function."
    },
    {
      "confidence": 0.797015,
      "end": 3320568,
      "speaker": "B",
      "start": 3319464,
      "text": "Korrekt, ja."
    },
    {
      "confidence": 0.9602663,
      "end": 3325976,
      "speaker": "D",
      "start": 3320704,
      "text": "Das ist der Name, den ich dort quasi dann eben hinzugefügt habe oder unter dem ich es benannt hab."
    },
    {
      "confidence": 0.9398213,
      "end": 3337602,
      "speaker": "A",
      "start": 3326048,
      "text": "Würdet ihr sagen, eure Custom Funktion sind auch die Funktionen, die ihr in Excel vermisst, oder würdet ihr. Oh ne, da gibt es schon noch ein paar, ein, zwei, drei Sachen, die ich wirklich, wirklich in Excel vermisse."
    },
    {
      "confidence": 0.9340143,
      "end": 3450418,
      "speaker": "B",
      "start": 3337666,
      "text": "Grundsätzlich ist es so, dass du mit Lambda extrem viel machen kannst. Also Beispiel, diese Buchstaben auslesen, das ist schon ein Problem, was halt, es gibt keine Standardmöglichkeit, es gibt keine Funktion, die mir das einfach macht, außer ich weiß, wie regex funktioniert. Aber es ist halt schon so, dass die Lambda jetzt alles ermöglicht. Ich habe deswegen, ich würde sagen, nicht unbedingt den Wunsch, dass mir noch eine extra Funktion eingebaut wird, sondern es gibt so eher konzeptionell Themen. Also es gibt dieses Problem, in Google Sheets gibt es das meiner Meinung nach nicht. Es gibt dieses Array of Array Thema, also wenn ich in Excel ein Array habe, also etwas, was mehr als eine Zelle von mir aus groß ist, und dann darüber eine Berechnung mache, die auch mehrere Zellen groß ist, habe ich ein Array of Array und kriege halt einen Fehler. Das wäre zum Beispiel ein Thema, wo man halt aktuell, man kann es mit Zanken umgehen, man kann es mit verschiedenen Sachen umgehen, aber es ist nichts unbedingt, was halt greifbar ist für den, nicht mal nur normalo, sondern auch für Leute, die da bei mir zum Beispiel, also Thunks habe ich immer noch nicht so ganz verstanden, dementsprechend, das wäre so ein Thema, dass halt Arrays von Arrays erlaubt sind. Mir wäre wichtig, zehn wenns hatte ich vorhin gesagt, es gibt halt Funktionen, die arbeiten nur mit Bezügen also mit Zellbezügen. Es gibt Funktionen, die arbeiten nur mit Arrays. Es ist relativ, also da würde ich schon sagen, nicht mehr neu, aber es gibt seit, ich glaube, Excel zwei tausend neunzehn eine neue Rechenengine in Excel. Früher mussten alle Array Operationen mit Strg Shift Enter abgeschlossen werden. Inzwischen können Funktionen überlaufen. Das ist immer das, wenn man, also es gibt neuen Fehler, auf Englisch spill, auf Deutsch Überlauf. Und das ist halt, wenn irgendwas im Weg ist. Und auch da halt, es ist nicht unbedingt alles vereinheitlicht. Es gibt Funktionen, die können standardmäßig spillen. Allein gibt es eine Funktion, die kann ich spillen, weil sie halt mit der range nichts billen kann. Ich muss die range in Array umwandeln und dann kann spillen. Deswegen, das sind die großen Themen und vermutlich Fehlerbeschreibung in Excel. Du kriegst zwar einen Fehler, dann steht da von mir aus Zahl oder Spill, aber es ist halt nicht immer selbsterklärend. Da würde ich mir noch wünschen, dass dort Verbesserungen kommen."
    },
    {
      "confidence": 0.87247777,
      "end": 3455154,
      "speaker": "C",
      "start": 3450514,
      "text": "Benni, hast du noch ganz dringende Wünsche an Microsoft?"
    },
    {
      "confidence": 0.9407875,
      "end": 3499708,
      "speaker": "D",
      "start": 3455282,
      "text": "Also ich kann mich shorter definitiv anschließen. Das sind auch Themen, die ich mir auch persönlich wünschen würde, aber ein Großteil dessen, man muss benutzerneffiziente Funktionen wünschen, natürlich. Manche würde ich mir einfach direkt wünschen, manche sind dann doch sehr, sehr spezifisch und speziell, die nur ich verwende. Die wird Microsoft aller Voraussicht nach weder einbauen noch einbauen sollen. Eine ganz banale, einfache Thema, die ich mir persönlich wünschen würde, ist, dass das zweite Argument bei Runden optional ist. Also wenn man gleich Runden eingibt, muss man zu Beginn die Zahl eingeben und dahinter die Anzahl der Stellen. Und ich würde mir einfach persönlich wünschen, dass das zweite Argument optional ist und wenn ich keines davon einge auf null Stellen. Das ist etwas ganz Banales, was ich mir sehr gerne wünschen würde."
    },
    {
      "confidence": 0.9116804,
      "end": 3519100,
      "speaker": "C",
      "start": 3499804,
      "text": "Eure Custom Functions, die ihr da schreibt, sind die eigentlich dann wieder andere Excel Functions oder schreibt ihr die dann in Python, sind es dann Makros? Also habt ihr da irgendwie bevorzugte Sprache oder ist es, dass man möglichst nah am Excel Core bleibt? Ist das so eine Philosophie dann vielleicht?"
    },
    {
      "confidence": 0.9371345,
      "end": 3543710,
      "speaker": "D",
      "start": 3519260,
      "text": "Also die Lambda Funktionen tatsächlich sind andere excel Funktionen, die kann man theoretisch, also das ganze als Lambda ist zu speichern, im Namensmanager zu speichern, ist eigentlich nur eine Vereinfachung, dass man es deutlich einfacher zur Hand hat. Man kann auch diese dann meistens sehr, sehr lange Funktion auch einfach in eine ganz normale Zelle schreiben und dahinter mit Klammer auf und die Eingabewerte eingeben. Das kann man genauso gut auch einfach machen, ist halt nur deutlich ineffizienter."
    },
    {
      "confidence": 0.9374585,
      "end": 3578970,
      "speaker": "B",
      "start": 3543790,
      "text": "Genau, also man kann das wirklich alles über Lambda machen. Was vielleicht noch wichtig ist bei der Weltmeisterschaft war auch Tool, also ein Add in, weil wir hatten ja dieses Keyboard, was ich mir gegebenenfalls selbst programmieren kann. Es gibt ein Tool, in dem Fall OA Robot, was ich glaube auch teilweise mit gesponsert hat. Das ist ein Tool für Micro Automation. Da kann ich mir auch nochmal eigene Funktionen schreiben, die ich halt per Knopfdruck einfüge. Ich kann Makros, die gar nicht in meiner Arbeitsmappe drin sind, ausführen in der offenen Mappe durch dieses Tool. Also es ist halt wirklich schon diese Schnelligkeit, die durch externe Tools, die durch diese Custom Funktion gegeben wird, das ist schon ein großer, großer Faktor."
    },
    {
      "confidence": 0.9054,
      "end": 3613962,
      "speaker": "C",
      "start": 3579050,
      "text": "Wenn du sagst, es kommen jetzt noch externe Tools dazu und so weiter, da frage ich mich natürlich jetzt als klassischer Informatiker und ihr seid ja auch Mathe Informatiker, ihr kennt programmieren, ihr könntet programmieren und ihr habt ja auch erwähnt, es gibt Python in Excel. Irgendwann stellt man sich ja die warum Excel überhaupt? Also kann ich da nicht gleich Python eigentlich verwenden im Hintergrund? Dann bin ich schneller, dann habe ich nicht diese ganzen Probleme, dass sie bei Runden eben nicht eingeben kann, dass sie für zwei Stellen, auf welche Stellen ich runden will oder dass ich dann externe Tools noch brauche. Also warum dann überhaupt noch Excel eigentlich?"
    },
    {
      "confidence": 0.9157114,
      "end": 3678526,
      "speaker": "B",
      "start": 3614106,
      "text": "Genau, also an sich ist Excel halt einfach meiner Meinung nach sehr approachable. Also ich glaube, das ist das Tool, was von den meisten Leuten genutzt wird. Es ist zumindest im Aufbau erstmal relativ intuitiv. Es ist wie viele Sachen, wenn man tiefer reingeht, wird es sehr komplex, aber grundsätzlich ist es halt, you see, ne, you get what you see. Ich sehe ein Grid, ich kann dort Sachen eintragen. Ich bin immer noch der Meinung, dass die meisten Leute Excel nicht so nutzen, wie man das vermutlich nutzen sollte. Aber es ist halt trotzdem ein Tool, was halt vielseitig ist, vor allem auch, wenn man an der Oberfläche nur ist und ermöglicht es halt Leuten mit relativ wenig Aufwand und auch in dem Fall relativ wenig exklusivem Wissen schon Mehrwert zu generieren. Und zum Beispiel paar Python, das kann ich vielleicht minimal, also möchte nicht sagen, dass ich Python beherrsche, aber ich wüsste, wie ich ein paar Sachen mache, aber fühle mich halt persönlich auch in dem nativen Excel einfach deutlich wohler. Und ich denke halt auch, da würde ich mich halt besser fühlen, ein excel Modell an jemanden zu schicken, als Python Code, was halt gar nicht nachvollziehbar ist, weil du halt nichts siehst im Endeffekt, wenn du den Code nicht lesen kannst."
    },
    {
      "confidence": 0.8947063,
      "end": 3708448,
      "speaker": "C",
      "start": 3678718,
      "text": "Du beschwerst dich jetzt, dass andere Excel nicht so verwenden, wie man es verwenden sollte. Also ihr berechnet irgendwelche Schiffe, die da über Zeiten herumfahren. Ist die Frage, ob das der ideale Use Case für Excel ist. Aber Benni, du bist jetzt mehr Informatiker noch, programmierst du dann andere Sachen in Python, in einer klassischen Programmiersprache oder setzt du dann in deinem Alltag, klar, wenn man jetzt mit jemand anderem zusammenarbeitet, ist noch mal was anderes, aber in deinem Alltag setzt du dann mehr auf Excel oder programmierst du auch andere Sachen?"
    },
    {
      "confidence": 0.9134414,
      "end": 3733100,
      "speaker": "D",
      "start": 3708544,
      "text": "Also teilweise bin ich schon, auch im Programmieren selber, bin ich jetzt eher mehr in die Wirtschaftsprojektmanagement Schiene. Also ich bin ab, arbeite aktuell auch im IT Projektmanagement. Also von dem Thema bin ich eher ein bisschen weiter weg, von der direkten Softwareentwicklung, vom direkten Programmieren. Und da ist Excel, wie der Jean sagt, einfach sehr, sehr approachable und sehr, sehr einfach zum Anwenden."
    },
    {
      "confidence": 0.899495,
      "end": 3735932,
      "speaker": "C",
      "start": 3733180,
      "text": "Aber machst du dann dein Projektmanagement in Excel?"
    },
    {
      "confidence": 0.9218338,
      "end": 3751180,
      "speaker": "D",
      "start": 3736076,
      "text": "Unter anderem ja. Also wir haben natürlich auch einfach andere individuelle Tools, aber gewisse Themen gibt es natürlich, die next einfach schneller sind oder wenn man einfach sich schnell irgendetwas zusammenrechnen möchte oder ähnliches, dann glaube ich, ist Excel da einfach sehr, sehr schnell ein gutes Tool."
    },
    {
      "confidence": 0.90638906,
      "end": 3781256,
      "speaker": "C",
      "start": 3751260,
      "text": "Aber seht ihr dann irgendwo ein Ende, wo ihr sagt, okay, da sollte man nicht mehr Excel verwenden oder da hat man zu viel auf Excel gesetzt schlussendlich? Also ich kenne es ja auch so von anderen no Code Tools, wenn man Excel als no Code Tool bezeichnen möchte, dass man dann an irgendeinen Punkt kommt, wo es dann so schwierig wird, weil man einfach irgendwie noch mehr customized Funktionen braucht oder noch mehr custom customized Features, dass man dann irgendwie so an der Grenze anstoßt. Also wo seht ihr da die Grenze von Excel?"
    },
    {
      "confidence": 0.9301412,
      "end": 3851946,
      "speaker": "B",
      "start": 3781368,
      "text": "Also für mich war ein ganz großes Thema schon unabhängig von den Möglichkeiten, die mir Excel bietet, Liste offener Punkte. Also bei mir ist auch Teile von Teil von verschiedenen Projekten und es war halt so, dass die Liste der offenen Punkte auch in Excel gemacht wurde. Und da habe ich mich gefragt, okay, wir haben SharePoint, es gibt Sharepoint Listen, die mir da ein paar andere Funktionalitäten geben. Da ist dann halt für mich auch der Part, wo ich denke, ich muss nicht alles in Excel machen, nur weil Exit theoretisch dort irgendwelche Möglichkeiten bietet, sondern man kann da natürlich auch schon ein anderes Tool nutzen, was mir gegebenenfalls auch bessere Optionen bietet, wo ich halt immer ein bisschen Bauchschmerzen bekommen habe, ist Excel als Datenbank. Excel ist ein Tabellenkalkulationsprogramm und mir ist klar, dass ich dort strukturiert mehr oder weniger auch Daten eingeben kann. Aber man kommt da halt schon doch an die Grenzen. Also einerseits ist ist es Excel hat ein Zeilenlimit, kann man übergehen, wenn man Power Query und Powerpivot arbeitet, aber es ist halt theoretisch nicht unbedingt für diese großen Datenmengen gemacht. Was mir auch oft aufgefallen ist, dass Dokumentation halt in Excel stattfinden. Auch dort gibt es Tools, die ich da als besser empfinden würde. Aber für mich war halt immer dieses große Thema Excel ist halt, ich kann das raufwerfen und das macht sein Ding. Ob es halt später denn dafür optimal ist, das ist eine andere Frage."
    },
    {
      "confidence": 0.9402922,
      "end": 3899892,
      "speaker": "A",
      "start": 3852138,
      "text": "Wenn ich euch so zuhöre, dann kann ich so, dann höre ich so ein bisschen raus, so nach dem Motto, es ist völlig okay, Excel Sheets per E Mail durch den Konzern zu senden. Aber ja, ich glaube, ihr habt auch einen guten, guten Punkt. Ich meine, das ist ein geiles Tool, man kann mal eben schnell ein paar Zahlen addieren, alles gut. Und das werde ich, würde ich sagen, machen die meisten Leute, einfach ein paar Zahlen addieren. Ihr macht mehr sophisticated Kram, gebe ich zu. Und was ich aber hingegen bei Python Code halt auch sagen muss, ist, man könnte den versionieren, das kann man bei Excel ja nicht. Also klar, man hat Excel V und dann v und vielleicht hat man noch Sheet V oder sowas, dann Final, Final V, wir kennen das alle. Das ist so das einzige Thema, wo ich sagen würde, okay, da kommt Excel relativ schnell an die Grenzen. Aber offen gesprochen kommen auch ziemlich viele Datenbanken da auch in die Grenze."
    },
    {
      "confidence": 0.93962336,
      "end": 3905108,
      "speaker": "C",
      "start": 3899956,
      "text": "Wobei ja Excel mittlerweile auch Versionierung hat, oder? Und History, also ganz klassisch die ganzen."
    },
    {
      "confidence": 0.9272295,
      "end": 3929124,
      "speaker": "B",
      "start": 3905124,
      "text": "Office Programme, also wenn ich auf SharePoint speichere zum Beispiel oder OneDrive for Business, dann hast du auch eine Standard Versionierung. Sonst mit dem E Mail versenden, das ist schon gruselig, weil du dann halt unterschiedliche Stände hast und nicht weißt, was richtig ist. Aber als Standard Kollaborationstool bei uns zum Beispiel wird Teams genutzt und Teams hat dahinter einen Sharepoint, worauf die Sachen gespeichert werden. Und dort gibt es auch standardmäßig Versionierung, die ich bis ewig in die Vergangenheit wiederherstellen kann."
    },
    {
      "confidence": 0.89096206,
      "end": 3936500,
      "speaker": "A",
      "start": 3929292,
      "text": "Aber die Versionierung ist dann ja auf Serviceebene von Sharepoint und nicht mit Excel. Also die Versionierung geht dann auf jede File Art korrekt."
    },
    {
      "confidence": 0.924325,
      "end": 3938020,
      "speaker": "B",
      "start": 3936580,
      "text": "Macht sie aber nicht unbedingt schlecht."
    },
    {
      "confidence": 0.81920713,
      "end": 3944270,
      "speaker": "A",
      "start": 3938100,
      "text": "Ne? Richtig. Habe ich aber bei Dropbox ja auch. Aber ne, stimmt, wir wollen jetzt auch nicht auf dem Versionierungsthema rumhattieren."
    },
    {
      "confidence": 0.92155975,
      "end": 3974102,
      "speaker": "C",
      "start": 3944430,
      "text": "Aber weil du jetzt auch online Kollaboration gesagt hast und E Mails herumsenden, das ist ja die große Stärke von Google Sheets damals gewesen. Microsoft hat ja ein bisschen nachgezogen, wobei ich musste es teilweise auch selber verwenden. Also das ist, wenn man Google Docs gewöhnt ist in der Zusammenarbeit, dann ist es dann teilweise schon schwer, diese Online Versionen von Microsoft zu verwenden. Verwendet ihr persönlich noch irgendwas von Google oder ist es dann euch zuwider, weil das einfach Kinderfasching oder Kindergarten Tools sind?"
    },
    {
      "confidence": 0.87654936,
      "end": 4020010,
      "speaker": "D",
      "start": 3974206,
      "text": "Also ich selber habe, wie in der eingangs erwähnt, Gutsheets verwendet, ganz, ganz selten, insbesondere im Bereich Kollaboration ist gut. Cheats meiner Meinung nach auch immer eben noch besser als Excel, obwohl Microsoft da eben einiges aufgeholt hat. Aber wirklich verwenden Twist nicht mehr. Irgendwann dann teilweise hin und wieder mal verwendet und dann einfach mal auch die higher Version Funktionen ausprobiert. Und da kommt man dann einfach schnell drauf, dass das in Google Sheets dann einfach doch schlechter funktioniert größtenteils oder zumindest anders funktioniert, wenn man die von Excel gewöhnt ist. Also ich vermute für fünf und neunzig Prozent der excel User wird es keinerlei Unterschied machen, ob man Excel oder Google Sheets verwendet. Glaub Shaw und ich zählen definitiv zu den fünf Prozent."
    },
    {
      "confidence": 0.86458707,
      "end": 4025772,
      "speaker": "C",
      "start": 4020090,
      "text": "Und wenn wir da jetzt noch, um alles abzuschließen, LibreOffice mit reinbringen, habt ihr da irgendeine Aufgabe?"
    },
    {
      "confidence": 0.9571918,
      "end": 4032184,
      "speaker": "D",
      "start": 4025946,
      "text": "Also bis auf die Tatsache, dass ich es irgendwann mal verwendet habe, weil ich keine Microsoft Lizenz habe und das ist wahrscheinlich mehr als zehn Jahre her."
    },
    {
      "confidence": 0.9192039,
      "end": 4050904,
      "speaker": "A",
      "start": 4032272,
      "text": "Nein, wenn ich jetzt diesen Podcast höre und geil mit den Jungs, die Begeisterung möchte ich auch haben, mit den Jungs möchte ich arbeiten. Wie komme ich in die Excel Szene rein? Wie komme ich in die excel Weltmeisterschaft Szene rein? Was würdet ihr ans Herz legen? Wo gehe ich hin? Wie starte ich?"
    },
    {
      "confidence": 0.92669946,
      "end": 4101702,
      "speaker": "D",
      "start": 4050992,
      "text": "Just do it. Also einfach mal ausprobieren, einfach mal anmelden, einfach mal teilnehmen. Und ich vermute, wenn man selbst mit dem Gedanken spielt, könnte mir das Spaß machen. Da bin ich ziemlich sicher. Ja, es würde dir auch Spaß machen. Also einfach mal anmelden. Es gibt die weltweite Organisation, also es gibt die Microsoft Excel Weltmeisterschaft unter fm World Cup Com. Aber und das ist tatsächlich etwas neues, was im deutschsprachigen Raum ab diesem Jahr also zwei tausend fünf und zwanzig gibt, ist unser deutschsprachiges Local Chapter. Also FMWC Dach EU ist unsere Website, über die kann man sich anmelden, kann man ganz einfach mitmachen für die neueste Saison. Und dann gibt es bei uns ein Finale, ein Turnier von unserem Local Chapter und eventuell sieht man sich bei unserem Local Chapter beim Finale in Las Vegas oder hört sich über sonstige Kanäle, würde mich sehr, sehr freuen."
    },
    {
      "confidence": 0.9215681,
      "end": 4120414,
      "speaker": "C",
      "start": 4101766,
      "text": "Und habt ihr dann da auch irgendwie unter dem Jahr irgendwelche Events, wo man sich trifft, keine Ahnung, irgendwelche Challenges macht, so Vorbereitungssachen, also wie dick ist man da in der Community mit anderen connected? Also trifft ihr euch beide jetzt zum Beispiel irgendwie öfter irgendwo oder habt ihr da selten Kontakt?"
    },
    {
      "confidence": 0.9391271,
      "end": 4160390,
      "speaker": "D",
      "start": 4120542,
      "text": "Also wir beide haben uns tatsächlich bislang ein einziges Mal persönlich getroffen, das war in Las Vegas. Aber ich sage vor allen Dingen, virtuell ist man eigentlich die gesamte Community weltweit. Also es ist jetzt, wenn man mit Leuten aus Reunion, Neuseeland, den USA und Brasilien irgendetwas koordiniert, ist das vielleicht schon auch allein zeitzonen technisch schon relativ schwierig und für ein in Person Event oder ähnliches natürlich zusätzlich auch einfach noch schwierig, das Ganze zu organisieren. Aber gerade virtuell gibt es sehr, sehr viele Treffen. Wir haben nach jedem von den Online Battles gibt es auf einem Discord Kanal ein gemeinsames Schauen des Livestreams, da trifft man sich schon, aber eben größtenteils virtuell."
    },
    {
      "confidence": 0.94297,
      "end": 4186791,
      "speaker": "A",
      "start": 4160470,
      "text": "Gibt es auch irgendwie die ganzen Cases, die ihr erwähnt hattet, gibt es dann irgendwo, weiß ich nicht, ein Online Repository, wo ich mir mal histor historische Cases ansehen kann? Ich weiß, dass es bei Advent of Code Leute gibt, die das mit Excel lösen und da, wenn du, gibt es glaube ich auch Subreddits für und solche Thematiken, da kann man ziemlich viel rausholen. Aber gibt es irgendwo, weiß ich nicht, auf eine offizielle Webseite? Ja, das sind jetzt hier die Starter Cases von den letzten zwei Jahren, wo ich einfach mal durchgehen kann oder sowas."
    },
    {
      "confidence": 0.91786826,
      "end": 4230868,
      "speaker": "D",
      "start": 4186935,
      "text": "Also auf der offiziellen Seite von Financial Modeling World Cup, von der Weltmeisterschaft, fmworldcup com, gibt es alle Cases zum kaufen, aber es gibt auch diverse Cases, unter anderem der Final Case vom letzten Jahr, der Qualifikations Case, glaube ich, vom letzten Jahr. Die sind alle, also nicht alle, aber sehr, sehr viele sind dort auch kostenlos zur Verfügung. Also zum einfach mal ausprobieren, schauen, hätte ich das gekonnt, kann ich das? Gibt es dort einige Cases gratis zur Auswahl. Und es gibt auch auf unserer deutschsprachigen Seite, wenn ich darauf jetzt noch mal zurückkommen zu lassen, gibt es dann auch einige Cases, weil dort sind die ganzen Case Angaben natürlich dann auch im Deutschen. Also vielleicht, wenn man auch vielleicht vor der Englischen als Sprache in dem Kontext der Zeit noch ein bisschen Angst hat, dann gibt es bei uns auch einige deutschsprachige Cases zum Ausprobieren."
    },
    {
      "confidence": 0.89844334,
      "end": 4239412,
      "speaker": "A",
      "start": 4230964,
      "text": "Und wenn ich das richtig verstanden habe, Benni, du bist unter anderem auch Case Designer dann für die Local Dach Cases. Ist das richtig?"
    },
    {
      "confidence": 0.92310286,
      "end": 4267304,
      "speaker": "D",
      "start": 4239476,
      "text": "Von den Local Dach, also von der Local Chapter für Dach, also Deutschland, Österreich, Schweiz etc. Bin ich Case Autor, aber auch Hauptorganisatorganisator. Shaw wird wahrscheinlich, wenn ihr mitmachen wollt, euer größter Gegner sein, um die gesamte Ausgabe zu gewinnen. Ich bin dort eben Organisator und Case Designer, aber ich bin auch Case Designer für die weltweite Ausgabe. Also bei der Weltmeisterschaft kann es auch, also gab es letztes Jahr und wird es auch dieses Jahr den einen oder anderen Case von mir geben."
    },
    {
      "confidence": 0.918838,
      "end": 4275780,
      "speaker": "C",
      "start": 4267352,
      "text": "Und auf welchen Case bist du am stolzesten, sag mal so, auf den du sehr stolz bist, den du erzählen darfst, der jetzt vielleicht nicht."
    },
    {
      "confidence": 0.88760567,
      "end": 4305974,
      "speaker": "D",
      "start": 4276640,
      "text": "Das ist genau das größte Problem, weil aktuell eigentlich öffentlich, neben meinen Cases für Dach, die jetzt dann öffentlich sind, ist eigentlich nur der Ship the World Case aktuell öffentlich verfügbar. Ich habe sieben, acht Cases in der Hinterhand, über die ich liebend gerne reden würde, aber Jean hat sie noch nicht ausprobiert oder hat sie größtenteils noch nicht ausprobiert, wird dort als Teilnehmer teilnehmen und vielleicht einige Zuhörer werden auch als Teilnehmer teilnehmen. Darum kann ich darüber jetzt aktuell eher noch relativ wenig sagen."
    },
    {
      "confidence": 0.97162145,
      "end": 4307734,
      "speaker": "C",
      "start": 4306022,
      "text": "Okay, da müssen wir das also verschieben."
    },
    {
      "confidence": 0.8939953,
      "end": 4419130,
      "speaker": "A",
      "start": 4307782,
      "text": "Vielen lieben Dank, Benni, vielen lieben Dank, Jean, für diese Insight in die excel Weltmeisterschaft. Ich habe initial nicht gedacht, dass es doch so algorithmisch ist bzw. Auch sogar sehr stark an Advent of Code angelehnt ist. Denn irgendwie klingt das halt so ein bisschen, als wäre das Advent of Code auf Excel spezialisiert, in einer Art eSport Tournament, was richtig, richtig geil klingt. Also ich habe mir letztens auch so nebenbei, ich glaube diese Livestream geht vier Stunden oder sowas von lassen Vegas mir nebenbei reingezogen. Richtig, richtig geil. Es gibt auch von Joel Spolski, ich glaube, das ist der Stackoverflow Gründer oder irgendwie sowas, es gibt einen geilen Talk, you think you know, Excel oder sowas. Der knallt dann auch in fünf und vierzig Minuten irgendwelche Excel Sachen durch. Also ich bin nach zwei Minuten ausgestiegen, bin ich ehrlich. Verlinken wir auch in den Shownotes. Wir verlinken aber auch alles andere in den Shownotes. Die Weltmeisterschaft natürlich, wie man vielleicht Joe oder Benni auch mal auf links LinkedIn anquatschen kann, ein paar YouTube Kanäle zum Excel Wizard, aber auch natürlich die Website vom Local Dach Chapter. Und falls ihr also euch auch mal ein bisschen an eurem Excel food trainieren wollt und ja, vielleicht mal einen neuen Favoriten für Deutschland stellen wollt und mal John vom Thron stoßen will, dann einfach mal ran da. Ich bin gespannt. Ich verfolge eure Karriere auf jeden Fall ab jetzt ganz genau. Wünsche euch natürlich aber auch sehr, sehr viel Erfolg. Benni, für dich, für die Studententhematik, natürlich, aber auch für die offene Weltmeisterschaft der Großen, nenne ich es mal. Das hört sich so komisch an als Student. Und jo, natürlich auch, dass du wieder unter den top vier und zwanzig landest, denn auch wenn du erster wirst, bist du natürlich auch unter den top vier und zwanzig. Ja, ein bisschen Logik. Deswegen vielen lieben Dank, ihr beide. Und bis dahin würde ich sagen, und tschüss, bis zum nächsten Mal."
    },
    {
      "confidence": 0.95965,
      "end": 4419674,
      "speaker": "B",
      "start": 4419170,
      "text": "Danke euch."
    },
    {
      "confidence": 0.70745,
      "end": 4420138,
      "speaker": "D",
      "start": 4419722,
      "text": "Danke."
    },
    {
      "confidence": 0.3088,
      "end": 4420410,
      "speaker": "C",
      "start": 4420234,
      "text": "Ciao."
    }
  ],
  "webhook_auth": false
}