{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 3547,
  "audio_url": "https://cloud.inlupus.at/s/F5zsiQHW8pWA3i5/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9248263,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "8144ce41-15f5-43eb-a89d-465cef2ed959",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 16,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "confidence": 0.96223855,
      "end": 6072,
      "speaker": "A",
      "start": 3440,
      "text": "Eine neue Podcast Episode vom Engineering kiosk."
    },
    {
      "confidence": 0.93213,
      "end": 7048,
      "speaker": "B",
      "start": 6136,
      "text": "Moin moin."
    },
    {
      "confidence": 0.93856996,
      "end": 82852,
      "speaker": "A",
      "start": 7144,
      "text": "In dieser Episode gehen wir einer Herzensfrage Welchen echten Wert haben Meetups in der tech Szene? Wir selbst sind als Meetup Organisatoren befangen. Um aus unserer Bubble mal etwas herauszukommen, haben wir Stimmen aus der Community eingefangen. Wir haben gefragt, warum Meetups und Konferenzen eigentlich besucht werden bzw. Warum welchen Stellenwert solche Events zugerechnet werden, ob virtuelle Meetups besser laufen als physische und wann virtuelle Meetups die bessere Wahl sind. Inwieweit solche Events die eigene Karriere beeinflusst haben und wie die Community entscheidet, wann sich die Teilnahme an einem Meetup Event für sich lohnt. Nun die große lohnt sich diese Podcast Episode denn auch für dich? Ich kann dir aus meiner Erfahrung einige Argumente hatte selbst ich nicht auf dem Schirm. Zum Beispiel, wenn du ein Nischen tech Thema hast, würde dies wahrscheinlich nie als physikalisches Meetup klappen. Oder wie stark der Einfluss deiner Freunde ist, ob du ein Meetup besuchst oder dass Meetups gegebenenfalls doch nicht so einen großen Einfluss auf die eigene Karriere haben, wie ich selbst immer dachte. Aber bleib mal dran und mach dir selbst ein eigenes Bild. Danke an alle community Mitglieder, die uns ihre Stimme und Meinung für diese Podcast Episode zur Verfügung gestellt ihr habt Wolfi und mich aus der eigenen Suppe geholt. Nun aber genug gespoilert, viel Spaß mit dieser Episode."
    },
    {
      "confidence": 0.77206,
      "end": 84280,
      "speaker": "B",
      "start": 82916,
      "text": "Los geht's."
    },
    {
      "confidence": 0.93038285,
      "end": 90852,
      "speaker": "A",
      "start": 88780,
      "text": "Das Thema Meetups ist so eine Art."
    },
    {
      "confidence": 0.9483468,
      "end": 109852,
      "speaker": "B",
      "start": 90876,
      "text": "Dauerbrenner bei uns hier im Podcast. Wir haben schon etliche Episoden dazu gemacht. Episode neun und zwanzig, wo wir mal ein bisschen von der anderen Seite reported haben, wie man Meetups und Konferenzen eigentlich organisiert. Dann Episode fünf und fünfzig, da ging es um Weiterbildung. Da haben Meetups und Konferenzen natürlich auch eine Rolle gespielt. Episode fünf und neunzig, da ging es."
    },
    {
      "confidence": 0.80377835,
      "end": 112684,
      "speaker": "A",
      "start": 109876,
      "text": "Wieder um effiziente Knowledge Sharing Formate."
    },
    {
      "confidence": 0.95214,
      "end": 116092,
      "speaker": "B",
      "start": 112812,
      "text": "Wissen, teilen und begeistern war der Titel damals im Oktober."
    },
    {
      "confidence": 0.9280105,
      "end": 120364,
      "speaker": "C",
      "start": 116156,
      "text": "Warum willst du jetzt schon wieder darüber reden? Jetzt haben wir schon drei Episoden gemacht zu dem ganzen Thema."
    },
    {
      "confidence": 0.9657318,
      "end": 122636,
      "speaker": "A",
      "start": 120412,
      "text": "Ja, warum? Das erzähle ich dir jetzt gleich in einer Sekunde."
    },
    {
      "confidence": 0.903298,
      "end": 125340,
      "speaker": "B",
      "start": 122668,
      "text": "Deswegen etwas Geduld, Herr Wolfgang."
    },
    {
      "confidence": 0.92358655,
      "end": 132284,
      "speaker": "A",
      "start": 125420,
      "text": "So, und auf der anderen Seite haben Wolfgang und ich natürlich eine persönliche Beziehung zu Meetups. Ich habe elf Jahre lang ein lokales."
    },
    {
      "confidence": 0.93171084,
      "end": 140738,
      "speaker": "B",
      "start": 132332,
      "text": "Meetup in Düsseldorf gemacht, von zwei tausend zwölf bis drei und zwanzig. Danach habe ich es abgegeben. Zugegeben, ich habe es mit Dominik Siebel gemacht. Grüße gehen raus. Vielen Dank für deinen Support damals noch."
    },
    {
      "confidence": 0.843298,
      "end": 143590,
      "speaker": "C",
      "start": 140794,
      "text": "Hey, du hast länger Meetups gemacht als i ein Doktor."
    },
    {
      "confidence": 0.968568,
      "end": 148594,
      "speaker": "A",
      "start": 143930,
      "text": "Das ist korrekt, ja, das ist korrekt. Ich habe es aber für andere gemacht und nicht für mich. Und du hast ja zehn Jahre für."
    },
    {
      "confidence": 0.8984215,
      "end": 152530,
      "speaker": "B",
      "start": 148602,
      "text": "Dich deinen Doktor gemacht und ich habe elf Jahre was zur Community zurückgegeben."
    },
    {
      "confidence": 0.936972,
      "end": 155442,
      "speaker": "C",
      "start": 152610,
      "text": "Ich habe ganz viel unterrichtet während der Zeit. Also bitte."
    },
    {
      "confidence": 0.636995,
      "end": 156418,
      "speaker": "B",
      "start": 155506,
      "text": "Okay, okay."
    },
    {
      "confidence": 0.9074371,
      "end": 166486,
      "speaker": "A",
      "start": 156514,
      "text": "Und der Wolfgang hat kurz bevor ich mit dem Meetup organisieren aufgehört habe, auch ein Meetup gestartet. Das ist das Engineering Kiosk Albs Innsbruck."
    },
    {
      "confidence": 0.899952,
      "end": 170662,
      "speaker": "B",
      "start": 166518,
      "text": "Vielen Dank dafür, Wolfgang. Mit natürlich einem super tollen Team."
    },
    {
      "confidence": 0.95643,
      "end": 180198,
      "speaker": "A",
      "start": 170766,
      "text": "Und die dritte Thematik, warum Meetups auch hier so eine Art Dauerbrenner sind. Meetups kommen gerade wieder zurück nach der Corona Pandemie."
    },
    {
      "confidence": 0.91734195,
      "end": 190262,
      "speaker": "B",
      "start": 180214,
      "text": "Wir erinnern uns, März zwei tausend zwanzig bis April drei und zwanzig aus der Pause kommen die Meetups jetzt gerade zurück. Aber das war so die schöne Seite der Happy Pass."
    },
    {
      "confidence": 0.9112371,
      "end": 192240,
      "speaker": "A",
      "start": 190366,
      "text": "Ich kenne aber auch einige Leute, die."
    },
    {
      "confidence": 0.97707283,
      "end": 194428,
      "speaker": "B",
      "start": 192390,
      "text": "Waren noch nie auf einem Meetup, die."
    },
    {
      "confidence": 0.941724,
      "end": 202316,
      "speaker": "A",
      "start": 194484,
      "text": "Gehen sehr selten auf ein Meetup oder C sehen Meetups als Zeitverschwendung an. Wolfgang und ich haben natürlich einen starken."
    },
    {
      "confidence": 0.8099357,
      "end": 206652,
      "speaker": "B",
      "start": 202348,
      "text": "Bias als Organisatoren, als Speaker und wir."
    },
    {
      "confidence": 0.92338914,
      "end": 256704,
      "speaker": "A",
      "start": 206676,
      "text": "Schwimmen auch irgendwie in unserer eigenen Suppe. Logisch, wir machen diesen Podcast hier zu zweit. Deswegen haben wir uns mal welchen Wert haben Meetups eigentlich? Und da haben wir uns gedacht, wir stellen vier Fragen zusammen und gehen mal zusammen auf ein lokales Meetup und fragen die Leute. Und als ich dann diese Podcast Episode hier vorbereitet habe, also nach diesen Interviewformaten, nach diesen wir fragen Leute auf eine Meetup, habe ich festgestellt, scheiße, diese Umfrage ist ja gar nicht repräsentativ. Wenn ich die Frage stelle, welchen Wert haben eigentlich Meetups? Und ich führe die Interviews auf eine Meetup durch und die Intention war mal aus der eigenen Suppe rauskommen. Ja, ich würde sagen, stark angefangen, stark nachgelassen. Wolfgang, wie kommen wir aus der Research Thematik jetzt hier wieder heraus und shiften das zu einer repräsentativen Umfrage?"
    },
    {
      "confidence": 0.9865078,
      "end": 259792,
      "speaker": "B",
      "start": 256752,
      "text": "Kriegen wir das hin oder ist die Sache gegessen?"
    },
    {
      "confidence": 0.92450774,
      "end": 299242,
      "speaker": "C",
      "start": 259856,
      "text": "Ja, nachdem wir immer zu zweit in diesem Podcast sehen, haben wir sowieso keinen Anspruch auf Repräsentativität. Ist es kein Nomen oder repräsentative Umfragen, egal. Und außerdem wollen wir wissen, was es Gutes gibt bei Meetups, was Gründe sind, was Leute vorgefunden haben bei Meetups, warum sie auch wieder hingehen. Also wenn wir uns sowieso darauf fokussieren, dann sind wir genau richtig, weil wir wollen ja die Erfolgsstorys hören und warum Meetups auch Sinn machen oder vielleicht auch teilweise weniger Sinn. Also nicht jeder hat dieselbe Meinung. Wenn du jetzt natürlich noch wissen wollen würdest, warum gehen Leute nicht zu Meetups, dann müsstest du natürlich andere fragen. Aber die Frage haben wir auch gar nicht gestellt."
    },
    {
      "confidence": 0.75976,
      "end": 300170,
      "speaker": "B",
      "start": 299386,
      "text": "Das ist korrekt."
    },
    {
      "confidence": 0.9333709,
      "end": 315334,
      "speaker": "A",
      "start": 300250,
      "text": "Wir haben vier Fragen vorbereitet und zu manchen Fragen habe ich natürlich auch eine sehr eingeschossene Meinung. Dennoch haben mich manche antworten sehr überrascht und vielleicht ist das der eigentliche Wert von unserer Interviewerfahrung."
    },
    {
      "confidence": 0.872798,
      "end": 318598,
      "speaker": "B",
      "start": 315382,
      "text": "Interview Safari auf den Meetups."
    },
    {
      "confidence": 0.9604543,
      "end": 321430,
      "speaker": "A",
      "start": 318614,
      "text": "Wir haben die Aufnahmen heute im Januar."
    },
    {
      "confidence": 0.8781,
      "end": 324518,
      "speaker": "B",
      "start": 321510,
      "text": "Und Februar einmal auf dem Web Engineering."
    },
    {
      "confidence": 0.9433171,
      "end": 327622,
      "speaker": "A",
      "start": 324534,
      "text": "Meetup Düsseldorf gemacht und einmal auf dem."
    },
    {
      "confidence": 0.9067543,
      "end": 331066,
      "speaker": "B",
      "start": 327646,
      "text": "Engineering Kiosk Albs in Innsbruck im Februar."
    },
    {
      "confidence": 0.9408017,
      "end": 376558,
      "speaker": "C",
      "start": 331178,
      "text": "Und damit wir nicht diese ganzen Antworten wiedergeben müssen, haben wir das Ganze natürlich aufgenommen. Ich bin mir so vorgekommen wie so ein rasender Reporter mit diesem Mikro, der da vor Ort aufnimmt. Danke an die AI übrigens für das ganze herausfiltern der Hintergrundgeräusche. Also man hört von dem Meetup eigentlich kaum mehr etwas, obwohl es doch ziemlich laut war, weil wir keinen eigenen Raum hatten. In Tirol haben wir leider nicht so offices wie in Düsseldorf, wo das easier war. Da haben wir einen eigenen Raum gehabt bei den Aufnahmen und und wir haben so ungefähr dieselben Fragen gestellt den Leuten und werden euch heute mal so Auszüge aus den ganzen Antworten geben. Und schon mal da vorab vielen Dank an alle, die mitgewirkt haben und auch so mutig waren, sich einfach mal vors Mikro zu stellen, weil es ja doch keine Alltagssituation."
    },
    {
      "confidence": 0.9623943,
      "end": 449342,
      "speaker": "A",
      "start": 446654,
      "text": "Wir starten mal leicht mit einem leichten."
    },
    {
      "confidence": 0.8564225,
      "end": 450990,
      "speaker": "B",
      "start": 449486,
      "text": "Starter, könnte man sagen."
    },
    {
      "confidence": 0.9527254,
      "end": 462194,
      "speaker": "A",
      "start": 451070,
      "text": "Die erste Frage warum besuchst du Meetups und Konferenzen bzw. Welchen Wert rechnest du solchen Events zu? Der meetup Organisator Dario vom Web Engineering."
    },
    {
      "confidence": 0.96458286,
      "end": 465154,
      "speaker": "B",
      "start": 462242,
      "text": "Meetup Düsseldorf ist mit gutem Beispiel vorangegangen."
    },
    {
      "confidence": 0.78925145,
      "end": 467154,
      "speaker": "C",
      "start": 465202,
      "text": "Also dein Nachfolger ist das im Prinzip."
    },
    {
      "confidence": 0.9267817,
      "end": 475938,
      "speaker": "B",
      "start": 467282,
      "text": "Mein Nachfolger. Vielen Dank, dass du dieses Meetup weiterführst. Bin ich sehr stolz darauf, dass er es macht und er macht es richtig gut. Ordentliche Kadenz, deswegen Hut ab."
    },
    {
      "confidence": 0.9437467,
      "end": 483858,
      "speaker": "A",
      "start": 475994,
      "text": "Und abgesehen vom Meetup ist Dario zwei und dreiig Jahre alt, arbeitet bei Check im Bereich Kreuzfahrten, ist dort Engineering Manager."
    },
    {
      "confidence": 0.9309267,
      "end": 488734,
      "speaker": "B",
      "start": 483954,
      "text": "Eines Backend Teams, welches in meiner Lieblingssprache Go programmiert."
    },
    {
      "confidence": 0.9354743,
      "end": 491342,
      "speaker": "A",
      "start": 488862,
      "text": "Aber neben dem guten Geschmack, lass uns."
    },
    {
      "confidence": 0.8585662,
      "end": 496130,
      "speaker": "B",
      "start": 491366,
      "text": "Mal reinhören, welchen Wert Dario diesen Events zurechnet."
    },
    {
      "confidence": 0.9152976,
      "end": 596510,
      "speaker": "D",
      "start": 497110,
      "text": "Also ich muss dazu sagen, ich bin Organisator von einem Meetup, das habe ich vom Andi übernommen. Andi kennt ihr mit Sicherheit. Und ich besuche seit zwei tausend dreizehn, zwei tausend vierzehn Meetups und ich habe in meiner Karriere super viel dadurch mitgenommen. Was heißt das konkret? Ich habe Meetups besucht sehr frequentiert, ich hatte immer die Möglichkeit, über den Tellerrand hinauszublicken. Das war für mich total wichtig, weil wenn man in irgendeinem Vollzeitjob ist, steckt man in gewisser Form in einer Bubble und durch diese Meetups konnte ich die Bubble oftmals durchbrechen. Ich konnte neue Eindrücke gewinnen. Das hat mich im Job weitergebracht. Und irgendwann kommt der Moment, wo man vor einem Problem steht und dann kommt irgendwas im Hinterkopf hervor und man denkt boah, vor einem halben Jahr habe ich einen Talk zu dem und dem Thema gehört, das könnte jetzt irgendwie passen. Ich schaue mir das mal an. Und plötzlich bin ich der Lösung näher. Und dann kam eine kleine Pandemie. Dann ist das Web Engineering Düsseldorf Meetup so ein bisschen eingeschlafen, hatte eine kleine Pause. Und ich weiß noch ganz genau, dass ich den Andi damals auf der Fosstem in Brüssel in einem Restaurant am Abend sehr hart genervt habe, dass das Meetup wieder stattfinden muss. Und das war mein Ticket, um Organisator zu werden. Dann habe ich damals den Domme und den Andi unterstützt in der Organisation und bin jetzt als Organisator tätig, habe das Meetup alleine übernommen. Und ich habe immer wenn ich einer Person diesen Weg ermöglichen kann, den ich hatte dadurch, dann ist mir das die Arbeit wert. Und genauso bemesse ich Meetups als auch Konferenzen. Es ist halt ein Weg, um über den Teller hinauszublicken."
    },
    {
      "confidence": 0.89790714,
      "end": 617238,
      "speaker": "C",
      "start": 597170,
      "text": "Es war ja der Hauptgrund, warum, wie wir noch in einem Office lokal zusammengearbeitet haben, dass ich immer probiert habe, einen großen Bogen um die Küche zu machen. Wenn du in der Küche warst, weil du bist einfach ein Spezialist im Arbeit abladen. Das habe ich schon gemerkt. Geht da kurz essen und schon hat der Dario ein ganzes Engineering Kiosk, sag ich schon, engineering kiosk Meetuppicken."
    },
    {
      "confidence": 0.92615867,
      "end": 631916,
      "speaker": "B",
      "start": 617254,
      "text": "Ich nehme die Schuld gerne auf mich, aber es scheint auch so, als wäre er empfänglich dafür. Denn seinen letzten Satz wenn ich nur einer Person einen ähnlichen Vorteil wie ich durch Meetups hatte, ist es mir die Arbeit wert. Da muss ich schon zugeben, wenn man ein solches Mindset hat, Wahnsinn."
    },
    {
      "confidence": 0.85833,
      "end": 632716,
      "speaker": "A",
      "start": 631948,
      "text": "Hut ab."
    },
    {
      "confidence": 0.9958375,
      "end": 634044,
      "speaker": "B",
      "start": 632788,
      "text": "Finde ich richtig schön."
    },
    {
      "confidence": 0.87145716,
      "end": 635708,
      "speaker": "A",
      "start": 634092,
      "text": "Und natürlich jetzt hier auch noch mal."
    },
    {
      "confidence": 0.918195,
      "end": 640476,
      "speaker": "B",
      "start": 635764,
      "text": "In ganz offizieller Rolle. Vielen Dank, Dario, dass du dieses Event weiterträgst."
    },
    {
      "confidence": 0.91761357,
      "end": 644044,
      "speaker": "A",
      "start": 640508,
      "text": "Und das zeigt natürlich aber auch allen anderen Leuten, die vielleicht mal in die."
    },
    {
      "confidence": 0.92665714,
      "end": 647372,
      "speaker": "B",
      "start": 644052,
      "text": "Organisationsrolle schlüpfen wollen, einfach den Mund aufmachen."
    },
    {
      "confidence": 0.93125725,
      "end": 654940,
      "speaker": "A",
      "start": 647436,
      "text": "Einfach quatschen, einfach fragen. Weil im Endeffekt mehr als ein Nein kann man nicht bekommen. Nicht jeder muss ein ganzes Meetup übernehmen."
    },
    {
      "confidence": 0.92449045,
      "end": 661968,
      "speaker": "B",
      "start": 655020,
      "text": "Man kann auch einfach dem Team joinen oder ein Team aufmachen, falls der Organisator oder die Organisatorin vielleicht gerade allein ist."
    },
    {
      "confidence": 0.9440878,
      "end": 664936,
      "speaker": "A",
      "start": 662084,
      "text": "Sieht man am Wolfgang, das ist das beste Beispiel."
    },
    {
      "confidence": 0.9304386,
      "end": 667864,
      "speaker": "B",
      "start": 665048,
      "text": "Die organisieren das Meetup mit vier Leuten."
    },
    {
      "confidence": 0.86503166,
      "end": 670616,
      "speaker": "C",
      "start": 667912,
      "text": "Zurzeit und fünf sind wir mittlerweile."
    },
    {
      "confidence": 0.77274,
      "end": 671192,
      "speaker": "B",
      "start": 670728,
      "text": "Fünf."
    },
    {
      "confidence": 0.90462554,
      "end": 675080,
      "speaker": "C",
      "start": 671296,
      "text": "Eine Organisatorin mit dabei, auch Glückwunsch mit fünf Leuten."
    },
    {
      "confidence": 0.95647633,
      "end": 679512,
      "speaker": "B",
      "start": 675160,
      "text": "Da kann man natürlich dann auch nur einen Teil der Arbeit machen und muss nicht alles auf sich laden."
    },
    {
      "confidence": 0.8986598,
      "end": 726100,
      "speaker": "C",
      "start": 679576,
      "text": "Was ich bei Darius Aussage auch super gefunden habe, war diese Tellerrand Thematik, weil es ist ja auch ganz oft so, dass viele Meetups so super spezialisiert sind. Das heißt, die beschäftigen sich nur mit einer Library, zum Beispiel irgendwie ein Plön Meetup oder oder so. Und da geht es halt nur um die Bubble. Und das finde ich bei eurem Meetup in Düsseldorf sehr stark und das probieren wir auch in Innsbruck, dass wir einfach ein breites Feld haben, weil man dann eben auch mal irgendwelchen Talks begegnet, die man sich sonst wahrscheinlich nie anhören würde. Natürlich gibt es die massenhaft auf YouTube, aber man würde sich ja nie irgendwie in so einen Talk reinsetzen, der irgendwas komplett anderes betrifft oder auch vielleicht ganz außerhalb der klassischen Tech Bubble ist. Und das ist eigentlich auch das Spannende, wenn man schönes breites Feld hat an Speaker und Talks."
    },
    {
      "confidence": 0.95857286,
      "end": 728020,
      "speaker": "B",
      "start": 726180,
      "text": "Der zweite Mensch an unserem Gastmikrofon war."
    },
    {
      "confidence": 0.81947213,
      "end": 735892,
      "speaker": "A",
      "start": 728060,
      "text": "Tim, aktuell Interims Head of Development bei Easybill, auch drei und dreiig Jahre kontinuierlicher Mietabgänger, muss man dazu sagen."
    },
    {
      "confidence": 0.95675457,
      "end": 739640,
      "speaker": "B",
      "start": 735956,
      "text": "Deswegen schauen wir mal, warum er so regelmäßig zu Meetups geht."
    },
    {
      "confidence": 0.9164904,
      "end": 767770,
      "speaker": "E",
      "start": 740220,
      "text": "Ich freue mich auf Meetups, Gleichgesinnte zu treffen, andere Kollegen, Kollegen aus anderen Firmen, Kollegen, mit denen man mal zusammengearbeitet hat, mit denen man das heute vielleicht im täglichen nicht mehr tut und schätze da den Erfahrungsaustausch. Und es ist auch spannend zu sehen, wie andere Personen in anderen Unternehmen größer werden, Erfahrungen sammeln. Also ich gehe jetzt schon sehr lange auf Meetups und das auch so mit zu begleiten, ist wirklich, wirklich spannend."
    },
    {
      "confidence": 0.85092,
      "end": 772380,
      "speaker": "C",
      "start": 769150,
      "text": "Also scheiß auf LinkedIn und nur bei Meetups, oder?"
    },
    {
      "confidence": 0.9203237,
      "end": 777072,
      "speaker": "B",
      "start": 772470,
      "text": "Dafür ist mein Kopf einfach zu schlecht, um das einfach komplett alles im Kopf zu behalten."
    },
    {
      "confidence": 0.90663487,
      "end": 789984,
      "speaker": "A",
      "start": 777136,
      "text": "Aber in der Tat spannend zu sehen, wie Personen in einem anderen Unternehmen größer werden und wachsen. Also so habe ich Meetups noch gar nicht gesehen, aber ja, wenn man drüber nachdenkt, wenn du regelmäßig zu Meetups gehst, dann triffst du natürlich immer dieselben Köpfe."
    },
    {
      "confidence": 0.8855389,
      "end": 798656,
      "speaker": "B",
      "start": 790032,
      "text": "Wie man hier im Ruhrgebiet nennt. Und ja, dann hört man hey, Job gewechselt oder befördert oder macht was anderes, vielleicht vom Softwareentwickler zum Product Manager gewechselt."
    },
    {
      "confidence": 0.984655,
      "end": 799853,
      "speaker": "A",
      "start": 798848,
      "text": "Wirklich spannend."
    },
    {
      "confidence": 0.77977,
      "end": 800666,
      "speaker": "B",
      "start": 799964,
      "text": "In der Tat."
    },
    {
      "confidence": 0.9112587,
      "end": 810350,
      "speaker": "C",
      "start": 800698,
      "text": "Und wenn wir schon beim Networken sind, da haben wir auch noch eine Aussage von Andreas, der ist von Dynatrace, Principal Product Manager und Leiter auch vom Dynatrace Office in Innsbruck."
    },
    {
      "confidence": 0.92097455,
      "end": 832250,
      "speaker": "F",
      "start": 811010,
      "text": "Für mich ist wichtig, mit der lokalen Community verbunden zu sein. Ich triffe da nette Leute, die ähnliche Interessen haben, mal ein bisschen im ungezwungenen Umfeld drüber reden, was man vielleicht sonst in der Arbeit nicht tiefer beleuchten, kann zusätzlich ein bisschen Spaß haben, Anknüpfungspunkte finden vielleicht für Projekte. Ist jetzt in meinem Fall nicht immer so viel, aber ab und zu ergibt sich doch eine interessante Zusammenarbeit."
    },
    {
      "confidence": 0.8874558,
      "end": 836534,
      "speaker": "C",
      "start": 833310,
      "text": "Muss ich dir was übersetzen, die rollerisch, Andi, hast du alles verstanden?"
    },
    {
      "confidence": 0.9494508,
      "end": 843878,
      "speaker": "B",
      "start": 836582,
      "text": "Nö, nö, das war ja schon recht nah am Hochdeutsch, möchte ich mal sagen. Zumindest an dem Hochdeutsch, was wir hier im Ruhrgebiet als Hochdeutsch bezeichnen."
    },
    {
      "confidence": 0.9354979,
      "end": 854006,
      "speaker": "A",
      "start": 843974,
      "text": "Aber ich habe immer so ein, ich weiß nicht, es kommt für mich immer so unterschwellig mit, aber Anknüpfpunkte für die Zusammenarbeit hört sich irgendwie so an, weiß."
    },
    {
      "confidence": 0.919546,
      "end": 855766,
      "speaker": "C",
      "start": 854038,
      "text": "Ich nicht, du weißt, recruiting."
    },
    {
      "confidence": 0.88830584,
      "end": 863790,
      "speaker": "A",
      "start": 855958,
      "text": "Recruiting oder ich möchte was verkaufen oder vielleicht ist Andreas auch auf der Schwelle zur Selbstständigkeit oder ein side Project. Es natürlich alles sein."
    },
    {
      "confidence": 0.92823666,
      "end": 870194,
      "speaker": "C",
      "start": 864090,
      "text": "Also ich glaube, dass da Andreas noch Mitarbeiter und Mitarbeiterinnen sucht. Also es könnte schon sein, aber auf."
    },
    {
      "confidence": 0.98832285,
      "end": 872386,
      "speaker": "A",
      "start": 870202,
      "text": "Der anderen Seite gegebenenfalls für andere Leute."
    },
    {
      "confidence": 0.9238625,
      "end": 874546,
      "speaker": "B",
      "start": 872418,
      "text": "Vielleicht auch eine Chance, die was Neues suchen."
    },
    {
      "confidence": 0.95834,
      "end": 880962,
      "speaker": "A",
      "start": 874578,
      "text": "Also ich möchte das gar nicht so negativ reden, das hört sich immer so unterschwellig an. Ich möchte was verkaufen oder sowas."
    },
    {
      "confidence": 0.9434385,
      "end": 894546,
      "speaker": "C",
      "start": 881106,
      "text": "Ich glaube, wenn es in der richtigen Form passiert und wir hatten auch in Innsbruck wirklich schon gerade kürzlich, obwohl es uns noch nicht so lange gibt, einen Übertritt aufgrund des Meetups von einer Firma zu einer anderen Firma. Also das ist bestätigt über das Meetup."
    },
    {
      "confidence": 0.92248464,
      "end": 902194,
      "speaker": "B",
      "start": 894738,
      "text": "Da kann ich aber auch ein Lied von singen. Also ich glaube, über die elf Jahre habe ich das acht bis zwölf Mal gesehen, ohne Probleme."
    },
    {
      "confidence": 0.90886396,
      "end": 917346,
      "speaker": "C",
      "start": 902322,
      "text": "Also und ist ja nur von den Leuten, wo man es auch wirklich dann weiß. Also schon noch mal was anderes. Habt ihr eigentlich immer noch in Düsseldorf diese Regel, dass keine Recruiter am Meetup sein dürfen? Also natürlich dort sein schon, aber jetzt nicht wirklich aktiv recruiten?"
    },
    {
      "confidence": 0.91407055,
      "end": 931592,
      "speaker": "B",
      "start": 917378,
      "text": "Müssten wir Dario fragen, damals hatten wir sie. Ist aber auch so oft nicht vorgekommen. Deswegen war die Regel jetzt nicht wirklich so konstant präsent. Also ich meine, Recruiter, wie gesagt, die dürfen ja vorkommen. Vielleicht wollen sie ja in den Softwareentwicklungsbereich wechseln, aber die dürfen halt vor Ort nicht ihre Karten verteilen."
    },
    {
      "confidence": 0.93820107,
      "end": 948328,
      "speaker": "C",
      "start": 931656,
      "text": "Ja, wenn sie schlau sind, machen sie das eh wesentlich subtiler. Also ich finde auch heutzutage, die Recruiter sind nicht mehr so platt und die wissen schon auch, wie es läuft. Und da schicken die Firmen auch lieber irgendwelche technischen Leute hin, die einfach Community Building machen und Networking und das funktioniert dann fast besser."
    },
    {
      "confidence": 0.9648648,
      "end": 954292,
      "speaker": "B",
      "start": 948424,
      "text": "Ja, wenn ich mir manche Nachrichten, die ich bei LinkedIn und bei Zing bekomme, so durchlese, dann stelle ich auch das."
    },
    {
      "confidence": 0.7876043,
      "end": 957268,
      "speaker": "A",
      "start": 954316,
      "text": "In Frage, ob heutzutage, also ich rede."
    },
    {
      "confidence": 0.89465135,
      "end": 962276,
      "speaker": "C",
      "start": 957284,
      "text": "Ja von Meetups, die die zu Meetups kommen. Also die schon, das ist ja schon die extra Meile, würde ich fast sagen."
    },
    {
      "confidence": 0.925144,
      "end": 963876,
      "speaker": "B",
      "start": 962308,
      "text": "Naja, machen wir mal weiter."
    },
    {
      "confidence": 0.93275356,
      "end": 969684,
      "speaker": "A",
      "start": 963948,
      "text": "Und zwar mit Philipp, sechs und vierzig Jahre, arbeitet ebenfalls bei Check als IT."
    },
    {
      "confidence": 0.9613,
      "end": 975000,
      "speaker": "B",
      "start": 969772,
      "text": "Leiter im Bereich Sportreisen. Und warum geht er noch auf Meetups?"
    },
    {
      "confidence": 0.9425331,
      "end": 993870,
      "speaker": "G",
      "start": 975340,
      "text": "Meetups und Konferenzen sind ziemlich großartig, um andere Developer Perspektiven kennenzulernen und um Perspektiven zu entdecken, die man noch nicht kennt. Und um vielleicht auch neue Themengebiete zu sehen, die man vorher noch nie gesehen hat, weil dieses Feld wird immer breiter und da gibt es immer die Überraschung, die nächste Ecke."
    },
    {
      "confidence": 0.9401757,
      "end": 996202,
      "speaker": "B",
      "start": 994530,
      "text": "Ja, ich glaube, der schlägt voll in."
    },
    {
      "confidence": 0.9988686,
      "end": 999466,
      "speaker": "A",
      "start": 996226,
      "text": "Deine Nische, die du gerade gesagt hast, oder was du auch so schön findest."
    },
    {
      "confidence": 0.88803345,
      "end": 1009822,
      "speaker": "B",
      "start": 999498,
      "text": "Am Web Engineering Meetup Düsseldorf, dass es halt nicht spezifisch ist auf ein CMS oder auf eine Technologie oder eine Programmiersprache, sondern sondern so ein wilder Mix und dass man halt vielleicht immer überrascht ist."
    },
    {
      "confidence": 0.89576715,
      "end": 1027742,
      "speaker": "C",
      "start": 1009926,
      "text": "Wir versuchen ja in Inspo Gamer einen Tech Talk und einen nicht technischen Talk zu haben. Und du glaubst gar nicht, wie schwierig es ist, Speaker zu finden, die den nicht technischen Talk halten, weil man einfach so gefangen ist in dieser Tech Bubble. Da ist Tellerrand einfach super, aber es ist schwieriger, Leute zu finden. Man glaubt es kaum."
    },
    {
      "confidence": 0.95201427,
      "end": 1032302,
      "speaker": "A",
      "start": 1027806,
      "text": "Und das ist jetzt hier, es klingt jetzt so ein bisschen so Selbstbeweihräucherung, aber ich meine, das ist auch irgendwie so."
    },
    {
      "confidence": 0.94656,
      "end": 1034498,
      "speaker": "B",
      "start": 1032326,
      "text": "Die Art und Weise, wie wir diesen Podcast hier machen."
    },
    {
      "confidence": 0.95290315,
      "end": 1044682,
      "speaker": "A",
      "start": 1034654,
      "text": "Wir versuchen die Leute mit technischen Themen irgendwie so zu angeln. Und wenn die uns dann zuhören und eine neue Episode mal rauskommt, die nicht technisch ist, dann hoffen wir natürlich, dass."
    },
    {
      "confidence": 0.9898414,
      "end": 1045978,
      "speaker": "B",
      "start": 1044706,
      "text": "Die Leute sich die auch anhören, damit."
    },
    {
      "confidence": 0.9485581,
      "end": 1053322,
      "speaker": "A",
      "start": 1045994,
      "text": "Wir die ja, und so nenne ich das jetzt mal, aktiv und brutal über den Tellerrand schubsen, so ein bisschen zwingen."
    },
    {
      "confidence": 0.9147016,
      "end": 1071068,
      "speaker": "B",
      "start": 1053386,
      "text": "Und das kann natürlich auch Strategie von Meetups sein, dass sie jemanden mit einem technischen Talk locken, so wie ihr das macht und dann ach, jetzt sitze ich gerade eh hier, komm, der nächste Talk startet in fünf Minuten, dann lerne ich mal was über Robotik. Oder welchen nicht technischen Talk hattet ihr in letzter Zeit?"
    },
    {
      "confidence": 0.87810725,
      "end": 1079020,
      "speaker": "C",
      "start": 1071124,
      "text": "Wir hatten kürzlich einen sehr coolen Talk von der Katharina Schermbeck, die gesprochen hat über Inklusion durch Roboter."
    },
    {
      "confidence": 0.93412334,
      "end": 1083404,
      "speaker": "B",
      "start": 1079100,
      "text": "Da war ich mit meiner Robotik ja gar nicht so weit entfernt und das war jetzt völliger Zufall."
    },
    {
      "confidence": 0.93704283,
      "end": 1085772,
      "speaker": "A",
      "start": 1083532,
      "text": "Aber Thema Tellerrand, da hat auch der."
    },
    {
      "confidence": 0.8867,
      "end": 1087244,
      "speaker": "B",
      "start": 1085796,
      "text": "Chef was dazu zu sagen."
    },
    {
      "confidence": 0.8297887,
      "end": 1096088,
      "speaker": "A",
      "start": 1087292,
      "text": "Sechs und vierzig Jahre früher Fullstack, nun frontend Entwickler mit seiner geilen Pan Anschlein came for the full stack, stayed for the frontend."
    },
    {
      "confidence": 0.88544095,
      "end": 1102744,
      "speaker": "B",
      "start": 1096184,
      "text": "Und noch als Shep ist Podcast Host beim Working Graph Podcast, verlinken wir auch in den Shownotes, hört da mal rein."
    },
    {
      "confidence": 0.92590857,
      "end": 1109944,
      "speaker": "C",
      "start": 1102792,
      "text": "Ich würde fast sagen ein Urgestein war ja auch schon bei uns in Episode jetzt Andi auswendig, das war jetzt geschummelt."
    },
    {
      "confidence": 0.93297935,
      "end": 1114552,
      "speaker": "B",
      "start": 1109992,
      "text": "Die Pause hat der Wolfgang gerade rausgeschnitten. Episode neun und achtzig im September, drei und zwanzig."
    },
    {
      "confidence": 0.813245,
      "end": 1118780,
      "speaker": "A",
      "start": 1114696,
      "text": "Aber Shep, warum gehst du noch zu Meetups?"
    },
    {
      "confidence": 0.94178814,
      "end": 1192902,
      "speaker": "H",
      "start": 1119750,
      "text": "Ich würde mich da anschließen. Also es sind ähnliche Motivationen. Zum einen sind natürlich die Themen und Talks auch immer interessant. Also ich bin einfach wissensgierig und klar, es gibt natürlich auch irgendwie manche Themen, da bin ich einfach raus. Aber generell bin ich auch interessiert, über den Tellerrand zu schauen. Und oft ist es so, dass man Talks hat, vielleicht auch Detalks, von denen man am wenigsten erwartet für sich selber, wo man dann feststellt, wow, die haben mich jetzt irgendwie komplett überrascht und ich habe super viel dazugelernt. Also einfach nicht so in der eigenen Suppe schwimmen ist cool. Und natürlich dann auch die Community, die man trifft, der Austausch, auch der Austausch über das Thema. Manchmal ist das ja so ein bisschen so eine Anregung für alle und man denkt so drüber nach und hat dann Ideen dazu und dann gibt es die Fragerunde hinterher und dann reicht es vielleicht trotzdem nicht oder es fällt einem erst später beim Bier noch was dazu ein. So diese ganze Dynamik, die daraus entsteht, die ist halt toll. Könnte sich jetzt vielleicht auch einfach treffen auf ein Bier ohne Vorträge, dann wäre es in dem Sinne vielleicht kein Meet Up, aber ich glaube, das würde auch nicht so gut funktionieren. Also man braucht schon diesen Rahmen, diesen Aufhänger, so ein bisschen brain food, das jemand toll vorbereitet hat und dann funktioniert das halt super."
    },
    {
      "confidence": 0.9597,
      "end": 1195490,
      "speaker": "I",
      "start": 1193006,
      "text": "Was war denn der letzte Talk, der dich überrascht hat?"
    },
    {
      "confidence": 0.9265219,
      "end": 1238376,
      "speaker": "H",
      "start": 1198160,
      "text": "Ja, also es sind eigentlich einfach so Themenfelder. Also jetzt zum Beispiel heute hatten wir einen Talk über Web Application Firewalls, von dem ich persönlich so die Vermutung hatte, ich bin da raus. Also ich werde einfach so Löcher in die Decke starren. Genau, aber dem war halt überhaupt nicht so und ich habe einfach verstanden, wie die arbeiten, vom Grundkonzept her, welches gibt. Also beim nächsten Mal in der Runde, wenn dann mir wieder irgendwas, irgendein Security Thema aufkommt, dann werde ich einfach mal so ein bisschen so den Experten raushängen lassen und ein paar Begriffe, die ich heute aufgeschnappt hab, fallen lassen und allen wird der Kiefer runterklappen."
    },
    {
      "confidence": 0.907595,
      "end": 1240216,
      "speaker": "I",
      "start": 1238488,
      "text": "Teuer verkaufte Regular Experten."
    },
    {
      "confidence": 0.94770336,
      "end": 1254354,
      "speaker": "H",
      "start": 1240328,
      "text": "Genau. Also ja, das fand ich sowieso am allercoolsten, dass eigentlich diese Systeme nur auf unfassbar komplexen regulären Ausdrücken aufbauen und es dafür sogar Tools gibt, um diese komplexen regulären Ausdrücke überhaupt zusammenzubauen."
    },
    {
      "confidence": 0.91155183,
      "end": 1265202,
      "speaker": "C",
      "start": 1254402,
      "text": "Also Wahnsinn, du bist ja für mich der Buzzword König, Andi. Jetzt ist mir klar, warum du ein Meetup damals gestartet hast. Es ist einfach, um deine Chancen beim Bullshit Bingo zu erhöhen."
    },
    {
      "confidence": 0.934164,
      "end": 1270098,
      "speaker": "A",
      "start": 1265266,
      "text": "Jetzt wirfst du mir das zwar vor, meine Frage ist, wie hoch ist die Dunkelzimmer."
    },
    {
      "confidence": 0.63857,
      "end": 1270914,
      "speaker": "B",
      "start": 1270194,
      "text": "Dunkel."
    },
    {
      "confidence": 0.82279,
      "end": 1272242,
      "speaker": "C",
      "start": 1271042,
      "text": "Die Dunkelzimmer."
    },
    {
      "confidence": 0.9578611,
      "end": 1277522,
      "speaker": "B",
      "start": 1272386,
      "text": "Wie hoch ist die Dunkelziffer von den Leuten, die dich bereits erfolgreich mit diesem Buzzword Bingo geblendet haben?"
    },
    {
      "confidence": 0.94444513,
      "end": 1301264,
      "speaker": "C",
      "start": 1277546,
      "text": "Ja, Buzzword Bingo ist ja nicht unbedingt schlecht, also wenn man viel weiß und ich sehe das eigentlich auch so, also man lernt schon viel und auch buzzwords oder vielleicht Wörter, die man mal gehört hat, man kennt, dass es da die Technik gibt, aber wenn man halt zwanzig Minuten Vortrag dazu hört, dann kann man dann schon auch jeweils was lernen und mitnehmen. Dann hat man bisschen mehr als die absolute Oberfläche oder nur Password. Also ich finde es schon sinnvoll."
    },
    {
      "confidence": 0.90977144,
      "end": 1304016,
      "speaker": "A",
      "start": 1301312,
      "text": "Beim Schep hat es jetzt so geklungen, als konnte er jetzt nach dem Talk."
    },
    {
      "confidence": 0.92238086,
      "end": 1314222,
      "speaker": "B",
      "start": 1304048,
      "text": "Jetzt keine Web Application Firewall selbst programmieren, aber dass er jetzt mal ungefähr weiß, okay, so funktionieren die grundlegend, okay, das sind die Limits und so, das muss ich schon sagen, finde ich ganz cool."
    },
    {
      "confidence": 0.97885334,
      "end": 1315614,
      "speaker": "A",
      "start": 1314286,
      "text": "Aber das war nicht mein Hauptpunkt."
    },
    {
      "confidence": 0.7261767,
      "end": 1317294,
      "speaker": "B",
      "start": 1315662,
      "text": "Natürlich Tellerrand, blablablub."
    },
    {
      "confidence": 0.8985995,
      "end": 1321934,
      "speaker": "A",
      "start": 1317342,
      "text": "Was ich richtig, richtig schön fand ist, dass er sagte, man könnte sich ja mal auf ein Bier treffen, aber ist."
    },
    {
      "confidence": 0.9182037,
      "end": 1332126,
      "speaker": "B",
      "start": 1321942,
      "text": "Irgendwie nicht das Gleiche. Und da hat er ja vielleicht auch recht, weil du kennst die ganzen Leute vielleicht, du hast sie schon mal ein paar mal gesehen und bist auch vielleicht auf LinkedIn connected und dann denkt man sich, mit dem müsste ich mich mal wieder auf ein Bier treffen."
    },
    {
      "confidence": 0.9039757,
      "end": 1336200,
      "speaker": "A",
      "start": 1332158,
      "text": "Und da war das Wort schon man müsste mal, das macht ja eh keiner."
    },
    {
      "confidence": 0.9063252,
      "end": 1342772,
      "speaker": "B",
      "start": 1336540,
      "text": "Weil ach ja, das mache ich gleich, wenn ich wieder zu Hause bin, hast du es wieder vergessen. Da ist es dann wieder auf Meetup."
    },
    {
      "confidence": 0.8146943,
      "end": 1344980,
      "speaker": "A",
      "start": 1342836,
      "text": "Da ist eh man da zusammen trinkt."
    },
    {
      "confidence": 0.9290578,
      "end": 1353636,
      "speaker": "B",
      "start": 1344980,
      "text": "Ein Bier oder alkoholfreies Bier oder eine Limo oder was weiß ich, ist egal. Und das finde ich glaube ich auch das schöne, so nach dem hey, mit dem wollte ich mich eh noch mal treffen."
    },
    {
      "confidence": 0.9317192,
      "end": 1374610,
      "speaker": "C",
      "start": 1353668,
      "text": "Und unsere letzte Stimme zu dieser Frage ist weder eine tiroler Stimme und zwar vom Simon, der sich ganz klassisch, wie sich so gehört für dieses tiroler Klischee, mit Lawinen beschäftigt und ganz viel Datenmanagement und er ist auch verantwortlich, jeder, der mal in Tirol auf den Lawinenlagebericht blickt, die Systeme dahinter, da ist der Simon auch ganz stark involviert."
    },
    {
      "confidence": 0.91246337,
      "end": 1404400,
      "speaker": "J",
      "start": 1375590,
      "text": "Ganz viele Anregungen über Themen, über Projekte, über Software, von denen man vorher nichts gehört hat oder mit denen man vorher nichts verbunden hat und im Endeffekt die Gesichter, die hinter diesen Projekten stehen. Also einfach die Erkenntnis, dass jedes Open Source Projekt von irgendwelchen Personen im Hintergrund, oft in der Freizeit betreut wird und dass man die Leute mal getroffen hat und mit denen dann einmal über irgendwas geredet hat."
    },
    {
      "confidence": 0.97993,
      "end": 1406996,
      "speaker": "B",
      "start": 1405260,
      "text": "Da muss ich als Open Source Fan."
    },
    {
      "confidence": 0.95409286,
      "end": 1409316,
      "speaker": "A",
      "start": 1407028,
      "text": "Und auch als Engineering Manager und Co."
    },
    {
      "confidence": 0.9332527,
      "end": 1424174,
      "speaker": "B",
      "start": 1409468,
      "text": "Ganz großen Applaus versenden. Besonders diese Gesichter hinter den Projekten, die Erkenntnis, dass da Menschen hinter stehen. Ich würde mir wünschen, dass mehr Leute solche Gedanken haben, dann würde es vielleicht nicht immer diesen Open Source Hass in irgendwelchen Issues geben."
    },
    {
      "confidence": 0.92504203,
      "end": 1455126,
      "speaker": "C",
      "start": 1424222,
      "text": "Da übrigens auch eine sehr tolle Erfolgsgeschichte, auch wo der Simon teilweise involviert war, da hat es ein Forschungsprojekt gegeben zu einer neuen Plattform eben für Lawinenlageberichte, die ist open source gestellt worden und da würde man ja eigentlich eher so denken, okay, das versandet dann, weil es ist halt sehr spezifisch. Aber das Ganze wird mittlerweile, ich glaube in Spanien eingesetzt, in Kanada eingesetzt, in mehrere Regionen in Österreich eingesetzt. Also das hat wirklich die Runde gemacht und wird jetzt aktiv in mehreren Ländern eingesetzt. Da hat sich mal eine Förderung wirklich."
    },
    {
      "confidence": 0.93316,
      "end": 1456934,
      "speaker": "A",
      "start": 1455158,
      "text": "Rentiert, auch hört man nicht so oft."
    },
    {
      "confidence": 0.9375718,
      "end": 1473098,
      "speaker": "B",
      "start": 1456982,
      "text": "Zumindest hat man diesen Feedback Loop nicht, oft werden die Förderungen ausgeschüttet und dann weiß man nie, was damit passiert. Aber finde ich immer wirklich schön zu hören, was ist daraus eigentlich passiert? Wir haben initial davon gesprochen, dass wir vier Fragen gestellt haben und im Intro habe ich auch die Corona Pandemie erwähnt."
    },
    {
      "confidence": 0.9264214,
      "end": 1475498,
      "speaker": "A",
      "start": 1473194,
      "text": "Und die Corona Pandemie hat auch zu."
    },
    {
      "confidence": 0.9527856,
      "end": 1492618,
      "speaker": "B",
      "start": 1475554,
      "text": "Virtuellen Meetups und zu virtuellen Konferenzen geführt. Deswegen kam die Frage, denkst du, dass virtuelle Meetups und Konferenzen genauso wertvoll sind wie physische? Warum oder warum nicht? Und Simon, zwei und dreiig Jahre alt, aktuell Zeit Reliability Engineer, selbstständig, hat dazu eine Meinung."
    },
    {
      "confidence": 0.96188,
      "end": 1497138,
      "speaker": "C",
      "start": 1492794,
      "text": "Warum erwähnst du dieses Alter eigentlich immer so? Warum ist dir das Alter so wichtig?"
    },
    {
      "confidence": 0.9197897,
      "end": 1510802,
      "speaker": "A",
      "start": 1497274,
      "text": "Ganz einfach, ich denke, das Alter ist ein Indikator für die Lebenslage. Wenn ich jemanden habe, der ist zwanzig oder neunzehn, der hat mit hoher Wahrscheinlichkeit eine erhöhte Freizeit oder wenigere Verpflichtungen, als."
    },
    {
      "confidence": 0.86842126,
      "end": 1514114,
      "speaker": "B",
      "start": 1510826,
      "text": "Wenn jemand vierzig, zwei und vierzig und co."
    },
    {
      "confidence": 0.916392,
      "end": 1515842,
      "speaker": "A",
      "start": 1514202,
      "text": "Ist und auch weniger Erfahrung."
    },
    {
      "confidence": 0.91591287,
      "end": 1518706,
      "speaker": "B",
      "start": 1515906,
      "text": "Das bedeutet, man investiert gegebenenfalls sogar mehr."
    },
    {
      "confidence": 0.88964117,
      "end": 1528066,
      "speaker": "A",
      "start": 1518778,
      "text": "In oh, ich sauge alles auf wie ein Schwamm versus man ist sechs und vierzig. Einfach mal als Beispiel. Ah OK, die aktuellen Hypes sind eh."
    },
    {
      "confidence": 0.9901725,
      "end": 1530290,
      "speaker": "B",
      "start": 1528098,
      "text": "Alles Wiederholungen aus ein tausend, neun hundert, achtzig."
    },
    {
      "confidence": 0.8704247,
      "end": 1533650,
      "speaker": "A",
      "start": 1530370,
      "text": "Das ist eine Erkenntnis, die mit Erfahrung kommt. Deswegen denke ich, ist das Alter schon."
    },
    {
      "confidence": 0.9367484,
      "end": 1542338,
      "speaker": "B",
      "start": 1533690,
      "text": "Eine Relevanz, damit man ungefähr weiß, wie ist es einzuordnen. Die nächste Thematik ist natürlich besonders bei so einer Frage mit virtuellen Konferenzen und Meetups."
    },
    {
      "confidence": 0.9423938,
      "end": 1548210,
      "speaker": "A",
      "start": 1542514,
      "text": "Die Jüngeren sind wohl eher YouTube angezogen als die Älteren, die vielleicht noch im klassischen Fernsehen."
    },
    {
      "confidence": 0.91452664,
      "end": 1556720,
      "speaker": "C",
      "start": 1548290,
      "text": "Okay, dann übergebe ich das Wort Simon, der mit zwei und dreiig Jahren fast einer der jüngsten in unserer gesamten Gruppe von Interviewten ist."
    },
    {
      "confidence": 0.9172195,
      "end": 1597290,
      "speaker": "K",
      "start": 1557500,
      "text": "Nein, gar nicht. Ich habe ein paar mal an zum Beispiel Pconf teilgenommen, die ist eine ein hundert Prozent Remotekonferenz. Da kommt überhaupt nicht dasselbe bei vor. Also die Talks guckt man sich nicht an, weil werden hinterher sowieso auf YouTube veröffentlicht, was ja auch bei wirklich physischen Konferenzen auch immer wieder stattfindet. Aber dann die Alternative dazu, der Hallway Track, der findet dann halt, das ist ein Chatraum und da irgendwie ins Gespräch zu kommen ist sehr schwierig. Und ja, was ich bei mir dann am Ende festgestellt habe, ich keine Ahnung, nächster Tagesschau oder spreche mit Leuten in Discord oder whatever, funktioniert nicht."
    },
    {
      "confidence": 0.9434029,
      "end": 1601838,
      "speaker": "B",
      "start": 1598950,
      "text": "Der berühmt berüchtigte Hallway Track, was ich."
    },
    {
      "confidence": 0.90012,
      "end": 1606126,
      "speaker": "A",
      "start": 1601894,
      "text": "Da immer so ein bisschen, da bin ich immer ein bisschen zwiegespalten. Auf der einen Seite finde ich ihn wirklich interessant."
    },
    {
      "confidence": 0.91230786,
      "end": 1616944,
      "speaker": "B",
      "start": 1606158,
      "text": "Du kommst raus aus einem Vortragsraum, ganz viele Leute stehen da, Grüppchen bilden sich natürlich irgendwie. Du stellst dich einfach dazu und lauscht zu einem Gespräch. Fühlt sich im ersten Moment ziemlich weird."
    },
    {
      "confidence": 0.9532275,
      "end": 1623296,
      "speaker": "A",
      "start": 1616992,
      "text": "An, sich einfach bei fremden Leuten hinstellen und ich habe das Gefühl, da gehört auch eine ganze Menge Mut zu und auch mal vielleicht mal was zu sagen."
    },
    {
      "confidence": 0.9492,
      "end": 1625648,
      "speaker": "B",
      "start": 1623408,
      "text": "Deswegen ist das vielleicht nur so vielleicht."
    },
    {
      "confidence": 0.84109855,
      "end": 1628320,
      "speaker": "A",
      "start": 1625664,
      "text": "Was für extrovertiertere Leute und weniger für."
    },
    {
      "confidence": 0.8893014,
      "end": 1632368,
      "speaker": "B",
      "start": 1628360,
      "text": "Introvertierte oder schüchterne Leute. Ich weiß es nicht. Zumindest wenn man allein unterwegs ist."
    },
    {
      "confidence": 0.936619,
      "end": 1636026,
      "speaker": "A",
      "start": 1632424,
      "text": "Zum Thema Interaktion hat Niklas auch noch was zu sagen."
    },
    {
      "confidence": 0.9228567,
      "end": 1638990,
      "speaker": "B",
      "start": 1636058,
      "text": "Ein und dreiig Jahre alt, backend Softwareentwickler bei Check."
    },
    {
      "confidence": 0.94397986,
      "end": 1665300,
      "speaker": "L",
      "start": 1640210,
      "text": "Ich glaube, dass vor Ort schon noch mal mehr gibt. Vom sozialen Wert schon einfach. Man kommt glaube ich einfacher in Kontakt, kann mehr auf andere Leute vielleicht die man noch nicht kennt, einfacher zugehen, finde ich. Ja, in der Interaktion geht glaube ich schon auch online viel immer verloren. Ich glaube das auch veritable und sinnvolle Sache, das zu tun. Als Ergänzung, vielleicht nicht unbedingt als Ersetzung."
    },
    {
      "confidence": 0.95944464,
      "end": 1686022,
      "speaker": "C",
      "start": 1666040,
      "text": "Was ich da schon interessant finde, ist, dass man uns ja sehr oft vorwirft, dass wir eher so introvertierte Leute sind, die Angst haben, andere Leute zu kontaktieren. Und jetzt war schon zweimal eigentlich dieses physikalisch ist es leichter Leute anzusprechen als virtuell, was komplett in die Gegenrichtung eigentlich schlägt. Finde ich sehr interessant."
    },
    {
      "confidence": 0.94109875,
      "end": 1689210,
      "speaker": "B",
      "start": 1686136,
      "text": "Mit wir meinst du die Software Engineering Community?"
    },
    {
      "confidence": 0.856005,
      "end": 1692602,
      "speaker": "C",
      "start": 1689370,
      "text": "Wir als vorurteilsbehaftete Techies?"
    },
    {
      "confidence": 0.9626371,
      "end": 1696826,
      "speaker": "B",
      "start": 1692746,
      "text": "Genau, wollte ich nämlich gerade auch sagen. Stereotypen hin oder her, ist eine interessante."
    },
    {
      "confidence": 0.94681716,
      "end": 1723844,
      "speaker": "A",
      "start": 1696858,
      "text": "Beobachtung, stimme ich dir zu. Was ich aber wirklich schön fand, ist, dass Niklas etwas sehr explizites ausgesprochen hat, und zwar, dass er zwar eine Vorliebe für physikalische Meetups hat, aber virtuelle als Ergänzung, aber nicht als Ersetzung sieht. Ich finde es schön, dass er wirklich sagt okay, es gibt Raum für beide Formate und als Ergänzung finde ich das auch wirklich eine smarte Nummer, weil du hast natürlich bei Remotekonferenzen die Aufnahmemöglichkeit und."
    },
    {
      "confidence": 0.92312,
      "end": 1726036,
      "speaker": "B",
      "start": 1723932,
      "text": "Somit natürlich auch das Playback später."
    },
    {
      "confidence": 0.9067593,
      "end": 1733252,
      "speaker": "A",
      "start": 1726068,
      "text": "Und du kannst dich immer wieder darauf referenzieren. Und bei Meetups musst du sagen ja, ich war mal bei einem Meetup, da habe ich mal gehört und du hast."
    },
    {
      "confidence": 0.964803,
      "end": 1736100,
      "speaker": "B",
      "start": 1733316,
      "text": "Keine Datenquelle, die man dann aus der Schublade holen kann."
    },
    {
      "confidence": 0.93114865,
      "end": 1739904,
      "speaker": "C",
      "start": 1736140,
      "text": "Ihr in Düsseldorf nehmt beim Meetup nichts auf oder habe ich das falsch im Kopf?"
    },
    {
      "confidence": 0.99997574,
      "end": 1741024,
      "speaker": "B",
      "start": 1739952,
      "text": "In den ersten paar Jahren habe ich."
    },
    {
      "confidence": 0.8798971,
      "end": 1744512,
      "speaker": "A",
      "start": 1741032,
      "text": "Mir darüber mal Gedanken gemacht und ich habe es dann verworfen, einfach nur aus."
    },
    {
      "confidence": 0.88799274,
      "end": 1749520,
      "speaker": "B",
      "start": 1744536,
      "text": "Dem Grund, da es unglaublich viel Aufwand ist, ein Talk aufzunehmen."
    },
    {
      "confidence": 0.95933807,
      "end": 1754944,
      "speaker": "A",
      "start": 1749600,
      "text": "Du musst ja nicht nur eine Kamera haben, die den Speaker filmt, sondern du musst ja auch den Laptop mitschneiden, du."
    },
    {
      "confidence": 0.9044697,
      "end": 1770712,
      "speaker": "B",
      "start": 1754952,
      "text": "Musst das Audio mitschneiden und dann später noch ein Intro, ein Outro backen und alles zusammenbundeln und so weiter und so fort. Heutzutage ist das gegebenenfalls ein bisschen einfacher in zwei tausend fünf und zwanzig, aber in zwei Tausend fünfzehn war das halt nicht so einfach bzw. Mit sehr viel Aufwand verbunden. Und deswegen haben wir es damals verworfen. Und so viel ich weiß, wird es aktuell auch nicht aufgezeichnet."
    },
    {
      "confidence": 0.9681905,
      "end": 1782728,
      "speaker": "C",
      "start": 1770776,
      "text": "Ja, wir haben uns sogar bewusst dagegen entschieden, weil es gibt genug Talks auf YouTube, die du dir anschauen kannst und wir wollen nicht konkurrieren. Wir wollen ein cooles Event vor Ort schaffen, wo man eben wirklich Leute erlebt."
    },
    {
      "confidence": 0.95865846,
      "end": 1786056,
      "speaker": "B",
      "start": 1782824,
      "text": "Dass man aber aktiv darüber spricht und Entscheidungen trifft, finde ich auch gut."
    },
    {
      "confidence": 0.88266855,
      "end": 1789352,
      "speaker": "A",
      "start": 1786128,
      "text": "Aber was auch virtuelle Konferenzen für Herausforderungen."
    },
    {
      "confidence": 0.92092,
      "end": 1793666,
      "speaker": "B",
      "start": 1789416,
      "text": "Haben, das erzählt uns Moritz, dreiig Jahre alt, Fullstack Entwickler bei der Metro."
    },
    {
      "confidence": 0.8848914,
      "end": 1801410,
      "speaker": "C",
      "start": 1793728,
      "text": "Andi, kennst du Herzblatt? Das hat mir jetzt genauso geklungen. Jetzt kommt Moritz, dreiig Jahre Alt und erzählt uns etwas über XY."
    },
    {
      "confidence": 0.9948489,
      "end": 1803678,
      "speaker": "B",
      "start": 1801750,
      "text": "Ja, kenne ich. So alt bin ich auch noch."
    },
    {
      "confidence": 0.918938,
      "end": 1806090,
      "speaker": "C",
      "start": 1803814,
      "text": "Okay, aber Moritz, leg los."
    },
    {
      "confidence": 0.9238679,
      "end": 1834860,
      "speaker": "M",
      "start": 1806870,
      "text": "Ich bin nicht so ein Fan von so virtuellen Sachen, gerade wenn man dann auch, weil man sagt, man fährt jetzt von der Arbeit auf eine Konferenz, dann sagt man ja, der Laptop bleibt jetzt zu und kann vielleicht abends die E Mails checken und man ist aber den ganzen Tag auf der Konferenz Konferenz und beschäftigt sich mit den Sachen auf der Konferenz. Und bei so einem virtuellen, dann kommt noch mal eine e Mail rein oder eine Teams Nachricht und dann ist man abgelenkt und ist gar nicht mehr bei der wirklichen Konferenz. Deswegen finde ich es wesentlich besser, wenn sowas vor Ort ist, man sich auch voll drauf konzentrieren kann."
    },
    {
      "confidence": 0.88676935,
      "end": 1844352,
      "speaker": "A",
      "start": 1836120,
      "text": "Virtuelle Konferenzen bzw. Virtuelle Meetups konkurrieren mit der höchsten Währung der Welt aktuell, deiner Aufmerksamkeitsspanne."
    },
    {
      "confidence": 0.91842633,
      "end": 1851130,
      "speaker": "B",
      "start": 1844416,
      "text": "Eine e Mail kommt rein, dann ist man natürlich nicht mehr bei Meetup Talk. Genauso wie Instagram, TikTok, Snapchat, Facebook und Co."
    },
    {
      "confidence": 0.98754,
      "end": 1853706,
      "speaker": "A",
      "start": 1851250,
      "text": "Habe ich auch schon sehr, sehr oft selbst erlebt."
    },
    {
      "confidence": 0.93631124,
      "end": 1858714,
      "speaker": "B",
      "start": 1853818,
      "text": "Da muss man sich wirklich, wirklich fokussieren. Vielleicht das Video auf Full Screen machen oder ähnliches."
    },
    {
      "confidence": 0.9525586,
      "end": 1861578,
      "speaker": "A",
      "start": 1858842,
      "text": "Aber diese Second Screen Generation, da machen."
    },
    {
      "confidence": 0.9625777,
      "end": 1865178,
      "speaker": "B",
      "start": 1861594,
      "text": "Wir uns mal nichts vor. Wirklich konzentriert kann man da nicht bei sein."
    },
    {
      "confidence": 0.8995683,
      "end": 1869230,
      "speaker": "C",
      "start": 1865234,
      "text": "Und Chap hat natürlich auch noch was zu sagen zu virtuelle Meetups."
    },
    {
      "confidence": 0.9463975,
      "end": 1950510,
      "speaker": "H",
      "start": 1870050,
      "text": "Ich finde beide, beide haben so ihre vor und Nachteile. Also die vor Ort sind natürlich toll, weil man einfach eben Leute trifft. Auch die Bratwurst schmeckt natürlich besser, als wenn man sie zu Hause vor dem Rechner irgendwie selber grillt, auf dem mobilen Grill. Genau. Ich selber habe ja tatsächlich auch ein virtuelles Meetup, das einmal im Monat tagt, das CSS Café. Und das gibt es aus dem Grund, also es ist auch zu Corona entstanden, aber das ist halt ein super spitzes Thema und es wäre ein Ding der Unmöglichkeit, dann physisches Meetup überhaupt zu veranstalten, weil einfach so wenig Leute sich damit beschäftigen. Und dann hätte man eben nur drei Leute, die sich gegenseitig immer ihre CSS Sachen zeigen. Das funktioniert halt nur online. Und der andere Vorteil ist, also abgesehen davon, dass man vielleicht auch Meetups zu bestimmten Themen haben kann, die es sonst nicht gäbe, ist einfach, dass es low friction ist und sehr inklusiv. Also jeder Mann, jede Frau, egal wo sie wohnen, auf dem Land, mit Kindern irgendwie, die um einen rum wohnen, einfach schnell in so ein Meetup reingehen können, was lernen können, auch ein bisschen mit den Leuten connecten können, weil wir haben auch so eine Frage Antwort Runde hinterher und da bildet sich auch eine Community. Es ist aber eben dann wesentlich weniger eng und stark, wie das eben jetzt bei so lokalen Meetups der Fall ist."
    },
    {
      "confidence": 0.85834074,
      "end": 1955042,
      "speaker": "C",
      "start": 1951290,
      "text": "Man merkt schon, Shape ist ein Gourmet. Zuerst das Bier und jetzt die Bratwurst."
    },
    {
      "confidence": 0.96960235,
      "end": 1961102,
      "speaker": "A",
      "start": 1955106,
      "text": "Ich weiß ja nicht, wie du eine virtuelle Bratwurst isst. Ich habe noch nie eine gegessen am."
    },
    {
      "confidence": 0.777858,
      "end": 1962558,
      "speaker": "C",
      "start": 1961126,
      "text": "Heimgrill, hat er gemeint, oder?"
    },
    {
      "confidence": 0.92345,
      "end": 1974014,
      "speaker": "B",
      "start": 1962614,
      "text": "Aber das, was er angesprochen hat, sehr nischige Themen, dass dafür virtuelle Meetups irgendwie sinnhaftig sind, finde ich super. Habe ich so noch nie drüber nachgedacht. Komplett neue Perspektive und besonders mit dem CSS Café."
    },
    {
      "confidence": 0.9161859,
      "end": 1981198,
      "speaker": "A",
      "start": 1974062,
      "text": "Ich weiß jetzt nicht, ob CSS ein nischiges Thema ist, soweit würde ich mich jetzt nicht aus dem Fenster lehnen, aber im Bereich Düsseldorf, Köln und Co."
    },
    {
      "confidence": 0.9805914,
      "end": 1984414,
      "speaker": "B",
      "start": 1981334,
      "text": "Dauerhaft Speaker, um das Thema CSS zu."
    },
    {
      "confidence": 0.94669867,
      "end": 1990656,
      "speaker": "A",
      "start": 1984422,
      "text": "Finden, ist glaube ich schon eine große Herausforderung. Aber natürlich auch, um die, ich sag."
    },
    {
      "confidence": 0.9015036,
      "end": 1994640,
      "speaker": "B",
      "start": 1990688,
      "text": "Mal, die Halle vollzukriegen, also den Raum vollzukriegen. Das stimmt schon."
    },
    {
      "confidence": 0.9030167,
      "end": 2006512,
      "speaker": "A",
      "start": 1994680,
      "text": "Und ich glaube, der Simon hat vorher die P Conf erwähnt, da ging es auch um All things Performance. Weiß ich jetzt nicht, ist auch jetzt nicht so nischiges Thema, aber natürlich die."
    },
    {
      "confidence": 0.99422854,
      "end": 2008288,
      "speaker": "B",
      "start": 2006536,
      "text": "Audienz, da kann man natürlich die ganze."
    },
    {
      "confidence": 0.89479834,
      "end": 2012592,
      "speaker": "A",
      "start": 2008304,
      "text": "Sache auch deutlich zugänglicher machen. Also interessanter Blickwinkel und vor allem, dass."
    },
    {
      "confidence": 0.9428316,
      "end": 2034568,
      "speaker": "C",
      "start": 2012616,
      "text": "Du Leute auch von woanders her die Chance gibst zu joinen. Also Jep hat gemeint vom Land, aber es gibt natürlich auch Nischenthemen, wo du dann einfach größeres Publikum hast, wenn du ganz Deutschland, Österreich und die Schweiz oder so abdeckst, wenn es deutschsprachig ist. Also wenn du nur in deiner Stadt unterwegs bist und dann nur die Leute hast, die halt wirklich die Zeit haben, da auch am Abend vorbeizuschauen."
    },
    {
      "confidence": 0.95040226,
      "end": 2041320,
      "speaker": "A",
      "start": 2034664,
      "text": "Also wer in einem sehr nischigen Thema unterwegs ist, sollte sich mal virtuelle Meetups ansehen. Ich weiß zum Beispiel auch, dass für."
    },
    {
      "confidence": 0.91344297,
      "end": 2050484,
      "speaker": "B",
      "start": 2041360,
      "text": "Andere nischige Themen, wie zum Beispiel mechanische Tastaturen, eine sehr lebendige Discord Community gibt. Also da gibt es schon was. Also da muss man sich glaube ich."
    },
    {
      "confidence": 0.9151729,
      "end": 2051972,
      "speaker": "A",
      "start": 2050572,
      "text": "Und ich glaube auch Reddit ist so."
    },
    {
      "confidence": 0.8936876,
      "end": 2056996,
      "speaker": "B",
      "start": 2051996,
      "text": "Der beste Beweis, oder? Ich meine, es gibt ja Subreddits, glaube ich, für alles. Deswegen, warum nicht auch auf Meetup datieren?"
    },
    {
      "confidence": 0.9092864,
      "end": 2082180,
      "speaker": "C",
      "start": 2057028,
      "text": "Okay, und jetzt haben wir ja schon gesprochen über das ganze Networking und jetzt war natürlich auch unsere hat denn der Besuch von einem Meetup schon einmal deine Karriere beeinflusst? Also hat diese Bratwurst beim Bier in irgendeiner Form mal, ich vermute mal positiv auf deine Karriere eingewirkt? Und Dario von Check darf, also Andi muss ja das Alter sagen, zwei und dreiig Jahre alt. Also Dario, haben Meetups deine Karriere beeinflusst?"
    },
    {
      "confidence": 0.90987206,
      "end": 2139880,
      "speaker": "D",
      "start": 2083000,
      "text": "Massiv, massiv. Ich lerne sehr schnell dadurch, dass ich mir Talks anhöre und einzelne Informationen aufschnappe und dieses sogenannte beifahrer Wissen habe. Das heißt, ich höre mir einen Text an, wo vielleicht ein Thema oberflächlich präsentiert wird und ich kann dann sehr schnell zusammen Zusammenhänge ziehen. Das heißt, wenn ich dann im Beruf, in meiner Karriere einem Problem konfrontiert bin, dann habe ich sehr schnell diese Verbindung zu irgendeinem Talk, den ich mal auf irgendeinem Meetup gehört habe. Und im Zweifel forsche ich danach, hey, wo war das Thema und bei welchem Meetup war das? Okay, das ist sechs Jahre her. Hat sich vielleicht was getan in der Technologie? Was hat mich unglaublich weitergebracht? Einfach Zusammenhänge zu erkennen. Und manchmal hat man auch das Phänomen, dass man zweit Hektar hört, da vergeht eine Zeit zwischen und man stellt irgendwie dann fest beim Hören, okay, eigentlich hängen die zusammen, eigentlich behandeln die das gleiche Problem, lösen es aber auf unterschiedliche Arten und Weisen. Und das ist halt super interessant, hat mich mega weitergebracht."
    },
    {
      "confidence": 0.999905,
      "end": 2142804,
      "speaker": "A",
      "start": 2140780,
      "text": "Mein Reden, mein Reden."
    },
    {
      "confidence": 0.97879,
      "end": 2144052,
      "speaker": "B",
      "start": 2142852,
      "text": "Ich meine, das ist ja das, was."
    },
    {
      "confidence": 0.92944145,
      "end": 2147812,
      "speaker": "A",
      "start": 2144076,
      "text": "Ich die ganze Zeit predigeln, wenn du."
    },
    {
      "confidence": 0.9493433,
      "end": 2149492,
      "speaker": "C",
      "start": 2147836,
      "text": "So schreist, das ist ganz schwierig."
    },
    {
      "confidence": 0.93349147,
      "end": 2171557,
      "speaker": "B",
      "start": 2149636,
      "text": "Ich meine, was soll ich anders sagen? Also das war der Grund, warum ich Meetup organisiert habe. Das scheint anscheinend auch ein Haupttreiber von Darius zu sein, warum er das Webengineering Meetup übernommen hat. Aber mehrere Talks können verknüpft werden und das bedarf natürlich regelmäßiger Anwesen. Das kann man natürlich nicht von jedem erwarten, das stimmt schon, aber da würde ich sagen, kommt wirklich der Mehrwert her."
    },
    {
      "confidence": 0.900628,
      "end": 2192680,
      "speaker": "C",
      "start": 2171613,
      "text": "Und als nächste Stimme haben wir Stefan. Und Stefan ist ja, das muss ich jetzt unseren Hörer innen erklären, früher war ja Andy immer mein Lieblings Ruhrbottler aus Duisburg, aber Stefan ist jetzt mein neuer Lieblingsbottler, so wie man das so sagt. Fünf und vierzig Jahre alt. Und der Grund ist seine einleitenden Worte."
    },
    {
      "confidence": 0.876136,
      "end": 2197492,
      "speaker": "N",
      "start": 2193900,
      "text": "OK, sollen wir deutlich sprechen oder versuchen deutlich zu sprechen?"
    },
    {
      "confidence": 0.759746,
      "end": 2199396,
      "speaker": "A",
      "start": 2197556,
      "text": "Das wäre eine tolle Geschichte."
    },
    {
      "confidence": 0.872212,
      "end": 2201560,
      "speaker": "N",
      "start": 2199588,
      "text": "Wie Muss ich Kaffee aussprechen?"
    },
    {
      "confidence": 0.8958146,
      "end": 2212960,
      "speaker": "C",
      "start": 2202540,
      "text": "Es heißt natürlich Kaffee. Aber jetzt zur eigentlichen Karrierefrage und Stefanie ist ja Head of Department bei Check, also scheinbar gute Karriere hinter sich."
    },
    {
      "confidence": 0.9323264,
      "end": 2253930,
      "speaker": "N",
      "start": 2213660,
      "text": "Ich nicht vielleicht die gleiche Karriere gemacht hätte ohne Meetups, aber es ist definitiv vielleicht der Social Effect oder Leute kennenlernen, wo man weiß, die können eine bestimmte Technologie sehr gut oder so und sich auch mit denen anfreunden und einfach dann im Zweifelsfall auch im Job mal darauf zurückgreifen zu können, hey, ich kenne da jemanden, den kenne ich vom Meetup, den kann ich jederzeit fragen, wie auch immer das dann geschieht. Aber ich glaube, das ist vielleicht das, was so am ehesten im Job dann tatsächlich stattfindet, dass ich jetzt irgendwie so Talks gehabt habe. Ich habe sicherlich Anregungen mitgenommen, aber wo du am nächsten Tag okay, darauf habe ich gewartet, das löst mein Problem und bringt mich auf die nächste Stufe. Das glaube ich, hat es auch nicht gegeben."
    },
    {
      "confidence": 0.8416687,
      "end": 2258358,
      "speaker": "B",
      "start": 2254830,
      "text": "Ja, das ist natürlich diese berühmt berüchtigte Opportunitätsfrage."
    },
    {
      "confidence": 0.92493093,
      "end": 2266194,
      "speaker": "A",
      "start": 2258534,
      "text": "Hätte ich die gleiche Karriere gemacht ohne Meetups? Keine Ahnung, wird man nie erfahren, denn auch dieser Mensch ist auf Meetups gegangen."
    },
    {
      "confidence": 0.99749213,
      "end": 2269842,
      "speaker": "B",
      "start": 2266242,
      "text": "Vielleicht war das unser Fehler, Leute auf Meetups zu befragen, aber ich meine, man."
    },
    {
      "confidence": 0.9307797,
      "end": 2279154,
      "speaker": "A",
      "start": 2269866,
      "text": "Hat keine zwei Parallelwelten, wo der eine, Stefan, sich ohne Meetups entwickelt hat und der andere mit Meetups. Man könnte auch theoretisch sagen, vielleicht ist er auch Head of Department, weil er."
    },
    {
      "confidence": 0.9202048,
      "end": 2288666,
      "speaker": "B",
      "start": 2279162,
      "text": "Auf das Netzwerk zurückgreifen konnte. Ich weiß es nicht. Heißt aber auch nicht, dass ich mich jetzt hier beweihräuchern möchte und sage, deswegen ist Stefan jetzt in dieser Position."
    },
    {
      "confidence": 0.9037246,
      "end": 2293802,
      "speaker": "A",
      "start": 2288858,
      "text": "Wolfgang, hättest du die gleiche Karriere gemacht, wärst du nicht auf Meetups gegangen."
    },
    {
      "confidence": 0.9225386,
      "end": 2328912,
      "speaker": "C",
      "start": 2293866,
      "text": "Karrieretechnisch ist jetzt vielleicht ein bisschen hochgegriffen, weil das jetzt so der extreme Karriereschritt ist, aber es ist natürlich viel Wissen, das man aufsagt. Und dieses Netzwerk hat mir persönlich schon geholfen, dass man einfach Leute kennt, die man zum Beispiel fragen kann, wenn man Probleme hat in einem gewissen Bereich oder die man auch vermitteln kann, wenn ein Kunde von mir zum Beispiel ein Spezialproblem hat, dass ich einfach ein Netzwerk habe, dass sie fragen, okay, du bist Spezialist in dem Data Science Bereich, kannst du für den Kunden vielleicht einfach was helfen? Also auch so Vermittlungstätigkeiten sind in meinem Fall natürlich als Consultant sehr hilfreich. Aber auch das Wissen ist gut."
    },
    {
      "confidence": 0.93182427,
      "end": 2330032,
      "speaker": "B",
      "start": 2329016,
      "text": "Ich bin froh, dass du das selbst."
    },
    {
      "confidence": 0.85633713,
      "end": 2331232,
      "speaker": "A",
      "start": 2330056,
      "text": "Erwähnt hast, denn sonst hätte ich als."
    },
    {
      "confidence": 0.9320535,
      "end": 2335936,
      "speaker": "B",
      "start": 2331256,
      "text": "Devils Advocate die ganze Thematik nämlich auf den Tisch gebracht. Du bist natürlich Freelancer und hast natürlich."
    },
    {
      "confidence": 0.99001366,
      "end": 2339808,
      "speaker": "A",
      "start": 2336048,
      "text": "Dein Geschäft ist ja auch dein Netzwerk, muss man ja sagen."
    },
    {
      "confidence": 0.8704606,
      "end": 2346028,
      "speaker": "B",
      "start": 2339904,
      "text": "Aus deinem Netzwerk ziehst du gegebenenfalls auch neue Aufträge oder sicherst dir ein wenig Vermittlungsprovision ein."
    },
    {
      "confidence": 0.89068574,
      "end": 2353452,
      "speaker": "C",
      "start": 2346164,
      "text": "Ich habe leider noch nie Vermittlungsprovision bekommen, sogar für Stellen, die besetzt wurden bisher. So, falls ihr, vielleicht solltet ihr mal."
    },
    {
      "confidence": 0.9255326,
      "end": 2361740,
      "speaker": "B",
      "start": 2353556,
      "text": "Didaktik ändern, falls ihr das in diesem Podcast hört, hat Wolfgang das nicht rausgeschnitten. Aber nun gut, lassen wir das mal so stehen."
    },
    {
      "confidence": 0.93506145,
      "end": 2365628,
      "speaker": "A",
      "start": 2361820,
      "text": "Aber jetzt hat man schon irgendwie, ja, hat mir schon sehr viel geholfen und."
    },
    {
      "confidence": 0.787885,
      "end": 2368508,
      "speaker": "B",
      "start": 2365684,
      "text": "Nö, hätte ich die gleiche Karriere gemacht wahrscheinlich."
    },
    {
      "confidence": 0.9987214,
      "end": 2370302,
      "speaker": "A",
      "start": 2368684,
      "text": "Aber was ist denn, wenn man noch."
    },
    {
      "confidence": 0.93179846,
      "end": 2381370,
      "speaker": "B",
      "start": 2370326,
      "text": "Gar keine Karriere gemacht hat? Und zwar haben wir nämlich Maxi vors Mikrofon geholt, fünf und zwanzig Jahre und Junior Softwareentwickler bei Check. Hören wir mal rein, was Maxi zu sagen hat."
    },
    {
      "confidence": 0.8886709,
      "end": 2396220,
      "speaker": "O",
      "start": 2382550,
      "text": "Bisher noch nicht viel, war noch nicht auf vielen, aber ich meine bisher, ich habe einiges mitgenommen von heute. Deswegen würde ich erst mal sagen, positiv enthusiastisch, es wird hoffentlich was bewegen eventuell."
    },
    {
      "confidence": 0.91375375,
      "end": 2401980,
      "speaker": "A",
      "start": 2398000,
      "text": "Hoffentlich was bewegen, eventuell vielleicht, finde ich Granate."
    },
    {
      "confidence": 0.92437375,
      "end": 2405096,
      "speaker": "B",
      "start": 2402400,
      "text": "Immer positiv denken. Wow, mein Mann, der Maxi."
    },
    {
      "confidence": 0.9456135,
      "end": 2423094,
      "speaker": "C",
      "start": 2405128,
      "text": "Ich möchte übrigens noch mal nachträglich auch sagen, dass der Maxi sehr wohl auch schon Karriere hat. Und nur weil er fünf und zwanzig Jahre ist, heißt es noch nicht, dass er keine Karriere hat, so wie du ihn eingeleitet hast. Aber damit hätten wir jetzt als nächsten den Holger, der sechs und vierzig Jahre alt ist. Der muss ja dann schon eine Karriere haben hinter sich, oder?"
    },
    {
      "confidence": 0.89684,
      "end": 2425354,
      "speaker": "A",
      "start": 2423192,
      "text": "Nach dem Stereotypen denken von mir anscheinend."
    },
    {
      "confidence": 0.95229,
      "end": 2425610,
      "speaker": "B",
      "start": 2425402,
      "text": "Ja."
    },
    {
      "confidence": 0.9187007,
      "end": 2430426,
      "speaker": "A",
      "start": 2425650,
      "text": "Nee, aber du hast natürlich einen Punkt. Soviel ich weiß, hat Maxi bereits seinen."
    },
    {
      "confidence": 0.90020305,
      "end": 2450944,
      "speaker": "B",
      "start": 2430458,
      "text": "Master abgeschlossen, wenn ich das richtig von dem Kontext im Interview noch in Erinnerung habe. Also natürlich, aber der Titel sagt es ja auch schon, Junior Softwareentwickler. Und wenn wir die Karriere in der Softwareentwicklungsbranche jetzt mal hier an den Tag legen, war meine Aussage, weiß ich jetzt nicht, vielleicht ein bisschen stereotypenhaft, finde ich. Finde ich fair. Aber ja, Holger, sechs und vierzig Jahre."
    },
    {
      "confidence": 0.84892714,
      "end": 2453904,
      "speaker": "A",
      "start": 2450992,
      "text": "Frontend Engineer bei Jobrath, ist also in."
    },
    {
      "confidence": 0.906,
      "end": 2456384,
      "speaker": "B",
      "start": 2453912,
      "text": "Der Blüte seines Lebens, möchte man so sagen."
    },
    {
      "confidence": 0.95640546,
      "end": 2459024,
      "speaker": "C",
      "start": 2456432,
      "text": "Und Holger ist ja fast ein Celebrity, würde ich sagen, oder?"
    },
    {
      "confidence": 0.9969357,
      "end": 2460768,
      "speaker": "A",
      "start": 2459112,
      "text": "Ja, ist er auf der einen Seite."
    },
    {
      "confidence": 0.896055,
      "end": 2464368,
      "speaker": "B",
      "start": 2460864,
      "text": "Mit Autowired ein unglaublich populärer Podcaster."
    },
    {
      "confidence": 0.9261357,
      "end": 2467664,
      "speaker": "A",
      "start": 2464464,
      "text": "Und weil ihm Podcasting noch nicht genug."
    },
    {
      "confidence": 0.8922438,
      "end": 2475152,
      "speaker": "B",
      "start": 2467712,
      "text": "Ist, hat er auch noch das YouTube Format Papperlapapp Spaß mit Klammern, wo er mit dem Stefan relativ viele Videos produziert."
    },
    {
      "confidence": 0.89070886,
      "end": 2477478,
      "speaker": "C",
      "start": 2475216,
      "text": "Der Name ist schon allein geil, finde ich. Papperlapapp."
    },
    {
      "confidence": 0.9286791,
      "end": 2482190,
      "speaker": "B",
      "start": 2477544,
      "text": "Was sagt Holger zu dem Einfluss von Meetups auf seine Karriere?"
    },
    {
      "confidence": 0.9252358,
      "end": 2522880,
      "speaker": "I",
      "start": 2483570,
      "text": "Ich hab auf der softwarekammer Düsseldorf, da habe ich den Benedikt, mit dem ich den Autogate FM mache, den habe ich da kennengelernt. Hat das meine Karriere beeinflusst? Ja und nein. Also das hat mich schon in eine gewisse Richtung gedrängt. Was heißt gedrängt? Ich hab da über den Tellerrand schauen können und hab da gelernt, wie andere Leute andere Leute funktionieren, wie andere Kontexte funktionieren. Und da habe ich mir jetzt gesagt, nee, das willst du auch. Ich möchte mich auch in diese Richtung entwickeln. Also von daher, ja. Ja, hat es. Das ist zwar schon ein bisschen her, aber ja doch, würde ich sagen, doch, hat es."
    },
    {
      "confidence": 0.87672836,
      "end": 2526212,
      "speaker": "B",
      "start": 2523260,
      "text": "Holgers Antwort ist ja eine Achterbahnfahrt."
    },
    {
      "confidence": 0.9017433,
      "end": 2545262,
      "speaker": "A",
      "start": 2526276,
      "text": "Hat es meine Karriere beeinflusst? Da stimmt dir das so? Nein, hat es nicht. Und dann doch, ich habe gelernt, wie andere Leute und dann oh ja doch, hat es. Eine Achterbahn der Gefühle. Aber das zeigt natürlich auch schon so ein bisschen, dass das Netzwerken dann zu doch sehr erfolgreichen side Projects führen kann."
    },
    {
      "confidence": 0.85044,
      "end": 2549214,
      "speaker": "B",
      "start": 2545286,
      "text": "Wenn man zumindest seinen Podcast Chorus auf einer Meetup kennenlernt, oder überleg gerade, wie."
    },
    {
      "confidence": 0.9193506,
      "end": 2562130,
      "speaker": "C",
      "start": 2549222,
      "text": "Wir uns eigentlich kennengelernt haben, weil ich glaube fast, dass das erste Mal, wo du mich kontaktiert hast, das war auch, weil du wolltest, dass sie zu deinem Meetup kommt, zum Web Engineering Düsseldorf. Also vielleicht ist sogar ist es Meetup schuld, dass wir uns kennengelernt haben?"
    },
    {
      "confidence": 0.9330027,
      "end": 2571630,
      "speaker": "B",
      "start": 2562170,
      "text": "Na, das glaube ich nicht, weil wir haben in derselben Organisation zusammengearbeitet und wir hatten hier und da vielleicht auch das eine oder andere Projekt. Also kennenlernen würde ich sagen, durch die Arbeit."
    },
    {
      "confidence": 0.90630287,
      "end": 2574418,
      "speaker": "C",
      "start": 2572570,
      "text": "Ich bin mir gar nicht sicher, hätten."
    },
    {
      "confidence": 0.91968125,
      "end": 2577426,
      "speaker": "A",
      "start": 2574434,
      "text": "Wir eine solch intime Beziehung ohne die Meetups?"
    },
    {
      "confidence": 0.96373,
      "end": 2579602,
      "speaker": "B",
      "start": 2577458,
      "text": "Das würde ich in der Tat in Frage stellen."
    },
    {
      "confidence": 0.905954,
      "end": 2583190,
      "speaker": "C",
      "start": 2579666,
      "text": "Ja, du lädst da jetzt gerade viel auf, aber lassen wir das mal so dastehen."
    },
    {
      "confidence": 0.91423714,
      "end": 2586216,
      "speaker": "B",
      "start": 2584240,
      "text": "Aber lass uns zur letzten Frage kommen."
    },
    {
      "confidence": 0.8826118,
      "end": 2591928,
      "speaker": "A",
      "start": 2586248,
      "text": "Und frage numero vier. Wie entscheidest du, ob sich die Teilnahme."
    },
    {
      "confidence": 0.99476665,
      "end": 2593544,
      "speaker": "B",
      "start": 2592024,
      "text": "An einem Event für dich lohnt?"
    },
    {
      "confidence": 0.9963587,
      "end": 2597832,
      "speaker": "A",
      "start": 2593592,
      "text": "Denn das ist ja auch immer die große geht man hin, geht man nicht hin?"
    },
    {
      "confidence": 0.997845,
      "end": 2598904,
      "speaker": "B",
      "start": 2597936,
      "text": "Ist es das wert?"
    },
    {
      "confidence": 0.94232273,
      "end": 2604904,
      "speaker": "A",
      "start": 2598952,
      "text": "Weil im Endeffekt man investiert drei Stunden, vier Stunden bestimmt, oder?"
    },
    {
      "confidence": 0.919745,
      "end": 2613880,
      "speaker": "C",
      "start": 2605072,
      "text": "Und vor allem, wie entscheidet man, ob man hingeht oder nicht oder auswählt, zu welcher Konferenz oder Meetup man geht? Und Andis Nachfolger Dario startet wieder."
    },
    {
      "confidence": 0.92392445,
      "end": 2643570,
      "speaker": "D",
      "start": 2614740,
      "text": "Ich schaue in allererster Linie mal auf die Titel. Die sind natürlich catchy. Meistens sind die irgendwie im Titelbild oder im Titel vom Meetup. Wenn ich jetzt auf der meetup Seite rumsurfe, wenn die Titel mir zusagen, dann lese ich mir genauer die Beschreibung durch und sofern ich da irgendwie einen Benefit sehe für mich, dann sage ich da einfach zu. Und selbst wenn ich noch nie in der Location war oder alleine hingehe, ja, ich versuch's einfach. Im Zweifel habe ich einen netten Abend und kriege ein paar kostenlose Getränke, aber meistens bringe ich auch einen Mehrwert mit."
    },
    {
      "confidence": 0.9338509,
      "end": 2647366,
      "speaker": "C",
      "start": 2644590,
      "text": "Da sieht man wieder den Gourmet. Es geht um die Getränke."
    },
    {
      "confidence": 0.902925,
      "end": 2652614,
      "speaker": "A",
      "start": 2647478,
      "text": "Ich verstehe, was er sagen möchte, aber wir hatten auch schon Erfahrungen, wo Leute."
    },
    {
      "confidence": 0.9269033,
      "end": 2655894,
      "speaker": "B",
      "start": 2652742,
      "text": "Nur zum Essen gekommen sind. Also sie sind zum Meetup gekommen, dann."
    },
    {
      "confidence": 0.93923146,
      "end": 2658902,
      "speaker": "A",
      "start": 2655902,
      "text": "Gab es vorher ein bisschen was zu essen und die sind vor dem ersten."
    },
    {
      "confidence": 0.885176,
      "end": 2663126,
      "speaker": "B",
      "start": 2658966,
      "text": "Talk wieder abgehauen und da gab es ein Pattern und diese Leute kamen des öfteren."
    },
    {
      "confidence": 0.9829757,
      "end": 2666662,
      "speaker": "A",
      "start": 2663238,
      "text": "Also, aber man kann das auch überspitzen. Aber was man auch sieht, er mag."
    },
    {
      "confidence": 0.817045,
      "end": 2668214,
      "speaker": "B",
      "start": 2666686,
      "text": "Anscheinend so Clickbait Artikel."
    },
    {
      "confidence": 0.8406911,
      "end": 2672250,
      "speaker": "A",
      "start": 2668342,
      "text": "Hättest du diesen fünf Fehler im Observability Bereich vermieden?"
    },
    {
      "confidence": 0.9111125,
      "end": 2676454,
      "speaker": "C",
      "start": 2672990,
      "text": "Ja, darum mache ich ja immer die Episoden Titel und nicht du."
    },
    {
      "confidence": 0.86496127,
      "end": 2678598,
      "speaker": "B",
      "start": 2676542,
      "text": "Ja, und schau dir mal unsere Downloadzahlen an."
    },
    {
      "confidence": 0.8662057,
      "end": 2685462,
      "speaker": "A",
      "start": 2678654,
      "text": "Naja, Clickbait stehe ich überhaupt nicht drauf. Der Titel muss nicht so catchy sein."
    },
    {
      "confidence": 0.999265,
      "end": 2686902,
      "speaker": "B",
      "start": 2685486,
      "text": "Für mich, aber gut."
    },
    {
      "confidence": 0.93381095,
      "end": 2692490,
      "speaker": "C",
      "start": 2687086,
      "text": "Aber Andi, wir haben da auch eine Meinung, die mehr in deine Richtung geht, und zwar von Philipp zu deine Clickbait."
    },
    {
      "confidence": 0.92057496,
      "end": 2724120,
      "speaker": "G",
      "start": 2694050,
      "text": "Es gibt Meetups und es gibt Konferenzen, die haben in der Community tatsächlich schon einen gewissen Stellenwert und die kennt man. Da weiß man, da sind viele gute Sachen dabei und da gehe ich gerne hin. Und der Titel oder was da gespielt wird oder was da gegeben wird, das ist es gar nicht so sehr, weil das kann tatsächlich total täuschend und überraschend sein, dass manchmal die geilsten Titel und dann ist es eher lame und umgekehrt, das ist wirklich der lähmste Titel der Welt und auf einmal gehen dir die Birnen an und denkst dir, wow, das hab ich so noch nicht gesehen."
    },
    {
      "confidence": 0.9754243,
      "end": 2726468,
      "speaker": "B",
      "start": 2724860,
      "text": "Das sage ich ja die ganze Zeit."
    },
    {
      "confidence": 0.9685336,
      "end": 2731716,
      "speaker": "A",
      "start": 2726604,
      "text": "Also nur weil jemand vielleicht nicht mit dem kreativsten Titel um die Ecke kommt."
    },
    {
      "confidence": 0.95474064,
      "end": 2749294,
      "speaker": "B",
      "start": 2731748,
      "text": "Oder das Marketing noch nicht drauf hat oder ähnliches, heißt das nicht, dass der Content nicht exzellent sein kann. Ich denke, man sollte mehr beschreiben, was wirklich drin ist, denn dann kann man eher entscheiden, lohnt sich das oder nicht. Weil bei den Clickbird Artikeln wurde schon sehr oft enttäuscht. Das gilt jetzt nicht nur bei Meetups, sondern auch bei Podcast Episoden und Co."
    },
    {
      "confidence": 0.91862285,
      "end": 2751822,
      "speaker": "C",
      "start": 2749382,
      "text": "Also Wolfgang, nicht bei uns rennen, oder?"
    },
    {
      "confidence": 0.93567157,
      "end": 2758622,
      "speaker": "A",
      "start": 2751926,
      "text": "Ja, bei deinen Titeln frage ich mich schon ab zu, wenn ich diesen Titel lese, was ist da drin? Ich weiß es dann, weil ich die."
    },
    {
      "confidence": 0.895455,
      "end": 2768014,
      "speaker": "B",
      "start": 2758646,
      "text": "Podcast Episode natürlich produziert habe, aber Wolfgang, ich fordere mehr Realität. Den Ansatz vom Tim finde ich aber unglaublich interessant."
    },
    {
      "confidence": 0.8993014,
      "end": 2769934,
      "speaker": "A",
      "start": 2768062,
      "text": "Lass uns mal da reinhören, wie Tim."
    },
    {
      "confidence": 0.902929,
      "end": 2773480,
      "speaker": "B",
      "start": 2769982,
      "text": "Entscheidet, ob sich die Teilnahme einem Event für sich lohnt."
    },
    {
      "confidence": 0.92021513,
      "end": 2811890,
      "speaker": "E",
      "start": 2774380,
      "text": "Das ist eine richtig gute Frage. Ich habe mal, schon wirklich lange her, das waren so meine ersten Meetup Besuche, ich weiß nicht, wie alt ich da war, siebzehn oder sowas. Und da bin ich tatsächlich einfach mal zu sämtlichen Meetups gegangen. Alles was rund um Programmierung in Düsseldorf damals war das auch noch mehr auf dem C Meetup per Meetup und ich weiß nicht was noch alles. Und man lernt eigentlich immer was. Wenn du einmal bei so einem Meetup warst, dann weißt du, ob du da noch mal hingehen möchtest. Das steht und fällt meistens mit den Leuten tatsächlich Socializing hinterher."
    },
    {
      "confidence": 0.94673616,
      "end": 2816846,
      "speaker": "C",
      "start": 2812870,
      "text": "Mit siebzehn? Mit siebzehn habe ich nicht mal gewusst, wie man Meetup buchstabiert."
    },
    {
      "confidence": 0.92031026,
      "end": 2843018,
      "speaker": "A",
      "start": 2816958,
      "text": "Was Tim jetzt gerade eigentlich gemacht hat. Ist dir die Frage beantwortet, warum das Alter so wichtig ist? Mit siebzehn war er wissbegierig, hungrig und hatte Zeit und hat einfach mal radikales Brutforce angewandt. Ist einfach mal auf alles gegangen und hat danach selektiert. Das bedeutet, ich bin unvoreingenommen, schau mir die ganze Zeit an und die, die mir gefallen, da gehe ich öfter hin. Mit sechs und vierzig kann man das nicht mehr tun, weil man so viele."
    },
    {
      "confidence": 0.9834122,
      "end": 2844922,
      "speaker": "B",
      "start": 2843034,
      "text": "Verpflichtungen hat und gar nicht mehr so viel Freizeit."
    },
    {
      "confidence": 0.9103448,
      "end": 2856612,
      "speaker": "C",
      "start": 2844986,
      "text": "Ja, ich hätte es gern gehabt, wie ich siebzehn war. Ich glaube nicht, dass es dort Meetups gegeben hat. Also wir hatten irgendwelche alten trockenen Bücher, wo wir Wissen so bekommen haben, da war nicht mal Internet noch so richtig."
    },
    {
      "confidence": 0.9342023,
      "end": 2865812,
      "speaker": "B",
      "start": 2856676,
      "text": "Da, was er aber auch, es steht und fällt mit den Leuten. Und das leider weiß man ja erst, wenn man vor Ort ist, oder? Oder habt ihr bei euch in dem Meetup schon communities?"
    },
    {
      "confidence": 0.92295545,
      "end": 2868340,
      "speaker": "A",
      "start": 2865956,
      "text": "Gehst du wieder nächste Woche zum Meetup? Da komme ich auch."
    },
    {
      "confidence": 0.91958576,
      "end": 2903746,
      "speaker": "C",
      "start": 2868380,
      "text": "Also was ich sehr wohl beobachten kann, ist, dass Speaker unterschiedliche Communities wieder anziehen. Das heißt, wir hatten kürzlich zum Beispiel so Embedded Talks, also wo es wirklich um Embedded Development gegangen ist und da war wirklich eine andere Bubble plötzlich da. Also es ist schon, dass verschiedene Leute auch verschiedene Bubbles anziehen, die dann dazukommen. Und die müssen sich dann natürlich auch irgendwie verstehen, die unterschiedlichen Communities, damit sie dann wiederkommen. Da muss man ein nettes Umfeld erzeugen, dass die Spaß daran haben, weil wenn die erste Erfahrung schlecht ist, dann kommt man, wie auch Tim sagt, wahrscheinlich nicht mehr."
    },
    {
      "confidence": 0.9136133,
      "end": 2912546,
      "speaker": "B",
      "start": 2903818,
      "text": "Unsere nächste Kandidatin Melanie hat auch noch eine Meinung zum Thema Zeitfaktor bzw. Wie sie schaut und entscheidet, ob sie zu einem Video geht."
    },
    {
      "confidence": 0.91706,
      "end": 2914386,
      "speaker": "A",
      "start": 2912578,
      "text": "Melanie ist sieben und vierzig Jahre alt."
    },
    {
      "confidence": 0.96323144,
      "end": 2917122,
      "speaker": "B",
      "start": 2914418,
      "text": "Und Senior backend Engineer bei Trivago und."
    },
    {
      "confidence": 0.9443229,
      "end": 2918546,
      "speaker": "C",
      "start": 2917146,
      "text": "War schon bei uns in der Episode."
    },
    {
      "confidence": 0.93008447,
      "end": 2924978,
      "speaker": "P",
      "start": 2918578,
      "text": "Über Quereinsteigerinnen in der Zwischenzeit als Mutter und arbeitend."
    },
    {
      "confidence": 0.98182,
      "end": 2926630,
      "speaker": "D",
      "start": 2925074,
      "text": "Reiner Zeitfaktor."
    },
    {
      "confidence": 0.9230046,
      "end": 2932780,
      "speaker": "C",
      "start": 2927460,
      "text": "Die wolltest du nur drin haben, damit dein Argument jemand anderer bestätigt, oder?"
    },
    {
      "confidence": 0.997445,
      "end": 2934044,
      "speaker": "B",
      "start": 2932900,
      "text": "Was ist mein Argument?"
    },
    {
      "confidence": 0.958429,
      "end": 2936620,
      "speaker": "C",
      "start": 2934172,
      "text": "Dass wenn man älter ist, dass man keine Zeit hat."
    },
    {
      "confidence": 0.92918634,
      "end": 2947356,
      "speaker": "A",
      "start": 2936740,
      "text": "Du, ich brauche keine Bestätigung, weil es anscheinend stimmt. Wolfgang, es ist okay, wenn du auch mal falsch bist. Auch du kannst mal Reife zeigen. Und Andi, ich war mit meinen Gedanken falsch."
    },
    {
      "confidence": 0.913375,
      "end": 2950140,
      "speaker": "B",
      "start": 2947468,
      "text": "Ich denke, das Alter ist ein Attribut dafür."
    },
    {
      "confidence": 0.9627733,
      "end": 2977608,
      "speaker": "C",
      "start": 2950220,
      "text": "Man sieht ja schon, dass bei uns im Altersschnitt doch sehr viele Leute auch dabei sind, die jetzt in den ER sind und die auch noch Zeit finden, zu einem Meetup zu gehen, was schon super ist, finde ich. Also auch trotz Familie. Ich kenne viele, die springen dann teilweise früher ab nach dem ersten Talk, weil sie irgendwie einen Zug noch erwischen müssen oder zur Family müssen. Alles gut. Aber es gibt doch auch immer noch Leute, die so viel Energie aufbringen und trotzdem zu Meetups gehen, was wirklich super ist. Und Melanie war ja auch, da stimme ich dir zu."
    },
    {
      "confidence": 0.9554566,
      "end": 2991514,
      "speaker": "A",
      "start": 2977664,
      "text": "Eine Sache dennoch bitte verallgemeinere dein Alter über vierzig nicht mit mir. Ich habe noch ein paar Jahre, bis ich vierzig bin. Ich bin noch weit von den vierzig entfernt. Es tut mir leid, dass du bereits über vierzig bist, aber das, was Melanie."
    },
    {
      "confidence": 0.96456856,
      "end": 2993130,
      "speaker": "B",
      "start": 2991562,
      "text": "Ausgesprochen hat, ich glaube, das betrifft sehr."
    },
    {
      "confidence": 0.8896429,
      "end": 3006250,
      "speaker": "A",
      "start": 2993170,
      "text": "Sehr viele, besonders wenn man irgendwie alleinerziehend ist oder vielleicht irgendwie eine Person, die Care Arbeit macht. Ich glaube, da ist der Zeitfaktor schon maßgeblich und man muss schon wirklich entscheiden, okay, aber da würde ich gerne hin."
    },
    {
      "confidence": 0.947203,
      "end": 3019794,
      "speaker": "B",
      "start": 3006290,
      "text": "Aber ich habe keine Zeit. Auch in der Discord Community haben wir vor kurzem ein, zwei Chatnachrichten zu dem Thema gehabt, wie denn Eltern etwas mit dem Job vereinbaren, besonders wenn das Kind mal krank ist und so weiter. Und so spielt natürlich auch alles in dieses Bucket mit rein."
    },
    {
      "confidence": 0.8576594,
      "end": 3026790,
      "speaker": "C",
      "start": 3019842,
      "text": "Okay, und Shep hat eine ganze Checkliste, würde ich sagen, die er durchgeht, um einen Meetup auszuwählen."
    },
    {
      "confidence": 0.93298656,
      "end": 3103620,
      "speaker": "H",
      "start": 3027130,
      "text": "In erster Linie sind es vielleicht wirklich die Vorträge, die einen locken, die so vielleicht die Aufmerksamkeit auf sich ziehen, wenn eben so ein Meetup angekündigt wird. Vielleicht auch wer spricht da, wer ist eben da? Als ich gesehen habe, dass natürlich Andi und Wolfgang da sind, dann klar. Genau. Und dann, das ist sozusagen erstmal der Aufhänger. Dann kann man ja bei den Plattformen auch schauen, wer ist denn noch da? Das ist halt auch ganz cool. Und dann eben diese ganzen anderen Aspekte. Man kämpft da so ein bisschen gegen den Schweinehund, speziell an dem Tag selber. Also es gibt ja auch dieses Thema der no Show Rates, dass Leute also in guter Absicht sagen, hey, ich registriere mich für dieses Event und und am Ende hat man einfach dann deutlich weniger Besucher, als ursprünglich sich angekündigt haben. Und da spielen die Faktoren eine Rolle, die du, Holger, eben genannt hast, nämlich wie lange dauert es, bis ich da bin? Gibt es da was zu essen oder muss ich das irgendwie auch noch vorher gucken, wie ich das geregelt bekomme? Das ist jetzt in dem Fall hier auch gab es Pizza, war super. Genau. Und manchmal ist es eben auch, wo findet das statt? Wollte ich mir diese Firma, dieses Büro, wie die da arbeiten, wo das ist, die Gegend, was weiß ich, immer mal angucken? Und das ist dann auch noch so ein Mitnahmeeffekt."
    },
    {
      "confidence": 0.9163806,
      "end": 3128880,
      "speaker": "I",
      "start": 3103700,
      "text": "Vielleicht wurde das jetzt noch mal so erwähnst. Die Uhrzeit in der Tat spielt, du hast gerade, also das ist total, weiß ich nicht, total trivial und auch ein bisschen privilegiert, dieser krieg ich was zu essen und wann fängt es denn an? Ich kenne Meetups, die fangen schon um an, das kriege ich nicht geregelt. Also ich verstehe, warum man das tut. Erst später passt für mich dann besser."
    },
    {
      "confidence": 0.8562509,
      "end": 3134940,
      "speaker": "A",
      "start": 3131380,
      "text": "Der Cheb hat einen interessanten Punkt genannt, wo findet es statt?"
    },
    {
      "confidence": 0.95627874,
      "end": 3136556,
      "speaker": "B",
      "start": 3135020,
      "text": "Wollte ich mir das schon immer mal ansehen?"
    },
    {
      "confidence": 0.8815086,
      "end": 3141436,
      "speaker": "A",
      "start": 3136588,
      "text": "Und das spielt natürlich auf die Firmen irgendwie ein, dass die Firmen dann natürlich."
    },
    {
      "confidence": 0.9136224,
      "end": 3148012,
      "speaker": "B",
      "start": 3141468,
      "text": "Auch Locations zur Verfügung stellen. Das ist zumindest im Tech Bereich sehr oft so. Und das Web Engineering Meetup Düsseldorf, sowie."
    },
    {
      "confidence": 0.93019146,
      "end": 3150852,
      "speaker": "A",
      "start": 3148116,
      "text": "Auch das Engineering Kiosk Alps Meetup, was."
    },
    {
      "confidence": 0.943924,
      "end": 3153892,
      "speaker": "B",
      "start": 3150876,
      "text": "Du ja betreibst, ihr rotiert ja auch zwischen den Locations."
    },
    {
      "confidence": 0.95908,
      "end": 3155188,
      "speaker": "A",
      "start": 3153956,
      "text": "Das ist immer ein bisschen anstrengend, weil."
    },
    {
      "confidence": 0.962515,
      "end": 3157524,
      "speaker": "B",
      "start": 3155204,
      "text": "Man muss immer natürlich immer neue Locations suchen."
    },
    {
      "confidence": 0.97435427,
      "end": 3159716,
      "speaker": "A",
      "start": 3157652,
      "text": "Aber das ist natürlich auch super interessant."
    },
    {
      "confidence": 0.97337,
      "end": 3163652,
      "speaker": "B",
      "start": 3159828,
      "text": "Für die Gäste, weil die sehen immer neue Büroräume und so weiter."
    },
    {
      "confidence": 0.96164614,
      "end": 3169556,
      "speaker": "A",
      "start": 3163756,
      "text": "Also stimmt, hatte ich so nicht mehr auf dem Schirm. Aber nicht nur, wie gut komme ich dahin?"
    },
    {
      "confidence": 0.9627122,
      "end": 3175220,
      "speaker": "B",
      "start": 3169668,
      "text": "Innerer Schweinehund fand ich auch schön. Aber auch sind die Büroräume schön, kriegt man Einblick in andere Firmen."
    },
    {
      "confidence": 0.9285304,
      "end": 3215586,
      "speaker": "C",
      "start": 3175300,
      "text": "Also zwei Geschichten dazu. Eine ist, wir haben eine Location, die ist so gefühlt ein bisschen weiter weg, außerhalb der Stadt, obwohl es nicht wirklich so ist. Du brauchst von der Stadtmitte genauso mit dem Bus fünfzehn bis zwanzig Minuten hin, wie auf die andere Seite von der Stadt. Aber da haben wir dreiig Prozent weniger Leute, einfach weil es gefühlt irgendwie so außerhalb ist. Das sehen wir definitiv als Problem. Und dann gibt es Location, da waren wir öfters, die sind bekannt fürs gute Essen. Es ist so ein Investor, dort kommen die Leute dann super gern hin. Also es klingt banal, aber Essen macht wirklich was aus und die bemühen sich immer sehr und es ist super beliebt, dieses Meetup, wenn wir bei der Location sind. Also kann ich nur genau so bestätigen."
    },
    {
      "confidence": 0.93084145,
      "end": 3223122,
      "speaker": "A",
      "start": 3215698,
      "text": "Also ich muss zugeben, ich weiß nicht, ob ich zu einem Meetup gehen würde, nur weil es da tolles Essen gibt, sondern eher um die Frage muss ich."
    },
    {
      "confidence": 0.9543988,
      "end": 3228628,
      "speaker": "B",
      "start": 3223146,
      "text": "Mich noch darum kümmern. Aber hey, anscheinend, wie du ja auch erzählst, gibt es auch andere Leute."
    },
    {
      "confidence": 0.9077415,
      "end": 3242260,
      "speaker": "C",
      "start": 3228714,
      "text": "Ja, wir haben High Bars hier und weil wir schon bei unserem Innsbrucker Meetup sind, haben wir auch die Miri gefragt, die jetzt bei uns im Ogre Team ist, vom Engineering Kiosk Apps Meetup, wie sie ihre Meetups und Konferenzen aussucht."
    },
    {
      "confidence": 0.9304988,
      "end": 3265060,
      "speaker": "P",
      "start": 3242840,
      "text": "Also schon sehr stark nach dem, was auf der Agenda steht. Also nicht nur overall topics, sondern wirklich auch ein bisschen genauer, wer die Speaker sind, was die Themen genau sind und oft auch, wie angewandt dann die Themen wirklich sind. Also ob das wirklich sehr viel Erfahrungsberichte sind oder nur so generell, wie es gehen würde. Also ich bevorzuge da ja wirklich Erfahrungen mitzubekommen."
    },
    {
      "confidence": 0.98921,
      "end": 3269024,
      "speaker": "C",
      "start": 3265880,
      "text": "Die erste Stimme, die wirklich tief in den Inhalt."
    },
    {
      "confidence": 0.999365,
      "end": 3269536,
      "speaker": "B",
      "start": 3269152,
      "text": "Das stimmt."
    },
    {
      "confidence": 0.9329043,
      "end": 3270848,
      "speaker": "A",
      "start": 3269568,
      "text": "Und ich finde auch super, dass sie."
    },
    {
      "confidence": 0.9338039,
      "end": 3286046,
      "speaker": "B",
      "start": 3270904,
      "text": "Das wirklich in den Vordergrund rückt. Auf der anderen Seite muss ich natürlich schon zugeben, dass Erfahrungsberichte und wirklich angewandte Themen die meisten Leute zieht und auch von vorherigen Konferenzen, das so eigentlich die Storyteller sind."
    },
    {
      "confidence": 0.9462067,
      "end": 3291054,
      "speaker": "A",
      "start": 3286118,
      "text": "Nicht so was wäre, wenn so Zukunftsvision, geht der Aktienmarkt nach oben oder nach unten?"
    },
    {
      "confidence": 0.89266,
      "end": 3291966,
      "speaker": "B",
      "start": 3291102,
      "text": "Ja, vielen Dank."
    },
    {
      "confidence": 0.99786,
      "end": 3294510,
      "speaker": "A",
      "start": 3291998,
      "text": "Sie haben gerade nur die zwei Möglichkeiten genannt."
    },
    {
      "confidence": 0.88735,
      "end": 3297806,
      "speaker": "B",
      "start": 3294670,
      "text": "Also das ist halt relativ nicht sagend."
    },
    {
      "confidence": 0.9547757,
      "end": 3302174,
      "speaker": "A",
      "start": 3297918,
      "text": "Aber es ist auch immer natürlich schwierig im Vorhinein zu wissen, wie angewandt ein."
    },
    {
      "confidence": 0.952988,
      "end": 3305358,
      "speaker": "B",
      "start": 3302182,
      "text": "Thema ist, anhand des Titels oder anhand der kleinen Beschreibung."
    },
    {
      "confidence": 0.9549935,
      "end": 3310138,
      "speaker": "A",
      "start": 3305374,
      "text": "Weil ich sage mal so, die richtigen war Stories, das sind ja, wie sagt man, da wo das Fleisch ist."
    },
    {
      "confidence": 0.92821586,
      "end": 3332962,
      "speaker": "C",
      "start": 3310294,
      "text": "Ja, weil das Manual kann ich so auch lesen, also wenn es nur irgendwie eine Vorstellung ist. Wobei auch da muss ich sagen, teilweise sind die ja auch interessant, weil wenn die eben dann wieder so Tellerrand Topics sind, wenn ich mir dieses Framework nie angesehen hätte und mal so einen kurzen, so ein Intro, im Idealfall mit Erfahrungsberichten natürlich üblicherweise, weil die Person verwendet es ja auch, bekomme, dann macht es natürlich schon Sinn."
    },
    {
      "confidence": 0.85394,
      "end": 3334978,
      "speaker": "A",
      "start": 3333106,
      "text": "Ja, das stimmt schon, aber Meetup Talks."
    },
    {
      "confidence": 0.99842215,
      "end": 3338866,
      "speaker": "B",
      "start": 3334994,
      "text": "Sind ja in der Regel zwanzig bis fünf und vierzig Minuten und in dieser."
    },
    {
      "confidence": 0.95808625,
      "end": 3341186,
      "speaker": "A",
      "start": 3338938,
      "text": "Zeit kannst du natürlich kein Deep Dive machen."
    },
    {
      "confidence": 0.9100548,
      "end": 3360130,
      "speaker": "B",
      "start": 3341218,
      "text": "Das bedeutet, die geben dir einen Eindruck, eine Motivation und danach gehst du eher in den Laptop und machst die Dokumentation auf und gehst dann da rein. Also von daher finde ich, ich bin da bei Miri mit den Erfahrungsberichten und wie angewandt die Themen sind, die war Stories, das habe ich gemacht, was würde ich heute anders machen, wenn ich es nochmal machen würde und so weiter. Das finde ich schon interessant."
    },
    {
      "confidence": 0.9362875,
      "end": 3365750,
      "speaker": "C",
      "start": 3360210,
      "text": "Und ein anderer interessanter Aspekt, wie Meetups ausgewählt werden, erzählt uns Simon."
    },
    {
      "confidence": 0.9195922,
      "end": 3401420,
      "speaker": "K",
      "start": 3366330,
      "text": "Also bei mir viel Erfahrung, wenn ich vorher mal da war und grob weiß, wer da ist und mir das damals schon gefallen hat, dann ist es deutlich einfacher zuzusagen. Bei anderen Events ja wirklich oft die Empfehlung von Freunden, die hey, ich gehe dahin, ist eine coole Geschichte oder der Talk gefällt mir, willst du nicht mitkommen? Irgendwie sowas in die Richtung. Das ist wirklich ein großer Faktor. Ja, ansonsten halt, ob die Talks mich interessieren. Also wenn wirklich ein Talk dabei ist, der mich wirklich interessiert, dann gehe ich da auch alleine hin. Aber oft ist es wirklich."
    },
    {
      "confidence": 0.99925,
      "end": 3403512,
      "speaker": "C",
      "start": 3403120,
      "text": "Hat man."
    },
    {
      "confidence": 0.92397106,
      "end": 3416740,
      "speaker": "K",
      "start": 3403536,
      "text": "Da schon mal einen Anschluss, kennt man da schon mal eine Person, dann ist es deutlich einfacher einfach ja zu sagen und einen schönen Abend zu haben. Und genau, da muss man sich da wenig den Kopf drüber zum mürben, ob einem die Talks gefallen oder nicht."
    },
    {
      "confidence": 0.9202693,
      "end": 3432762,
      "speaker": "C",
      "start": 3417600,
      "text": "Und da kann jetzt eigentlich nur ein Kommentar drauf kommen, nämlich keine Ahnung, Andy natürlich, dass jetzt jeder bitte in seiner Podcast App seiner Wahl uns eine Empfehlung gibt, weil es scheint wirklich zu funktionieren. Funktioniert im Podcast Wesen, aber scheinbar auch im Meetup Wesen."
    },
    {
      "confidence": 0.93006754,
      "end": 3453198,
      "speaker": "B",
      "start": 3432826,
      "text": "Ja, klassisches Word of Mouse bzw. Ich vertraue meinen Freunden und Simon bestätigt das. Simon war aber auch nicht der einzige von unseren Interviewern, die sowas in der Richtung erwähnt haben. Wir haben jetzt natürlich nicht alle Leute eingespielt, denn diverse Leute haben das genannt, also hört auf eure Freunde. Anscheinend ist das oft keine schlechte Empfehlung."
    },
    {
      "confidence": 0.8977371,
      "end": 3483884,
      "speaker": "C",
      "start": 3453294,
      "text": "Und ihr habt es auch bei unserem Meetup mal probiert, wie ich versucht habe, die Frauenquote zu erhöhen, dass ihr wirklich mit Frauen gesprochen habe, ob die nicht vielleicht in ihrer Bubble zum Beispiel Frauen auch ansprechen können. Und die haben das dann wirklich aktiv getan und damit haben wir es geschafft, auch die Frauenquote zu erhöhen. Also das funktioniert wirklich. Persönliche Empfehlungen, das sind halt wirklich, worauf Leute am meisten hören. Also das kann man auch bewusst steuern oder halt probieren zu forcieren, weil das funktioniert besser als jede andere Marketingaktion."
    },
    {
      "confidence": 0.8743129,
      "end": 3486716,
      "speaker": "B",
      "start": 3484012,
      "text": "Das war es von unserer nicht repräsentativen."
    },
    {
      "confidence": 0.861943,
      "end": 3490236,
      "speaker": "A",
      "start": 3486748,
      "text": "Meetup Umfrage auf eine Meetup zum Thema Wert von Meetups."
    },
    {
      "confidence": 0.95879817,
      "end": 3493916,
      "speaker": "B",
      "start": 3490268,
      "text": "Also da habe ich mir einfach ganz groß ins Knie geschossen."
    },
    {
      "confidence": 0.9373619,
      "end": 3497868,
      "speaker": "A",
      "start": 3494028,
      "text": "Wie dem auch sei, ich hoffe, wir sind so ein bisschen aus unserer eigenen Suppe rausgekommen."
    },
    {
      "confidence": 0.8959443,
      "end": 3498956,
      "speaker": "B",
      "start": 3497884,
      "text": "Ich habe auf jeden Fall ein paar."
    },
    {
      "confidence": 0.9543778,
      "end": 3509694,
      "speaker": "A",
      "start": 3498988,
      "text": "Neue Stimmen und paar neue Meinungen mitgenommen, wie zum Beispiel ich war fest davon überzeugt, dass Meetups die Karriere beeinflussen. Anscheinend bin ich da nicht ganz allein."
    },
    {
      "confidence": 0.98882717,
      "end": 3511726,
      "speaker": "B",
      "start": 3509822,
      "text": "Aber anscheinend gibt es auch Leute, die."
    },
    {
      "confidence": 0.88182855,
      "end": 3514350,
      "speaker": "A",
      "start": 3511798,
      "text": "Eine andere Meinung haben. Ich hab endlich."
    },
    {
      "confidence": 0.9329625,
      "end": 3519598,
      "speaker": "C",
      "start": 3514430,
      "text": "Wir haben auch ungefähr zehn Stimmen, die einfach nur gesagt haben Nein, mal jetzt nicht reingenommen."
    },
    {
      "confidence": 0.99776,
      "end": 3520174,
      "speaker": "B",
      "start": 3519694,
      "text": "Ganz genau."
    },
    {
      "confidence": 0.9444529,
      "end": 3541766,
      "speaker": "A",
      "start": 3520222,
      "text": "Also da habe ich mal so ein bisschen den Spiegel vorgehalten bekommen. Dann hat der Chef mir einfach, ich glaube, den besten Grund für virtuelle Meetups gegeben. Einfach mal ein Nischenthema. Also habe ich so noch nie betrachtet. Ich fand schön, dass ich nicht nur Meister des Buzzword Bingos bin, sondern auch manche Leute Meetups dafür nutzen und dass man es glaube ich, bei der Auswahl."
    },
    {
      "confidence": 0.9566895,
      "end": 3547142,
      "speaker": "B",
      "start": 3541878,
      "text": "Warum man an einem Event teilnimmt. Ich glaube, man kann es da einfach keinem recht machen, weil wenn man mal."
    },
    {
      "confidence": 0.8995988,
      "end": 3549062,
      "speaker": "A",
      "start": 3547166,
      "text": "Die Location nimmt, wie gut man da hinkommt."
    },
    {
      "confidence": 0.91558653,
      "end": 3555094,
      "speaker": "B",
      "start": 3549126,
      "text": "Ja gut, ist abhängig vom Wohnort. Ist das Essen gut? Ich glaube das abhängig davon, was man so isst, ist der Titel gut."
    },
    {
      "confidence": 0.941346,
      "end": 3557590,
      "speaker": "A",
      "start": 3555182,
      "text": "Hoch subjektiv. Wer spricht da?"
    },
    {
      "confidence": 0.90809,
      "end": 3564946,
      "speaker": "B",
      "start": 3557630,
      "text": "Ist das Thema für mich interessant. Ich bin jetzt nicht so der Frontend Mensch, schaue mir trotzdem frontend Themen an, habe aber keine Relation zu frontend Themen."
    },
    {
      "confidence": 0.9781843,
      "end": 3566242,
      "speaker": "A",
      "start": 3564978,
      "text": "Also ich glaube, da kann man es."
    },
    {
      "confidence": 0.9937817,
      "end": 3567890,
      "speaker": "B",
      "start": 3566266,
      "text": "Einfach nicht allen Leuten recht machen."
    },
    {
      "confidence": 0.9166297,
      "end": 3587080,
      "speaker": "C",
      "start": 3567970,
      "text": "Was ich auf jeden Fall hoffe ist, dass wir jetzt vielleicht irgendwen überzeugen konnten, der oder die noch nie auf einem Meetup war, einfach mal vorbeizukommen, weil es ist einfach eine coole Stimmung und man trifft einfach nette Leute und lernt auch noch was dabei, wenn man ein Bier oder eine Bratwurst oder was auch immer noch so als Snack mitbekommt."
    },
    {
      "confidence": 0.8931125,
      "end": 3601528,
      "speaker": "B",
      "start": 3587160,
      "text": "Das war's von uns. Wir wollen natürlich auch gerne mal eure Meinung hören, springt doch mal in die Discord Community und sagt uns, wie ihr zu Meetup steht. Link findet ihr unten in den Show Notes. Ansonsten würde ich sagen, wir hören uns bei der nächsten Podcast Episode. Bis bald und tschüss."
    },
    {
      "confidence": 0.889951,
      "end": 3610040,
      "speaker": "C",
      "start": 3601624,
      "text": "Besonders, wenn ihr in der Gruppe seid, die nicht zu Meetups gehen, weil die hatten wir jetzt natürlich nicht in den Interviews. Also kommt vorbei bei uns in Discord und ciao."
    }
  ],
  "webhook_auth": false
}