{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 3693,
  "audio_url": "https://cloud.inlupus.at/s/8m3CggD4aAXgeHA/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9140491,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "63317533-5cb7-4650-b35a-9a4c9d0cbabe",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 15,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "confidence": 0.9476209,
      "end": 10712,
      "speaker": "A",
      "start": 3360,
      "text": "Willkommen zu einer neuen Podcast Episode vom Engineering Kiosk. Welchen Wert haben GitHub Stars? GitHub selbst ist ein Social Network für."
    },
    {
      "confidence": 0.92719877,
      "end": 16136,
      "speaker": "B",
      "start": 10736,
      "text": "Entwickler innen, ob du es wahrhaben willst oder nicht. Man interagiert miteinander, kann sich gegenseitig folgen."
    },
    {
      "confidence": 0.9514613,
      "end": 31496,
      "speaker": "A",
      "start": 16248,
      "text": "Und Likes werden in Form von Stars ausgedrückt. Das bringt mich zu der Welchen Wert haben eigentlich GitHub stars? Denn Fraud in Social Networks, wie das Kaufen von Followern in ist so alt wie die Existenz solcher Plattformen. Wie sieht es also auf GitHub damit aus?"
    },
    {
      "confidence": 0.97159,
      "end": 33240,
      "speaker": "B",
      "start": 31568,
      "text": "In dieser Episode schauen wir uns eine."
    },
    {
      "confidence": 0.9274293,
      "end": 82860,
      "speaker": "A",
      "start": 33280,
      "text": "Wissenschaftliche Untersuchung zum Thema Fake stars auf GitHub an. Was sind GitHub stars wert? Aus welcher Motivation heraus kaufen sich Leute eigentlich GitHub stars? Welche Herausforderungen gibt es, Fake Stars zu erkennen? Wie werden GitHub stars eigentlich genutzt? Aber bei der wissenschaftlichen Untersuchung bleibt es nicht. Wir haben die Community gefragt, welche Bedeutung GitHub stars für sie haben, ob Stars ein guter Indikator für die Qualität eines Projektes sind, wie GitHub Stars Entscheidungen beeinflussen und nach welchen Kriterien die Community eigentlich die Stars vergibt. Zwei kleine Sneak Peeks Einen GitHub Star kannst du auf dem Schwarzmarkt bereits für zehn Cent kaufen. Und Das Kaufen von GitHub Stars beeinflusst das organische Stars Wachstum von Repositories innerhalb der ersten zwei Monate. Danach flacht es ab. Du willst mehr davon dranbleiben? Denn das und und noch viel mehr haben wir für dich in dieser Episode. Viel Spaß."
    },
    {
      "confidence": 0.9213862,
      "end": 93832,
      "speaker": "B",
      "start": 88960,
      "text": "Wolfgang, ich habe eine sehr intime Frage an bist du ein Star Gazer?"
    },
    {
      "confidence": 0.998275,
      "end": 94504,
      "speaker": "C",
      "start": 93896,
      "text": "Ein was?"
    },
    {
      "confidence": 0.70401,
      "end": 95960,
      "speaker": "B",
      "start": 94592,
      "text": "Ein Stargazer."
    },
    {
      "confidence": 0.6781333,
      "end": 97304,
      "speaker": "C",
      "start": 96040,
      "text": "Ich kann Stargate."
    },
    {
      "confidence": 0.969836,
      "end": 102472,
      "speaker": "B",
      "start": 97432,
      "text": "Das ist auch eine andere Frage, die mich aber auch interessiert. Bist du so der Star Wars oder stargate Typ?"
    },
    {
      "confidence": 0.853935,
      "end": 103928,
      "speaker": "C",
      "start": 102536,
      "text": "Star Trek meinst du?"
    },
    {
      "confidence": 0.9296593,
      "end": 108002,
      "speaker": "B",
      "start": 103984,
      "text": "Merkst du was? So weit bin ich schon entfernt. Aber Star Wars oder Star Trek?"
    },
    {
      "confidence": 0.859541,
      "end": 111234,
      "speaker": "C",
      "start": 108066,
      "text": "Gibt es da nur entweder oder? Ich kann sie auseinanderhalten."
    },
    {
      "confidence": 0.94640684,
      "end": 117394,
      "speaker": "B",
      "start": 111282,
      "text": "Immerhin, das ist so wie früher. Du warst entweder Fan von den Toten Hosen oder Fan von den Ärzten. Aber nie beides."
    },
    {
      "confidence": 0.9658419,
      "end": 128002,
      "speaker": "C",
      "start": 117522,
      "text": "Aber wie das auch bei den Ärzten und bei den Hosen ist, im Alter kann sich alles ändern. Mittlerweile sind die befreundet. Kann man Fan von beiden sein. In meinem Alter ist man dann auch Fan von Star Trek und Star Wars."
    },
    {
      "confidence": 0.9389764,
      "end": 141006,
      "speaker": "B",
      "start": 128066,
      "text": "Wie hat's denn angefangen mit Star Trek? Du meine Güte. Ich glaube, wir müssen jetzt den Podcast hier beenden, weil ich war nämlich immer Star Wars. Aber das schieben wir zur Seite. Zurück zur bist du ein Star Gazer?"
    },
    {
      "confidence": 0.901736,
      "end": 142542,
      "speaker": "C",
      "start": 141118,
      "text": "Was ist ein Star Gazer?"
    },
    {
      "confidence": 0.9509603,
      "end": 152110,
      "speaker": "B",
      "start": 142606,
      "text": "Ein Star Gazer ist jemand, der einen GitHub Star verteilt hat. So wie jemand, der in Deutschland lebt, ein Deutscher ist. Bist du ein Star Gazer? Wenn du einen GitHub Star verteilt hast."
    },
    {
      "confidence": 0.90987664,
      "end": 154046,
      "speaker": "C",
      "start": 152190,
      "text": "Also einer reicht schon, ein Star."
    },
    {
      "confidence": 0.9430015,
      "end": 162652,
      "speaker": "B",
      "start": 154198,
      "text": "Wenn ich jetzt auf ein Repository bei mir gehe und schaue, wer mir einen Star gegeben hat, dann nennt man diese Liste an Leuten Star Gazer."
    },
    {
      "confidence": 0.931324,
      "end": 164256,
      "speaker": "C",
      "start": 162726,
      "text": "Heißt der Button auch so?"
    },
    {
      "confidence": 0.916164,
      "end": 165936,
      "speaker": "B",
      "start": 164408,
      "text": "Der API Call heißt so."
    },
    {
      "confidence": 0.9397043,
      "end": 167792,
      "speaker": "C",
      "start": 166008,
      "text": "Dann bin ich wohl ein Stargazer. Ja."
    },
    {
      "confidence": 0.98543,
      "end": 170032,
      "speaker": "B",
      "start": 167816,
      "text": "Wie viel stars hast du verteilt bisher?"
    },
    {
      "confidence": 0.8778559,
      "end": 179456,
      "speaker": "C",
      "start": 170176,
      "text": "Ich habe jetzt gerade zum Beispiel einen verteilt an unser internes Metadaten Repository, wo alle unsere Episoden und Metadaten davon drin liegen."
    },
    {
      "confidence": 0.87540364,
      "end": 182768,
      "speaker": "B",
      "start": 179488,
      "text": "Geh doch jetzt mal gerade kurz bitte auf GitHub com stars."
    },
    {
      "confidence": 0.921175,
      "end": 187328,
      "speaker": "C",
      "start": 182864,
      "text": "Das können jetzt alle, während ich das mache, auch machen. Wow, da ist wirklich eine Übersicht."
    },
    {
      "confidence": 0.94105667,
      "end": 190896,
      "speaker": "B",
      "start": 187424,
      "text": "Wie viel stars hast du verteilt? Oben rechts müsste all Stars stehen."
    },
    {
      "confidence": 0.84268,
      "end": 192020,
      "speaker": "C",
      "start": 191008,
      "text": "Ein und dreiig."
    },
    {
      "confidence": 0.9263333,
      "end": 201040,
      "speaker": "B",
      "start": 192360,
      "text": "Okay, du bist ein sehr schwacher Stargazer. Mein Score ist bei ein tausend vier hundert neunzehn. Also anscheinend stare ich etwas öfter als du."
    },
    {
      "confidence": 0.84343094,
      "end": 205460,
      "speaker": "C",
      "start": 201160,
      "text": "Ja, das ist halt Qualität. Was heißt Quantität, würde ich sagen."
    },
    {
      "confidence": 0.8802193,
      "end": 212496,
      "speaker": "B",
      "start": 205800,
      "text": "Du sagst also, dass es insgesamt neun und dreiig qualitative repositories auf GitHub gibt?"
    },
    {
      "confidence": 0.8809859,
      "end": 220346,
      "speaker": "C",
      "start": 212648,
      "text": "Na, aber das heißt halt, ich schaue viel mehr auf Qualität anstatt auf Quantität. Ich gebe nicht jedem so ein Star. Das muss man sich schon verdienen."
    },
    {
      "confidence": 0.88334155,
      "end": 266256,
      "speaker": "B",
      "start": 220488,
      "text": "Okay, Wolfgang, Stars sind anscheinend elitäre Stars. Okay. Oder bessere Stars als meine. Okay, wie dem auch sei, heute geht es aber um Stars und heute geht es auch um viele Stars, denn wir besprechen mal wieder ein Paper aus unserer Linie Papers we love. Schauen wir mal, ob wir dieses Paper auch lieben werden. Das letzte Paper hat leider nicht ganz so gut abgeschnitten, aber heute geht es um ein Paper zum Thema Fake stars. Und zwar hat ein Research Team ganz viele Repositories untersucht und dann mal detailliert drauf geschaut, wer hat eigentlich diese Repositories gestartet und sind das valide Stars oder sind das Fake stars? Und was dabei rausgekommen ist, werden wir gleich schauen. Das Paper nennt sich aber schon mal."
    },
    {
      "confidence": 0.9255186,
      "end": 268464,
      "speaker": "D",
      "start": 266328,
      "text": "Vier Komma fünf Millionen Fake Stars in."
    },
    {
      "confidence": 0.9152086,
      "end": 272672,
      "speaker": "B",
      "start": 268472,
      "text": "GitHub detected a growing spiral of popularity."
    },
    {
      "confidence": 0.75233,
      "end": 275058,
      "speaker": "D",
      "start": 272736,
      "text": "Contest scams and malware."
    },
    {
      "confidence": 0.936905,
      "end": 285790,
      "speaker": "B",
      "start": 275144,
      "text": "Fangen wir mal ganz vorne an. Warum ist diese Analyse von GitHub stars überhaupt relevant? Somit kommen wir zur ersten Wolfgang, Denkst du, GitHub ist ein Social Network?"
    },
    {
      "confidence": 0.860693,
      "end": 311898,
      "speaker": "C",
      "start": 285870,
      "text": "Ja, ich glaube, sie würden gern ein Social Network sein, weil es gibt ja auch die Profile, man kann Profilbilder aufladen, es gibt die Sterne, man kann nachschauen, wer was wo geliked hat, gestartet hat, besser gesagt, gefolgt hat. Es gibt auch diese Badges. Keine Ahnung, was die eigentlich bedeuten. Ich sehe nur immer irgendwo diese Badges. Noch mir nie damit beschäftigt, muss ich ganz ehrlich zugeben. Also ist so ein Möchtegern Social Network."
    },
    {
      "confidence": 0.90839064,
      "end": 317130,
      "speaker": "B",
      "start": 311994,
      "text": "Was fehlt denn zu einem richtigen Social Network, wenn du sagst es ein Möchtegern Social Network?"
    },
    {
      "confidence": 0.98585,
      "end": 378106,
      "speaker": "C",
      "start": 377210,
      "text": "Interaktion."
    },
    {
      "confidence": 0.92719305,
      "end": 391226,
      "speaker": "B",
      "start": 378218,
      "text": "Meines Erachtens nach ist GitHub nämlich ein Social Network, denn die Elemente, die du gerade genannt hast, Stars, Badges oder sogar Forks, Diskussionen, gibt es ja in Repositories und das ist die Interaktion."
    },
    {
      "confidence": 0.78362,
      "end": 392490,
      "speaker": "D",
      "start": 391418,
      "text": "Engagements."
    },
    {
      "confidence": 0.9076221,
      "end": 416198,
      "speaker": "B",
      "start": 392570,
      "text": "Meines Erachtens nach sind das alle Social Media like Features, wenn man so möchte. Und deswegen würde ich sagen, das ist nämlich ein Social Network für Entwickler, denn im Endeffekt handelt es sich dabei lediglich um ein Beliebtheit Signal. Also andere Nutzer erhalten oder verteilen Aufmerksamkeit durch entweder Teilnahmediskussion, durch Likes, durch Sponsorings, durch Forks, durch Stars."
    },
    {
      "confidence": 0.8676537,
      "end": 422726,
      "speaker": "D",
      "start": 416294,
      "text": "Und im Endeffekt ist ja ein Retreat oder einen LinkedIn like ja nichts anderes. Engagement Boosting."
    },
    {
      "confidence": 0.9273817,
      "end": 431724,
      "speaker": "B",
      "start": 422758,
      "text": "Denn wenn ich dir einen Star gebe, dann kannst du auf GitHub com explore das Repository auch sehen, was die meisten Stars bekommen hat."
    },
    {
      "confidence": 0.96891665,
      "end": 433772,
      "speaker": "D",
      "start": 431732,
      "text": "Und das ist ja schon Engagement Boosting und Co."
    },
    {
      "confidence": 0.9192525,
      "end": 435964,
      "speaker": "C",
      "start": 433796,
      "text": "Ist dann Hacker News auch ein Social Network?"
    },
    {
      "confidence": 0.92419064,
      "end": 441148,
      "speaker": "B",
      "start": 436012,
      "text": "Bei Hacker News kann man sich nicht folgen, bei GitHub schon. Ich glaube, die Vernetzung fehlt."
    },
    {
      "confidence": 0.90678626,
      "end": 443516,
      "speaker": "C",
      "start": 441164,
      "text": "Bei Hacker News kannst du einer Person folgen."
    },
    {
      "confidence": 0.9349719,
      "end": 455630,
      "speaker": "B",
      "start": 443628,
      "text": "Ach, ich bitte dich, mit wem spreche ich denn jetzt hier? Hat der Wolfgang jemals schon mal irgendeinen Code auf GitHub gepusht? Das schneidest du bitte nicht raus, Wolfgang, das bleibt bitte drin, wenn das rausfliegt."
    },
    {
      "confidence": 0.90022856,
      "end": 457818,
      "speaker": "C",
      "start": 455780,
      "text": "Kann ich nachschauen, ob ich jemandem folge?"
    },
    {
      "confidence": 0.87207335,
      "end": 458938,
      "speaker": "D",
      "start": 457914,
      "text": "Ja, kannst du."
    },
    {
      "confidence": 0.9291932,
      "end": 466618,
      "speaker": "B",
      "start": 458994,
      "text": "Du gehst bitte auf dein Profil und dann steht unter deinem Sponsor Dashboard steht Followers und Following und da kannst du draufklicken."
    },
    {
      "confidence": 0.9397022,
      "end": 469434,
      "speaker": "C",
      "start": 466714,
      "text": "Ich folge sogar vier Leuten, du bist nicht dabei."
    },
    {
      "confidence": 0.96109,
      "end": 478650,
      "speaker": "B",
      "start": 469562,
      "text": "Der Wolfgang findet gerade heraus, dass er Mitglied eines Social Networks ist, das sich GitHub nennt. Ich bin stolz, bei dieser Erkenntnis dabei gewesen zu sein."
    },
    {
      "confidence": 0.827369,
      "end": 485958,
      "speaker": "C",
      "start": 478770,
      "text": "Gib mehr Followers, Leute, denen ich folge. Ich hab auch so Badges. Vielleicht sollte ich mich wirklich mal damit beschäftigen."
    },
    {
      "confidence": 0.960372,
      "end": 493494,
      "speaker": "B",
      "start": 486054,
      "text": "Ich möchte dich jetzt nicht peinlich dastehen lassen, aber denkst du, es gibt das Feature von Stars, also von GitHub Stars auch auf anderen Plattformen?"
    },
    {
      "confidence": 0.90860665,
      "end": 500902,
      "speaker": "C",
      "start": 493542,
      "text": "Natürlich weiß ich das, weil wir haben viel zu wenig Stars auf Spotify und Apple auf den Podcast Plattformen. Möchte ich nur mal so anmerken. Hint, hint."
    },
    {
      "confidence": 0.92822355,
      "end": 508774,
      "speaker": "B",
      "start": 500966,
      "text": "Okay, ich Grenze meine Frage ein bisschen gibt es das Feature stars auch auf anderen Code Kollaborationsplattformen?"
    },
    {
      "confidence": 0.8866386,
      "end": 527988,
      "speaker": "C",
      "start": 508822,
      "text": "Ja, gibt es natürlich, aber auch nur aufgrund der Research für diesen Podcast, weil persönlich treibe ich mich ehrlich gesagt auf keinen von diesen Plattformen rum. Bist du irgendwie auf GitLab, Codebug, BitBucket oder solchen Plattformen überhaupt unterwegs? Und jetzt nicht nur zufällig mal einmal draufgekommen, sondern wirklich aktiv."
    },
    {
      "confidence": 0.9357826,
      "end": 549904,
      "speaker": "B",
      "start": 528084,
      "text": "Ich bin auf BitBucket unterwegs und ich bin ab und zu mal auf GitLab unterwegs, aber auf Codework bin ich nicht unterwegs. Aber zu der Research für diesen Podcast habe ich nachgeguckt und da muss ich jetzt wirklich zugeben, ich wusste nicht, ob Stars auch auf GitLab existieren oder auf Codework. Aber die Antwort ist folgende, GitLab hat ebenfalls Stars, die werden aber ganz, ganz."
    },
    {
      "confidence": 0.89183426,
      "end": 551936,
      "speaker": "D",
      "start": 549952,
      "text": "Wenig genutzt, denn auch die Explore Page."
    },
    {
      "confidence": 0.9186209,
      "end": 567280,
      "speaker": "B",
      "start": 551968,
      "text": "Bei denen ist super leer, muss man zugeben. Codeberg hat ebenfalls das, da wird es noch weniger genutzt. Dann nennt man Stars Favoriten, ist glaube ich auch so der bessere Name, denn so wie ich das jetzt herausgefunden habe, werden stars of Bookmarks genommen."
    },
    {
      "confidence": 0.9454844,
      "end": 579548,
      "speaker": "C",
      "start": 567360,
      "text": "Naja, Moment, aber das ist dann schon was anderes. Also für mich persönlich war das was anderes. Nur weil Stars missbraucht werden als Bookmar, heißt es ja nur, dass es eigentlich Bookmarks sind. Also Star und Bookmarken ist eigentlich schon nochmal ein Unterschied."
    },
    {
      "confidence": 0.9886825,
      "end": 581404,
      "speaker": "B",
      "start": 579644,
      "text": "Ja, ja, aber die werden halt so missbraucht."
    },
    {
      "confidence": 0.8936295,
      "end": 593884,
      "speaker": "C",
      "start": 581532,
      "text": "Ja, ja, klar, klar. Bei Bitbuckel bin ich ja nur, weil die das eins GB Limit nicht haben, was GitHub hat. Also da liegen so eins, zwei, drei Repositories, alte von mir, wo sehr viele Daten drin sind, große Daten."
    },
    {
      "confidence": 0.9045107,
      "end": 614102,
      "speaker": "B",
      "start": 593972,
      "text": "Wolfgang ist also einer, der nutzt die Code repositories immer als Backup Storage. Oje, schwierig. Nun gut, aber ne, bei BitBucket gibt es Stars nicht, da gibt es ein Ticket in deren Jira zu. Bei den anderen Plattformen wie Gox, Gitea und Launchpad habe ich jetzt nicht nachgeschaut, aber da würde ich mal sagen, die haben nicht so eine große Verbreitung."
    },
    {
      "confidence": 0.90743196,
      "end": 625158,
      "speaker": "C",
      "start": 614166,
      "text": "Okay, jetzt wissen wir, dass es woanders auch Stars gibt. Kommen wir zurück zu GitHub. Warum sind GitHub stars so wichtig und warum will man die vielleicht auch haben als Repository?"
    },
    {
      "confidence": 0.95516,
      "end": 626518,
      "speaker": "A",
      "start": 625334,
      "text": "Wenn wir sagen, wenn wir uns jetzt."
    },
    {
      "confidence": 0.93326277,
      "end": 637506,
      "speaker": "B",
      "start": 626534,
      "text": "Endlich darauf einigen, dass GitHub ein Social Network ist, ein Social Network für Entwickler, dann kann man Stars ähnlich wie Likes und Abonnenten, wie auf Instagram und Co. Sehen. Somit ist ein Engagement als Währung quasi."
    },
    {
      "confidence": 0.9503444,
      "end": 642226,
      "speaker": "C",
      "start": 637538,
      "text": "Oder Währung für, dass ich gut bin, dass ich toll bin, dass mein Repository toll ist."
    },
    {
      "confidence": 0.96965355,
      "end": 645058,
      "speaker": "B",
      "start": 642298,
      "text": "Ja, ich würde fast sagen, auf GitHub gibt es auch Entwickler, die so als."
    },
    {
      "confidence": 0.8341443,
      "end": 648386,
      "speaker": "D",
      "start": 645114,
      "text": "Dev Influencer gelten, populäre Entwickler, denen vielen."
    },
    {
      "confidence": 0.9302226,
      "end": 657538,
      "speaker": "B",
      "start": 648418,
      "text": "Leuten folgen und so weiter. Und wenn die ein neues Repository machen, dann kriegen die Repositories von den populären Entwicklern auch sehr viele Stars. Also im Endeffekt würde ich sagen, ja."
    },
    {
      "confidence": 0.99093,
      "end": 658434,
      "speaker": "D",
      "start": 657594,
      "text": "Das ist eine Währung."
    },
    {
      "confidence": 0.90816164,
      "end": 691014,
      "speaker": "B",
      "start": 658482,
      "text": "Und jetzt könnte man natürlich gucken, okay, was bringt mir das denn, wenn ich solche populären Repositories habe, denn wenn etwas populär ist, dann ist das natürlich eine tolle Sache und jeder freut sich. Aber es gibt natürlich auch immer eine Schattenseite. Und diese Schattenseiten haben wir in letzter Zeit natürlich auch so ein bisschen, ich sag mal, gesehen, zum Beispiel für Software Supply Chain Attacks, also Repositories mit einem hohen Star Count sind natürlich auch so ein Anziehfaktor, auch für Security Researcher. Okay, da schaue ich mal rein, da."
    },
    {
      "confidence": 0.98391,
      "end": 692502,
      "speaker": "D",
      "start": 691022,
      "text": "Scheint viel los zu sein."
    },
    {
      "confidence": 0.91182816,
      "end": 735664,
      "speaker": "B",
      "start": 692606,
      "text": "Wenn ich da etwas finde, dann ist mein Name vielleicht auch mal auf Heise und so weiter. Also auch für Hacker und für Attacker, aber auch für Security Researcher ist das ein guter Anziehpunkt. Im Endeffekt kann man sagen, GitHub stars ist halt schon ein Zeichen für Popularität, wo man hingegen natürlich sagen muss, dass GitHub Stars nicht gut korreliert mit der Anzahl der Downloads oder der tatsächlichen Installation. Habe ich ja gerade gesagt. Wenn irgendein populärer Entwickler ein neues Repository macht, kriegt er einfach fünf hundert Stars, ohne dass sich da jemand überhaupt mal git clone gemacht hat. Und die sagen natürlich auch nichts aus über die Nachhaltigkeit oder Lebensdauer eines Projekts. Wir hatten damals zum Beispiel diesen VW Skandal in Deutschland, der, glaube ich, diese."
    },
    {
      "confidence": 0.7801525,
      "end": 738240,
      "speaker": "D",
      "start": 735752,
      "text": "Diesel Testergebnisse etwas verfälscht."
    },
    {
      "confidence": 0.93447834,
      "end": 757078,
      "speaker": "B",
      "start": 738320,
      "text": "Danach gab es ein Repository, welches dein Ci immer grün erscheinen gelassen hat, egal ob das Ding kompiliert hat oder nicht, egal ob die Unittest erfolgreich waren oder fehlgeschlagen waren. Ob das Repository jetzt nachhaltig ist oder eine lange Lebensdauer haben sollte, weiß ich nicht. Das Repository hatte aber auf jeden Fall eine ganze Menge Stars, weil es echt lustig war."
    },
    {
      "confidence": 0.9360794,
      "end": 844160,
      "speaker": "C",
      "start": 757134,
      "text": "Wenn man aber nicht so lustig drauf ist, dann gibt es natürlich auch eine andere Möglichkeit. Und es gibt sie eigentlich überall. Man kennt es ja, man kann LinkedIn Likes kaufen, man kann Instagram Follower kaufen, man kann YouTube Follower kaufen. Also es ist ja eigentlich nichts Neues. Sobald es irgendwie so eine Währung gibt, gibt es auch einen Schwarzmarkt dafür, wo man sich das Ganze kaufen kann. Und mir war es zumindest neu, ehrlich gesagt, bevor dieses Paper rauskam, dass es das für GitHub auch gibt und dass GitHub stars auch so wertvoll sind. Vor allem, weil man ja denkt, das ist alles Open Source und in dieser Open Source Szene geht es ja um andere Dinge und die ist immer gut. Aber scheinbar gibt es da eben auch einen Black Market dafür. Und für so einen Star zahlt man so um die zehn, zwanzig Cent in der Gegend. Kann natürlich auch höher sein, je nachdem, wahrscheinlich je nach Qualität. Aber in dem Bereich im unteren Euro Bereich bewegt sich es üblich und man kann da relativ schnell innerhalb kürzester Zeit, also instant im Prinzip oder je nach Qualität, es ist dann natürlich auch teurer, wenn man qualitativere Stars haben will, dauert es auch zwei, drei, vier Wochen, zahlt man dann auch dementsprechend mehr. Aber man kann sich diese Stars auch kaufen. Und was mich jetzt natürlich beschäftigt hat, ist eben die Open Source Welt. Warum sollte ich mir eigentlich Stars kaufen? Es ist zwar nett, irgendwie die Größe zu haben und vielleicht, wenn ich dann Influencer bin, da irgendwie mehr Stars zu haben, aber ist es mir das wirklich wert? Macht es Sinn, Geld auszugeben für Stars?"
    },
    {
      "confidence": 0.90468323,
      "end": 885142,
      "speaker": "B",
      "start": 844240,
      "text": "Ja, das ist dieselbe Frage. Wie macht es Sinn, bei einer Engagement Farm bei LinkedIn dabei zu sein, wenn ich der Trump bin und Fake News verbreiten möchte? Also ich meine, im Endeffekt kannst du, kannst du aus der aus der Ecke der Bösewichte nachdenken. Und wenn wir sagen, GitHub ist ein Social Network, wenn wir sagen, dass wenn Repositories sehr viele Stars in sehr kurzer Zeit bekommen, dass dann ein Algorithmus sie aufnimmt und diese Repositories anderen Leuten vorschlägt, was nämlich GitHub auch macht, dann ist das natürlich der Trigger, hey, ich kaufe mir die GitHub stars und mach zum Beispiel ein Repository, was mal wer drin hat, ein Virus oder ähnliches und das."
    },
    {
      "confidence": 0.85663855,
      "end": 887094,
      "speaker": "D",
      "start": 885166,
      "text": "Haue ich in den Explore Algorithmus mit."
    },
    {
      "confidence": 0.9035219,
      "end": 912786,
      "speaker": "B",
      "start": 887102,
      "text": "Ganz vielen Githubs oder ich spam da einfach rum. Ich mache vielleicht eine Repository, einfach nur Werbung, vielleicht ist einfach nur kauf dieses Auto oder kauf diesen Bitcoin, ganz viel Krypto Kram oder Growth Hacking kann ja auch sein. Es gibt ziemlich viele Startups, die kaufen GitHub Sterne, um ihre Open Source Projekte irgendwie zu bewerben. Denn auch Venture Capitalists und Investoren beziehen sich auf GitHub Sterne für die Lebensfähigkeit von Produkten. Also nach dem Motto, wenn jetzt irgendein."
    },
    {
      "confidence": 0.81435716,
      "end": 914946,
      "speaker": "D",
      "start": 912818,
      "text": "Neues Database as a Service Startup rauskommt."
    },
    {
      "confidence": 0.9070324,
      "end": 949462,
      "speaker": "B",
      "start": 914978,
      "text": "Und die machen ihre Datenbank open source, dann sieht das natürlich besser aus, wenn man Stars hat versus fünf Stars. Ganz klar. Aber auch zumindest so wurde es im Paper so genannt, Entwickler, die ihren Lebenslauf ein bisschen aufhübschen wollen. Ich habe ein Repository, was ein tausend Stars hat. Finde ich auch mal eine schöne, eine schöne Story. Und wenn man das natürlich so weiterdenkt, dann hat das natürlich auch wirklich echt schwierige Auswirkungen, denn im Endeffekt minimiert das weiterhin den Wert eines Stars, aber es ist auch ein Security Risiko für alle GitHub User. Denn wenn du dir auf die Explore."
    },
    {
      "confidence": 0.92573357,
      "end": 953078,
      "speaker": "D",
      "start": 949606,
      "text": "Page gehst und hast mal gerade mal zehn, fünfzehn, zwanzig Minuten, willst dich einfach."
    },
    {
      "confidence": 0.9765,
      "end": 955310,
      "speaker": "B",
      "start": 953094,
      "text": "Nur mal inspirieren lassen, was gerade so."
    },
    {
      "confidence": 0.94363,
      "end": 957138,
      "speaker": "D",
      "start": 955690,
      "text": "Up to date ist, was geht gerade."
    },
    {
      "confidence": 0.83697265,
      "end": 969522,
      "speaker": "B",
      "start": 957154,
      "text": "So ab im Internet und so weiter. Und du siehst halt irgendwie fünf und dreiig Krypto Scam Malware Repositories, die irgendwie nach oben geboostet wurden, weil die sich Stars gekauft haben. Heißt dann auch immer natürlich schwierig, was."
    },
    {
      "confidence": 0.91350734,
      "end": 1007546,
      "speaker": "C",
      "start": 969546,
      "text": "Das Paper übrigens dann auch beschreibt, ob Growth Hacking funktioniert, also als kleiner Hook dabei bleiben. Wir werden es auch noch später behandeln, ob das wirklich funktioniert und langfristig auch zum Ziel führt. Aber bleiben wir mal bei dem Kaufen von Stars bzw. Dann auch beim Erkennen von solchen gefakten, gekauften Stars. Kannst du mal kurz erklären, wie das Paper bzw. Die Wissenschaftler habe übrigens auch gerade gelernt, in Österreich sagt man Wissenschaftler und in Deutschland Wissenschaftler war übrigens eine Frau, die Hauptautorin. Aber Andy, erklär mal, wie das Team um diese Hauptautorin vorgegangen ist, um das zu entdecken, die gefakt waren."
    },
    {
      "confidence": 0.9183295,
      "end": 1014538,
      "speaker": "B",
      "start": 1007578,
      "text": "Ja, du hast ja gerade schon was von qualitativem GitHub Stars gesprochen. Da fragt man sich natürlich was genau."
    },
    {
      "confidence": 0.898505,
      "end": 1015418,
      "speaker": "C",
      "start": 1014554,
      "text": "Meine ein und dreiig."
    },
    {
      "confidence": 0.8696462,
      "end": 1037740,
      "speaker": "B",
      "start": 1015514,
      "text": "Ja, was sind denn eigentlich qualitative GitHub stars? Also ich meine, die Herausforderung von der Erkennung von Fake Stars ist eigentlich dieselbe wie die Erkennung von Fake Twitter Accounts, gefakten Interaktionen auf LinkedIn und so weiter. Im Endeffekt hat man natürlich auf der einen Seite irgendwelche Bots, automatisch erstellte Accounts."
    },
    {
      "confidence": 0.96191716,
      "end": 1039672,
      "speaker": "D",
      "start": 1037890,
      "text": "In der Regel sind das dann Accounts."
    },
    {
      "confidence": 0.8475597,
      "end": 1052728,
      "speaker": "B",
      "start": 1039736,
      "text": "Die kein ordentliches Avatar Bild haben, wenig Informationen haben, vielleicht gerade erst frisch erstellt wurden, vielleicht sogar auch nur ein Repository gestartet und geforkt haben, aber nie Code gepusht haben. So was halt."
    },
    {
      "confidence": 0.8973619,
      "end": 1077108,
      "speaker": "C",
      "start": 1052824,
      "text": "Was ich mir übrigens ziemlich schwer auch vorstelle, weil wenn ihr zurückdenkt an meine Anfangszeit, ich habe halt auch einfach so ein GitHub Profil gehabt und kein Profilbild und bin da glaube ich, echt jahrelang ohne ein Profilbild oder ich habe, glaube ich, immer nur dasselbe uralte Profilbild und hin und wieder starten wir mal was. Also ist glaube ich, gar nicht so leicht zu erkennen, weil viele User einfach nicht aktiv sind auf GitHub und trotzdem einen User haben."
    },
    {
      "confidence": 0.8869361,
      "end": 1124995,
      "speaker": "B",
      "start": 1077164,
      "text": "Ja, und da stellst du die Herausforderung so nach dem Motto ich habe ja Criteria gerade genannt von einem Account und jetzt ist die ist das ein wirklicher Mensch? Ist das ein Wolfgang aus Tirol, aus Innsbruck, der einfach nur zu faul war, irgendwas einzugeben oder ist das ein Bot? Dann gibt es natürlich Crowdsourced Humans, das ist eigentlich so eine Art, hast du bestimmt schon mal bekommen, so E Mails von irgendwelchen Researchern, so hey, ich habe jetzt hier dieses neue Repository, vielleicht möchte sie mir mal Star da lassen oder ähnliches. Das machen die meist, wenn du Kubernetes gestartet hast, dann nehmen die sich alle Star Gazer via API, holen sich dann die Public e Mail Adresse, schreiben die an und sagen, hey, ich habe gesehen, du hast Kubernetes geliked, da hinten habe ich einen neuen Load Balancer für Kubernetes geschrieben, vielleicht ist das auch was für dich. Vielleicht startet."
    },
    {
      "confidence": 0.9282143,
      "end": 1126652,
      "speaker": "C",
      "start": 1125167,
      "text": "Aber da könnte man ja fast sagen."
    },
    {
      "confidence": 0.9226855,
      "end": 1163698,
      "speaker": "B",
      "start": 1126716,
      "text": "Das ist Marketing, ja, oder illegaler Spam, weil du, ist eigentlich eine cold E Mail, wenn du so möchtest, ist aber so eine Art Crowdsource Human. Ob das Marketing ist, weiß ich nicht. Bei mir landet es direkt im Müll erstmal. Und die dritte Herausforderung, also da ist auch die Herausforderung, okay, ist das jetzt irgendwie Crowdsource oder nicht, man weiß es nicht. Und dann gibt es sogenannte Engagement Plattformen, die gibt es auch für LinkedIn, das sind spezielle Gruppen auf Signal, WhatsApp, Telegram, keine Ahnung was, wo sich Leute zusammenschließen. Und Wolfgang, wenn du jetzt einen neuen Link in Post hast, dann schreibst du in die Gruppe, hey, könnt ihr den mal boosten?"
    },
    {
      "confidence": 0.941746,
      "end": 1168130,
      "speaker": "D",
      "start": 1163794,
      "text": "Und dann gehen diese Leute hin und kommentieren und liken und teilen und so weiter."
    },
    {
      "confidence": 0.95051235,
      "end": 1172130,
      "speaker": "B",
      "start": 1168170,
      "text": "Und die erwarten das natürlich dann auch von dir. Und sowas gibt es natürlich auch für GitHub."
    },
    {
      "confidence": 0.95303,
      "end": 1173698,
      "speaker": "D",
      "start": 1172210,
      "text": "Wenn du jetzt ein neues Repository hast."
    },
    {
      "confidence": 0.8548707,
      "end": 1181786,
      "speaker": "B",
      "start": 1173714,
      "text": "Dann speichst du dein Repository da in die Gruppe und jeder haut erstmal ein Star drauf und forkt das und so weiter. Füttert halt so ein bisschen den GitHub Algorithmus."
    },
    {
      "confidence": 0.88314146,
      "end": 1183594,
      "speaker": "D",
      "start": 1181818,
      "text": "Das sind so diese Engagement Plattforms und."
    },
    {
      "confidence": 0.9494292,
      "end": 1191946,
      "speaker": "B",
      "start": 1183602,
      "text": "Das kannst du dir auch einkaufen. Du kannst hier, also das müssen nicht nur Gruppen mit deinen Freunden sein, da gibt es auch wirklich Plattformen, da kannst du dich dann einladen lassen und da sind dann tausende von Leuten."
    },
    {
      "confidence": 0.928478,
      "end": 1199034,
      "speaker": "C",
      "start": 1192058,
      "text": "Das heißt, das nächste Mal, wenn du mir eine Message schreibst, like doch meinen Hacker News Beitrag, dann kann ich dir eine Rechnung stellen danach."
    },
    {
      "confidence": 0.9274191,
      "end": 1242828,
      "speaker": "B",
      "start": 1199162,
      "text": "So ungefähr. Genau. Also das waren jetzt die Herausforderungen, wie erkenne ich Fake User, die GitHub Stars verteilen. Das Paper sagt aber noch zwei weitere Herausforderungen. Auf der einen Seite ist das der Zugang zu den Daten, denn GitHub Daten selbst sind sehr, sehr groß und die GitHub API hat natürlich ein Rate Limit. Das bedeutet, man kriegt da einfach nicht alle Daten raus. Und die Researcher hatten jetzt nicht Zugriff auf die GitHub Datenbank selbst, also der Zugriff auf die Daten ein bisschen erschwert. Und die zweite Thematik ist natürlich auch, die haben sich zum Beispiel auf das GitHub Archive bezogen. Das GitHub Archive ist der Webhook Event Stream, der in BigQuery zur Verfügung steht. Die kann man sich runterladen, das sind circa zwanzig Terabyte von Metadaten aktuell."
    },
    {
      "confidence": 0.86123717,
      "end": 1244716,
      "speaker": "A",
      "start": 1242924,
      "text": "Und was da passiert ist, ich habe."
    },
    {
      "confidence": 0.91723216,
      "end": 1249388,
      "speaker": "B",
      "start": 1244748,
      "text": "Gerade gesagt, das ist der Webhook Stream. Und wenn man den Webhook von zwei."
    },
    {
      "confidence": 0.89866,
      "end": 1251804,
      "speaker": "D",
      "start": 1249444,
      "text": "Tausend neunzehn nimmt, von einem Event, von."
    },
    {
      "confidence": 0.94499725,
      "end": 1259772,
      "speaker": "B",
      "start": 1251812,
      "text": "Einem Fork Event und dann mit diesen Daten gegen die aktuelle API geht und fragt aha, gibt es dieses Repository denn noch?"
    },
    {
      "confidence": 0.8875286,
      "end": 1261740,
      "speaker": "D",
      "start": 1259796,
      "text": "Was zwei tausend neunzehn dieses Fork Event."
    },
    {
      "confidence": 0.92302924,
      "end": 1275944,
      "speaker": "B",
      "start": 1261780,
      "text": "Hatte aus dem GitHub Archive, dann kann das sein, dass die Antwort nein, das gibt es nicht mehr, weil GitHub löscht Repositories und User. Und das ist natürlich eine zweite Herausforderung, die die Researcher hatten beim Zugriff auf die Daten."
    },
    {
      "confidence": 0.91789335,
      "end": 1277688,
      "speaker": "C",
      "start": 1276032,
      "text": "Und wie groß ist dieses Archive?"
    },
    {
      "confidence": 0.8971474,
      "end": 1306802,
      "speaker": "B",
      "start": 1277784,
      "text": "Die haben sich auf das GitHub Archiv bezogen mit bisschen mehr als sechzig Millionen User und mit über drei hundert Millionen Repositories und mit sechs hundert Millionen Stars. Und das alles war aufgeteilt auf sechs Milliarden Webhook Events. Also da könnte schon sagen, okay, das war eine GitHub Analyse auf Scale. Aber deswegen ist die Herausforderung mit den GitHub Rate API Limits natürlich doch schon relevant."
    },
    {
      "confidence": 0.9391827,
      "end": 1318018,
      "speaker": "C",
      "start": 1306866,
      "text": "Das heißt, wenn es von zwei tausend neunzehn bis zwei tausend vier und zwanzig war, sind es fünf Jahre. Das heißt, man kann davon ausgehen, dass man so eine Milliarde Webhook Events pro Jahr so ungefähr hat."
    },
    {
      "confidence": 0.979373,
      "end": 1321554,
      "speaker": "B",
      "start": 1318154,
      "text": "Ja, eins komma zwei Milliarden Webhook Events pro Jahr. Genau."
    },
    {
      "confidence": 0.9189826,
      "end": 1326978,
      "speaker": "C",
      "start": 1321682,
      "text": "Wahrscheinlich am Anfang weniger. GitHub wächst ja vor allem in den letzten fünf Jahren, ist wahrscheinlich sehr stark gewachsen."
    },
    {
      "confidence": 0.9203917,
      "end": 1365996,
      "speaker": "B",
      "start": 1327074,
      "text": "So, und was hat das Paypal jetzt eigentlich gemacht? Wie haben die, haben die das analysiert? Die haben sich ein Tool gebaut, nennt sich StarScout. Verlinken wir auch in den Shownotes, ist Open Source, kann man sich ansehen. Starscout selbst ist ein Python Tool. Und was dieses Python Tool macht, ist folgendes. Um ein Fake GitHub star zu erkennen, führen sie zwei Analysen aus. Die erste Analyse ist die sogenannte Low Activity Signature. Dort nehmen die sich jeden Star und schauen sich danach den User an und versuchen ist dieser User Stale gewesen, nachdem."
    },
    {
      "confidence": 0.8356,
      "end": 1367420,
      "speaker": "D",
      "start": 1366028,
      "text": "Er den Star gemacht hat?"
    },
    {
      "confidence": 0.9182274,
      "end": 1395210,
      "speaker": "B",
      "start": 1367460,
      "text": "Also inaktiv gewesen? Also hat er diesen Star gemacht und dann keine Aktion mehr. Das könnten GitHub Konten sein, die mit nur einem Watch Event gestartet sind. Also ein Watch Event ist ein Star geben oder ich watche das Repository. Watchen in GitHub bedeutet, ich kriege eine E Mail zu jedem Issue, zu jedem Pull, Request und so weiter und so fort. Und wenn sie danach höchstens noch ein weiteres Event haben von dem gleichen Repository."
    },
    {
      "confidence": 0.8572487,
      "end": 1397402,
      "speaker": "D",
      "start": 1395290,
      "text": "Am gleichen Tag, zum Beispiel ein Fork Event."
    },
    {
      "confidence": 0.85727143,
      "end": 1409924,
      "speaker": "B",
      "start": 1397506,
      "text": "Das bedeutet, du hast einen Account, der start ein Repository und am selben Tag forkt er das Repository noch mal und wenn der danach still gegangen ist, dann sagen die okay, das ist ein Fake."
    },
    {
      "confidence": 0.9144882,
      "end": 1416708,
      "speaker": "C",
      "start": 1409972,
      "text": "Account, also so ein One off Account quasi, den man nur einmal verwendet oder für eine Aktion und dann ist wieder Ruhe."
    },
    {
      "confidence": 0.93608385,
      "end": 1431812,
      "speaker": "B",
      "start": 1416804,
      "text": "Genau, das ist halt so ein Bot Account, so ein klassischer ich erstelle einen neuen GitHub Account und mache dafür einen Star. Und das würde ich jetzt mal qualifizieren als ein nicht Quality Star, wie du ihn bezeichnet hast. Und deswegen nennen die das Low Activity Signature."
    },
    {
      "confidence": 0.9605249,
      "end": 1445232,
      "speaker": "C",
      "start": 1431876,
      "text": "Das heißt, sie analysieren nicht den Star selbst, sondern gehen immer auf die Accounts und versuchen die Accounts zu identifizieren. Und dann geht man davon aus, wenn es ein Bot Account oder ein böser Account ist, dem seine Stars sind dann auch alles Fake stars."
    },
    {
      "confidence": 0.94414407,
      "end": 1457264,
      "speaker": "B",
      "start": 1445296,
      "text": "Ja, genau. Ein Star selbst kannst du ja nicht analysieren, weil ein Star ist ja eigentlich nur, ich sag mal, ein Klick auf ein Repository von einem User zu einem Zeitpunkt. Also da gibt es ja kein weiteres Element außer die Zeit."
    },
    {
      "confidence": 0.90362155,
      "end": 1471614,
      "speaker": "C",
      "start": 1457352,
      "text": "Ja, man könnte natürlich schon unter Umständen vielleicht ein Verhalten pro Repository feststellen, ist aber sicher schwieriger natürlich, weil es kann natürlich auch natürlich sein, wenn es da ein Spike gibt auf einem Repository, weil eben auf Hacker News oder so jemand steil gegangen ist."
    },
    {
      "confidence": 0.8948543,
      "end": 1481438,
      "speaker": "B",
      "start": 1471702,
      "text": "Du gehst gerade schon in die richtige Richtung, was die zweite Analyse angeht, der sogenannten Lockstep Signature und die ist ein bisschen, bisschen sophisticater würde ich mal sagen."
    },
    {
      "confidence": 0.95371854,
      "end": 1482942,
      "speaker": "D",
      "start": 1481454,
      "text": "Da steckt ein bisschen mehr Fleisch hinter."
    },
    {
      "confidence": 0.79443914,
      "end": 1488078,
      "speaker": "C",
      "start": 1483006,
      "text": "So jetzt Andi, ich will schon ein deutsches Wort hören. Sophisticated. Ausgefeilter."
    },
    {
      "confidence": 0.99806,
      "end": 1489038,
      "speaker": "D",
      "start": 1488254,
      "text": "Anspruchsvoll."
    },
    {
      "confidence": 0.90184,
      "end": 1496522,
      "speaker": "B",
      "start": 1489054,
      "text": "Ich musste gerade nachschauen, was sophisticated auf Deutsch als anspruchsvoll, aber muss ich zugeben, ist dir jetzt auch nicht eingefallen, von."
    },
    {
      "confidence": 0.939266,
      "end": 1499178,
      "speaker": "C",
      "start": 1496546,
      "text": "Daher ausgefeilter passt doch gut."
    },
    {
      "confidence": 0.91189575,
      "end": 1508282,
      "speaker": "B",
      "start": 1499234,
      "text": "Genau, die locks Signatur, die ist ein bisschen ausgefeilter, ein bisschen anspruchsvoller. Da wird versucht zu erkennen, ob eine Gruppe von Nutzern sehr ähnliche Dinge tut."
    },
    {
      "confidence": 0.9739,
      "end": 1510170,
      "speaker": "D",
      "start": 1508346,
      "text": "Und zwar zur gleichen Zeit."
    },
    {
      "confidence": 0.9171006,
      "end": 1534326,
      "speaker": "B",
      "start": 1510290,
      "text": "Das klingt jetzt erstmal logisch. Du hast ja gerade schon gesagt, was ist, wenn ich sage, ich kaufe mir jetzt ein hundert Stars und der Schwarzmarkt sagt, ich kriege diese ein hundert Stars gleichzeitig auf mein Repository oder instant, wie sie mir versprechen. Das würde bedeuten, dass ein hundert Accounts meinen Code oder mein Repository in sehr kurzer Zeit starren und das wäre dann."
    },
    {
      "confidence": 0.97812283,
      "end": 1536326,
      "speaker": "D",
      "start": 1534398,
      "text": "Eine Gruppe von Nutzern, die sehr ähnliche."
    },
    {
      "confidence": 0.99471,
      "end": 1538502,
      "speaker": "B",
      "start": 1536358,
      "text": "Dinge tut und zwar zur gleichen Zeit."
    },
    {
      "confidence": 0.92802906,
      "end": 1558998,
      "speaker": "C",
      "start": 1538606,
      "text": "Wobei das alleine wäre ja noch kein Problem, wenn ich so eine Gruppe habe. Das Problem entsteht ja dann erst, wenn dieselbe Gruppe auch andere Repositories liked und zwar immer zusammen als Gruppe. Das heißt, ich finde dann eine Gruppe, die gemeinsam immer innerhalb kürzester Zeit ein Repository liked und dann kann ich darauf schließen, okay, das muss so eine Bot Gruppe sein."
    },
    {
      "confidence": 0.8905942,
      "end": 1563474,
      "speaker": "B",
      "start": 1559054,
      "text": "Ganz genau. Und dann da geht es, da geht es halt jetzt drum. Und wie haben sie das gemacht?"
    },
    {
      "confidence": 0.94685286,
      "end": 1564898,
      "speaker": "D",
      "start": 1563522,
      "text": "Weil das ist nämlich jetzt ein tricky."
    },
    {
      "confidence": 0.88563526,
      "end": 1573410,
      "speaker": "B",
      "start": 1564914,
      "text": "Problem, weil im Endeffekt ist das eigentlich genau dasselbe, was die Fraud Detection bei Facebook ist oder bei LinkedIn oder bei."
    },
    {
      "confidence": 0.9006575,
      "end": 1575010,
      "speaker": "D",
      "start": 1573450,
      "text": "Instagram und so weiter."
    },
    {
      "confidence": 0.90178525,
      "end": 1582818,
      "speaker": "B",
      "start": 1575130,
      "text": "Weil ob ich jetzt einen Repository Star oder einem Instagram Account folge, mir also follower kaufe, ist eigentlich genau das gleiche."
    },
    {
      "confidence": 0.79440457,
      "end": 1595154,
      "speaker": "C",
      "start": 1582914,
      "text": "Dahinter steckt ein ganz simpler Algorithmus, der nur so nebenbei NP hard ist und auf BiPa Dite Graphen basiert. Und der Andi erklärt uns jetzt das ganze mit Pipati graphen oder wie seht ihr es?"
    },
    {
      "confidence": 0.92192,
      "end": 1615598,
      "speaker": "B",
      "start": 1595232,
      "text": "Also soviel ich weiß, bist du der Doktor der Datenbanken sogar. Deswegen würde ich du erklärst jetzt, was Bipartitegraphen erstmal sind und danach schauen wir mal, wie weit du kommst und ob ich das verstehe. Denn als Doktor, soviel ich weiß, musst du auch sehr viele Stunden Lehrauftrag erfüllen."
    },
    {
      "confidence": 0.901525,
      "end": 1616830,
      "speaker": "D",
      "start": 1615694,
      "text": "Und ich bin jetzt dein Student."
    },
    {
      "confidence": 0.8430213,
      "end": 1620792,
      "speaker": "B",
      "start": 1616910,
      "text": "Also lieber Wolfgang, was ist ein bipartiter Graph?"
    },
    {
      "confidence": 0.9299793,
      "end": 1663608,
      "speaker": "C",
      "start": 1620936,
      "text": "Ich bin mir nicht sicher, ob das wirklich hilfreich ist, um das zu verstehen. Bipartite Graphen sind im Prinzip Graphen, die man in zwei Gruppen einteilen kann. Also alle Knoten und die Verbindungen zwischen den zwei Gruppen sind so, dass sie eben nur von Gruppe eins nach Gruppe zwei oder umgekehrt gehen und nie innerhalb der Gruppen basieren. Also dass man einfach so ein Graph teilt auf eine linke und eine rechte Seite, wenn man es ganz dumm sieht. Und darauf aufbauen kann man dann natürlich dieses Problem setzen, was wir jetzt genau beschrieben haben mit den Gruppen, wenn es eine Gruppe zwei Repositories liked. Also dann hast du Repositories auf der linken Seite, die User auf der rechten Seite und dann versucht du so mit dem bipartiten Problem das eigentliche Problem mit den fake Accounts zu lösen."
    },
    {
      "confidence": 0.89160883,
      "end": 1678932,
      "speaker": "B",
      "start": 1663784,
      "text": "Genau. Was sie gemacht haben, die haben alle User als Knoten in den Graph gepackt, alle Repository als Knoten in den Graph gepackt. Die haben dann diese User mit den Repositories mit Kanten verknüpft und die Kanten war dann wirklich ein User hat ein."
    },
    {
      "confidence": 0.85621715,
      "end": 1681684,
      "speaker": "D",
      "start": 1678956,
      "text": "Repository gestart und als Metadata an die."
    },
    {
      "confidence": 0.907606,
      "end": 1685460,
      "speaker": "B",
      "start": 1681692,
      "text": "Kante haben die den Timestamp gepackt, wann der Star ausgeführt."
    },
    {
      "confidence": 0.9528767,
      "end": 1686916,
      "speaker": "D",
      "start": 1685540,
      "text": "Das ist jetzt also der Graph."
    },
    {
      "confidence": 0.8523792,
      "end": 1701748,
      "speaker": "B",
      "start": 1687028,
      "text": "Und was jetzt versucht wurde, ist sogenannte Gruppen, bipartite Kerne zu finden. Ein bipartiter Kern ist ein maximaler Teilgraph, der alle Kanten zwischen zwei nicht disjunkten."
    },
    {
      "confidence": 0.787535,
      "end": 1703732,
      "speaker": "D",
      "start": 1701844,
      "text": "Mengen von Knoten enthält."
    },
    {
      "confidence": 0.95324,
      "end": 1705314,
      "speaker": "C",
      "start": 1703876,
      "text": "Hast du schön abgelesen?"
    },
    {
      "confidence": 0.91388726,
      "end": 1745326,
      "speaker": "B",
      "start": 1705452,
      "text": "Habe ich schön abgelesen, dass Research ist. Ich bin ja auch kein super smarter Mensch, deswegen muss ich mir da auch mal ein bisschen bei helfen. Aber was versucht wird, ist eigentlich herauszufinden, gibt es eine Gruppe von Usern, die zu einem ähnlichen oder sehr nahen Zeitpunkt dieselben Aktionen tätigt. Und das natürlich nicht immer nur zu einem Zeitpunkt, sondern zu mehreren Zeitpunkten. Denn wenn man sich das jetzt mal logisch nachdenkt, du hast eine bot Gruppe, die start in einem sehr kleinen Zeitraum ein Repository und das tut sie öfters, über eine Woche oder über einen Monat oder ähnliches. Also eine Gruppe, die zusammen agiert."
    },
    {
      "confidence": 0.9268108,
      "end": 1788162,
      "speaker": "C",
      "start": 1745438,
      "text": "Was, glaube ich, da einfach wichtig ist, ist, dass man gar nicht das jetzt versteht, weil es ist wirklich ein komplexes Problem, sonst wäre es nicht NP hard. Wichtig ist aber zu verstehen, dass diese Grundaussage, wir finden da jetzt Gruppen, die dieselben Repositories, gar nicht so ein triviales Problem ist, sondern eigentlich ziemlich komplexes Problem ist. Das rechnet auch wirklich lang, dieses Ding, wenn man das anwirft. Die Wissenschaftler haben aber auch zurückgreifen können auf einen Algorithmus, der Copycatch heißt von Facebook, wenn ich das richtig im Kopf habe, und haben da natürlich auch aufgebaut. Also wie der Andi richtig gesagt hat, das sind ja schon Algorithmen, die bei anderen Social Networks in Verwendung sind und da muss man nicht immer das Rad neu erfinden."
    },
    {
      "confidence": 0.8740808,
      "end": 1802306,
      "speaker": "B",
      "start": 1788226,
      "text": "Was die machen ist, und zwar grenzen die das Problem so ein bisschen ein. Erstens sagen die Researcher, wir untersuchen nur Repositories, die mehr als fünfzig Stars haben. Alles drunter schmeißen die erstmal weg, betrachten die gar nicht."
    },
    {
      "confidence": 0.959435,
      "end": 1805474,
      "speaker": "D",
      "start": 1802378,
      "text": "Dann ist die zweite Einschränkung eine zeitliche Einschränkung."
    },
    {
      "confidence": 0.9708329,
      "end": 1807810,
      "speaker": "B",
      "start": 1805522,
      "text": "Die sagen, die suchen nur in einem."
    },
    {
      "confidence": 0.903195,
      "end": 1810146,
      "speaker": "D",
      "start": 1807930,
      "text": "Suchraum über fünfzehn Tage."
    },
    {
      "confidence": 0.9380362,
      "end": 1831154,
      "speaker": "B",
      "start": 1810178,
      "text": "Das bedeutet Gruppen, die innerhalb von fünfzehn Tagen dieselben Aktionen getätigt haben. Und wie der Wolfgang schon sagte, das ist ein heuristisches und greedy Verfahren. Somit versuchen sie nicht die perfekte Lösung zu finden, sondern eine gut brauchbare Lösung, um halt, ich sage mal, den Trade off für einen schnelleren Algorithmus zu haben."
    },
    {
      "confidence": 0.8946706,
      "end": 1835394,
      "speaker": "C",
      "start": 1831242,
      "text": "Jetzt, wenn du sagst, es ist eine Annäherung, wie nahe sind wir denn an der Realität?"
    },
    {
      "confidence": 0.9167761,
      "end": 1930338,
      "speaker": "B",
      "start": 1835522,
      "text": "Ja, das ist jetzt die große Frage. Jetzt haben die halt diese zwei Signale, einmal diese Low Activity Signature und einmal diese Lockstep Signature und haben die gesagt, okay, vielleicht sollten wir daraus jetzt nochmal ein Post Processing machen mit den Daten. Und was sie dann gemacht haben, die haben jetzt aus der Repository Sicht geguckt und nicht mehr aus der User Sicht. Aus der Repository Sicht haben sie gesagt, okay, welches Repository hat einen Spike von neun Stars bekommen? Und wenn die die drei Signale kombinieren, dann schließen die Researcher drauf, mit hoher Wahrscheinlichkeit sind das jetzt Fake Accounts bzw. Fake stars. Die sagen ja nicht, dass das Fake Accounts sind, sondern Fake stars. Ich kann ja auch Teil einer Engagementgruppe sein, deswegen ist ja mein User nicht Fake, deswegen ist ja nur der Star eigentlich fake. Aber die sagen auch, es gibt ein paar Einschränkungen und Gefahren für die Validität der Daten, denn die Researcher beziehen sich natürlich nur auf öffentlich zugängliche Daten. Das bedeutet, da besteht die Frage, reichen die Daten und die Analyse aus, um wirklich Aktionen zu tätigen, um Stars zurückzunehmen? Und da kommen die Researcher zu dem Ergebnis, wahrscheinlich nicht, denn eine nicht öffentliche Information ist zum Beispiel die User IP Adresse. Wenn man die User IP Adresse natürlich konstant hat und eine IP Adresse hat mehrere Accounts oder operiert mehrere Accounts, dann ist das natürlich auch ein Indikator dafür, dass dass da irgendwo ein Server steht mit einem Python Skript, der sich konstant irgendwo einloggt. False positives gibt es natürlich auch immer."
    },
    {
      "confidence": 0.85368,
      "end": 1932882,
      "speaker": "C",
      "start": 1930394,
      "text": "Wieder, denn was sind false positives?"
    },
    {
      "confidence": 0.9022464,
      "end": 1961828,
      "speaker": "B",
      "start": 1932946,
      "text": "Ja, false positives bedeutet, der Wolfgang, der einen GitHub Account gemacht hat, das Standard Avatar gelassen hat, jeden Abend Hacker News liest, kaum Code zu GitHub selbst, kontributet aber jeden Abend immer die public repositories of Hacker News. Start könnte in dieser Analyse mit runterfallen, dann wirst du als Fake Star Bot Account User geflaggt, obwohl du vielleicht ein richtiger Mensch bist und zufällig nur das Pattern passt. Das wäre ein false positive."
    },
    {
      "confidence": 0.92000407,
      "end": 2010530,
      "speaker": "C",
      "start": 1961924,
      "text": "Also ist sehr schön, dass die Wissenschaftler da auch dementsprechend natürlich darauf eingehen, dass es false positives gibt und Probleme mit den Daten. Ich als ehemaliger Wissenschaftler muss da schon immer sagen, es ist eigentlich ziemlich schade, dass da immer sehr wenig von den Plattformen selbst kommt. Also scheinbar hat GitHub da keine Forschung. Ich kann mich erinnern, früher Twitter war da auch immer sehr leise. Also wenn es gerade um die ganzen Bots Sachen geht, gibt es da recht wenig von den Plattformen. Also das finde ich immer sehr schade, dass dann die Wissenschaftler irgendwas rausbringen müssen und die agieren halt immer auf so halbseitenden Daten. Also das finde ich schon immer sehr schade. Aber trotzdem, ich glaube, auch bei dieser Research sieht man eine klare Tendenz, auch wenn man die natürlich immer mit Vorsicht genießen muss. Aber ich glaube, die Tendenz ist absolut klar. Also was ist die Tendenz, Andi? Und was sind jetzt die Ergebnisse von dem Ganzen?"
    },
    {
      "confidence": 0.88908386,
      "end": 2041932,
      "speaker": "B",
      "start": 2010610,
      "text": "Genau, da haben wir noch gar nicht drüber gesprochen, denn bei so einer Research steht natürlich immer so eine Grundthese vorne dran bzw. Sogenannte Research Fragen. Und da hat das Team vier Stück aufgeworfen. Die erste Frage ist eigentlich wie weit verbreitet sind denn jetzt eigentlich gefälschte Stars auf GitHub? Und das Ergebnis war vor zwei tausend vier und zwanzig waren die wirklich nur sehr, sehr begrenzt verbreitet und von geringer Bedeutung. Kannst du eigentlich vernachlässigen. Aber im Jahr zwei tausend vier und."
    },
    {
      "confidence": 0.9051443,
      "end": 2044236,
      "speaker": "D",
      "start": 2041956,
      "text": "Zwanzig steigt die Zahl der Fake Star."
    },
    {
      "confidence": 0.87681395,
      "end": 2083900,
      "speaker": "B",
      "start": 2044308,
      "text": "Kampagnen jedoch um das hundertfache an. In der Spitze im Juli zwei tausend vier und zwanzig erkannte Starscout, also das Tool, von dem wir gerade gesprochen haben, gefälschte Star Kampagnen für fünfzehn Prozent der Repositories mit über fünfzig Stars in diesem Monat. Also das schon eine harte Nummer, aber eine gute Nachricht nur vier und sechzig Repositories von diesen identifizierten Repositories, die eine gefälschte Star Kampagne erhalten haben, waren auf NPM oder Piep veröffentlicht. Also somit war der Effekt, der Security Effekt etwas milder."
    },
    {
      "confidence": 0.9342483,
      "end": 2111118,
      "speaker": "C",
      "start": 2083980,
      "text": "Also es klingt schon eher danach, als wenn das dann für Scams und so die andere Schiene eigentlich genutzt wurde, wo man halt wirklich mit Bots sehr viel Sachen erzeugen kann, dann Spam verschicken kann, vielleicht mit Links auf GitHub oder sonst irgendwas und weniger die klassische Lücke, dass man Backdoor, was man einschleust in irgendein package oder so, also supply chain attacks, dass die vielleicht jetzt da nicht so klassisch in dieses pattern mit reinfallen, bevor."
    },
    {
      "confidence": 0.8844348,
      "end": 2147482,
      "speaker": "B",
      "start": 2111134,
      "text": "Ich da jetzt ja oder nein sage. Das war nämlich genau research. Frage nummer zwei was sind die Merkmale von GitHub Repositories mit gefälschten Starcomputern? Und da ist das Ergebnis, dass das meist, wie du schon richtig beschrieben hast, weniger Supply Chain Attacken waren, sondern eher kurzlebige Phishing Malware repositories, Raubkopien, Software Spiele, Cheats oder Kryptowährung Bots oder irgendwie sowas. Also wirklich schon, ich sag mal realer Scam. Und das muss ich zugeben, ist eine gute Neuigkeit, oder? Also ich habe lieber ein bisschen Scam Kram als Supply Chain Attacken in NPM und pypy. Repositories."
    },
    {
      "confidence": 0.9112387,
      "end": 2200618,
      "speaker": "C",
      "start": 2147626,
      "text": "Und die nächste Research Question, die sie sich gestellt haben, fällt eigentlich in einen ähnlichen Bereich rein. Also was sind die Merkmale von GitHub Konten, die da Fake Stars vergeben haben? Und es geht eigentlich genau in die gleiche Richtung, dass das eher so die klassischen Bot Accounts sind, die man leicht identifizieren kann über deren Profil, dass die wirklich jetzt keine sophisticated, sage ich auch schon, sophisticated, umfangreiche Aktivität zum Beispiel haben, diese diese Accounts. Also dass man den Unterschied zwischen ganz klaren echten Accounts und den Bot Accounts doch recht schnell erkennen kann, weil die Aktivität einfach nicht vorhanden ist gegenüber einem sinnvollen normalen User, der in dem Social Network eben agiert und contributed und fockt und stars macht und nicht nur diese Stars in kurzer Zeit, weil das ist einfach dann zu trivial für einen echten User."
    },
    {
      "confidence": 0.8973153,
      "end": 2241368,
      "speaker": "B",
      "start": 2200714,
      "text": "Das denke ich, ist eine gute Neuigkeit. Aber research frage vier und somit die letzte research Frage finde ich nämlich auch sehr interessant. Inwieweit sind Fake stars effektiv bei der Förderung von den Ziel GitHub Repositories? Also das bedeutet, wenn man jetzt sagen möchte, okay, ich kaufe Stars für Growth Hacking, bringt das mir was? Und was herausgefunden wurde, ist, dass wenn du Fake stars kaufst, in den ersten zwei Monaten die Repositories einen kleinen positiven Effekt verzeichnen können in Bezug auf die Anziehung echter Stars. Das bedeutet echter Nutzeraufmerksamkeit."
    },
    {
      "confidence": 0.8829425,
      "end": 2248312,
      "speaker": "C",
      "start": 2241464,
      "text": "Also das klassische reichere Leute werden immer reicher, Repositories mit vielen Sternen bekommen immer mehr Sterne."
    },
    {
      "confidence": 0.9030606,
      "end": 2285402,
      "speaker": "B",
      "start": 2248456,
      "text": "Ganz genau. Das bedeutet eigentlich, dass diese komplette Algorithmus Fakerei funktioniert. Also der Wolfgang macht ein neues Repository, kauft sich GitHub stars, geht in den Explore Algorithmus und weil du dann kurzzeitig in diesem Explore Algorithmus bist, bekommst du über die ersten zwei Monate dann reale Stars von realen Nutzern. Aber es wurde auch gesagt, nach zwei Monaten haben die gefälschten Stars jedoch einen negativen Effekt bzw. Halt weniger Zuwachs von externen Sternen und negativen Effekt, denn wenn diese Bot Accounts erkannt werden, werden diese Accounts gelöscht. Haben wir ja gerade gesagt, das ist."
    },
    {
      "confidence": 0.879345,
      "end": 2288806,
      "speaker": "D",
      "start": 2285426,
      "text": "Auch die Herausforderung der Datenanalyse gewesen von dem Research Team."
    },
    {
      "confidence": 0.8900661,
      "end": 2295686,
      "speaker": "B",
      "start": 2288878,
      "text": "Und wenn die Accounts gelöscht werden, reduzieren sich natürlich auch wieder die Stars, weil es gibt den Account ja nicht mehr, der den Star vergibt und du riskierst."
    },
    {
      "confidence": 0.9245092,
      "end": 2339394,
      "speaker": "C",
      "start": 2295718,
      "text": "Natürlich deine Reputation, wenn das in irgendeiner Form rauskommt oder sichtbar wird. Und sie haben eben auch festgestellt, dass grundsätzlich die Accounts auf lange Sicht dann nicht mehr den Zuwachs haben. Also du hast am Anfang einen kurzen Peak, aber im Vergleich zu einem qualitativen Repository, was organisch wächst, ist es natürlich jetzt was ganz was anderes und ist natürlich auch klar, weil was organisch wächst, hat wahrscheinlich einfach einen guten Inhalt. Also das ist natürlich auch gebiased und der gute Inhalt wird dann wahrscheinlich mehr gestartet, als wenn ich nur vertraue auf diesen Effekt, um das am Anfang zu pushen. Also die Forscher innen empfehlens auf jeden Fall nicht zu machen, weil kein messbarer Effekt, wenn man es auf mehr als ein paar Monate testet, zu erkennen ist."
    },
    {
      "confidence": 0.92531013,
      "end": 2394742,
      "speaker": "B",
      "start": 2339562,
      "text": "Ich hoffe, die tun das jetzt nicht nur wegen dem Growth Hacking Effekt, das nicht zu empfehlen, aber nun gut. Aber was das Paper auch explizit sagt, okay, aus Sicherheitsperspektive können die Researcher bestätigen, dass ein Anstieg an bösartigen Aktivitäten im Bereich Software Supply Chain, Cryptocurrency Scam und Co. Festgestellt wurde. Denn was auch so NPM Pakete, die dann deine Kryptowährung von deinem lokalen Rechner stehlen und so weiter, das haben die auch alles in Crypto Scam gepackt, was vielleicht dann ist das Software Supply Chain, ich weiß es nicht, aber ist auf jeden Fall eine harte Nummer, wenn du auf einmal deine Bitcoin verlierst. Was ich aber auch schön fand an diesem Paper ist, dass die noch mal so eine Kategorie Diskussion hatten und da haben sie noch mal ein paar nette Sachen erwähnt, wie zum Beispiel haben die die Research Ergebnisse auch an GitHub gemeldet und GitHub hat diverse Überprüfungen durchgeführt und."
    },
    {
      "confidence": 0.90617,
      "end": 2398070,
      "speaker": "D",
      "start": 2394766,
      "text": "Dann auch auf Basis der gemeldeten Ergebnisse auch Accounts gelöscht."
    },
    {
      "confidence": 0.8831086,
      "end": 2405168,
      "speaker": "C",
      "start": 2398150,
      "text": "Das hätte mich ja am meisten interessiert, eine Public Liste von Accounts, die die solche Stars vergeben. Das wäre mal gut gewesen."
    },
    {
      "confidence": 0.8797192,
      "end": 2439204,
      "speaker": "B",
      "start": 2405264,
      "text": "Dann weiterhin haben die Researcher mit einer Sicherheitsfirma gearbeitet, mit Socket de und diese Socket de Leute haben anscheinend eine Security Software, die auch Repositories überprüft und die haben dann eine, ich sag mal, leichtgewichtigere Version von diesem Starscout dort implementiert und somit hat die Security Software jetzt auch dieses Signal, oh, hat dieses Repository Fake stars bekommen, mit reinkommen. Das finde ich eigentlich sehr schön. Was ich ein bisschen schade finde, ist."
    },
    {
      "confidence": 0.9025647,
      "end": 2444308,
      "speaker": "D",
      "start": 2439292,
      "text": "Warum das dann in so einer proprietären Security Software implementiert wird und dann warum gerade Socket Dev."
    },
    {
      "confidence": 0.91881907,
      "end": 2453476,
      "speaker": "B",
      "start": 2444364,
      "text": "Das hat mir so ein bisschen gefehlt in dem Paper, also da hat mir die Transparenz einfach gefehlt. Aber hey, ich finde erstmal cool, dass das Signal dann erstmal da implementiert wurde."
    },
    {
      "confidence": 0.94856566,
      "end": 2460352,
      "speaker": "C",
      "start": 2453548,
      "text": "Also wenn ich das richtig verstanden habe, haben die schon mitgewirkt beim Paper. Zumindest eine Person ist in der Liste der Autoren kollaboriert."
    },
    {
      "confidence": 0.97743875,
      "end": 2462560,
      "speaker": "B",
      "start": 2460416,
      "text": "Wurde, ist das offizielle Wort, was genannt wurde."
    },
    {
      "confidence": 0.923495,
      "end": 2464768,
      "speaker": "C",
      "start": 2462680,
      "text": "Genau, gemeinsam Paper erstellt."
    },
    {
      "confidence": 0.89585775,
      "end": 2503944,
      "speaker": "B",
      "start": 2464944,
      "text": "Und im Bereich Diskussion haben die Researcher noch Empfehlungen für Open Source Maintainer und Empfehlungen für Plattform Maintainer. Das finde ich auch ganz schön, und zwar Empfehlung für Open Source Maintainer eigentlich, dass die Anzahl der Stars ein unzuverlässiges Qualitätssignal ist und somit nicht für Entscheidungen verwendet werden sollte und dass es wichtig ist, andere Signale zu bewerten, dass man die Sterne nicht für Growth Hacking nutzen sollte bzw. Es einem nicht hilft, wie wir gerade gesprochen haben. Und dass man sich strategisch darauf konzentrieren sollte, tatsächlich andere Adoptionen, tatsächliche Adoption zu fördern. Also dass wirklich jemand das Tool nutzt, anstatt sich auf die Anzahl der Stars irgendwie oberflächlich zu beziehen."
    },
    {
      "confidence": 0.703565,
      "end": 2505500,
      "speaker": "C",
      "start": 2504072,
      "text": "Surprise, surprise."
    },
    {
      "confidence": 0.9081184,
      "end": 2531298,
      "speaker": "B",
      "start": 2506080,
      "text": "Für die Plattform Maintainer wünschen die Researcher sich natürlich auch, dass GitHub könnte da ein bisschen mehr machen, ein bisschen besseres Popularitätssignal profitieren und vielleicht so ein bisschen die Connection herstellen, dass gefälschte Stars auch in einem engeren Zusammenhang mit bösartigen Aktivitäten stehen können. Also auch das, was der Wolfgang, ich glaube, initial gesagt hatte, dass die Plattformen da ein bisschen mehr machen."
    },
    {
      "confidence": 0.91648626,
      "end": 2560424,
      "speaker": "C",
      "start": 2531394,
      "text": "Und jetzt hat der Andi schon erwähnt, die Empfehlung an die Open Source Maintainer war, die Sterneanzahl nicht als Qualitätssignal zu werten. Und jetzt haben wir uns gedacht, wir fragen auch noch ein paar andere Leute, wie die denn so die GitHub stars sehen und ob diese Leute Stars als Qualitätsmerkmal sehen. Wer die letzte Episode gehört hat zu Meetups, der kennt schon viele von diesen Personen, weil wir sind zu zwei Meetups gegangen, ein Meetup in Österreich und eines in Deutschland und haben Leute nach ihrer Meinung gefragt."
    },
    {
      "confidence": 0.95317,
      "end": 2561736,
      "speaker": "D",
      "start": 2560472,
      "text": "Die erste Frage, die wir den Leuten."
    },
    {
      "confidence": 0.90897065,
      "end": 2570630,
      "speaker": "B",
      "start": 2561768,
      "text": "Gestellt haben, um auch mal so ein bisschen Reality Check zu dem Paper jetzt hier zu machen, welche Bedeutung haben denn GitHub stars für dich persönlich? Hören wir mal rein."
    },
    {
      "confidence": 0.83903,
      "end": 2572354,
      "speaker": "C",
      "start": 2571610,
      "text": "Nichts."
    },
    {
      "confidence": 0.923957,
      "end": 2612390,
      "speaker": "E",
      "start": 2572402,
      "text": "Also ich finde es wirklich total Müll. Das ist genauso wie Instagram Abo Zahlen. Das ist einfach nur irgendwie, einige definieren sich darüber. Das finde ich recht traurig. Open Source sollte dazu da sein, um Mehrwert zu stiften. Und wenn ein Projekt mit fünf Stars mein Problem löst, dann kann ich das auch nutzen. Das heißt nicht unbedingt, dass das Projekt mit zwei tausend Stars besser ist. Es ist ein Indikator dafür, dass es mehr Leute nutzen, aber es ist nicht automatisch besser. Und dementsprechend messe ich dem jetzt nicht den Riesenwert bei. Es ist für mich nur ein Indikator, wie viele Leute es nutzen. Aber das ist nicht mein Hauptkriterium für."
    },
    {
      "confidence": 0.9031419,
      "end": 2647380,
      "speaker": "F",
      "start": 2612430,
      "text": "Open Source Software tatsächlich. Also ich hatte das in der Vorbesprechung auch ganz kurz schon angedeutet, haben für mich GitHub stars fast gar keine Aussagekraft. Also es interessiert mich nicht und ich gucke da nicht drauf, irgendwie den Auftrag hätte von meinem Team, von irgendeinem Kunden oder so, ein bestimmtes Framework, eine Open Source Lösung zu evaluieren, dann würde ich vielleicht auch auf die GitHub Stars schauen und dann eben sagen, so hier, guck mal da, das scheint irgendwie ein bisschen mehr Anklang zu finden als das andere. Aber am Ende zählen für mich andere Dinge als die GitHub stars."
    },
    {
      "confidence": 0.9205352,
      "end": 2655980,
      "speaker": "G",
      "start": 2648040,
      "text": "Wenn da welche sind, weiß ich, dass es bekannt ist. Wenn es bekannt ist, weiß ich, dass ich es mir zumindest mal angeschaut haben soll."
    },
    {
      "confidence": 0.95591,
      "end": 2662080,
      "speaker": "H",
      "start": 2657000,
      "text": "Für mich persönlich haben die keinerlei Bedeutung. Ich bin JavaScript Entwickler und für mich."
    },
    {
      "confidence": 0.97582144,
      "end": 2663920,
      "speaker": "I",
      "start": 2662120,
      "text": "Hat dann mehr die Weekly Downloads auf."
    },
    {
      "confidence": 0.854334,
      "end": 2666020,
      "speaker": "H",
      "start": 2663960,
      "text": "Npm oder so eine Bedeutung."
    },
    {
      "confidence": 0.8926962,
      "end": 2680956,
      "speaker": "J",
      "start": 2667160,
      "text": "Für mich persönlich, wenn ich eine Library suche, gucke ich natürlich auf die GitHubstar, natürlich auch irgendwie auf die Activities. Also ist schon ein Auswahlkriterium für Projekte, die gut sind oder halt zumindest aktiv."
    },
    {
      "confidence": 0.9214943,
      "end": 2684588,
      "speaker": "B",
      "start": 2680988,
      "text": "Gepflegt werden, eine große Userbase haben, gar."
    },
    {
      "confidence": 0.85696,
      "end": 2689880,
      "speaker": "K",
      "start": 2684644,
      "text": "Keine irgendwelche Obstpuren, Gummipunkte, null Relevanz für mich."
    },
    {
      "confidence": 0.94300103,
      "end": 2709022,
      "speaker": "C",
      "start": 2690820,
      "text": "Ich glaube, wir haben die falsche Frage gestellt. Wir hätten ja die Frage stellen, ist GitHub für dich ein Social Network? Weil die Leute kennen zwar GitHub stars alle, aber ich glaube, sie sind sich auch nicht dessen bewusst, was das eigentlich ist. Oder es interessiert einfach niemanden so wie mich. Also Andi glaubt, es gibt auch andere Leute, die so denken, wie wir jetzt gehört haben."
    },
    {
      "confidence": 0.87776333,
      "end": 2719774,
      "speaker": "B",
      "start": 2709046,
      "text": "Ich finde es ja schon faszinierend, denn das Paper sagt, GitHub Stars haben eine hohe Relevanz für Venture Capitalists. Sogar wenn man den Reality Check auf einem Software Engineering meetup mal baut, dann."
    },
    {
      "confidence": 0.91892713,
      "end": 2721422,
      "speaker": "D",
      "start": 2719782,
      "text": "Kriege ich da erstmal einen anderen Eindruck."
    },
    {
      "confidence": 0.9671832,
      "end": 2735878,
      "speaker": "C",
      "start": 2721486,
      "text": "Wobei, man muss ja schon sagen, wir haben ja dann noch eine crosscheck Frage fast gestellt, würde ich mal sagen, weil die zweite Frage, die wir gestellt haben, beeinflusst die Anzahl der GitHub stars eines Projektes deine Entscheidung, es zu nutzen? Also eigentlich eine sehr ähnliche Frage."
    },
    {
      "confidence": 0.9500269,
      "end": 2739878,
      "speaker": "B",
      "start": 2735974,
      "text": "Hol doch mal alle ab, was ist eine Cross Check Frage als Researcher?"
    },
    {
      "confidence": 0.9136241,
      "end": 2755810,
      "speaker": "C",
      "start": 2739974,
      "text": "Es ist eigentlich die gleiche Frage, aber von einem anderen Winkel auf ein konkretes Problem gestellt. Und interessanterweise haben wir da doch dann andere Antworten bekommen. Also auch von Leuten, die zuerst gesagt haben, ist eigentlich eh unwichtig. Bei dieser Frage gab es dann andere Antworten, aber hauchen wir mal rein."
    },
    {
      "confidence": 0.96153915,
      "end": 2775090,
      "speaker": "H",
      "start": 2756470,
      "text": "Entgegen meiner letzten Antwort wahrscheinlich auch eher nicht, weil die Projekte, die ich so mache, da muss es erstmal funktionieren. Und das ist so der hauptsächliche Punkt. Ich würde es mal antesten, ob es jetzt viele Stars hat oder wenige Stars, ist für mich eher zweitrangig."
    },
    {
      "confidence": 0.9282678,
      "end": 2794460,
      "speaker": "G",
      "start": 2775910,
      "text": "Ne, tatsächlich nicht. Zum einen wegen der Zeit, die das Projekt vielleicht schon auf dem Markt ist und die Evaluierung von verschiedenen Projekten gegeneinander ist eher das, was mich dann für eins entscheiden lässt oder eben nicht. Natürlich gibt es eine gewisse Indikation, aber die Entscheidung wird nicht beeinflusst davon."
    },
    {
      "confidence": 0.92277163,
      "end": 2831260,
      "speaker": "L",
      "start": 2795200,
      "text": "Ich glaube, das habe ich tatsächlich schon mal gemacht. Wenn man sich entscheiden muss zwischen zwei verschiedenen Sachen, die im Prinzip das gleiche tun oder so, braucht man ja irgendeinen Form dann doch Referenzen. Da kann das dann doch schon mal relevant werden. Ich würde sagen, es beeinflusst das schon definitiv. Man sieht, dass mehr Leute sich das Ganze angeschaut haben. Es gibt vermutlich eine größere Community. Also bevor wir jetzt entscheiden würden, ein Produkt, also eine Open Source Software einzusetzen, würde ich schon gucken, wie viele Contributor gibt es vielleicht, wie viele Stars hat das, wie aktiv ist das Projekt? Also es ist so ein Einfluss schon zusätzlich noch."
    },
    {
      "confidence": 0.9463879,
      "end": 2869950,
      "speaker": "M",
      "start": 2832120,
      "text": "Also die Anzahl der GitHub Stars entscheidet schon darüber, ob ich es nutze oder nicht. Insbesondere wenn ich die Wahl hab zwischen verschiedenen Bibliotheken, weil natürlich eine starke Community bei einem wichtigen Paket, was ich irgendwo verwende, wichtig ist, weil das Projekt ja länger da sein sollte und es muss in irgendeiner Form betreut sein. Und da ist es schon wichtig, dass die Dependencies gepflegt werden. Was ich häufiger mache bei Projekten, die weniger oder wenig Stars haben oder null gar nicht, dass ich mir den Code angucke und dann eher den Code tatsächlich dupliziere und gar nicht die Dependency mit ins Projekt reinhole."
    },
    {
      "confidence": 0.91855645,
      "end": 2874106,
      "speaker": "C",
      "start": 2870930,
      "text": "So Andy, jetzt möchte ich aber schon noch deine Antwort wissen auf die Frage."
    },
    {
      "confidence": 0.92386305,
      "end": 2908402,
      "speaker": "B",
      "start": 2874218,
      "text": "Ich würde sagen, es ist ein Signal, was ich mit einfließen lasse. Ja, in der Tat. Und ich gehe sogar mit manchen Antworten mit, oh, wenn etwas Stars hat und ich habe davon noch nie gehört, dann schaue ich da schon mal drüber. Das ist schon, das ist schon korrekt. Und ich finde aber den Ansatz vom Tim ganz cool, den er genannt hat. Ab und zu holt man sich die Dependency gar nicht ins Projekt, sondern sofern es nämlich erlaubt ist, anhand der Lizenz, kopiert man da lieber den Source code raus, den man braucht. Das finde ich halt eher so ganz charmant. Ist auch so ein bisschen ghosty, muss man natürlich sagen."
    },
    {
      "confidence": 0.92370355,
      "end": 2956236,
      "speaker": "C",
      "start": 2908466,
      "text": "Ich würde jetzt gern sagen, ich schaue immer ganz tief in die Libraries hinein, so wie es auch manche gesagt haben, Qualität und so weiter ist wichtig, aber ich glaube, das, was da Moritz auch als erstes gesagt hat und andere auch, wenn ich zwei Libraries, eine links und eine rechts habe, dann schaue ich fast als erstes mal auf die Stars und als zweites üblicherweise, wann die letzte Contribution war und dann fliegt mal eine Seite meistens schon raus. Also gerade so als Knock out Kriterium, niedrige Stars versus viele Stars, vor allem wenn da ein großer Gap dazwischen ist, dann ist für mich das absolute Knockout Kriterium. Und im Vergleich von zwei Libraries gewinnt dann eine und dann schaut man vielleicht noch paar andere Sachen an oder wenn mehr zur Verfügung stehen. Aber Stars ist schon meiner Meinung nach da ein sehr wichtiges Signal, würde ich mal sagen, vor allem, wenn es um den Vergleich geht."
    },
    {
      "confidence": 0.91308457,
      "end": 2976018,
      "speaker": "B",
      "start": 2956268,
      "text": "Aber da hat die crosscheck Frage ja ein hundert Prozent ihren Sinn erfüllt, denn in der ersten Frage, was haben GitHub stars für eine Bedeutung, war, ich sag mal so, der Grundtenor eigentlich gar keine. Das Wort obskure Gummipunkte ist geflogen. Also natürlich waren es vielleicht nicht eins zu eins alle Personen, aber man hat so einen Grundtenor gefunden."
    },
    {
      "confidence": 0.9255007,
      "end": 2991138,
      "speaker": "C",
      "start": 2976114,
      "text": "Also es war sogar bei mir, wie ich diese Fragen gestellt habe bei den Meetups, habe ich mir oft gedacht, ich brauche gar nicht weiter fragen, weil alles so am Anfang irgendwie nein, null, interessiert mich nicht, keine Ahnung. Und dann hat sich das aber dann doch gewandelt. Also es war schon auch vor Ort merkbar und interessant."
    },
    {
      "confidence": 0.8998825,
      "end": 3005450,
      "speaker": "B",
      "start": 2991234,
      "text": "Die dritte Frage, die wir aber gestellt haben, und das denke ich, ist keine crosscheck Frage mehr, denn denn es zielt auf einen anderen Bereich ab. Denkst du, dass GitHub stars ein guter Indikator für die Qualität eines Projektes sind? Das haben wir gefragt, hören wir mal rein."
    },
    {
      "confidence": 0.94045407,
      "end": 3030420,
      "speaker": "N",
      "start": 3006270,
      "text": "Dadurch, dass sie viele Sterne haben, schauen auch viele Leute drauf und dann gibt es die Chance, dass der Code auch verbessert wird von Leuten in Bereichen, wo der Hauptentwickler vielleicht keine Ahnung von hat, also Packaging, Dockerfile, whatever. Aber es erhöht nur die Chance, dass es besser ist, nicht wirklich die tatsächliche Qualität."
    },
    {
      "confidence": 0.9118171,
      "end": 3075266,
      "speaker": "F",
      "start": 3031880,
      "text": "Also ich denke, dass das korreliert. Also gutes Projekt, viele Stars. Es muss nicht immer so sein. Also es gibt ja immer irgendwelche, was weiß ich, Ausrutscher, gehypte Sachen, die vielleicht mehr so eintagsfliegen Charakter haben. Also ein Beispiel, das mir jetzt einfallen würde, das jetzt nicht Eintagsliege war, aber das eben jetzt mittlerweile wieder nicht mehr en vogue ist es Gatsby JS. Also es war ja wirklich super hyped, die Firma hat auch wahnsinnig viele bekannte Leute eingestellt und viel Pohai gemacht, aber Gatsby ist einfach töter als tot, würde ich sagen. Und ich vermute, dass die, dass die immer noch viele GitHub Stars haben in ihrem Repo, aber das Repo ist einfach tot Qualität."
    },
    {
      "confidence": 0.87640965,
      "end": 3113050,
      "speaker": "O",
      "start": 3075458,
      "text": "Also Advocatus Diaboli GitHub Stars sind erstmal nur ein Indikator für gutes Marketing, also in irgendeiner Form Developer Marketing. Das korreliert, ich gebe dir recht, aber gibt es WordPress auf GitHub? Wenn WordPress auf GitHub, ich bin mir nicht sicher, aber WordPress würde sehr viele GitHub stars haben, nehme ich an. Aber ist ja ein Projekt, was notorisch dafür bekannt ist, jetzt nur mäßige Qualität zu haben, so sagt man. Von daher, auf die einfache Formel würde ich es, glaube ich, nicht runterbrechen wollen, obwohl es natürlich korreliert."
    },
    {
      "confidence": 0.9317048,
      "end": 3148820,
      "speaker": "H",
      "start": 3114030,
      "text": "Ich würde da ein Beispiel zurande ziehen. Ich hatte letztes Jahr während meines Masters eine Begegnung mit einem doch relativ bekannten Gitterpaket mit sehr, sehr vielen Stars. Und mir ist beim Benutzen dieses Pakets, ist mir aufgefallen, die printen zum Teil API Keys in Klartext in deine Konsole rein, wenn du was falsch eingibst. Und der Vorteil an einem sehr bekannten Projekt ist halt, dass Fehler auch sehr schnell behoben werden können. Das wäre für mich so mein Take away. Aber im Endeffekt, ob da jetzt Qualität besser ist, wenn das mehr Stars hat, würde ich so nicht sagen."
    },
    {
      "confidence": 0.9083314,
      "end": 3176060,
      "speaker": "L",
      "start": 3149640,
      "text": "Das würde ich sagen, nicht unbedingt, weil manchmal vermutlich Sachen, die einfach funktionieren und hingeklatscht sind, aber vielleicht ein interessantes Produkt sind, Richtung AI oder so, dass die dann durch einen Beitrag auf Hacker News sehr viele Sterne bekommen. Manche Leute nutzen die Sterne auch, um Sachen zu markieren und sich später nochmal anzugucken. Ich würde nicht sagen, dass das bedeutet, dass die Codequalität dann besonders hoch ist, nur dass das Produkt sozusagen in Anführungsstrichen gerade populär ist. Vielleicht."
    },
    {
      "confidence": 0.92472106,
      "end": 3205748,
      "speaker": "M",
      "start": 3177040,
      "text": "Ich glaube, dass die Anzahl der GitHub Stars ein Indikator dafür sind kann. Ich glaube aber eher, dass es ein Indikator dafür ist, wie vieles verwendet wird. Und es gibt viele, gerade im JavaScript, TypeScript, Ökosystemprojekte im Bereich von Stars, die in Wirklichkeit keiner pflegt, weil entsprechende Firma dahinter sitzt oder so dieses Projekt mal ins Leben gerufen hat. Ich glaube, dass man da trotzdem sehr."
    },
    {
      "confidence": 0.94313586,
      "end": 3212094,
      "speaker": "C",
      "start": 3205884,
      "text": "Aufpassen muss, immer dieses WordPress bashing. Bin ja auch kein WordPress Fan."
    },
    {
      "confidence": 0.90774935,
      "end": 3220798,
      "speaker": "B",
      "start": 3212222,
      "text": "Als ich das gehört habe, kam mir auch wieder Code is Poetry bzw. Code ist Poesie in den Sinn. Das ist ja so deren Claim, den die mal früher hatten."
    },
    {
      "confidence": 0.9331692,
      "end": 3234148,
      "speaker": "C",
      "start": 3220974,
      "text": "Das ist so ähnlich, wie dass man immer gesagt hat, Mac ist so sicher. Und dabei ist es halt nur sicher, weil vor allem früher wenige Leute Viren dafür geschrieben haben im Vergleich zu Microsoft. Aber gibt es ja auch Research dazu, aber das war eigentlich gar nicht das Thema."
    },
    {
      "confidence": 0.9139697,
      "end": 3256280,
      "speaker": "B",
      "start": 3234294,
      "text": "Aber ja, ich sag mal, geteilte Meinung. Auf der einen Seite wird gesagt, okay, wenn viele Stars, wenn es populär ist, schauen mehr Leute drauf und es gibt eine höhere Chance, dass Sachen schneller gefixt werden. Und Qualität scheint dann ein fix hier zu sein. Auf der anderen Seite wurde natürlich auch ein paar Gegenbeispiele genannt. Gatsby, JS, WordPress oder diese Software für diese Masterarbeit."
    },
    {
      "confidence": 0.90693784,
      "end": 3294666,
      "speaker": "C",
      "start": 3256360,
      "text": "Wobei das ja mit Gatsby auch jetzt nicht unbedingt heißen muss, dass es eine schlechte Qualität hat. Es ist halt tot. Wobei tot ist auch relativ bei Gatsby, muss man sagen. Aber das heißt nicht, dass es eine schlechte Qualität hat. Vielleicht ist es weniger gewartet und war mal früher populärer, aber das eine hatte keine direkte Auswirkung, würde ich mal sagen. Aber wie einige gesagt haben, Korrelation ist natürlich da, bzw. Die Chance für die Korrelation, und das würde ich auch so unterschreiben als die Chance ist natürlich höher, dass wenn ein populäres Repository viel Anklang findet, dann wird es wahrscheinlich auch einfach durch mehrere Augen gegangen sein. Hoffentlich nicht immer, aber die Chance ist da."
    },
    {
      "confidence": 0.92608726,
      "end": 3298682,
      "speaker": "B",
      "start": 3294738,
      "text": "Wie heißt es so schön? Korrelation ist nicht gleich Kausalität, oder?"
    },
    {
      "confidence": 0.94519,
      "end": 3299706,
      "speaker": "C",
      "start": 3298866,
      "text": "Genau."
    },
    {
      "confidence": 0.8808882,
      "end": 3306442,
      "speaker": "B",
      "start": 3299898,
      "text": "Muss ich jetzt aber auch mal einen Schnauenspruch raushauen. Nun gut, aber alle guten Dinge sind vier."
    },
    {
      "confidence": 0.9257934,
      "end": 3323450,
      "speaker": "C",
      "start": 3306546,
      "text": "Und da wollten wir mal überprüfen, ob die Leute, die sich jetzt da alle beschweren bezüglich Qualität und so weiter, wie die denn überhaupt Sterne vergeben und ob es da vielleicht dann auch wieder anderes Vorgehen geht. Und da haben wir gefragt, wie oft gibst du selbst GitHub stars und welche Kriterien sind für dich ausschlaggebend?"
    },
    {
      "confidence": 0.86856973,
      "end": 3348900,
      "speaker": "E",
      "start": 3324190,
      "text": "Ich bin da sehr gefühlsgetrieben. Also ich muss zugeben, einige machen das bestimmt objektiv an irgendwelchen Kriterien. Ich schaue mein Projekt an, lese mir das Readmefi durch und denke mir, boah, geile Nummer. Und dann kriegen die einen Star von mehr. Oder ich setze irgendwas ein und ja, das passt für mich, löst ein Problem von mir, dann kriegt's einen Star und ich drücke dann noch auf Watch, damit ich alle Updates mitbekomme."
    },
    {
      "confidence": 0.9328055,
      "end": 3352208,
      "speaker": "H",
      "start": 3349640,
      "text": "Ich muss zugeben, ich habe noch nie einen GitHub Star vergeben."
    },
    {
      "confidence": 0.939025,
      "end": 3353264,
      "speaker": "B",
      "start": 3352304,
      "text": "Warum nicht?"
    },
    {
      "confidence": 0.9109309,
      "end": 3363100,
      "speaker": "H",
      "start": 3353432,
      "text": "Ich hatte keine Intention dahinter. Wenn mich ein Paket interessiert, dann habe ich es mir in der Bookmark abgespeichert, aber bisher noch nicht dazu gekommen, dass ich mir gedacht oh, das braucht jetzt einen Star."
    },
    {
      "confidence": 0.9325241,
      "end": 3380180,
      "speaker": "J",
      "start": 3364360,
      "text": "Ganz selten, ehrlicherweise. Ich habe letztens eine Reihe GitHub stars vergeben, weil mich ein Freund darum gebeten hat, seine Projekte zu pushen. Genau. Aber ab und zu mache ich das schon. Manchmal auch, um sie mir einfach zu merken."
    },
    {
      "confidence": 0.86910784,
      "end": 3387808,
      "speaker": "K",
      "start": 3381480,
      "text": "Meistens, wenn ich die Person persönlich kenne und weiß, was so dahinter steckt, hinter."
    },
    {
      "confidence": 0.91852164,
      "end": 3406824,
      "speaker": "M",
      "start": 3387824,
      "text": "Der Arbeit, ist es so, dass ich die GitHub stars auch gerne als Bookmark benutze, wenn ich irgendwas interessant finde. Also wenn ich ich mich mit der Domäne mehr befassen möchte und einfach in ein paar Monaten oder paar Wochen da noch mal drauf gucken möchte, dann setze ich gerne mal einen Star habe ich."
    },
    {
      "confidence": 0.94585145,
      "end": 3409340,
      "speaker": "B",
      "start": 3406832,
      "text": "Schon hauptsächlich, damit ich es leichter wiederfind."
    },
    {
      "confidence": 0.8300746,
      "end": 3429070,
      "speaker": "I",
      "start": 3410080,
      "text": "Also ich glaube, ich habe so was wie ein Tausend vergeben, sieben hundert vergeben, sowas gibt darin jetzt keine konkreten. Also wenn ich ein Projekt spannend finde, wenn ich es selber verwende und halt irgendwie sehr zufrieden damit bin ich. Bei Xeni gibt es ja die Möglichkeit, das in so unterschiedliche Kategorien einzuteilen. Das habe ich bis jetzt noch nicht angefangen. Bei mir ist alles so eine unsortierte Sternenlicht."
    },
    {
      "confidence": 0.8884582,
      "end": 3434670,
      "speaker": "C",
      "start": 3429810,
      "text": "War da jetzt irgendwo Qualität dabei als Grund? Einmal so halb."
    },
    {
      "confidence": 0.91296935,
      "end": 3463966,
      "speaker": "B",
      "start": 3435410,
      "text": "Es hat mich stark zum grinsen gebracht, als ich mir die Aufnahmen angehört habe, aber ne OK, Qualität ist, also ich finde es schön. Auf der einen Seite wird es ein bisschen danach bewertet, OK, auf der anderen Seite ne, ich verteil Star meist so nach dem Motto Bookmarks oder falls mich ein Freund fragt, aber hey, mache ich doch genauso. Also ich verteile Stars an Sachen, die ich mir später mal angucken möchte oder die ich cool finde, innovativ finde oder wo ich einfach sage Kudos, Hut ab."
    },
    {
      "confidence": 0.9158456,
      "end": 3474238,
      "speaker": "C",
      "start": 3464038,
      "text": "Geile Idee, ich hab wieder was gelernt. Es gibt Kategorien bei Stars habe ich auch noch nie gehört oder Listen oder sowas. Wie gesagt, ich muss mich glaube ich mehr mit GitHub beschäftigen, aber ich finde."
    },
    {
      "confidence": 0.93447816,
      "end": 3479290,
      "speaker": "B",
      "start": 3474254,
      "text": "Das schön, dass du wenigstens mit dem Learning rausgehst, dass GitHub ein Social Network ist und dass man da Leuten folgen kann."
    },
    {
      "confidence": 0.88612926,
      "end": 3494694,
      "speaker": "C",
      "start": 3479590,
      "text": "Dem stehen wir noch nicht zu ganz zu deinem Social Network, aber okay, wir haben jetzt im Gegensatz zur letzten Episode natürlich da keine Namen erwähnt. Wir sind ein bisschen schneller durchgegangen. Wen es interessiert, wer die Personen hinter den ganzen Kommentaren waren, schaut doch mal in die Show Notes, dort steht das alles."
    },
    {
      "confidence": 0.9468118,
      "end": 3502214,
      "speaker": "B",
      "start": 3494742,
      "text": "Jetzt haben wir uns das Paper aber reingezogen und den Reality Check. Würdest du sagen, dass das Paper mit der Realität übereinstimmt?"
    },
    {
      "confidence": 0.8730005,
      "end": 3507946,
      "speaker": "C",
      "start": 3502342,
      "text": "Ja, ich würde zumindest mal sagen, die Empfehlung, das nicht als Qualitätskriterium zu sehen, die trifft auf jeden Fall."
    },
    {
      "confidence": 0.9340029,
      "end": 3518482,
      "speaker": "B",
      "start": 3508078,
      "text": "Wie würdest du denn das Paper generell bewerten? Weil bei den Papers we love ist ja immer die lieben wir dieses Paper? Würdest du sagen, das ist ein qualitativ hochwertiges Paper?"
    },
    {
      "confidence": 0.92615104,
      "end": 3565006,
      "speaker": "C",
      "start": 3518626,
      "text": "Ich habe es eigentlich sehr rund gefunden und war glaube ich eine solide Studie zu dem ganzen. Was mich bisschen gewundert hat, dass es nirgends peer reviewed wurde und irgendwie veröffentlicht wurde, obwohl andere Papers von der Autorin das schon wurden. Es war für uns ein Grund, das Thema mal zu beleuchten, was glaube ich auch schon gut war, sonst hätten wir das nie gemacht. Und ich finde es ganz cool, weil es ein gewisses Licht auf GitHub geworfen hat und für mich zumindest GitHub davor irgendwo so in der Nische und nicht als Social Network und Wichtigkeit, dass man da auch faken kann und so weiter, bei mir irgendwo am Bildschirm war. Insofern finde ich das eine gute Idee, das zu analysieren. Und soweit ich das beurteilen kann von außen, hat es auch durchaus fundierte Herangehensweise."
    },
    {
      "confidence": 0.93679,
      "end": 3572370,
      "speaker": "B",
      "start": 3565118,
      "text": "Als nicht Wissenschaftler muss ich sagen, ich fand es sehr einfach zu lesen, ich fand es sehr praxisnah. Ich hatte wirklich Spaß, es zu lesen."
    },
    {
      "confidence": 0.94843143,
      "end": 3577250,
      "speaker": "C",
      "start": 3572790,
      "text": "Darum wurde es nirgends veröffentlicht. Es ist zu leicht zu lesen und zu praxisnah."
    },
    {
      "confidence": 0.92154896,
      "end": 3608134,
      "speaker": "B",
      "start": 3577750,
      "text": "Ich hoffe, das ist nicht die Wahrheit, aber ich hatte wirklich Spaß, das Paper zu lesen. Ich bin nicht eingeschlafen. Es war unterhaltsam, aber vielleicht auch, weil ich mich sehr, sehr mit diesem Thema mit Stars und GitHub und Bipatiten graphen. Ja gut, da jetzt nicht, da kann ich mich jetzt nicht mit connecten, aber dem Thema bin ich sehr nah und deswegen vielleicht hatte ich auch einfach ein erhöhtes Interesse daran. Also ich kann es allen Leuten nur empfehlen, das Paper mal zu lesen. Link natürlich in den Shownotes. Die Software habe ich mir jetzt nicht im Detail angesehen, sondern habe mich nur."
    },
    {
      "confidence": 0.87919,
      "end": 3609046,
      "speaker": "D",
      "start": 3608142,
      "text": "Auf das Paper gestützt."
    },
    {
      "confidence": 0.8756643,
      "end": 3616182,
      "speaker": "B",
      "start": 3609078,
      "text": "Deswegen kann nichts zur Qualität der Software sagen, obwohl die Software open source ist."
    },
    {
      "confidence": 0.8297314,
      "end": 3617690,
      "speaker": "C",
      "start": 3616206,
      "text": "Wenn ich das richtig im Kopf habe."
    },
    {
      "confidence": 0.94460887,
      "end": 3624002,
      "speaker": "B",
      "start": 3617830,
      "text": "Richtig. Und neun und achtzig stars hat. Also sie wäre auch in der Star Analyse von sich selbst drin. Das war es von uns mit einer."
    },
    {
      "confidence": 0.95209557,
      "end": 3627298,
      "speaker": "C",
      "start": 3624026,
      "text": "Neuen Papers we love mit Stimmen aus der Community."
    },
    {
      "confidence": 0.9682457,
      "end": 3634706,
      "speaker": "B",
      "start": 3627474,
      "text": "Vielen lieben Dank an alle Stimmen, die wir gehört haben für eure Zeit, dass wir euch aufnehmen durften und veröffentlicht durften."
    },
    {
      "confidence": 0.94056207,
      "end": 3640770,
      "speaker": "C",
      "start": 3634818,
      "text": "Natürlich auch an alle, die wir nicht gehört haben. Wir haben dann natürlich nur ein paar rausgepickt, weil wir haben wesentlich mehr Leute interviewt."
    },
    {
      "confidence": 0.93949115,
      "end": 3646842,
      "speaker": "B",
      "start": 3640850,
      "text": "Das heißt jetzt nicht, dass wenn ihr uns auf Meetups trefft, dass wir dann immer Mikrofon dabei haben. Da müsst ihr jetzt keine Angst haben. Dennoch."
    },
    {
      "confidence": 0.94847476,
      "end": 3652682,
      "speaker": "C",
      "start": 3646906,
      "text": "Wobei wir sollten das immer öfter machen, aber lass uns mal wissen, ob das interessant ist, so andere Stimmen zu hören."
    },
    {
      "confidence": 0.94403374,
      "end": 3676596,
      "speaker": "B",
      "start": 3652746,
      "text": "Naja, also im Edit Modus muss man schon sagen, das ist schon hart viel Arbeit, solche Stimmen in diese Podcast Episoden mit reinzubekommen. Es wird ja jetzt nicht alles nur auf den. Da gehört schon eine ganze Menge dazu. Setup aufbauen, Aufnahmen sichten, wie integriert man diese? Also wenn man das mal macht, habe ich höchsten Respekt vor diesen TV und Radio Features immer."
    },
    {
      "confidence": 0.89570576,
      "end": 3690004,
      "speaker": "C",
      "start": 3676668,
      "text": "Ja gut, da gibt es auch mehr Leute dahinter. Aber habe ich das jetzt so durchklingen gehört dir was? Zu viel Aufwand. Also ich kann es verstehen, weil ich glaube, alleine das Sortieren dieser dummen Audio Files waren schon ein paar Stunden zu viel Aufwand."
    },
    {
      "confidence": 0.99872,
      "end": 3690452,
      "speaker": "A",
      "start": 3690052,
      "text": "Nicht?"
    },
    {
      "confidence": 0.92278093,
      "end": 3717512,
      "speaker": "B",
      "start": 3690556,
      "text": "Ich fand es spaßig, mal als Experiment. Ob ich das Experiment noch mal wiederhole, weiß ich jetzt noch nicht. Schauen wir mal. Naja, wir hatten Spaß. Das war's von uns. Lasst uns mal wissen, falls ihr das Paper lesen, wie es euch gefallen hat. Gerne über Mastodon, LinkedIn oder in die Discord Community. Ansonsten lasst uns auch mal Star auf Spotify oder Apple Podcast da. Da gibt es so viel ich weiß, noch keine Fake Star Analyse. Zumindest habe ich noch kein Paper dazu gefunden."
    },
    {
      "confidence": 0.9711911,
      "end": 3721896,
      "speaker": "C",
      "start": 3717656,
      "text": "Kann man eigentlich unsere GitHub Page liken oder Star?"
    },
    {
      "confidence": 0.873951,
      "end": 3727400,
      "speaker": "B",
      "start": 3722048,
      "text": "Ja, man kann unserer Organisation folgen, GitHub com engineering Kiosk."
    },
    {
      "confidence": 0.76941335,
      "end": 3728540,
      "speaker": "C",
      "start": 3727480,
      "text": "Aber nur folgende."
    },
    {
      "confidence": 0.9885129,
      "end": 3730616,
      "speaker": "B",
      "start": 3728650,
      "text": "Ja, du kannst natürlich auch das Webpage."
    },
    {
      "confidence": 0.970852,
      "end": 3732440,
      "speaker": "D",
      "start": 3730648,
      "text": "Repository Star, das geht auch."
    },
    {
      "confidence": 0.79298836,
      "end": 3734792,
      "speaker": "C",
      "start": 3732560,
      "text": "Organization kann man nicht star schade."
    },
    {
      "confidence": 0.919699,
      "end": 3745912,
      "speaker": "B",
      "start": 3734856,
      "text": "Okay, dann würde ich sagen, verabschieden wir uns und lassen Wolfgang mal weiter GitHub com discovern. Es war uns eine Freude. Wir hören uns nächste Woche wieder. Bis bald und tschüss."
    },
    {
      "confidence": 0.65066,
      "end": 3746120,
      "speaker": "C",
      "start": 3745976,
      "text": "Ciao."
    }
  ],
  "webhook_auth": false
}