{
  "acoustic_model": "assemblyai_default",
  "audio_duration": 4580,
  "audio_url": "https://cloud.inlupus.at/s/85PpdkQJoaiGj2R/download",
  "auto_chapters": false,
  "auto_highlights": false,
  "auto_highlights_result": {},
  "confidence": 0.9603831,
  "content_safety": false,
  "content_safety_labels": {
    "status": "unavailable"
  },
  "custom_topics": false,
  "disfluencies": false,
  "dual_channel": false,
  "entity_detection": true,
  "filter_profanity": false,
  "format_text": false,
  "iab_categories": true,
  "iab_categories_result": {},
  "id": "d5c286f2-e7b6-4f3a-a8e6-c9649936f49d",
  "language_code": "de",
  "language_detection": false,
  "language_model": "assemblyai_default",
  "punctuate": true,
  "redact_pii": false,
  "redact_pii_audio": false,
  "sentiment_analysis": false,
  "speaker_labels": true,
  "speakers_expected": 2,
  "speed_boost": false,
  "status": "completed",
  "summarization": false,
  "throttled": false,
  "utterances": [
    {
      "end": 92730,
      "speaker": "A",
      "start": 3360,
      "text": "Eine neue Woche, eine neue Episode vom Engineering Kiosk Podcast. Heute wird es mal etwas persönlich. Der Wolfgang hat eine laaange Historie von side Projects, von Projekten mit dem Ziel, ein Business aufzubauen und Geld zu verdienen. Und sehr oft hat er womit angefangen? Genau, mit Coden. Irgendwie wurde er mit der Zeit älter und weiser. Nun sagt auf gar keinen Fall Code schreiben. Meine nächste Frage wä was denn genau? Womit soll ich denn starten? In dieser Episode spricht Wolfgang über seine side Projects, wie er an diese herangegangen ist, welche Fehler er gemacht hat und wie er heutzutage neue Projekte startet. Vom Coden als ersten Schritt zu Interviews mit wildfremden Menschen. Eine Episode mit vielen Einblicken. Wie Wolfgang Pepsi Dosen und Süßigkeiten aus einem Schulspind verkauft hat. Wie Wolfgang bei einer Kundenakquise aus einem Geschäft gejagt wurde. Wie er versucht hat, sich den total addressable market seiner Podcast Plattform auszurechnen und dabei deutlich optimistischer war, als es sich nach zwei Jahren herausgestellt hat. Aber es geht auch um die Gefühlslage. Allein oder im Team? Wann hört man auf? Wie schwer ist es eigentlich, sich einzugestehen, dass es einfach nicht geklappt hat? Eine Episode mit vielen tiefen Einblicken und vielen Up and Downs. Wir hoffen, dass ihr ein paar hilfreiche Tipps für eure aktuellen und nächsten side Progress mitnehmen könnt. Los geht's. Viel Spaß. In diesem Podcast gibt es ein Thema, was immer wieder mitschwingt. Mit diesem Thema haben wir diesen Podcast sogar gestartet am dritte und am zehnter Januar."
    },
    {
      "end": 102650,
      "speaker": "B",
      "start": 92730,
      "text": "Zwei tausend zwei und zwanzig hast du jetzt Jänuax gesagt. Ist das die Mischung aus dem Jänner, dem österreichischen, und dem Januar, dem Deutschen? Hast du schon so viel gelernt von mir?"
    },
    {
      "end": 122790,
      "speaker": "A",
      "start": 102650,
      "text": "Leute, mit denen man sich oft umtreibt, haben entweder einen positiven oder negativen Einfluss auf einen selber. Ich habe auch mal gehört, dass Freunde, die sehr lang zusammen sind, sich nach und nach angleichen in Bezug auf den Haarschnitt. Oder dass sogar bei Frauen es sein kann, dass sich der Periodenzyklus angleichen kann. Deswegen weiß ich halt nicht, ob du einen positiven oder negativen Einfluss auf mich."
    },
    {
      "end": 125430,
      "speaker": "B",
      "start": 122790,
      "text": "Ja, genau. Ist auf jeden Fall falsch, würde ich mal sagen."
    },
    {
      "end": 220480,
      "speaker": "A",
      "start": 125430,
      "text": "Naja, wie dem auch sei, Thema Side Projects begleitet uns kontinuierlich hier im Podcast. Auch wir sind sehr umtriebig, was das Thema side Projects angeht. Ich meine, der Podcast ist einer der größten side Projects, die wir je gemacht haben. Und in den vorherigen Episoden haben wir ziemlich viel über side Project gesprochen, was die Themen angeht, neue Technologien auszuprobieren, etwas Neues lernen. Aber was viele vergessen bzw. Was wir oft gar nicht erwähnen, ist, dass ja ein Ziel zumindest für viele von diesen side Project ist, ein Business aufzubauen, etwas Geld nebenbei zu verdienen. Und wir Techniker lassen uns oft davon treiben, geil, neue Load Balance, neue Datenbank und und jetzt packen wir noch grafql drauf, weil das ist ja auch gerade hip. Und dann dieses Ziel, ein bisschen Geld dazu verdienen, lassen wir mal nebenbei oder packen wir mal zur Seite. Der Wolfgang, der ist ja auch sehr umtriebig und der Wolfgang öffnet heute mal sein Herz, erzählt mal von der schwierigen Zeit, weil der Wolfgang hat nämlich eine große Historie. Und zwar sagt man ja so im umgangssprachlich, dass neun von zehn Projektideen scheitern. Und wenn man sich mal Wolfgangs Produkt oder side Project Historie ansieht, dann kommt man ganz genau auf zehn Projekte. Das kann kein Zufall sein. Das entweder hat der Wolfgang jetzt ein erfolgreiches Projekt oder Wolfgang ist der erste Mensch, bei dem zehn von zehn Projekten scheitern. Auf jeden Fall in dieser Episode sprechen wir über all diese Projekte, über Wolfgangs Erfahrungen in Bezug auf das Business auf die Straße bringen und Geld zu verdienen."
    },
    {
      "end": 297440,
      "speaker": "B",
      "start": 280560,
      "text": "Ich bin mir nicht ganz sicher, ob das wirklich nur zehn sind. Also die zehn, die mir so schnell eingefallen sind, sind die, die ich irgendwie tiefer betrieben habe. Es gibt sicher auch noch ganz viele, die so schon an der Domain gescheitert sind oder nach dem domain Kauf eigentlich so gescheitert sind. Also die zähle ich gar nicht mal mit."
    },
    {
      "end": 305150,
      "speaker": "A",
      "start": 297440,
      "text": "Aber Wolfgang, ich erzähle jetzt hier, ich mache jetzt die Crowd, die mache ich jetzt heiß. Du hast das Thema mitgebracht. Was ist der Kern dieser Episode heute?"
    },
    {
      "end": 351500,
      "speaker": "B",
      "start": 305150,
      "text": "Wie du schon richtig gesagt hast, haben wir ja ganz oft über die side Projects gesprochen und da kam ganz oft so immer so ein Beisatz, wenn irgendwas nicht funktioniert, ist ja kein Problem, weil wir lernen ja was dabei und wir können eine neue Technologie ausprobieren. Ist ja auch dein Ziel ganz oft von side Projects. Und wenn man aber von ganz vielen Leuten hört, ich baue jetzt ein side Project auf, ein Business, ich starte ein Business und das sollte funktionieren, dann dann gibt es glaube ich andere Sachen, die man beachten muss, damit man zu einem möglichst sinnvollen, funktionierenden Produkt kommt. Und da gehört meiner Meinung nach nicht dazu, etwas Neues zu lernen im Sinne von Technologien neu zu lernen oder was Neues auszuprobieren, sondern da gibt es ganz viele andere Dinge, die wir als tech Leute ganz oft vergessen oder vernachlässigen oder."
    },
    {
      "end": 352740,
      "speaker": "A",
      "start": 351500,
      "text": "Aktiv zur Seite schieben."
    },
    {
      "end": 371000,
      "speaker": "B",
      "start": 352740,
      "text": "Genau. Kann ich doch mal später machen. Und nachdem ich ja einige Produkte so mal gebaut habe in meinem Leben und eigentlich alle diese Fehler gemacht habe und genau diese Probleme auch alle durchgegangen bin, haben gedacht, ist es mal wert, auch darüber zu sprechen, was man eben machen sollte und was man als Tech Person super gerne vergisst."
    },
    {
      "end": 382800,
      "speaker": "A",
      "start": 371000,
      "text": "Ich hätte gerade erwähnt, zehn Produkte oder zehn side Business hast du bereits versucht. A über welchen Zeitraum reden wir da? Also wann hat das erste gestartet und B woher kamen diese zehn verschiedene Ideen?"
    },
    {
      "end": 394740,
      "speaker": "B",
      "start": 382800,
      "text": "Also ich glaube, mein erstes cooles side Business, was schon Geld abgeworfen hat, war mein Spindverkauf von Pepsi Dosen und irgendwo so Süßigkeiten in der Schule. Mit vierzehn zählt das schon als side Business."
    },
    {
      "end": 402740,
      "speaker": "A",
      "start": 395060,
      "text": "Klingt auf jeden Fall höchst illegal. Du hast irgendwie Pepsi Dosen geschmuggelt und aus dem Spind heraus verkauft oder hast du dich dann."
    },
    {
      "end": 423080,
      "speaker": "B",
      "start": 402980,
      "text": "Man durfte ja offiziell die Schule nicht verlassen und wir hatten einen Supermarkt in der Nähe und ich habe halt dann aus dem Spind verkauft. Wir haben uns einen Spind geteilt, immer zwei Leute. Mein banknachbar hat keine Chance mehr gehabt, irgendwas reinzubringen in diesen Spind, weil der war immer voll gelagert mit Pepsi Dosen und so Süßigkeiten. Und die dann in der Base verkauft? Ja, genau, an die ganze Schule. Es hat ganz gut funktioniert."
    },
    {
      "end": 425080,
      "speaker": "A",
      "start": 423080,
      "text": "Hattet ihr keine Cafeteria oder sowas?"
    },
    {
      "end": 436360,
      "speaker": "B",
      "start": 425080,
      "text": "Ja, wir hatten so einen Schulwart, der auch was verkauft hat, aber der hat natürlich nur so Wurstsemmeln und so Zeug verkauft. Aber das richtig gute Zeug, Pepsi in dem Fall. Es war das billigere als Cola und so, Süßigkeiten natürlich weniger."
    },
    {
      "end": 440080,
      "speaker": "A",
      "start": 436360,
      "text": "War die Lage denn wenigstens gut? Lag dein Spind direkt am Ausgang der Sporthalle?"
    },
    {
      "end": 442880,
      "speaker": "B",
      "start": 440080,
      "text": "Nein, im Keller, da wo man Sachen dealt natürlich."
    },
    {
      "end": 446000,
      "speaker": "A",
      "start": 442880,
      "text": "Okay, das bedeutet, wir reden hier echt über einen langen Zeitraum."
    },
    {
      "end": 461820,
      "speaker": "B",
      "start": 446400,
      "text": "Wir reden über einen langen Zeitraum, ja genau. Dann kamen ein paar Projekte, so in der Dotcom Bubbles, alles werbungsfinanziert, so Webseiten. Die haben eigentlich auch schon Geld abgeworfen, so in meiner Jugendzeit. Hat eigentlich auch ganz gut funktioniert, aber war halt alles sehr dilettantisch, muss man schon auch dazu sagen."
    },
    {
      "end": 478100,
      "speaker": "A",
      "start": 461820,
      "text": "Wie kamst du auf diese Ideen? Also ich mein, wenn ich jetzt sage, Pepsi und Süßigkeiten aus dem Spind heraus verkaufen, dann würde ich fast sagen, da hast du ein Problem von anderen gelöst und nicht dein eigenes Problem. Oder hast du dir gedacht, diese Schule braucht einen Pepsi Counter zum Pepsi kaufen?"
    },
    {
      "end": 531490,
      "speaker": "B",
      "start": 478100,
      "text": "Es war eigentlich schon ganz oft, dass ich mein eigenes Problem gelöst habe. Also ich habe auch mal so eine Webseite gebaut, handyinfo at, zu Schulzeiten noch. Da hat man gratis SMS versenden können und man hatte halt sonst nirgends die Möglichkeit, sinnvoll gratis SMS zu versenden. Darum habe ich das gebaut und habe damit mein eigenes Problem gelöst, weil es war irgendwie limitiert auf drei SMS oder so. Ich weiß nicht, du kommst ja nicht aus dieser Zeit. Wir hatten früher noch ein Problem, da gab es kein WhatsApp, wir haben SMS versenden müssen, es war teuer oder limitiert zu online Webseiten gegeben und und ihr habt da sowas damals gebaut. Also es war mein eigenes Problem und ich glaube, die meisten Ideen sind eigentlich daraus entstanden, dass ich mein eigenes Problem lösen wollte. Also auch Open Podcast zum Beispiel war ja unser Problem, dass wir die Daten für Podcasts und Podcast Statistiken nicht sinnvoll zur Verfügung haben und wir wollten da mehr Einblick bekommen und haben dann unser eigenes Problem gelöst."
    },
    {
      "end": 551190,
      "speaker": "A",
      "start": 531570,
      "text": "Ich möchte noch ganz kurz erwähnen, ich hatte auch noch Enokia, ich habe auch Snake gespielt, ich habe auch neun und dreiig Pfennige damals noch für NSMS gezahlt und ich habe auch noch Audio Kassetten mit einem Bleistift zurückgesetzt bzw. War aufgerollt und saß auch vor dem Radio und habe auf jetzt aufnehmen gedrückt, als mein Lieblingssong im Radio kam, um ein Mixtape zu erstellen."
    },
    {
      "end": 643530,
      "speaker": "B",
      "start": 551190,
      "text": "OK, du bist also auch alt. Du bist jetzt offiziell auch alt. Was es sonst noch klassisch gibt, wenn man eine Idee sucht, die sich ganz gut eignet, ist, wenn jemand auf einen zukommt und hey, du bist doch Informatiker. Und ich meine jetzt nicht dieses hey, du bist doch Informatiker, kannst du mir helfen, meinen Fernseher zu reparieren oder meinen Videorekorder, falls das noch jemand kennt, was das ist, sondern es kommt jemand vorbei und sagt, ich habe ein Business und du bist Informatiker, kannst du mir da nicht was lösen oder hast du da eine Möglichkeit? Und daraus kann dann ein Produkt entstehen. Und das ist eigentlich auch schon eine super Herangehensweise, weil dann hat man zumindest schon einen ersten Kunden oder hat die Validierung, dass jemand dieses Problem hat. Da sind eigentlich die zwei grundlegenden Herangehensweisen meiner Meinung nach sinnvoll, um Ideen zu finden. Es gibt dann noch andere Möglichkeiten, auf Ideen zu kommen und leider ist es so eine Variante, die auch oft gewählt wird, aber meiner Meinung nach nicht so gut funktioniert, ist, wenn man irgendwo sieht, man kann da irgendwas besser machen durch Technologien, man kann da Arbitrage machen, man kann irgendwas billiger machen, was es schon gibt, aber man schafft es vielleicht selber oder bildet sich zumindest ein, man schafft es selber besser und schneller und günstiger. Aber das ist meiner Meinung nach kein langfristiges Business, weil es halt, wenn es um Arbitrage geht, also um Preisunterschiede, dann hält es halt meistens nur ein paar Jahre und irgendwann wird dann die Konkurrenz zu stark und dann fliegt der ganze Business Case wieder einem um die Ohren. Also ich finde schon eigenes Problem lösen, das Problem von anderen lösen, ist eigentlich die präferierte Herangehensweise."
    },
    {
      "end": 656090,
      "speaker": "A",
      "start": 643610,
      "text": "Dann lass uns doch mal darüber sprechen, wie man startet. Ich habe jetzt eine Idee, ich habe ein eigenes Problem. Ich sage dir, was ich machen würde. Ich gehe auf GoDaddy oder United Domains und kauf mir eine domain, so wie einfach jeder gute Engineer das macht."
    },
    {
      "end": 666630,
      "speaker": "B",
      "start": 656090,
      "text": "Jetzt hatten wir die Regel, diese Rule of Thumbs, neun von zehn Produkten scheitern. Wie viele Domains hast du in deinem Leben angemeldet und wie viele haben es zu einem funktionierenden Produkt geschafft?"
    },
    {
      "end": 681790,
      "speaker": "A",
      "start": 666870,
      "text": "Also wenn man funktionierendes Produkt als okay, da kann man wirklich, da ist eine App drauf und das kann man benutzen. Jetzt nicht von da kann man für bezahlen, sondern das kann man benutzen. Da muss ich sagen, ich würde sagen, Drittel der Domains, da packe ich auch was drauf. Also sechs."
    },
    {
      "end": 695730,
      "speaker": "B",
      "start": 681790,
      "text": "Ja, aber jetzt keine Landingpage oder so. Es ist schon richtiges Produkt, was funktioniert und was man verwenden kann. Im Idealfall kann man auch dafür zahlen, beziehungsweise ich würde sogar sagen, ein Produkt funktioniert nur dann, wenn es Leute gibt, die auch dafür bezahlen."
    },
    {
      "end": 703810,
      "speaker": "A",
      "start": 695970,
      "text": "Okay, wenn wir so rechnen, ich glaube den Podcast, also ich glaube eine domain, da haben zumindest auf jeden Fall Leute schon mal Kaffee für gespendet und ist."
    },
    {
      "end": 705649,
      "speaker": "B",
      "start": 703810,
      "text": "Ja schon die domain habe ich gekauft."
    },
    {
      "end": 735950,
      "speaker": "A",
      "start": 706050,
      "text": "Dann sind das null Domains bei mir. Wenn wir das mal ein bisschen runterschrauben und sagen okay, wenn man da jetzt kein Geld für ausgeben muss, dann würde ich schon fast sagen, so ich sag mal zwanzig Prozent der Domains, die ich verkaufe, alles gut, ich bin kein domain Händler, die ich kaufe, da ist auf jeden Fall eine Art App drauf, aber achtzig Prozent kaufe ich, zahle ich zwei, drei Jahre, bis ich mal wieder irgendwann meine Kosten optimiere. Und dann frage ich mich, warum ist diese domain da? Und dann kannst du die und dann habe ich da einfach Geld in den Wind geschossen."
    },
    {
      "end": 923120,
      "speaker": "B",
      "start": 736110,
      "text": "Also es geht mir auch so und das habe ich auch in der Vergangenheit oft gemacht und die Besitzer jetzt aktuell nur, glaube ich so vierzig Domains. Vermutlich habe ich irgendwie so sechzig, siebzig Domains in meinem Leben gekauft. Da sind sehr wenige dabei, wo wirklich was drauf läuft und es auch funktioniert. Und die hatte glaube ich auch schon in anderen Episoden erwähnt. Ich habe so eine neue Regel, solange es kein Produkt gibt, was irgendwie funktioniert, gibt es keine Domain. Und ihr habt es auch bei meinem neuesten Projekt, was ich mit einem Co Founder gemacht habe, das durchgeboxt. Keine domain, bevor es kein Produkt gibt. Und er hat mich schon die ganze Zeit angejammert, ja, aber ich kann ja nicht irgendwie offiziellen Leuten mit Gmx Adressen schreiben und so weiter. Wir brauchen eine domain und wir brauchen eine domain. Was dann passiert ist, irgendwann habe ich eine domain registriert und zwei Tage später sind wir draufgekommen, dass das Produkt, so wie wir es machen wollten, mit diesem Namen vor allem auch vermutlich nicht funktioniert. Also ist genau das eingetreten. Du hast schon dann irgendeine domain gekauft und es ist unsicher, ob du den Namen überhaupt verwenden kannst sinnvoll. Und es hat auf dem Weg dorthin waren paar Wochen, wir haben mit GmX Adressen und mit privaten Adressen genauso Türen geöffnet. Wir haben mit offiziellen Stellen gesprochen. Wirklich war überhaupt kein Problem. Niemand hat gesagt, hast du eine Gmx Adresse? War überhaupt kein Problem. Wenn du da als Startup auftrittst und sagst, wir sind gerade in der Gründungsphase, wir haben eine Frage wirklich mit großen offiziellen Organisationen sogar. Kein Mensch interessiert sich darüber, ob du eine Gmx Adresse hast oder sonst was. Und klar ist es feine domain zu haben, dass Leute da mal reinschauen können. Aber wenn dann sowieso nur steht coming soon und wir machen bald was cooles, was hat es für einen Mehrwert? Also meiner Meinung nach domain absolut unwichtig, selber mit dem Namen. Der Name wird sich fünfmal noch ändern wahrscheinlich. Vor allem, wenn man wirklich intensiv daran arbeitet, dann hast du das Problem, dass du mit dem domain Namen vielleicht das schon gekoppelt hast. Manche Leute fangen dann an, die Marke einzutragen, geben dann noch irgendwie aus für einen Markeneintrag. Meiner Meinung nach absolut sinnlos. Da ist die Domain noch wichtiger, wenn man sich den Namen wirklich sichern will. Also es sind so Sachen, mit denen man sich beschäftigt, um irgendwie, wenn man glaubt, es wird die größte, tollste Idee und dann gründet man vielleicht noch eine GmbH und zahlt ganz viel Geld für die GmbH und hat noch null verifiziert, ob das Produkt irgendwann funktionieren wird, ob man da überhaupt loslegen will. Also die GmbH wäre dann die domain plus plus sozusagen. Da gibt man dann wirklich viel Geld aus. Aber meiner Meinung nach gibt es da ganz, ganz viele Schritte, die man davor abklären muss, bevor man irgendwas eben startet in die Richtung, dann offiziell das Konstrukt aufsetzt oder noch schlimmer, man baut das gesamte Produkt, fangt mal programmieren an. Das ist so der Klassiker als Techniker, das können wir alle gut. Wir fangen mal programmieren an, nehmen eine neue Technologie. Du, Andy, als DevOps Mensch, du baus baust dann perfekte CI CD auf. Authentication muss ganz toll sein, haben wir in der letzten Episode gesprochen. Rollensystem machen, alles, was man so braucht, bevor man überhaupt irgendwie einen einzigen Kunden hätte oder mal geprüft hätte, ob nur annähernd irgendwas in die Richtung sinnvoll ist oder ob es nicht schon zwanzig Konkurrenten auf dem Markt gibt, weil die erste Suche hat ja nichts ergeben. Darum gibt es keine Konkurrenz oder Marktbegleiter. Erkennst du dich irgendwo in den Pattern?"
    },
    {
      "end": 967350,
      "speaker": "A",
      "start": 923360,
      "text": "Tierisch, tierisch. Also du hast gerade fünf und dreiig mal meinen Namen genannt, ohne meinen Namen zu nennen, besonders bei der Technik. Ich bin auch ehrlich und da challenge ich dich ein bisschen. Du sagst auf der einen Seite, man kauft noch keine Domain, wenn man noch keine App hat oder kein Produkt hat. Auf der anderen Seite sagst du, ja hör mal auf mit CI, CD und so weiter. Bei Continuous Integration bin ich bei dir, braucht man vielleicht nicht immer Tests, wer braucht die schon? Bei Continuous Deployment Delivery stimme ich dir nicht zu, denn das ist immer das erste, was ich baue, denn da muss ich mich um das ganze Deployment nicht mehr kümmern und ich schippe in einer Geschwindigkeit, das ist unglaublich. Und dann, Achtung, schippe ich in einer Geschwindigkeit, um die App zu bauen, um die domain kaufen zu können."
    },
    {
      "end": 1000050,
      "speaker": "B",
      "start": 967350,
      "text": "Ja, du bist jetzt schon zwanzig Schritte weiter gesprungen, weil wenn ich vom Produkt spreche, heißt es nicht eine funktionierende App oder Code geschrieben, sondern das sind noch zehn Schritte davor. Du überlegst dir mal, was für ein Produkt überhaupt machen willst, da hast du noch gar nicht gecodet und ich spreche vom Produkt, wenn du ein Produkt im Kopf hast, wo du genau weißt, die ganzen Recherchen gemacht hast, es funktioniert, ich habe Kunden, das macht Sinn, da kommen wir im Detail eh noch drauf, wie man das machen kann. Und dann, wenn du an dem Punkt gekommen bist, schreibst du die erste Zeile Code."
    },
    {
      "end": 1012070,
      "speaker": "A",
      "start": 1000050,
      "text": "Das klären wir gleich. Meine Frage ist jetzt eher an dich, also wo du mich abgeholt hast, ist, du brauchst kein Firmenkonstrukt. Starte einfach mal ein Firmenkonstrukt. Kannst du später immer noch draufsetzen, weil es zu Kunden hast und da Geld reinkommt."
    },
    {
      "end": 1031310,
      "speaker": "B",
      "start": 1012150,
      "text": "Vielleicht noch als Ergänzung zu dem Firmenkonstrukt, ganz, ganz wichtig, viele haben da Angst, ich kann ja dann keine Rechnung schreiben oder sonst irgendwas. Kann man alles, also es funktioniert sogar ohne Firma und eine Firma ist innerhalb einer Woche erstellt, das ist überhaupt kein Problem. Wenn du den zweiten Kunden hast und wirklich Geld fließt, dann kannst du eine Firma."
    },
    {
      "end": 1065840,
      "speaker": "A",
      "start": 1031310,
      "text": "Disclaimer, wir sind keine Rechtsberatung und keine Steuerberatung und allem drum und dran, aber im Endeffekt, das kriegt man später hin. Aber eine Frage habe ich dir noch, du hast noch keinen Namen, hast du gesagt, bzw. Der Name muss nicht perfekt sein, bzw. Der Name kann sich noch fünf und zwanzig mal ändern und du hast noch keine domain, hast du gerade gesagt und ihr schreibt Leute an und offizielle Stellen hast du gerade gesagt, das bedeutet Ämter, gehe ich mal stark davon aus. Ich kriege immer so ein komisches Grinsen im Gesicht, wenn ich an der Ampel stehe und vor mir so ein Kastenwagen steht und das ist dann Fliesenmeister Ecken und Fliesenmeister Eck hat eine WebDe Adresse."
    },
    {
      "end": 1079000,
      "speaker": "B",
      "start": 1065840,
      "text": "Ja und würdest du bei dem nicht kaufen, deswegen würdest du sagen, bei dem mache ich jetzt keinen Auftrag. Der hat zwar zwanzig Jahre Erfahrung, ist der super Installateur im Doof, aber ich lasse dem keine Leitung bei mir verlegen, weil der hat ja eine Game XRP."
    },
    {
      "end": 1120000,
      "speaker": "A",
      "start": 1079000,
      "text": "Also ich hoffe, dass ein Fliesenmeister keine Leitung verlegt, sondern Fliesen. Ich komme aus dem Webmetier und da frage ich mich, wie kann man denn im Jahre zwei tausend fünf und zwanzig noch keine eigene Webseite haben, weil darüber informiert sich ja die aktuelle Gesellschaft. Keiner geht mehr ins Branchenbuch auf gelbe Seiten. Ich weiß nicht, ob ihr sowas kennt in Österreich. Du hast natürlich vollkommen recht, Fliesenmeister Eck, vielleicht ist das der beste Fliesenmeister der Welt, vielleicht hat er sogar die Fliesenweltmeisterschaft gewonnen, ich weiß es nicht, aber irgendwie kommt da schon so ein komisches Grinsen ins Gesicht. Meine Frage ist jedoch, wenn ihr dann diese offiziellen Stellen, Ämter und so weiter anschreibt, wie umschreibt ihr das Projekt? Sagt ja hallo, mein Name ist Wolfgang und ich habe jetzt vor den Mobilfunkmarkt zu revolutionieren."
    },
    {
      "end": 1301870,
      "speaker": "B",
      "start": 1120240,
      "text": "Brauchst schon irgendwas, du musst schon erklären, was du machst. Ganz super ist natürlich, wenn du irgendwie eine Stelle hast, die dich legitimiert. Also wir hatten das beim Open Podcast Projekt über die Open Source Förderung von Mediatek Lab und haben über diese Schiene einen Einfallstore gehabt sozusagen und haben viele Firmen anschreiben können, gesagt wir sind in diesem Programm Mediatek Lab, die haben einen Namen, Media Lab ist sehr bekannter Name in Deutschland und haben so Leute anschreiben können. Jetzt bei einem anderen Projekt, was ich erwähnt habe im Energiesektor, da sind wir offiziell in einem in einem Incubator. Das heißt, wir können Leute anschreiben, Hey, wir sind in dem Incubator, der hat einen offiziellen Namen, wir machen dieses Produkt, hast du mal Zeit mit uns zu quatschen? Und wenn man so eine Legitimierung hat, dann ist es viel einfacher Leute anzusprechen. Also wir hatten das damals bei Open Podcast wirklich einfach in eine E Mail gepackt. Ich habe mir das sogar noch mal rausgesucht, wie wir das formuliert haben. Das war wirklich ich bin Wolfgang, arbeite im Rahmen von Media Lab an einer freien, offenen Plattform für Podcasts. Sind auf dich aufmerksam geworden wegen XY, wollten mal mit dir quatschen, was für Podcast Hosting Plattform du verwendest und was du so für Probleme in der Podcast Produktion und im Publishing Prozess hast und ob du mal zwanzig, dreiig Minuten Zeit hast für einen Call. Und fast alle haben da eigentlich ja gesagt. Also wir hatten da innerhalb kürzester Zeit zwanzig Leute beisammen, mit denen wir Interviews gemacht haben. Und das waren so Sachen wie WDR, OMR, die programmierbar, so andere Podcasts, die wir natürlich gekannt haben, aber auch größere Agenturen, wirklich Vermarktungsagenturen. Wir hatten da überall eigentlich sofort einen Call und das war überhaupt kein Problem damit, zwanzig oder dreiig Minuten mit jemandem zu quatschen. Und das unterschätzt man, weil man glaubte immer, ja, die Leute geben ja keine Informationen preis, aber wenn man fragt und einfach mal anklopft, ist es überhaupt kein Problem. Bei der Energiegeschichte haben wir angeklopft, bei einer offiziellen Agentur, die so Wärmeprojekte macht vom Land Tirol, überhaupt kein Problem, wenn wir sagen, okay, wir sind im Incubator, die kennen den, sofort einen Call, alles kein Problem. Also wenn man sich da irgendwo vielleicht so Hilfe sucht oder wo man sich einklinken kann oder irgendwen mal anfragt und wenn man dann ein Gespräch mit dem hat, mal fragt, kennst du sonst noch Leute, kannst du einen Kontakt herstellen, wie es halt beim Networking oft so funktioniert, dann können die Intros machen und dann hast du wirklich Intros zu allen wichtigen potenziellen Kunden und Firmen und es ist fast jeder bereit, mit dir zu sprechen. Und dann schreibst du mal fünfzig Leute an, die Hälfte sagen zu und dann hast du mal schon Superpool, mit denen du sprechen kannst. Und da brauchst du keine domain, brauchst du keine GmbH und da brauchst du kein funktionierendes Produkt und keine App noch dazu. Weil nach diesen zwanzig Gesprächen kommst du wahrscheinlich drauf, vielleicht passt mein Name nicht, vielleicht passt meine Idee nicht, vielleicht passt die App nicht. Das heißt, die CI CD, die da aufgesetzt habe, vielleicht brauche ich die gar nicht, weil die braucht gar keine Web App, sondern ich brauche eine native App oder ich brauche eine Hardware, die ich bauen muss. Also auch da kann sich ganz viel entwickeln. Und über diese Hürde muss ich mal drüber, bevor ich eine Zeile Code schreibe. Und das ist, glaube ich, das Wichtige. Ich beginne nicht mit der Zeile Code."
    },
    {
      "end": 1314320,
      "speaker": "A",
      "start": 1301870,
      "text": "Jetzt kommt Henry Ford und hätte ich die Leute gefragt, hätten sie mir gesagt, sie wollen schnellere Pferde. Was ist denn, wenn die Idee so innovativ ist, dass alle Leute, die du interviewst, einfach falsch sind und du eine disruptive technology gerade am Start hast?"
    },
    {
      "end": 1447350,
      "speaker": "B",
      "start": 1314320,
      "text": "Ja, das ist die Standardfrage, die es eigentlich immer gibt. Und man stellt sich ja immer so vor, ja, man ist ganz neu und man hat eine innovative Idee. Wenn man dann mit Leuten spricht, kommt man hoppala, die ist gar nicht so innovativ, die gab es schon zwanzig mal und hat aus bestimmten Gründen nicht funktioniert. Dann glaubt man meistens, man kann das besser, man macht es trotzdem, das funktioniert. Und irgendwann merkt man dann vielleicht, es ist doch nicht so leicht, das Ganze zu machen. Wir hatten das gerade jetzt im Energiebereich, gibt so erneuerbare Energiegemeinschaften und da gibt es schon ganz viele und Firmen drumherum. Und wir haben uns immer gefragt, warum bringen die das alle nicht zum Fliegen? Und die Antwort war natürlich, weil die nicht so intelligent sind wie wir. Danach, wie wir ganz tiefer eingetaucht sind in das ganze Thema, sind wir draufgekommen, oh, es ist vielleicht doch schwieriger, Leute zu überzeugen oder diese erneuerbaren Energiegemeinschaften an die Frau und den Mann zu bringen. Und vielleicht ist nicht, weil die anderen so dumm waren, sondern weil da einfach Blocker überall herumstehen und es nicht so leicht ist, Leute zu überzeugen. Darum würde ich mal in Frage stellen, ob das wirklich so innovativ ist, was du da an Idee hast. Und wenn du wirklich zu diesen zehn Prozent gehörst, die so innovativ sind, dann wirst du trotzdem Sachen herausfinden. Und du musst dir nicht die Leute fragen, brauchst du das Produkt, was mir vorschwebt, sondern du gehst zu den Leuten und hörst dir einfach mal an, was die für Probleme haben. Also bei Open Podcast haben wir auch die Leute gefragt, okay, wo hostest du deine Podcasts? Wie nimmst du deine Podcasts auf? Wie produzierst du die? Wie publish du die? Hast du irgendwo Probleme in dem ganzen Workflow? Also wir haben nicht gefragt, wir haben da eine Lösung, willst du diese Lösung? Sondern wir haben einfach mal uns angehört, wo die Probleme liegen bei den Leuten. Weil auch da haben wir dann gemerkt, dass es andere Probleme gibt, die wir vielleicht eher lösen sollten oder die zumindest ein größerer Schmerz sind. Also es haben alle gesagt, das Schneiden ist total aufwendig. Da haben wir keine Lösung dafür gehabt. Und falls jemand eine gute Lösung dafür hat, wir würden auch eine suchen für den Engineering Kiosk. Aber da hat man gemerkt, das eigentliche Problem, wo die Menschen beim Podcast produzieren ganz viel Zeit investieren, ist das Schneiden und nicht die Statistiken, die sind gar nicht so wichtig. Da haben wir gemerkt, für normale Podcaster sind Statistiken gar nicht so wichtig, zumindest nicht so wichtig, dass es schmerzvoll ist und dass sie Geld ausgeben würden. Das heißt, wir haben die Zielgruppe auch wieder ändern müssen. Und diese Informationen findest du nur raus, wenn du mit Leuten sprichst, als Devil's."
    },
    {
      "end": 1486800,
      "speaker": "A",
      "start": 1447350,
      "text": "Advocate könnte ich dich jetzt challengen. Ja, Moment mal, wenn du, ich habe jetzt den Fehler gefunden, warum die anderen Leute das nicht zum Fliegen bringen, dann könnte ich auch sagen, weil du sagst ja eigentlich, dann hört man auf. Da könnte ich auch, ist dein Atem nicht lang genug? Denn es gibt ja auch Uber und es gibt die Taxivereinigungen, es gibt ja auch Flixbus, die jetzt gerade auch vor kurzem diesen Rechtsstreit mit dem Beförderungsgesetz, mit der deutschen Bahn und so weiter gewonnen haben. Also meine Frage ist eigentlich, und zugegeben, wenn ich jetzt Uber und flixbots nehme, das sind zwei Firmen von die sowas machen, also das ist mehr oder weniger schon ein gewisser Bias hier. Meine Frage ist aber, ist ein Atem nicht lang genug?"
    },
    {
      "end": 1497380,
      "speaker": "B",
      "start": 1486800,
      "text": "Der Atem muss grundsätzlich sehr, sehr lange sein und das haben wir jetzt bei Open Podcast auch gemerkt, wie lange wir jetzt da eigentlich schon dran sind. Das ist ein side Project, wo wir jetzt nicht fulltime natürlich drinstecken."
    },
    {
      "end": 1498340,
      "speaker": "A",
      "start": 1497380,
      "text": "Wie lange seid ihr da schon dran?"
    },
    {
      "end": 1590050,
      "speaker": "B",
      "start": 1498340,
      "text": "Aber wo wir jetzt schon, ich muss gerade überlegen, ich glaube über zwei Jahre dürfte das sein, dran sind und ihr hattet Hockeystick Growth. Ja, das wäre eben schön, den zu haben. Man muss natürlich auch noch mal unterscheiden, wenn du jetzt an Uber oder Flixbus und so weiter denkst, das sind alles VC Companies, die haben Geld aufgenommen, um wirklich so Gas zu geben und da wirklich in diesen Markt reinzugehen und sowas aufzuräumen. Also ich spreche jetzt von side Projects, die man so nebenbei mal startet. Es kann natürlich zu einem vc Projekt werden am Ende, ganz klar, wenn man sowas machen will, aber da braucht man dann auch externe Finanzierung, weil sonst hast du diesen langen Atem nicht. Also ein side Project, langen Atem kannst du haben, aber ob du dann Regulierungen änderst oder da wirklich den kompletten Markt disruptest am Anfang, ist sicher schwierig. Das kann natürlich dann irgendwann dazu führen und es kann ein guter Start sein, aber ich würde mal nicht mit dem nach außen gehen. Und auch da wieder grundsätzlich, du musst ein Problem lösen, das es dort draußen gibt. Du kannst natürlich ein Problem lösen über eine disruptive Technologie, aber das dauert natürlich dann wesentlich länger. Und das sieht man auch, wie lange das bei Uber oder auch bei anderen klassischen, die man vielleicht so als disruptive bezeichnet, gedauert hat. Also da ist viel Geld und Zeit im Spiel und eben Regulatorik und so weiter, was da alles mitspielt. Also bis FlixTrain entstanden ist und die wirklich Züge auf das Gleis gebracht haben, da ist natürlich viel Wasser, den was ist bei dir da den Rhein runtergelaufen."
    },
    {
      "end": 1606140,
      "speaker": "A",
      "start": 1590050,
      "text": "Aber ist es nicht so, wenn ich ganz viele Leute anschreibe, vielleicht sogar im selben Sektor, die sich damit auskennen, vielleicht sind das Domänenexperten in der Idee, die ich umsetzen möchte, dass ich nicht meine geheime Idee preisgebe und die Leute dann die Idee nehmen und starten und die umsetzen. Also im Endeffekt Ideendiebstahl."
    },
    {
      "end": 1655880,
      "speaker": "B",
      "start": 1606140,
      "text": "Ja, das trifft so die Kerbe mit dem ich muss meine Marke anmelden, ich muss sofort meinen Claim setzen, weil die ganze Welt wird ja gegen mich arbeiten. Also die Großen interessiert es meistens nicht, was du als kleiner machst und dass jemand so viel Energie, Zeit, Geld, was auch immer dazugehört, aufbringt, um deine Idee umzusetzen. Die Chance ist so, so gering, dass das meiner Meinung nach die dümmste Herangehensweise ist, wirklich zu sagen, ich muss meine Idee geheim halten. Also ich hatte das mal, wie ich noch an der Uni war, haben mich Studenten aus dem Wirtschaftsbereich angeschrieben, sie haben da eine Idee und wollen die gern mit mir besprechen und sie suchen da Tech Support und keine Ahnung, waren eh sehr mutig, habe mich mit denen getroffen auf einen Kaffee und dann schieben mir die so ein NDA unter die Nase und sagen sie erzähl mir die Idee jetzt nur, wenn ich diesen NDA unterschreibe."
    },
    {
      "end": 1656520,
      "speaker": "A",
      "start": 1655880,
      "text": "Was ist ein NDA?"
    },
    {
      "end": 1774050,
      "speaker": "B",
      "start": 1656980,
      "text": "Ein Non disclosure Agreement, also dass du nichts sagen darfst zu dem ganzen, was du da gehört hast. Und überall dann gesagt ja OK, dann können wir halt nicht reden, weil ich werde keinen NDA unterschreiben. Weil die sind ja auch meistens so breit gefasst, dass man dann wirklich Probleme hat, wenn man, weil ich weiß ja nicht, was die mir erzählen. Wenn ich dann zwei Wochen später in einem ähnlichen Bereich vielleicht irgendwas starte oder mit anderen Leuten, dann hast du da plötzlich ein Problem und rechtliches und kein wie sie wird dir ein NDA unterschreiben? Also gerade wie sie es, weil die hören ja ständig Ideen und die sind meistens alle so ähnlich, dass die sich da rechtlich nie verpflichten würden, irgendwas geheim zu halten. Und man muss das ja anders sehen. Eigentlich. Ein Produkt fliegt ja mit dem Team und mit dem Investment, was du tätigst, mit deiner Zeit. Die Idee an sich, wie viel Ideen hattest du schon in deinem Leben und wie viele Ideen hatte man bei einem, bei einem dummen Bier? Und vielleicht sogar paar Monate später hat dann irgendwer die Idee umgesetzt, ohne das zu wissen, dass du die bei dem Bier schon besprochen hast. Aber wenn man schaut, wie schwer es ist, Ideen dann zum Fliegen zu bringen. Neun von zehn scheitern, das hat nichts mit der Idee an sich zu tun und du änderst die Idee sowieso noch zwanzig mal. Also es geht wirklich um den ganzen Prozess und es wird dir niemand deine Idee klauen, außer du hast jetzt vielleicht irgendeine geheime chemische Formel erfunden. Aber wenn du da jetzt als Tech Person irgendein Web Service aufsetzen willst, es wird niemand anderer machen, weil die Schwierigkeit liegt nicht in der Idee, sondern in der Umsetzung. Und da ist es noch viel wichtiger, einfach den Input zu bekommen, weil wenn jemand anderer sagt, hey, die Idee gab schon zehn mal, das ist eigentlich, was du wissen willst. Und wenn du dann noch herausfindest, warum hat die zehn mal schon nicht funktioniert, das ist, was dich weiterbringt und nicht deine Idee geheim halten. Also du musst sogar genau gegenläufig arbeiten. Du musst mit ganz, ganz vielen Personen sprechen, beim Bier mit Leuten, die es nicht verstehen. Da lernst du auch das Pitchen, wenn Leute Fragen haben, ich verstehe es nicht. Du lernst mit dem Ganzen, indem du mit Leuten sprichst und deine Idee zwanzig mal, ein hundert mal erklärst und diskutierst und so kommst du weiter."
    },
    {
      "end": 1777390,
      "speaker": "A",
      "start": 1774050,
      "text": "Zum Thema Ideen erklären gibt es ja den sogenannten Mom Test."
    },
    {
      "end": 1813700,
      "speaker": "B",
      "start": 1777390,
      "text": "Kennst du den, Ken? Den Begriff nicht, aber ich denke mal den Pitch einfach der Mutter zu machen, die keine Ahnung hat. Genau, ja. Wobei da denke ich mir immer, da müsste man das Alter oder den Altersunterschied dazu sagen, weil meine Mutter ist über achtzig und das ist dann teilweise schon schwierig. Also die versteht gleich bis heute ganz, was Podcasts sind. Das macht es dann schon schwierig, wenn man in so einer ganz anderen Bubble ist oder wenn du irgendwie ein physikalisches Produkt erfindest, irgendwas ganz spezielles auf Quantentechnologie. Aber idealerweise kannst du es dann trotzdem irgendwie so erklären, dass es jemand versteht, der auch nicht in dem Thema ist. Das stimmt. So grob zumindest."
    },
    {
      "end": 1833210,
      "speaker": "A",
      "start": 1813700,
      "text": "Jetzt hast du gesagt, du schreibst ganz viele Leute an, du interviewst die. Was stellst du für Fragen, was ist dein Ziel, welche Themen bringst du an? Also wir stellen immer die Frage, wenn wir eine Podcast Episode aufnehmen, wenn du alles vergisst und nur eine Sache behalten kannst, was nimmt man mit und was ist deine Kernfrage? Was ist deine Kerninformation, die du aus einem Interview rausnehmen möchtest?"
    },
    {
      "end": 1954550,
      "speaker": "B",
      "start": 1833210,
      "text": "Ich komme gleich zu deiner Frage, weil ich glaube, es gibt ein System oder einen Ansatz in dem Ganzen. Ich baue ein Business auf, der sehr, sehr wichtig ist und den wir eigentlich alle aus der Entwicklung kennen. Das ist, dass du iterativ agil an deine Sachen dran gehst. Also ich glaube zumindest zum ersten mal oder sehr bekannt wurde der Lean Startup. Das war ein Buch von Eric Reese und der hat da drinnen so einen agilen Ansatz erklärt. Build measure learn was wir ja alle aus Scrum kennen. Also du machst irgendwas, du schaust dann, ob das funktioniert und lernst daraus oder iterierst dann darüber. Und diesen Ansatz sollte man eigentlich überall verfolgen, nicht nur in der Entwicklung, sondern eben auch in der Entwicklung von Ideen, von Produkten. Und jetzt komme ich zurück auf deine Frage mit dem Fragekatalog. Auch da wieder nicht überlegen, ich mache mir jetzt den perfekten Fragekatalog und iteriere da zwanzig mal drüber und der muss perfekt sein. Vergiss es. Nimm drei Fragen, vier Fragen, die dir spontan einfallen, interviewe die erste Person und dann wirst du, okay, da sind andere Fragen noch wichtiger. Du lernst daraus wieder, du hast da gemerkt, es fehlen Fragen oder es gibt interessante Bereiche, die alle haben oder ein Problem haben. Zum Beispiel, du kommst drauf, okay, der Schnitt ist das Problem. Dann wirst du bei der nächsten Befragung schon einbauen, hey, ist der Schnitt für dich auch so schwierig oder wie schwierig ist der Schnitt für dich? Oder hast du eine Lösung für den Schnitt von deinem Podcast? Also auch da wieder iterativ drüber gehen und mit jedem Interview und ich spreche wirklich von Interview idealerweise und nicht von einem Formular, kann man natürlich auch machen, eine Survey, aber qualitative Interviews sind gerade am Anfang normal besser, weil du darüber iterieren kannst und eine Frage nach der anderen dazunehmen kannst. Und so lernst du und iterierst über deinen Fragekatalog und kannst ein Produkt anpassen und machst diese Iterationsschritte auf allen Ebenen sozusagen. Also auch da wieder wichtig, mit Leuten quatschen und iterieren lernen. Agile Herangehensweise und das macht man überall, nicht nur beim Fragekatalog."
    },
    {
      "end": 1965950,
      "speaker": "A",
      "start": 1954550,
      "text": "Und dein Ziel ist herauszufinden, ob das Problem echt ist bzw. Existiert oder ob das nur in deinem Kopf existiert oder was ist das primäre Ziel? Also was ist die eine Information, die du da rausnimmst?"
    },
    {
      "end": 2052510,
      "speaker": "B",
      "start": 1965950,
      "text": "Also es kommt darauf an, was man natürlich als Ziel hat. Will man jetzt wirklich das Produkt, was man im Kopf hat, unbedingt umsetzen, dann würde man wahrscheinlich möglichst in diese Richtung fragen. Und das Endziel ist eigentlich die wenn jemand dieses Problem hat, würdest du dafür zahlen bzw. Wie viel würdest du dafür zahlen oder wie viel ist es dir wert? Oder noch besser, die Person sagt, wann kann ich jetzt kaufen, wann bist du fertig, wann ich will Testkunde sein, ich zahle dir gern was. Das ist natürlich das Beste, was du erreichen kannst, wenn dir das Produkt nicht so wichtig ist oder du einfach etwas zum Beispiel machen willst in dem Bereich und vielleicht auch im Energiesektor, wie wir es jetzt machen. Wir wollen da eine Änderung schaffen, wir wollen da natürlich ein Business aufbauen, aber wir wollen auch was bewegen. Das heißt, es ist nicht so wichtig, genau welches Produkt wir aufbauen. Dann hörst du dir natürlich auch ganz viele andere Probleme an von den Leuten. Horst mal, wo liegt denn vielleicht irgendwo ein Sweet Spot, wo kannst du ein Produkt einsetzen? Oder du kommst auf neue Ideen drauf, weil dir zehn Leute sagen, hey, ich habe da ein Problem mit meinen Wärmepumpen und Wechselrichtern, weil die alle nicht miteinander sprechen und von verschiedenen Firmen sind, hast du vielleicht gar nicht daran gedacht und du denkst dir, hey, du bist doch Techniker, du könntest da vielleicht was verbinden. Also es gibt viele Möglichkeiten, um ein Produkt zu bauen. Und es muss nicht immer die genaue Frage sein, willst du jetzt ein Auto? Weil dann bist du genau in dem Bereich wieder mit dem Pferd, weil das Auto kennt noch niemand. Also auch da wieder möglichst breit fragen und Probleme suchen, weil du wirst Probleme lösen und nicht Probleme für deine Lösung finden."
    },
    {
      "end": 2095160,
      "speaker": "A",
      "start": 2052750,
      "text": "Aber ist die Antwort nicht eigentlich schon eine Mitbewerber Analyse? Du guckst also bereits, ob dein Problem schon von einer anderen Firma gelöst wurde. Dann gehst du einfach auf LinkedIn, schaust dir an, wie viele Firmen, wie viele Mitarbeiter diese Firma bereits hat, weil das validiert ja eigentlich schon dein Problem, oder? Und da kannst du natürlich auch sagen, okay, der Kuchen ist groß genug, ich nehme mir auch ein Krümel ab. Du musst ja nicht immer das nächste Unicorn bauen. Unicorn ist, was glaube ich eine Milliarde Firmen wert hat, bezeichnet man zumindest als Unicorn in der startup Welt. Aber wenn du jetzt sagst, ich möchte davon nur leben können, ich möchte ein gutes Gehalt haben, dann reicht es doch auch, den kleinen Krümel vom Kuchen zu haben, von einem existierenden Problem, was bereits von anderen Firmen gelöst wurde, oder? Dann spart man sich auf jeden Fall eine ganze Menge Interviews."
    },
    {
      "end": 2324930,
      "speaker": "B",
      "start": 2095160,
      "text": "Genau, das ist, wenn du dann den Markt genauer anschaust, das kannst du also auch ohne Interviews im Idealfall machen, aber Interviews helfen dir natürlich auch, weil du gerade von anderen Spezialisten meistens Input bekommst und vielleicht Marktbegleiter vergessen hast, andere Lösungen, die du vielleicht nicht gefunden hast, weil sie ein ähnliches Problem nur betreffen und nicht genau dein Problem, was du lösen willst. Und da rechnet man sich üblicherweise aus, okay, was ist der Gesamtmarkt, wie viel Konkurrenz gibt es? Was bleibt für mich übrig? Also dieses Kuchenstück und auch das haben wir beim Open Podcast teilweise vielleicht bisschen zu schön gerechnet, das macht man eigentlich auch immer gern. Der total addressable market, also das ist der Gesamtmarkt, den man adressiert. Das werden bei uns alle Podcasts auf der Welt sind vier Millionen und mit dem rechnet man dann. Wenn man dann aber bisschen ins Detail geht und schaut, wie viel Podcast sind denn überhaupt aktiv, dann kommt man irgendwie nur mehr auf eine Million Podcasts, dann ist schon mal nur ein Viertel. Und dann machst du noch eine Marktanalyse, dass es vielleicht Konkurrenz oder so gibt, das heißt, es wird dann noch mal kleiner und dann überlegst du dir, okay, wer ist überhaupt bereit Geld auszugeben für so ein Produkt? Der normale Podcaster ist es eben nicht, sondern nur irgendwie eine größere Agentur. Und so schrumpft der Markt immer, immer kleiner. Und es gibt auch drei Begriffe, die man so üblicherweise verwendet. Also der Total Addressable Market, das heißt alle Podcasts, der Sum serviceable Available Market, also welcher Markt ist überhaupt verfügbar durch technische Hürden oder eben aktive Podcast, das wäre dann der kleinere. Und dann gibt es den SOM, den serviceable Obtainable Market, das heißt, wie viele Leute Podcasts kann ich überhaupt bedienen, wenn man die Konkurrenz mit einberechnet. Und so kommt man auf immer einen kleineren Wert und mit dem kann man dann realistisch rechnen. Und das vergessen auch viele, weil die fangen beim total addressable market an und hören dann auf ja, der ist ja ganz groß, das heißt vier Millionen Podcasts, von denen kann ich vielleicht ein Prozent erreichen. Und dann hat man irgendeinen Wert, der super hoch ist und dabei ist der aber ein hundert faches kleiner. Also auch da muss man immer alles mitdenken. Und sogar wenn man keine Konkurrenz hat, also wir hatten das bei einem Produkt, was ihr gebaut habt, f online, haben wir im Podcast glaube ich auch schon öfters erwähnt, die Führerschein Plattform. Es gab damals keine online Führerschein Plattform, also wir hatten null Konkurrenz, wirklich, wir waren die ersten und trotzdem hat es nicht funktioniert, so wie wir das machen wollten, weil wir wollten es den Fahrschulen verkaufen, dass die das weiter vertreiben an die Fahrschüler innen, dass die lernen können, sich vorbereiten können auf die Fahrprüfung. Und was wir dann aber gemerkt haben ist, dass das so ein extremes Netzwerk ist und dass die Fahrschulen zum Beispiel nicht nur eine Führerschein Lernplattform an ihre Schüler weiterverkaufen wollen bzw. Das vertreiben, sondern die haben Verträge mit Verlage, da bekommen sie die Bücher, die Lernbücher, die Lern CDs waren es damals oder die Lern Apps, da bekommen sie die Straßenschilder, die sie im Unterricht vorzeigen können. Das heißt, die bekommen ein gesamtes Package und dann sind wir hey, wir sind voll modern, du brauchst keine CDs mehr, alles online. Und die haben gesagt, ja, aber was mit dem ganzen Rest ist ja nur zehn Prozent, was ich eigentlich brauche. Und außerdem habe ich dann Vertrag mit einer, mit einem Verlag seit Jahren und der liefert mir alles perfekt. Warum sollte jetzt zu dir gehen? Das heißt, wir haben ein Produkt gebaut, was modern war, was neu war, aber unser Vertriebsweg hat nicht funktioniert über die Fahrschulen. Und darum sind wir dann umgeschwenkt und haben das ganze kostenlos direkt den Fahrschüler innen zur Verfügung gestellt. Aber weil dieser Vertriebsweg nicht funktioniert hat und weil wir da wahrscheinlich zu wenig Interviews gemacht haben oder gar keine Interviews damals waren, wir nicht direkt mit unseren Kunden gesprochen haben, die wir damals ansprechen wollten. Und auch da wieder, wir haben ein komplettes System gebaut, was die Administration ermöglicht hätte für Fahrschulen. Das haben wir danach wegschmeißen können, weil wir haben es nicht gebracht. Wir haben es direkt an die Fahrschüler innen gegeben. Wenn wir das im Vorhinein schon gewusst hätten, hätten wir uns das alle sparen können, die gesamte Administration."
    },
    {
      "end": 2337890,
      "speaker": "A",
      "start": 2325010,
      "text": "Wie lange habt ihr für den Bau dieser Administrationsoberfläche gebraucht? Und wie lange hast du jetzt bei deinem letzten Produkt für die Interviews gebraucht? So in Sachen Zeit? Ich sage jetzt nicht wirklich komplette Zeit, sondern wie viel Zeit ist ins Land gegangen?"
    },
    {
      "end": 2392920,
      "speaker": "B",
      "start": 2338610,
      "text": "Das ist schon zu lange her. Das ist schon über fünfzehn Jahre her. Ich kann es dir leider nicht mehr sagen, aber Interviews brauchen natürlich Zeit. Also das ist gar keine Frage. Aber du sparst dir natürlich trotzdem Zeit, weil sagen wir mal, du redest mit drei Leuten, das braucht drei Stunden und du findest daraus okay, es funktioniert einfach nicht. Wenn du irgendwas programmierst, bist du immer über drei Stunden. Also gar keine Frage. Also umso genauer du das am Anfang schärfst, alles geht natürlich nicht, ist klar. Und du wirst dann auch über die Zeit, bis du dann Product Market fit erreichst, also bis dein Produkt wirklich so geshaped ist, wie es der Markt verlangt oder wo du dann wirklich Traction bekommst und Leute dir das wie warme Semmeln aus den Händen reißen, da vergeht natürlich auch noch mal Zeit. Aber gerade zu Beginn hast du glaube ich, aus einem Interview holst du viel mehr raus, als wie wenn du codest und dann im Prinzip an die Leute gehst, weil du musst ja trotzdem dann mit Leuten sprechen und probieren das zu verkaufen. Also die Zeit hast du ja sowieso."
    },
    {
      "end": 2408160,
      "speaker": "A",
      "start": 2392920,
      "text": "Jetzt hast du dir die ganzen Analysen gemacht, du hast mit Leuten gesprochen, dein Chat GPT Credit Konto ist bereits ausgemaxed und jetzt stellt sich die lohnt sich das? Wie gehst du an die Frage ran? Wie ermittelst du das? Lohnt sich das?"
    },
    {
      "end": 2605660,
      "speaker": "B",
      "start": 2408160,
      "text": "Ja, das wäre eigentlich so der Schritt, wenn man so grob das Produkt definiert hat. Also was will man machen? Man weiß das aus den Interviews, dann fängt man mal an zu klären oder vielleicht macht man es auch parallel, ist es ein Business Case? Und ich habe schon erwähnt, es gibt den total addressable market und den Sum und den SoM. Und aus diesen Zahlen kannst du mal überlegen, okay, wenn ich das jetzt an ein Prozent von dem SOM, also von dem gesamten erreichbaren Markt verkaufen würde, wie viel Geld kommt denn da rein? Setzen wir mal irgendeinen Preis an und dann bekommt man eine Info, wie viel revenue, wie viel Umsatz man hätte und dann muss man das gegenrechnen mit dem, was man Ausgaben hat. Also es ist eine klassische Break Even Rechnung, das heißt, ich will wissen, wie viele Kunden brauche ich, damit die mit null aussteige. Und das ist natürlich eine schwierige Rechnung, man vergisst da viel, aber man kann einfach mal paar Werte annehmen, wie viel kostet mich Sales, wie viel kostet es mich, einen neuen Kunden zu bekommen? Also wie viel Zeit, Geld muss ich da ausgeben? Das ist der Kack, der Customer Acquisition Costs Wert, den man da immer annimmt. Und wenn das eine Zeit ist, also eine halbe Stunde, muss man die halt mit irgendeinem Stundensatz rechnen und dann kommt man auf irgendeinen Wert am Ende und kann sich überlegen, okay, mit meinem Preis pro Jahr oder wenn es ein Subscription Model ist pro Monat, wie viel bekomme ich da an Revenue, an Umsatz von meinem Kunden im Jahr? Dann kann man sich noch ein paar Dinge abziehen, steuern und so weiter, dass man da auf einen sinnvollen Wert kommt und dann kommt man auf irgendeinen Kundenwert von zum Beispiel, das heißt, ich brauche Kunden, damit die Break Even mit einer schwarzen null unten rauskommen. Und dann ist es meistens sehr ernüchternd, weil wenn man Kunden braucht und sich überlegt, okay, wie lang brauche ich, um Kunden zu bekommen, dann ist es natürlich ziemlich hart. Das kann man beschleunigen, aber meiner Meinung nach ist es trotzdem eine wichtige Rechnung, weil man da einfach mal vor Augen geführt bekommt, was es alles braucht. Und wenn man da mit echten Werten rechnet, also wenn man da mit Stundensätzen rechnet, die du oder ich so verdienen, dann kann man, glaube ich, sowieso jedes Business vergessen, weil wenn du deine, keine Ahnung, deine, nehmen wir mal Wert von, diese Rechnung haben wir auch schon öfters im Podcast gemacht, Euro brutto verdienst durch zwei hundert zwei und zwanzig Arbeitstage, das ist meine goldene Regel, kann man sich leicht merken, zwei hundert zwei und zwanzig, zwei hundert zwei und zwanzig Arbeitstage, dann kommt man bei einem Stundensatz von sechs und fünfzig brutto raus. Wenn man das noch super brutto rechnet, also mit Nebenkosten und so weiter, die man hat als Arbeitgeber, dann kommt man so bei zwei und siebzig die Stunde raus. Und wenn man mit dem Wert rechnet, wenn du da jetzt Customer Acquisition Costs rechnest, du musst eine halbe Stunde mit irgendwem telefonieren oder eine Stunde und du hast siebzig Kosten, nur um einen Kunden an Land zu kriegen, dann wird es super schwierig. Und du wirst ja auch irgendwann im Idealfall, wenn du ein Business baust, von dem leben wollen. Das heißt, wenn du nur annähernd ähnlich zu deinem Entwickler innen Gehalt sein willst, da musst du auf so einen Stundensatz kommen. Und wenn du dann rechnest mit irgendeinem Subscription Model, wo du sieben Euro im Monat verlangst und im Jahr dann und dann im Jahr siebzig Euro netto bekommst von einem Kunden Revenue, dann kannst du dir ausrechnen, das ist eine Stunde, dann brauchst du schon mal um die zwei tausend Kunden, nur um dein Gehalt zu bezahlen. Und da hast du jetzt keine Extrakosten, server Werbung oder sonst was noch mitgerechnet."
    },
    {
      "end": 2651170,
      "speaker": "A",
      "start": 2605660,
      "text": "Ich habe zwei Bereiche A ist das alles wirklich notwendig? Denn meine Frage ist, wie sieht das denn mit Bootstrapping aus bzw. Neben der Arbeit? Und ich mein, muss alles wirklich ein eigenständiges Business sein oder kann es nicht darauf ausgelegt sein, dauerhaft ein Zeitverdienst zu sein? Da stellt sich dann natürlich dann die muss ich meinen Stundensatz von zwei und siebzig Komma acht null super brutto. Das ist außerdem ein neues Wort, was ich hier gerade gelernt habe. Super brutto. Mit super brutto, wenn ich verstanden habe, ist das, was der Arbeitgeber zahlt, also muss ich das erreichen? Oder kann ich sagen, nee, der Bau meines Sidebusiness macht mir so viel Spaß und ich werte das höher als meine Freizeit, weil im Endeffekt ist es das ja eigentlich. Man competet ja mit seiner Freizeit."
    },
    {
      "end": 2655450,
      "speaker": "B",
      "start": 2651410,
      "text": "Aber du kommst jetzt schon wieder mit dieser Argumentation, ich kann ja was Neues lernen, ich kann Spaß."
    },
    {
      "end": 2656370,
      "speaker": "A",
      "start": 2655450,
      "text": "Nein, nein, nein, nein."
    },
    {
      "end": 2694250,
      "speaker": "B",
      "start": 2657330,
      "text": "Wenn das deine Argumentation ist, ist okay. Aber wir haben gesagt, die Argumentation ist Geld zu verdienen. Und da musst du dir dann eben auch bewusst sein, willst du das machen, obwohl du nicht annähernd so viel verdienst wie bei deinem normalen Job? Das kann eine strategische Überlegung sein, das kann auch ein Investment sein, weil du sagst, okay, irgendwann fliegt es dann und dann wird es groß. Du siehst es wirklich als Investment. Glaub, musst du auch, weil Bootstrappen mit deinem normalen Stundensatz ist fast unmöglich. Also ich glaube, dass es fast kein Business gibt, wo du auf deinen Stundensatz kommst mit einem Bootstrap Business. Also du musst es als Investment sehen."
    },
    {
      "end": 2726820,
      "speaker": "A",
      "start": 2694250,
      "text": "Genau diesen Punkt wollte ich jetzt ansprechen als zweiten Teil, ist das nicht alles nur eine Wette für die Zukunft? Denn dass man aus dem stegreif sein super brutto, ich mag diesen Begriff jetzt schon, sein super Brutto erreicht, unwahrscheinlich. Deswegen, es ist ja alles eine Wette in die Zukunft. Und jetzt die wie lang ist die Zukunft? Du sagtest gerade, du bist bei Open Podcast schon zwei Jahre dabei. So wie du das formuliert hast, konnte man zwischen den Zeilen hören, dass das für dich schon echt lange ist und du dir mehr erhofft hattest in diesen zwei Jahren. Und da ist meine wie weit ist denn dein Investment in die Zukunft?"
    },
    {
      "end": 2821590,
      "speaker": "B",
      "start": 2727060,
      "text": "Ja, in erster Linie ist für mich die Break Even Rechnung einfach um Klarheit zu kriegen, um dann zu entscheiden, mache ich dieses Investment? Weil wenn ich rauskomme mit der Rechnung, ich brauche Kunden und überleg mir dann mal, wie lang brauche ich, um Kunden zu bekommen? Dann überlege mir vielleicht, ob es das Investment überhaupt geben sollte und Sinn macht und ich das machen will. Oder ob der Business Case vielleicht der falsche ist oder ich noch mal zurück ans Reißbrett muss oder in Interviews und schauen muss, wie kann ich meinen Business Case verbessern? Und dann kann ich natürlich die Entscheidung machen, okay, wie viel investiere ich? Möchte ich das machen? Gibt es noch andere Elemente? Und da kommen jetzt wieder diese Ausreden mit rein. Kann ich was dabei lernen? Man kann ja auch von der Business Seite was lernen. Sales, wie spreche ich mit Leuten? Wie baue ich so ein Produkt auf? Also das sind ja auch Lernziele, die man haben kann. Und irgendwo muss man ja mal anfangen. Also es ist schon okay. Es geht mir nur darum, dass man sich das mal durchrechnet am Anfang und nicht ohne einer genauen Rechnung einfach drauf springt und sagt, ich investiere das jetzt. Sondern die Entscheidung, ob ich investiere, sollte gutes Fundament haben. Und das gute Fundament ist das Wissen über den Markt, über meine Kunden und über die finanziellen Requirements oder die Break Even Rechnung. Und dann ist es eine persönliche Entscheidung. Also da kann ich leider auch nicht helfen. Ich mache mein ganzes Leben lang schon irgendwelche Produkte nebenbei. Ich mache das einfach gern. Manche wollen das nicht und das ist ja auch legitim. Aber genau darum ist es wichtig, so eine Rechnung durchzuführen."
    },
    {
      "end": 2825550,
      "speaker": "A",
      "start": 2821590,
      "text": "Gut, irgendwas muss halt die Miete zahlen. Also gut, in Deutschland haben wir aber."
    },
    {
      "end": 2848560,
      "speaker": "B",
      "start": 2825550,
      "text": "Du hast ja gesagt, Bootstrap neben dem normalen Job zum Beispiel, ist ja durchaus möglich. Aber auch dann investiert man die Zeit. Also dann hast du weniger Freizeit, du hast dein Wochenende nicht, wie viele Stunden du auch immer investierst. Ist auch ein gutes Modell, wenn man so eine Break even Rechnung hat, weil man weiß, wie viele Stunden man zum Beispiel investieren muss, um einen neuen User zu bekommen, falls man das überhaupt schon weiß, aber man kann ja auch da Schätzungen eingeben."
    },
    {
      "end": 2860720,
      "speaker": "A",
      "start": 2848560,
      "text": "Aber ist meine Idee nicht immer die Idee, auf die alle gewartet haben? Denn ich kann nicht der einzige sein, der dieses Problem hat, oder? Also es muss doch etliche Leute geben, die so sind wie ich, die genau das Problem haben und ich habe die Lösung."
    },
    {
      "end": 2865160,
      "speaker": "B",
      "start": 2860720,
      "text": "Das hast du schön formuliert, aber du hast wahrscheinlich wirklich den Gedanken mit all deinen Ideen bisher gehabt, oder?"
    },
    {
      "end": 2866280,
      "speaker": "A",
      "start": 2865160,
      "text": "Oft du nicht."
    },
    {
      "end": 2881720,
      "speaker": "B",
      "start": 2866440,
      "text": "Jetzt hast du ein Produkt gebaut, Source Control, es ist ja auch online meines Wissens, haben wir auch im Podcast schon öfters drüber gesprochen. Wie viele Leute sind auf dich zugestürmt und wollten dir das aus den Händen reißen, wie du es auf den Markt gebracht hast? Weil es warten ja alle auf dein Produkt, oder?"
    },
    {
      "end": 2885670,
      "speaker": "A",
      "start": 2881720,
      "text": "Auf den Markt gebracht heißt, ich habe die Website online geschossen oder zum Beispiel."
    },
    {
      "end": 2893950,
      "speaker": "B",
      "start": 2886150,
      "text": "Eben du sagst ja, ich mache eine domain, heutzutage suchen alle nach irgendwas. Seo, du hast eine domain, kommen die Leute selber rein."
    },
    {
      "end": 2900830,
      "speaker": "A",
      "start": 2893950,
      "text": "Ja, ich glaube, mein Problem ist, die brauchen alle mein Produkt, doch die wissen nicht, dass es gibt. Vielleicht ist es das oder anders."
    },
    {
      "end": 2903590,
      "speaker": "B",
      "start": 2900830,
      "text": "Also nur mehr SEO, dann ist alles gut."
    },
    {
      "end": 2909830,
      "speaker": "A",
      "start": 2903750,
      "text": "Es wurde mir noch nicht bewiesen, dass das nicht der Fall ist. Wenn die von meinem Projekt wüssten, dann."
    },
    {
      "end": 3035940,
      "speaker": "B",
      "start": 2909910,
      "text": "Also auch das war meine Erfahrung. Es interessiert sich absolut niemand dafür. Für deine Produkte sucht niemand danach und Geld will sowieso niemand ausgeben. Das war eigentlich so bei allen Produkten bisher das Problem, zumindest zu Beginn. Interessanterweise jetzt ändert sich zum Beispiel bei Open Podcast gerade, dass uns Leute anschreiben, noch dazu englischsprachige Leute, obwohl wir nur deutsche Webseiten haben, die scheinbar wirklich einen Need haben, sich die Webseite übersetzen lassen und aus irgendeinem Grund sie auch finden über Google und uns jetzt wirklich anschreiben. Und das sind natürlich super Kunden, weil wenn die sich denn mehr Aufwand geben und dich anzuschreiben, die Webseite übersetzen und dann E Mail Verkehr auf sich nehmen, nur damit sie irgendwas kaufen können, da weißt du, das sind Kunden, die wirklich ein Problem haben und das auch lösen wollen. Das ist natürlich super, wenn du das hast, aber warum das jetzt plötzlich passiert, weiß nicht so genau. Vielleicht ist es wirklich SEO auf lange Sicht. Auf jeden Fall passiert es gerade und sowas ist natürlich super, aber hat auch sehr lange gedauert und sind jetzt auch nur bar, die er an der Hand abzählen kann. Aber es zeigt auf jeden Fall schon, dass es Leute gibt, die die sowas brauchen. Ist halt immer die Frage, wie viel sind es dann insgesamt? Ist es ausreichend oder nicht? Wie schwierig es ist, ein Produkt an die Frau und den Mann zu bringen. Ich habe es jetzt schon erwähnt, mit f online, mit der Führerscheinplattform, das war schwierig, aber wir haben das auch jetzt gerade erlebt. Also bei dem Energieprojekt, was wir da haben, da geht es eigentlich darum, dass sich die Leute fünfzig bis ein hundert Euro sparen können, ohne dass sie viel machen müssen. Sie müssen sich nur da wo registrieren. Wenn du die Leute willst du dir fünfzig Euro sparen? Dann sagen naja, eigentlich nicht so wichtig, hab kein Interesse. Wo du dir so what the fuck, du musst fünf Minuten investieren, du musst nur deinen Stromzähler wo eingeben, kannst dir fünfzig bis siebzig Euro sparen. Das interessiert die Leute nicht. Das heißt auch da wieder, wenn du kein Problem triffst, dass die Schmerzen haben tagtäglich, dass sie dir freiwilligen E Mail schreiben, damit du ihr Problem löst, dann hilft es auch nicht, wenn du fünfzig Euro Ersparnis irgendwo hast. Und das ist sogar null Risiko. Also ich hätte mir das nicht geglaubt. Ich habe mir gedacht, das ist doch kein Problem, wenn du den Leuten erklärst, sie können Geld sparen ohne Mehraufwand, ohne Risiko."
    },
    {
      "end": 3040860,
      "speaker": "A",
      "start": 3035940,
      "text": "Hast du da nicht die falsche Zielgruppe? Denn du hast ja eindeutig mit Leuten gesprochen, die Geld wie Dreck haben."
    },
    {
      "end": 3073530,
      "speaker": "B",
      "start": 3040940,
      "text": "Das Problem ist, was wir gemerkt haben, dass die Leute in einer Komfortzone sind. Sie müssen sich bewegen, sie müssen sich mit was beschäftigen. Sie vertrauen dir ja nicht. Du bist ja da dahergelaufener im ersten Moment. Das heißt, sie müssen checken, wer bist du, bist du vertrauenswürdig? Sie müssen sich erkundigen, was ist es eigentlich genau? Leute unterschreiben ja ungern Sachen. Das heißt, sie müssen aus ihrer Komfortzone raus, sie müssen sich bewegen, sie müssen eine gewisse Zeit investieren, auch wenn es nur fünfzehn Minuten sind, machen Leute nicht für fünfzig. Würdest du für fünfzig dich jetzt irgendwie bewegen? Vermutlich auch nicht."
    },
    {
      "end": 3079890,
      "speaker": "A",
      "start": 3073690,
      "text": "Da stelle ich mir aber auch die bin ich die richtige Zielgruppe, oder. Also ich weiß, dass ich nicht Geld wie Dreck habe."
    },
    {
      "end": 3218710,
      "speaker": "B",
      "start": 3079890,
      "text": "Also wir haben auch mit Leuten gesprochen, die jetzt weniger Geld haben offensichtlich. Aber auch da ist es einfach fünfzig, die Unsicherheit, der Mehraufwand scheinbar nicht so wichtig in dem Fall. Es hängt natürlich auch bisschen ab, wo die Leute wohnen bei uns. Das ist noch mal so eine, so ein Requirement. Das heißt, du kannst nicht absolut jede Person fragen, aber ich wollte nur noch mal demonstrieren, wie schwierig das ist, obwohl wir Geld verschenken quasi. Wie schwierig es ist, an Leute zu kommen, obwohl wir Geld verschenken. Ich hatte auch einmal ein Projekt, wo es um eine Suchmaschine gegangen ist für den lokalen Handel. Das wäre auch gewesen, dass die Händler kostenlos mitmachen können, die brauchen sich nicht mal registrieren in dem Fall. Und wir hatten da einmal so eine Erfahrung, wo wir in ein Geschäft reingegangen sind, so Einzelhandel und das kurz so einer Mitarbeiterin gepitcht haben, haben wir nicht gewusst, dass das die Mitarbeiterin ist, haben gesagt ja, lokaler Handel unterstützend und so weiter. Und die hat nur gesagt, ja, ihr könnt mal mit der Chefin sprechen, aber sie kann uns jetzt schon sagen, das wird nichts. Und wir haben ja, kann nicht so schlimm sein. Und wo ist die Chefin? Und sie hat uns dann rübergeleitet zur Chefin und die Chefin ist ausgezuckt, hat schreien angefangen raus aus meinem Geschäft, ich habe kein Interesse, geht raus, das ganze digitale scheiß Zeug, raus aus meinem Geschäft. Wirklich hat brüllen angefangen, ohne dass wir irgendwas gesagt haben. Wir haben es noch probiert, aber war keine Chance. Da wirst du dir auch denken, dass es sowas gibt, du wirst was gratis anbieten. Aber auch da wieder, die Leute müssen sich bewegen, müssen es verstehen, haben natürlich auch das Problem, dass vielleicht schon zehn vorher da waren, die ihr was verkaufen wollte. Da gibt es ja ganz viele, die was verkaufen wollen. Wir kennen alle die Anrufe, die Cold Calls, also auch da ist es nicht so leicht Sachen zu verkaufen und darum ist der Sales Prozess eigentlich das schwierigste an jedem Produkt meiner Meinung nach. Und wir haben immer noch nicht über eine Zeile Code gesprochen, sondern mal mit Leuten sprechen, schaffe ich es irgendwem ein Produkt anzudrehen, dass der ja, ich will Geld investieren, ich würde das kaufen oder ich kaufe es. Du kannst ja auch sagen, es gibt schon und danach kannst du es programmieren, aber bis zu diesem Zeitpunkt brauchst du eigentlich keine Zeile Code schreiben. Und das ist das große Problem, wenn du ein Business aufbauen willst, dass die Leute eben nicht durchhalten bis zu dem Punkt, ohne eine Zeile Code zu schreiben. Aber meiner Meinung nach brauchst du das, um mal die Grundidee überhaupt zu verifizieren."
    },
    {
      "end": 3244650,
      "speaker": "A",
      "start": 3218710,
      "text": "Von den zehn Produkten, wo wenn es geklappt hätte, es ein digitales Produkt geworden wäre. Wie viel Produkte hast du vorher schon gebaut? Wie viel an wie viel Produkten hast du vorher eine Zeile Code geschrieben, bevor du all diesen, diese Interviews, diesen Ratschlag, den du jetzt hier gibst, bereits gemacht hast? Also wie oft hast du diesen Fehler bereits gemacht? Weil jetzt gerade mit dem stationären Handel, mit dem Yellow, was du erwähnt hast, da erinnere ich mich auf jeden Fall eine Landingpage gesehen zu haben und da."
    },
    {
      "end": 3367150,
      "speaker": "B",
      "start": 3244650,
      "text": "War, das war voll funktionsfähig, das war mit Elasticsearch, mit Apps, mit Android Apps, mit allem möglichen, damit man es im Geschäft auch demonstrieren kann. Natürlich alles im Vorhinein gebaut, klar. Also ich glaube, wenn ich mir das so durchüberlege, Open Podcast war schon recht gut, da haben wir die ganzen Interviews zuerst geführt, auch mit der Open Source Förderung, die wir bekommen haben. Da haben wir natürlich da probiert, das genauer festzustellen. Auch da hatten wir ganz andere Ideen mit einem offenen Standard für Podcast und so weiter noch zusätzlich zu machen. Haben wir aber sofort gemerkt, okay, funktioniert nicht. Gibt es teilweise schon, haben dann eben einen Pivot gemacht oder zumindest den Fokus geändert auf die reinen Statistiken und Auswertungen. Also da haben wir das teilweise gemacht. Jetzt bei dem Energieprojekt Transfer Energy machen wir es noch intensiver meiner Meinung nach, auf den Business Case zu schauen und den auch wirklich durchzurechnen. Und da haben wir jetzt noch keine Zeile Code geschrieben. Was bei dem Projekt jetzt, muss ich sagen, auch ganz hilfreich ist, ist die ganze Chat GPT und Co Sache, weil du viel schneller Sachen verifizieren kannst. Du kannst mit gewissen Daten einfach schneller Berechnungen durchführen, brauchst da nicht selber irgendein Code schreiben, Python Programm, das dir irgendwelche Daten analysiert. Also da bist du auch in dem Zug schneller, weil das wären ja auch schon Codezeilen. Wobei das finde ich, ist okay, wenn man mit Daten arbeitet, probiert den Case zu berechnen, zu verifizieren, das ist natürlich schon okay, aber App an sich, da gab es noch keine Zeile Code. Also man merkt schon, von allen Projekten, die ich gemacht habe, es ist immer weniger geworden, wo ich in Vorleistung gegangen bin. Es gibt ja auch die Extremansicht, die vertritt zum Beispiel der Hendrik, den wir auch schon mal im Podcast hatten, unseren YouTube Star, der sagt, eine Idee existiert am Blatt Papier und wird erst dann umgesetzt, wenn ein VC zusagt oder sagt, das ist eine gute Idee und erst ab dann wird programmiert. Also das ist sogar noch eine extremere Ansicht. Bevor kein Geld fließt, wirklich echtes Geld von dem VC, wird keine Zeile Code programmiert. Und ich glaube, grundsätzlich ist es schon gut in die Richtung zu denken, auf jeden Fall ambitioniert."
    },
    {
      "end": 3395500,
      "speaker": "A",
      "start": 3367630,
      "text": "Dem Techniker, der coden kann, juckt es jedoch in den Fingern, weil das ist, wo man Meta machen kann, das ist, wo es bequem ist, das ist da, wo man sich auskennt. Fremde Leute anschreiben, mit fremden Leuten in Call springen, Interviews zu machen oder vielleicht sogar in ein lokales Geschäft zu gehen und dann rausgejagt zu werden, ist natürlich dann schon ein Schritt aus der Komfortzone. Das bringt mich aber dann zu der Wie finde ich denn die ersten Kunden, die zumindest nicht meine Freunde sind oder nicht meine Mutter?"
    },
    {
      "end": 3554820,
      "speaker": "B",
      "start": 3395500,
      "text": "Ja, und das sollten sie auch nicht sein, weil die sagen natürlich immer ja. Und auch die findest du sowas cool? Findest du eine Lösung in dem Bereich hilfreich? Sagen alle natürlich ja, aber die Frage ist ja, zahlen sie danach dafür? Bei Open Podcast haben uns auch alle gesagt, natürlich wäre es cool die Statistiken von Spotify und Apple in einem System zu haben, aber wer dann Geld dafür ausgibt, das ist dann eine ganz spezifische Zielgruppe. Also auch da immer die Frage möglichst konkret, würdest du Geld ausgeben? Wie viel Geld? Oder man merkt es zum Beispiel auch, wenn man mit Leuten spricht, die das Problem wirklich haben. Also wir hatten das bei Open podcast, wir machen ja so PDF Reports automatisiert und wir hatten mit Leuten gesprochen oder Mitarbeiterinnen so in Agenturen, die diese Reports wöchentlich manuell erstellen. Das heißt, die sitzen Stunden vor dem Bildschirm, machen copy paste, kopieren Werte raus, erstellen da irgendwie ein PDF Report. Wenn du denen gesagt hey, wir automatisieren das, dann hast du so ein Leuchten in den Augen gesehen, da brauchst du gar nicht würdest du Geld ausgeben, weil du weißt, diese Person sitzt fünf Stunden jede Woche dran, das Ding zu machen. Wenn die dreiig Euro zahlen können, damit sie diese fünf Stunden wegbekommen, das ist ein no Brainer für die. Da siehst du das in den Leuchten in den Augen. Also wenn du sowas erreicht hast, dann hast du einen guten Kunden gefunden. Wie du die Kunden findest, natürlich bei den Interviews schon und sonst wirklich rausgehen, Sales machen, wirklich die Leute besuchen, anrufen, E Mail schreiben, was es auch immer ist, aber du musst aktiv Sales betreiben und auch da wieder möglichst manuell zu Beginn nichts automatisieren, nicht schon eine App programmieren, schreiben. Also es gibt auch zum Beispiel als Paradebeispiel von Stripe diese Bezahlplattform, die ja bekannt ist, dass sie sehr developer freundlich ist, weil sie so viele Hilfsdokumente hat. Einfach zu verwenden ist API first und ganz beliebt dementsprechend bei den Entwickler innen ist, wie die begonnen haben. Die sind zu den Leuten hingegangen ins Büro mit einem Laptop, haben sich neben die gesetzt und haben zusammen die erste Implementierung mit denen gemacht von der API. Das heißt, die sind neben denen gesessen und haben quasi die Hilfe zur Verfügung gestellt, weil es noch keine ausgiebigen Hilfe Seiten gegeben hat. Also die haben einfach ganz viel Zeit manuell investiert. Do things that don't scale zu Beginn, weil wenn du dann drauf kommst, das ist die Lösung, dann kannst du es automatisieren und dann kannst du das ganze möglichst automatisch lösen. Aber zu Beginn einfach ganz klassisch mit Leuten sprechen und es wiederholt sich. Es ist mit Leuten sprechen und die Informationen einzuholen. Und wenn es nur ist, dass du jemanden vor Ort gemeinsam hilfst, das Problem zu lösen, vielleicht noch komplett manuell oder mit einem manuellen Skript oder überhaupt Hardcode, bevor du irgendwas automatisierst."
    },
    {
      "end": 3559060,
      "speaker": "A",
      "start": 3554820,
      "text": "Jetzt könnte man sagen, in dieser Podcast Episode haben wir noch gar nicht die Technik erwähnt, aber doch, haben wir nämlich."
    },
    {
      "end": 3561260,
      "speaker": "B",
      "start": 3559060,
      "text": "Immer nur, wenn es gut, dass wir die Technik nicht."
    },
    {
      "end": 3577620,
      "speaker": "A",
      "start": 3561740,
      "text": "Ja doch, wir haben sie erwähnt, aber immer nur im negativen Sinne. Du hast irgendwie was komplettes Administrationsplattform für eine Fahrschule gebaut, du hast irgendwelche Elasticsearch Packets genutzt und wurdest aus Geschäften gejagt. Also du hast ziemlich viel Wert erstellt, Wert vernichtet und der Wert hat niemals das Licht der Welt erblickt."
    },
    {
      "end": 3578700,
      "speaker": "B",
      "start": 3577620,
      "text": "Genau, es ist eine große Back."
    },
    {
      "end": 3599490,
      "speaker": "A",
      "start": 3579090,
      "text": "Jetzt denke ich mir, das ist zwar alles schön und gut, du redest hier von total addressable market, du redest hier von some und som, du redest hier von lean Start up Büchern, von irgendwelchen ganz populären Leuten, du redest von Methoden wie einem lean Canvas, du redest von Customer Interviews und ist es ein Problem?"
    },
    {
      "end": 3629050,
      "speaker": "B",
      "start": 3600050,
      "text": "Den Lean Canvas habe ich noch gar nicht erwähnt, fällt mir gerade ein, ist jedem zu empfehlen, ist glaube ich auch in dem Buch, wenn man nicht alles täuscht, kann man einfach mal googeln. Ist eine einzige Seite mit ein paar Feldern und man muss dann alle Felder ausfüllen. Und die Felder sind ungefähr das, was ich jetzt alles beschrieben habe. Wer ist der Kunde? Wie erreiche ich den Kunden? Was ist mein Problem? Was ist die Lösung? Wo bin ich einzigartig? Wie schaut die Kostenstruktur aus, wie mein Marketing? Und so weiter. Kann man mal googeln, Lean Canvas, super."
    },
    {
      "end": 3647170,
      "speaker": "A",
      "start": 3629450,
      "text": "Praktisch, wenn ich abends nicht schlafen kann, dann gehe ich auch mal auf ChatGPT und sage, okay, ich habe diese Idee, generiere mir einen Businessplan und dann bin ich relativ schnell weggepennt. Also ist fast besser als Schaftabletten. Deswegen komme ich jetzt mal mit einer alternativen Sichtweise. Warum baue ich nicht einfach eine Landingpage, jagd die über Social Media und Schau, ob sich Leute registrieren."
    },
    {
      "end": 3676450,
      "speaker": "B",
      "start": 3647170,
      "text": "Ja, ist perfekt. Du hast noch nichts gecodet und du verifizierst, ob dein Produkt funktioniert. Am besten hast du noch einen Buy Button dazu und schaust mal, wie das Ganze funktioniert. Das haben wir bei Open Podcast jetzt auch seit einiger Zeit. Du kannst direkt, ohne irgendwas anzugeben, deinen Account verknüpfen mit unserem System. Und wenn das Leute machen, dann wissen wir schon, okay, denen scheint es mal ernst zu sein, da irgendwie einen Account zu verknüpfen, ihre Daten zur Verfügung zu stellen, preiszugeben und dann kontaktieren wir die Leute."
    },
    {
      "end": 3682570,
      "speaker": "A",
      "start": 3676450,
      "text": "Aber ich mein, da muss ich keine Customer Interviews führen, da muss ich keine Termine ausmachen, da muss ich nicht mit Leuten sprechen, denn wir wissen alle, wir hassen alle Leute."
    },
    {
      "end": 3716270,
      "speaker": "B",
      "start": 3682570,
      "text": "Ja, ist qualitativ versus quantitativ. Und ich persönlich bevorzuge qualitative Interviews zu Beginn, vor allem, weil du halt da mehr Feedback bekommst. Wo ist das eigentliche Problem? Wenn du zu einem späteren Zeitpunkt das Problem schon genauer eingegrenzt hast und eine Lösung für das Problem gefunden hast, dann kannst du noch mal quantitativ rausgehen und vielleicht überprüfen, wie viele Leute würden jetzt wirklich dafür zahlen? Also wie viele Leute sind am Markt? Wie viele finde ich sehr schnell? Also das ist schon eine gute Variante. Aber um rauszufinden, wie das Produkt überhaupt aufgebaut sein soll, da ist meiner Meinung nach qualitativ besser geeignet."
    },
    {
      "end": 3730740,
      "speaker": "A",
      "start": 3716670,
      "text": "Alternative Sichtweise Nummer zwei warum Vibecode ich einen kompletten Prototyp nicht an einem Wochenende, ist gegebenenfalls sogar schneller als all deine Research und deine Interviews. Ich meine, diese Methode gab es zu dem Zeitpunkt, als das Lean Startup Buch von Eric Reed rauskam, ja noch gar nicht."
    },
    {
      "end": 3750690,
      "speaker": "B",
      "start": 3731300,
      "text": "Kannst du grundsätzlich machen, auch wenn du das Produkt schon genauer eingegrenzt hast. Meiner Meinung nach. Wenn du natürlich zu Beginn anfängst, würde ich einfach doch noch mit echten Menschen sprechen, um das Feedback zu bekommen. Aber kannst du natürlich machen. Das ist quasi die was früher die Landingpage war, ist heutzutage vielleicht schon der Prototyp mit den heutigen Möglichkeiten."
    },
    {
      "end": 3763530,
      "speaker": "A",
      "start": 3750690,
      "text": "Jetzt kommen wir mal zur Reflexion nach den zehn Produkten. Wenn wir deine ich verkaufe illegal Pepsi aus irgendeinem Schulspind als Produkt sehen, machst du es alleine oder machst du es im Team? Was ist deine Erfahrung von den letzten zehn Produkten? Weil da war so viel ich weiß, beides bei."
    },
    {
      "end": 3820020,
      "speaker": "B",
      "start": 3763530,
      "text": "Also ich muss jetzt gerade mal nachschauen, ob ich da überhaupt eines alleine gemacht habe. Aber ja, Yellow habe im Prinzip alleine gemacht und habe Leute dann angestellt, teilweise für Sales, was auch ein großer Fehler war. Also abgesehen von meinen Jugendprojekten, die natürlich alleine gemacht habe, waren alle Projekte irgendwie mit Leuten zusammen. Und das ist eigentlich auch mein klarer Take bei dem Ganzen. Nur im Team. Also meiner Meinung nach kann man Produkte nur im Team bauen, weil man sonst die Motivation verliert. Es braucht immer einen zweiten, um irgendwie Ideen ping Pong zu machen. Wenn einer down ist, ist der andere mal da, um einen wieder hochzukicken. Und im Idealfall hast du einfach dann noch in dem Team unterschiedliche Expertise. Und wenn du natürlich ein Team hast, was divers ist und es gibt Leute, die kennen sich in Sales aus, die anderen im Business. Du bist die technische Person, dann hast du sowieso einen Lotto Jackpot im Prinzip gemacht. Und der einzige Grund, warum dieser Podcast noch existiert, ist wahrscheinlich, weil wir zu zweit sind."
    },
    {
      "end": 3831500,
      "speaker": "A",
      "start": 3820020,
      "text": "Ach schade. Also Wolfgang du hattest jetzt die Chance, einen Liebesbeweis zu nennen. Du hättest sagen können, der einzige Grund, warum dieser Podcast jetzt hier existiert oder noch existiert, bist du, Andi. Das hättest du sagen können. Du hattest die Chance."
    },
    {
      "end": 3832980,
      "speaker": "B",
      "start": 3831500,
      "text": "Ja, will ja auch nicht lügen, oder?"
    },
    {
      "end": 3842540,
      "speaker": "A",
      "start": 3832980,
      "text": "Okay, die erste Frage hat noch nicht die Gefühlslage getroffen, deswegen kommen wir jetzt mal richtig zur Gefühlslage. Ich habe in dem Intro erwähnt, du schüttest so ein bisschen dein Herz aus."
    },
    {
      "end": 3847580,
      "speaker": "B",
      "start": 3842540,
      "text": "Deswegen haben wir sowieso gedacht, also meine Erfahrungen liegen zwar nicht in meinem Herz, aber egal."
    },
    {
      "end": 3868030,
      "speaker": "A",
      "start": 3849740,
      "text": "Jetzt geht es ab hier. Ab wann sagt man nein, nicht man, ab wann sagst du Wolfgang war nett hier, aber ich höre damit auf. Wann muss man sich eingestehen, es war nicht erfolgreich und wie schwer ist das dann? Trinkst du dann Abschiedsbier, kündigst du die domain und eine Träne fließt oder wie sieht das aus?"
    },
    {
      "end": 4053810,
      "speaker": "B",
      "start": 3868030,
      "text": "Ich fange mal mit einem mit einem positiven Aspekt an. Wenn man es schafft, einen Exit zu machen, also in irgendeiner Form die Sache zu verkaufen, Geld rauszuholen, dann ist es vielleicht ein guter Abschluss. Den hatte ich einmal mit Matthias Endler mit dem Code Prints de gebaut. Hatte ich. Da ist uns das Sales dann auch auf die nerven gegangen und die haben es geschafft, das ganze Produkt zu verkaufen. War auch eine super Erfahrung. Also das ist ja eh das Beste, was einem passieren kann. Sonst, wenn man diese Möglichkeit nicht hat, ist natürlich schwierig. Also man muss sich erstmal durchringen, ein Produkt zu verkaufen. Aber das ist sicher eine gute Möglichkeit, würde ich mal sagen. Also man kann da noch einiges rausholen. Ist natürlich teilweise auch schwierig, je nachdem wie weit man ist, wenn man schon Umsatz hat. Da gibt es so Plattformen wie Acquire, Com oder auch andere. Aber das ist dann schon, wenn man klar definierte SaaS hat, was einfach zu erklären ist. Also wenn man sehr aufwendiges Produkt hat, bin mir nicht sicher, wie einfach man das dort verkaufen kann. Aber es ist auf jeden Fall eine Möglichkeit. Ist auch ganz gut, wenn man sich das mal genau aufschreibt. Was kann das Produkt? Was mache ich derzeit für einen Umsatz und so weiter. Also das kann man ganz allgemein empfehlen, weil dann kann man vielleicht eine Entscheidung treffen. Macht Sinn. Wie viel Zeit investiere ich eigentlich? Was habe ich da aktuell für einen Stundenlohn? Will ich das weitermachen oder nicht? Und dann ist es halt viel Bauchgefühl, muss man auch ganz klar sagen. Also man hat genaue Regeln, dass man sagt OK, nach einem halben Jahr, wenn ich nicht Xy verdiene, dann höre ich auf. Solche Leute gibt es ja auch, die klar sich die Metrik setzen. Ist für mich persönlich sehr schwierig bisher. Vor allem hast du dann auch wieder Apps, wo dann plötzlich neue Kunden dazu kommen oder irgendwie alle wollen etwas. Dann denkst du, ja, jetzt hast du es geschafft, den Hockeystein und dann geht es wieder nach unten. Wie viel Spaß hast du noch an dem Ganzen? Also es sind schon so Sachen, die man abwägen muss. Wenn man zu zweit ist, kann man auch zu zweit darüber sprechen. Ist natürlich auch ganz cool. Ein Freund von mir, der auch im Podcast Bereich unterwegs ist, der ein Startup hat, was sehr gut funktioniert hat. Die zwei Gründer haben sich jetzt entschieden, zum Beispiel alle externen Mitarbeiter zu kündigen und alles wieder selber zu machen, damit der Verdienst im Endeffekt steigt. Die haben sich so entschieden, weiterzumachen. Also nicht in die Skalierung zu gehen, sondern eher wieder zurückzufahren. Möglichkeiten gibt es viele. Ich glaube, was aber auch wichtig ist, ist, dass man das regelmäßig zumindest evaluiert und sich überlegt, ob man noch weitermachen will. Und wenn man natürlich schon Kunden hat, ist es natürlich auch schwierig aufzuhören. Vor allem, wenn du dann so Packages verkauft hast, die über zwei Jahre gehen oder so. Was machst du dann mit diesen Kunden? Zahlst du das zurück? Wartest du das noch ab? Also auch da gibt es dann natürlich Überlegungen, die man treffen muss. Ich persönlich habe keine Standardregel oder Formel zur Anwendung, leider. Und ist sicher eines der schwierigsten Sachen, vor allem, wenn man so viel Zeit investiert hat. Offiziell heißt es ja Sank Cost Fallacy, dass wenn man ganz viel schon investiert hat, dass man dann sich nicht mehr traut aufzuhören oder das sterben zu lassen. Aber es heißt ja auch Kilio Darlings, also irgendwann muss man das dann begraben. Bei Yellow zum Beispiel. Habe dann irgendwann gemerkt, okay, die Traction ist nicht da, die stationären Händler innen wollen das einfach nicht. Also da war einfach zu wenig Rückmeldung da und dann habe ich das für mich beendet."
    },
    {
      "end": 4056490,
      "speaker": "A",
      "start": 4053810,
      "text": "Hast du denn für dich ein Ritual, wie du ein Seitenprojekt beerdigst?"
    },
    {
      "end": 4074170,
      "speaker": "B",
      "start": 4056810,
      "text": "Ja, ich sage meistens, es ist nicht beerdigt, ich lege es mal nur auf Eis und irgendwann ist es dann so lange auf Eis, dass ich sage, okay, jetzt ist eigentlich auch schon egal. Also leider kein sauberes Event oder so, was man vielleicht machen könnte. Wenn man zu zweit an was arbeitet, hat man das vielleicht eher oder als Team."
    },
    {
      "end": 4079910,
      "speaker": "A",
      "start": 4074170,
      "text": "Hast du denn schon mal etwas zur Seite gelegt, dauerhaft zur Seite gelegt, nicht beerdigt und die später gedacht, fuck, hätte ich mal weitergemacht?"
    },
    {
      "end": 4110280,
      "speaker": "B",
      "start": 4079910,
      "text": "Ich hatte das ganz oft mit Ideen, die ich hatte. Und dann später habe ich irgendwann gehört, irgendwo groß in der Zeitung, gestanden hey, tolles, cooles Startup, macht jetzt genau meine Idee. Aber da bin ich nie so weit gekommen. Also das ist meistens bei der Idee geblieben und früher hat mir das noch geärgert und mittlerweile denke ich mir einfach, ist ganz klar, du brauchst den Atem, du musst da durchhalten, um das überhaupt an den Start zu bringen. Und das ärgert mich jetzt eigentlich überhaupt nicht mehr, weil ich weiß, wie schwierig es ist, ein Produkt an den Start zu kriegen. Also da habe ich eigentlich kein Problem mehr damit."
    },
    {
      "end": 4121280,
      "speaker": "A",
      "start": 4110280,
      "text": "Jetzt müssen wir aber auch noch mal hier tacheles reden, denn wir sind ja ein Podcast mit Fakten und mit tiefen Einblicken. Du hast gerade von Exit geredet, Wolfgang, hast du ausgesorgt oder wie viel Geld ging da über die Datentheke?"
    },
    {
      "end": 4206599,
      "speaker": "B",
      "start": 4121440,
      "text": "Das wäre schön. Wir haben das ja code prints de v glücklicherweise an eine befreundete developer Agentur verkauft, die das dann als internes Projekt weitergeführt haben, weil die für Leerzeiten gerne ein Projekt gehabt hätten, wenn sie sonst keine Aufträge haben. Und die haben das natürlich auch cool gefunden. Wir haben es uns damals ausgerechnet. War bisschen schwierig, aber wir haben es so probiert, über den Stundensatz zu rechnen. Wie viel Stunden haben wir investiert ungefähr? Ich persönlich mache immer Time Tracking, das heißt, ich kann es relativ genau sagen. Und dann haben wir so die Stunden abgeschätzt und haben dann einen niedrigen Stundensatz gewählt. Und so sind wir dann auf den Verkaufspreis gekommen. Aber es war sicher kein Stundensatz, den wir jetzt sonst aufrufen würden. Aber es war auch nicht so, dass wir unter Mindestlohn gewesen wären. Also es war so was, wo man gesagt hat, cool, jetzt haben wir es nicht umsonst gemacht. Wir haben sogar ein bisschen Geld noch bekommen für unsere Stunden, haben viel dabei gelernt. Es war ein cooles Projekt und wir hatten wirklich viel Spaß dabei. Und das war vielleicht fast eines der erfolgreichsten Projekte, würde ich so sagen, wenn man jetzt nicht aufs finanzielle blickt, aber so aufs Gesamte. Es war relativ kurz, man hat viel gelernt, man hat Spaß gehabt, es war ein cooles Projekt und man hat es auch noch verkaufen können. Und es lebt auch noch weiter bei anderen Entwickler innen, was natürlich auch nicht immer gegeben ist, weil wenn es irgendein Investor übernimmt, dann wird er das einstampfen oder so, womöglich in kürzester Zeit. Und so ist es eine coole Idee, die umgesetzt wurde und auch noch weiterlebt."
    },
    {
      "end": 4215650,
      "speaker": "A",
      "start": 4206599,
      "text": "Für welche Partei bist du gleich noch mal in der Politik aktiv? Reden wir jetzt von hoch vierstellig oder niedrig fünfstellig? Du hast die Frage einfach nicht beantwortet. Du hast die Preisfindung erklärt."
    },
    {
      "end": 4218610,
      "speaker": "B",
      "start": 4215890,
      "text": "Ja, es kommt ja auch darauf an, wie viele Stunden wir investiert haben, oder?"
    },
    {
      "end": 4229570,
      "speaker": "A",
      "start": 4218610,
      "text": "Und deswegen sehe ich, Herr Politiker, ich hoffe, also an alle Hörerinnen und Hörer, der Wolfgang tippt gerade irgendwas ein und guckt irgendwas im Browser. Ich hoffe, der macht gerade sein Bankkonto auf und guckt auf die Überweisung."
    },
    {
      "end": 4234450,
      "speaker": "B",
      "start": 4230050,
      "text": "Naja, ich probiere gerade herauszufinden, wie viele Stunden wir damals investiert hatten."
    },
    {
      "end": 4242079,
      "speaker": "A",
      "start": 4234450,
      "text": "Also du möchtest mir sagen, sorry, das glaubt dir kein Mensch. Du möchtest mir sagen, du hattest einen Exit, du hast es sogar so benannt und kennst die Summe nicht mehr."
    },
    {
      "end": 4261639,
      "speaker": "B",
      "start": 4242239,
      "text": "Ja, natürlich kenne ich die Summe, aber ich weiß nicht, ob der anderen Partei das recht ist, dass ihr da jetzt irgendeinen Preis sagt. Egal ob es der Matthias ist oder der Käufer. Aber wir hatten um die vier, fünf hundert Stunden, glaube ich so veranschlagt. Dann kannst du es dir ja ungefähr ausrechnen. Aber es war ein niedriger fünfstelliger Betrag."
    },
    {
      "end": 4272340,
      "speaker": "A",
      "start": 4261639,
      "text": "Okay, wir machen vier hundert fünfzig Stunden mal fünfzig. Da bin ich hier bei niedriger fünfstelliger Betrag, würde ich sagen, passt."
    },
    {
      "end": 4278420,
      "speaker": "B",
      "start": 4272740,
      "text": "Du bist ja fast wie der Westermeier von UMR, der probiert es dann immer, sich irgendwie so herzuleiten und du bist."
    },
    {
      "end": 4299510,
      "speaker": "A",
      "start": 4278420,
      "text": "Ein anderer Extrem der Politiker, der nicht die Fragen beantwortet. Wir sind hier ein Podcast mit Mehrwert. Wir müssen uns mal auf die Ebene heben und den Hörerinnen und Hörern die Möglichkeit geben zu ist es mir der Arbeitsaufwand für Euro wert, eine Plattform wie Codeprints de v zu schreiben als side Project?"
    },
    {
      "end": 4306590,
      "speaker": "B",
      "start": 4299670,
      "text": "Ja, das ist die Frage, das musst du dir natürlich die Gedanken machen. Vor allem wenn du sowas machst, dann rechnest du eigentlich nicht mit dem Exit."
    },
    {
      "end": 4311590,
      "speaker": "A",
      "start": 4306590,
      "text": "Okay, ich merke schon, die Antwort kriege ich jetzt nicht. Wir bleiben bei Euro. Lassen wir das weiter."
    },
    {
      "end": 4319430,
      "speaker": "B",
      "start": 4311750,
      "text": "Übrigens fünfzig Euro ist ein guter Satz. Also wenn du bei einem side Project am Ende fünfzig Euro Stundensatz raus bekommst, ist nicht schlecht, würde ich mal sagen."
    },
    {
      "end": 4322790,
      "speaker": "A",
      "start": 4319750,
      "text": "Du hast mir gerade was von ein hundert dreiig Euro super brutto erzählt."
    },
    {
      "end": 4344710,
      "speaker": "B",
      "start": 4323350,
      "text": "Ja klar. Wenn du das vergleichst mit einem normalen Job. Darum ist halt die Frage, willst du deinen normalen Job wirklich kürzen auf dreiig Stunden und was eigenes machen? Weil realistisch, du bekommst halt vielleicht so dreiig Prozent am Ende raus für einen Stundensatz, sogar wenn du erfolgreich bist. Also im Normalfall bekommst du gar nichts und wenn du erfolgreich bist, halt vielleicht dreiig vierzig Prozent von deinem normalen Gehalt, wenn überhaupt."
    },
    {
      "end": 4374950,
      "speaker": "A",
      "start": 4344790,
      "text": "Meine nächste Frage wäre gewesen, ab wann ist ein Produkt für dich erfolgreich? Aber du sagtest ja gerade das Code prints de jetzt vielleicht nicht vom finanziellen, aber ich meine sehr wahrscheinlich noch durch zwei blablabla aber ist schon sehr viel Geld, finde ich. Aber du sagtest, das ist das erfolgreichste Projekt so in der kompletten Geschichte. Du hast etwas gebaut, es haben Leute gekauft und irgendjemand hat einen Mehrwert in dem Produkt gesehen und hat es dann weitergeführt oder nicht. Ist auf jeden Fall noch online."
    },
    {
      "end": 4432870,
      "speaker": "B",
      "start": 4375630,
      "text": "Ich meine, das coolste an Codeprints war schon, wenn man gesehen hat, dass ganz bekannte Entwickler innen so ein Code Prints Druck von der GitHub History gekauft haben und dann auf Twitter gepostet haben. Also später, nachdem wir es dann verkauft haben, hat es auch der DH zum Beispiel, der Erfinder von Rails auf Twitter gepostet und andere Entwickler, die halt so wirklich paar hunderttausend Follower haben und haben das dann stolz präsentiert, wie das auf ihrem Schreibtisch steht. Und wir haben coole Fotos bekommen aus Japan und aus Singapur, die wirklich auf einem perfekt eingerichteten Schreibtisch da diesen diesen Print stehen gehabt haben. Und das war natürlich wirklich cool, weil du wusstest, okay, du hast was gebaut, was die Leute wirklich cool finden und sogar was eigentlich keine Mehrwertschaft, sondern was einfach schön aussieht und wo Leute Spaß dran haben. Und das war natürlich schon ein cooles Gefühl, aber am Ende war es dann durch auch sehr viel Sales Aufwand und das zu skalieren, das ist dann eigentlich die Schwierigkeit. Und da wollten wir dann auch beide nicht mehr Zeit investieren."
    },
    {
      "end": 4445390,
      "speaker": "A",
      "start": 4432870,
      "text": "Und meine letzte Frage wie du die ganze Thematik siehst, wie stehst du zu dem Thema mehrere Wetten versus Fokus, also viele kleine Dinge oder eine Big Bat? Tanzt du auf zu vielen Hochzeiten?"
    },
    {
      "end": 4482350,
      "speaker": "B",
      "start": 4445390,
      "text": "Wenn ich es könnte, würde ich den Fokus auf eine Sache legen, aber ich bin da sehr schlecht darin, muss man dazu sagen, weil ich bin auch immer offen für Ideen und sage vielleicht auch oft zu ja zu irgendwem und probiere dann mal Sachen aus, dass es vielleicht dann teilweise zu viele gleichzeitig sind. Ich probiere das möglichst zu begrenzen. Aber natürlich, wenn du auch laufende Projekte hast, so wie f Online, die Führerscheinplattform ist natürlich schwierig, weil die ist ongoing und das ist nicht viel Aufwand, aber ein bisschen natürlich immer. Aber ich probiere natürlich trotzdem nebenbei neue Sachen aus. Bin aber davon überzeugt, dass umso mehr Fokus du auf ein Produkt oder eine Idee legst, umso besser und umso höher die Chance auf Erfolg."
    },
    {
      "end": 4495110,
      "speaker": "A",
      "start": 4482430,
      "text": "Reality Check aktuell. Wir nehmen am Sonntag den ersten Juno auf. Wie viele Projekte betreibst du gerade zeitgleich? Und f Online ist eins davon, so wie ich das gesehen habe oder so wie das gerade erwähnt hattest."
    },
    {
      "end": 4502030,
      "speaker": "B",
      "start": 4495110,
      "text": "Also neben meinem normalen Job und wenn man den Podcast auch noch mitrechnet, soll ja auch ein Projekt sein. Sind aktuell vier Projekte."
    },
    {
      "end": 4503710,
      "speaker": "A",
      "start": 4502190,
      "text": "Also vier plus dein Job."
    },
    {
      "end": 4514830,
      "speaker": "B",
      "start": 4503950,
      "text": "Genau. Ich sage, ich bin nicht gut im Fokus halten diesbezüglich. Wobei natürlich da immer mehrere Leute mitwirken. Also muss man schon auch sagen, das liegt jetzt nicht alles auf meinen Schultern."
    },
    {
      "end": 4518220,
      "speaker": "A",
      "start": 4514830,
      "text": "Also machst du bei allen vier Projekten ziemlich wenig und die anderen machen immer mehr."
    },
    {
      "end": 4523420,
      "speaker": "B",
      "start": 4520220,
      "text": "Wie war das mit dem Politiker? Ich enthalte mich der Aussage."
    },
    {
      "end": 4528540,
      "speaker": "A",
      "start": 4523500,
      "text": "Wie wichtig denkst du denn, ist der Fokus auf ein Projekt für den Erfolg dieses Projekts?"
    },
    {
      "end": 4543140,
      "speaker": "B",
      "start": 4528620,
      "text": "Wie ich schon gesagt habe, ich glaube, dass der Fokus sehr wichtig ist. Und wenn man den gesamten Fokus auf ein Projekt legen kann, also vielleicht sogar kündigen und alles auf eine Karte setzt, wenn dann alle gleich mitziehen, alle Co Founder in der gleichen Form, dann ist meiner Meinung nach die Chance am höchsten."
    },
    {
      "end": 4582900,
      "speaker": "A",
      "start": 4543140,
      "text": "Wolfgang, vielen lieben Dank dafür. Es hat mir sehr viel Spaß gemacht, unter anderem so Storys zu hören, wie du immer noch Pepsi Dosen aus dem Schulspind verkaufst oder aus einem Geschäft gejagt wurdest. Diese Story kannte ich alle noch gar nicht. Faszinierend. Aber ich finde es schön, dass du wirklich versuchst zu verifizieren, ob es ein Problem ist. Ich weiß nicht, ob mir dies so viel Spaß machen würde. Und ich weiß nicht, ob ich dies annehmen würde für mein nächstes Projekt oder ob ich nicht einfach zu coden würde. Denn speziell, wenn ich mein eigenes Problem löse, dann habe ich ja trotzdem einen Mehrwert, wenn ich code. Weil dann löse ich ja mein eigenes Problem. Und der Erfolg wäre ja dann eigentlich, dass ich mein Problem gelöst habe, was dann der Treiber wäre. Aber ich denke, das ist halt ein."
    },
    {
      "end": 4585380,
      "speaker": "B",
      "start": 4582900,
      "text": "Schlechter Business Case, weil du dich selber nicht zahlst."
    },
    {
      "end": 4586900,
      "speaker": "A",
      "start": 4585380,
      "text": "Das ist korrekt. Das ist korrekt."
    },
    {
      "end": 4595060,
      "speaker": "B",
      "start": 4587140,
      "text": "Oder? Eigentlich schon. Also du zahlst dich ja eigentlich schon selber durch den anderen Job oder was auch immer dann. Aber ein guter Business Case ist meiner."
    },
    {
      "end": 4617740,
      "speaker": "A",
      "start": 4595060,
      "text": "Meinung nach nicht, wenn ihr teilweise genauso gelacht habt wie ich. Lasst es uns doch mal wissen durch eine tolle Bewertung oder einen Kommentar auf Spotify oder in unserer Discord Community. Ich würde mich auf jeden Fall freuen, wenn ihr ähnliche Stories mal beitragt, gerne auch über Social Media. Und ich hoffe, ihr hattet ebenfalls Spaß und habt was mitgenommen. Wolfgang, vielen lieben Dank nochmal an dich und an alle am Audiogerät. Wir hören uns nächste Woche wieder."
    },
    {
      "end": 4628290,
      "speaker": "B",
      "start": 4617900,
      "text": "Ich möchte noch ein Dankeschön loswerden an meinen Banknachbarn damals, an den Georg, der mit mir den Spind geteilt hat, der wirklich keinen Platz mehr hatte. Also ich glaube nicht, dass er zuhört. Aber danke noch mal im Nachhinein."
    },
    {
      "end": 4632970,
      "speaker": "A",
      "start": 4628290,
      "text": "Grüße gehen raus an den Georg. Wir sind weg. Bis zur nächsten Woche und tschüss."
    },
    {
      "end": 4633690,
      "speaker": "B",
      "start": 4633210,
      "text": "Ciao."
    }
  ],
  "webhook_auth": false
}