{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/58ab37e0-8483-4a85-ba79-12fc1ee84dc9/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62x5y4neh0-94f3-4816-ab28-d4a0530c56b5",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Willkommen bei einer neuen Episode des Engineering Kiosks. Habt ihr gewusst, dass von allen, die 2010 einen Job begonnen haben, nach zwei Jahren nur mehr 22% dieselbe Beschäftigung hatten? Auch in der IT- und der Tech-Welt werden Firmenwechsel immer häufiger und oft wird vergessen, wie viel Potenzial im Offboarding und Onboarding-Prozess steckt. Wir besprechen in dieser Episode, wie man als Mitarbeiterin oder Mitarbeiter professionell eine Firma verlässt, auf was man achten sollte und wie man den Einstieg in eine neue Firma beschleunigen und verbessern kann. Dieses Thema betrifft aber natürlich auch Firmen und ManagerInnen, denn auch von dieser Seite gilt es für einen reibungslosen Ablauf einiges zu beachten.",
      "start": 3502,
      "end": 43205,
      "confidence": 0.8275740740740745,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe hier ein GitHub-Repo gefunden, wo Firmen posten, von was auf was die grad migrieren. Das ist ganz interessant.",
      "start": 49775,
      "end": 55947,
      "confidence": 0.6947500000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und, was ist das Spannendste?",
      "start": 56563,
      "end": 57804,
      "confidence": 0.6184,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Tja, da ist halt alles drin, ne. Von irgendeiner Firma von AWS nach Hetzner, irgendjemand von AWS Lambda nach ECS, irgendjemand von PostgreS zu SingleStore, kenne ich jetzt gar nicht.",
      "start": 58024,
      "end": 68067,
      "confidence": 0.6952666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Habe ich auch noch nie gehört, SingleStore.",
      "start": 68107,
      "end": 70408,
      "confidence": 0.34085714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dann einer von React nach Preact, dann einer von Thanos nach Victoria Matrix, DoorDash von Python nach Kotlin.",
      "start": 70428,
      "end": 79511,
      "confidence": 0.7814444444444444,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "SingleStore, 350 Mitarbeiter. Cloud-Native-Database designed for data-intensive applications.",
      "start": 79551,
      "end": 85533,
      "confidence": 0.6275000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also wie jeder Datenberg heute.",
      "start": 86557,
      "end": 88440,
      "confidence": 0.49339999999999995,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau.",
      "start": 88460,
      "end": 89040,
      "confidence": 0.439,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Slack, HAProxy to Android, Percona von Prometheus zu Victoria Matrix und Cloud von PHP nach Golang 21. Interesting. Okay. Ach so, wir nehmen ja schon auf. Sag das doch. Ich bin noch, ich hab gedacht, wir sind noch bei der Hypothase.",
      "start": 89080,
      "end": 102977,
      "confidence": 0.5975609756097564,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay.",
      "start": 102997,
      "end": 103077,
      "confidence": 0.02,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Einen schönen, jetzt wieder sonnigen Tag, Wolfgang.",
      "start": 104919,
      "end": 108961,
      "confidence": 0.8408571428571429,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Schönen Nachmittag.",
      "start": 109001,
      "end": 110582,
      "confidence": 0.399,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Schön, dich wieder am Mikro zu haben. Ich habe mal wieder eine tolle Frage mitgebracht. Und zwar hatten wir ja letztes Wochenende in NRW Landtagswahlen.",
      "start": 110622,
      "end": 118087,
      "confidence": 0.8351199999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du das mitbekommen? Natürlich.",
      "start": 118127,
      "end": 119948,
      "confidence": 0.5014000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ich bin seit Jahren ein Briefwähler. Primär weil, ich weiß nicht, irgendwie ist immer am Vorabend was, was immer bis ganz spät in die Nacht geht, wo das letzte Bier immer schlecht ist und ich dann meist nicht aus dem Bett komme. Deswegen nutze ich die Möglichkeit der Briefwahl. und was mir was mir da aufgefallen ist die also die art und weise wie du eine briefwahl machst ist ja schon gar nicht so unkompliziert also du hast einen wahlzettel und der muss dann in einen anderen umschlag und dann hast du noch einen zettel den musst du unterschreiben dann musst du den umschlag und das unterschriebene nochmal in den umschlag packen und dann erst weg sind.",
      "start": 120088,
      "end": 157767,
      "confidence": 0.7882288135593223,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Übrigens, kleines Funfact, weil du da von dem Umschlag redest. Hast du das mitbekommen, dass wir unsere Bundespräsidentenwahl wiederholen haben müssen, weil der Kleber auf diesen Umschlägen nicht funktioniert hat und dann die Wahl formal nicht gegolten hätte? Und dreimal darfst du raten, woher dieser Kleber kam für die österreichischen Kuverte.",
      "start": 158607,
      "end": 178233,
      "confidence": 0.8120392156862746,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Von 3M aus Deutschland.",
      "start": 178253,
      "end": 180333,
      "confidence": 0.87375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Keine Ahnung, ob es 3M war, aber es war Deutschland, ja.",
      "start": 180373,
      "end": 182534,
      "confidence": 0.6630909090909092,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, ihr habt ja jetzt einen ehemaligen Kanzler, der jetzt in der Startup-Welt unterwegs ist, den würde ich einfach mal fragen, ob Peter Thiel da nicht irgendwie eine gute Lösung für hat.",
      "start": 183474,
      "end": 192239,
      "confidence": 0.76659375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ah, wir sind ganz froh, dass der weg ist, aber okay, was ist mit deinen Umschlägen, ja? Umschläge in Umschläge?",
      "start": 192739,
      "end": 198442,
      "confidence": 0.7432000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So, pass auf, und dann habe ich das rausgesendet.",
      "start": 198482,
      "end": 200383,
      "confidence": 0.72,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt übrigens bei uns Kuvert.",
      "start": 200403,
      "end": 202824,
      "confidence": 0.6426666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Briefumschlag, Kuvert, ja, ich glaube Kuvert sagt man bei uns teilweise auch, aber ich glaube, dass eher, dass die ältere Generation sagt, pack das mal in Kuvert.",
      "start": 202844,
      "end": 210488,
      "confidence": 0.7327407407407407,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder Österreicher.",
      "start": 211062,
      "end": 212143,
      "confidence": 0.7410000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auf jeden Fall habe ich dann meine Stimme abgegeben und habe das in den Postkasten, in den Briefkasten geschmissen. Und dann habe ich die Wahlergebnisse gesehen und da habe ich mich gefragt, hat meine Stimme eigentlich gezählt? Und das ist eigentlich schon total schade, weil wenn ich Briefwahl mache oder auch so, auch wenn ich ins Wahllokal gehe, du weißt ja gar nicht, ob deine Stimme gültig ist oder nicht. Du kriegst ja gar kein Feedback. und dann habe ich mich gefragt wie viele leute machen seit jahr und tag unbewusst ein fehler bei der briefwahl, denken die haben ihre stimme abgegeben und im endeffekt zählt die nicht weil die zum beispiel die unterschrift vergessen haben oder, weil die zweimal unterschrieben haben einmal für sich und haben sich dann noch einmal als selbstberechtigter oder sowas also verstehst du irgend so einen kleinen doofen fehler, Und wie.",
      "start": 212183,
      "end": 262358,
      "confidence": 0.8035616438356163,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Würdest du es lösen?",
      "start": 262398,
      "end": 263838,
      "confidence": 0.606,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe mich nur gefragt, ob ich der Einzige bin, der mir die Frage stellt. Ich muss ja nicht immer einen Lösungsvorschlag haben. Ich muss zugeben, ich weiß es nicht. Vielleicht ist digitale Wahl ein Lösungsvorschlag. Da hat der CCC, glaube ich, aber noch eine ganze Menge mitzureden. So eine richtige Lösung habe ich jetzt nicht.",
      "start": 264078,
      "end": 279361,
      "confidence": 0.7715714285714287,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also mir fällt da ein, wir hatten mal einen sehr coolen Übungsleiter auf der Uni. Das war irgendwas theoretische Informatik, irgendwas Freakiges. Und der war aus Japan und der hatte den Anspruch, dass die Privatsphäre sehr geschützt ist und wollte nicht online irgendwo aufschreiben, wer welche Note bekommen hat oder auch keinen Aushang dann von der Prüfung aushängen mit den Namen. Und was der gemacht hat, ist, dass einfach auf jedem Zettel ein Wort oben gestanden ist, Krokodil, Hamster, irgendwelche Tiere, whatever. Und du hast auf dem Blatt Papier sowieso deinen exam da ausgefüllt und am Ende hast du dir dieses Tier gemerkt, Krokodil zum Beispiel, und beim Aushang beziehungsweise online ist dann einfach gestanden, Krokodil hat eine 4, eine 3, eine 5 oder whatever. Und so hast du sofort die Noten bekommen, hast Zugriff gehabt auf die Noten, ohne dass die Privatsphäre verletzt gewesen wäre. Und das könntest du eigentlich bei den Umschlägen auch machen, wenn du da Krokodil drauf schreibst und dann online irgendwo steht, Krokodil war gültig oder ungültig. dann weißt du das für dich und den Code kennst nur du. Beziehungsweise du bräuchtest das Krokodil glaube ich gar nicht, weil es ist ja beim Umschlag, eigentlich du willst ja nur wissen, ob das angekommen ist und alles gestimmt hat und wenn der Umschlag geteilt wird, getrennt wird von dem inneren Teil, von der Wahlkarte oder von der Wahl, dieses Ding, wo du wirklich drauf unterschreibst oder also wo du das Kreuz machst, wird das ja getrennt und in eine Box geworfen, damit du da keine Nachvollziehbarkeit hast. Aber du könntest in dem Moment eigentlich ja auch checken online, beziehungsweise wird das wahrscheinlich sowieso in den Computer eingetragen, dass der Andi jetzt gewählt hat und das könnte man eigentlich schon online machen, beziehungsweise du könntest dann vielleicht mit deinem Personalausweis zum Beispiel online einsehen, ist meine Wahlkarte eingetroffen. Das müsste eigentlich heutzutage ja schon irgendwo möglich sein und die Daten sind wahrscheinlich irgendwo gespeichert, weil dann könntest du ja doppelt wählen.",
      "start": 279741,
      "end": 397155,
      "confidence": 0.7875688622754491,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich merke schon, das Thema ist schon relevant. Sonst hättest du gesagt, lass mal den Quatsch weg und jetzt beschäftigst du dich damit. Das finde ich toll.",
      "start": 397575,
      "end": 405840,
      "confidence": 0.7303928571428572,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, mal auf jeden Fall besser als die Kürbiskern-Diskussion. Von dem Kürbiskern-Weckel.",
      "start": 405860,
      "end": 410322,
      "confidence": 0.7736666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In der letzten Episode habe ich ein Beschwerd über Kürbiskerne, die runterfallen, wenn ich mein Kürbiskernbrötchen schneide. Heute morgen hat der Wolfgang ein österreichisches Kürbiskernbrötchen geschnitten. Wie nennt sich das bei dir? Weckhal. Weckhal. Erinnert mich irgendwie an Weckmann. Weißt du, was ein Weckmann ist? Nö. Ernsthaft nicht?",
      "start": 410849,
      "end": 428219,
      "confidence": 0.7099583333333331,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nö.",
      "start": 428580,
      "end": 429100,
      "confidence": 0.812,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weißt du, was ein Stütchen ist?",
      "start": 429120,
      "end": 430461,
      "confidence": 0.47150000000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist Brötchen, oder? Das ist Stülle, oder? Wieder was anderes.",
      "start": 430481,
      "end": 437325,
      "confidence": 0.50475,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, wir driften schon wieder ab. Lass uns mit diesem Thema.",
      "start": 437773,
      "end": 441015,
      "confidence": 0.8136363636363637,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist jetzt Stütle?",
      "start": 441055,
      "end": 443116,
      "confidence": 0.7112499999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Stütchen. Stütchen ist so ein kleines weiches Brötchen, eher so als Süßigkeit.",
      "start": 443156,
      "end": 447899,
      "confidence": 0.7318333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, doch.",
      "start": 448299,
      "end": 448760,
      "confidence": 0.597,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und Weckmann ist halt das ganze Ding in so einer Mannform. Ich weiß gar nicht, ob es das auch als Frauform gibt, muss ich zugeben. Das gibt es meist St. Martin mit so einer kleinen Keramikpfeife dabei.",
      "start": 450601,
      "end": 461667,
      "confidence": 0.7552972972972972,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, noch nie gehört. Ok, kommen wir zum eigentlichen Thema heute.",
      "start": 461907,
      "end": 465371,
      "confidence": 0.709,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ok, worüber sprechen wir heute Wolfgang?",
      "start": 465852,
      "end": 467494,
      "confidence": 0.5681666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Über On- und Offboarding. Gibt es eigentlich deutsche Begriffe für Onboarding und Offboarding? Jobwechsel? Ja, ok, das ist nicht genau das gleiche, aber könnte man so zusammenfassend.",
      "start": 467534,
      "end": 478050,
      "confidence": 0.7819259259259261,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir sprechen heute darüber, was passiert, wenn man von seiner aktuellen Firma in eine andere Firma, in eine neue Firma wechselt. Und im Speziellen sprechen wir darüber, wie man aus seiner aktuellen Firma offboardet, wie man sich also verabschiedet. Und damit meinen wir jetzt nicht, winkend und grinsend aus dem Büro gehen am letzten Tag, sondern da gehört ein bisschen mehr zu.",
      "start": 478470,
      "end": 502158,
      "confidence": 0.8608225806451613,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay manchmal kann es auch zutreffend sein und vielleicht gerade passend sein aber hoffentlich nicht.",
      "start": 502818,
      "end": 508340,
      "confidence": 0.7668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das sogenannte Onboarding, das bedeutet, worauf man achten sollte, was sind ein paar gute Tipps, um im neuen Job in der neuen Firma anzukommen, neue Umgebung, neue Kollegen und so weiter. Aber erstmal Wolfgang, erzähl doch mal, wie wir auf das Thema kommen.",
      "start": 508380,
      "end": 525088,
      "confidence": 0.8070227272727274,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, auf die Idee hat uns ein Hörer gebracht, der Karl, der uns geschrieben hat, vielen Dank für das Feedback, ist übrigens auch ein Feuerwehrmann, damit wir das auch geklärt haben, weil wir wollten ja in Folge, gute Frage, es werden langsam so viele Folgen, dass ich sie nicht mehr auswendig kann. Also die Folge, wo es um Incident Management gegangen ist, haben wir gefragt, wer ist Feuerwehrmann oder Feuerwehrfrau in unserer Hörerschaft. Und der Karl ist so einer und hat uns eben geschrieben, ihn würde mal interessieren, On- und Offboarding, gibt es irgendwelche guten Tipps, was würden wir denn so machen, einerseits auf der Seite, wenn man eine Firma verlässt, also als Arbeitnehmer oder eben auch als Firma oder als Arbeitgeber, als Chefin, was macht man denn da so, wenn eine Person die Firma verlässt?",
      "start": 525428,
      "end": 569672,
      "confidence": 0.8271838235294118,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ganz im Allgemeinen ist das ein relativ heißes Thema zur Zeit aus mehreren Gründen. Zum einen ist der Jobmarkt für ITler mit, ich würde mal sagen, drei, vier, fünf Jahren Erfahrung gerade sehr heiß. Es gibt mehr Gesuche als Leute auf dem Markt. Die Gehälter gehen gerade wirklich durch die Decke.",
      "start": 569892,
      "end": 589969,
      "confidence": 0.8594313725490196,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also eigentlich, also das sind jetzt nicht nur die Leute, die vier bis fünf Jahre Berufserfahrung haben. Ich glaube, die Studenten werden genauso weggeschnappt, die einfach direkt von der Uni kommen. Also das ist mittlerweile alles so gestresst auf diesem Jobmarkt, dass auch diese Leute eigentlich kaum zu bekommen sind.",
      "start": 590330,
      "end": 608070,
      "confidence": 0.7886599999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es existiert ja gerade im Jobmarkt so eine Theorie, dass warum nur die erfahrenen Leute gerade von dem Uplift im Jobmarkt die Vorteile ziehen und das liegt daran, dass die ganzen Firmen jetzt in der Corona-Zeit gemerkt haben, oh ich muss digital was machen, ich muss mich digitalisieren und so weiter und so fort und dafür brauche ich sehr erfahrene Leute. Das Problem ist, was diese Firmen haben und was ziemlich viele Firmen haben und jetzt kommt die Theorie, Die meisten Firmen haben noch nicht herausgefunden, wie die Juniors, die jetzt gerade neu in die IT einsteigen, wirklich ongeboardet werden, up to speed gebracht werden, wie die relativ schnell Value bringen können. Die Theorie ist, dass sich der Jobmarkt jetzt bald ändern wird, weil mehr und mehr Firmen verstehen, wie man Juniors, also Leute mit wenig Erfahrung, schnell up to speed bringt. Und wenn das gegeben ist, Dann könnte es sein, dass der Jobmarkt abkühlt und dann die Gehälter, ich will nicht sagen runtergehen, aber nicht mehr steigen, weil einfach mehr verfügbare Leute auf dem potenziellen Jobmarkt sind. Was aktuell nicht der Fall ist, weil die meisten Firmen suchen immer noch sehr erfahrene Leute, die Nachwehen von Corona und von Covid durch Digitalisierung sofort abfangen können, durch Innovation und so weiter.",
      "start": 608877,
      "end": 684288,
      "confidence": 0.858099526066351,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist deine Theorie, dass man heutzutage auch gar nicht mehr so lange bei einer Firma bleibt, sondern öfters wechselt? Ihr habt einen Freund, das ist mittlerweile, glaube ich, ziemlich die Ausnahme, der ist, seitdem er die Uni verlassen hat, ist er jetzt bei einer Firma. Keine Ahnung, wie lang das jetzt ist, sind aber wahrscheinlich über zehn Jahre, würde ich mal sagen. Aber ich glaube, das ist die einzige Person, die ich überhaupt kenne, die nie sonst gewechselt hat. Also heutzutage ist das ja doch ganz anders als wahrscheinlich vor 20 Jahren, ohne dass ich den Markt kenne vor 20 Jahren, aber rein was ich so anekdotisch mitbekomme und was man früher auch so gesagt hat.",
      "start": 685043,
      "end": 723110,
      "confidence": 0.7920683760683764,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin mir gar nicht sicher ob es nur heute so ist ich denke die zeit ändert sich einfach weil auch die art der arbeit sich ändert also super viele jobs in der früheren zeit waren ja eher industrie geprägt du hast deine ausbildung gemacht bleibst dann da in der in der industrie und gehst dann da natürlich auch in rente vielleicht sogar noch in früh rente und ähnliches. Bei uns wir sind ja eher diese art von kreativ arbeiter knowledge worker und bei uns kannst du ja nicht wirklich zeit gegen output setzen das bedeutet wenn wir acht stunden wir sind wir sind ja nicht am fließband wir wir können ja nicht wir machen ja nicht mehr output nur wie länger mehr arbeiten. wenn ich länger am fließband steht und habe ich einfach mehr output weil ich einfach mehr aktion das ist ja eins zu eins was bei uns natürlich jetzt nicht so möglich ist deswegen bin ich mir gar nicht sicher ob das in unserer industrie jetzt gerade so die zeit ist wenn man jetzt natürlich mal corona im speziellen sieht, Jetzt gerade kommt das alles sehr sehr heiß vor aus zwei Gründen meines Erachtens nach. Viele Firmen haben sich vielleicht nicht klug angestellt oder aus der Perspektive des Mitarbeiters vielleicht nicht gut genug, was diese Flexibilität mit Homeoffice und zurück ins Büro und Hybrid und Remote angeht. Da erwartet aber jeder Mitarbeiter ja auch alles andere. Weil es gibt Software-Engineers, die wollen voll remote sitzen. Es gibt Software-Engineers, die sind Office-first, die wollen mit Leuten sprechen. Und dann gibt's Leute, die lieben Hybrid, wo du zweimal ins Büro gehst. Von daher, ich glaub, da gibt's jetzt grad ein ziemliches Durcheinander und auch Durchgewürfeln. Die Tage hab ich sogar gelesen, weil Apple alle Leute wieder zurück ins Büro holt. Der Chef der künstlichen Intigenzabteilung hat gesagt, nee, ich mach da nicht mehr mit, ich kündige. Das ist schon mal ein Zeichen. Die zweite Geschichte, warum das jetzt gerade so durchgewickelt wird, ist Covid und Remote Work machen es halt auch einfach, einfach den Job zu wechseln, weil im Endeffekt ist es eigentlich nur, du wechselst den Slack Workspace und deinen E-Mail Exchange Server und das war's und du bist in einer neuen Firma.",
      "start": 723750,
      "end": 847727,
      "confidence": 0.8089386666666665,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das stimmt sicher, es ist wesentlich einfacher geworden heutzutage zu wechseln, auch wenn du remote arbeitest, ist es natürlich super easy dann, weil du kannst einfach in einer Stadt bleiben und ich kenne es auch zum Beispiel aus meiner Heimatstadt Innsbruck in Tirol, wo die Gehälter extrem niedrig sind, wenn man sie vergleicht zum Beispiel mit Wien, auch innerhalb Österreich oder Deutschland. Weil du eine extrem hohe Lebensqualität natürlich dort hast und vor allem, wenn du Sport gerne machst und in den Bergen bist, ist es natürlich super nett dort, darum fahren ja auch alle auf Urlaub hin. Aber wenn du natürlich dort leben wirst und arbeiten wirst, dann haben die Firmen einfach gesagt, okay, du bekommst halt niedrige Gehälter, dafür hast du diese hohe Lebensqualität. Und das ändert sich natürlich jetzt auch langsam mit dem ganzen Remote Jobs, weil halt jemand auch für Google in Amerika arbeiten kann oder halt für nicht mehr automatisch nach München oder nach Zürich muss, sondern auch von dort aus arbeiten kann. Und das ist natürlich schon eine ganz andere Geschichte als früher. Und ich kann mich da auch noch gut erinnern an einen Freund von mir, der hat immer gemeint, nach drei Jahren darfst du wechseln, nach sechs Jahren sollst du wechseln und nach neun Jahren musst du wechseln. Also wenn man das heute, ist noch gar nicht so lange her, keine Ahnung, vor zehn Jahren oder so hat er mir das gesagt, wenn man das heute anschaut, diese Zahlen, also wenn heute jemand drei Jahre bleibt oder vielleicht sogar sechs Jahre, dann musst du schon ziemlich glücklich sein, wenn du jemanden so lange gehalten hast. Wie lange warst du bei Trivago, Andi?",
      "start": 848187,
      "end": 931872,
      "confidence": 0.8088749999999993,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich fange hier gerade an zu grinsen, weil du hast jetzt nämlich gerade von einem Kollegen erzählt, der ist irgendwie elf Jahre da gewesen und jetzt erzählst du irgendwie nach neun Jahren musst du wechseln. Ja bin ich da im schnitt ich weiß es nicht ich war neun jahre bei trivago und muss auch sagen dass ich in der zeit wo ich interviewt habe hier und da mal gechallenged wurde gechallenged wurde ich deswegen warum ich denn neun jahre bei einer firma bin weil ich, Gebe auch zu, das ist sehr unüblich in unserem Bereich. Unser Bereich entwickelt sich so schnell in alle Richtungen weiter. Es entstehen täglich oder fast wöchentlich neue Frameworks, neue Jobs, neue Geschäftsbereiche, neue Startups kommen auf. Und da stellt sich auch die Frage, warum ist man neun Jahre bei einer Firma? Das ist alles richtig. Und die Frage musste ich auch in Interviews mehrmals beantworten, weil ein eine person mit der ich interviewt hab sagt zu mir ich erwarte eigentlich von meinen kandidaten dass sie sich alle zwei bis vier jahre neu erfinden und das ist meist durch den job wechsel erzähl mir doch mal wie du dich jetzt innerhalb der neun jahre mehrmals neu erfunden hast und das ist eine sehr valide frage weil, Ich denke, wenn du neun Jahre, zehn Jahre, elf Jahre in einer Firma bist und sogar eine Position hast, dann kann man schon nachfragen, wo ist denn jetzt deine Kreativität? Wo ist denn jetzt hier dein Drive, dich weiterzuentwickeln? Weil du kannst ja natürlich auch da bequem auf deinem Popöchen sitzen und Däumchen drehen und du bist in einer Komfortzone. Da ist nichts Falsches dran. Versteht mich bitte nicht falsch. Doch wir wollen ja auch irgendwie gechallenged werden, neue Arbeit haben und so weiter und so fort.",
      "start": 931912,
      "end": 1024095,
      "confidence": 0.7963905723905724,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, es kommt ganz darauf an, was du natürlich suchst. Weil wenn du vielleicht eine Person suchst, die einfach hardcore Java entwickeln kann, Spezialist in Java ist und du brauchst genau diese Person, dann ist das gut. Aber wenn du in einem Startup bist, wo du fünf verschiedene Technologien hast und jeder muss hin und her springen und soll sich auch mal in eine neue Sprache einlesen, eine neue Sprache programmieren anfangen, dann werden so Leute, die zehn Jahre in Java programmiert haben, die auch nur Java programmieren wollen, da Schwierigkeiten haben. Und je nachdem musst du natürlich auch schauen, ist der Andi was für mich oder ist der Andi nichts für mich. Aber wie hast du jetzt argumentiert mit diesen neun Jahren bei deinem Interview?",
      "start": 1024315,
      "end": 1064066,
      "confidence": 0.8070708661417323,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe einfach meinen werdegang dargelegt weil innerhalb der neun jahre habe ich mehrmals die position gewechselt bin die management leiter hoch auf zwei level hoch gegangen und wieder runter. Und wieder runter als individuell kontributor aber ich hatte da auch für meine gründe für und konnte diese gründe alle sehr gut darlegen nach dem interview sagte man zu mir okay du hast dich gegebenenfalls öfter als alle zwei bis vier jahre neu erfunden. Und da war das Thema auch gegessen. Und ich denke, es ist auch gar kein Problem, 10, 11, 15 Jahre darzulegen, solange man seine Gründe hat, solange man das gut erklären kann. Und warum man zum Beispiel von der Management-Position wieder als Individual Contributor, als Software-Ingenieur arbeiten möchte. Zum Beispiel bei mir war das so, ich war einfach dann auf dem Director-Level, hab dann andere Engineering-Manager geleitet, nennt man im internationalen Umfeld Director-Level. Und da habe ich gemerkt, dass ich einfach von den technischen Details zu weit weg war, wo ich nicht sein wollte. Und deswegen bin ich halt einfach wieder als Individual Contributor runtergegangen, gewechselt, wo ich dann wieder sehr nah bei den technischen Details war. Und das hat mir sehr geholfen.",
      "start": 1064833,
      "end": 1126083,
      "confidence": 0.8229543147208126,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da haben wir übrigens auch eine eigene Episode gemacht, die Episode 5 zu Teamleads, wo wir auch nochmal drüber gesprochen haben, wie denn das so ist, wenn man von Teamlead wieder auf Individual Contributor und so weiter wechselt. Also gern auch da mal reinhören, wer da mehr Interesse hat zu diesem Thema.",
      "start": 1126443,
      "end": 1142093,
      "confidence": 0.7979423076923078,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber an alle Hörerinnen und Hörer, jetzt nehmt mich bitte nicht super ernst und sagt, der Andi hat ja nur eine ganz komische Weltanschauung.",
      "start": 1142113,
      "end": 1150137,
      "confidence": 0.8325833333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, die hat er schon, aber was im Speziellen jetzt?",
      "start": 1150157,
      "end": 1153439,
      "confidence": 0.7226999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist eine Frechheit hier. Wenn wir uns einfach mal die Definition von Arbeit ansehen, dann ist Arbeit der Austausch von Geld gegen Zeit und Fähigkeit. Das ist erstmal die Definition von Arbeit. Soweit so gut. Und ich finde das völlig okay, wenn Leute sagen, ich arbeite, um meine Miete zu zahlen, um meine Freizeit zu finanzieren. Alles klasse. Ich persönlich denke anders. Ich denke, wir verbringen so viel Zeit auf der Arbeit, deswegen suche ich mir etwas, wo ich Spaß dran habe. Weil sonst sehe ich nämlich Arbeit so als, oh, da muss ich jetzt wieder hin. Klar, ich stehe jetzt auch nicht jeden Morgen auf, yeah, geil, wieder arbeiten. Aber es ist eine andere Sache, als wenn ich es wirklich hasse und einfach nur, okay, ich brauche das Geld. Oder ob ich wirklich das mache, wo ich denke, ich entwickle mich weiter in eine Richtung, in die ich mich weiterentwickeln möchte, wo es mir wirklich Spaß macht. Und deswegen denke ich, es ist nicht verkehrt, neun Jahre bei einer Firma zu sein. Loyalität spielt auch eine Rolle. Bei Loyalität muss man natürlich auch ein bisschen aufpassen, weil wenn es hard of hard kommt, ob dann jede Firma so loyal zu dir als einzelner Mitarbeiter ist oder ob die dich einfach absägen, ist dann auch fraglich. Schon sehr oft gelesen. Aber eine Firma kann dir auch sehr viel Chancen bieten, zum Beispiel neue Positionen auszuprobieren. Und das hatte ich bei Trivago. Deswegen war ich neun Jahre da. Mir wurde sehr viel Vertrauen gegenübergestellt und auch gebracht. Und da hab ich zu danken. Und deswegen war ich einfach neun Jahre da. Und ich denke, solange man das einfach erklären kann, ist das eigentlich gar kein Problem. Es ist aber unüblich auf Lebensläufen, die man heutzutage sieht, dass jemand so lange bei einer Firma ist.",
      "start": 1153479,
      "end": 1245890,
      "confidence": 0.8242664473684206,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es wird ja auch nochmal zusätzlich verstärkt, auch durch den ganzen amerikanischen Trend, der natürlich jetzt bei uns auch viel öfters gesehen wird, dass man einfach mit Equity und Stocks, die meistens auf vier Jahre angelegt sind, halt gerne auf diese vier Jahre gehalten wird und dann viele einfach nach diesen vier Jahren automatisch wechseln und dann entsteht auch so ein Job-Hopping alle vier Jahre, wo man einfach von einem Arbeitgeber zum nächsten springt, um jeweils wieder diese vier Jahre Stock-Compensation zu bekommen, also Aktien. Und dann spart man sich das Nachverhandeln nach vier Jahren und springt einfach zur nächsten Firma. Also das sieht man schon auch immer mehr.",
      "start": 1246410,
      "end": 1284115,
      "confidence": 0.8358623853211016,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Für die Hörer, die damit nicht so ganz vertraut sind, ein bisschen Kontext. Wovon der Wolfgang da redet, sind sogenannte Golden Handcuffs, die Golden Handschellen. Und zwar ist ein Teil deines Gehaltes gegebenenfalls entweder ein Aktienpaket oder Anteile an der Firma, an der GmbH. Muss nicht unbedingt an der Börse gelistet sein, aber ein variabler Anteil. Und wenn der Gewinn der Firma steigt, wenn der Aktienkurs steigt, steigt natürlich auch dein Gehalt. Ja, die sind dann ähnlich wie eine Bonuszahlung. Du kriegst den vollen Bonus erst, wenn du vier Jahre bleibst. Das sind deine sogenannten goldenen Handschellen. Da muss man dann schon gucken, lohnt es sich, auch monetär vielleicht doch noch ein Jahr dran zu hängen, ja oder nein. Ist speziell bei diesen ganzen High-Tech-Firmen und High-Growth-Firmen, die jetzt gerade in Berlin aufkommen und so weiter, Amsterdam, ist das eigentlich gang und gäbe, dass jeder Mitarbeiter dort oder jeder Tech-Mitarbeiter dort Equity, also Firmenanteile kriegt. Und das macht natürlich auch ein bisschen schwer zu wechseln.",
      "start": 1284155,
      "end": 1342930,
      "confidence": 0.8149090909090911,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber jetzt gehen wir mal davon aus, wir haben uns entschieden zu wechseln. Warum ist dieser Offboarding Prozess denn überhaupt wichtig? Warum, ich meine, es ist kündigen und gehen. Warum machen wir da eine Episode überhaupt dazu?",
      "start": 1342990,
      "end": 1357185,
      "confidence": 0.7852432432432433,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vom Offboarding, sehe ich das immer aus zwei Perspektiven. Einmal aus der Firma selbst und einmal aus der Sicht von dir als Mitarbeiterin. Bei beiden trifft folgender Satz zu, man sieht sich einfach immer zweimal im Leben. Und die Tech-Industrie, speziell in Deutschland und ich glaube auch in Österreich, ist halt einfach sehr, sehr klein. Die Leute, die was drauf haben, die Leute, die sich in einem gewissen Umfeld bewegen, vielleicht sogar ganz oben mitspielen im Cloud-Kubernetes-Space, Die kennen sich einfach, die sind in den gleichen Foren und Gremien drin, die sind auf den gleichen Konferenzen und da kennt der eine den anderen. Diese Subkulturen, diese Communitys sind sehr, sehr klein. Deswegen, man sieht sich immer zweimal im Leben. Aber kommen wir doch mal zu der Perspektive zur Offboarding aus der Sicht der Firma. Und du als ehemaliger Manager hast doch bestimmt hier und da schon mal einen Mitarbeiter geoffboardet, weil er sich dazu entschieden hat, der Wolfgang, ich kriege den Dialekt nicht mehr in meinen Kopf, ich muss hier weg. Welche Punkte spielen da für dich eine Rolle?",
      "start": 1357225,
      "end": 1422365,
      "confidence": 0.8260558659217877,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Glücklicherweise war das ja alles in Englisch. Da hört man dann den Dialekt weniger, nur den bösen Tiroler Akzent. Aber der war dann schon ganz okay. Ganz allgemein, glaube ich, fängt es sehr früh an. Wenn ich das jetzt aus meiner Manager-Sicht sehe, geht es auch darum, schon frühzeitig eine Atmosphäre zu schaffen, dass die Leute auch auf dich zugehen. und dich im Vorfeld informieren vielleicht, sie kündigen, sie suchen was anderes und dass man da hilfreich zur Seite steht und nicht schon von Anfang an irgendwie beleidigt ist oder das persönlich nimmt, weil ich glaube, oft haben die Leute einfach gute Gründer, die wollen in eine andere Stadt ziehen, teilweise Familie oder sonst was, muss vielleicht in die andere Stadt, anderes Land oder was es auch für Gründe auch immer sind und ich glaube, wenn man da eine gute Atmosphäre hat zwischen Manager und den Leuten, dann gehen die auch auf einen zu mit so einem Kündigungswunsch, dann kann man das vielleicht auch noch frühzeitig abwenden im Idealfall und sonst kann man einfach die Person unterstützen bei dem Ganzen. Und ich habe das auch immer eigentlich als sehr positiv gesehen, gerade wenn so Leute auf mich zukommen sind und gesagt haben, okay, sie gehen jetzt zu Google zum Beispiel. Ihr habt das oft gehört, wie gemein das ist, Google grasst uns ja nur die guten Mitarbeiter ab. Wir bilden die aus, wir investieren da Jahre und dann kommt Google und nimmt uns einfach die guten Leute weg. Und ich habe das aber immer so gesehen, dass das eigentlich ein Kompliment ist für mich und die Firma, dass wir Leute ausgebildet haben und weitergebracht haben, dass die so gut sind, auf so einem hohen Level sind, dass sie jetzt zu Google gehen und von Google genommen werden. Und ich glaube, das ist eine Herangehensweise, die mir persönlich auch immer geholfen hat, dass ich das einfach immer alles sehr positiv gesehen habe und die Leute auch dabei unterstützt habe. Und dann ist das Ganze natürlich auch wesentlich einfacher gegangen, als wenn man dann sich womöglich irgendwie streitet und irgendwie das persönlich nimmt, beleidigt ist und dann vielleicht sogar Noch probiert in dem letzten Monat, wo die Person in der Firma ist, irgendwas, keine Ahnung, irgendwas negativ, negative Energie auszustrahlen, wie auch immer. Das kommt ja immer auf einen zurück. Also habe ich immer probiert, das positiv zu sehen.",
      "start": 1422425,
      "end": 1549696,
      "confidence": 0.806065491183879,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, man muss ja auch ganz einfach mal fragen, wer hat was davon, wenn man am Ende sich noch anhatet?",
      "start": 1549716,
      "end": 1555682,
      "confidence": 0.8269500000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, oder du willst ja auch keine Mitarbeiterin haben, die einfach drei Monate, wenn es drei Monate Kündigungsfrist ist, nochmal irgendwo da sitzt und Daumen dreht und einfach, weil schlechte Stimmung ist, keine Finger mehr rührt oder noch schlimmer irgendwas Negatives dann macht oder irgendwas Böses macht.",
      "start": 1556493,
      "end": 1573403,
      "confidence": 0.8447021276595743,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich sehe es halt einfach nur, es bringt halt keinen weiter. Und speziell bei den Sätzen, man sieht sich immer zweimal im Leben, gibt es natürlich auf der einen Seite den Fall, dass viele auch wieder zurückkommen, weil die neue Firma jetzt nicht passt. Nur weil Google ein toller Name ist, heißt das nicht, dass die Firma für jeden etwas ist. Es gibt aber auch andere Situationen, wie zum Beispiel, jemand macht sich selbstständig, ist ein Freelancer und du als Firma kannst ja auf den Freelancer oder auf die Freelancerin dann wieder zurückgreifen, weil die Person kennt sich dann schon im Unternehmen aus, ist sofort produktiv, braucht keine Einarbeitungszeit etc.",
      "start": 1574586,
      "end": 1603215,
      "confidence": 0.7511711711711712,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es passiert sogar sehr oft, dass man dann der erste Kunde ist sozusagen von diesem Freelancer. Und das kann ja auch dann sehr positiv sein, dass man das aufrechterhält.",
      "start": 1603715,
      "end": 1613000,
      "confidence": 0.8061724137931037,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder eine andere Möglichkeit ist, dass man nach drei, sechs, neun Monaten die Person nochmal anschreibt und sagt, Hast du in deiner neuen Abteilung und unserer Abteilung nicht mal Lust auf einen Knowledge-Exchange, dann trefft euch irgendwo mit zwei, drei Personen von jeder Firma und sprecht einfach über Fachthemen, um einfach mal zu wissen, okay, wo steht denn jede Firma, wie löst die andere Firma die Probleme. Einfach mal einen lockeren Knowledge-Exchange. Und in der Regel werden da ja keine Firmengeheimnisse besprochen, weil Technologie, jeder basiert heute irgendwie auf Open Source, und das ist alles zugänglich. Die Firmengeheimnisse sind dann öfters mal spezielle Algorithmen, irgendwelche Verbindungen, Geschäftsverbindungen oder oder oder und selten, wie baust du den Suchindex auf in deinem Elasticsearch. Von daher.",
      "start": 1613020,
      "end": 1658443,
      "confidence": 0.7937154471544717,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ganz abgesehen davon ist natürlich jede Person auch Teil deines Netzwerkes und wenn du gute Connections hast zu deinen ehemaligen Chefinnen oder anderen Kolleginnen, dann ist es halt einfach viel, viel wertvoller, als wenn man da jetzt irgendwie im Schlechten geht. Das heißt, wenn man da irgendwie das Ganze sauber abschließt und auch Zeit investiert eben in diesen Offboarding-Prozess, dann hat man später, glaube ich, auch viel davon. Aber das ist jetzt schon mehr eigentlich auf der Mitarbeiter- und Mitarbeiterinnen-Seite, was man da von diesem Offboarding-Prozess hat. Hast du noch auf Firmenseite irgendwas anderes, auf was man Acht geben muss, bis auf die positive Stimmung?",
      "start": 1658883,
      "end": 1699428,
      "confidence": 0.8296761904761909,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So eine Situation ist immer, immer gut, um auf der einen Seite vielleicht nochmal Danke zu sagen für die ganze Zeit, um Hilfe anzubieten, wie zum Beispiel, wenn jemand vielleicht sogar umzieht oder was es auch immer gibt, vielleicht einfach nochmal als Referenz irgendwie dasteht oder ähnliches oder gutes Zeugnis ausstellt. Welche Hilfe man auch immer braucht, auch immer eine super Sache. Da bricht sich in der Regel keiner an Zacken aus der Krone. Und für die Firma ist das natürlich eine super Gelegenheit, um mal ehrliches Feedback zu kriegen. Ehrliches Feedback auf Fragen wie zum Beispiel, warum verlässt die Person gerade das Unternehmen? Was hat gefehlt? Was kann die Firma vielleicht besser machen? Auch im offboarding ja weil die firma die person ist da ja gerade durch den prozess gegangen und was zum beispiel die person der firma, dann empfehlen würde was diese ändern würde oder ähnliches was da ein bisschen schwierig ist oder was da was da die herausforderung ist ist ehrliches feedback zu kriegen weil auch die leute die gehen, wollen ihr manager ja nicht direkt vor den kopf stoßen also vielleicht ist das ab und zu mal so ein bisschen in zuckerwatte gepackt aber ich denke das ist wirklich wirklich wirklich eine gute chance auch für dich als mitarbeiterin dem manager und der firma wirklich ehrliches feedback zu geben bitte objektiv bleiben und nicht subjektiv beziehungsweise nicht persönlich werden Weil der Engineering Manager und die Engineering Managerin ist natürlich auch nur eine Repräsentantin der Firma. Und ich korrigiere mich gerade, natürlich kann man da subjektiv bleiben, weil du kannst ja natürlich deine Gefühle teilen. Für mich gab es hier keine Weiterentwicklungsmöglichkeiten oder ich habe keine Weiterentwicklungsmöglichkeiten für mich gesehen. Das ist natürlich eine sehr subjektive Sache, auch wenn objektiv vielleicht eine Karrierefahrt ist. Aber das sind so Elemente, wo die Firma glaube ich noch sehr viel Wert daraus ziehen kann. Hast du schon mal ein Exit-Gespräch geführt?",
      "start": 1699468,
      "end": 1805363,
      "confidence": 0.7984579439252335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, natürlich, mit jeder und jedem, die die Firma damals verlassen hat. Und was auch wichtig ist, dass dieses Exit-Gespräch oder eines der Exit-Gespräche, wahrscheinlich gibt es ja auch mehrere, dass man das natürlich nicht sofort macht, wenn jetzt die Person sagt, okay, möchte kündigen oder die Kündigung einreicht. sondern dass man das auch möglichst spät macht, damit man da auch eine gewisse Distanz hat, vielleicht sogar am letzten Tag idealerweise sich nochmal zusammensetzt, eine Runde gemütlich in einer gemütlichen Atmosphäre, keine Ahnung, Bier trinkt oder sonst irgendwas, aber natürlich schon one to one, also im Zweiergespräch und einfach nochmal das Revue passieren lässt, was hat es denn so gegeben, gibt es noch irgendwelche Probleme, was sind Sachen, die man lösen könnte, um einfach so einen Ausklang zu haben, einen guten. Das würde ich auf jeden Fall möglichst am Ende machen und oft wird es ja auch von in größeren Firmen von der Personalabteilung übernommen, aber ich würde auf jeden Fall trotzdem noch mal als Manager so ein Exitgespräch machen, ganz am Ende, einfach in gemütlicher Atmosphäre. Und wenn man jetzt die Personalabteilung schon anspricht, in größeren Firmen ist das natürlich alles sehr genau geregelt, da gibt es einen Prozess, was auch alles gemacht wird. Aber ich glaube auch in kleineren Firmen ist es durchaus hilfreich, wenn es da eine Checkliste gibt, auch vielleicht von personaler Seite, weil einfach gerade bei einer kleinen Firma, die Leute nicht so viel Erfahrung haben, eben Leute verabschieden. Weil da hat man ja keinen Durchsatz von 100 Leuten im Jahr, sondern das passiert ja viel seltener. Und wenn man da einfach mal eine Checkliste bekommt, wenn jetzt jemand geht und da stehen einfach oben paar Tipps, Exitgespräch, was könnte man da fragen, was sollte man fragen, dann hilft einem das auch selber, dass man einfach nichts vergisst, weil man hat halt immer Stress noch dazu, wenn eine Person geht, vielleicht verliert man. eben eine Person und hat noch kein Replacement. Das heißt, die Arbeit fällt trotzdem an, alles wird stressiger und dann sollte man gerade auf diese Offboarding-Schritte eben nicht vergessen und da hilft einfach eine Checkliste, was man denn einfach so alles tun sollte innerhalb von diesen paar Wochen, bis die Person dann wirklich aus der Firma ausscheidet offiziell.",
      "start": 1805940,
      "end": 1932191,
      "confidence": 0.8189042553191488,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das war jetzt die Sicht der Firma, kommen wir mal zu der anderen Sicht. Ich als Mitarbeiter, du als Mitarbeiterin hast dich jetzt entschieden zu kündigen, was für mich nie eine leichte Entscheidung war, weil es ist ja schon eine Veränderung in deinem Leben.",
      "start": 1932640,
      "end": 1947371,
      "confidence": 0.7992954545454545,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das sagen immer alle Leute, es war keine leichte Entscheidung und dabei bist du nur zum Angebot mit dem höheren Dollarzeichen gegangen.",
      "start": 1947411,
      "end": 1955657,
      "confidence": 0.7831363636363636,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das stimmt nicht, das stimmt nicht.",
      "start": 1955677,
      "end": 1956878,
      "confidence": 0.5688333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du willst mir jetzt sagen, dass du.",
      "start": 1957523,
      "end": 1959744,
      "confidence": 0.7194285714285714,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Gesagt hast, ich kündige, fuck it, ich werde Digital Nomad und bin weg? War das eine leichte Geschichte für dich?",
      "start": 1959784,
      "end": 1967507,
      "confidence": 0.82775,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, also die Entscheidung selber war dann extrem leicht, nachdem ich sie mir neun Monate überlegt habe.",
      "start": 1968068,
      "end": 1973370,
      "confidence": 0.8059411764705882,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, gut. Wir lesen zwischen den Zeilen. Wusstet ihr eigentlich, liebe Hörer und Hörerinnen, wie der Wolfgang nach Trivago gekommen ist? Ich glaub, wir hatten das schon mal erzählt, aber ich find die Story so geil, dass wir die noch mal ganz kurz abreißen können. Also, der Wolfgang war am Studieren, hat seinen Doktortitel in Österreich gemacht und hat gesagt, so, ich geh mal auf Jobsuche. Und mein einziges Kriterium ist, ich gehe nicht nach Deutschland. Dann hat er eine E-Mail von Trivago bekommen und wo ist er gelandet? In Deutschland, in Düsseldorf. Also, so viel halten wir vom Wolfgang, so konsequent ist er.",
      "start": 1974988,
      "end": 2002309,
      "confidence": 0.726355769230769,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich war so blauäugig, dass ich mich bei einer Firma beworben habe, ohne genau zu checken, wo die Firma sitzt.",
      "start": 2002929,
      "end": 2009251,
      "confidence": 0.5733499999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Story bringt mich echt einfach immer noch zum Grinsen. Okay, zurück zum Thema. Warum ist Offboarding von dir als Mitarbeiter, von dir als Mitarbeiterin denn eigentlich auch eine wichtige Geschichte und wie solltet ihr es angehen? Was würdest du machen? Was hast du gemacht, als du Trivago verlassen hast?",
      "start": 2009271,
      "end": 2023775,
      "confidence": 0.7818400000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Mein Job bei Trivago war ja reden, also Engineering Manager, reden und Kaffee trinken und darum habe ich eigentlich das gleiche weitergemacht, aber noch intensiver. Ich habe nämlich einfach allen kommuniziert, dass ich gehe und habe halt wirklich extrem viele One-on-ones gemacht, also klarerweise mit dem Team sowieso. Aber auch mit allen Leuten, die mir irgendwie eingefallen sind, die mir über den Weg gelaufen sind, hab denen einfach erklärt, nochmal ein Abschlussgespräch geführt, mit den Leuten, mit denen ich zusammengearbeitet habe, natürlich noch mehr und noch tiefer, aber auch mit anderen Leuten einfach, um sich zu verabschieden, um dieses Netzwerk, das man sich da aufgebaut hat, auch irgendwie am Leben zu erhalten, dass man nicht plötzlich von einem Tag auf den nächsten einfach weg ist und dann Gibt es diese Gespräche so in der Küche, wo ist denn eigentlich der Wolfgang? Und der andere sagt, ja, der hat ja gekündigt und ist weg. Und sowas wollte ich halt einfach vermeiden. Also ich habe, glaube ich, mit sehr vielen Personen gesprochen einfach und habe probiert, im Guten zu gehen, dieses Netzwerk auch mitzunehmen, den Kontakt zu allen aufrechtzuerhalten und habe daher, glaube ich, recht viel Kaffee getrunken in der Zeit.",
      "start": 2025101,
      "end": 2087962,
      "confidence": 0.797849246231156,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, das bedeutet, dass das, was ich jetzt sage, warum das ordentliche Offboarding von dir selber als Mitarbeiter eigentlich wichtig ist, ja gar nicht zutrifft, oder? Und zwar sollten wir auch die Frage stellen, warum ist das denn relevant? Und viele Leute kennen das jetzt sehr wahrscheinlich. Ihr habt einen Mitarbeiter bei euch im Team und auf einmal ist er weg. Der hat bis zum letzten Tag einfach ganz normal weitergearbeitet und dann geht er Freitag aus dem Büro und ihr kommt montags wieder ins Büro und diese Person ist nicht mehr da, weil der Vertrag ausgelaufen ist oder weil die Person gekündigt hat. Und dann steht ihr da vor einem Haufen verbrannter Erde. Und dann fängt dieses Bullshit-Bingo eigentlich an. Immer wenn irgendwas in die Binsen geht, heißt es, oh, das hat Person XY gemacht. Oh, fuck, da drüben haben wir noch das Out-Token von dem und dem drin. Scheiße, die Person war die einzige Person, die Zugang zum GitHub-Administratorenkonto hatte. Und so weiter und so fort. Wolfgang, da warst du ja schon ein bisschen glücklich, weil du nur Kaffee getrunken hast, sondern dann warst du ja eigentlich gar nicht in den technischen Systemen involviert und war eigentlich alles super, oder?",
      "start": 2088482,
      "end": 2148179,
      "confidence": 0.7631782178217817,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, das war mein großer Vorteil. Da kann niemand sagen, es war seine Schuld. Wobei, ich kann mich an ein paar Sachen erinnern, wo ich auf der organisatorischen Ebene oder auf einer höheren Ebene in technischen Entscheidungen involviert war. Ich glaube, da fluchen heute noch einige über diese Entscheidungen. Aber das ist ein anderes Thema. Was ich sonst noch gemacht habe, ist mir gerade eingefallen, ich habe natürlich so einen kleinen Umtrunk noch gemacht, so eine kleine Party in der Firma oder das war zumindest mein Plan, habe das schön vorbereitet und habe das auf der Nordseite in einer Küche vom Gebäude geplant und dann bin ich auf diese Nordseite gegangen und dann war da irgendwer und hat gesagt, nein, nein, wir gehen jetzt nicht auf die Nordseite, wir gehen jetzt auf die Südseite vom Gebäude. Dann sind wir in einen anderen Bereich gegangen, wo der Andi schon gewartet hat, mit einer großen Menge an Leuten, und dann ein wildes Spiel mit mir auf der Bühne gespielt hat mit anderen. Es war so ein Quiz-Spiel mit Bussern, die er sich selber gebaut hat, mit Fragen zu Österreich und anderen. Also das hab ich noch gut im Kopf, also im Idealfall muss man gar nicht selber die Party schmeißen, sondern es übernehmen dann die Kollegen und er hat mir da auf der Bühne noch mal gut vorgeführt, kann ich mich noch gut erinnern. Aber war auf jeden Fall ein netter Abend.",
      "start": 2148219,
      "end": 2225270,
      "confidence": 0.7644375000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Grüße an Matthias, ich glaub, der da auch federführend für das Jeopardy-Spiel war. Aber kommen wir zurück zum Thema. Um halt genau dieses ... diese Bullshit-Kommunikation mal zu vermeiden, ohne verbrannte Erde hinterlassen, oh, das hat Person XY gemacht, deswegen geht alles in die Winsen. Ich glaub, da muss sich jeder auch mal in die eigene Nase fassen, weil das ist natürlich auch sehr einfach gesagt, die Schuld auf jemanden abzuwälzen, der vielleicht gar nicht mehr da ist. Obwohl man vielleicht da auch einen Teil dran hatte, weil im Endeffekt hat das Team, ist ja schon verschuldet, dass eine einzelne Person irgendwie nur Zugang hat. Da ist ja schon weit vorher was in die Winsen gegangen. Und nicht nur bei einer Person. Aber darüber reden wir heute nicht. Nämlich wir reden, wie beheben wir das Ganze beziehungsweise wie beugen wir der ganzen Sache einfach mal vor. Und da kann ich jetzt gerade eine Story von mir aus der Praxis erzählen ich habe eben was du alles kaputt gemacht hast ich kann auch erzählen was ich alles kaputt gemacht habe in der Tat ich habe im Februar die Firma gewechselt. Und ich hatte bei meiner Kündigung drei Monate Kündigungsfrist das bedeutet ich hatte auf jeden Fall ein bisschen Vorlauf bis ich die Firma verlasse. Und was ich als erstes gemacht habe, ich war knapp neun Jahre, ich war ein bisschen länger als neun Jahre bei Trivago, hab somit sehr, sehr viele Projekte gemacht und hatte somit auch sehr, sehr viel Zugang zu sehr vielen Systemen. Zum Amazon Root-Account, zu sehr vielen anderen Amazon-Accounts, Google Cloud Admin, GitHub Enterprise Admin, hab manche Systeme von Grund auf aufgesetzt, den Mesos-Cronjob-Cluster und so weiter und so fort. Also ich war über meine neun Jahre in sehr, sehr viele Projekte involviert und nicht überall wurde mein Zugang revoked. sondern den hatte ich dann bis zum Ende, was mich dann natürlich auch teilweise sehr weit nach vorne gebracht hat, weil ich sehr viele Dinge einfach schnell machen konnte. Aber den ersten Punkt, den ich gemacht habe, als ich gesagt habe, okay, ich kündige, ich habe erstmal eine Liste gemacht von allen Projekten, die ich noch abschließen muss die gerade laufen und abschließen hier heißt nicht das projekt wirklich abschließen sondern das projekt so in einen status bringen dass mein teil entweder gemacht wurde oder mit allem drum und dran an eine neue person übergeben wurde. Das hab ich einfach mal aufgeschrieben, das kam nach so vier, fünf Seiten Dokument. Darunter hab ich ein Kapitel gemacht, zu welchen Systemen ich denn eigentlich alles Zugang habe und was ich für einen Zugang habe. Ich bin ganz ehrlich, hab mich ein, zwei, drei Tage gekostet, weil über Zeit fallen dir halt immer mehr Sachen ein. Zum Glück hatte ich alle meine Passwörter in einem One-Password. Das war dann alles recht einfach herauszufinden, wo ich alles Zugang hab. Und dann hab ich diese Liste mit meinen damaligen Vorgesetzten besprochen, hab gesagt, okay, pass auf, Das sind die Projekte, in denen ich gerade involviert bin. Das sind die Systeme, auf denen ich Zugang habe. Lass uns mal bitte in die Diskussion gehen und priorisiere mir doch mal bitte die Projekte, die ich hier aufgelistet habe, nach der Wichtigkeit. Und da habe ich dann die Verantwortung einfach mal ganz klar abgegeben an meinen Vorgesetzten und dann, nachdem die Priorisierung fertig war, sind wir in die Diskussion gegangen, was ist eigentlich noch realistisch, was ich abschließen kann. Abschließen kann, habe ich ja gerade gesagt, entweder das Projekt fertig machen oder so übergeben, dass die andere Person sofort arbeiten kann. Und dann habe ich kontinuierlich mich durch diese Projekte gekämpft, habe wirklich sehr, sehr viele Meetings gemacht, war auch sehr anstrengend in den eineinhalb Monaten, nachdem ich die Kündigung geschrieben habe. Und zeitgleich habe ich angefangen, meine Accounts in Google Cloud, in Amazon, bei GitHub, bei Jenkins und wo auch immer, nach und nach deaktivieren zu lassen. Das bedeutet, ich habe mich sehr, sehr früh aus den Systemen rausgezogen. Warum habe ich das gemacht? Eigentlich primär, um solche Fehlerfälle vorzubeugen, dass, wenn ich nicht mehr da bin und mein Account von jetzt auf gleich deaktiviert wird, dass dann irgendein Prozess failt und ich dann nicht mehr da sein kann, um irgendwas zu helfen oder ähnliches. Das hat uns sehr sehr weit nach vorne gebracht und ich hatte jetzt auch ein bisschen Feedback, Grüße an Dominik, der noch bei Trivago arbeitet, mit dem war ich die Tage ein Bierchen trinken. Der sagte, Andi, soviel ich weiß, ist nach deinem Abgang nichts in die Binsen gegangen und nichts hinten runter gefallen. Und das freut mich natürlich schon sehr.",
      "start": 2225310,
      "end": 2478771,
      "confidence": 0.8056230569948187,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "War ja auch niemand mehr da, der was kaputt machen hat können.",
      "start": 2478951,
      "end": 2481832,
      "confidence": 0.4716666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das könnte auch sein, aber seht halt zu, dass ihr eine ordentliche Übergabe macht, so früh wie möglich und nicht in der letzten Woche. Ich hab's glaube ich anderthalb Monate vorher gemacht. Das bedeutet natürlich auch, dass eure Produktivität in manchen Bereichen natürlich nicht mehr so stark ist. Aber ganz im Ernst, ihr habt gekündigt, ihr verlasst die Firma. Keiner erwartet mehr Top-Leistung oder Top-Performer-Leistung von euch. Das heißt aber auch nicht, dass ihr euch zurücklehnen solltet und Däumchen drehen würdet. Seht einfach zu, dass ihr eine ordentliche, saubere Übergabe habt. Dort, wo ihr hohe Zugriffsrechte habt, dass die recht früh entweder downgegradet werden oder komplett revoked werden, um zu sehen, welcher Prozess fehlt dann. Und macht das wirklich nicht zwei Tage vorher, nicht eine Woche vorher, macht das wirklich ruhig einen Monat vorher oder ähnliches, weil manche Cronjobs laufen halt nur monatlich oder ähnliches, ihr kennt das ja.",
      "start": 2481852,
      "end": 2528560,
      "confidence": 0.790261744966443,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da ist natürlich auch meiner Meinung nach der Manager, gibt's eigentlich, ist Managerin dann eigentlich ein deutsches Wort, ist das schon eingedeutscht?",
      "start": 2528600,
      "end": 2537405,
      "confidence": 0.8170454545454544,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auch eine Dame ist doch ein Manager, oder?",
      "start": 2537425,
      "end": 2539907,
      "confidence": 0.520375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja überhaupt Manager ein deutsches Wort ist an sich schon. Kann man mittlerweile glaube ich sagen.",
      "start": 2540487,
      "end": 2544670,
      "confidence": 0.7966875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Abteilungsleiter, Abteilungsleiterin, Teamleiterin, nee Team ist ja auch Englisch. Gruppenführer, Führerin.",
      "start": 2544710,
      "end": 2552335,
      "confidence": 0.731,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das habt ihr nur bei der Feuerwehr in Deutschland. Wie dem auch sei. Ich glaube, dass das eben auch ein wichtiger Punkt ist für Manager und Managerinnen. Klingt komisch, Managerinnen, Managerinnen. Ich glaube, dass es auch ein wichtiger Punkt für Chefs und Chefinnen ist, dass sie darauf achten, dass genau das, was du jetzt erwähnt hast, auch passiert und früh genug passiert. Und wer natürlich auch nicht sehr erfahren ist, und der Andi hat natürlich im DevOps-Bereich auch mehr Zugriffsrechte, mehr Accounts und so weiter, normale User haben das weniger, Aber auch normale Developer haben einfach viele Zugriffe und ein Klassiker ist, was ich glaube, ist auch uns selber mal passiert, dass Slackbots einem User zugeordnet waren, weil derjenige halt damals diese Slackbots geschrieben hat und dann waren die dem User zugeordnet, der hat die Firma verlassen, Slack-Account wurde automatisch gelöscht und damit waren auch alle Bots, die gewisse Sachen überwacht haben, einfach weg. Also es gibt schon viele Sachen, die irgendwo an User-Accounts hängen oder an Personen hängen und die muss man einfach im Detail auch wirklich durchgehen und durchchecken.",
      "start": 2552375,
      "end": 2616529,
      "confidence": 0.8231933701657455,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wichtig bei dieser Liste von Projekten und bei den Accounts zum Beispiel ist, dass ihr euren Vorgesetzten immer aktiv im Loop haltet. Was ich gemacht habe, jede Woche habe ich ein kurzes Update geschrieben und mein Projektdokument einmal geupgradet mit Status Complete, In Progress oder Failed und ich habe jede Woche ein kurzes Status Update, okay dieses Projekt ist jetzt abgeschlossen, da habe ich diesen Fortschritt gemacht. Hier fehlt mir das und das, also wo ich auch geblockt bin. Und ich habe immer aktiv die Kommunikationsschiene oben gehalten. Das hat meinem Manager sehr geholfen, zu wissen, wo ich gerade bin. Er konnte sich auf mich verlassen und wusste einfach nur, dass ich die Projekte einfach gut übergebe. Und das ist auf jeden Fall ein Tipp. Es ist ein bisschen Arbeit, es ist tierisch anstrengend. Ich verstehe das und ich verstehe auch, wenn ihr die Motivation nicht mehr habt. Dennoch denke ich, ist ein sehr gutes Zeit- und Energieinvestment, keine verbrannte Erde zu hinterlassen bei der Firma, wo ihr gerade seid. Weil im Endeffekt seid ihr ja mit einem Grund dahin gegangen. Die Firma hat euch in irgendeiner Art und Weise überzeugt. Und einfach respektvoll die Arbeit zu machen und zu beenden. Und kommen wir zurück auf die Definition von Arbeit. Ihr kriegt ja auch eine Gegenleistung. Ihr kriegt ja auch das Geld dafür. Ihr werdet ja auch in den letzten Monaten noch bezahlt. Macht einfach euren Job und lasst nicht einfach den Stift fallen und geht raus.",
      "start": 2617530,
      "end": 2692466,
      "confidence": 0.780097165991903,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du gehst ja jetzt auch davon aus, dass die Accounts dann gelöscht werden und dann irgendwie Probleme auftreten, weil die halt revoked werden. Aber ich glaube, das ist auch noch ein wichtiger Punkt und gerade bei kleineren Firmen, die jetzt kein Konzern sind, und die keine zentrale User-Verwaltung haben. Und sogar wenn man zentrale User-Verwaltung hat, wie viele kleine Tools verwendet man irgendwo, wo man vielleicht keine Enterprise-Lizenz hat, die nicht angebunden sind an die zentrale User-Verwaltung oder wo es einfach billiger war, wenn man einen Account erstellt. Und da ist dann ganz, ganz wichtig, erstens, dass natürlich die Accounts übertragen werden an andere Leute, wenn es jetzt nur einen User gibt zum Beispiel, aber auch, dass die Accounts gelöscht werden, nachdem man die Firma verlässt. Jeder kennt wahrscheinlich die Geschichten und ich glaube auch bei Trivago habe ich gerade kurz wieder eine gehört, dass jemand immer noch nach Jahren Zugriff auf ein System hat, ein weit entferntes natürlich, aber trotzdem diese Sachen passieren und im Interesse von allen Beteiligten sollte das wirklich strukturiert alles gelöscht werden und darauf muss man halt auch achten, wenn man neues System sich anschafft, neue Software, neues externes System, was auch immer. dass man das in irgendeine Liste packt, dass man weiß, okay, wenn jemand die Firma verlässt, müssen wir einfach diese 200 Systeme vielleicht durchchecken. Hat derjenige oder diejenige dort einen Account gehabt und müssen wir da was löschen. Auch da helfen wieder irgendwelche Checklisten oder vielleicht ein Ticketsystem, was einfach bei einem Austreten von einem Mitarbeiter oder Mitarbeiterin einfach so eine Liste erstellt. Okay, check mal in System XYZ, gibt es da noch irgendwo einen Account? Muss man da irgendwas machen? Aber diese Listen müssen halt auch gepflegt werden und das muss man halt im Vorfeld auch immer machen. Wie habt ihr das gehandhabt, Andi? Du warst ja der Chef von diesem Team, das die ganzen Systeme überblickt hatte und alle Accounts und alles was so irgendwo herumgekrochen ist in der Firma an Software.",
      "start": 2692506,
      "end": 2808657,
      "confidence": 0.8111174698795183,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist schwierig, den Überblick zu behalten. Wir haben versucht, ziemlich viele Systeme an Active Directory anzubinden. Über Zeit haben wir natürlich nie komplett geschafft. Aber wir hatten eine Liste an Systemen, die Active Directory supporten und die es nicht supporten. Und da haben wir immer, wenn jemand aus dem Unternehmen ausgeschieden ist, hat die Personalabteilung dann so ein Jira-Workflow gestartet. Und dann haben wir mitbekommen, ah, okay, die Person geht. Dann und dann ist das Enddatum. Und dann wissen wir zum Beispiel, Da sind wir manuell in die Systeme gegangen, die wir nicht ans Active Directory, an die zentrale Userverwaltung angebunden haben, und haben die Person dann einfach ausgelöscht.",
      "start": 2809177,
      "end": 2842181,
      "confidence": 0.7985871559633025,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und woher habt ihr mitbekommen, dass es eine neue Software gibt?",
      "start": 2842541,
      "end": 2845581,
      "confidence": 0.7218181818181818,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Meist weil mein Chefchef die Rechnung bekommen hatte und mir dann einen Ping gegeben hat, hey, was ist denn dieser Service? Und dann meinte ich so, das ist eine Software für Dashboards. Meinte ich so, woher hast du die Rechnung? Und dann stand da meist der Name und dann wusste ich, welche Abteilung das genommen hat. Also es war so ein bisschen mehr Glück, muss ich zugeben.",
      "start": 2845621,
      "end": 2861985,
      "confidence": 0.7633432835820896,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also auch da vielleicht einen strukturierten Approach schadet natürlich nicht. Wenn man zentrale Einkaufsabteilung hat, dann wird das natürlich alles leichter.",
      "start": 2862351,
      "end": 2870326,
      "confidence": 0.7759523809523811,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir hatten einen zentralen Einkauf, der hat dann nach und nach die ganzen Sachen auch übernommen. Hier, schöne Grüße an Nils. Hat mir immer sehr viel Spaß gemacht, mit Nils zu arbeiten. Und war auch dann immer sehr gut, weil dann haben wir immer schön Ping-Pong gespielt. Hab mich dann gefragt, hey, pass mal auf, hier will jemand eine Dashboard-Software. Ah ja, letzte Woche hab ich irgendeine Rechnung gesehen, eine Dashboard-Software, sowas haben wir schon. Und ist auf jeden Fall vorteilhaft.",
      "start": 2870775,
      "end": 2891853,
      "confidence": 0.6529629629629627,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gibt natürlich auch Nachteile. Aber wie halt so alles bei Zentralisierung.",
      "start": 2891873,
      "end": 2895896,
      "confidence": 0.7654545454545455,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sind wir fertig mit Offboarding? Du bist raus. Springen wir sofort zum Onboarding? Nein, wir geben noch einen kleinen Tipp. Und zwar folgendermaßen. Wenn ihr Jobs wechselt, so habe ich es zumindest gemacht, und ihr es euch leisten könnt, macht ruhig mal 2 Wochen, 3 Wochen, 4 Wochen frei. Das ist dann unbezahlt. Das geht auf eure eigene Kappe. Aber darauf kann man ja hinsparen, dass ihr zwischen den 2 Jobs einfach mal 2, 3, 4 Wochen Urlaub habt. In Deutschland muss man ein paar Sachen beachten. Meldet das bei eurer Krankenkasse, gegebenenfalls beim Arbeitsamt, gegebenenfalls bei der Rentenkasse. Bei der Rentenkasse ist es nur ab vier Wochen notwendig. Alles unter vier Wochen, zwei, drei Wochen, sagen die, ist mir egal. Macht eh keinen Unterschied. Ab vier Wochen könnt ihr euch da entscheiden, zahlt ihr den Rentenbeitrag für diesen Monat selbst oder lasst ihr das einfach verfallen. Krankenkasse muss einfach mal Bescheid wissen und das Arbeitsamt, da würde ich euch empfehlen, euch wenigstens für die Zeit arbeitslos zu melden, weil falls etwas schief geht, habt ihr beim Arbeitsamt eh eine drei Monats Sperre, weil ihr ihr gekündigt habt und nicht gekündigt werdet und falls beim Neuanfang der neuen Firma, falls was schief geht und ihr habt vier Wochen frei gemacht, habt ihr schon einen Monat gut geschrieben und habt dann nur noch zwei Monate zu überbrücken, bis ihr Arbeitslosengeld kriegt. Das ist dann halt so ein kleiner Tipp.",
      "start": 2896876,
      "end": 2980568,
      "confidence": 0.8026092436974794,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie läuft es mit der Versicherung?",
      "start": 2980588,
      "end": 2982230,
      "confidence": 0.6475000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Mit der Krankenversicherung? Ja. Krankenversicherung, da kommt es auf deinen eigenen Stand an. Bist du gesetzlich versichert, bist du privat versichert? Bei mir war es so der Fall, ich bin freiwillig gesetzlich versichert und meine Krankenkasse bietet mir dann an, mich über meine Frau für die Zeit zu versichern. Wenn du gesetzlich versichert bist, dann ist es in Deutschland so, dass du nach deiner Kündigung noch 45 Tage weiter über den alten Arbeitgeber versichert bist. Wenn du privat versichert bist, da musst du dann mal mit deiner Versicherungsgesellschaft, mit deiner Krankenkasse und Versicherungsgesellschaft sprechen.",
      "start": 2982250,
      "end": 3020368,
      "confidence": 0.8139042553191487,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, sollte man auf jeden Fall abklären. Aber im schlimmsten Fall kann man auch so eine Reiseversicherung oder so irgendwas sich unter Umständen nehmen. Aber die Versicherungen bieten normal nach.",
      "start": 3020749,
      "end": 3030554,
      "confidence": 0.7179,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "War im Endeffekt eigentlich super einfach. Ich hab mich hingesetzt, drei Telefonate, halbe Stunde war ich durch. Einmal bei der Krankenkasse angerufen, die Sachlage erklärt, beim Arbeitsamt die Sachlage erklärt und bei der Rentenkasse. Und die waren alle super freundlich. Ich habe zwei Wochen frei gemacht. Kann ich nur jedem empfehlen. Wer sich das länger leisten kann, kann das gerne machen. Ist auf jeden Fall sehr entspannend, weil man ist aus dem alten Firmenaccount ausgesperrt. Auch wenn man ein bisschen Workaholic ist, man kann nicht mehr in die E-Mails gucken, man kann nicht mehr in Slack gucken. Man wird sozusagen gezwungen abzuschalten. Man ist ja noch nicht in der neuen Firma drin, deswegen kann man da auch noch nicht reingucken. Man hat vielleicht einfach nur mal Zeit für sich. Das ist total toll.",
      "start": 3030614,
      "end": 3071977,
      "confidence": 0.8160300751879696,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dem kann ich nur beipflichten.",
      "start": 3071997,
      "end": 3073038,
      "confidence": 0.5630000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So, jetzt kommen wir alle frisch aus dem Urlaub. Und jetzt beginnt der erste Arbeitstag in der neuen Firma. Wie stellst du dir den Vorwurfgang? Ich weiß, nach Trivago kam nichts mehr. Du bist sein eigener CEO geworden und hast, glaube ich, jeden Mittwoch Gehaltsverhandlungen mit dir, wenn ich mich recht erinnere.",
      "start": 3073387,
      "end": 3087231,
      "confidence": 0.7228076923076923,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Korrekt.",
      "start": 3087271,
      "end": 3087911,
      "confidence": 0.706,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie stellst du dir den aktuellen Onboarding-Flow in einer neuen Firma vor? Und bitte erinnere dich nicht damals, wie du bei Trivago angefangen hast. Die Zeiten ändern sich. Wie würde ein perfektes Onboarding für dich aussehen als Mitarbeiter?",
      "start": 3087931,
      "end": 3099034,
      "confidence": 0.7426842105263158,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich muss ja sagen, dieses Trivago-Onboarding damals, es war so eine Onboarding-Week, hat sich damals eigentlich ganz gut angefühlt. Aber das war halt mehr so ein Onboarding firmenweit, einfach um die Firma so kennenzulernen. Wenn man das ein bisschen spezieller sieht und jetzt runterbricht auf den Engineering-Bereich, wir sind immer noch ein Engineering-Podcast, Dann ist es glaube ich besonders wichtig, dass man einfach weiß, was man tun soll, dass man irgendwo ein Ziel hat oder etwas an die Hand bekommt, mit dem man einfach arbeiten kann und wo man dann auch die ersten Wochen damit füllen kann, sage ich mal so. In einem kleinen Team ist das vielleicht sowieso besser, da arbeitet man einfach mit den Leuten zusammen, sitzt mit denen auch zusammen, das geht ganz gut. Trotzdem finde ich es immer gut, wenn man irgendeinen strukturierten Approach hat. Einfach, wenn es zum Beispiel mehrere Teams gibt, dass man da irgendwie teamübergreifend gewisse Sessions hat, Intro-Sessions hat, wo man die Architektur vorstellt, wo man gewisse Teile vorstellt, dass man einfach von Manager-Seite auch sowas organisiert, weil man wirklich viele Leute anborden muss. Wenn man weniger Leute anborden muss oder nur hin und wieder, dann kann man das natürlich auch individueller machen. Aber auch da, wenn man wieder so eine Checkliste hat, was kann man denn so machen? Was könnten die Leute machen, wenn sie anborden? Wie kann man sie unterstützen? Dann ist es durchaus hilfreich. Was kann jetzt auf so einer Checkliste oben stehen? Was glaube ich ganz wichtig ist, sind vor allem die Kontakte außerhalb des Teams, weil in das Team wird man sowieso reingeworfen, dann arbeitet man mit dem Team zusammen, das funktioniert normal sehr gut. Was aber schwierig ist, ist dieses Netzwerk wieder in der Firma aufzubauen, mit anderen Leuten zu sprechen, andere Leute kennenzulernen. Was machen denn andere Teams? Wo haben wir Abhängigkeiten? Und gerade wenn man in einem kleinen Team arbeitet, kann das passieren, dass man recht wenig Kontakt zur Außenwelt hat. Und das ist natürlich extrem schade. Und das braucht dann auch teilweise Jahre, bis man irgendwie andere Leute in der Firma kennenlernt, weil man halt dann irgendwelche Meetings mit anderen Teams hat. Also da würde ich versuchen, möglichst früh nach außen zu gehen, Leute kennenzulernen. Ich habe das früher auch als Manager richtig strukturiert gemacht. Wir haben sogenannte Intro-Gespräche. Ich glaube, das ist recht üblich heutzutage gemacht, dass man wirklich eine Liste bekommt als Neuling, wo einfach Namen oben stehen. Und das sind Namen, Aus anderen Teams, die einem einfach mehr Informationen geben können, erzählen können, was macht denn ein Team A, ein Team B, ein Team C. Und wir haben üblicherweise die Leute genommen, die das auch gern gemacht haben. Weil es bringt dir nichts, wenn du da irgendeinen introvertierten Engineer draufschreibst, der überhaupt keine Lust hat, irgendwas zu erklären, zu erzählen. Und dann sitzen da irgendwie zwei Leute, die eigentlich überhaupt keine Lust haben, miteinander zu reden in dem Raum und starren sich an oder so. Also da musst du natürlich schon die Leute finden, die einfach auch kommunizieren können und die schreibt man auf eine Liste und die Liste kann man dann Neulingen in die Hand drücken und sagen, okay, geh einfach mal jeden Tag oder alle zwei Tage mit einer Person von dieser Liste einen Kaffee trinken und frag mal aus, was deren Team macht. Und so kannst du den Neulingen eigentlich auch helfen, dass sie in so eine Routine kommen, mit anderen Leuten Gespräche zu führen und sich einfach mal zu erkundigen, was machen denn die anderen in der Firma.",
      "start": 3099414,
      "end": 3297314,
      "confidence": 0.8250354729729729,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da kann ich nur zustimmen, so strukturiert war es jetzt bei mir in der neuen Firma nicht. Ich habe zwar auch eine Onboarding-Checkliste bekommen, so nach dem Motto, was soll ich in der ersten Woche tun, was soll ich in der zweiten Woche tun, wo ziemlich viele Links drin sind. Ich muss jetzt zum Beispiel ein paar Compliance-Trainings absolvieren und so weiter und so fort. Aber ich habe dann auch zum Beispiel meinen Chef gefragt, hey, kannst du mir mal ein paar Leute nennen, mit denen ich mich am besten mal unterhalten sollte? hatte mir einfach mal wild Namen von quer durch die Firma gegeben, die hab ich dann angeschrieben, hab dann Meetings mit denen ausgemacht und einfach mal eine halbe Stunde, meine primäre Frage war, wer ist eigentlich Kevin, wer ist eigentlich Daniela, wer ist eigentlich Elmar und einfach mal die Person dahinter kennenzulernen, weil mit diesen Menschen arbeite ich jeden Tag zusammen, mal öfter, vielleicht mal nicht öfter, Aber so sind wir auch auf Themen gekommen wie, okay, ich bin jetzt im Site-Reliability-Engineering-Bereich, wo sind denn die Probleme, was kannst du mir als Tipps geben, wie wir beide jetzt zum Beispiel besser zusammenarbeiten können oder worauf sollte ich achten oder ähnliches. Einfach nur mal Fragen, um mal so ein bisschen das Gefühl dafür zu kriegen, wo sind denn gerade die Knackpunkte, wo sind jetzt gerade die Bereiche, die gerade knirschen zwischen den Abteilungen. Natürlich habe ich das auch auf meinem Level gemacht, das bedeutet meine direkten Kollegen, meine Manager-Kollegen und aber auch meine SAE-Kollegen, mit denen ich jeden Tag zusammenarbeite. Mit denen habe ich dann auch One-on-Ones gemacht, einfach mal eine halbe Stunde, einfach nur, um die Leute kennenzulernen. Ich arbeite jetzt gerade voll remote, ist natürlich dann alles ein bisschen schwieriger. Natürlich kann man Remote-Kaffee machen, ist aber nicht dasselbe, wenn man sich irgendwo vor der Kaffeemaschine trifft. Zum Beispiel viele Remote-Firmen bieten auch an, hey, flieg doch mal ins Headquarter, komm doch mal ins Berlin-Büro oder nach Helsinki oder Ähnliches. so ist das bei uns auch mein vorgesetzter hat mir immer angeboten komm doch einfach mal ins ins ins büro dann treffen wir uns da und so war das dann auch zwei wochen nachdem ich gestartet habe hat sich das komplette seit reliability europa team dann in helsinki im headquarter getroffen und wir haben einfach mal eine woche zusammen verbracht alles mit abends bowlen gehen essen gehen, einfach mal zusammen arbeiten, haben uns in einem Raum geschlossen und da habe ich dann auch meine ganze Woche einfach nur vorgepackt mit, Leute kennenlernen und so weiter und so fort. Kann ich wirklich nur empfehlen, wenn ihr keine strukturierte Liste bekommt, fragt einfach mal euren Vorgesetzten, hey nenn mir doch mal ein paar Namen und bitte nicht nur in eurem Team, sondern vielleicht auch mal im Finanzteam oder im Marketingteam oder im Supportteam, einfach mal quer durch die Firma, damit ihr mal ein Gefühl für die Firma kriegt.",
      "start": 3297790,
      "end": 3437893,
      "confidence": 0.7844265306122452,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man muss natürlich auch dazu sagen, das ist nicht jedermanns Sache und es gibt Leute, die kommunizieren einfach ungern und für die ist es vielleicht eine größere Hürde, sowas zu machen, das merkt man dann sehr schnell. Ich würde da auch niemanden ehrlich gesagt dazu zwingen, hatte auch so Leute im Team, die hatten einfach keine Lust drauf, die haben überhaupt nichts damit anfangen können und da bringt es natürlich auch nichts, diese Leute zu zwingen. Aber man kann probieren, ihnen zu erklären, wo die Vorteile davon liegen und vielleicht dann eben wenigstens ein paar Schlüsselpositionen rauspicken, mit denen sie dann vielleicht über auch sehr technische Sachen irgendwie sprechen können. Da ist es meistens dann leichter.",
      "start": 3438213,
      "end": 3474780,
      "confidence": 0.8082586206896553,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Generell beim Onboarding, Dokumentation ist unglaublich wichtig. Und auch wenn Leute nur und nur in Anführungszeichen vier Jahre bleiben, Dokumentation ist einfach key. Systeme ändern sich, dokumentiert das einfach. Jeder hat von euch bestimmt irgendwie so eine Definition of Done. Wenn ich dieses Ticket abgeschlossen habe, dann muss ich auch Dokumentation schreiben. Jetzt fasst euch mal bitte alle selbst an die Nase, wie oft macht ihr das wirklich? Ich habe diesen Eintrag in der Definition of Done sehr oft gesehen. Ich habe diesen Eintrag Sehr selten ausgeführt gesehen, wurde trotzdem gemerged. Ich denke, Dokumentation ist ein schweres, schweres Thema. Vielleicht machen wir da irgendwann mal auch mal eine schöne Folge zu. Aber ich bin der Meinung, Dokumentation ist zu dem Zeitpunkt, wo diese geschrieben wird, schon out of date. Und meines Erachtens nach ist das auch okay so. Denn es kommt immer ganz drauf an, welches Level an Dokumentation ist denn da? Wie tief geht's rein? Ist halbe Dokumentation oder eine 90 Prozent vollständiges Architekturdiagramm vielleicht nicht sogar besser als gar kein Architekturdiagramm. Gibt es natürlich viele Meinungen, dennoch hilft Dokumentation sehr. Was mir zum Beispiel aber auch hilft, wenn es keine Dokumentation gibt, fang doch einfach mal als Newbie an. Was ich zum Beispiel gemacht habe, ich habe mir ein bisschen Code genommen, ein bisschen Source Code von einer Applikation, habe das mal gelesen und Und hab beim Sourcecode lesen einfach ein Diagramm gemalt. Hab also die existierende Doku einfach erweitert. Hab das Diagramm, als ich fertiggestellt hab, meinen Kollegen mal rübergeschickt. Hey, pass mal auf, ich hab mir die Applikation XY angesehen. Denkst du, der Flow ist so ungefähr so richtig? Und die gucken rüber. Ja, zu 95 Prozent, außer der eine Pfeil da. Ah, okay. Bin ich nochmal zurückgegangen, hab's gelesen. Ah, okay, dieses Pattern wird hier angewandt. Dann wurde das Diagramm direkt mit übernommen. Ihr habt direkt was contributed. Super und was gelernt.",
      "start": 3475342,
      "end": 3584053,
      "confidence": 0.7870252365930598,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man darf da auch gar keine Angst haben, Leute anzusprechen und einfach mal zu fragen, okay, kannst du mir das erklären? Kannst du mir da ein Architekturdiagramm vielleicht mal aufmalen? Weil es gibt keine Dokumentation. Kann ja auch mal passieren, wie du schon richtig gesagt hast. Oder wenn das von der Managerseite halt einfach vielleicht organisiert wird, weil Als neue Person im Team bist du da vielleicht jetzt auch nicht zu einer sehr seniorigen Mitarbeiterin gehen und fragen, hey, kannst du mir mal eineinhalb Stunden irgendwas erklären? Das ist dann auch einfacher, wenn vielleicht auf der Manager-Seite das organisiert wird. Aber auch wenn man jetzt keine gute Dokumentation hat, was natürlich schlecht ist, aber soll ja vorkommen, dann würde ich zumindest solche Intro-Sessions machen, wo man wirklich die Architektur vielleicht on the fly aufzeichnet, einfach was erklärt und wo die Leute dann auch die Chance haben, dumme Fragen zu stellen. Und diese dummen Fragen sind meiner Meinung nach eines der mächtigsten und wertvollsten Dinge, die ein Newbie mit reinbringen kann in ein Team oder in eine Firma. Einfach diese dummen Fragen stellen. Warum hast du das so gemacht? Warum habt ihr das so gelöst? Warum habt ihr das nicht so gelöst? Und auch da glaube ich, dass ihr als Neulinge extremen Wert schaffen könnt. Einfach durch diese Fragen. Dummes, dummes Fragen. Weil die Seniors dann einfach irgendwann mal vielleicht drauf kommen, hm, ihr habt gar keine Antwort, warum wir das so gemacht haben. Das war eigentlich schon immer so. Und fangen einfach mal drüber denken an. Und das ist eigentlich sehr, es ist ein sehr mächtiges Tool und das sollte man wirklich nutzen. Auf beiden Seiten. Einerseits auf der Firmenseite, aber auch wenn man irgendwo neu anfängt. Und hoffentlich weiß das dann das Team und die Firma zu schätzen, wenn man sowas macht.",
      "start": 3584702,
      "end": 3678777,
      "confidence": 0.7935115511551158,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bei den dummen Fragen muss es ja noch nichtmals immer darum gehen, warum machen wir das eigentlich so und nicht so, sondern es kann auch viel einfacher sein. Was bedeutet eigentlich diese Abkürzung? Zum Beispiel habe ich jetzt gelernt, bei uns in der Firma nutzen wir sehr viel die Abkürzung CQ02 und FQ02 und das eine steht für KalenderQuarter02 und das andere steht für FinancialQuarter01. Das Finanzjahr beginnt eigentlich im zweiten Kalenderquartal, also im April, wohingegen das Kalenderquartal natürlich im Januar. Und diese beiden Abkürzungen waren mir jetzt nicht so bewusst, jetzt wusste ich, ich hab's einfach mal gefragt. Und auch der Matthias, schöne Grüße an ihn, hat mir erzählt, dass er in seiner neuen Firma einfach über Zeit immer mal wieder nachgefragt hat, wofür steht eigentlich diese Abkürzung, wofür steht eigentlich jene Abkürzung und hat dann ein Glossar erstellt, hat dann einfach mal alle Abkürzungen aufgeschrieben und was die eigentlich heißen und hat das dann ins Wiki gepackt. Und auf einmal kommen Leute zu ihm, diese Liste ist das Beste, was jemand in den letzten zwei Jahren hier gemacht hat, auch weil Leute schon drei Jahre da arbeiten und Begriffe teilweise noch nie übersetzt haben oder ähnliches. Das bedeutet, ihr könnt mit solchen ganz einfachen Mitteln schon wirklich Value schaffen und glaubt mir, ihr helft nicht nur euch, ihr helft auch noch ganz vielen anderen Leuten.",
      "start": 3679097,
      "end": 3760380,
      "confidence": 0.8155198237885463,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und sowas kann man einfach mal starten mit, wenn da jetzt eine neue Person anfängt, macht man einfach ein Git-Repo und fangt mal an zu dokumentieren. Einfach Dinge, die gefragt werden, Dinge, die auftreten und irgendwann wird es dann vielleicht zu einem perfekten Onboarding-Handbook Eines der bekanntesten Handbooks ist, glaube ich, von GitLab. Die haben sehr früh damit angefangen. Können wir gerne verlinken. Ist auch sehr umfangreich und beschreibt auch noch mehr natürlich, wie zusammengearbeitet wird, die ganzen Flows, die Kultur. Also da sind extrem viele Sachen drin und sowas entsteht natürlich mit der Zeit langsam, aber auch wenn man sich andere Projekte anschaut oder Open Source Projekte zum Beispiel oder kleinere Dinge, die man selber macht, Man macht die immer schnell, schnell und kaum bekommt man irgendwie Hilfe von außen oder es macht mal eine zweite Person mit oder eine dritte oder man bekommt Open Source Contributions von außen, merkt man schon, wie schwierig dieses Onboarding ist und wie viele Informationen fehlen. Das heißt, es ist nicht nur in Firmen so, das ist eigentlich überall in jedem Projekt so und wenn man da einfach mal probiert, anstatt Fragen einfach zu beantworten, auch die Antwort dann aufzuschreiben, dann entsteht eigentlich so ein Buch. Und das ist, glaube ich, ganz allgemein eine ganz gute Herangehensweise, weil man solche Sachen einfach mitschreibt, egal in was für einem Bereich, und man hat dann einfach so ein Handbuch am Ende oder einfach eine Datenbank von Antworten im Endeffekt, FAQs am Ende, die kann man dann auch in vielen Situationen verwenden, kann man verlinken, kann sagen, okay, Die Frage hat schon mal jemand gestellt, schau doch dort nach, da steht eine Antwort, kann dann auch dementsprechend was erweitern. Auch die Onboarding-Leute sollten idealerweise Zugriff haben, wenn ihnen irgendwo was fehlt, dann können sie direkt was ändern, sei es jetzt in dem Git oder in dem Wiki oder wo man dieses Handbuch auch immer speichert. Und man sollte die natürlich auch ermuntern dazu, wenn du da jetzt irgendeinen Fehler siehst, irgendwas outdated ist, bitte ändert es sofort. Und so hat man dann schlussendlich eine lebende Dokumentation oder ein Handbuch, das für Onboarding verwendet werden kann und wo man das Onboarding dann auch stark beschleunigen kann. Es gibt nichts Schlimmeres als Firmen, wo das Onboarding dann irgendwie womöglich zwei Jahre braucht und eigentlich ist das eine komplette Ausbildung, weil das Onboarding einfach daraus besteht, dass man irgendwie jemanden zwei Jahre shadowed und mit dem mitläuft, wie wenn man, keine Ahnung, eine Elektriker-Ausbildung macht, Da muss man einfach zwei Jahre da am Bau mitlaufen, damit man die Sachen versteht und dann alles weiß. Und das ist meiner Meinung nach kein Onboarding, vor allem, wenn wir jetzt wieder zurückdenken, wie oft die Leute heutzutage wechseln, die Firma wechseln und wie häufig das wird, dann kann man sich einfach nicht mehr leisten, dass man sagt, okay, man investiert ins Onboarding ein, zwei Jahre, weil wenn die Person dann nur vier Jahre da ist oder vielleicht zwei Jahre nur, dann geht die einfach nach dem Onboarding wieder. Also das muss man auf jeden Fall optimieren und durch so ein Handbook kann man das zum Beispiel optimieren.",
      "start": 3760821,
      "end": 3932828,
      "confidence": 0.8172514285714274,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Na ja, generell muss man aber schon sagen, Onboarding in einer neuen Firma braucht eigentlich so sechs bis neun Monate, bis man richtig produktiv ist. Und mit richtig produktiv meine ich nicht, bis man kontinuierlich Pull-Requests erstellt, sondern bis man weiß, wie die Prozesse laufen, bis man weiß, wen man bei welchen Problemen wirklich anspricht, bis man wirklich vollkommen unabhängig in der Firma angekommen ist und komplett agieren kann. Und nicht immer das Feedback von seinem Chef braucht, wen muss ich denn da ansprechen oder, oder, oder.",
      "start": 3933272,
      "end": 3962944,
      "confidence": 0.8545057471264365,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kommt natürlich drauf an, welche Rolle, meiner Meinung nach, aber ich würde es auch challengen und ich glaube, dass man das auch beschleunigen kann. Und da spielen halt viele Sachen mit, so wie die Dokumentation, aber auch zum Beispiel dieses ganze Wording oder Abkürzungen, die Firmen haben. Wenn halt überall solche Dinge verwendet werden, die nirgends dokumentiert sind oder wo man immer drei Leute fragen muss, bis man mal was versteht, was diese Abkürzung ist oder warum dieser Server Garfield heißt anstatt Mail Server, als ganz kleines dummes Beispiel, dann braucht Onboarding einfach länger. Und ich glaube, dass man da durchaus optimieren kann. Und klar, umso größer die Firma und umso umfangreicher der Job, gerade wenn es um Kommunikation geht und man Leute kennen muss als Lead oder Director, Klar wird das alles länger brauchen, aber ich glaube, man kann alles verbessern und man hat dadurch ja auch einen extremen Hebel, weil wenn man mehr Leute hat, die Onboarding machen, dann kann man bei jedem, bei jeder Person beim Onboarding einsparen. Und wenn man dann, um es nochmal zu erwähnen, ich habe auch so eine Statistik herausgesucht, in Österreich zum Beispiel, dass Leute, die 2010 einen Job begonnen haben, zwei Jahre später nur mehr 20% dieselbe Beschäftigung hatten. Das heißt 80% haben nach zwei Jahren gewechselt. Klar ist das jetzt über alle Jobs hinweg, aber in der IT wird es auch noch schlimmer werden, garantiert. Und meiner Meinung nach kann man das verbessern. Also ich bin nicht der Meinung, dass man automatisch sagen muss, das braucht sechs bis neun Monate.",
      "start": 3963779,
      "end": 4052955,
      "confidence": 0.836169230769231,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Man muss aber auch mal ehrlich zu sich sein, weil auch wenn ihr jetzt einen Onboarding-Prozess aufsetzt, die Firma ändert sich, ihr ändert den Onboarding-Prozess kontinuierlich. Der wird niemals perfekt sein, da wird immer irgendein Glitzsch drin sein und ihr werdet daran konstant rumschrauben. Findet euch damit ab, aber ihr bewegt euch auch in einer sich bewegenden Firma, das Business ändert sich und wenn es es nicht tut, dann ist das eher ein schlechtes Zeichen, weil die Konkurrenz schläft auch nicht und deswegen sollte euer Onboarding auch immer ein bisschen angepasst werden. Eine Möglichkeit, um die ganze Sache ein bisschen schneller zu machen, ist, dass die Zuweisung eine sogenannte Onboarding-Buddy ist. Nehmt einfach einen Senior-Engineer, einen Staff-Engineer, einen Principal-Engineer oder von mir aus auch einen Google-Fellow, hatten wir in einer der vorherigen Episoden, und assignt den einfach zu dem Neuling, zu der neuen Mitarbeiterin. Einfach so als Buddy für die Beantwortung aller Fragen. fürs Pair-Programming, um in den Code zu kommen, oder, oder, oder. So werden direkt Vertrauensbeziehungen auch aufgebaut und die Kommunikation sehr kurz gehalten, was die ganze Sache natürlich auch beschleunigen kann.",
      "start": 4053355,
      "end": 4112572,
      "confidence": 0.7950597826086955,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du jemals so ein Buddy-System gesehen, was funktioniert hat?",
      "start": 4112612,
      "end": 4116854,
      "confidence": 0.6426000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, in der aktuellen Firma sehe ich das gerade funktionieren.",
      "start": 4116895,
      "end": 4119877,
      "confidence": 0.8827999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wer ist dort dein Buddy? Also was für eine Art von Person ist das?",
      "start": 4120716,
      "end": 4124740,
      "confidence": 0.6893999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist ein Engineering-Manager auch auf meinem Level.",
      "start": 4125192,
      "end": 4127374,
      "confidence": 0.45924999999999994,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, also der macht das Gleiche wie du.",
      "start": 4127434,
      "end": 4129956,
      "confidence": 0.7637499999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der macht das Gleiche wie ich. Welche Kritik hast du, dass du das System noch nicht funktionieren gesehen hast?",
      "start": 4129975,
      "end": 4135140,
      "confidence": 0.752157894736842,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, für mich war eigentlich das immer, entweder es funktioniert im Team, dann ist eh das Team da, und da rentiert sich's meistens eigentlich nicht, weil das Team hat maximal sechs, sieben Leute. Da rentiert sich's nicht wirklich, einem Buddy zuzuordnen, meiner Meinung nach. Und die Systeme, die ich kenne und auch was ich so gelesen habe, sind eher so firmenweit, also teilweise sogar in anderen Abteilungen. Und das ist zwar nett, mit denen mal einen Kaffee zu trinken und einmal ein Gespräch zu führen, aber dann war das seltener hilfreich. Was ich so gehört habe ist, also gerade bei Trivago zum Beispiel, da hat es auch mal eine Zeit verschiedene Buddysysteme gegeben. Wenn die Leute aus dem gleichen Ausland kommen und zum Beispiel bürokratische Hürden haben, extreme bürokratische Hürden, also wenn du irgendwie halt keine Ahnung von Brasilien oder Kuba nach Deutschland kommst und du hast dann jemanden vor Ort, der schon das alles durchgemacht hat, dann ist es natürlich sehr hilfreich. Aber ehrlich gesagt, keine Ahnung, ob wir über einen Kubaner überhaupt hatten bei Trivago. Aber die Leute von demselben Land kennen sich normal recht schnell. Im Idealfall schon vielleicht beim Interview über irgendeine Form. Also keine Ahnung, ob man da wirklich einen Buddy braucht dafür.",
      "start": 4135160,
      "end": 4206163,
      "confidence": 0.8247980769230767,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich denke aber auch im Team rentiert sich die ganze Geschichte, weil nicht jeder ist wirklich komfortabel damit, jede Frage im kompletten Team zu stellen. Von daher, einfach mal ausprobieren. Ich denke, es schadet nicht. Wenn es nicht klappt, top, dann habt ihr halt einen Weg gefunden, wie es nicht klappt, aber ihr seid ja deswegen nicht auf die Nase gefallen.",
      "start": 4206703,
      "end": 4221238,
      "confidence": 0.7572622950819676,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, kann auf keinen Fall schaden, ja.",
      "start": 4221678,
      "end": 4223559,
      "confidence": 0.32657142857142857,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn ihr bisher noch keine Onboarding-Checkliste habt oder Offboarding-Checkliste, startet einfach mal, die muss nicht perfekt sein. Damit zu starten und etwas zu haben, ist besser als nichts zu haben, weil damit enabelt ihr einfach die Person selbstständig zu arbeiten und das wollt ihr im Endeffekt. Ihr wollt Mitarbeiter, die komplett selbstständig arbeiten, die nicht immer jeden kleinen Handschlag von euch vorgegeben bekommen und wenn ihr eine Onboarding-Checkliste habt mit ein paar Links, dann können die Leute in ihrem Tempo auch durch die Liste gehen und somit bereitet ihr sie schon ungefähr auf die Arbeit vor, die ihr so jeden Tag macht. Onboarding ist nie perfekt, kann es auch nicht sein und wir würden natürlich uns auch sehr freuen über eure Onboarding-Prozesse zu hören. Wie sehen die aus? Was habt ihr für Methoden, die wir einfach jetzt gar nicht erwähnt haben? Da bin ich gespannt auf euer Feedback.",
      "start": 4223599,
      "end": 4275061,
      "confidence": 0.8181824324324322,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ihr wie immer an stetisch.engineeringkiosk.dev senden könnt oder damit es alle sehen auf Twitter ENG Kiosk. Würde uns natürlich freuen, wenn wir da einige Tipps von euch bekommen oder wie ihr das so umsetzt. Und abschließend möchte ich euch alle nochmal daran erinnern, vor allem wenn ich an den Spruch denke von meinem Kollegen mit den drei, sechs und neun Jahren. Ich glaube, wenn man den in die Neuzeit übersetzt, dann sind wir da eher bei nach einem Jahr darfst du wechseln, nach drei Jahren sollst du wechseln und nach vier Jahren musst du wechseln. Schon fast angekommen und unter dem Gesichtspunkt investiert mal ein bisschen Zeit in Offboarding und Onboarding. Ihr bekommt sicher viel zurück und könnt auch viel Zeit sparen.",
      "start": 4275551,
      "end": 4315001,
      "confidence": 0.8397967479674792,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt jetzt natürlich nicht, dass ihr alle sofort auf den Jobmarktstress gehen solltet und in der aktuellen Firma kündigen solltet.",
      "start": 4315477,
      "end": 4322784,
      "confidence": 0.792,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ihr könnt euch ja um On- und Offboarding in eurer aktuellen Firma auch kümmern. Kümmern könnt ihr euch um Offboarding und Onboarding.",
      "start": 4322824,
      "end": 4333453,
      "confidence": 0.7123181818181819,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und bevor ihr wirklich überlegt zu kündigen, bin ich auch immer ein riesen Fan davon, mal mit eurem Manager oder Managerin zu sprechen, einfach über die Problematik, weil oft gibt es natürlich auch andere Stellen innerhalb der Firma, wo ihr auch Wert liefern könnt, wo vielleicht die Umgebung für andere ist. Das behalten wir uns immer für eine andere Folge vor. Wir brabbeln schon wieder viel zu lang und der Wolfgang noch viel länger. Ich glaube, wir müssen immer mal eine Analyse über Sprechzeiten machen, ob das hier wirklich 50-50 ist oder nicht eher so 80-20. Aber das lassen wir da mal für ein weiteres Hackathon-Wochenende. Wolfgang, war schön mit dir. Ich glaube, wir beenden die ganze Sache für heute. Wie immer freuen wir uns über Feedback. Wie immer freuen wir uns, wenn ihr uns im internen Zweck oder Freunden weiterempfehlt. Wir sind immer für euch da. Wir sind auch gerne offen für Kritik und für Gespräche. Falls ihr was Falsches gesagt habt, schickt doch einfach mal nen Rant drüber. Macht uns doch einfach mal platt. Gebt uns mal ordentlich Kontra. Da freuen wir uns auch drauf, weil deswegen machen wir es. Wir wollen natürlich auch von euch lernen. Ansonsten würde ich sagen, bis nächste Woche.",
      "start": 4333813,
      "end": 4395573,
      "confidence": 0.6935000000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ciao. Macht's gut.",
      "start": 4395993,
      "end": 4396754,
      "confidence": 0.308,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.7968564195571674,
  "audio_duration": 4402.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
