{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/64702e08-821e-4361-b271-d98525ec6667/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62xw0rbazf-1b88-48fc-92fd-c331fa8cbf11",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Schaltest du das Licht noch selbst oder automatisierst du schon? So oder so ähnlich könnte der Werbeslogan für diese Episode vom Engineering-Kiosk lauten. Nehmt euch mal ein paar Sekunden und schaut euch gerade um. Wie viele smarte Devices habt ihr ganz in eurer Nähe? Na, was habt ihr da so? Ein Handy? Eine Smartwatch? Eine Amazon Alexa? Ein Staubsauger-Roboter? Ein E-Auto? Eine Bluetooth-Audiobox? Oder ein Smart TV? Wenn mindestens eine Sache davon zutrifft, heiße ich euch im Home Automation Business willkommen. Und darum geht es auch in den nächsten Stunden. Wir geben euch einen leichten Einstieg in das Thema der Home Automation und teilen unsere Erfahrungen der letzten Jahre und worauf ihr achten solltet. Protokolle, Box of Shame, leere Batterien und Wohnungsgrundrisse in China. Viel Spaß beim Hören!",
            "start": 2970,
            "end": 46620,
            "confidence": 0.7683906249999995,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Andi war gerade auf unserer super neuen Homepage und da habe ich gelesen, ganz groß auf der Startseite steht, Engineering Kiosk, das Software Engineering Podcast oder der Engineering Podcast muss es ja heißen. Sind wir überhaupt noch ein Software Engineering Podcast? Wir machen ja nur mehr andere Sachen. Jetzt kürzlich hatten wir da Static Site Generator und wie baut man eine Webseite 1x1. Wo ist denn das Software Engineering geblieben? Heute kommst du wieder mit einem Topic-Vorschlag, wo wir auch wieder über kein richtiges Software-Engineering-Thema reden. Wo ist das Software-Engineering-Podcast geblieben?",
            "start": 50533,
            "end": 86048,
            "confidence": 0.7754945054945053,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In welche Kategorie würdest du denn diese Website-Erstellung und Static-Site-Generators packen? Jetzt sag nicht Frontend und jetzt sag nicht Frontend ist kein Software-Engineering. Da steig ich dir jetzt aber nach meiner Erfahrung aufs Dach, weil Frontend ist inzwischen so komplex geworden, da hab ich mir gedacht, hab ich mir auch mal einmal geschüttelt.",
            "start": 86088,
            "end": 101620,
            "confidence": 0.7748679245283019,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, so viele Freunde erhole ich mir jetzt sicher nicht. Oder Feinde. Je nachdem, wie man es sieht. Natürlich ist das Software Engineering. Ganz klar. Okay, dann kommen wir einfach zu der heutigen Hobby-Bastel-Folge für Software Engineers.",
            "start": 101900,
            "end": 115210,
            "confidence": 0.5956216216216217,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In der Tat. Heute ist wirklich mal so eine Hobby-Bastel-Folge. Und zwar, worum geht es heute? Heute geht es um Home Automation. Warum ist das ganze Thema relevant? Also, allein wenn ich das Internet öffne, dann lese ich gefühlt jedes dritte Wort IoT. Internet of Things. Gefühlt ist das ja überall. Ich glaube, ich weiß gar nicht, wie viele Sachen ich jetzt gerade in diesem Raum habe, in dem ich gerade stehe, die entweder mitlauschen oder irgendwelche Metriken tracken. Sei es die Temperatur des Raumes, mein Puls wegen meiner Smartwatch oder ähnliches. Wie viele Elemente hast du grade in deinem Raum, so in Sichtweite, die irgendwas mittracken grade von dir?",
            "start": 115250,
            "end": 152988,
            "confidence": 0.8337454545454545,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wahrscheinlich zu viele, aber ich probier wenigstens, dass möglichst wenig in die Cloud gesendet wird. Wie schaut das bei dir aus? Wie viel wird an Google, Apple oder an irgendeine chinesische Cloud gesendet von deinen ganzen Gadgets und sonstigen Devices, die da herumschwirren bei dir?",
            "start": 153028,
            "end": 169041,
            "confidence": 0.7884666666666669,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Als ich damit angefangen hab, hab ich da echt drauf geachtet. Und irgendwann hab ich mir, glaub ich, einen Staubsaugerroboter gekauft. von der chinesischen firma chiomi.",
            "start": 169081,
            "end": 178771,
            "confidence": 0.8065769230769231,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Xiaomi.",
            "start": 179590,
            "end": 179950,
            "confidence": 0.327,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weißt du eigentlich, wie man Huawei ausspricht?",
            "start": 179970,
            "end": 182372,
            "confidence": 0.5865714285714285,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Keine Ahnung.",
            "start": 182412,
            "end": 183253,
            "confidence": 0.6585000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Huawai?",
            "start": 184233,
            "end": 184854,
            "confidence": 0.676,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Huawai? Huawai, glaub ich.",
            "start": 184894,
            "end": 187555,
            "confidence": 0.55875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hauwi oder irgendwie so was spricht man. Also, spricht man ganz anders aus, als wie wir das eigentlich aussprechen. Naja, auf jeden Fall war dann dieser Staubsaugerroboter hier im Haushalt. Und dann fing's an. Die Frau wollte ihn unbedingt ausprobieren. Ja, komm, dann installier ich mal eben die chinesische App. Und ja, lass den doch einmal rumfahren und lass den doch den Grundriss deines Hauses scannen. Und flubs ist man im Grundrestaurant auf irgendeinem chinesischen Server. Und soll ich dir mal was sagen? Ich glaub, den ersten Staubsauger-Roboter, der hat hier vor zwei oder drei Jahren Einzug erhalten. Ich hab inzwischen zwei. Meinst du, ich hab's mal geschafft, die entweder zu flashen oder nur lokal einzubinden oder ähnliches? Nein, ich nutze immer noch diese chinesische App, weil ich's einfach noch nicht geschafft habe. Also, wie viele senden davon in der Cloud? Ich glaube jetzt gerade schon zu viele. Ich müsste da mal wirklich durchfegen und sagen, raus, raus, raus, raus, raus.",
            "start": 187616,
            "end": 238613,
            "confidence": 0.7676397515527952,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenigstens legen die nur auf irgendeinem Server in China und nicht bei Google oder so, weil Google könnte ja dann schon wieder passend irgendeine Werbung anzeigen für dein Haus, genau was dir noch fehlt oder wo der Roboter gemerkt hat, da ist noch ein leerer Platz in deinem Zimmer, da könnte gut irgendein cooler Schrank oder ein cooles anderes Device hinpassen.",
            "start": 238633,
            "end": 254382,
            "confidence": 0.7697540983606558,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also was der Roboter auf jeden Fall weiß ist wo ein Teppich liegt ja und wenn du auf 100 Quadratmeter oder ähnliches zwei Teppiche hast dann könnte da Teppichwerbung glaube ich ganz relevant sein.",
            "start": 254822,
            "end": 263914,
            "confidence": 0.7888823529411764,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es war vielleicht eine Marktlücke vielleicht sollte man sich mal sowas überlegen aber kommen wir zurück zum eigentlichen Thema Home Automation. Beziehungsweise Roboter spielen ja da eigentlich schon eine große Rolle bei Home Automation. Ist ja so die Einstiegsdroge fast für viele Leute mittlerweile.",
            "start": 263954,
            "end": 278364,
            "confidence": 0.7142954545454544,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weiß ich jetzt gar nicht, ob die die Staubsaugerroboter so die Einstiegsdroge sind. Ich glaube, da gibt es viel mehr Zeug.",
            "start": 278384,
            "end": 283787,
            "confidence": 0.8339523809523809,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber was war denn für dich die Einstiegsdroge? Was war denn dein erstes intelligentes Smart oder intelligent sind die Dinger ja meistens gar nicht, sagen wir mal Smart Device, wobei man immer fragt was Smart an den Dingen ist.",
            "start": 283827,
            "end": 294815,
            "confidence": 0.7156153846153845,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Einstiegsdroge war bei mir die Technikspielerei, gar nicht so das eine Device. Und mit der Technikspielerei, die wurde daraus geboren, dass meine Frau sagt, laut Gesetz muss jeder Haushalt jetzt einen Rauchmelder haben und wir haben keine, kaufen wir einen Rauchmelder. Und ich gehe ja nicht los in den Baumarkt und kaufe irgendeinen Rauchmelder.",
            "start": 294855,
            "end": 313069,
            "confidence": 0.7845454545454547,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Warum?",
            "start": 313249,
            "end": 313790,
            "confidence": 0.55,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich kaufe natürlich einen vernetzten Rauchmelder.",
            "start": 313830,
            "end": 315551,
            "confidence": 0.7406666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das heißt, wenn es dann mal wirklich brennt, dann probiert dieser Rauchmelder, sich zu connecten zu dem zentralen Device, was gerade gecrashed ist und genau niemand wird informiert, dass irgendwas passiert.",
            "start": 315571,
            "end": 325393,
            "confidence": 0.7695483870967742,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das ist es nämlich gerade nicht. Bei Rauchmeldern sieht die ganze Sache ein bisschen anders aus. Ein vernetzter Rauchmelder bedeutet, ich habe einen im Keller, ich habe einen im Wohnzimmer und in der Küche und wenn es im Keller brennt, geht auch der im Wohnzimmer los. Das ist ein vernetzter, weil die in einer Gruppe sind. Aber die Einstiegsdroge war, ich kaufe ja nicht irgendeinen Rauchmelder, ich kaufe mir so einen vernetzten. Und dann habe ich mal ein bisschen weiter gedacht, hey, wie geil wäre das eigentlich? Ich will ja eh eine Alarmanlage haben. Wie geil wäre das denn eigentlich, wenn ich einen Rauchmelder auch in die Alarmanlage integrieren kann? Und tada, das kann ich jetzt. Weil, wenn du eine Gruppe hast, eine Gruppe von Rauchmeldern, die muss ja auch softwareseitig abgebildet werden, die wird aber auch auf den Rauchmeldern selbst gespeichert, dann bedeutet das auch, dass du softwareseitig einen virtuellen Rauchmelder reinsetzen kannst. Und wenn du einen virtuellen Rauchmelder in die Gruppe setzen kannst, dann kannst du dem auch Feuer vortäuschen.",
            "start": 325773,
            "end": 376261,
            "confidence": 0.7865838150289016,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wirklich impressive, für alle zur Information, die sich jetzt gedacht haben, wie der Andi gesagt hat, ich brauche eine Alarmanlage, dass der Andi ein sehr ängstlicher Mensch ist und unbedingt eine Alarmanlage haben will. Wie oft wurde bei dir eingebrochen schon?",
            "start": 376501,
            "end": 387487,
            "confidence": 0.790780487804878,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube in den letzten fünf oder sechs Jahren waren sie zweimal oder dreimal drin und haben es ungefähr 15 mal versucht, also Macken an Scheiben und Türen habe ich überall Aber das war so eigentlich die Einstiegsdroge. Das bedeutet, ich habe ein Requirement bekommen, ein sehr wichtiges, und dies habe ich erfüllt. Das geht natürlich nicht ganz einfach, und deswegen hat ich als Softwareingenieur den Hang zur Technikspielerei ein bisschen entwickelt.",
            "start": 387647,
            "end": 414576,
            "confidence": 0.8479722222222223,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Lass mich raten, es war dann auch overengineert. Du wolltest das dann schon auch wieder irgendwo zentral connecten. Also sprechen die Rauchmelder nur untereinander, oder gibt's da irgendeine zentrale Komponente, die dann auch irgendwie angebunden ist an ein zentrales System oder so was? Okay, also ist es wieder overengineert, eh klar. So würdet ihr es auch machen, genau so.",
            "start": 415276,
            "end": 434628,
            "confidence": 0.6969491525423727,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber generell ist das Thema halt relevant. IoT ist überall. Ich glaube, ihr könnt nicht nach Weihnachten gehen und die Eltern oder Omas und Opas, die haben...",
            "start": 434668,
            "end": 444335,
            "confidence": 0.8558148148148149,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nach Weihnachten gehen?",
            "start": 444395,
            "end": 446736,
            "confidence": 0.8836666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, an Weihnachten nach Hause gehen und die haben so einen digitalen Bilderrahmen oder vielleicht auch ein iPhone oder ein Smart TV oder oder oder. Dann Software-Ingenieure haben in der Regel den Hang zur Technik-Spielerei und natürlich Automatisierung, Automatisierung, Automatisierung. Ich meine, wer möchte denn heutzutage noch von der Couch aufstehen und das Licht am Schalter anmachen? Dann nimmt man doch lieber sein Handy, oder?",
            "start": 446756,
            "end": 472169,
            "confidence": 0.804923076923077,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und steht dann auf, setzt sich zum Computer, repariert das zentrale System, um dann das Licht einzuschalten.",
            "start": 472209,
            "end": 477251,
            "confidence": 0.7922941176470589,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und genau das ist auch ein Teil dieser Folge heute. Sprechen wir mal ganz kurz darüber, was wir in dieser Episode behandeln. Wir behandeln erstmal von eurer Perspektive aus, von der Wohnung oder Haus oder WG-Zimmer, dass wir das alles aus der Perspektive von existierenden Strukturen besprechen. Das bedeutet, wir haben jetzt hier keinen Neubau. Wir bauen nicht ein neues Haus, wir bauen nicht eine neue Wohnung, wo alles von Grund auf darauf geplant wird und ausgelegt ist, sondern existierende Strukturen. Das bedeutet, all das, was wir hier besprechen, könnt ihr in eurem Haus gekauft oder gemietet Wohnung gekauft oder gemietet wg zimmer oder von mir aus auch in einem hostel machen das ist alles möglich das ist alles portable der primäre fokus bei uns. Ist auch meist kabel los das bedeutet kabellose komponenten die man halt irgendwo hinstellen kann natürlich hier und da wird vielleicht auch ein kabel gezogen zum beispiel im garten oder ähnliches aber, Das ist so die Erfahrung, die Wolfgang und ich gemacht haben. Wir sind sehr viel auf kabellosen Komponenten unterwegs. Dann, anwendungsfalltechnisch bewegen wir uns nur im privaten Bereich, also Hobbybereich, nichts Professionelles. Also das bedeutet, wenn ihr das irgendwie gegen Geld machen wollt, müsst ihr euch gegebenenfalls hier und da mit stabileren Systemen beschäftigen, beziehungsweise vielleicht mal mit einem Elektriker unterhalten. Ich glaube, die finden das, was wir jetzt hier so hobbytechnisch machen, nicht so geil im professionellen bereich dafür machen wir das alles sehr praktisch orientiert und was wir nur in dieser episode anschneiden und nicht in die tiefe gehen sind neue protokolle allianzen bei verschiedenen protokollen oder oder oder da bewegt sich unglaublich viel im markt das können wir alles nicht in dieser episode behandeln und Ich glaube, so tief beschäftigen wir uns da gar nicht mit, weil gefühlt kommt jede Woche eine neue Protokollallianz von irgendwelchen Firmen auf und dann hört man fünf Jahre nichts und bis die Komponenten, die dieses Protokoll dann sprechen, wirklich im Handel sind und für uns zugänglich, sind ja eh zehn Jahre vergangen.",
            "start": 477291,
            "end": 597152,
            "confidence": 0.8299437869822484,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also es geht einfach darum, wie kann man denn schnell einsteigen in das ganze Thema, wie kann man irgendwo starten, möglichst lean. Alle Hörerinnen, die uns da öfter zuhören, wissen ja, dass das unsere präferierte Herangehensweise ist. Einfach lean, irgendwann mal losstarten und schauen, wie sich das Ganze entwickelt. Und das wollen wir auch so ein bisschen erklären, wie wir angefangen haben, was unsere Systeme sind und wie man reinwachsen kann. Und für alle anderen, die schon ein System haben, die können sich vielleicht anhören, wo die Unterschiede liegen oder uns auch danach berichtigen, was denn viel cooler wäre.",
            "start": 597790,
            "end": 629189,
            "confidence": 0.8472222222222223,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was wir explizit ausklammern, sind Sachen wie KNX. Das ist zum Beispiel einer der Standards und Komponenten und Co., die man bei einem Neubau von einer Hauswohnung irgendwie vielleicht mit einplant. Also sowas lassen wir mal heute raus. Noch ein kleiner Disclaimer. Wolfgang und ich teilen unsere Learnings hier. Das mag vielleicht irgendwie negativ klingen, weil wir ziemlich viele Herausforderungen gleich besprechen werden oder Sachen, die uns einfach nur um den Sack gehen. So meinen wir das aber alles gar nicht. alles das was wir besprechen macht es einfach das macht mega spaß ist zwar ein totales zeitgrab aber das kann man auch ohne probleme über jahre hinweg mal hier und da abends auf der couch machen und man hat dann immer spaß man freut sich immer und immer wenn man sich freut und dann irgendwas testet und der der partner oder die partnerin sitzt dann daneben und denkt sich wieder.",
            "start": 629669,
            "end": 677007,
            "confidence": 0.7706158940397353,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ziel sein ungefähr.",
            "start": 677147,
            "end": 678167,
            "confidence": 0.63275,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wolfgang, wie startet man The Lean Way? Ich habe jetzt nichts, ich habe jetzt hier einen Laptop. Was brauche ich, um zum Beispiel mit Home Automation zu starten? Wie kriege ich eine Lampe mit einem Button, Knopf, Druck auf einem WebUI zum Leuchten?",
            "start": 678678,
            "end": 695403,
            "confidence": 0.8006046511627908,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist schon mal grundsätzlich kein Lean-Way zu starten, weil man eine Web-UI fordert, das ist ja dann schon eh schon relativ viel. Ich glaube das einfachste, was man eigentlich machen kann, ist man geht irgendwie, keine Ahnung, zum Ikea, zum Lidl, kauft sich da irgendein Device und eine Fernsteuerung und hat man schon in irgendeiner Form Home-Automation. Das ist das Einfachste, was man machen kann, wobei da hat man natürlich jetzt nicht beachtet im Hintergrund, was für Protokoll läuft da, was für System läuft da, braucht man irgendeine Cloud, braucht man keine Cloud. Also das sollte man sich vielleicht im Vorfeld mal überlegen, in welche Richtung man da gehen will, ob das auch relevant für einen ist, ob da alle Daten in die Cloud gesendet werden, ob man Internet benötigt, um was einzuschalten oder nicht. Wir sind eigentlich beide eher auf dieser Schiene, dass man weniger mit Cloud macht und irgendein zentrales Device zu Hause hat, was das alles übernimmt und man keine Internet-Connection nach außen zum Beispiel braucht und dementsprechend muss man sich natürlich auch die Komponenten auswählen. Also recht einfacher Start ist wahrscheinlich, dass man mal ein, zwei Devices, zum Beispiel einfach eine Glühbirne kauft, die smart sind, kostet um die 30 Euro, würde ich sagen, und sich dann vielleicht einen zentralen Server nimmt, auf dem man Home Assistant installiert. Server klingt jetzt viel, im Normalfall sind es Raspberry Pis zum Beispiel, oder es gibt auch Systeme, die man dementsprechend kaufen kann, aber die hängen dann meistens wieder irgendwie mit der Cloud zusammen. Also das Einfachste ist, das zentrale System auf einen Raspberry Pi zu installieren, Home Assistant drauf zu knallen. Das ist so eine Software, die eigentlich alles steuern kann und man hat dann auch so eine Web-UI, wie sie der Andi gerne fordert. Also da ist man dann so kostenmäßig. Raspberry Pi sind etwas teurer geworden in letzter Zeit. Mit einer SD-Karte, den zwei Glühbirnen ist man auf jeden Fall noch unter 100 Euro unterwegs.",
            "start": 696043,
            "end": 802200,
            "confidence": 0.7926484848484842,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Werden wir mal ein bisschen konkreter geht einfach nach ikea holt euch eine tratt free lampe led lampe tratt free tratt free kannst du schwedisch.",
            "start": 802960,
            "end": 813791,
            "confidence": 0.69616,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Tratt ist sicher tratt free.",
            "start": 813811,
            "end": 816793,
            "confidence": 0.7422,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die günstigste kostet jetzt hier acht euro energieeffizienz klasse f. So billig sind die schon wieder, unglaublich. Die sind richtig günstig. Also bei Ikea zum Beispiel, das ganze Ikea Home Automation Zeug, das ist wirklich nicht schlecht. Ist nicht super sophisticated, aber ihr kauft ja nicht direkt 30 Glühlampen, ihr kauft erst mal eine. Zum Beispiel hier so ein Funkbewegungsmelder kostet 12 Euro von Ikea. Ist schon mal eine super Sache, damit seid ihr dann bei 20 Euro, ein Funkbewegungsmelder und eine Glühbirne, top. Dann vielleicht habt ihr noch irgendwie einen Raspberry Pi rumfliegen, top, den nehmt ihr als Start, super Sache. Dann braucht ihr noch ein sogenanntes ZigBee-Gateway in der Hinsicht, wenn ihr zum Beispiel die Komponenten von Ikea nutzt. Das ist alles das Protokoll ZigBee, da kommen wir gleich noch zu. Da kostet der USB-Dongle so ungefähr 30, 35 Euro. Und dann braucht ihr noch für den Raspberry Pi eine SD-Karte. Kostet auch nochmal, weiß ich nicht, 5, 8 Gigabyte, 10 Gigabyte, 2 Gigabyte, was gibt es da inzwischen?",
            "start": 816813,
            "end": 871247,
            "confidence": 0.7085789473684211,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Reicht völlig. Das schau mir an, wo du eine 2 Gigabyte SD-Karte heutzutage noch herbekommst.",
            "start": 871347,
            "end": 876149,
            "confidence": 0.6092666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Eine SD-Karte kauft ihr euch, da seid ihr dann auch nochmal bei ein paar Euro und ab da könnt ihr loslegen. Die könnt ihr dann in eurem Büro einfach aufbauen und damit werdet ihr eigentlich schon am Start, wenn ihr natürlich schon Devices habt, wie zum Beispiel ein iPhone oder ein Android.",
            "start": 876973,
            "end": 896243,
            "confidence": 0.7586346153846153,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Top!",
            "start": 896283,
            "end": 896423,
            "confidence": 0.962,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Habt ihr schon was oder ihr habt ein relativ modernes auto zum beispiel ich habe ich fahren kia und mein mein kia hat auch eine simkarte drin das kann ich in die home automation reinsetzen da kann ich zum beispiel mein auto auf und abschließen von meinem computer aus.",
            "start": 896943,
            "end": 910015,
            "confidence": 0.7853673469387754,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kommen wir da jetzt dann wenigstens geld von kia dass wir da schon wieder kia werbung machen du kannst dann im tweet wieder kia menschen menschen vielleicht bekommen wir dann von kia in zukunft was.",
            "start": 910035,
            "end": 921426,
            "confidence": 0.7594857142857141,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was möchtest du denn von kia bekommen.",
            "start": 921466,
            "end": 922867,
            "confidence": 0.6934285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja von Rode haben wir schon eine Tasse bekommen, also vielleicht kommen wir von Kia dann an Reifen oder so.",
            "start": 923312,
            "end": 929668,
            "confidence": 0.842,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie ihr merkt sind wir big im Influencer-Business. Nee, aber schaut einfach mal, was ihr eigentlich so im Haus habt. Habt ihr einen Amazon Alexa, einen Apple HomePod oder habt ihr einen Staubsauger-Roboter? Habt ihr vielleicht irgendwo eine WLAN-Box, zum Beispiel irgendwie so Bose oder irgendwie so ein Soundsystem? Euren Fernseher. Euren Fernseher könnt ihr auch ganz normal da einbinden. Euren Drucker. Schaut einfach mal, was ihr da habt. Bevor ihr zu Ikea geht, macht doch einfach mal folgendes. Schnappt euch euren Raspberry Pi, installiert Home Assistant auf der SD-Karte und startet das einfach mal. Weil Home Assistant hat ein Netzwerk Autodiscovery und das ist schon mal super. Da könnt ihr auf die Fritzbox mit einbinden und damit könnt ihr schon mal ein bisschen rumspielen. Aber wenn ihr das richtige Feeling haben wollt, kauft euch eine Glühbirne, weil ich sag's euch, wenn ihr die eingewunden habt und die leuchtet auf einmal, weil ihr eine Automation eingestellt habt, jeden Abend, wenn die Sonne untergeht, geht diese Glühbirne an. Ich sag's euch, ihr lauft nackig durch die Wohnung, weil ihr habt so viel Spaß dabei. So ging es mir zumindest.",
            "start": 929688,
            "end": 992399,
            "confidence": 0.7551808510638296,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vielleicht noch mal zur Erklärung, was Home Assistant eigentlich ist. Also Home Assistant ist eigentlich eine Plattform für Home Automation, die extrem viel Protokolle unterstützt, Hardware unterstützt. Also da kann man auch irgendwelche Infrarot Connections anbinden, Infrarot Hardware, Bluetooth Devices, klarerweise über IP, über ZigBee, wenn man die dementsprechende Hardware hat. Also es ist extrem vielseitig und ist glaube ich mittlerweile eines der bedienerfreundlichsten Systeme, würde ich mal sagen. Andi hat immer noch ein Problem damit, weil er einmal ein Bull-Request an die Creator von Home Assistant gesendet hat und die das abgelehnt haben. Darum ist er immer noch kein großer Freund von Home Assistant. Aber es ist wirklich ein cooles Tool, was sich super schnell installieren lässt. Man braucht nur die SD-Card, kann die super einfach drauf spielen auf die SD-Card Raspberry Pi und es bootet hoch und hat alles inkludiert, um irgendwie loszustarten und ist Open Source und hat keine Cloud im Hintergrund.",
            "start": 992659,
            "end": 1047035,
            "confidence": 0.7852516129032258,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Home Assistants ist ein Megaprojekt. Alles geschrieben in Python. Ich liebe das Projekt auch. Es ist granatenhaft. Die Story mit der Pull-Request, die der Wolfgang gerade erwähnt hat, die regt mich immer noch ein bisschen auf. Da ging's nicht darum, dass sie nicht akzeptiert wurde, sondern eher, wie ich behandelt wurde. Da hab ich eigentlich was anderes erwartet, ein bisschen freundlicher. Aber nun gut, lassen wir das.",
            "start": 1047376,
            "end": 1069432,
            "confidence": 0.7827014925373137,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wer mehr dazu wissen will, wie man das richtig machen würde im Open-Source-Bereich, da hört sich die Folge vier an, zu Open-Source, wo der Andi auch ganz genau erklärt, wie man so was richtig macht, damit die Leute eben nicht gepisst sind und dann nie mehr was einreichen.",
            "start": 1069472,
            "end": 1082920,
            "confidence": 0.8296734693877549,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Richtig ist vielleicht das falsche wort wie ich es erwarten würde ja also wie mein richtig in der hinsicht aussieht aber bisher habe ich noch kein anderes richtig gehört der das ähnliche nett und menschenfreundlich ist.",
            "start": 1083420,
            "end": 1095730,
            "confidence": 0.8534166666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber die Software ist wirklich super und vor allem für Einsteiger super geeignet.",
            "start": 1096402,
            "end": 1100826,
            "confidence": 0.7886923076923077,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Home Assistants wurde mit dem Hintergrund gegründet, die Daten bei dir zu behalten. Wirklich Data Privacy First. Das waren Holländer, die das gestartet haben. Und der Hauptfokus ist wirklich, alles bei sich selbst zu betreiben und nicht zu den großen Unternehmen zu shippen. Ist in peisen geschrieben wie bereits gesagt hat millionen von plugins jeder hersteller ist irgendwie angebunden du kannst eigene plugins reinhängen offene apis und ist einer der top fünf oder top zehn größten github projekte auch mit den größten contributions also das ist inzwischen ein richtiges schiff geworden.",
            "start": 1100866,
            "end": 1137797,
            "confidence": 0.8442527472527468,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und was mich bisher wirklich beeindruckt hat ist, ich verwende es jetzt, glaube ich, über zwei Jahre und ich hatte von Home Assistant nie irgendwie einen Ausfall auf meinem Raspberry Pi, trotz Stromausfällen und allen möglichen sonstigen Problemen. Und ich update eigentlich immer sofort auf die neue Version, was ja normal jeder Software-Ingenieur mit Hausverstand nicht macht. Aber ich hatte bisher noch nie ein Problem mit meinem Setup und es hat immer funktioniert und auch jedes Update hat ohne Probleme funktioniert. Also das war, was mich dann schon eigentlich gewundert hat und ohne zu wissen, was im Hintergrund abgeht, war das schon eigentlich sehr beeindruckend, weil wenn man Linux-Updates macht vom Betriebssystem, einfach sobald die Version draußen ist, hat man ein anderes Erlebnis. Also ich bin da schon relativ glücklich damit, muss ich sagen.",
            "start": 1138337,
            "end": 1182622,
            "confidence": 0.8117537313432832,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Summa summarum mit unter 100 Euro könnt ihr da schon mal ein kleines Setup fahren. Wolfgang, jetzt beschreib mir doch mal bitte dein Setup zu Hause. Wie sieht das aus? Was hast du im Einsatz? Gib mir mal einen Rundumschlag.",
            "start": 1183373,
            "end": 1196364,
            "confidence": 0.698325,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wie schon erwähnt, ihr habt meinen Raspberry Pi mit Home Assistant. Das ist so meine Kernkomponente, der zentrale Server und von dem aus wird eigentlich alles gesteuert und angesprochen. Ich setze sehr stark auf ZigBee, auf dieses Protokoll. Es ist ein Mesh-Protokoll, was sehr einfach ist. Mittlerweile, ich habe gerade kürzlich gelernt, wir können es auch nur in die Shownotes packen, dass das bei irgendwelchen Satelliten auch verwendet worden ist schon im Weltraum. Also das Protokoll an sich ist eigentlich sehr cool. Man braucht da nur die richtige Hardware dazu. Wenn man da zu billige Hardware kauft, zu alte Hardware, hat man unter Umständen Probleme. Also da können wir gerne auch nochmal was verlinken, was der sinnvolle ZigBee Dongle ist, den man so in den Raspberry Pi reinstrecken kann bei USB, damit man eben eine Brücke hat zu dem ZigBee Mesh. Und dieses ZigBee Mesh wird dann über alle Devices aufgebaut. Also jedes Device kann mit anderen Devices kommunizieren, das heißt zum Beispiel zwei Glühbirnen können untereinander kommunizieren. Und so wird auch ein Netz aufgebaut, das geografisch über die Wohnung, über das Haus verteilt ist und somit hat man auch keine Probleme mit der Distanz, weil ZigBee an sich geht nur so 10, 15 Meter, würde ich mal sagen, im Normalfall 20 Meter, vielleicht je nach Mauern. Und wenn man mehrere Devices hat, Glühbirnen zum Beispiel, jede Glühbirne ist auch gleichzeitig ein Router und kann die Pakete weiter routen zur nächsten Glühbirne. Das heißt, auch wenn Devices weiter entfernt sind, dann können die über dieses ZigBee-Protokoll, über dieses ZigBee-Mesh angesprochen werden. Ich setze eigentlich sehr stark auf diese ZigBee-Mesh. Ich habe keine IP-Komponenten im Einsatz, sondern versuche alles über ZigBee zu machen. Super einfaches Protokoll. Man braucht nichts flashen. Die Dinger können automatisch per Definition, weil sie nur in diesem ZigBee-Mesh kommunizieren können, nicht in die Cloud telefonieren. Das heißt, man hat auch keine Privacy-Issues. Man kann wirklich diese, zum Beispiel Ikea, Tratvi ist auch ZigBee, einfach verwenden. Man braucht keine Angst haben, dass da irgendwie irgendwas mit der Cloud kommuniziert, irgendwie ein Problem macht, weil das eben ein sehr dummes, unter Anführungszeichen, Protokoll ist, was eben nur lokal kommunizieren kann. Und darum setze ich sehr stark auf ZigBee. Und in meinem ZigBee-Netzwerk sind nämlich primär Lampen eingebunden, Temperatursensoren, Dürrsensoren und meine Heizungssteuerung ist auch auf ZigBee. Das ist eigentlich bei mir, was ich so über Home Assistant steuere.",
            "start": 1196404,
            "end": 1344025,
            "confidence": 0.8108425000000006,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, cool. Mein Setup sieht ein bisschen anders aus. Ich bin nicht mehr auf einem Raspberry Pi. Der Raspberry Pi, damit hab ich gestartet, der hat mir dann irgendwann die SD-Karte vollgeschrieben und die SD-Karte ging dann hops wegen zu vielen Schreibzugriffen. Muss auch zugeben, war bestimmt auch keine moderne SD-Karte, sondern irgendeine, die ich im Schrank gefunden hab.",
            "start": 1344468,
            "end": 1363379,
            "confidence": 0.7801694915254234,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die 2-Gigabyte-SD-Karte.",
            "start": 1363399,
            "end": 1365280,
            "confidence": 0.6795,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Könnte gut sein. Ihr müsst wissen, Home Assistant unten drunter hat eine SQLite-Datenbank. Eine SQLite-Datenbank, Entschuldigung. da haben sie am anfang recht viel drauf geschrieben und die musste man ab und zu mal irgendwie so ein bisschen aufräumen und gegebenenfalls hatte ich da vielleicht auch noch ein paar andere sachen die ziemlich viel traffic auf der fcsd karte gemacht haben, wie dem auch sei irgendwann ist mir das ding hops gegangen und habe ich gedacht ich will ja sowieso mehr zu hause machen ich will ja mehr zu hause hosten und da habe ich dann, mir einen Intel NUC gekauft, das ist ein kleiner stromsparender Computer, Multicore, habe ich da eine 2TB drin und da drauf habe ich dann Linux laufen und da drauf habe ich dann Home Assistant in ein paar Docker Containern laufen.",
            "start": 1365300,
            "end": 1407445,
            "confidence": 0.7627925925925924,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kannst du da dann auch so super easy updaten?",
            "start": 1407925,
            "end": 1410167,
            "confidence": 0.6843333333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, kann ich. Kann ich auf Knopfdruck und der tauscht mir unten drunter den Docker-Container aus und allem drum und dran, das funktioniert.",
            "start": 1411028,
            "end": 1415973,
            "confidence": 0.7090000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das macht Home Assistant selber oder hast du das irgendwie implementiert?",
            "start": 1415993,
            "end": 1419036,
            "confidence": 0.6191818181818183,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ne, das macht Home Assistant selber. Home Assistant selbst bietet ein paar verschiedene Installationsmethoden. Docker oder Home Assistant OS oder du installierst das komplett in der eigenen VM oder ähnliches. Du musst natürlich dann ein paar Pakete installieren und gibst dann eigentlich Home Assistant auch so ein bisschen die Verantwortlichkeit über deinen Server oder deine VM, damit er auf das Netzwerk zugreifen kann und so weiter und so fort. Aber dann ist das relativ cool. Neben Home Assistant habe ich noch ein FAME. Das ist auch ein Heimatomatisierungstool geschrieben in Perl.",
            "start": 1419357,
            "end": 1450952,
            "confidence": 0.7747802197802199,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In Perl.",
            "start": 1451012,
            "end": 1452653,
            "confidence": 0.757,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In Perl. Relativ alt und die UI sieht auch so aus, als wäre die Software in Perl geschrieben. Also die UI ist so 1900, so gefühlt.",
            "start": 1452713,
            "end": 1462991,
            "confidence": 0.7117692307692308,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Warum verwendest du das noch?",
            "start": 1463031,
            "end": 1464471,
            "confidence": 0.7026,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich verwende das, weil es meines Erachtens nach keine bessere Connection zu Homematic-Hardware gibt. Da kommen wir dann gleich zu.",
            "start": 1464511,
            "end": 1470973,
            "confidence": 0.7798,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber die könntest du ja auch in Home Assistant ohne Probleme einbinden, oder?",
            "start": 1471277,
            "end": 1474678,
            "confidence": 0.6697692307692308,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber die Story mit den Rauchmeldern, die ich dir gerade genannt habe, mit den virtuellen Rauchmeldern, Fame kann das, Home Assistant kann das nicht. Und ich habe es einfach noch nicht implementiert. Irgendwann, also das steht auf meiner ganz langen Liste von Open Source Contributions, die ich mal machen möchte, möchte, dass man die Möglichkeit hat, in Home Assistant auch einen Homematic virtuellen Rauchmelder einzufügen, damit ich genau diese Funktionalität habe. Aber mein FEM-System mit Hometic habe ich verbunden. Die quatschen über MQTT miteinander. Das bedeutet, meine Rauchmelder senden auch MQTT-Nachrichten und Home Assistant horcht dann auf MQTT-Nachrichten und somit kann ich die beiden Systeme halt steuern.",
            "start": 1474738,
            "end": 1508266,
            "confidence": 0.7452962962962969,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist MQTT? Kannst du das nochmal erklären? Nachdem wir jetzt ein Podcast sind, sehen die Leute das leider nicht, dass Andi jetzt eigentlich googelt nach dieser Definition, was MQTT ist, weil er das natürlich nicht aus dem Stehgreif kann.",
            "start": 1508326,
            "end": 1520988,
            "confidence": 0.7674249999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hier im Podcast muss man ja ganz genau aufpassen, was man sagt, weil sonst kriegt man nämlich nach einer Episode wieder ein Rant von links oder rechts und wird auseinandergenommen. Deswegen habe ich jetzt mal gegoogelt. Also MQTT steht für Message Queuing Telemetry Transport und es ist eigentlich ein leichtes und einfaches Messaging-Protokoll. Für so unglaublich viele IoT-Use-Cases wird MQTT genutzt. Könnt ihr euch vorstellen, wie ein ganz ganz ganz ganz kleines Queuing-System mit leichten Nachrichten zum Beispiel. Es gibt auch eine Komponente, die nennt sich ZigBee to MQTT. Das bedeutet, Jede Nachricht, die vom ZigBee-Protokoll gesendet wird, geht dann über den MQTT-Server. Und da gibt es dann auch sogenannte Topics, das bedeutet Kanäle, wo ihr drauf lauschen könnt. Und da könnt ihr Nachrichten reinpacken. Ähnlich wie ein PubSub auf Google oder Amazon SQS oder ein RabbitMQ oder ähnliches, halt nur ein bisschen schlanker.",
            "start": 1521028,
            "end": 1576033,
            "confidence": 0.7687847222222222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, es gibt sogar MQTT-Setups in Google Cloud oder so, die man theoretisch verwenden könnte, oder?",
            "start": 1576783,
            "end": 1582129,
            "confidence": 0.7180588235294117,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gibt's 100 Prozent, ja. Und der Go-To-Message-Broker, opensource-technisch, ist eigentlich Mosquito. Wenn ihr was mit MQTT machen wollt, da seid ihr im IoT-Bereich auf jeden Fall ganz vorne dabei.",
            "start": 1582149,
            "end": 1594262,
            "confidence": 0.7464137931034484,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also das ist eine Komponente, die innerhalb von Home Assistant dann läuft, aber eigentlich Plug-in ist, also ein eigenständiges System, was nur dafür verantwortlich ist, die Messages hin und her zu schmeißen zwischen ZigBee Hardware zum Beispiel und Home Assistant.",
            "start": 1594602,
            "end": 1610644,
            "confidence": 0.8483250000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, ich würde euch aber nicht empfehlen damit zu starten, ich würde euch wirklich, falls ihr da noch neu seid in der ganzen Thematik, startet einfach ohne MQTT, startet einfach ganz blank. Später, wenn ihr dann solche Sachen machen wie wollt, wie verschiedene Systeme miteinander zu connecten, oder noch mehr Komponenten reinzunehmen, dann macht es schon hier und da irgendwie Sinn, eine zentrale Komponente zu haben, wo dann der Message-Bus drüber geht, der Event-Flow. Weil sonst habt ihr gefühlt 300 Eingänge von 300 Komponenten und so könnt ihr das alles steuern und umrouten und seid architekturell recht flexibel.",
            "start": 1610984,
            "end": 1643352,
            "confidence": 0.8078265306122446,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Für SIGBEE brauchst du aber MQTT meines Wissens, oder? Oder funktioniert SIGBEE mittlerweile noch ohne?",
            "start": 1644153,
            "end": 1648877,
            "confidence": 0.7767999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Funktioniert ohne, ich hab's ohne.",
            "start": 1648897,
            "end": 1650399,
            "confidence": 0.86,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In Home Assistant?",
            "start": 1650439,
            "end": 1651440,
            "confidence": 0.6576666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ja.",
            "start": 1651460,
            "end": 1652041,
            "confidence": 0.843,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ah, interessant. Meines Wissens, damals war SIGBEE noch nur möglich mit SIGBEE to MQTT, aber vielleicht habe ich das auch nur falsch aufgesetzt damals.",
            "start": 1652121,
            "end": 1661050,
            "confidence": 0.7980416666666664,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab keine ZigBee-to-MQTT-Komponente drin.",
            "start": 1661330,
            "end": 1663431,
            "confidence": 0.6697999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber du hast eine Mosquito-Broker.",
            "start": 1663471,
            "end": 1665692,
            "confidence": 0.46659999999999996,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Aber so viel zu meinem Setup. Das bedeutet, falls ihr keinen Raspberry Pi nehmen wollt, es gibt auch noch andere kleine Single-Chip-Computer. Ordroid zum Beispiel wird da sehr oft genannt. Home Assistant selbst hat, glaub ich, inzwischen auch einen vorkonfigurierten Single-Chip-Computer im Einsatz, den ihr euch kaufen könnt auf der Home Assistant-Seite. Schaut da mal ein bisschen rum. Aber Raspberry Pi mit SD-Karte macht's einfach. Home Assistant Yellow heißt das. Genau, das ist auch so ein Single-Chip-Computer. Es ist sogar empowered bei Raspberry Pi, sehe ich gerade. Okay, so viel zu unseren Setups. Wolfgang, gib uns doch mal eine kurze Tour über so zwei, drei, vier Protokolle, die in der ganzen Home Automation eine Rolle spielen. ZigBee hatten wir schon erwähnt. Was gibt's da noch so?",
            "start": 1665752,
            "end": 1714078,
            "confidence": 0.7031496062992124,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Homematic hast du ja schon erwähnt ist glaube in deutschland eigentlich sehr weit verbreitet weil das ein unabhängiges netz eigentlich aufgebaut hat oder auch ein mesh meines wissens ist es glaube ich auch oder ist es ein mesh.",
            "start": 1714998,
            "end": 1727471,
            "confidence": 0.8142894736842105,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube ja was ich aber auf jeden fall weiß ist Homematic gibt es auch mit kabel ja aber wir sprechen hier gerade nur über die funk, 868 Megahertz Variante und das tolle an dem Hometic Protokoll ist eigentlich, dass es bidirektional ist. Das bedeutet, die Komponenten quatschen kontinuierlich miteinander. Wenn man einen Befehl absendet, kriegt man ähnlich wie bei TCP, IP auch eine Bestätigung, dass der erfolgreich angenommen wurde oder nicht erfolgreich angenommen wurde und so weiter und so fort. Was man bei ZigBee zum Beispiel jetzt so nicht hat, weil ZigBee ist unidirektional. Da wird ein Befehl gefeuert und man kriegt nie ein Feedback, ob die Message angekommen ist oder ähnliches.",
            "start": 1727512,
            "end": 1762904,
            "confidence": 0.8308938053097348,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also die Devices können natürlich schon Messages zurücksenden, aber es ist nicht automatisch irgendwie im Protokoll implementiert, dass man immer eine Antwort oder eine Bestätigung bekommt. Also es ist ein klassisches Low-Power-Consumption-Mesh, das heißt, dass eben möglichst wenig Energie verbraten wird. Das ist gerade wichtig, wenn man so zum Beispiel Temperatursensoren irgendwo hängen hat. Da ist so eine kleine Knopfzelle drin, dann soll das Ding natürlich nicht nach einem Monat schon wieder zum Tauschen sein, sondern die halten schon ein gutes Jahr oder so. Dann kann man die einfach irgendwo hinkleben und braucht da eben keine größere Batterie oder so. Also die sind normalerweise sehr energiesparend, auch diese Mesh-Protokolle. Und da gibt es eben Zigbee. Eines, was meiner Meinung nach früher mehr verbreitet war, war Z-Wave. Ist eigentlich sehr ähnliches. Ist, glaube ich, auch auf einem ähnlichen Frequenzband unterwegs. Alles so bei die 800 MHz, 900 MHz, irgendwo in dem Bereich. Ein relativ neues Mesh-Protokoll ist Thread. Das ist eigentlich so ein bisschen der Nachfolger von ZigBee. Ist eben auch ein Mesh-Protokoll, sehr energiesparend, aber basiert dann auf IPv6. Das heißt, man hat eben ein allgemein gültigeres Protokoll mit IP, was einfach angenehmer ist, als wenn man so ein proprietäres hat wie bei Hometic oder irgendein spezielles von ZigBee, wo man wieder spezielle Devices braucht. Alles was IP-based ist, ist im Normalfall einfach einfacher zu handeln, weil es da halt schon Komponenten gibt. Aktuell sind die Thread-Devices aber noch relativ teuer im Vergleich zu ZigBee. Also ZigBee-Devices bekommt man wirklich um ein paar Euro und eben auch bei Ikea oder Lidl hat auch ZigBee-Devices. Steht auch immer oben, wenn es ein ZigBee-Device ist und man kann sich eigentlich ziemlich sicher sein, sobald ZigBee oben steht, irgendwo ist es auch kompatibel im ZigBee-Netzwerk und man kann das einbinden. Und wie gesagt, Thread wäre eher so die Zukunft. Also wer neu startet, kann sich auch das gerne anschauen, aber die sind einfach doch um den Faktor 5 teilweise teurer noch, die Devices, weil es einfach ziemlich neu ist. Aber das ist eine Allianz, die dahinter steckt, wirklich mit Google, Amazon, Apple und so weiter. Auch die ZigBee Alliance, die ursprünglich ZigBee gegründet hat, steckt dahinter. Also das ist sicher eine Technologie, die in Zukunft immer wichtiger wird. Meta spielt da auch eine große Rolle, das ist so der übergreifende IP-Standard, der jetzt versucht wird so zu implementieren, damit man möglichst zwischen den ganzen Systemen auch kommunizieren kann, weil das ist ein großes Problem, dass man einfach dann am Ende womöglich irgendwie fünf Protokolle hat und dann hat man auch Infrarot, weil man irgendwo eine alte Klimaanlage hat, die halt bei Infrarot klassischerweise ansteuerbar ist, dann braucht man noch eine Infrarothardware, Und dann hat man ZigBee, dann hat man vielleicht noch Z-Wave, dann hat man irgendwo Hometic, dann hat man ganz klassisch WLAN-IP-Devices. Und Home Assistant macht das ganz gut und kann das zusammenführen, aber Meta wäre nochmal so ein Standard, der das schon auf Device-Ebene beziehungsweise auf der Hersteller-Ebene möglichst probiert zu vereinen. Also da geht so die Zukunft hin. Aber wer jetzt möglichst einfach starten will, der kann auf jeden Fall mit ZigBee starten, ist ein gutes Protokoll, extrem billig, kriegt man Devices überall, super günstige Devices auch und kann einfach mal losstarten. Aber das sind so die Protokolle, die derzeit so herumschwirren in dem Bereich. Natürlich gibt es viele proprietäre Protokolle, aber ganz oft bauen die im Hintergrund auch nur auf ZigBee auf und täuschen eigentlich nur vor, dass sie irgendwie proprietär sind. Aber im Hintergrund sind ZigBee Devices und da kann man dann einfach die ZigBee Devices eigentlich nehmen und mit dem eigenen Home Assistant Netz zum Beispiel betreiben. Das ist überhaupt kein Problem, auch wenn dann oben steht, man braucht ein zentrales Device von Samsung oder von Lidl oder whatever. Vergesst das alles, solange ZigBee oben steht. Das ist so ein allgemeingültiges Protokoll, dass man das auch normal einbinden kann, ohne diese Zentrale zu haben von dem von dem jeweiligen Hersteller.",
            "start": 1763224,
            "end": 1993119,
            "confidence": 0.8033288084464549,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir haben 30 Standards, lasst uns einen neuen Standard gründen, um alle Standards zu vereinen. Wir haben 31 Standards. So kommt mir die ganze Sache immer so ein bisschen vor. Aber genau das was Wolfgang gesagt hat ist wirklich wahr und lasst euch davon nicht täuschen. Jeder ZigBee Hersteller gibt dir so ein ZigBee Gateway oder ähnliches mit. Es gibt von Ikea ein ZigBee Gateway, es gibt von Philips Huey. für diese bunten Glühbirnen. Es gibt wirklich von jedem ZigBee Hersteller irgendwie so ein ZigBee Gateway. Was ihr machen könnt ist, ihr könnt euch einen spezifischen USB-Dongle und einen USB-Stick holen. Den klappt ihr an den Raspberry Pi, der spricht ZigBee und von da aus braucht ihr diese ganzen Gateways einfach nicht mehr. Ich habe kein einziges ZigBee Gateway von irgendeinem Hersteller hier. Ich mache alles über diesen USB-Dongle und fertig. Wir verlinken euch den In den show notes er heißt konbi konbi aus einer firma aus dresden dresden elektronik heißt die glaube ich super teil kann ich nur empfehlen.",
            "start": 1993615,
            "end": 2047598,
            "confidence": 0.7600764705882355,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe eigentlich so einen fast selber gebauten Dongle aus Köln. Made by Love in Köln. Steht groß drauf. Ist eigentlich ein Texas Instruments Chip im Inneren. Und Texas Instruments spielte eigentlich auch eine große Rolle in dem ganzen Zigbee Bereich. Eigentlich alle Dongles oder alle Devices basieren auf Texas Instruments Chips. Da muss man nur den richtigen raussuchen, weil eben die älteren ein bisschen unstabiler sind. Es gibt auch mittlerweile einen Zigbee 3 als Version. Die sind aber im Normalfall alle kompatibel, also man braucht da jetzt nicht zu tief gehen, aber wir verlinken da eine Seite, wo alle aufgelistet sind, die gut sind und da kann man sich dann auch raussuchen, okay, wo kann man den kaufen in der Nähe, kann man auch auf Amazon kaufen. Im Normalfall sind alle um den Dreh um die 30 Euro die neueren Chips, also auch da ist es nicht so, dass man hunderte Euro irgendwie ausgeben muss dafür und dafür hat man dann für immer eigentlich eine Ruhe und kann alle CP-Devices anbieten.",
            "start": 2048098,
            "end": 2101337,
            "confidence": 0.7978953488372093,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Thema Low Energy, Low Consumption, was der Wolfgang angesprochen hat. Zigbee ist da sehr gut, richtig. Hometic, da kommen meist keine Knopfzellenbatterien rein, sondern schon wirkliche AAA-Batterien oder ähnliches. Dafür ist es halt bidirektional, ich sag mal so einen Tick sicherer, dass die Kommunikation halt wirklich erfolgreich war. Verschlüsselung ist da oben drauf. Mit dem Zigbee-Dongle könnt ihr jetzt kein Hometic sprechen, dafür braucht ihr einen anderen Dongle. Das ist halt immer so das Problem mit diesen Protokollen. Dann gibt es natürlich noch WLAN, ebenfalls CCIP, bidirektionales Protokoll. Ich kenne die alle. Das was ihr mit eurem Handy macht, mit eurem Laptop, zieht natürlich auch enorm an der Batterie, wenn ihr ein batteriebetriebenes Gerät habt. Ist aber dafür ein super Ding, super stabil, kommt natürlich auf eure WLAN-Abdeckung an. Protokolle wird in zukunft glaube ich immer mehr geben nur so ein kleiner überblick der war bestimmt nicht wissenschaftlich der überblick und sehr wahrscheinlich haben wir 35 auch vergessen.",
            "start": 2101777,
            "end": 2156574,
            "confidence": 0.7866835443037977,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was wir auf jeden fall noch vergessen haben was wichtig ist bluetooth weil er doch eigentlich recht verbreitet ist und es ist ja bluetooth low energy meistens dann also es ist klassische bluetooth. sondern kann dann eben auch betrieben werden, ohne dass es so viel Power zieht und dann mit kleineren Batterien dementsprechend verwendet werden. Ich hatte mal so ein Thermostat am Heizkörper, der Bluetooth gesprochen hat, das hat eigentlich ganz problemlos funktioniert und da waren auch noch zwei normale AA-Batterien drinnen und der hatte noch einen Motor drinnen für das Ventil, also das hat eigentlich ganz gut funktioniert und Der hat auch gutes Jahr oder so mit den Batterien überlebt, obwohl er eben diesen Motor drin hat. Also das Bluetooth ist schon auch ein weit verbreitetes System. Auch viele Lampen haben das. Wobei, wenn ihr ein ZigBee System habt, würde ich einfach auf ZigBee setzen, weil dann ist die Frage Bluetooth immer mit der Distanz. Da hat man Probleme. Das bildet nicht automatisch ein Mesh und da hat man auch diverse Probleme. Aber wenn man das will, kann man das auch sehr einfach einbinden, weil ja der Raspberry Pi automatisch Bluetooth hat. Da braucht man auch keinen Dongle oder irgendwas dazu. sondern kann es einfach direkt ansprechen in Home Assistant.",
            "start": 2156615,
            "end": 2224833,
            "confidence": 0.7937061611374406,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da kommen wir auch schon zu dem Kapitel der Herausforderungen. Der Herausforderungen, die wir uns alle stellen müssen, wenn wir mit dem ganzen Kram Home Automation mal anfangen. Weil da gibt es nämlich neben der Technik ganz, ganz, ganz viele menschliche Herausforderungen. Bleiben wir beim Thema Protokoll. Wolfgang hat es schon ein bisschen angesprochen. Ihr fangt an Komponenten zu kaufen und irgendwie wollt ihr immer das eine von dem Hersteller oder die Kamera von dem Hersteller. Und dann merkt ihr auf einmal, geil, die eine Komponente spricht ZigBee, die andere Z-Wave, die dritte WLAN und die vierte Homeatec. Und so geht das immer weiter und so geht das immer weiter. Und ihr habt ganz viele Protokolle, ganz viele Eingangstüren, wie euer System damit spricht. Und jedes Protokoll baut entweder ein Mesh auf oder baut keinen Mesh auf. ist stabil oder nicht stabil, eure WLAN Reichweite reicht nicht in die letzte Ecke vom Wohnzimmer und so weiter und so fort. Ihr müsst natürlich auch mal bedenken, besonders wenn ihr in einer Wohnung wohnt mit Leuten über euch, neben euch, unter euch, die haben natürlich auch sowas. Das bedeutet, da fliegen eine ganze Menge Wellen durch die Luft. Und dann fängt es nämlich an, ja, aber ZigBee lege ich auf diesen Kanal und auf diesen Megahertz, bla bla bla. Und von Komponenten wie einer Klimaanlage, die vielleicht sogar über Infrarot funktioniert, sprechen wir schon gar nicht. Herausforderung, zu viele Protokolle. Macht euch mal Gedanken, wie viele Protokolle ihr eigentlich haben wollt. Unsere Empfehlung ist, limitiert das so stark wie möglich. Ich renne hier auf drei Protokolle, WLAN, ZigBee und Homematic.",
            "start": 2224873,
            "end": 2316583,
            "confidence": 0.8254253731343287,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie machst du das mit WLAN? Flasht du die Geräte alle, dass die irgendwie eine eigene Firmware haben oder lasst du das einfach auf, wie gesagt, wie bei deinem Stabsaugerroboter auf der normalen Software laufen?",
            "start": 2316623,
            "end": 2329921,
            "confidence": 0.7674,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es kommt ganz darauf an, wovon wir da reden. Ich habe auf manchen Devices das Motor.",
            "start": 2329961,
            "end": 2334488,
            "confidence": 0.8118125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist das? Andi googelt jetzt wieder, damit er die professionelle Erklärung raushauen kann. Also hau mal raus.",
            "start": 2334648,
            "end": 2342295,
            "confidence": 0.7659999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Tasmota ist eine kostenfreie alternative Firmware für die Geräte, auf dem ein ESP8266-Chip basiert. So, der ESP8266-Chip ist so ein Standardchip, der halt irgendwie gefühlt überall drin ist. Das Mota ist eine Open Source Software, mit der ihr eigentlich gefühlt alles machen könnt. Und die nutze ich, damit flashe ich dann zum Beispiel diverse WLAN Geräte. Beispiel, ein dieser WLAN Geräte ist ein sogenannter Shelly. Ein Shelly ist eigentlich nur ein Relais, den man zum Beispiel hinter einem Lichtschalter packen kann. Den hängt man ins WLAN und somit ist der Lichtschalter ganz normal immer noch funktionsfähig. Den kann man dann aber auch über das Relais über WLAN steuern.",
            "start": 2342335,
            "end": 2382034,
            "confidence": 0.7990000000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment, das ist mir jetzt zu schnell gegangen. Kannst du das nochmal erklären, wie das funktioniert mit dem Shelly?",
            "start": 2382314,
            "end": 2387739,
            "confidence": 0.5695263157894735,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Shelly ist ein kleines, rundes Relais.",
            "start": 2387779,
            "end": 2389980,
            "confidence": 0.729,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist ein Relais?",
            "start": 2390020,
            "end": 2391442,
            "confidence": 0.483,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Komm, das erkläre ich jetzt nicht. Das ist die Aufgabe für den Hörer und für die Hörerin, das zu googeln. Was ist ein Relais?",
            "start": 2391582,
            "end": 2396946,
            "confidence": 0.727,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, ein kleines, rundes Relais.",
            "start": 2396966,
            "end": 2399008,
            "confidence": 0.568,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Den setze ich hinter den Lichtschalter.",
            "start": 2399028,
            "end": 2402030,
            "confidence": 0.8935,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie groß ist das Ding?",
            "start": 2402070,
            "end": 2403111,
            "confidence": 0.7208,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich würde mal sagen, so zweimal die Größe von so einem Deckel von so einer Wasserflasche oder ähnlichem.",
            "start": 2403371,
            "end": 2410097,
            "confidence": 0.6685000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay.",
            "start": 2410457,
            "end": 2411118,
            "confidence": 0.688,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kronkorken, also zwei bis drei Kronkorken.",
            "start": 2411158,
            "end": 2413961,
            "confidence": 0.7596666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, und da baust du jetzt den Schalter aus der Wand raus und hängst den irgendwie dahinter rein zwischen Lampe und Schalter?",
            "start": 2414001,
            "end": 2421608,
            "confidence": 0.7183636363636363,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, hinter dem Lichtschalter setze ich den Shelly, also ich setze die Phase und so weiter an den Shelly und dann connecte ich das an den Lichtschalter. Setze den einfach zwischen Schalter und Lampe und da ich den vorher geflasht habe, hängt er bei mir schon im WLAN und somit kann ich den Schalter normal bedienen. Der schaltet halt auch das Relais und ich kann dann aber auch über das Relais die Birne schalten. Das einzige Problem ist, wenn du einen Schalter hast, Und du bist es gewohnt, dass der Schalter eine bestimmte Position hat, wenn das Licht an oder aus ist. Das hast du natürlich nicht. Das Relais bewegt jetzt nicht den Schalter. Deswegen sagen ziemlich viele Leute, wenn ihr einen Celly nehmt, habt doch lieber einen Taster. Der dann einfach wieder zurück in die Ursprungsform gibt. Aber das sind so kleine Sachen. Ich weiß nicht wie pingelig ihr seid. Aber das ist zum Beispiel jetzt mal eine WLAN Komponente, die ich dann habe.",
            "start": 2421648,
            "end": 2470933,
            "confidence": 0.7814424242424244,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du die selber eingebaut? Also wie viel Elektriker muss man sein, um so ein Ding einbauen zu können?",
            "start": 2471273,
            "end": 2478378,
            "confidence": 0.736421052631579,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jeder, der Elektriker ist, hört mal bitte weg. Man muss nicht viel Elektriker sein. Ich habe mir das einmal zeigen lassen von einem Kumpel. Grüße an Philipp. Und von da habe ich dann... Ich habe mir aber auch ein kleines Testbrett gebaut. Das bedeutet, ich habe mir so einen Kaltgerätestecker von so einem Netzteil genommen, habe ich vorne abgeschnitten, den habe ich in eine Dose gesetzt und dann habe ich mir ein Brett im Baumarkt geholt und habe das da einfach mal verkabelt und habe es einfach mal getestet auf so ein kleines Elektrobrett.",
            "start": 2478418,
            "end": 2500253,
            "confidence": 0.661776595744681,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehr vorbildlich.",
            "start": 2500293,
            "end": 2502375,
            "confidence": 0.41000000000000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich möchte ja nicht in meinem Haus irgendwie zehn Kurzschlüsse heranschalten. Naja, das ist auf jeden Fall meine Art.",
            "start": 2502415,
            "end": 2507159,
            "confidence": 0.6092105263157893,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also jeder, der irgendwie mit Strom schon mal was verkabelt hat und da vielleicht einen Lichtschalter verkabelt hat oder sowas, der sollte mit dem dann auch zurechtkommen, wenn er sich mal angeschaut hat, den Schaltplan, welches Kabel wohin kommt und welche Phase man wo verknüpft.",
            "start": 2507179,
            "end": 2522493,
            "confidence": 0.8323111111111113,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Passt aber genau bitte auf, was ihr da macht, das ist gefährlich, Sicherung raus und so weiter und so fort. Ihr wisst, dass das lebensgefährlich sein kann.",
            "start": 2523825,
            "end": 2531488,
            "confidence": 0.7260000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es gilt wie immer der gesunde Hausverstand und man muss offiziell, ich habe gar keine Ahnung, wie das offiziell ist, ob man Elektriker sein muss eigentlich für sowas oder der Elektriker das offiziell abnehmen müsste am Ende, wahrscheinlich.",
            "start": 2531548,
            "end": 2543732,
            "confidence": 0.8346315789473687,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber zum Beispiel auch mein Staubsauger Roboter, da gibt es auf GitHub eine offizielle Firmware und eine Open Source Firmware, die kann man auch flashen und da habt ihr ein WLAN Gerät und somit habt ihr WLAN im Protokoll drin.",
            "start": 2544212,
            "end": 2554445,
            "confidence": 0.6827000000000003,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich würde jetzt auch grundsätzlich, um die Protokolle zu begrenzen, ich würde mir halt einfach immer überlegen, brauche ich einen zusätzlichen Dongle, eine Bridge in das jeweilige Netz oder kann ich das halt schon mit meinem klassischen WLAN, mit meiner WLAN-Karte im Raspberry Pi oder meinem Bluetooth-Adapter, der sowieso built-in ist, abdecken oder brauche ich wirklich eine zusätzliche Hardware? Und wenn ja, dann sollte man halt wirklich auf dieses Netz mehr setzen, dass man sagt, okay, dann SIGBEE braucht man Dongle, braucht man eine Bridge, aber dann habe ich viele Devices in meinem SIGBEE Mesh, Und dann wird das Leben einfach auch viel einfacher, weil wenn ich schon ZigBee Mesh aufgebaut habe, dann habe ich da alles installiert und wenn ich dann eine neue Komponente kaufe, dann kann ich die einfach super schnell reinhängen und brauche mir nicht wieder überlegen, okay, was brauche ich für Bridge oder ist das überhaupt möglich und so weiter. Dann was ich noch grundsätzlich immer mache, wenn ich so neue Dinge implementiere wie Home Automation, dass ich versuche am Anfang möglichst die Dinge so zu implementieren, dass wenn sie ausfallen, dass ich keine Probleme dadurch habe. Also sei es mit einer neuen Software oder mit einer neuen Komponente, dass man die einfach mal am Anfang zum Ausprobieren irgendwo parallel laufen lässt, ist ja in der IT recht üblich. Und das habe ich probiert eigentlich bei Home Automation genauso zu machen. Das heißt, ich habe versucht, das möglichst so zu implementieren oder einzubauen, dass wenn dieses ganze Ding crasht, wenn zum Beispiel mein Raspberry Pi crasht oder die SD-Karte, was sehr leicht vorkommen kann, wenn zum Beispiel Stromausfall passiert, genau wenn der Raspberry Pi auf die SD-Karte schreibt, kann es sein, dass die SD-Karte danach corrupted ist und man wieder alles neu installieren muss. Also wenn sowas auftritt, dass ich trotzdem zu einem Lichtschalter gehen kann, auf den Knopf drücken kann und das Licht einschalten kann. Weil ich kann mich erinnern, wie Google mal so einen ziemlich großen Ausfall hatte, das dürfte so vor einem Jahr gewesen sein, habe ich auf Twitter einige Messages gesehen von Leuten, die irgendwie gemeint haben, ja, Home Automation ist ganz cool mit der Google Cloud, aber Google ist halt down und die kann einfach kein Licht mehr einschalten. Oder ich sehe auch das Kamerabild nicht mehr von meinem Baby im anderen Raum. Also man ist dann schon sehr abhängig und das kann natürlich, wenn es Google passieren kann, kann das erst recht einem selber passieren. Und es ist halt einfach cool, mir ist das auch schon passiert, früher, weil ich vor allem einen schlechten ZigBee-Dongle hatte, der oft ausgefallen ist. Und ich war super glücklich, dass ich einfach aufstehen habe können, zur Wand gehen konnte, auf den Schalter drücken und ich hatte immer noch Licht am Abend. also man sollte das schon so implementieren dass es eben keine probleme macht und dann ist es auch viel leichter wenn man andere leute im haushalt hat, dass die das wohlwollend aufnehmen und sagen okay dann probieren wir das mal aus.",
            "start": 2554485,
            "end": 2711710,
            "confidence": 0.7759096267190575,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie oft ist das schon passiert ich war unterwegs und meine frau sagt ich kann das nicht schalten die rolllade geht nicht mehr hoch oder runter oder ähnliches. Passt da wirklich ganz, ganz, ganz stark drauf auf, wenn euch der Haussägen wichtig ist bei eurem Partner, Partnerin, Frau oder Mann. Weil die ganze Sache muss auch funktionieren für Nicht-Techniker. Testet es durch, dass etwas mit Automation und auch noch analog funktioniert, weil sonst hängt der Haussägen ratzfatz schief. Und wir sprechen hier aus Erfahrung.",
            "start": 2711750,
            "end": 2739600,
            "confidence": 0.8182142857142859,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und es ist nicht nur der Haussegen, es ist auch selber, wie mein Donkel dann teilweise stündlich ausgefallen ist am Ende, das war wirklich anstrengend. Ich wollte selber einfach nicht mehr dann rausgehen, bei mir ist das eben im Schaltschrank drinnen, Schaltschrank aufsperren, dann den Raspberry Pi irgendwie neu starten oder nochmal Checking probieren, die Hardware irgendwie neu zu starten. Also es war echt mühsam. Ich habe dann auch aufgegeben. habe mir eine neue Hardware bestellt und in der Zwischenzeit habe ich einfach wieder normale Lichtschalter verwendet an der Wand. Das war einfach viel viel einfacher und angenehmer. Also wenn man das so aufbaut, glaube ich, ist das auch einfach einfach etwas auszuprobieren. Also vielleicht nicht alle Schalter schon von Anfang an entfernen und sagen, ich schalte eh alles dann irgendwie remote über Home Assistant oder über die Home Automation, sondern halt wirklich so aufbauen, dass das auch ausfallen kann ohne Probleme. Und das ist gar nicht so schwer. Schwieriger ist es eigentlich eher, dass man am Anfang dann ganz oft den Lichtschalter trotzdem verwendet, wenn man jetzt keine Chalice zum Beispiel hat, wie der Andi, und man schaltet der Smart Lampe den Strom ab, dann kann man sie natürlich auch nicht mehr einschalten. Das heißt, man drückt normal auf den Lichtschalter und schaltet dann die Smart Lampe aus, obwohl man sie vielleicht einschalten will. Oder man schaltet sie aus, weil man sie ausschalten will und am nächsten Tag wundert man sich, warum man die nicht mehr fernsteuern kann, weil man hat halt am Vortag einfach den Strom weggenommen und dann funktioniert halt bei der Lampe gar nichts mehr.",
            "start": 2740392,
            "end": 2822254,
            "confidence": 0.7930631970260227,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, das ist halt der große Trugschluss bei diesen ganzen ZigBee, Ikea Sachen. Wenn man die halt remote steuern möchte, müssen die halt konstant unter Strom sein. Und dann geht die Frau einfach mal ins Wohnzimmer, haut auf den Schalter, weil sie ist das ja gewohnt und macht dann einfach Strom aus, Strom aus von der Lampe und somit könnte sie nicht.",
            "start": 2822594,
            "end": 2837403,
            "confidence": 0.7327419354838708,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Mehr Road Schalten, Das hast du sicher nie gemacht, oder? Es war immer nur deine Frau.",
            "start": 2837423,
            "end": 2841587,
            "confidence": 0.6686875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Diese Art von smarten Lampen habe ich deswegen genau nicht, weil ich mache es ja selber. Die nächste Herausforderung ist eigentlich der Mensch. Und zwar du selber. Wenn du mit dem ganzen Kram anfängst und du hast da Spaß dran, dann kaufst du eigentlich über Zeit immer mehr Komponenten. Und das geht tierisch ins Geld, weil du weißt ja nicht genau, wie viel brauchst du davon. Deswegen bestellst du mal einen Türsensor, einen Vibrationssensor, kannst damit vielleicht deinen Briefkasten ausstatten. Weil wenn nämlich die Klappe hochgeht, vibriert der Briefkasten, kannst du dir vielleicht anzeigen lassen, dass neue Post da ist und so weiter und so fort. Und über Zeit geht das natürlich tierisch ins Geld, aber du baust dir auch eine sogenannte Box of Shame auf. Die Box of Shame ist einfach irgendwo eine Kiste in deinem Haushalt, wo ganz viele unverbaute IoT-Hardwarekomponenten drin sind, wo du dann auf irgendeiner To-Do-Liste noch ein Item stehen hast, das musst du alles noch verbauen. Und Achtung, diese Box of Shame wird einfach immer größer. Passt bitte auf, dass ihr wirklich nur den Kram kauft, den ihr wirklich verbaut. Und wenn ihr die Komponenten nicht mehr braucht, haut sie einfach auf eBay-Kleinanzeigen. Aber bitte kümmert euch um eure Box of Shame. Bei den Komponenten kaufen müsst ihr auch ganz, ganz, ganz stark darauf aufpassen, ob diese Komponenten A. flashbar sind oder auch lokal betrieben werden können. Das bedeutet, manche Hersteller, da braucht man einfach eine Cloud oder zum Beispiel bei ziemlich vielen Videokameras um die volle Funktionalität der Videokamera zu nutzen, Beispiel die Erkennung von einer Katze oder von einem Fahrzeug oder ähnliches, brauchen die dann eine Internet-Connection und eine Cloud. Und somit seid ihr natürlich dann schon wieder in dem Space unterwegs, dass ihr eure Komponenten nicht nutzen könnt, wenn das Internet ausfällt. Schaut da wirklich Data-Privacy-mäßig nach, guckt mal ein paar Foren nach und so weiter und so fort.",
            "start": 2841607,
            "end": 2948265,
            "confidence": 0.7896257861635222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Darum bin ich immer froh, wenn irgendwo ZigBee draufsteht, weil dann brauche ich mir gar nicht keine Gedanken machen, ob das überhaupt funktioniert. Aber klarerweise, Kameras funktionieren nie über ZigBee. Das ist einfach das falsche Protokoll. Für sowas, das ist immer WLAN, klarerweise für das Video, was dann schlussendlich gesendet wird.",
            "start": 2948685,
            "end": 2965306,
            "confidence": 0.7931372549019609,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ihr mehrere Kameras habt und die laufen alle über WLAN, müsst ihr natürlich mal gucken, in welcher Qualität die Daten streamen und wie viel WLAN-Bankbreite ihr habt und so weiter und so fort, wie viele Personen ihr im Haushalt habt. Irgendwo kommt ihr natürlich dann auch an eine Grenze. Vielleicht solltet ihr dann, wenn ihr 5, 6, 7 Outdoor-Kameras haben wollt, dann könnt ihr euch gegebenenfalls mal Gedanken machen über entweder einen eigenen WLAN-Router dafür oder vielleicht ein Kabel ziehen mit einem ordentlichen Videorekorder und Ähnliches, weil da könnt ihr natürlich dann schon in etwas professionellem Umfeld sein.",
            "start": 2965646,
            "end": 2994055,
            "confidence": 0.7494949494949497,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Siehst du sonst noch Herausforderungen abseits von deiner Box of Shame, die bei mir übrigens leer ist, ich habe es gerade gecheckt. Keine neue Hardware drinnen, ich sollte wieder mal neue Hardware kaufen, glaube ich, wenn ich mir das so überlege. Aber siehst du sonst noch Herausforderungen bei dem ganzen Thema?",
            "start": 2994455,
            "end": 3007974,
            "confidence": 0.6970784313725489,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weißt du was ein IKEA Kallax ist?",
            "start": 3008014,
            "end": 3009517,
            "confidence": 0.6799999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist nicht so ein Kasten oder Schrank, wie du sagst, oder?",
            "start": 3010017,
            "end": 3013019,
            "confidence": 0.39327272727272733,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So ein Schrank mit so Kästen drin. Wenn du sagst, deine Box of Shame ist leer, so ein Ikea-Kallax sind das so zweieinhalb Fächer bei mir voll mit irgendeinem Kram. Zugegeben, das sind meistens die Kartons davon, ja? Aber da sind auch noch ganze Menge Komponenten. Ja, du hast doch ein Ikea-Kallax im Hintergrund stehen.",
            "start": 3013039,
            "end": 3030810,
            "confidence": 0.7597454545454547,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jaja, da ist auch eine. Einfach ist voll, aber da sind keine Komponenten mehr drin, die ich verbauen will. Das sind nur irgendwelche alten, die ich ausgetauscht habe oder irgendwelche Kabel.",
            "start": 3031330,
            "end": 3041141,
            "confidence": 0.736516129032258,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Herausforderung, zu viele Protokolle, zu viele Hersteller. Achtet mal ein bisschen darauf, dass ihr da nicht wild geht. Nächste Herausforderung meines Erachtens nach, wenn du ziemlich viel auf Batteriekomponenten bist, wer monitort eigentlich die Batteriekomponenten? Es kommt schon hier und da mal vor, dass ich meinen Home Assistant öffne und dann irgendein Temperatursensor sagt, ich habe hier keine Daten mehr. Und dann gucke ich, der ist seit einer Woche ausgestiegen, weil die Batterie leer ist. Das bedeutet, falls ihr da wirklich eine Automation drauf habt, zum Beispiel, ich glaube der Wolfgang hat so eine Heizungsautomation, dass die Heizung irgendwie runterreguliert wird, wenn der Raum zu warm ist oder das Fenster auf ist oder ähnliches.",
            "start": 3041590,
            "end": 3081405,
            "confidence": 0.7747719298245617,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder wenn ich gar nicht zu Hause bin.",
            "start": 3081445,
            "end": 3083688,
            "confidence": 0.6559999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da solltet ihr dann schon mal eine Art Monitoring einbauen. Da kommt als Infrastruktur-Person natürlich immer wieder irgendwas mit Prometheus und Grafana, damit ihr das natürlich alles mit einer Infrax, mit einer M3, mit einer Time-Series-Datenbank könnt ihr alles bauen. Kann aber auch alles wieder kaputt gehen. Von daher, monitort mal eure Komponenten.",
            "start": 3083728,
            "end": 3099805,
            "confidence": 0.6914528301886791,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, ihr habt da einen ganz einfachen Weg. Ihr habt da mittlerweile eine Automation. Vielleicht noch zur Erklärung, weil wir es noch gar nicht erwähnt haben, was eine Automation ist. Eine Automation ist eigentlich die Logik, die dann in Home Assistant abläuft, die eben sagt zum Beispiel, wenn du nicht zu Hause bist, weil dein Telefon bei Bluetooth nicht erkannt wird, dass das zu Hause liegt, dementsprechend bist du nicht da, regle die Heizung runter. Solche Automations, eigentlich so If-Statements mehr oder weniger, kann man dann dort in Home Automation sogar mit Clicky-Punty schön in der Oberfläche zusammen klicken, das funktioniert ganz gut oder man schreibt Yammel, wenn man sich selbst geißeln will. Auf jeden Fall in meiner Automation habe ich einen Check, der einfach alle Devices durchgeht und wenn irgendwo die Batterielevel unter 25% fällt, dann bekomme ich eine Notification und ich sehe gerade, ich habe eine Notification bekommen von einem meiner Ventile von der Heizung, dass da die Batterie unter 25% gefallen ist. Und dementsprechend wird man dann auch informiert. Die ist relativ neu bei mir. Die hatte ich früher auch nicht. Und die geht einfach über alle Devices drüber. Das ist eigentlich relativ easy. Ich glaube, das war sogar ein Blueprint. Mittlerweile hat Home Assistant Blueprints, die online verfügbar sind und die man sich einfach runterladen kann. Dann braucht man sich selber gar nicht diese komplexeren If-Statements zum Beispiel schreiben, also diese Automations.",
            "start": 3100359,
            "end": 3177141,
            "confidence": 0.8050423728813559,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Blueprints sind vorgefertigte Automations. Ja, das kannst du machen, wenn die Komponente noch lauffähig ist, aber ab und zu gehen technische Komponenten einfach hops. Was macht denn dein Batteriestatuschecker, wenn der Kollege einfach gar nicht mehr antwortet?",
            "start": 3177201,
            "end": 3190126,
            "confidence": 0.7862972972972975,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, dann ist es natürlich zu spät. Im Idealfall informiert er mich ja frühzeitig.",
            "start": 3190526,
            "end": 3194227,
            "confidence": 0.6871428571428572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, auf jeden Fall ist das noch so eine Herausforderung, die ihr mit der steigenden Anzahl von Komponenten irgendwie mal tacklen müsst. Wenn ihr zwei, drei Sachen habt, kümmert euch nicht darum, wenn ihr dann irgendwann mal anfangt, jeglichen Kram zu machen, zum Beispiel Vibrationssensoren an Fenstern.",
            "start": 3195025,
            "end": 3211369,
            "confidence": 0.8463829787234044,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vielleicht ganz allgemein, welche Automations hast du denn so? Also wir hatten ja jetzt Glühbirnen, okay Licht ein- und ausschalten ist jetzt nicht so spannend, ich habe einen Schalter, schalte Licht ein und aus, was im Alltag eigentlich ganz cool ist, muss man dazu sagen, aber was hast du sonst für Use Cases? Warum sollte man denn überhaupt Home Automation machen? Ich meine es ist eine coole Spielerei, gebe ich ganz offen zu. Aber ich kann jetzt zum Beispiel meine Schreibtischlampe, die jetzt gerade neben mir ist, ein- und ausschalten in dem Webinterface. Aber ich könnte halt auch einfach den Schalter bedienen, der in Griffreichweite ist.",
            "start": 3212129,
            "end": 3243818,
            "confidence": 0.7381226415094339,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bei vielen Sachen ist das natürlich eine Spielerei. Obwohl man natürlich auch bei gestiegenen Energiepreisen sagen muss und erhöhter Ausstattung, dass sowas natürlich auch dann wirklich ins Geld gehen kann und ins Geld sparen. Speziell die Automation, die du da gerade hast, wenn das Fenster auf ist, reguliere ich die Heizung runter. Du hast Heizkörper, richtig? Ja, ich kann es zum Beispiel nicht machen, ich habe eine Fußbodenheizung, wenn ich die jetzt runter reguliere, hat die ungefähr morgen runtergefahren, die ist halt sehr sehr träge, deswegen lohnt es sich bei mir nicht. Aber sowas geht dann zum Beispiel wirklich ins Geld sparen, dass du die Heizung runterregelst, wenn du nicht da bist, wenn das Fenster auf ist. Wenn du eine Solaranlage hast, dann kannst du da natürlich auch deinen kompletten Stromverbrauch mit messen und natürlich auch daraufhin die Waschmaschine erst triggern. Das bedeutet, wenn deine Waschmaschine immer nur starten soll, wenn es sonnig ist zum Beispiel. Da kannst du halt richtig Geld sparen und nicht abends, wenn du zu Hause bist oder ähnliches.",
            "start": 3243838,
            "end": 3295973,
            "confidence": 0.7554682080924858,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch wer Smart Meter daheim hat, üblicherweise gibt es da auch Interfaces, die man dann anbinden kann. Dann bekommt man auch diese Daten. Also alles, was in irgendeiner Form smart ist und anbindbar ist, in irgendeiner Form und offen oder auch nur eine API hat, wenn sie auch gar nicht so offen ist, dann gibt es meistens eine Home Assistant Integration und da kann man wirklich viel machen. Also bei mir Heizung ist ein Klassiker. Wenn ich einfach nicht zu Hause bin, schaltet das Ding automatisch ab. Wenn ich nicht zu Hause bin, schalten sich alle Lichter ab, wenn ich irgendwo was vergessen habe abzuschalten.",
            "start": 3296312,
            "end": 3324616,
            "confidence": 0.7829238095238094,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe zum Beispiel einen Kumpel, der hat seine Home Automation irgendwie mit seinem Wecker verbunden und ich glaube kurz bevor der Wecker geht, springt die Kaffeemaschine an, die der dann am Abend vorher immer vorbereitet, damit der Kaffee dann, wenn er aus dem Bad getrottet kommt, fertig ist.",
            "start": 3325076,
            "end": 3340545,
            "confidence": 0.8376326530612248,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe sowas ähnliches, wenn es ums Aufstehen geht. Die haben Wake-up-Light, das einfach probiert die Sonne zu imitieren und so langsam in einer ganz leichten roten Farbe startet und immer heller wird. Manche sagen, man kann dann da besser aufwachen. Ich wache meistens trotzdem gar nicht auf von dem Ding. Also es funktioniert so halbwegs. Keine Ahnung, ob man wirklich dann besser aufwacht, aber die Theorie sagt es zumindest. Und sowas habe ich auch.",
            "start": 3341225,
            "end": 3364382,
            "confidence": 0.8075733333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe jetzt gar nicht so viele Automations drin. Ich habe ziemlich viel an der Alarmanlage. Zum Beispiel wenn die Alarmanlage losgeht, dann springt auch meine Anlage an und macht noch so einen Alarmsound. Ich habe einen Telegram-Bot drin, der mich öfters mal informiert, wenn was zu Hause so los ist, wenn ich nicht da bin. Ich habe zum Beispiel Auf dem Balkon die Beleuchtung die geht an eine halbe Stunde bevor Sonnenuntergang ist und geht dann morgens automatisch wieder aus solche Geschichten ich habe aber noch mehr vorzumachen aber ich gebe auch zu es ist recht schwierig Automations zu finden die, wirklich, wirklich, wirklich sinnvoll sind und wirklich, wirklich, wirklich funktionieren. Und was meine ich damit? Ich meine, wenn wir zum Beispiel auf der Terrasse sitzen, dann möchte ich natürlich nicht, dass die Rollladen um 20 Uhr oder 21 Uhr runtergehen, weil wenn ich keinen Schlüssel in der Tasche habe, dann habe ich mich da eben mal eben ausgesperrt. Das bedeutet, nur weil du automatische Rollladen hast, heißt das nicht, dass sie wissen, dass du draußen bist.",
            "start": 3364642,
            "end": 3425618,
            "confidence": 0.8242191011235955,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, du hast ja dein Handy mit, dann kannst du wieder nach oben fahren.",
            "start": 3426320,
            "end": 3428981,
            "confidence": 0.5238571428571429,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das meine ich mit Automations, die wirklich, wirklich, wirklich funktionieren. Ich habe mal irgendwann vor, auch einen Rasenmäherroboter zu haben und automatische Bewässerung und dies und das. Aber soweit bin ich alles noch gar nicht. Und da habe ich gerade leider, ich wollte gerade sagen, ich habe keine Zeit dazu, aber ich muss ganz ehrlicherweise ehrlich zu mir sein und sagen, ich nehme mir die Zeit noch nicht. Macht euch, bevor ihr in eine Automation reinsetzt, macht euch wirklich wirklich Gedanken, welche Automation braucht ihr wirklich, welche ist sinnvoll und besprecht das mal mit eurem Partner oder Partnerin, weil die haben da oft auch ein Wort mitzureden.",
            "start": 3429001,
            "end": 3461097,
            "confidence": 0.7974814814814816,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ihr habt zum Beispiel eine Automation auf der Tür, einfach wenn die Tür geöffnet wird, wenn niemand zu Hause ist und wie gesagt die Präsenz wird gecheckt über die Bluetooth-Connection zum Handy. Und letztes Mal waren wir nicht zu Hause und haben dann die Info bekommen, die Tür wurde geöffnet, obwohl wir nicht zu Hause sind und hat mich dann schon eigentlich ziemlich gestresst. Ich bin dann nach Hause, weil sie so zweimal geöffnet worden ist und wieder geschlossen worden ist, so in 15 Minuten Takt. Aber wir haben es natürlich einfach geschafft, die Tür nicht ordentlich zuzumachen und sie ist dann halt einfach durch den Wind auf und zu gegangen. Aber im Prinzip die Automation hat funktioniert. Sie hat mich informiert über dieses Event. Das war also ganz gut.",
            "start": 3461157,
            "end": 3500520,
            "confidence": 0.813453846153846,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es gibt glaube ich 10.000 Anwendungsfälle.",
            "start": 3500980,
            "end": 3503281,
            "confidence": 0.7636666666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber einen sehr sinnvollen Anwendungsfall habe ich noch und der ist wirklich extrem easy und praktisch. Ich habe zwei Lichter im Wohnzimmer, also zwei Lampen und die können nur gemeinsam ein- und ausgeschalten werden, weil die direkt am gleichen Kabel hängen. Ist aber ein relativ großes Wohnzimmer und ich würde die gern getrennt schalten. Das heißt, ich muss entweder komplette neue Verkabelung machen, was extrem schwierig ist, Oder in dem Fall, ich habe einfach zwei Smart Glühbirnen drinnen und kann die einfach getrennt voneinander schalten. Und neben dem Schalter, neben dem alten Schalter an der Tür hängt einfach ein Smart Schalter mit Batterie. Der hat mehrere Schaltfunktionen und da kann ich das dann einfach ganz klassisch an der Wand getrennt ein- und ausschalten. Also wenn man so ein Problem hat zum Beispiel, was sonst nur sehr schwierig lösbar wäre mit einer Verkabelung, das kann man zum Beispiel sehr einfach lösen. Und das ist ein super guter Use Case und ist eigentlich total simpel zu lösen mit einfach zwei Lampen.",
            "start": 3503301,
            "end": 3562244,
            "confidence": 0.7987100591715978,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Für den Start reicht es aber auch erstmal, sich gar nicht groß Gedanken zu machen, sondern einfach rumspielen und einfach vielleicht einfach mal dummes Zeug zu automatisieren, weil das macht im Endeffekt einfach viel mehr Spaß.",
            "start": 3562284,
            "end": 3572395,
            "confidence": 0.7919444444444443,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und es ist einfach extrem cool, wenn man dann irgendwas programmiert hat und zum Beispiel man kommt heim, macht die Tür auf und das Licht schaltet sich automatisch an, wenn man die Tür öffnet. Solche Sachen sind einfach dann, sind eine Spielerei, klar, aber sie sind auch einfach praktisch und man freut sich dann jedes Mal wieder, wenn das Licht sich automatisch anschaltet und man das nicht machen braucht und fühlt sich dann irgendwie sehr toll, wenn man das automatisiert hat. Also ein tolles Gefühl am Ende.",
            "start": 3573427,
            "end": 3598627,
            "confidence": 0.7856666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was mich immer dabei sehr fasziniert, ist die Kombination von Software und Hardware. Weil Software-Engineering finde ich eigentlich relativ frustrierend. Und zwar sitzt du acht Stunden vorm Rechner, hackst da den Code rein, drückst auf Compile und der Computer schreit dich an, ey, da fehlt ein Semikolon. Aber wenn du es dann schaffst, das mit Hardware zu kombinieren, und mit deinem Code bewegst du irgendwas in der realen Welt, ja, nicht digital, nicht am Computer, nicht auf irgendeinem Screen, sondern wirklich eine Lampe oder eine Waschmaschine anmachen, da freue ich mich wie Bolle, sag ich dir. Da habe ich so richtig das Gefühl, Software Engineers können die Welt verändern.",
            "start": 3599133,
            "end": 3632553,
            "confidence": 0.7530825688073395,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und man lernt einfach mal, wie das Ganze funktioniert. Und normalerweise macht es recht viel Spaß. Also ich kann es nur empfehlen, einfach mal loszustarten mit einer Glühbirne, einem Temperatursensor und vielleicht einem Türsensor. Und da kann man dann eigentlich schon ganz coole Dinge bauen. Und die bewegen sich wirklich im Bereich von 30 Euro oder so. Da kann man wirklich mal losstarten und herumspielen. Wir verlinken auch da noch einiges, natürlich zu Home Assistant, zu ZigBee, wie man dort einsteigen kann und sonst die Home Assistant Seite hat auch super viele Informationen vorn natürlich, also es gibt da extrem viele Informationen, die man auch benutzen kann und Erfahrungsberichte, also da startet man nicht bei null und es ist auch nicht das Komplett. technische Thema, wo man irgendwie der große Hacker sein muss, sondern man kann da eigentlich ganz einfach loslegen über die Web-UI oder man kann auch tiefer gehen und Jaml falsch schreiben oder Skripte, wenn man lustig ist. Also da ist man komplett flexibel, aber man kann wirklich easy losstarten.",
            "start": 3632593,
            "end": 3686073,
            "confidence": 0.8149186046511626,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ihr in das ganze Thema eintaucht, erschreckt euch nicht. Es gibt 10.000 Tools. Home Assistant ist jetzt nur eins, was wir jetzt nutzen. Es gibt noch OpenHub, FAME hatten wir erwähnt, Node-RED, IO Broker. Es gibt so viele Tools da auf dem Markt. Diese Büchse machen wir jetzt hier nicht auf. Es gibt auch 10.000 Hardwarehersteller. Wir hatten jetzt mal Shelly oder Ikea genannt, Xiaomi. Die Elemente sind recht günstig. Buttons, Temperatursensoren, Fenstersensoren. Das sind so gute Komponenten zum starten. Wir hoffen, wir haben euch etwas Lust drauf gemacht, das vielleicht mal auszuprobieren. Vielleicht mal an einem Wochenende einfach mal starten, 20, 30, 40 Euro in die Hand nehmen, ab zum Ikea mal eine Lampe holen, einen Dongle mal bei Amazon bestellen. Verlinken wir alles in den Shownotes. Wir versuchen auch noch einen kleinen Blogbeitrag dazu zu schreiben auf unserer neuen Webseite. Da würden wir dann ein kleines Starter-Kit zusammenstellen. Ansonsten teilt uns doch mal eure schönen Automations mit oder eure Horror-Stories, weil die finde ich eigentlich viel lustiger. Welche Herausforderungen habt ihr eigentlich? Könnt ihr euch mit den Herausforderungen, die wir heute genannt haben, zu viel Protokolle, Kann man das Licht noch einschalten, wenn das Internet ausfällt? Was passiert, wenn der Raspberry Pi crasht? Box of Shame. Zu viele verschiedene Hersteller. Monitoring der Komponenten. Könnt ihr euch damit identifizieren? Oder sagt ihr, alles Quatsch, ich hab die Rundum-Lösung, hier ist sie. Die würden wir gerne hören. Wie immer via E-Mail stetisch at engineeringkiosk.dev oder via Twitter at engkiosk.",
            "start": 3686543,
            "end": 3778572,
            "confidence": 0.7939959999999995,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und damit bis nächste Woche. In der Zwischenzeit werden wir mal probieren, unsere ganze Podcast-Pipeline zu automatisieren. Das wäre ja wirklich dann mal was, was sehr sehr nützlich wäre. Aber ich glaube, das ist mehr Aufwand und lässt sich mit Home Assistant kaum lösen. Aber wir werden mal drüber nachdenken. Auf jeden Fall bis nächste Woche und habt Spaß mit eurer Automation. Tschau. Tschö. Durchsensoren irgendwo hängen hat und da ist so eine kleine Kopfzelle... Da ist so eine kleine Knopf... Oh mein Gott. Da ist so eine kleine Knopfzelle.",
            "start": 3778912,
            "end": 3812673,
            "confidence": 0.7289333333333332,
            "channel": null,
            "speaker": "B"
        }
    ],
    "confidence": 0.7814162228237117,
    "audio_duration": 3812.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}