{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/543a3dd5-93fb-42a7-b61d-514816f9d4bd/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62xftpik3h-bd39-4977-b3f2-67b25be7d3e4",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "In der Tech-Industrie geht zur Zeit recht viel ab. Überall liest man von Massenentlassungen und Stopp von Neueinstellungen bei großen Tech-Firmen. Generell ne Scheiß-Situation. Das Ganze hat uns unter anderem zum heutigen Thema gebracht. Interviews aus der Sicht des Bewerbers. Sei doch mal ehrlich, wann hast du das letzte Interview gemacht, wo du rausgegangen bist, dir selbst auf die Schulter geklopft hast und gesagt hast, wow, das war ne Mega-Leistung? Bei vielen ist das gegebenenfalls schon etwas her oder man hat sich eher einen abgestammelt und gedacht, fuck, wieso habe ich Thema X nicht erwähnt. In dieser Episode sprechen wir darüber, wie man sowas vermeiden kann, geben Tipps für souveräne Antworten auch bei schwierigen Interviewfragen und klären, warum man Interviews führen sollte, wenn man gar keinen Job sucht. Wir starten jedoch erstmal in Portugal. Viel Spaß und los geht's. Wolfgang, du warst ja jetzt gerade anderthalb Wochen in Portugal und hast ja die Sonne auf deine Plauze scheinen lassen. Und da wir ja hier auch einen kulturellen Anspruch haben zwischen der deutschen Kultur und der österreichischen Kultur, würde ich jetzt gerne mal einen Auszug aus der portugiesischen Kultur hören von dem einen Ding, was dich entweder beeindruckt hat oder überrascht hat oder wo du dir gedacht hast, what the fuck, was geht denn hier ab?",
            "start": 2450,
            "end": 78168,
            "confidence": 0.7828837209302322,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich würde fast sagen, Portugal ist mein absolutes Traumland, weil du kannst einfach überall an jeder Ecke einen perfekten Kaffee bekommen. Und ich rede von einem echten Kaffee, nicht so Wasser, was man in Deutschland meistens bekommt, sondern wirklich einen ordentlichen Espresso, wirklich guten Kaffee und also bestellte Nata, super günstig, kann den Tag damit losstarten, das ist perfekt. Einzige Downside und da kann ich anschließen an alle Gespräche, die wir in den letzten Folgen hatten, es ist ein extrem autofokussiertes Land. Die ganzen Städte sind einfach voll von Autos und wenn man das vergleicht mit Amsterdam oder anderen Städten, da liegen noch Jahrzehnte dazwischen. Also das ist die einzige Downside. Man bekommt überall guten Kaffee, aber kann ihn nur neben extrem starkem Verkehr trinken.",
            "start": 78508,
            "end": 125774,
            "confidence": 0.8246984126984128,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn du am selam ansprichst sprichst du speziell diese diese fahrradverliebtheit an oder.",
            "start": 126234,
            "end": 132238,
            "confidence": 0.7256153846153846,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es geht gar nicht um die um die fahrradverliebtheit unbedingt aber halt als alternatives verkehrsmittel und dort hast du halt einfach super schmale gehsteige gesteige muss ich dir das noch erklären nach gesteige sagt dir auch oder.",
            "start": 132278,
            "end": 142826,
            "confidence": 0.6731621621621622,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bürgersteig nennt man sowas hier.",
            "start": 143582,
            "end": 145102,
            "confidence": 0.7666000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bürgersteig ja genau.",
            "start": 145463,
            "end": 146983,
            "confidence": 0.465,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn du von Gehsteig sprichst denke ich irgendwie immer an Klettersteig und Klettersteig ist ja dann doch schon ein bisschen was anderes bei euch in den Bergen oder? Oder nennt ihr Klettersteig auch Gehsteig?",
            "start": 147003,
            "end": 155685,
            "confidence": 0.7083529411764706,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja manche würden das vielleicht auch Gehsteig nennen, was heutzutage so versichert ist in den Bergen für manche Wanderer. Egal, auf jeden Fall diese Gehsteige sind extrem schmal und dann gibt es halt einfach vier Spuren für den Autoverkehr oder so in der Innenstadt, was halt einfach wenig grün bedeutet und wenig Lebensqualität meiner Meinung nach. Also da ist Amsterdam oder auch andere Städte sind da schon wesentlich besser, gar keine Frage.",
            "start": 156165,
            "end": 182854,
            "confidence": 0.7885138888888892,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Herr Gut, ich meine ich komme aus dem Pott, was soll ich sagen.",
            "start": 182894,
            "end": 185815,
            "confidence": 0.5988461538461537,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sogar Düsseldorf hat sich jetzt mittlerweile verbessert und macht so Dinge in Richtung Radwege und solche Sachen. Da braucht Portugal wahrscheinlich noch länger, aber es ist auch verständlich, muss man dazu sagen. Aber da sieht man einfach den harten Unterschied wieder.",
            "start": 185855,
            "end": 199863,
            "confidence": 0.830951219512195,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was denkst du, woran liegt das? Liegt das an der finanziellen Lage von Portugal? Wie ist denn eigentlich generell so die Marktlage in Bezug auf vielleicht sogar, weiß ich nicht, Tech? Ist das ein aufstrebendes Land oder ist das eigentlich gerade so ein Land, was gerade von der schwierigen Weltlage irgendwie gebeutelt ist?",
            "start": 199903,
            "end": 218016,
            "confidence": 0.7483962264150943,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ihr habt da jetzt natürlich keine genauen Zahlen, aber ich glaube, das liegt ziemlich weit hinten. Und die hatten einen extremen Braindrain, also dass die gut ausgebildeten Leute, und die haben eigentlich eine sehr gute Ausbildung, halt alle ins Ausland gegangen sind. Teilweise früher, hat mir ein Portugieser erzählt, sogar gepusht haben, dass du ins Ausland gehst, damit sie einfach weniger Leute haben, weil das war so die erste Lösung. Wenn wir weniger Leute haben, brauchen wir weniger Geld. Natürlich sehr langfristig gedacht. Aber mittlerweile bemühen sie sich wieder sehr, auch die Leute zurückzuholen und es gibt eigentlich sehr viele IT-Firmen, die jetzt in Richtung Portugal gehen, weil es einfach sehr kostengünstig ist, schönes Land ist und es fast so das neue Spanien wird, so für günstigere Arbeitskräfte und im schönen Umfeld und warmen Umfeld arbeiten. Also da sieht man schon durchaus eine Bewegung Richtung Portugal und auch viele Freelancer oder digital Nomads oder fast Nomads arbeiten mittlerweile von Portugal. Also es ist durchaus beliebtes Land und könnte natürlich auch eine gewisse Chance sein für Portugal.",
            "start": 218416,
            "end": 278957,
            "confidence": 0.8095738636363637,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du denn hast du denn gerade mal ein zwei große namen big player die headquarter in in was ich nicht lissabon oder vielleicht sogar porto haben also.",
            "start": 279390,
            "end": 287513,
            "confidence": 0.7655000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In portugal generell headquarters keine ahnung ob es da überhaupt firmen gibt aber es haben mittlerweile einige firmen einfach standorte dort weil es einfach kostengünstig ist und ein schönes land ist.",
            "start": 287553,
            "end": 298578,
            "confidence": 0.8106774193548387,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich weiß wohl, dass Lissabon selbst schon als Tech-Hub gefeiert wird, wo ziemlich viele Start-ups angesiedelt sind, ähnlich wie, sagen wir mal, in Deutschland Berlin oder in den Niederlanden Amsterdam. Kommt zwar jetzt alles nicht nahe dem Super-Tech-Hub in Europa, der dann Dublin wäre, aber es gibt auf jeden Fall eine Ansammlung von Wissensträgern in Lissabon anscheinend.",
            "start": 299018,
            "end": 322638,
            "confidence": 0.7719310344827586,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es gibt ja auch diese große Konferenz oder, ich nenne es mal Konferenz, Marketing-Event, Web-Summit. Ist, glaube ich, eine der größten in Europa, würde ich fast sagen, und sehr bekannt. Also es geht schon einiges in die richtige Richtung und kann man sich durchaus mal überlegen. Eben, günstiger Kaffee bestellt in einer Art der perfekten Start-In-The-Day.",
            "start": 323075,
            "end": 344263,
            "confidence": 0.7579107142857141,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Web Summit bezeichnet sich selbst als jährliche Technologiekonferenz. Ja, in der Tat, sie findet in Lissabon statt, ist auch ein, ja, ich würde schon fast sagen, einer der größten Events in Europa in dem Bereich. Nicht jetzt zu vergleichen mit dem Mobile Congress in Barcelona, aber ich habe auch schon gehört, dass der Websummit schon Lissabon an die Grenzen treibt, möchte ich mal sagen. Also so viel ich weiß. Ich war selbst noch nicht da, aber du wirst schon am Flughafen begrüßt, am Flughafen hat das Websummit dann schon die ersten Camps aufgebaut, et cetera, et cetera. Also die nehmen die ganze Stadt dann ein. Ich weiß jetzt grad nicht, wie viele Leute da sind, aber muss schon, ich würde sagen, eine hohe fünfstellige oder vielleicht sogar sechsstellige Zahl an Besuchern sein. Die Website klagt sich mit über 70.000 Teilnehmern.",
            "start": 344483,
            "end": 391585,
            "confidence": 0.7871357142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber schauen wir mal, ob das bei 70.000 bleibt in der Zukunft, weil es war ja doch so ein good feel event, weil aktuell schaut es in der Branche eher etwas schwieriger aus in der ganzen Startup Szene und wie sie fandet Szene.",
            "start": 391965,
            "end": 404747,
            "confidence": 0.7637674418604651,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist korrekt. Ich bin mir gar nicht sicher, ob es dann, wie gesagt, nur die Start-ups betrifft oder ob es nicht wirklich generell jede Firma betrifft, die man gegebenenfalls nicht mehr als Start-up bezeichnet, sondern als sogenanntes Scale-up, also Start-ups, die einen Product-Market-Fit gefunden haben, die jetzt den Fokus auf Skalierung, auf Wachstum, und Wachstum heißt jetzt nicht nur Mitarbeiterwachstum, sondern generell Business-Wachstum gelegt haben, aber auch etwas ältere Hasen sind davon betroffen. Vielleicht mal als ganz kurzer Kontext. Was geht gerade in der Tech-Industrie weltweit ab? Vielleicht habt ihr die ein oder andere Nachricht auf LinkedIn gesehen. Es werden gerade Layoffs durchgeführt, noch und nöcher. Leute werden entlassen von Firmen, die gegebenenfalls etwas überskaliert haben. Und Skalierung, wie gesagt, sprechen wir jetzt nicht an der technischen Skalierung, sondern der menschlichen und der Business-Skalierung. und das ist generell die folge von der aktuell schwierigen marktlage auf der welt wir haben zeitgleich mehrere krisen russland und ukraine starke inflation zinsen steigen wieder geld wird nicht ist nicht mehr so günstig wie es die letzten paar jahre war der ganze aktien tech sektor ist irgendwie richtung richtung süden gegangen und natürlich als folge logistik immer noch die us kanal geschichte hängt immer noch uns im nacken so viel ich weiß ich höre von dem kollegen der im logistikbereich ist, dass die schiffe immer noch vor rotterdam stehen und die container nicht los werden, weil kein lkw und kein zug fährt weil die energiepreise so hoch sind für gas öl und allem drumherum dran hängt also alles irgendwie zusammen.",
            "start": 405177,
            "end": 503734,
            "confidence": 0.8509494163424124,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Corona gibt es übrigens auch noch immer das vor allem in china mit der produktion und so weiter auch noch. großen großen Einfluss hat auf diese ganze Supply-Chain-Geschichte.",
            "start": 503874,
            "end": 513799,
            "confidence": 0.7590357142857144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Den Chip-Mangel, der durch China getrieben ist, habe ich jetzt gar nicht erwähnt und Corona stimmt. Corona ist für mich schon wieder so Standard, dass der Rest schon wieder überholt wird. Nee, aber ist richtig. Zum Beispiel haben wir, merken wir das in der Firma auch, wir kriegen jetzt gerade MacBooks M1, die wir irgendwie im März bestellt haben und das ist natürlich jetzt auch eine ganz schwierige Geschichte, weil neue Mitarbeiter, die man einstellt, die brauchen ja irgendwie Arbeitsequipment. Und wenn man das Arbeitsequipment einfach nicht kriegt, dann ist das echt ein Problem. Kommen wir zurück zu den Layoffs. Was ist eigentlich passiert? Eine ganze Menge Firmen, eine ganze Menge größerer Namen haben gar nicht so wenig Leute entlassen müssen. Wolfgang, wen hast du da im Kopf, wer war da so betroffen, wer war da in der Headline, in der Schlagzeile?",
            "start": 513820,
            "end": 558287,
            "confidence": 0.822007042253521,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, wie du schon gesagt hast, es hat eigentlich ziemlich viele getroffen aus allen Bereichen. Ich glaube, in Deutschland war Klarna ziemlich in den Medien, weil Klarna ja eigentlich eine deutsche Firma ist, auch wenn sie offiziell in Stockholm sitzt, aber ich glaube die Gründer sind alle deutsch. Oder Gorillaz als deutsches Unternehmen, die haben ja auch irgendwie 15% oder so von ihrer gesamten Workforce entlassen und ich glaube 50% im Headquarters in Berlin. also das sind schon schon große mengen auch kleiner ich glaube 700 leute oder sowas in der richtung also gute zehn prozent aber auch die ganz die großen sei es jetzt mit mit facebook die einfach zurückgehen und nicht mal so viel leute einstellen wollen oder oder sogar gestoppt haben, Ich glaube Twitter hat auch mehr oder weniger einen Hiring Freeze durchgeführt, also stellt keine Leute mehr ein, keine neuen Leute mehr, was ja automatisch dann auch immer einen Rückgang bedeutet, weil du ja automatisch Leute immer verlierst oder Leute kündigen. Das heißt, sie schrumpfen schon alle. Vor allem im Finanzsektor war das natürlich extrem stark zu sehen. Es werden aktuell einfach alle Firmen getroffen und durch die ganzen Domino-Effekte dann glaube ich auch Firmen, die überhaupt nichts mit den Industrien zu tun haben. Und das wird dann wahrscheinlich runtergehen bis zum Mittelstand, mittelfristig. Also der Markt wird sicher schwieriger werden. Glaubst du, dass das Einfluss auf die IT hat, dass jetzt Firmen plötzlich einfache IT-Leute finden?",
            "start": 558307,
            "end": 643715,
            "confidence": 0.8184232365145232,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sehr gute Frage, sehr komplizierte Frage. Die Firmen, die gerade noch wirklich Geld auf der Bank haben, die Firmen, die von den Weltkrisen jetzt gar nicht so betroffen sind, werden jetzt natürlich die Firmen, die Leute entlassen haben, speziell targeten. Ich denke, dass die Leute, die entlassen wurden, sehr viele Anfragen kriegen. Und somit ist das natürlich dann wieder ein Bewerbermarkt und kein Firmenmarkt. Also ich denke nicht, dass die Firmen, die gerade neue Leute suchen, einfacher Fachkräfte kriegen, ganz und gar nicht. Ich denke eher, dass die Leute, die jetzt neu auf dem Markt sind, bessere Karten haben, die Firmen gegeneinander auszuspielen und dann gegebenenfalls die Preise noch höher zu treiben. Weil im Endeffekt ist es immer noch ein Mangel an Fachkräften, meines Erachtens nach, und an richtig guten Leuten. Und nicht, dass jetzt die Firmen, die Leute entlassen haben, den Markt irgendwie auskriegen.",
            "start": 643755,
            "end": 692997,
            "confidence": 0.8383103448275864,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich glaube auch, dass so ein großer Need ist am Markt, dass der Einfluss eher geringer ist. Aber ich könnte mir schon vorstellen, dass eine gewisse Entlastung da ist, weil man einfach vielleicht auch im Gesamten jetzt weniger Angebote bekommt. Weil es war halt bisher teilweise so, dass man von fünf Firmen Angebote hatte und von großen Firmen unter Umständen. Und das wird vielleicht ein bisschen nach unten gehen, dass man da einfach weniger Angebote bekommt. Das heißt aber eigentlich nicht unbedingt, dass sich der Markt deswegen entspannt, weil wenn du zwei Angebote hast, ist halt trotzdem noch immer mehr Nachfrage als Angebot da und insofern glaube ich, dass man da nicht unbedingt eine extreme Entspannung sehen wird. Vielleicht eine kleine in manchen Bereichen, aber ich kann mir nicht vorstellen, dass es jetzt irgendwelche IT-Leute gibt, die extreme Probleme haben, eine sinnvolle Position zu finden.",
            "start": 693017,
            "end": 743855,
            "confidence": 0.8054520547945202,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da kommen natürlich noch zwei zusätzliche Punkte obendrauf. Die eine Geschichte ist Location. Das bedeutet, nicht jeder wird jetzt auf Komplett Remote wechseln und nicht jede Firma hirnt für Komplett Remote. Das bedeutet, man ist natürlich an den geografischen Standort gebunden. Die andere Geschichte ist, nur weil wir gerade über Firmen reden, die ihr Businessmodell auf Technologie stützen und gegebenenfalls dadurch den Uplift bauen, heißt das nicht, dass alle Leute, die entlassen wurden, volle Techies sind. Nehmen wir mal zum Beispiel das Food Delivery Service Gettyr. Ist in Deutschland jetzt gar nicht so bekannt, weil eher so Gorillas und Flink und so den Markt beherrschen. Aber Gettyr ist einer der größten Food Deliverer in der Türkei zum Beispiel, die jetzt gerade mehr und mehr auf den europäischen Markt kommen. Die haben 4500 Leute entlassen.",
            "start": 744431,
            "end": 788297,
            "confidence": 0.8185447761194026,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "GTA ist glaube ich international der größte.",
            "start": 790157,
            "end": 793139,
            "confidence": 0.7657142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist ein riesen laden auf jeden fall und von diesen 4500 leuten gehe ich mal stark davon aus dass das jetzt nicht 4000 software engineers sind sondern vielleicht eine ganze menge rider die leute die dieses essen wirklich ausliefern oder ähnliches ja.",
            "start": 793219,
            "end": 807210,
            "confidence": 0.765279069767442,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man muss aber da aufpassen, dass es bisher eigentlich immer so war, dass IT-Leute und die wirklichen hochqualifizierten Leute eigentlich meistens nicht betroffen waren bei diesen Layoffs, bei den großen Firmen. Da ist es eben eher um diese Leute gegangen, im Lager, die Auslieferer, was es auch immer ist, HR-Leute vielleicht noch. Und mittlerweile ist es aber so, dass die ganzen Layoffs sehr wohl die ganzen hochqualifizierten Leute auch betreffen und von Developer, Data Scientists, alle Leute mittlerweile betroffen sind. Und gerade wenn man den Clowner Layoff anschaut im Detail, da gibt es eine große Excel-Liste, wo sich die Leute eingetragen haben, dass sie offen sind für neue Jobs. Und wenn man da mal reinschaut, da sind wirklich alle drinnen, von Supersenior bis zu Nicht-IT-Fachkräften. Also da sind jetzt alle wirklich betroffen. Und das hat sich schon geändert zu den Layoffs, die man teilweise in den letzten Monaten bis Jahren gesehen hat.",
            "start": 807670,
            "end": 862193,
            "confidence": 0.8491776315789473,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da muss man sich aber einmal kurz vor Augen führen, wie solche Layoffs in der Regel ablaufen. Es gibt natürlich verschiedene Strategien. Zum Beispiel, eine Firma schließt ganze Standorte auf Basis von Businessmodellen, Businessunits oder Ähnliches. Da fallen natürlich dann gegebenenfalls auch Mietkosten weg und nicht nur People-Kosten. Dann werden oft Leute entlassen, die entweder noch in der Probezeit sind, weil man dort in der Regel keine Abfindung zahlen muss. Oder vielleicht sogar Leute, die jetzt gerade erst einen Vertrag unterschrieben haben und dass dann irgendjemand von diesem Vertrag zurücktritt. Das bedeutet, man versucht natürlich auch bei diesen Layoffs, die versucht, die Kosten niedrig zu halten. Dass man keine Abfindung zahlen muss, keine Aufhebungsverträge machen muss und ähnliches, weil ziemlich viele hochqualifizierte Leute natürlich unbefristete Verträge haben, wo man dann natürlich ein Common Agreement abschließen muss, dass man das Unternehmen gegen eine Geldzahlung oder ähnliches verlässt.",
            "start": 862373,
            "end": 916177,
            "confidence": 0.8501301369863019,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und du hast natürlich noch die ganzen rechtlichen Rahmenbedingungen, dass man nicht so einfach wahllos Leute feuern kann, sondern dass das eben zum Beispiel eine ganze Abteilung sein muss, damit das sinnvoll mit den ganzen Gewerkschaften und so weiter funktioniert. Also da gibt es ja teilweise rechtliche Sachen auch noch, die man gerade in Deutschland zum Beispiel beachten muss.",
            "start": 916630,
            "end": 933414,
            "confidence": 0.8012711864406782,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es läuft halt auch ganz einfach darauf hinaus, dass das Management anguckt, okay, welche Business-Unit ist denn profitabel und welche Business-Unit hat denn auch die Möglichkeit, recht schnell profitabel zu werden. Und dann wird einfach die komplette Business-Unit geschlossen. Ja, es ist natürlich mit rechtlich natürlich Roland natürlich ein bisschen unterschiedlich, aber nur gut. Gehen wir mal ganz kurz durch, was wir gerade so auf dem Zettel haben. Layoffs von Firmen, Klarna, Gorillaz, Gettier, Paypal hat Leute entlassen, SumUp, Netflix und die Kryptobörse Coinbase von Hiringfreezes, also Leute, die jetzt gerade die Neueinstellungen gestoppt haben. Weiß ich zum Beispiel von Salesforce, Nvidia, Meta aka Facebook, Twitter, aber auch Wayfair. Wayfair ist glaube ich so ein größeres Möbel-Online-Haus. Und es gibt natürlich eine Webseite, die sowas alles auflistet. Nennt sich layoffs.fyi. Da habt ihr eine größere Airtable-Tabelle. wo ihr nach Location, nach Industrie und so weiter filtern könnt. Und da habt ihr ziemlich viele Informationen, welche Firma gerade Leute entlässt, welche in Schieflage geraten ist. Das kann sich natürlich alles auch nochmal ändern bzw. weiter zuspitzen, wenn diese Episode erscheint.",
            "start": 933654,
            "end": 1006149,
            "confidence": 0.810201117318436,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und nachdem gerade so viel Bewegung im Markt ist, haben wir uns auch überlegt, das heutige Thema zu machen und zwar geht es um Interviews oder wie man sich als Bewerberin oder Bewerber sinnvoll vorbereiten kann auf ein Interview, was man so beachten sollte, damit man eben diesen ganzen Prozess verbessern kann, optimieren kann und am Ende auch erfolgreich aus dem ganzen Prozess rausgehen kann.",
            "start": 1006549,
            "end": 1027136,
            "confidence": 0.8611538461538459,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, heute sprechen wir mal ein bisschen über Interviews aus der Sicht der Bewerber und nicht aus der Sicht der Firma. Das bedeutet, worüber sprechen wir nicht. Wir sprechen zum Beispiel nicht über Gehälter, was man verlangen kann, in welchem Standort oder ähnliches. Wir sprechen nicht darüber, wie man zum Beispiel die richtige Firma findet.",
            "start": 1027411,
            "end": 1043291,
            "confidence": 0.8504181818181816,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber da haben wir, by the way, eine gute Episode. Das war die Episode, lass mich mal checken, Episode 11, die Suche nach dem IT-Traumjob. Verlinken wir natürlich in den Show Notes. Sonst Episode 11, hört euch das mal an. Wie findet man denn die ideale Firma? Und wenn man dann die ideale Firma gefunden hat, dann kann man sich diese Episode anhören, weil dann geht es um den nächsten Schritt des Interviews.",
            "start": 1043832,
            "end": 1065264,
            "confidence": 0.7439726027397259,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wir sprechen nicht über Interviews aus der Sicht der Firma, die neue Leute einstellen möchte. Wir somit nur der Fokus, ihr sucht einen neuen Job, ihr habt ein Vorstellungsgespräch und ab da geht's weiter.",
            "start": 1065584,
            "end": 1077179,
            "confidence": 0.8103428571428571,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da machen wir mal eine eigene Folge darüber, was man aus der Firmensicht beachten muss. Aber das ist wirklich mindestens eine Folge wert.",
            "start": 1077199,
            "end": 1083787,
            "confidence": 0.8126521739130438,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und ich bin da gerade voll im Thema, nicht, weil ich mich gerade selbst beworben habe, das ist bei mir schon ein paar Monate her, aber weil ein sehr, sehr guter Kumpel von mir vor kurzem auf mich zukam und sagte, der will sich wegbewerben. Und zwar ist er jetzt nicht in der Tech-Industrie, nicht in der Software-Entwicklungsindustrie, sondern in der etwas älteren Industrie, der Stahle-Industrie. Und dort ist das eigentlich so, man geht in ein Unternehmen, in so einen riesen Konzern, man lernt da, man übt da seinen Job aus und dann geht man da irgendwann in Rente. Auf jeden Fall hat er mich überrascht und hat gesagt, hey, pass mal auf, ich möchte mich woanders bewerben. Ich hab diese Stellenanzeige, kannst du mal drüber gucken, du machst das doch mal hier und da öfters. Sag ich, jo, klar. Und dann sagt er zu mir, dann haben wir ein bisschen so die Bewerbung geschrieben, hat er abgesendet, wurde dann auch zum Bewerbungsgespräch eingeladen. Dann sagt er zu mir, okay, super, ich hab Montag ein Bewerbungsgespräch, freu mich schon riesig. Sag ich, okay, klasse. Weißt du denn, was da auf dich zukommt und bist du gut vorbereitet? Sagt er, ja, nicht wirklich. Mein letztes Bewerbsgespräch war vor 19 Jahren, damals, als ich meine Ausbildung angetreten habe. Und das ging 10 Minuten. Und jetzt haben die mich für anderthalb Stunden eingeladen und ich weiß gar nicht, was die mit mir anderthalb Stunden besprechen sollen. Dann habe ich dem angeboten, okay, wenn du Bock hast, kommst du einfach mal rum, treffen wir uns hier im Garten und wir gehen da mal ein paar übliche Fragen durch. Ja, und heute gehen wir einfach mal so ein paar Tipps durch, die somit dann jetzt auch industrieweit vielleicht sogar Anwendung finden.",
            "start": 1084127,
            "end": 1165299,
            "confidence": 0.7136351351351348,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, dann schieß mal los. Was hast du denn in deinem Garten da empfohlen, in deiner Garten 101 Session?",
            "start": 1165579,
            "end": 1171180,
            "confidence": 0.6456842105263159,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wolfgang, wir wissen ja alle, du bist immer einer von der schnellen Sorte. Deswegen überspringen wir die Themen nicht, ja? Bevor man überhaupt mal so eine Garten Session machen kann, sollte man erstmal gucken, okay, wie wird man überhaupt zum Bewerbungsgespräch eingeladen und womit fängt das eigentlich an? Entweder mit einer Bewerbung und einem Lebenslauf oder vielleicht durch eine direkte Empfehlung. Vielleicht habt ihr ja sogar Glück, ihr könnt die komplette Dokumentengeschichte einfach skippen, weil ihr jemanden kennt in einem Unternehmen, der euch dann vielleicht sofort ein Werbesgespräch besorgt, weil es gibt immer wieder Meldungen, dass über 30 oder 40 Prozent der Jobs nie, die besetzt werden, nie ausgeschrieben werden. Die werden dann über ein Netzwerk gefüllt. Kann sogar gegebenenfalls noch höher sein.",
            "start": 1171220,
            "end": 1210629,
            "confidence": 0.7542520325203251,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wobei ein Lebenslauf oder ein CV eigentlich fast immer gebraucht wird, weil es gibt ja irgendwie einen offiziellen Prozess oder in irgendeinem System oder man hat was in der Hand. Also es wird auf jeden Fall Lebenslauf empfehlen und ich glaube auch, dass es wichtig ist, dass man da einen bei der Hand hat, der einigermaßen gepflegt ist. Hast du da irgendwelche Tipps diesbezüglich Lebenslauf? Ich habe in letzter Zeit auch einige gesehen und war doch überrascht, wie schwierig es ist noch für manchen Lebenslauf zu erstellen, den sinnvollen. Wie würdest du einen Lebenslauf designen?",
            "start": 1210689,
            "end": 1240959,
            "confidence": 0.7375473684210527,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe früher in der Schule immer ganz viel darüber gelernt und habe dann nach dem dritten... Moment, in welche Schule.",
            "start": 1240999,
            "end": 1247904,
            "confidence": 0.819,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bist du gegangen, dass du Lebensläufe gelernt hast?",
            "start": 1247924,
            "end": 1250587,
            "confidence": 0.73175,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ach, das war gefühlt in jeder Schule, in der ich irgendwie war, war das mal mindestens eine Stunde oder zwei Thema und dann habe ich festgestellt, dass jeder irgendwie Lebensläufe anders schreibt.",
            "start": 1250647,
            "end": 1258833,
            "confidence": 0.7959687499999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wobei ich das sehr cool finde, weil ich habe das eigentlich nie irgendwo gelernt und ich glaube auch, dass das wenig Leute lernen irgendwo.",
            "start": 1258873,
            "end": 1265058,
            "confidence": 0.7148333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber das, was ich da gelernt habe, ist teilweise schon wieder irrelevant, dass du damals noch deine Eltern da reinschreiben solltest, was haben die für einen Beruf, du Geschwister hast und deine Religion, und dass ein Foto Pflicht ist. Das ist ja heutzutage schon alles eher grenzwertig bezüglich fairem Auswahlprozess und allem Drum und Dran. Also da sagt man ja, okay, man macht eher die Anonyme Bewerbung, dass man das Foto rauslässt, Geschlecht rauslässt, Alter rauslässt, Religion rauslässt. Meine Eltern und meine Geschwister, was haben die in meinem Lebenslauf zu suchen? Also sowas habe ich dann damals noch gelernt. Also das lasst mal bitte heutzutage raus.",
            "start": 1265608,
            "end": 1298787,
            "confidence": 0.7820186915887846,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es ist wirklich old school dann. Ja, okay. Also wie würdest du heutzutage den Lebenslauf designen?",
            "start": 1298827,
            "end": 1304911,
            "confidence": 0.57875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also generell würde ich es immer recht pragmatisch halten. Ich würde es recht kurz halten. Das bedeutet maximal zwei Seiten. Oft tabellarisches Layout. Lass die Grundschule weg. Je nachdem wie alt ihr seid. Bringt noch die Schulbildung mit rein. Habt ihr Abitur oder nicht Abitur. Ich glaube in Österreich nennt man das Matura.",
            "start": 1304971,
            "end": 1323345,
            "confidence": 0.8051886792452829,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, endlich mal was gelernt.",
            "start": 1323565,
            "end": 1327127,
            "confidence": 0.47640000000000005,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann habt ihr ein Studium, Bachelor, Master, vielleicht sogar noch auf Diplom. Wenn ihr schon noch Diplom habt, dann könnt ihr auch die Schulbildung weglassen, weil das ist dann schon ein paar Jährchen her. Deswegen sowas dann halt einfach eher weglassen. Kommt auf euer Alter an, auf eure Berufserfahrung. Habt ihr schon ein paar Firmen durch? Seid ihr schon 10, 15 Jahre im Job? Listet mal kurz die Firmen und listet die verschiedenen Stellen. die ihr habt habt ihr verschiedene stellen in einer firma listet diese einzeln auf und am besten mit so ein paar stichpunkten aber über größere projekte die ihr da gemacht habt das muss jetzt nicht jedes projekt sein das muss jetzt auch nicht super detailliert sein weil das könnt ihr alles an dem vorstellungsgespräch darlegen der lebenslauf bietet ist eigentlich nur eine sache die euch die eintrittstür eröffnen soll und die immer ihr müsst immer bedenken die Firma hat den Lebenslauf und alles was im Lebenslauf steht, kann als Frage gewertet werden. Da könnt ihr angesprochen drauf werden, deswegen dort müsst ihr wirklich in der Lage sein, wirklich zu antworten. Das bedeutet, habt ihr ein größeres Projekt, was ihr auf den Lebenslauf schreibt, was ihr zum Beispiel in dieser Position durchgeführt habt, kann eine Frage sein, was war denn dein Impact, was war denn genau dein Teil, den du im Projekt gemacht hast. Schmückt euch bitte nicht mit großer Teamarbeit, wo ihr nicht begründen könnt, was euer spezifischer Part an diesem Projekt war, weil das kommt immer als Bumerang zurück. Aber generell, tabellarischer Lebenslauf, eine E-Mail-Adresse, wenn ihr eine Webseite habt, packt einfach eine Webseite hin, die muss gar nicht so top aktuell sein, sondern nur, okay, ihr habt eine, Wenn ihr ein Gitterprofil habt, packt es damit hin. Wenn es nicht gepflegt ist, lasst es einfach weg. Blink-In-Profil kann man immer ganz gut hinzupacken, sofern es gepflegt ist. Also relativ pragmatisch und relativ kurz. Also wirklich maximal zwei Seiten. Bitte nicht viel größer. Wenn ihr irgendwie Side-Projects habt, listet mal die Side-Projects. Das ist auch immer eine ganz gute Interviewfrage von Firmen. Wenn ihr Hobbys habt, wenn ihr euch irgendwie für Pfadfinder oder ähnliches einsetzt, schreibt es da hin. Kommt auch immer ganz gut, dass ihr noch ein paar Hobbys habt und nicht nur voll auf Tech seid.",
            "start": 1327167,
            "end": 1454462,
            "confidence": 0.7759242819843347,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da haben wir übrigens in unserer ersten Episode, wo wir zu Side-Projects gesprochen haben, für alle, die es noch nicht gehört haben, haben wir auch einiges angesprochen, wie Side-Projects hilfreich sein können für eine Bewerbung im Interview, dass man darüber spricht. Also alles, was in irgendeiner Form zeigt, dass man sich irgendwo engagiert, sei es in einem Side-Project, Open Source, Pfadfinder, whatever it is, Feuerwehr. Ich glaube, solche Sachen sind interessant. Ob ihr jetzt gern schwimmt oder klettert, ja, keine Ahnung, ob man das unbedingt reinschreiben muss. Ich bin kein Hobby-Fan im Lebenslauf, aber vor allem, weil es mir viel Platz wegnimmt, den ich dann eigentlich verwenden könnte für sinnvolle Informationen, wie der Andi schon gesagt hat, an welchem Projekt man arbeitet. Und das finde ich heutzutage eigentlich noch extrem wichtig, weil durch diese ganzen Jobtitles es extrem schwierig geworden ist herauszufinden, was man überhaupt gemacht hat. Und dann steht da irgendwas Senior blablabla Blablabla Engineer und man kann sich gar nichts mehr darunter vorstellen, weil das halt in jeder anderen, in jeder Firma anders gehandhabt wird oder anders verstanden wird. Was denn jetzt überhaupt ein Senior Engineer macht oder ein Team Lead oder ein Tech Lead? Was ist denn ein Tech Lead? Hast du Personalverantwortung? Hast du keine Personalverantwortung? Wie groß ist das Team? Ist es ein kleines Team? Sind es drei Leute? Sind es 20 Leute? Unter Umständen ist trotzdem alles ein Tech Lead in irgendeiner Form. Und das ist einfach wichtig, dass man dann wirklich hinschreibt, okay, Techlead war eben technische Leitung in einem 5-Köpfe-Team ohne Personalverantwortung und man hat an den drei großen Projekten gearbeitet oder sowas. Also, dass man da wirklich konkretere Informationen hat, weil sonst bringt das eigentlich relativ wenig für denjenigen, der dann den Lebenslauf liest.",
            "start": 1454522,
            "end": 1555389,
            "confidence": 0.7878395904436861,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sehr guter Punkt. Titles und Personalführung. Bei der Personalführung, Tech Lead oder ähnliches, heißt es im deutschen Umfeld immer, hattet ihr fachliche Führung oder disziplinarische Führung oder beides. Das ist ein Riesenunterschied. Wenn ihr so was habt und das abgrenzen könnt, klassischer Tech Lead ohne Personalverantwortung hat in der Regel fachliche Führung. Ein Engineering Manager, Abteilungsleiter oder ähnliches kann auch fachliche Führung haben, hat aber in der Regel auch immer disziplinarische Führung. Schreibt sowas rein, dann kann man das relativ gut abgrenzen.",
            "start": 1555889,
            "end": 1589402,
            "confidence": 0.8286341463414634,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber auch auf der technischen Seite gilt das gleiche, also es gilt jetzt nicht nur bei der Personalverantwortung, wenn jetzt drinnen steht irgendwas, keine Ahnung, Andis Lieblingswort, DevOps-Engineer, wo ich ja gelernt habe in der letzten Episode, dass es das nicht gibt. Aber nennen wir es mal DevOps-Engineer, das kann natürlich alles sein. Und da geht es natürlich dann auch darum, mit was hat man denn gearbeitet? Mit welchen Tools, mit welchen Plattformen? Was war die eigentliche Aufgabe? Wie gesagt, hat man da in einem Cross-Functional-Team gearbeitet? War das eher in einem Ops-Umfeld? Und was hat man gemacht und welche Tools hat man verwendet? Weil das gibt dann auch schon ein bisschen einen Einblick, okay, in welchem Umfeld hat sich denn das Ganze bewegt? jemand der nun coolen titel aufgestülpt bekommen hat oder kennt er wirklich die def ops kultur wie es der andy immer so schön nennt und kann mich der zum beispiel weiterbringen oder diejenige weiterbringen wenn ich sie einstellen.",
            "start": 1589462,
            "end": 1643711,
            "confidence": 0.7841111111111114,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Generell die seiten lebenslauf so ihr bullet point mäßig anstatt prosa texte und gibt, der Person, die den Lebenslauf anschaut, die Möglichkeit, den schnell rüber zu scannen, ja. Nicht jeden einzelnen Satz lesen müssen, sondern schnell scannen, habt ein bisschen Abstand zwischen den Stationen, die ihr bisher auf eurer Karriere gemacht habt und so weiter und so fort. Also, dass man das schnell, dass man relativ schnell in ein, anderthalb Minuten einen guten Überblick über euch bekommt. Wir hatten ein bisschen gerade über Links gesprochen, GitHub und LinkedIn-Profile. Wenn ihr die habt, wenn die einigermaßen gepflegt sind, packt sie rein. Wenn nicht, lasst sie weg. Auch kein Weltuntergang. Spielt im deutschen Sektor die Plattform Zing oder wie man sie ausspricht, habe ich mal gehört, Crossing noch eine Rolle? Das ist so ungefähr damals, ich vergleiche das wie mit Studi4Z und Facebook, wo Zing das Studi4Z war und LinkedIn das Facebook, weil irgendwie habe ich das Gefühl, LinkedIn hat Zing gerade mal gepflegt oder rollt, zumindest im deutschen Markt. Wie siehst du das, Wolfgang?",
            "start": 1643751,
            "end": 1700557,
            "confidence": 0.7885838150289013,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Habe ich auch immer geglaubt, sehe aber mittlerweile ganz anders, weil wenn man sich die Zahlen anschaut, ist Xing immer noch die größte Plattform im deutschsprachigen Raum, weit, weit, weit vor LinkedIn. Und vielleicht wenn man in der extremen Tech-Bubble zu Hause ist, ist LinkedIn wahrscheinlich der Klassiker und ich verstehe es auch nicht ganz, warum Xing noch immer so verwendet wird, weil die Plattform selbst einfach nicht sehr gut ist. Aber das ist eine sehr große Plattform, auch jetzt mit der Connection zu Kununu und so weiter, die ja aufgekauft worden ist von Xing. Das ist also schon eine große Firma, die dahinter steckt und da auch extrem pusht und wo auch viele Recruiter auf der Plattform sind. Also im deutschsprachigen oder Dachraum ist es sicher die Plattform schlechthin noch, auch im technischen Bereich. Aber natürlich gerade im technischen Bereich ist LinkedIn sehr wichtig. Und wenn man international dann geht und vielleicht in irgendeinen Remote-Job oder so, dann führt da sowieso kein Weg dran vorbei an LinkedIn, meiner Meinung nach. Also wie es langfristig aussieht, keine Ahnung, mitgesehen. Aber aktuell hat es noch mehr Bedeutung, als man so denkt.",
            "start": 1701543,
            "end": 1765647,
            "confidence": 0.8239052631578946,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Persönlich sehe ich es ein bisschen anders. Größe ist nicht alles und das kommt glaube ich dann auch ganz drauf an, für welchen Job, welche Firma ihr so targetet, wo ihr arbeiten wollt. Aber also ich zum Beispiel kümmere mich um Zing eigentlich gar nicht mehr, nur noch LinkedIn und fertig. Aber könnt ihr selbst entscheiden, wenn ihr das Select-In-Profil habt, die ganze Sache mal eben kurz aufs Zink updaten. Kostet euch auch nur 20 Minuten. Von daher, wenn ihr den Benefit mitnehmen wollt, macht's ruhig. Ich persönlich sage okay, ich kümmere mich nicht mehr um Zink.",
            "start": 1766747,
            "end": 1796660,
            "confidence": 0.7816701030927833,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Mittlerweile ist es ja auch so, dass gerade im nichtdeutschen Raum ist mir aufgefallen, auch so Dinge wie Arbeitszeugnis oder persönliche Referenzen auf so Plattformen wie LinkedIn wandern und dass Leute mittlerweile fragen, kannst du mir eine Bewertung oder eigentlich ist es keine Bewertung, ein Review oder Referenz schreiben auf LinkedIn, dass es public sichtbar ist, weil das mittlerweile eigentlich fast wichtiger ist als irgendwie ein offizielles Arbeitszeugnis. weil gerade in Deutschland zum Beispiel die Arbeitszeugnisse sowieso immer irgendwie nur positiv sein dürfen und eine persönliche Referenz dann einfach noch mehr Wert hat als so ein Standard-Arbeitszeugnis.",
            "start": 1797367,
            "end": 1835278,
            "confidence": 0.8143195876288656,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ihr bei einem deutschen Arbeitgeber seid, holt euch ein Arbeitszeugnis. Ganz im Ernst, ich habe welche auch im Ordner hier. Ich habe noch nie eins irgendwo dran gepappt, weil das Problem mit deutschen Arbeitszeugnissen und das, was ich immer sehe, ist, du kannst so lange Nachbesserung fordern, bis es dir passt. dann hast du diesen komischen code mit manche wörter sind schlecht er war stets bemüht und stets zu unserer zufriedenheit bla bla bla also mich interessieren arbeitszeugnisse eher weniger ich hole mir trotzdem immer eins warum muss ich zugeben weiß ich jetzt gerade auch nicht warum ich das mache, Aber vielleicht, damit ich als guter Deutscher was für den Aktenordner habe. Aber sowas würde ich jetzt auch nicht mehr dran packen. Ich würde genauso wie ein persönliches Anschreiben, was man früher hat, würde ich jetzt auch nicht mehr so machen. Ein kleiner Disclaimer. Guckt wirklich, welche Firma ihr auswählt, wo ihr euch bewerbt. Das bedeutet, Bewerbt ihr euch eher bei dem guten deutschen Mittelstand, bei dem sogenannten Hidden Champion, bei einem etwas, wie soll man sagen, vielleicht nicht modernen Venture Capital Funded Unternehmen, dann spielt Sing eine größere Rolle, dann spielt gegebenenfalls das letzte Arbeitszeugnis eine Rolle und vielleicht auch noch ein Anschreiben?",
            "start": 1835298,
            "end": 1904693,
            "confidence": 0.8046878048780488,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube das Anschreiben ist noch ziemlich Standard eigentlich. Das wird in sehr vielen Bereichen noch gefordert. Da muss man einfach checken, wird sie überhaupt gefordert und dann kann man sich überlegen, okay, wie viel Liebe steckt man dort rein. Manche Hiringmanager, für die ist es wirklich wichtig und die schauen sich diese Anschreiben an und wenn es nicht gut personalisiert gemacht ist, kann es ein Grund sein, dass man rausgekickt wird. Ist für mich noch ein Rätsel, warum man das heutzutage immer noch macht. Aber es wird durchaus von manchen Firmen oder Hiringmanagern gefordert. Also auch da Vorsicht, aber umso international die Firma, glaube ich, umso unwichtiger wird dieses Anschreiben.",
            "start": 1904733,
            "end": 1941525,
            "confidence": 0.8156576576576579,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, wollt ihr voll in die Tech-Bubble, wollt ihr in die High-Growth-Unternehmen, wollt ihr in internationale Unternehmen, in sogenannte Start-Ups, Scale-Ups, dann spielt sowas alles keine Rolle mehr. Dann spielt das Arbeitszeugnis keine Rolle mehr, dann spielt das Anschreiben keine Rolle mehr. Da hilft in der Regel einfach nur Lebenslauf und ab da geht's dann weiter. dennoch fürs anschreiben macht da falls ihr das beim deutschen mittelstand hidden champions oder ähnliches anwenden wollt bitte bitte bitte kein copy paste ja da macht das wirklich personalisiert auf die firma nutzt das wording aus deren stellen ausschreibungen Sucht euch ein persönlicher Kontakt. Guten Tag, Herr Müller und so ähnliches. Steht oft irgendwie auf der Recruiting-Seite oder ähnliches. Ruft vielleicht vorher nochmal ganz kurz an. Hey, ich würde mich gerne bei euch bewerben. Habt ihr vielleicht mal einen direkten Ansprechpartner, den ich dann erwähnen kann. Das gibt euch dann in der Regel so einen minimalen Vorteil. Schreibt eigentlich, okay, warum das Unternehmen für euch interessant ist, wie seid ihr darauf gestoßen, warum die Stelle, auf die ihr euch bewerbt, für euch interessant ist und werdet da wirklich, wirklich, wirklich spezifisch. So spezifischer ihr werdet in diesen ein, zwei Sätzen, Umso mehr Value liefert ihr dem Leser auch und sagt, hey, der hat sich wirklich damit auseinandergesetzt. Und als letztes, warum ihr zum Beispiel für diese Stelle geeignet seid. Und nicht so, weil ich lernen möchte, weil ich die Industrie kennenlernen möchte, sondern schaut euch an, wo haben die letztens investiert. Haben die irgendwie eine neue Anlage für, weiß ich nicht, Biokunststoff oder ähnliches investiert. Bringt sowas mit rein.",
            "start": 1941901,
            "end": 2030262,
            "confidence": 0.7825584905660379,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder ein cooles Projekt oder einen Blog-Eintrag, wo sie über ein cooles Projekt schreiben, dass man wirklich drauf referenziert, okay, dieses Projekt ist so cool, weil und darum möchte ich arbeiten bei euch.",
            "start": 2030662,
            "end": 2043672,
            "confidence": 0.7438484848484848,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nicht, weil das moderne Technologie einsetzt. Das ist Bullshit, Bingo. Werdet spezifisch. So spezifischer ihr seid, ist genauso die Feedback geben. Nehmt euch da wirklich Kurzzeit und macht das wirklich gezielt auf die Firma.",
            "start": 2043712,
            "end": 2057783,
            "confidence": 0.8701470588235296,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wenn es kein Anschreiben gibt, kann man diese Personalisierung trotzdem durchführen und würde sogar es schwer empfehlen, zumindest wenn man den Job wirklich haben will, dass man den CV oder den Lebenslauf dementsprechend anpasst. Also dass man checkt, ok, welche Keywords sind denn so in der Ausschreibung genannt. Vielleicht hat man Blog-Einträge, vielleicht kennt man sogar jemanden in der Firma oder probiert einen Kontakt herzustellen, dass man mal so weiß, ok, was sucht die Firma eigentlich. Und dann kann man dementsprechend den Lebenslauf anpassen und diese Keywords in den Lebenslauf einbauen, gerade wenn es um Technologien geht. Wenn man weiß, okay, diese Firma verwendet MySQL zum Beispiel, dann kann man vielleicht irgendwo in seinem Lebenslauf einbauen, okay, ich habe MySQL-Erfahrung in diesem und diesem Bereich gesammelt. Und so kann man dementsprechend auch einen Fit herstellen zwischen dem Lebenslauf und der Stelle. Das ist also auch ganz wichtig, dass man da schon in die richtige Kerbe trifft und einen Vorteil hat und nicht automatisch rausfliegt, einfach weil man zu generisch war und der Lebenslauf so generisch aufgebaut ist, dass er eher so den Eindruck hat, dass das jetzt keine passende Person ist für die jeweilige Stelle.",
            "start": 2058263,
            "end": 2120211,
            "confidence": 0.8222244897959184,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Schaue ich auch die Stellenausschreibungen wirklich an, was ist gefordert und was muss auch in der Bewerbung sein. Beispiel, manche Firmen fordern direkt die Gehaltsanforderungen im Anschreiben oder ähnliches. Wenn das gefordert ist, pack sie rein, ansonsten weglassen. Ich bin immer ein Freund davon, wenn ihr die Jobanforderungen lest und ihr erfüllt 60 Prozent, dann seid ihr schon überqualifiziert. Ich bin da eher so ein Freund davon, stürzt euch ins Ungewisse, stürzt euch dahingehend auf die Jobs, die ihr lernen wollt. Das bedeutet, von den Anforderungen solltet ihr so, weiß ich nicht, so 30, 40 Prozent können und der Rest ist learning on the job, weil in der Regel wollt ihr euch auch weiterentwickeln. Das ist meine Herangehensweise. Ich verstehe, dass das scary ist und ich hatte auch schon sehr viele Gespräche in die Richtung, hey, aber ich kann das doch gar nicht. Seid einfach transparent. Das zeigt aber auch, ihr wollt euch weiterentwickeln, weil wie sonst kommt ihr an euren Traumjob in die Position, die ihr wollt oder ähnliches.",
            "start": 2120641,
            "end": 2174427,
            "confidence": 0.7986352941176472,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wo man sich vor allem weiterentwickeln kann.",
            "start": 2174447,
            "end": 2175888,
            "confidence": 0.6385714285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wolfgang hat kurz persönliche Referenzen erwähnt. Ich gebe da jetzt eigentlich relativ wenig drauf, ob mir jetzt bei LinkedIn irgendjemand bestätigt hat, dass ich PHP kann. Was ich aber schon mal erfahren habe, beziehungsweise auch am eigenen Lab erfahren habe, ist, dass der Recruiter mich dann im späteren Prozess nachgefragt hat, hey, hast du ein, zwei Leute, die ich mal anschreiben kann und mit denen ich kurz telefonieren kann als Referenz? Habe ich dann kurz ein, zwei Leute abgeklappert, ob das okay ist, ob ich die Nummer weitergeben kann und dann wurde da kurz angerufen. Ist natürlich nur relevant, wenn es zum Beispiel an sicherheitsrelevante Industrien geht, größere Cloud-Provider oder ähnliches, wo man mit sehr viel Daten von anderen Kunden arbeitet oder oder oder. Kommt dann immer ganz auf die Industrie an. Wird mit hoher Wahrscheinlichkeit nicht für die klassische Webagentur in Wanne-Eickel passieren, aber wenn ihr bei Amazon, Google oder ähnliches bei den großen Playern oder vielleicht sogar bei einem Hidden Champion, der irgendwie super compliant ist, da kann sowas natürlich passieren. Dann kann das natürlich auch passieren, dass ihr ein polizeiliches Führungszeugnis vorlegen müssen. Es kommt dann immer ganz auf die Industrie an, eine Bank oder ähnliches.",
            "start": 2176278,
            "end": 2235818,
            "confidence": 0.7906331658291461,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es gibt sogar Firmen, die sich darauf spezialisiert haben und diese Background-Checks durchführen, gerade bei den Großen. Und da geht es dann wirklich darum, die checken dann jeden einzelnen Punkt in dem Lebenslauf und checken den mit externen Quellen ab. Da muss man also wirklich jeden Punkt im Lebenslauf nachweisen in Form von einer Telefonnummer oder von einem Gehaltszettel zum Beispiel. Und dann wird wirklich alles gecheckt, dass auch wirklich alles 100 Prozent wahr ist in diesem Lebenslauf und da gibt es dann wirklich Leute, die herumtelefonieren und jedes einzelne Fakt-Checking im Lebenslauf. Also gerade bei den Großen kann es durchaus sein und umso mehr Compliance im Hintergrund dort mitspielt, umso eher ist es natürlich dann auch noch der Fall.",
            "start": 2236224,
            "end": 2277427,
            "confidence": 0.8508333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Guter Punkt. Auf keinen Fall Unwahrheiten einschreiben. Ich habe sogar schon gehört, dass das strafrechtlich verfolgt werden kann. Oder ich werde dann irgendein Politiker, der aus seiner Doktorarbeit abgeschrieben hat. Ihr kennt die ganzen Storys. Bewerbung ist abgesendet. Ihr kriegt irgendwann einen Anruf oder eine E-Mail. Ihr werdet zum Interview eingeladen. Was kann man da machen? Bevor es zu dem Interview geht, bin ich immer ein riesen, riesen, riesen Freund, den Rekruter zu fragen, beziehungsweise die Kontaktperson. Da frage ich immer zwei Sachen. Ob die Kontaktperson irgendwelche Tipps für mich hat, ob ich mich irgendwo drauf vorbereiten soll. Und ich hole mir immer die Namen meiner Interviewpartner und die E-Mail-Adressen, frage ich dann oft meine Kontaktperson und schreibe denen im Vorhinein eine E-Mail. Hallo, ich freue mich auf das Interview. Kann ich mich oder soll ich mich auf etwas spezifisches vorbereiten? Warum macht das Sinn? Das kostet euch eine Minute, vielleicht zwei. Macht aber super Sinn, weil die Firma hat auch ein Interesse, dass ihr erfolgreich seid in dem Interview. Die investieren Zeit und somit auch Geld, die Stelle zu besetzen. Euch gibt das einen ganz kleinen Vorteil, weil ab und zu antworten die Interviewpartner und sagen, ja, pass mal auf, Wir machen hier so ein bisschen kleinen Hands-on-Test und wir beschäftigen uns dann zum Beispiel mit Systemd und mit dem Linux-System. Top! Das gibt mir einen ganz kleinen Vorsprung, dass ich mich dann schon zum Beispiel mit Systemd einlesen kann vor dem Interview. Kostet euch nix und der Worst Case ist, ihr kriegt keine Antwort. Aber dann seid ihr doch genauso klug wie vorher auch.",
            "start": 2277467,
            "end": 2364112,
            "confidence": 0.7700488721804508,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und man kann sich ja trotzdem auch anderwärtig vorbereiten oder mit dem Thema oder mit der Firma auseinandersetzen. Es gibt Tech-Blogs, es gibt vielleicht Informationen auf Plattformen wie Canunu oder Glassdoor, wo man abchecken kann, was fragen denn die so in Interviews. Man kann sich einfach informieren, was verwendet die Firma für Tools, für Technologien. Was haben die so in der Vergangenheit gemacht? Gibt es irgendwelche internen Artikel zu der Technologie, zu Projekten? Und so bekommt man normalerweise auch recht schnell ein Gefühl, was die Firma denn so macht und in welche Richtung das Interview gehen könnte. Man weiß es natürlich nicht, aber man beschäftigt sich mit der Firma, hat dann viele Informationen. Im Idealfall hat man das eh schon gemacht für den Lebenslauf, aber hat dann auch Informationen zur Firma und kann sich dann dementsprechend auch besser aufs Interview vorbereiten und kann sich vielleicht auch einfach ein bisschen einlesen. Die Technologien können damit auch einfach zeigen, dass man proaktiv ist. und vielleicht im Interview dann auch sagen, ja, habe ich gerade kürzlich gelesen, weil ich gesehen habe oder gelesen habe, ihr verwendet es und kann dann dementsprechend auch zeigen, dass man eben proaktiv ist.",
            "start": 2364857,
            "end": 2430532,
            "confidence": 0.8046820512820514,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zur Vorbereitung speziell darüber, was ihr über das Unternehmen lesen solltet, fällt natürlich auch, wie verdient das Unternehmen eigentlich Geld? Was ist das Business-Modell? Ist es Pay-per-Click? Ist es für Referrals? Ist das ein Software-as-a-Service, Plattform-as-a-Service? Wer sind eigentlich die Kunden? Nehmen wir mal ein klassisches Modell von Booking.com. Booking.com Wenn ihr da ein Hotel bucht, dann zahlt ihr nicht das Geld an Booking. Ihr seid nicht die Kunden, sondern die Hotels zahlen Geld an Booking, dass ihr darüber gebucht habt. Somit ist Booking eigentlich nur eine Traffic-Seite in der Hinsicht, die den Kunden an die Firma weiterleitet, die dann zum Beispiel ein Hotelzimmer zu vergeben hat. Also macht euch wirklich Gedanken, wie verdient denn diese Firma Geld. Welche Business-Units gibt es? Ist das ein größerer Konzern? Dann sind die in der Regel divers aufgestellt, haben verschiedene Business-Units, um verschiedene Standbeute zu haben, falls mal einer wegbricht, dass das ganze Unternehmen nicht in Schieflage gerät. Wie groß ist das Unternehmen eigentlich? Reden wir von 20 Mitarbeitern, 200, 2000, 20.000 oder 200.000? Und dann natürlich auch ein bisschen jobspezifisch vorbereiten. Das bedeutet, wenn ihr euch als Produktmanagerin bewerbt, schaut doch einfach mal nach, wer sind denn eigentlich die Konkurrenten und was machen die Konkurrenten eigentlich besser als die Firma, wo ihr euch bewerbt. Also bereitet euch so ein bisschen vor. Wolfgang hat das gerade schon genannt. Schaut auf YouTube Konferenztalks. Hat ein Mitarbeiter schon mal was darüber gesprochen? Schaut euch den an. Techblog lesen. Googelt mal irgendwie auf irgendwelche Zeitungsartikel. bereitet euch ein bisschen jobspezifisch auf das unternehmen vor denn die frage was wissen sie eigentlich über unser unternehmen kann kommen muss nicht aber teilweise habe ich schon antworten gekriegt da wussten die menschen noch nichtmals wie dieses unternehmen wo die gerade im interview sitzen geld verdient und dann muss ich schon sagen bisschen schwach Also.",
            "start": 2430552,
            "end": 2536555,
            "confidence": 0.7849901639344261,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe da auch teilweise erlebt, das war eine klassische Frage, die ich gestellt habe. Hast du die Webseite schon mal verwendet, das Produkt? Das war meine erste Frage. Und dann die zweite. Was hat dich gestört? Was würdest du gerne verbessert sehen? Und ich habe da halt auch teilweise Antworten bekommen. Ich war noch nie auf der Webseite. Ich will für euch arbeiten, aber ich war noch nie auf eurer Webseite. Ich habe keine Ahnung, was das Produkt macht. Und das ist natürlich dann schon schwierig. In einem ganz sehr großen Unternehmen, wo man vielleicht ganz speziell in irgendeinem Unterbereich einsteigt, kann man vielleicht darüber hinwegsehen, aber ich glaube, wenn es in Richtung Interview geht, vor allem On-Site-Interview, wo man dann wirklich zur Firma eingeladen wird, spätestens dann muss man sich mit der Firma meiner Meinung nach beschäftigt haben, weil dass man in irgendein anderes Land fliegt für ein Interview und dann noch nie auf der Webseite von der Firma war, dann ist das meiner Meinung nach ein schlechtes Zeichen.",
            "start": 2536575,
            "end": 2586714,
            "confidence": 0.790654970760234,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Generell noch zwei Punkte, die eigentlich auf jedes Interview zutreffen. Oder eigentlich drei Punkte. Der erste Punkt ist die Vorbereitung. Ja, gegebenenfalls sind wir als Software-Ingenieure gerade sehr gesegnet. Und ja, vielleicht ist es gerade ein Bewerbermarkt und kein Firmenmarkt. Dennoch solltet ihr euch ein bisschen vorbereiten, was macht das Unternehmen, wie verdient das Geld. Einfach nur, um nicht den Eindruck zu entwickeln, I don't give a shit. Ist auch einfach nur respektvoll und ihr wollt euch natürlich auch irgendwie bei einem Unternehmen bewerben, wofür ihr vielleicht steht und wo ihr gegenfalls mehr als sechs Monate haben wollt. Also bereitet euch ein bisschen vor, auch wenn das Unternehmen sich auch bei euch bewirbt. Da kommen wir somit zum zweiten Punkt. Ein Interview ist eine bidirektionale Unterhaltung. Nicht ihr bewerbt euch nur bei dieser Firma, sondern auch inzwischen, Fachterm Fachkräftemangel. Das Unternehmen bewirbt sich also auch bei euch. Ja, das war vielleicht in den 70ern ein bisschen anders, inzwischen ist es aber so. Deswegen seht das Interview bitte auch als bidirektionale Unterhaltung und nicht nur als klassisches Frage-Antwort-Spiel, wo ihr da sitzt und einfach nur auf die Fragen antworten müsst.",
            "start": 2587034,
            "end": 2657908,
            "confidence": 0.8201164021164016,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das heißt aber auch, dass man sich dementsprechend vorbereiten muss, um dann Fragen überhaupt zu haben für diese bidirektionale Unterhaltung. Also, dass man danach Fragen stellen kann, Okay, wie macht ihr denn das? Wie ist euer Team-Setup? Wie funktioniert irgendwie eine technische Komponente? Dass man da also wirklich gute Fragen in der Hinterhand hat, weil auch das erwartet wird, meiner Meinung nach, und auch eine gute Möglichkeit ist, einfach mehr über dieses Unternehmen zu erfragen und zu erfahren. Ein Großteil von dem Interview kann auch darüber passieren, dass man eben Fragen stellt und auch da dann in tiefere Diskussionen kommt. Also auch da bringt diese Vorbereitung sehr viel.",
            "start": 2657948,
            "end": 2698687,
            "confidence": 0.8519907407407404,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und als letzter Punkt, und den müsst ihr euch wirklich verinnerlichen, Interviewing ist immer, immer, immer, immer mit etwas Glück verbunden. Und das könnt ihr auch nicht beeinflussen. Mit wem habt ihr das Interview? Wie ist die Person gerade drauf? Hat die Person sich gerade vielleicht von ihrem Partner getrennt oder von ihrem Partner getrennt? Das könnt ihr alles nicht beeinflussen, das beeinflusst aber euer Interview. Und das beeinflusst leider auch das Interviewergebnis. Ihr könnt der einzige Experte in der ganzen Welt über diesem Thema sein, und ihr könnt trotzdem für die passende Stelle rausfliegen, aufgrund von nicht technischen oder nicht fachspezifischen Kriterien. Natürlich gibt es da ein paar Techniken, um da gegenzuwirken. Sowas nennt sich Thema strukturiertes Interview und Co. Machen wir mal in einer zukünftigen Folge, wenn wir das Thema aus Firmensicht betrachten. Dennoch, falls ihr eine Absage kriegt, nehmt sie nicht persönlich. Ist immer mit etwas Glück verbunden.",
            "start": 2698727,
            "end": 2750948,
            "confidence": 0.7878278145695364,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber jetzt sind wir so lange um das Interview herum gerudert, wenn wir jetzt mal in das Interview einsteigen. Andi, du in deiner Garten-Session, was hast du denn da an Tipps zur Verfügung gestellt, wenn es um das Interview selbst geht oder wie ein Interview eigentlich abläuft?",
            "start": 2751361,
            "end": 2764985,
            "confidence": 0.788276595744681,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich denke, es ist erstmal wichtig zu verstehen, wie die generelle Struktur von einem Interview ist. Man kommt da in der Regel an oder joint dem Zoom-Call oder dem Google-Meet-Call inzwischen. Und was passiert dann in der nächsten Stunde? Natürlich müssen wir gucken, in welcher Stage des Interviews sind wir. Besonders in Tech-Interviews in der Regel sind das mehrere Stages. Der erste Hiringmanager-Call, dann ein technisches Interview, wo dann gegebenenfalls eure Hardskills abgefragt werden und vielleicht lernt man nochmal das Team kennen und so weiter und so. Aber die generelle Struktur ist eigentlich immer dieselbe. Und zwar kommt man in den Call oder kommt man in den Raum, der Interviewleiter, in der Regel der sogenannte Hiringmanager, der Entscheidungsträger, sagt dann, okay, herzlich willkommen, dies und das. In der nächsten Stunde, in den nächsten anderthalb Stunden passiert das. Erst stellen wir uns eine Runde vor. dann reden wir so ein bisschen und am Ende haben Sie als Kandidat dann nochmal die Möglichkeit, ein paar Fragen zu stellen. Das ist so die Grundstruktur. In der Regel fängt das dann mit einer Vorstellung an, wo die Leute von der Firma sich ein bisschen vorstellen und am Ende stellst du dich dann ein bisschen vor. Obwohl die Leute natürlich deinen Lebenslauf in der Regel gelesen haben, fordern sie oft nochmal eine kleine Vorstellung. Ich mach das zum Beispiel immer, weil ich dann merke, welche Punkte highlightest du selbst über dich und welche lässt du einfach weg. für mich ist das ein sehr guter indikator was für dich wichtig ist und was für dich nicht wichtig.",
            "start": 2765305,
            "end": 2844070,
            "confidence": 0.7716168582375474,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube da ist es auch wichtig dass man das im vorhinein vielleicht mal kurz durchspielt und gerade so eine vorstellung dass man dann nicht zu lange wird und irgendwie zehn minuten dann oder 15 minuten durch seinen ganzen lebenslauf rattert von von der grundschule angefangen bis zum tod fast, sondern dass man da eben kurz und bündig die wichtigen Punkte erwähnt und sich auch fokussiert, glaube ich, auf die letzten, ich würde mal sagen, zwei bis vier Jahre, was man da so gemacht hat und mitgenommen hat, weil wen interessiert es, was man da irgendwo in der Grundschule, Volksschule, wie es bei uns heißt, by the way, so gemacht hat.",
            "start": 2844690,
            "end": 2877360,
            "confidence": 0.8110180180180181,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Redezeit ist ein ganz wichtiger Punkt. Schweift nicht ab, redet nicht 15 Minuten über euch. Es geht um euch, ich weiß, aber die Leute haben in der Regel ein Programm, was sie durchballern müssen. Somit balanciert ein bisschen eure eigene Redezeit. Konzentriert euch auf das Wesentliche und werdet euch immer bewusst, alles, wirklich alles, was ihr da sagt, kann im nächsten Satz als Frage, als Boomerang zurückkommen. Das bedeutet, ihr erwähnt von irgendeinem Projekt, Migration von Subversion auf Git, Microservices zurück auf Monolith. Seid gefasst, dass da eine Frage zukommt und dass da tiefer nachgebohrt wird.",
            "start": 2877980,
            "end": 2914244,
            "confidence": 0.8391249999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das kann man aber auch positiv nützen, indem man eben zum Beispiel, wir haben es damals in Side Projects erwähnt, in der Episode 1, wenn man so ein Side Project in den Raum wirft, wo man vielleicht sehr viel Ahnung hat, dann wird das auch gerne aufgegriffen und so kann man das Interview natürlich auch in gewisser Maßen, in gewisse Richtungen steuern oder kann halt einfach gewisse Themen sozusagen vorschlagen durch die eigene Antwort.",
            "start": 2914694,
            "end": 2936078,
            "confidence": 0.7898243243243245,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Habt ihr einen guten Interviewpartner, der sehr viel Erfahrung hat, wird das sogar so sehr, sehr oft gemacht. Er nimmt sich etwas, was du gesagt hast, formuliert das als Frage und gibt dir somit die Chance, erstens zu glänzen, weil du genau etwas hast, ein Thema, wo du sehr viel darüber sprechen kannst. Zweitens hilft er dir, erfolgreich zu sein im Interview und nimmt dir ein bisschen die Nervosität, weil du ein Thema hast, über das du sprechen kannst, weil diese Leute wollen auch, dass du erfolgreich im Interview bist. Der Hauptteil des Interviews ist dann in der Regel so eine Art Fragerunde. Bei größeren Firmen, bei strukturierteren Firmen, bei Konzernen ist das oft ein sogenanntes strukturiertes Interview. Das bedeutet, die haben einen vorgefertigten Fragekatalog, wo die ein, zwei, drei, vier Pflichtfragen haben und dann ein paar optionale Fragen. Die stellen sie jeder Kandidatin oder jedem Kandidaten. Der Grund ist ganz einfach der Vergleichbarkeit zwischen den Kandidaten. Wer war besser? Wer hat auf die Antworten gut geantwortet. Ab und zu haben diese strukturierten Fragen auch dann oft auf deren Papier noch mögliche Lösungsantworten, damit man die Fragen und Antworten und den Interviewprozess über mehrere Leute skalieren kann. Da ist der Punkt, wo das mit dem Glück auftaucht. Also ab und zu ist es leider so, wenn man nicht die richtigen Passwörter trifft und die Person sich mit der Materie oft nicht wirklich gut auskennt, dann heißt es oft, oh, der hat ungefähr davon geredet, aber nicht das Passwort getroffen. Da könnt ihr da nichts dran ändern. Das ist dann einfach so. Generell haben die so ein Set von Pflichtfragen, die die durchballern müssen. Und später geht's dann ein bisschen oft in die Freestyle-Richtung. Freestyle-Richtung ist dann oft so, wie man herauskitzelt, okay, hat die Person Motivation oder ähnliches.",
            "start": 2936438,
            "end": 3038277,
            "confidence": 0.8182617449664429,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Trotzdem, auch wenn das Ganze strukturiert ist oder im Hintergrund durchgestylt ist, meiner Meinung nach ein gutes Interview fühlt sich nicht durchstrukturiert an, sondern fühlt sich wie ein gemütliches Gespräch an. Und wenn man dann rausgeht und sagt, hey, es war eigentlich gar kein Interview, es war gar nicht so schwer, es war einfach nur eine coole Unterhaltung und es ist im Hintergrund trotzdem strukturiert, das ist eigentlich wie ein Interview meiner Meinung nach sein sollte und es sollte jeder mit einem guten Gefühl dann am Ende rausgehen. Also im Idealfall läuft es wirklich wie ein Gespräch ab und ihr braucht euch nicht in den Kopf zu brechen, ist das jetzt strukturiert oder was sind das für Fragen. Einfach mit dem Flow folgen und dann ist es im Idealfall ein gutes Gespräch, wenn der Interviewer oder die Interviewerin gut ist und erfahren.",
            "start": 3038617,
            "end": 3080382,
            "confidence": 0.7853309859154931,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gegen Ende des Gesprächs werden meist so 10, 15 Minuten reserviert, damit der Kandidat, also ihr, entsprechende Fragen stellen kann, wo sich dann die Mitarbeiter Zeit nehmen und ordentlich antworten. Bitte werdet euch bewusst, dass auch die Leute von der Firma nicht auf alle Fragen antworten können. In der Regel dürfen die nicht auf Fragen antworten, die etwas mit sowas als sogenannten Forward-Looking Statements zu tun haben. Das bedeutet, welche Features plant ihr gerade und welche Features werdet ihr gerade releasen oder an welchen, was sind gerade eure Top-Projekte, Das sind in der Regel Fragen, wo auch keine Antwort gegeben werden darf, speziell in börsennotierten Unternehmen. Aber da habt auf jeden Fall ein, zwei, drei, vier Fragen ready oder vielleicht auch eine größere Liste. Ihr solltet auf jeden Fall ein, zwei gute Fragen haben, wie zum Beispiel, wie groß ist denn das Team? Wie sieht denn ein typischer Arbeitsalltag aus? Oder wie würden meine ersten drei bis sechs Monate hier aussehen?",
            "start": 3080970,
            "end": 3138337,
            "confidence": 0.8106273291925468,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber da würde ich jetzt nochmal einhaken mit dem... Es darf nicht geantwortet werden. Also bei einer guten Firma, gerade bei einem börsennotierten Unternehmen erwarte ich mir auch, dass da gute Leute sitzen und dass die eine Antwort auf sowas haben. Also wenn ich frage, was sind eure Top-Projekte, egal ob die das dürfen oder nicht, der muss mir eine oder die muss mir eine Antwort geben, einfach um mich zu motivieren. Klar, das wird nicht das Geheimprojekt sein, was die Welt revolutioniert, aber wenigstens in welche Richtung das geht, was das für Technologien sind vielleicht oder was da für Challenges in irgendeiner Form in der Firma sitzen. Ich brauche nicht dieses ganze Projekt erklären, aber da erwarte ich mir sehr wohl eine gute Antwort und ich finde, das ist auch ein sehr wichtiger Bereich, wo man eine Frage stellen kann. Was sind die Top-Projekte? An welchen Projekten würde ich dann arbeiten? Man kann ja dann auch ehrlich antworten, okay, das ist unklar oder es ist aktuell gibt es einfach so viele Projekte in dem und dem und dem Bereich, aber es ist noch unklar, wo du dann eingesetzt wirst. Kann man ja ehrlich darüber reden, aber ich erwarte mir schon, dass da einiges zurückkommt.",
            "start": 3138711,
            "end": 3198985,
            "confidence": 0.7660975609756102,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, okay, das ist ein fairer Punkt. Vielleicht damit mal den Interviewpartner ein bisschen challengen. Gute Leute bringen so eine Frage nicht als erstes. Somit haben die sehr wahrscheinlich eine Antwort ready. Wie dem auch sei, habt auf jeden Fall Fragen ready, die euch auch wirklich interessieren, damit ihr nicht am Ende da steht, wenn ihr gefragt werdet, habt ihr noch eine Frage? Dann sagst du, ach nö, eigentlich ist alles klar. Quatsch, ihr sitzt ja gerade eine Stunde im Interview und bewerbt euch für eine komplett neue Firma. Natürlich habt ihr ein paar Fragen. Du kannst auch fragen, wie sieht euer Code Review Prozess aus oder wie oft deployed ihr am Tag? Einfach nur mal ein Gefühl zu kriegen von der Kultur, ja. Das sind jetzt sehr technische Fragen, aber ihr könnt auch sehr viel kulturelle Fragen. Bereitet euch auf jeden Fall vor, holt euch ein paar technische, holt euch ein paar Fragen.",
            "start": 3198985,
            "end": 3237402,
            "confidence": 0.6345519480519478,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und auch da wieder Blogartikel zum Beispiel lesen oder die ganzen Informationen, die ihr im Vorfeld gesammelt habt, einfach verwenden und daraus fragen, kreieren. Wenn euch wirklich irgendeine Frage interessiert, weil ihr im Blogartikel gelesen habt, diese Technologie wird so eingesetzt und ihr habt euch überlegt beim Durchlesen, okay warum machen die das nicht mit dieser anderen Technologie oder sowas. Perfekte Frage. Einfach mitnehmen und reinwerfen. Da sieht man auch dann, dass man gut vorbereitet ist, macht einen guten Eindruck und kann auch diese Sachen wirklich abklären.",
            "start": 3237623,
            "end": 3266597,
            "confidence": 0.7973103448275859,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In der Regel wird das Interview damit abgeschlossen, dass ihr gar kein Feedback kriegt, sondern einfach nur so einen Satz wie, vielen Dank für deine Zeit. Wir gehen jetzt mal zurück und besprechen das Feedback und du wirst sehr zeitnah über die nächsten Schritte informiert. Das ist so in der Regel der Standardsatz, mit dem man dann das Interview beendet. Also nicht ihr, sondern eure Interviewpartner. Und dann müsst ihr eigentlich warten.",
            "start": 3267041,
            "end": 3289248,
            "confidence": 0.8250416666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich kenne aber auch Firmen, die wirklich das sofort entscheiden. Du bleibst in der Leitung oder in 15 Minuten danach bekommst du die Entscheidung inklusive Feedback.",
            "start": 3289888,
            "end": 3299333,
            "confidence": 0.8004615384615383,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Respekt, hatte ich noch nicht so. Finde ich aber cool. Gehen wir mal ein bisschen auf das Gespräch selber ein. Jetzt haben wir ein bisschen über die Struktur gesprochen, auf die Fragerunde sozusagen. Und bei technischen Interviews ist das natürlich oft so, man kriegt eine technische Challenge oder ein Whiteboard-Interview. Man nennt das immer so Cracking, so Coding-Interview, Whiteboard-Test, Lead-Test oder ähnliches.",
            "start": 3299393,
            "end": 3318242,
            "confidence": 0.7111774193548388,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was bedeutet das?",
            "start": 3319624,
            "end": 3320745,
            "confidence": 0.7673333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das bedeutet in der Regel stell dich mal ans Whiteboard oder hier hast du ein digitales Whiteboard und dreh mal ein Binary Tree um. Gib mir mal den Algorithmus um den Binary Tree einfach umzudrehen.",
            "start": 3320785,
            "end": 3330621,
            "confidence": 0.7324285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was heißt umzudrehen, wie kannst du denn den Binary Tree umdrehen?",
            "start": 3331007,
            "end": 3335010,
            "confidence": 0.5745454545454546,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Siehste? Fangfrage, ja? Nee, aber dass du halt algorithmische Fragen stellst.",
            "start": 3335051,
            "end": 3339955,
            "confidence": 0.6435454545454546,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Fangfrage im Sinne von den Fangcompanies oder Fangen?",
            "start": 3340015,
            "end": 3347841,
            "confidence": 0.8046249999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der war flach. Nee, aber es geht darum, eigentlich algorithmische Fragen, wie zum Beispiel, okay, du hast jetzt eine Zeichenkette, wie findest du am effizientesten heraus, wie oft ein Buchstabe in der Zeichenkette vorkommt? Wie löst du das, wenn der String 20 Charakter lang ist oder wenn du 38 mal die Bibel hintereinander konkettet hast?",
            "start": 3347881,
            "end": 3367608,
            "confidence": 0.7982909090909092,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also so ein klassischer Algorithmus malen wir denn mal auf am Boardboard.",
            "start": 3368308,
            "end": 3371410,
            "confidence": 0.5182500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Kann man Fan von sein, kann man nicht Fan von sein. Ich glaube, das kommt immer ganz auf die Firma drauf an, wo ihr euch bewerbt.",
            "start": 3371430,
            "end": 3377634,
            "confidence": 0.758148148148148,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es wird auf jeden Fall gemacht.",
            "start": 3377674,
            "end": 3379155,
            "confidence": 0.6885,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Chance, dass ihr in irgendeiner Art und Weise eine technische Frage in irgendeiner solchen Richtung bekommt, ist sehr hoch. Manche sind sehr hart, besonders wenn ihr in Richtung Google, Facebook und Co geht. Weil der Grund ist ganz einfach, das ist deren Schema F, wie die die große Anzahl an Bewerbungen überhaupt händeln können. Die kriegen so viele Bewerbungen und die brauchen in irgendeiner Art und Weise einen knallharten Filter.",
            "start": 3379195,
            "end": 3405798,
            "confidence": 0.840056338028169,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man hört ja auch ganz oft, dass man eigentlich bei den großen Funk-Companies, um nochmal darauf zurückzukommen, Eigentlich ohne eine Vorbereitung im Sinne von, ich lese mal vier, fünf Bücher, fette Schwarten mit Algorithmen und so Dingen, Algorithmen und Datenstrukturen, wenn man sich nicht so vorbereitet, mehrere Wochen lang, hat man eigentlich gar keine Chance. Also da gibt es natürlich sicher Unterschiede bei den Firmen.",
            "start": 3405858,
            "end": 3429427,
            "confidence": 0.8541230769230767,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Andere Firmen haben so eine Art Homework-Test. Das bedeutet, ihr kriegt ein PDF nach Hause geschickt und müsst dann innerhalb von, weiß ich nicht, einer Woche, zwei, drei, irgendwie so ein paar Lines auf Code schreiben und dann zurückschinden. Dann wird das in einem Code-Review gemacht. Manche andere Firmen machen so eine Art Live-Coding. Die geben euch dann so eine Online-ID. Und dann müsst ihr zum Beispiel, ein Klassiker ist immer so eine Palindrom-Erkennung. Das bedeutet, ihr habt eine Funktion, da kommt ein String rein und der Return-Value ist ein Boolean. Der String, der reinkommt, ist der Name Anna, also A-N-N-A. Ja, das ist ein Palindrom. Ein Palindrom ist ein String, was du von vorne wie von hinten lesen kannst, gleich geschrieben ist. Und dann, ihr müsst so eine Art Live-Coding machen. Wie findet ihr heraus, ob das Wort, was da jetzt gerade als Input-Parameter reinkommt, ein Palindrom ist und gibt dann True oder False zurück. So was zum Beispiel.",
            "start": 3429867,
            "end": 3475952,
            "confidence": 0.7300312499999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auf sowas kann man sich natürlich auch relativ gut vorbereiten, weil die sind so Klassiker. Wenn man weiß, dass die Firma auf das Zeug steht und das garantiert kommt, dann kann man einfach auf eine Online-Plattform gehen, zum Beispiel, Andi, du kennst sowas sicher auswendig.",
            "start": 3476486,
            "end": 3491852,
            "confidence": 0.8129333333333331,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "HackerRank.",
            "start": 3491892,
            "end": 3492352,
            "confidence": 0.706,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, HackerRank zum Beispiel verlinken wir natürlich auch. Da gibt es ein paar Plattformen, wo man einfach durch so Algorithmen durchgehen kann und die programmieren kann in verschiedenen Programmiersprachen und dann so ein Gefühl bekommt für diese Art von Fragen. Aber auch da, glaube ich, macht es nur Sinn, wenn man halt weiß, die Interviews gehen meistens in so eine Richtung.",
            "start": 3492992,
            "end": 3510798,
            "confidence": 0.7927540983606557,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wir werden jetzt sehr viele Hörerinnen und Hörer haben, das ist doch alles Bullshit, das braucht doch kein Mensch, das mache ich doch nicht im Job. Ja, und vielleicht habt ihr recht. Punkt ist aber, so machen das die Firmen. Ihr setzt euch gerne hin, revolutioniert den Interviewmarkt. Ich bin da euer erster Fan von. So läuft das Spiel halt leider. Und wenn ihr einen Job haben wollt in der Hinsicht, dann müsst ihr leider das Spiel mitspielen. Der Punkt ist jedoch, Ihr müsst dann nicht komplett nervös sitzen, schwitzen und allem drum und dran. Es gibt so zwei Möglichkeiten. Die erste Geschichte ist, ihr bereitet euch wirklich vor. Und zwar gibt es sogar ein Buch, kostet 30 Euro, nennt sich Cracking the Coding Interview. Das ist ein relativ dicker Schinken. Das ackert ihr durch. Da habt ihr eigentlich alles drauf. Von jedem Sorting-Algorithmus. über Routing-Algorithmen, blablabla, damit seid ihr eigentlich relativ gut vorbereitet. Die andere Geschichte ist aber auch, falls ihr sowas gestellt bekommt, und das ist meines Erachtens nach die richtige Stärke, denkt laut. Wie würdet ihr das Problem lösen? Auch wenn ihr es gerade nicht programmieren könnt, sprecht es durch. Seid offen. Es tut mir leid, ich weiß gerade nicht, wie ich das hier programmiere, weil Python nicht meine bevorzugte Sprache ist, und die fordern mir, dass ich das jetzt in Python schreibe. Aber ich kann eine Alternative anbieten. Ich würde das logisch so angehen. Du hast zwei Zeiger. Einer geht von vorne, einer geht von hinten. Treffen sich in der Mitte. Damit habe ich zwei Counter. Bla bla bla. Sprecht einfach laut durch. Wie würde dir das Problem lösen? Das ist die erste Baustelle.",
            "start": 3511218,
            "end": 3590527,
            "confidence": 0.7736451612903221,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, das ist sogar eine gute Herangehensweise, auch wenn man die Programmiersprache kann, dass man einfach mal sagt, okay, ich würde das so und so und so lösen, bevor man wirklich Coden anfängt, weil es einfach einfacher ist, auf so einer Meta-Ebene nochmal drüber zu diskutieren, bevor man wirklich in die Tiefe geht.",
            "start": 3590727,
            "end": 3605174,
            "confidence": 0.8056481481481483,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die zweite Geschichte ist, fragt, ob ihr Stack Overflow, Google und ähnliches benutzen dürft, weil, sind wir mal ganz ehrlich, so läuft der Job ab. Und immer wenn ich das gefragt habe, sagen die, ja natürlich, du kannst uns auch fragen, wie wir das lösen würden. In der Regel geht es den Interviewpartnern darum, wie löst ihr das Problem, wie geht ihr das an, involviert ihr sie, wie ihr ein richtiges Team involvieren würdet oder ähnliches. Bei Googlen gehört einfach so ein Job ohne Stack Overflow, kriegen wir es einfach nicht mehr gelöst. Zugegeben, ich habe mich immer gefragt, wie machen eigentlich Zeit-Reliability-Engineers bei Stack Overflow, wie beheben die den Inzidenz ohne Stack Overflow? Aber nun gut, das ist eine Frage für heute Abend bei einem Weinchen. Auf jeden Fall bezieht die Leute mit ein, sagt denen, was ihr denkt, wie ihr das Problem lösen wollt. Den Leuten geht es in der Regel nicht um die richtige Lösung. Den Leuten geht es in der Regel dazu verstehen, wie ist euer Denkensprozess dabei. Und auch etwas zu sagen, hey, ich weiß es gerade nicht, ist eine Stärke. Und wenn ihr diese Stärke ausspielt, wenn ihr wirklich gerade keine Lösung auf die Algorithmusfrage oder vielleicht auf irgendeine andere Frage habt, wie zum Beispiel, wo ist der Unterschied zwischen git rebase und git bisect, Sagt einfach nur, es tut mir leid, ich weiß es gerade nicht, aber mich würde interessieren, was der Unterschied ist, könnt ihr mir das mal kurz erklären oder wie würdet ihr es denn lösen, wie handhabt ihr es? Stellt auch eine Gegenfrage, denn das zeigt so kleine Kriterien wie zum Beispiel, ihr wollt lernen, ihr wollt auch von euren Partnern lernen und von den Interviewpartnern und ihr seid neugierig, ihr nehmt andere Meinungen an und ihr seid nicht sehr, sehr opinionated und beharrt auf eure Meinung. Das sind so zwei, drei Killerfragen. Gebt zu, dass ihr auch mal was nicht wisst und fragt einfach, wie die Interviewpartner es lösen würden.",
            "start": 3605534,
            "end": 3704491,
            "confidence": 0.7981903323262846,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Neben den ganzen technischen Fragen gibt es mittlerweile auch eigentlich sehr verbreite, beziehungsweise würde man sagen, es macht mittlerweile fast jeder, sind sogenannte behavioral questions oder Verhaltensfragen im Deutschen vielleicht, Verhaltensinterview. Da geht es um so Dinge, abseits des Technischen, wie sich jemand eben im Team verhält. So klassische Frage wäre, wo liegen denn deine Stärken zum Beispiel oder wo liegen deine Schwächen oder Kannst du mir mal erzählen von einer Situation, in der du ein Problem mit einem Teamkollegen gehabt hast? Und wie hast du dieses Problem gelöst? Also solche Dinge, wie arbeitet man zusammen? Wie sieht man sich selber? Und da kann man sich eigentlich auch sehr gut darauf vorbereiten, indem man einfach so ein paar Fragen durchgeht. Da gibt's hunderte Webseiten mit Fragen, mit Beispielfragen. Und klar kann man nicht erraten, was für Fragen da kommen, aber man kann sich einfach mal in diese Fragen hineinversetzen. Was kann man denn da antworten? Und meistens sind es eigentlich immer die gleichen Patterns. Was sind meine Stärken? Was sind meine Schwächen? Und wie habe ich im Team reagiert? Da kann man sich einfach so paar Szenarien zurecht überlegen. Wie habe ich denn zusammengearbeitet mit einer Kollegin, mit einem Kollegen? Wann hatte ich einen Konflikt? Wie habe ich den gelöst? Wie hat man denn überhaupt zusammengearbeitet? Mit wem arbeitet man gerne zusammen? Und wenn man sich da eben ein paar Szenarien oder erlebte Dinge zurechtgelegt hat, dann kann man da auch ganz viele Fragen damit erschlagen. Das geht dann eigentlich relativ gut, wenn man da einigermaßen flexibel ist. Aber wichtig ist, dass man sich das einfach mal überlegt, wie würde ich sowas beantworten? Und wenn man da mal 20, 30 Fragen durchgeht, dann sieht man da sofort das Pattern und kann sich das zurechtlegen im Vorfeld. Und das ist dann auch ganz praktisch, wenn man nicht bei jeder Frage ständig überlegen muss, was hat man denn da erlebt und die letzten fünf Jahre durchgehen muss.",
            "start": 3704531,
            "end": 3813437,
            "confidence": 0.8069169230769226,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Den Fragenkatalog zu kennen, den ihr gestellt bekommt, ist eigentlich fast unmöglich, weil jede Firma legt irgendwie den Wert auf einen anderen Fokus. Sachen, die ich immer gerne frage, ist, was hast du in den letzten drei Monaten gelernt? Oder ich lasse mir erklären, welches Projekt in der Vergangenheit gemacht wurde und worauf sie wirklich stolz sind. Follow-up-Frage wäre dann eigentlich, wenn du das gleiche Projekt noch mal machen würdest, was würdest du ändern? Darauf zieht man dann so ein bisschen ab. Okay, auf die Learnings von dem Projekt. Alternativ auch sowas wie hast du schon mal in einem schwierigen team gearbeitet was war da schwierig wie hast du es gelöst das sind eher so so nicht technische fragen oft ist es aber auch so neben diesen cracking the coding interview dass man eigentlich mal nur eine architekturfrage oder eine projektfrage bekommt wie zum beispiel hey, Lass uns doch mal einen URL-Shortner zusammenbauen. Wie würdest du das angehen? Das ist die Aufgabenstellung, relativ offen, relativ high-level. Was mir immer sehr, sehr viel hilft, ist nicht direkt, ja, genau, da würde ich die Golang-Applikation bauen und vorne noch ein Traffic-Proxy und so weiter. Nicht direkt in eine Lösungssituation verfallen, sondern erst mal zwei Schritte zurückgehen. Okay, was gibt's denn für Requirements? Ich stelle erst mal eine Gegenfrage und versuche, erst mal ein bisschen Kontext über das Projekt zu kriegen. Das bedeutet, warum brauchen wir überhaupt einen URL-Shortner? Was ist das Ziel des URL-Shorteners? Wie viel Traffic kommt da? Von wie vielen URLs reden wir denn? Und so weiter und so fort. Einfach mal so ein bisschen, ist das ein neues Software-as-a-Service-Produkt, oder ist das nur für interne Benutzung, oder, oder, oder. Und wenn die Person dann dir keine Requirements gibt, dann hilft es mir immer sehr, dass ich mir selbst welche setze. Okay, nehmen wir mal an, wir machen das, ist jetzt nur ein interner URL-Shortener, nur für die interne Abteilung, um die Newsletter-Links mitzutracken. dann gehe ich mal davon aus dass zwei newsletter pro monat versendet werden und und und somit komme ich hoch auf weiß ich nicht 100 100 newsletter in 100 links in fünf jahren bla bla bla man setzt sich einen eigenen rahmen warum ist das gut das ist gut dass man dann okay auch noch andere projekt, Kriterien mit einfließen lässt und man hat nicht nur den Fokus auf Technologie, Technologie und welche Design Patterns und allem drum und dran, sondern so wie das für ein Senior, Staff, Principal und so sich gehört, man denkt halt ein bisschen weiter. Die andere Geschichte ist, man kann auch sehr schnell einbringen, welche Sachen man nicht berücksichtigt. Im Kontext dieses Interviews würde ich wegen der Einfachheit folgende Dinge ausblenden. A, B, C. Somit steckt man sich selbst einen Rahmen. Und weil man sich selbst einen Rahmen steckt, kann man dann die Balance seiner eigenen Redezeit auch sehr stark kontrollieren, weil man sagt, okay, das ist mein Rahmen, das berücksichtigt nicht und man verzettelt sich nicht. Das sind immer sehr, sehr positive Sachen, die ich zum Beispiel oft mache, weil man dadurch halt sehr viel abdeckt und nicht immer, ja, da würde ich das Observer-Pattern nehmen, weil, und da kann man auch über Skalierung reden von der Infrastruktur, wie viel Daten müssen denn vorgehalten werden, womit rechne ich denn, denn ab und zu ist es auch einfach so, dass ein simpler Monolith einfach alle Probleme löst und keine komplexe Microsoft-Architektur.",
            "start": 3813917,
            "end": 3991488,
            "confidence": 0.794892982456141,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, Rückfragen stellen ist ganz allgemein ein sehr wichtiger Punkt und Vorbereiten ist eben auch ganz wichtig. Aber der absolute Pro-Tipp meiner Meinung nach bei Interviews, wie man sich perfekt vorbereiten kann auf Interviews, ist, Interviews zu machen. Und das ist eigentlich die einfachste Möglichkeit, sich vorzubereiten, weil da muss man keine Bücher durchgehen, da muss man nicht selber irgendwelche Informationen finden. sondern man bewirbt sich einfach bei Firmen, im Idealfall Firmen, zu denen man vielleicht gar nicht will, die in einem ähnlichen Bereich sind, und bereitet sich einfach dadurch vor und wird dann auch von selber drauf kommen. Oh, diese Fragen waren gestellt. Oh, da habe ich mir noch nicht mehr überlegt, was ich antworten könnte. Und so kann man sich auch perfekt auf Interviews vorbereiten. Und wenn man einmal 20 Interviews gemacht hat, dann hat man schon eine extrem gute Vorbereitung. Und wenn man dann zu der Firma geht, zu der man wirklich unbedingt will, dann hat man zwar viel Zeit investiert in andere Interviews, aber ist auch super vorbereitet. Wobei 20 jetzt nur eine Hausnummer ist. Also 20 Interviews durch 20 Interview-Pipelines zu gehen, ist, glaube ich, sehr harte Vorbereitung.",
            "start": 3991827,
            "end": 4053920,
            "confidence": 0.7896237113402059,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ihr müsst auch immer gar nicht aktiv euch bewerben. Macht euch einfach ein Profil bei LinkedIn und füllt das mal ein bisschen aus mit ein paar Keywords und ihr werdet über kurz oder lang Anfragen von Recruitern bekommen. Antwortet denen einfach mal. Das ist auch ein recht einfacher Trick, um ein paar Interviews zu geben. Und ihr müsst auch nicht immer die komplette Interview-Pipeline durchgehen. Ihr könnt auch einfach zwischendurch sagen, okay, ich breche ab, ohne einfache Gründe. Seid immer respektvoll natürlich, brecht einfach ab, so nach dem Motto, okay, ich habe gemerkt, die Firma ist nichts für mich. Also sagt das schon wirklich einen wahren Grund, das ist immer ganz schön, weil es kann natürlich sein, dass dieser Recruiter später, in einem Jahr oder zwei, die Firma wechselt und dann an euch erinnert. Also seid keine Arschlöcher. Relativ einfach.",
            "start": 4053960,
            "end": 4093253,
            "confidence": 0.7612071428571427,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also kann ja auch sein, dass man in einem Interview dann draufkommt, oh, diese Firma ist doch super interessant und macht super tolle Projekte und dann macht man halt weiter. Also es ist ja kein Schaden dadurch entstanden.",
            "start": 4093473,
            "end": 4102559,
            "confidence": 0.7694473684210528,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Herr Wolfgang hat ja gerade 20 Interviews genannt, aber kein Zeitrahmen. Macht bitte nicht diese 20 Interviews in einem Monat. Das stresst euch allen drum und dran. Nehmt euch ruhig Zeit. Schedule die Interviews gerne mal in einer Woche, zwei oder in drei. Alles gut und macht euch keinen Stress. Ihr werdet auf jeden Fall sicherer mit den Antworten auf die Fragen. Und immer, wenn ich sowas höre oder immer, wenn ich sowas vorschlage, dann höre ich sowas wie, aber ich such doch gar keinen neuen Job oder dafür habe ich doch gar keine Zeit. Machen wir uns nichts vor. Eine Stunde morgens mal vor dem Job zu investieren und einfach zu sagen, okay, ich mache von 8 bis 9 einfach ein Interview, bevor ich den Job um 9 Uhr mit dem Stand-up starte. Wo ist denn das Problem? Könnt ihr mal hier oder da machen, kriegt ihr alles hin. Wenn ihr sagt, ihr habt keine Zeit dafür, dann denke ich, setzt ihr die Prioritäten nicht richtig. Und es ist auch völlig okay, wenn ihr keine Interviews führen könnt oder führen wollt. Aber im Endeffekt müsst ihr Arbeit investieren, falls ihr wirklich einen guten neuen Job haben wollt bei vielleicht einer High-Profile-Company oder ähnliches.",
            "start": 4102599,
            "end": 4162702,
            "confidence": 0.7583970588235297,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, wir haben das schon öfters mal erwähnt. Es schadet auch nicht, das einfach immer wieder, wenn man einen Job hat, zu machen nebenbei. Man kann da abchecken, ist der Marktwert noch okay, was ich verdiene, würde ich woanders ganz andere Gehälter verdienen. Man kann auch drauf kommen, oh, die eigene Firma ist gar nicht so schlecht, wie man immer gedacht hat, weil man eigentlich fünf Interviews geführt hat und sich jedes Mal denkt, um Gottes Willen, diese anderen Firmen sind katastrophal. dann schätzt man vielleicht die eigene Firma wieder oder auch umgekehrt, kann auch sein, aber dann ist es ein guter Grund zu wechseln. Oder man erfährt auch andere Herangehensweisen von anderen Firmen, kann die wieder reinbringen in die eigene Firma. Also man hat auch einen gewissen Austausch durch Interviews zwischen den Firmen. Auch als Interviewer ist das ganz praktisch, man lernt einfach was über andere Firmen, also das ist nicht unbedingt auch verlorene Zeit für die Firmen an sich. wenn man ein Interview führt und der oder diejenige sich dann entscheidet abzubrechen. Also es kann für alle eine Win-Win-Situation sein. Und für alle, die Interviews führen, also in Firmen, jetzt kann ja nun eine Lead-Position haben, Hiring-Manager sind, für die kann es natürlich auch eine gute Erfahrung sein, einfach wieder mal auf der anderen Seite vom Tisch zu sitzen, das Gefühl zu bekommen und da einen kleinen Refresher zu haben oder vielleicht auch was zu lernen, wie machen das andere Firmen in einem Interview. Also es ist ein Lernprozess und Interviews gehören meiner Meinung nach dazu, um eben einen Wissensaustausch zwischen Firmen zu haben. Und das kann man also wirklich sehr sportlich und positiv sehen und nicht immer nur, oh je, wenn jemand ein Interview führt, dann will er weg und ich verliere jetzt meine beste Mitarbeiterin.",
            "start": 4163362,
            "end": 4257621,
            "confidence": 0.7938066666666662,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Generell ist das ein Feld, wo es ganz klassisch drauf ankommt, learning by doing. Ihr werdet sicherer, ihr werdet nicht mehr so nervös, ihr wisst, welche Fragen kommen, ihr wisst eure Limits. Es ist auch mal ganz gut, einen Spiegel vorgehalten zu bekommen, dass ihr vielleicht nicht der Big Player seid. Einfach mal bringt euch mal wieder auf den Boden, vielleicht noch mal ein bisschen Selbstreflexion von da aus. Kann ich nur empfehlen. Das war mal wieder eine lange Episode über das Thema Interviews aus der Bewerberperspektive. gegebenenfalls sehr opinionated. Ich würde mich über eure Meinung freuen. Wie macht ihr das? Wo sagt ihr, hey guter Tipp oder Andi, Wolfgang, wollt ihr mich eigentlich verarschen? Das ist doch kompletter Bullshit. Schreibt uns mal eine Mail stetig at engineeringkiosk.dev oder via Twitter at engkiosk. Wir sind gespannt über eure Meinung und wir sind auch gespannt, wo ihr einfach mal anderer Meinung seid. Denn Achtung, alles sehr opinionated. Das ist unsere Erfahrung. Wir wünschen euch auf jeden Fall viel Spaß und viel Erfolg, falls ihr euch entscheidet, den einen oder anderen Trick mal auszuprobieren.",
            "start": 4258081,
            "end": 4320322,
            "confidence": 0.73728021978022,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und jetzt hättet noch eine ganz konkrete Frage an alle. Und zwar, was war die beste oder schlechteste Frage, die ihr irgendwann beantwortet habt? gestellt bekommen habt in dem Interview. Wenn ihr uns das noch senden könntet auf Twitter oder E-Mail, wäre es sehr cool, mal da eine Sammlung zu haben. Interessiert sicher viele Leute, was denn da an so Fragen herum ist dort draußen.",
            "start": 4320382,
            "end": 4342259,
            "confidence": 0.7363692307692309,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie immer gilt, Links, die wir erwähnt haben, findet ihr in den Shownotes. Ansonsten wünsche ich euch viel Spaß beim Nachdenken, welche Interviews ihr in nächster Zeit startet. Rock den Tag. Bis später.",
            "start": 4342279,
            "end": 4352568,
            "confidence": 0.6434848484848484,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Schöne Woche. Was, ja probieren nochmal.",
            "start": 4352608,
            "end": 4362888,
            "confidence": 0.3695,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sag doch einfach, wie läuft denn so ein Interview ab, wie ist denn da die generelle Struktur?",
            "start": 4362928,
            "end": 4367331,
            "confidence": 0.5517647058823529,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Zu langweilig so eine direkte Frage.",
            "start": 4367351,
            "end": 4369472,
            "confidence": 0.7056666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Immer du stammelst hier einen ab, weil du irgendwie zu wenig Koffein hast, komm jetzt gib Stulli, wir haben eine Stunde drauf, wir müssen noch ein paar Punkte.",
            "start": 4369492,
            "end": 4375837,
            "confidence": 0.73125,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7894685039370037,
    "audio_duration": 4376.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}