{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/1e6423eb-3d80-48c7-a115-1e9deb9bff7c/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62xv3bre4a-5a1c-4129-9ab3-74f17acd27f3",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Your English is not the yellow from the egg? Warum ist Englisch für uns Deutschsprachige immer noch eine schwierige Sache? Sogar wenn wir in der IT-Branche arbeiten und vermutlich tagtäglich zahlreiche englische Webseiten besuchen. In dieser Episode sprechen wir über die englische Sprache und internationale Teams. Welche Hürden wir deutschsprachig mit der englischen Sprache haben und wie wir diese überkommen können. Welche Vor- und Nachteile die Zusammenarbeit in einem internationalen Team hat und wie sich das Ganze aktuell nach der Pandemie in einem Remote-Setup auswirkt. Ganz nebenbei erklären wir noch, was der brasilianische Amazonas und deutsche Aldi-Kassierer damit zu tun haben. So if you are ready, let's start! Ich würde diese Episode gerne mal starten mit einem kleinen Dankeschön, weil wir so viele E-Mails und Rückmeldungen bekommen von Hörerinnen und Hörern, die sich bedanken für die Folgen, die wir machen und auch so Folgen wie zum Beispiel die Home-Automation-Folge, die einem Hardcore-Developer, einem Kollegen von uns scheinbar viel gebracht hat, der in seinem Van lebt und dort ein Remote-Developer-Leben führt. Und genau solche Kommentare motivieren uns eigentlich immer, dran zu bleiben. Aber eines der schönsten Kommentare, die wir kürzlich bekommen haben, war folgendes. Andi, lass dich mal den ersten Teil lesen. Lies mal den ersten Teil bitte unseren Hörerinnen vor.",
      "start": 3138,
      "end": 83583,
      "confidence": 0.839171428571428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der Inhalt eures Podcasts ist großartig, verschiedene interessante Themen einfach erklärt.",
      "start": 83603,
      "end": 87967,
      "confidence": 0.8654545454545456,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sowas freut uns natürlich immer. Aber das Beste an diesem Kommentar war der zweite Satz. Und der lautet, eigentlich ist er auch sehr gut für Deutsch lernen. Und da habe ich mal kurz schlucken müssen und habe mir dann überlegt, wie gut muss jemand wirklich die Sprache beherrschen, dass er unseren Podcast schon verwenden kann, um Deutsch zu lernen. Und dann habe ich mich gefragt, ob das wirklich Sinn macht, von uns Deutsch zu lernen. Ob das nicht ein großer, großer Fehler ist. Janif ist ein Entwicklerkollege aus ursprünglich Israel, jetzt in Berlin. Ich würde mir wirklich zweimal überlegen, ob du von uns Deutsch lernen willst. Also mein Dialekt und Andis Artikel sind definitiv keine gute Vorlage fürs Deutsche, würde ich mal so sagen. Was meinst du, Andi?",
      "start": 88307,
      "end": 131227,
      "confidence": 0.8153125000000004,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann man so sehen oder kann man anders sehen? Nordrhein-Westfalen ist das vervölkerungsreichste Land in Deutschland und somit ist das Ruhrgebiet, so viel ich weiß, das Areal, wo die meisten Leute auf dem engsten Raum zusammenleben. Und damit könnte man bereits argumentieren, dass mein Dialekt schon sehr, sehr gut zum Deutsch lernen geeignet wäre, weil ihnen einfach sehr, sehr viele Leute.",
      "start": 131248,
      "end": 153785,
      "confidence": 0.8401967213114755,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Drum habt ihr so Schwierigkeiten, die Österreicher zu verstehen. Ich hab nämlich immer die Erfahrung gemacht, dass die Nicht-Native-Speaker mich teilweise besser verstehen im Dialekt, als wenn ich dir was erkläre, Andi. Weil du immer alles perfekt verstehen willst, und vielleicht Nicht-Native-Speaker probieren das irgendwie aus dem Kontext heraus zu verstehen, und bei denen ist es dann nicht so wichtig, wenn sie ein, zwei Wörter nicht verstehen, und du fragst danach, hä, was war das dritte Wort, bin schon ausgestiegen, und schalten dann schon ab. Also das ist vielleicht ein Vorteil von Leuten, die Nicht-Native-Speaker sind.",
      "start": 153825,
      "end": 182831,
      "confidence": 0.7409062500000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, vielleicht, vielleicht. Naja, auf jeden Fall, Wenn man ruhrpottisch, beziehungsweise platt, beziehungsweise diese Sprache, die ich halt hier spreche, ist natürlich immer noch deutsch, aber diesen Dialekt mit wat und dat und allem drum und dran, hat natürlich auch sehr, sehr viele Vorteile. Und zwar wird er sehr oft als sehr direkt anerkannt. Und damit eckt man gegebenenfalls hier und da mal an, aber man kommt auf den Punkt, ja? Wir reden halt nicht um den Brei herum, Wolfgang, ja? Wir sagen hier wat Sache is, wat Tacheles is.",
      "start": 183332,
      "end": 214833,
      "confidence": 0.8215111111111111,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber das ist ja Kultur, das hat ja nichts mit der Sprache zu tun. Nur weil man direkt ist, heißt das ja lange nicht, dass das aufgrund der Sprache ist. Das ist einfach eure Einstellung zum Leben, dass ihr jedem eure Meinung reindrücken müsst.",
      "start": 215355,
      "end": 228281,
      "confidence": 0.733159090909091,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Für mich gehört Kultur, Dialekt und Sprache zusammen. Von daher, ich glaub, die kann man nicht miteinander nennen. Aber wenn man natürlich Hochdeutsch lernen möchte, also wirklich gutes Hochdeutsch, ich glaub, da gibt's nichts Besseres als die ... den dialekt, der nämlich kein dialekt ist, dann, wenn man hochdeutsch werden möchte, nach hannover zu gehen, soviel ich weiß, ist hannover die stadt in deutschland, wo das hochdeutschlichste deutsch gesprochen wird, nennt man das so, hochdeutschlichstes deutsch?",
      "start": 228301,
      "end": 255902,
      "confidence": 0.8184736842105262,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das habe ich auch schon öfters gehört, aber das haben wir Hannoveraner auch schon irgendwie widerlegt, aber ich kann mich leider nicht mehr erinnern warum, falls wir irgendwelche hörerinnen aus der gegend haben. Bitte meldet euch doch und sagt uns da, ob ihr wirklich das Hochdeutsch sprecht schlechthin. Ich kenn mich da sowieso nicht aus. Ich bin froh, wenn mich irgendwer versteht, wenn ich irgendwas Österreichisches oder Tirolerisches rede.",
      "start": 255942,
      "end": 277584,
      "confidence": 0.7163188405797101,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber vielen Dank für dieses Kommentar. Es hat mich sehr zum Grinsen gebracht und es hat mich auch ein bisschen stolz gemacht, muss ich zugeben.",
      "start": 277604,
      "end": 284671,
      "confidence": 0.7975999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und Yannif hat auch, by the way, ich bin mir gar nicht sicher, ob Yannif richtig ausgesprochen ist, aber wir hoffen einfach mal, also Yannif hat dann auch was anderes vorgeschlagen als Thema und dieses Thema wollen wir heute behandeln. Er hat nämlich gefragt, es wäre eigentlich interessant, wenn ihr den Einfluss von Ein- und Zuwanderern, in deutschland besprechen würdet ob sich da irgendwas verändert hat in der softwareentwicklung in der kultur in deutschland und österreich weil immer mehr menschen gerade im technischen bereich eigentlich nach deutschland und österreich gekommen sind und die teams immer internationale werden und genau das soll heute das thema sein das arbeiten in internationalen teams da andy und ich wir haben ja bei trivago voll mal extrem internationales team gehabt Aber wir reden natürlich auch mit Leuten, die aktuell in Firmen arbeiten und ich höre natürlich auch Geschichten über Österreich und Deutschland und das wollen wir eigentlich besprechen, wie sich das Ganze entwickelt hat und wie sich das aus unserer Warte natürlich entwickelt hat. Wir können jetzt da nicht aus erster Hand natürlich sprechen, weil wir eher im internationalen Umfeld unterwegs sind, aber es gibt da doch einige interessante Aspekte, glaube ich, wie man das beleuchten kann und das wollen wir in dieser Episode mal angehen. Und da hätte ich, Andi, an dich schon eine Frage, die eigentlich von einem Kollegen weiterleiten möchte, der mir mal kürzlich gefragt hat. Der arbeitet in einem deutschen Unternehmen, große Agentur, die also mehrere Standorte hat in Europa, also wirklich eher was Größeres, und die auch englischsprachige Leute mehr oder weniger einstellen. Also die haben schon auch die Verpflichtung, dass man ein gewisses Level an Deutsch spricht, aber das ist halt so nur rudimentäres Deutsch, würde ich mal sagen. Und der hat mir kürzlich erzählt, dass sie natürlich jetzt Englisch sprechen in extrem vielen Team-Meetings. Und er hat sich dann aber auch die Frage gestellt, wenn jetzt wirklich von diesen fünf, sechs, sieben Leuten, die alle deutschsprachig sind, einer englischsprachig ist und der versteht so einigermaßen Deutsch, will aber nicht Deutsch sprechen, Macht es Sinn, dass dann alle sechs anderen Leute im Team auf Englisch wechseln, die aber alle schlecht Englisch können und dann die gesamte Qualität vom Meeting heruntergezogen wird sozusagen durch dieses schlechte Englisch von den restlichen Leuten im Team, nur damit man eben Englisch spricht wegen dieser einen Person? Was denkst du zu dem ganzen Thema? Ist glaube ich nicht so einfach zu beantworten, wie man im ersten Moment denkt. Danach kann ich dir gerne sagen, was meine Antwort war.",
      "start": 284951,
      "end": 425402,
      "confidence": 0.8214811320754715,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Keine Ahnung, ob es überhaupt eine richtige Antwort darauf gibt, aber ich habe eine harte Meinung dazu. Und zwar speziell, weil du dir das Umfeld ja ein bisschen beschrieben hast, dass die Agentur...",
      "start": 426448,
      "end": 435755,
      "confidence": 0.7137272727272728,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist wieder die Duisburger Ader, oder? Wo man die harte Meinung direkt dazu abgibt.",
      "start": 435795,
      "end": 440319,
      "confidence": 0.7041999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, mit harte Meinung meinte ich eigentlich, also es wird, glaube ich, schwer, mich von dieser Meinung abzubringen, sagen wir es mal so.",
      "start": 440799,
      "end": 446043,
      "confidence": 0.6896521739130435,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, dann schließ mal los, deine Meinung dazu.",
      "start": 446063,
      "end": 448285,
      "confidence": 0.54175,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Besonders, weil du das Umfeld ja beschrieben hast, dass diese Agentur mehrere Standorte hat, gegebenenfalls dann vielleicht auch außerhalb Deutschlands, hast du gesagt?",
      "start": 448305,
      "end": 453769,
      "confidence": 0.6804347826086957,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ja, ja.",
      "start": 453809,
      "end": 454350,
      "confidence": 0.4423333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist es von den fünf Deutschen hier in der Hinsicht meines Erachtens zu kurz gedacht und auf ihren eigenen Benefit ausgelegt. Weil es mag sein, dass die fünf Deutschen nicht so gut Englisch können. Es mag sein, dass dadurch die Qualität der Meetings kurzfristig leidet. Mittel- bis langfristig hat das aber meines Erachtens nach einen größeren Uplift nicht nur für die Mitarbeiter, sondern für das konkrete Firmenumfeld und sogar für den sechsten Mitarbeiter oder Mitarbeiterin. weil erstens es tut niemandem weh eine zusätzliche sprache zu lernen und besonders die sprache die zurecht oder zu unrecht als weltsprache angesehen wird.",
      "start": 455330,
      "end": 496903,
      "confidence": 0.8621818181818183,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja aber kannst du die sprache da überhaupt lernen wenn die anderen auch kein englisch gescheit sprechen können und du dann nur irgendwie dieses denglisch von den anderen übernimmst.",
      "start": 497444,
      "end": 505688,
      "confidence": 0.782793103448276,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die frage ist ja wie macht man es denn ich meine wir arbeiten als software entwickler das bedeutet wir haben alle irgendwie zugriff auf grammarly wir haben alle irgendwie zugriff auf deep l oder von mir ist auch auf, dict.leo.org oder ähnliches ja also ein paar wörter zu übersetzen und wir haben auch alle schul englisch gehabt also zumindest in deutschland hat man das, auf jeden fall von der fünften bis zu zehnten klasse minimum von daher irgendwann ist er da hängen geblieben und jeder kann auf nein gebt irgendwelche englischen memes lesen und verstehen darüber lachen so jetzt möchte ich auch mal bitte dass die fünf leute dann da mal ein bisschen aus ihrer komfortzone rauskommen und dann mal vielleicht mal ein bisschen den leuten auch entgegen kommen besonders in dem internationalen firmen umfeld.",
      "start": 506268,
      "end": 544011,
      "confidence": 0.8091629629629626,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und das sagen jetzt wir als zwei den deutschen podcast gestattet haben.",
      "start": 544532,
      "end": 548615,
      "confidence": 0.7389166666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das sagen wir, die bei den deutschen Podcast gestartet haben. Aber der deutsche Podcast ist ja aus anderen Gründen entstanden. Es ist ja nicht so, als können wir keinen englischen Podcast machen. Ich sag ja auch nicht, dass man superperfekt und supersafe in Englisch sein muss. Ich sag aber auch, dass die englische Sprache einem sehr, sehr viel vergibt. Und hier, in deiner Story, geht's ja ein bisschen weiter. Da geht's ja wirklich um jemanden, der anscheinend zugewandert ist oder ähnliches. der gerade die sprache lernt aber diese dieses ganze team ja in einem internationalen firmenumfeld agiert das bedeutet ich gehe mal stark davon aus dass dass diese leute über kurz oder lang dann auch mal mit anderen standorten reden müssen ja aber.",
      "start": 549155,
      "end": 590877,
      "confidence": 0.820756097560976,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der hauptbereich ist schon in deutschland die kunden sind deutsche firmen daher müssen die leute ja auch deutsch können also die drum stellen die nur leute an die auch gewissen level haben von an deutschkenntnissen einfach damit sie mit den kunden auch in irgendeiner form wenigstens irgendwie kommunizieren können Und man könnte ja auch argumentieren, warum lernt nicht diese eine Person Deutsch? Es ist ja viel besser, wenn eine Person Deutsch lernt mehr, anstatt dass sechs andere Englisch lernen und die Qualität und damit vielleicht die Performance oder die Effizienz der Firma nach unten gedrückt wird.",
      "start": 590897,
      "end": 621399,
      "confidence": 0.8122604166666672,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich meine diese person wurde ja irgendwann mal eingestellt ja und diese person hat ja zu diesem einstellungszeitpunkt ja anscheinend auch noch kein deutsch gesprochen.",
      "start": 621779,
      "end": 631507,
      "confidence": 0.8138846153846154,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja natürlich also deutsch sprechen hat die person glaube ich schon können aber halt auf einem anderen level als jetzt in der diskussion fühlt sich halt auf englisch wesentlich sicherer.",
      "start": 631527,
      "end": 639874,
      "confidence": 0.7819333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die nächste baustelle ist softwareentwicklung spielt sich halt im internationalen umfeld fertig aus ja also sorry aber wieviel deutsche qualitative sehr gute artikel und ähnliches gibt es denn im softwareengineering bereich ja sorry die innovation kommt in der regel nicht aus deutschland ja und somit liest du den ganzen tag irgendwelche englischen fachbücher du liest den ganzen tag irgendwelche englischen blogpost hacker news reddit bla bla bla klar wir haben den einen subreddit de edv verstehe ich.",
      "start": 640514,
      "end": 666607,
      "confidence": 0.7536363636363637,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Schon, Und unser Podcast bitte nicht zu vergessen, da kommen natürlich auch die qualitativen Inhalte in Deutsch.",
      "start": 666627,
      "end": 672420,
      "confidence": 0.7068823529411764,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ah, qualitativ. Andere Baustelle. Auf jeden Fall die Innovation. Und hier, gehen wir mal im Frontend-Bereich. React, Vue.js. Gehen wir mal im Backend-Bereich. Terraform, Kubernetes, bla, bla, bla. Das kommt alles aus dem internationalen Umfeld. Somit, du oder jeder von uns hat ja mit der englischen Sprache so oder so zu tun. Das versteh ich sowieso noch nicht, klar. Superviele Leute können Englisch lesen. Nächster Level wär dann Englisch verstehen. Drittes Level wäre dann vielleicht, keine Ahnung, englische Netflix-Serien zu gucken. Ist ja nochmal ein bisschen anderer Bereich. Und dann vielleicht nochmal verschiedene Slangs, amerikanisches Englisch, Englisch aus Texas, obwohl das natürlich auch amerikanisch ist, aber glaube ich ein bisschen spezieller, oder aus Arkansas oder ähnliches. Dann hat man vielleicht noch australisches Englisch und dann hast du gegebenenfalls die Hardcore-Engländer oder die Hardcore-Schotten. die so durchreden.",
      "start": 673131,
      "end": 721899,
      "confidence": 0.7659779411764704,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, Schatten zu verstehen ist eine andere Baustelle, aber okay, ja.",
      "start": 721959,
      "end": 726041,
      "confidence": 0.7244166666666668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das nächste Level ist natürlich dann, es selbst zu sprechen. Ich verstehe, dass das schlimm ist, dass das bedeutet, ich muss eine Hürde überschreiten und ich muss aus meiner Komfortzone raus. aber es tut ja keinem weh ich hab so ich hab so das gefühl super viele deutsche, hadern damit und ich war auch in der position ja als ich 2013 zu trivago gekommen bin bin ich von einer von der agentur, die in der regel deutsch gesprochen hat zu trivago gewechselt und natürlich habe ich mich erst mal scheiße gefühlt weil ich habe mich super super unsicher gefühlt englisch zu sprechen allem drum und dran muss aber sagen nachdem ich das irgendwie dann einen monat kontinuierlich acht stunden am tag getan habe, viel mir ist leichter und ich mache heute auch noch grammatikalische fehler gar keine frage dennoch würde ich sagen es hilft mir auch außerhalb des jobs wenn ich im urlaub bin oder ähnliches ja also ich habe kein problem damit zur rezeption zu gehen und die die die dame oder den herren dort auf englisch anzusprechen also es hilft ja nicht nur im beruflichen umfeld.",
      "start": 726081,
      "end": 782609,
      "confidence": 0.8064021164021166,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "In dieser Agentur, wo du warst, habt ihr da in Deutsch kommentiert?",
      "start": 782969,
      "end": 786731,
      "confidence": 0.6510833333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In der Agentur selbst haben wir natürlich nicht auf Deutsch kommentiert, aber als Agentur hatte ich mal einen Job für Vodafone, und da haben wir damals ein internes Bug-Tracking-Tool weiterentwickelt, weil der Contractor von denen, der Freelancer, abgesprungen ist oder krank wurde, haben die gesagt, pass mal auf, wir müssen hier jemanden haben, der uns das Bug-Ticket-System weiterentwickelt beim PHP. Und gut, wurde ich da hingeschickt, habe mir die Codebase angesehen, mache ich die Codebase auf, waren alle Kommentare in Russisch. Jetzt könnte man natürlich sagen, hey Andi, du erzählst mir hier gerade irgendeine Story, dass fünf Leute Englisch lernen müssen, warum lernst du jetzt kein Russisch für die Kommentare? Valider Punkt, kann man mich challengen.",
      "start": 786771,
      "end": 828562,
      "confidence": 0.7906896551724141,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich wäre ziemlich froh gewesen und viel Russisch, wie ich auf meiner Weltreise unterwegs war, vor allem in den östlichen Ländern, da ist das echt eine übergreifende Sprache immer noch. Hätte mir viel weitergebracht, muss ich zugeben. Wäre besser gewesen als Englisch, auf jeden Fall.",
      "start": 829102,
      "end": 842945,
      "confidence": 0.7534444444444445,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In dieser Story habe ich dann kein Russisch gelernt. Ich glaube mal von einer ehemaligen Schulfreundin, sie war Russin, habe ich mal gelernt den Spruch, also auf Russisch, ich spreche zwar kein Russisch, aber das hier ist mein Blog.",
      "start": 843325,
      "end": 856247,
      "confidence": 0.8004615384615384,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja und jetzt auf russisch ja ich.",
      "start": 856871,
      "end": 859014,
      "confidence": 0.6415714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weiß ich nicht mehr so wenig russisch spreche ich ich glaube ich kann noch niemals pizza auf russisch bestellen naja was ich da genutzt hab ich hab jetzt ich bin jetzt nicht durch kompletten codebase gegangen und hab, die russischen Kommentare auf Englisch übersetzt, hätt ich eigentlich tun sollen, aber ihr kennt das Problem, sie werden in Typechecker, in PHP aktiviert oder in Python oder JavaScript. Bei euch sind ja auch Trillionen Fehler. Nee, was ich gemacht hab, ist Google Translate. Und die Kommentare, die ich dann gelesen hab, die hab ich auf Englisch hingepastet und dann gut ist. Zurück zu der Agenturgeschichte hier. Jetzt hab ich dir meine Meinung gesagt. Wie siehst du denn die ganze Geschichte?",
      "start": 859034,
      "end": 895949,
      "confidence": 0.7572796610169493,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, meine Fragen waren jetzt vom Davis Advocate, den ich gespielt hab. Also ich glaube natürlich auch, dass Englisch grundsätzlich gut ist und man das eher als Chance sehen kann jetzt von Teamseite. Aber ich glaube, es ist auch eine Frage, wie die Firma sich einfach sieht und in welcher Richtung sich die Firma entwickeln will und was das Ziel von der Firma ist. Also diese Firma stellt meines Wissens nur Leute in der EU ein oder von der EU, aber das ist ja Englisch trotzdem als zentrale Sprache anzusehen. Und wenn die Firma internationale werden will und vielleicht auch mit anderen Firmen zusammenarbeitet, wo dann eher internationale Teams zum Beispiel zu Hause sind, wo dann Englisch auch der Standard wird, dann muss sich die Firma halt als Ziel setzen, okay, wir wollen in Richtung internationales Team gehen und dann ist das natürlich ein anderer Mechanismus, den man anwenden muss und dann kann man natürlich in die Richtung arbeiten. Wenn jetzt die Firma sagt, okay, wir wollen auf Deutsch bleiben und es ist einfacher und wir wollen nicht das Investment tätigen, dass unsere Leute Englisch lernen müssen, dann ist das ein Fair Point meiner Meinung nach, aber dann muss man das auch dementsprechend kommunizieren, auch in den Interviews. Und dann ist es halt ganz klar, okay, man muss Deutsch lernen. Das Schlimmste ist, finde ich, wenn so Firmen sagen, Sie wollen eigentlich so international werden, aber das nicht leben und also ich kenne zum Beispiel auch ein großes Unternehmen in Holland, das ist halt so ähnlich, die haben recht viele internationale Leute im IT-Bereich, sonst aber überhaupt nicht und das ist ein großer Konzern und da wird das halt überhaupt nicht gelebt und da ist das halt eine ziemliche Nische und die stellen auch extrem viele Holländer ein. Und da ist es halt einfach schwierig als Internationaler, sich einfach durchzusetzen. Auch wenn sie sich bemühen, natürlich Englisch zu sprechen, in der Realität schaut es halt einfach anders aus. Und wenn halt in einem Team, so wie da jetzt auch, wenn in einem Team von zehn Leuten nur einer Englischsprachig ist, dann ist es halt sogar für Holländer, die ja perfektes Englisch eigentlich können, im Großen und Ganzen, sogar da ist es dann schwierig, dass man da nicht immer wieder mal ins Holländische zurückwechselt.",
      "start": 896330,
      "end": 1013565,
      "confidence": 0.8000522193211487,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast einen validen Punkt mit der offiziellen Firmensprache und wie die Firma sich ausrichten möchte. Da erwarte ich dann aber doch schon recht viel Support von der Firma selbst. Also ich weiß zum Beispiel, dass Trivago, wenn die Leute aus dem Ausland nach Düsseldorf geholt haben, dass die explizit Deutschkurse angeboten haben. Die hatten sogar, glaube ich, eine deutsche Lehrerin angestellt, wo du dann mehrmals die Woche oder ein oder zwei Stunden Deutschkurse belegen konntest auf Kosten von Trivago, damit du dich dann in Deutschland zurecht findest und ein bisschen die Sprache hier was.",
      "start": 1013725,
      "end": 1043965,
      "confidence": 0.820736842105263,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man ja auf jeden fall braucht in deutschland muss man ganz ehrlich sagen es ist englischsprachiger in deutschland ist man schon vielleicht nicht gerade in berlin oder so ist also meine erfahrung so in düsseldorf das ist schon schwieriger wenn man da englisch reden will irgendwo und wenn es nur irgendwo im supermarkt ist dass man irgendwie zahlen nicht auf deutsch weiß.",
      "start": 1043986,
      "end": 1062165,
      "confidence": 0.7979677419354836,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und die meisten Leute die uns jetzt gerade zuhören würden sagen wie bitte düsseldorf das ist doch eine top internationale stadt das ist doch glaube ich die stadt mit den der größten anzahl an japanern außerhalb von japan, ja das mag zwar richtig sein und düsseldorf mag zwar internationaler sein als mühleheim an der ruhr, dennoch haben wir innerhalb von trivago zum beispiel sehr oft die erfahrung gemacht dass im random channel super oft gefragt wurde hey wer hat denn man englischen kinderarzt hey wer hat denn man englischsprachigen dies und das arzt und man, war schon sehr verwundert wie wenig leute in düsseldorf also wirklich englisch sprechen und die leute die dann kein deutsch konnten trotzdem aber nach düsseldorf gezogen sind die hatten schon eine schwere hürde. Und ich meine über Duisburg müssen wir jetzt gar nicht reden also gut ich spreche jetzt nicht so viel englisch in Duisburg selbst mit anderen leuten aber ich glaube also ich würde mich mal weit aus dem Fenster lehnen und sagen das ist noch schlimmer als Düsseldorf. Naja Wolfgang hat es auch schon erwähnt Berlin ist hier in der Sache mit englischsprachigen Ärzten und Co natürlich the go to. weil ich glaube Berlin ist glaube ich auch so die internationalste stadt in ganz deutschland würde ich mal sagen aber man man man muss natürlich auch eine eine sache bedenken und zwar warum sprechen menschen aus anderen ländern eigentlich besser englisch als deutsche und da habe ich mal eine sehr sehr interessante these gehört die eigentlich total sinn macht in meinem kopf aktuell.",
      "start": 1062325,
      "end": 1151460,
      "confidence": 0.7954923076923082,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei zu eurer Verteidigung muss ich jetzt sagen, also nicht jedes Land spricht besser Englisch als Deutsche, also das ist garantiert nicht so, da kenne ich viele Gegenbeispiele.",
      "start": 1152103,
      "end": 1162771,
      "confidence": 0.7752857142857144,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sagen wir mal viele im europäischen Umfeld, in unserer Zeitzone hier, Zeitzone ist aktuell UTC plus 2, das ist die Zeit, über die wir gerade sprechen.",
      "start": 1162811,
      "end": 1173118,
      "confidence": 0.677346153846154,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei auch da fallen Franzosen, Italiener, Spanier mit rein, also da kann man drüber diskutieren.",
      "start": 1173178,
      "end": 1178940,
      "confidence": 0.8369333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Moment, da ist ja die Frage, können sie besser Englisch sprechen als wir? Oder wollen sie es einfach nicht? Also das ist eine andere Frage, die wir heute nicht bequatschen.",
      "start": 1179860,
      "end": 1189764,
      "confidence": 0.8184666666666665,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, aber mach mal weiter. Wenn du schon alle Deutschen beleidigen willst mit einem Schlag, bitte, ich will dir da natürlich nicht aufhalten.",
      "start": 1189804,
      "end": 1198607,
      "confidence": 0.6820434782608695,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich beleidige hier gar keinen und ich bin ja mittendrin. Es geht halt einfach nur so, warum es für Deutsche echt unkomfortabel ist, Englisch zu sprechen. Und zwar ist die These wie folgt. Deutschland hat 82 Millionen Einwohner. Somit sind wir einwohnertechnisch schon ein sehr sehr großes land hier in europa.",
      "start": 1198647,
      "end": 1216776,
      "confidence": 0.8577647058823531,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Plus diese ungefähr 10 millionen oder 15 millionen deutschsprachigen da noch im süden die an euch dran hängen.",
      "start": 1216816,
      "end": 1223301,
      "confidence": 0.8037777777777778,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Österreichisch ist ja kein deutsch.",
      "start": 1223321,
      "end": 1225443,
      "confidence": 0.8380000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Moment ihr habt die schweizer schon auch mitgerechnet also österreich hat eh nur 8 millionen.",
      "start": 1225463,
      "end": 1229606,
      "confidence": 0.5597333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich weiß jetzt gerade nicht die verteilung von französischer schweiz und italienischer schweiz und deutscher schweiz aber machen wir, wie dem auch sei. Die sache ist die wir haben echt viele leute die mitten in europa sehr viel deutsch sprechen. Und jetzt kommen die ganzen Hollywood-Movies aus den USA und sagen, uh, Deutschland, beziehungsweise der Dachraum, ist ein relativ großer Markt für uns. Da holen wir mal Dolmetscher und lassen mal die ganzen Hollywood-Filme schön neu vertonen. Und somit haben wir den luxus dass wir jetzt den neuen james bond oder den neuen top gun film schön in unserer nativen deutschen sprache gucken können wohingegen zum beispiel die niederlande, oder ähnliches oder finland das sind alles so kleine länder bevölkerungstechnisch dass hollywood sagt auch das lohnt sich gar nicht diese filme neu zu vertonen, Und somit wachsen diese Menschen natürlich sehr, sehr dauerhaft mit Filmen im Originalton auf. Das bedeutet, natürlich schauen die auf den neuen Dressy-Work, natürlich schauen die auf den neuen Top Gun-Film und James Bond, aber die schauen denen halt alles im originalen Ton, in Englisch. Was natürlich dann auch in der Freizeit dazu beiträgt, dass sie deutlich näher an der Sprache sind, weil sie hören, wie Worte ausgesprochen werden, sie verstehen Witze, et cetera, et cetera. Obwohl das nicht deren Native Language ist. Was sagst du zu dieser These? Sagst du, okay, damit kannst du dich identifizieren? Oder sagst du, das ist totaler Bullshit, wo hast du gelesen, auf bild.de oder was?",
      "start": 1229626,
      "end": 1311629,
      "confidence": 0.7907276422764227,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaub, das ist sicher ein Punkt, der dazu beiträgt. Die Holländer haben natürlich auch extrem viel Kontakt mit englischsprachigen Leuten. Grade in Amsterdam zum Beispiel leben 50 Prozent Nicht-Holländer, meines Wissens. Was schon ein extrem, extremer, hoher Anteil ist. Und das siehst du auch einfach, wenn du zum Beispiel in Ikea gehst in Amsterdam, ist alles auf holländisch und englisch angeschrieben im ikea das ist ganz normal auf den wänden also auch diese sprüche an den wänden irgendwie sind immer auf englisch und holländisch also es ist schon die ganze kultur die da natürlich mit rein spielt aber ein punkt ist schon dass es wesentlich Einfacher ist für Holländer wahrscheinlich über die Filme natürlich und über das Fernsehen auch die Sprache zu lernen. Und ich kann dir ein Beispiel geben, was mich mal wirklich extrem fasziniert hat. Und zwar war ich in einem Baumarkt in Amsterdam und an der Kasse spricht mir plötzlich irgendeine Kundin an, so geschätzte 70 oder 75, und quatscht mir irgendwas auf Holländisch zu und ich habe halt überhaupt nichts verstanden und sage nur sorry. Und sie wechselt sofort auf Englisch und fragt mich, ob die Handschuhe mir gehören, die sie da am Boden gefunden hat. Also eine 75-Jährige, die so schnell auf Englisch wechselt und dann fällt ihr noch das Wort Handschuhe ein, wo ich wahrscheinlich nachdenken müsste kurz, was heißt Handschuhe auf Englisch, und sagt das sofort auf Englisch, nur weil ich kurz sorry gesagt habe und sie komisch angeschaut habe. Also das sind schon Erfahrungen, wo man sich dann denkt, wow, das ist schon cool, wenn auch so alte Leute gut Englisch können, weil dass die Jugend jetzt besser Englisch kann, ist ja eigentlich schon klar. Und wenn ich mir jetzt die jüngere Generation anschaue, die vielleicht auch mit TikTok und Co aufwächst, die sprechen schon alle besser Englisch, als was ich zum Beispiel gesprochen habe früher in meiner Zeit. War bei dir auf der Uni irgendwas Englisch zum Beispiel? An der Uni. Sorry, auf der Uni bist du immer verwirrt, an der Uni.",
      "start": 1311670,
      "end": 1422526,
      "confidence": 0.7896140350877191,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich überlege gerade. Nee, die Kurse selbst waren alle auf Deutsch. Auch die Bücher, die empfohlen wurden, waren alle auf Deutsch. Was aber eigentlich auch dann nur Übersetzungen waren von irgendwelchen Amerikanern, die irgendwelche Algorithmen dann wieder erfunden haben und so weiter und so fort. Aber wenn es natürlich an Betriebswirtschaftslehre oder Volkswirtschaftslehre geht oder sowas, ist es natürlich dann sehr deutsch gehalten, weil speziell wenn du über Stückzahlproduktion und so und Stückmessbeträge und Co. in der Volkswirtschaftslehre sprichst, dann sind die Deutschen natürlich wieder ganz vorne dabei bei Effizienz. Effizienz und Fließbandarbeit, das ist ja unser Steckenpferd.",
      "start": 1422566,
      "end": 1453902,
      "confidence": 0.7996122448979592,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also bei uns war der Master auf Englisch, komplett auf Englisch, offiziell zumindest. Wobei alle, die Deutsch gesprochen haben, haben meistens Deutsch gesprochen, solange kein Deutschsprachiger irgendwie dabei war, also kein Erasmusstudent oder so. Und manche Professoren haben sich sogar darüber hinweggesetzt und haben dann den Englischsprachigen irgendwie was eigenes an Material gegeben oder so, weil die wollten das nicht auf Englisch machen. Leider, muss ich sagen, nachträglich. Aber auch ich zu Uni-Zeiten zum Beispiel hatte immer das Problem, dass ich gehofft habe, keinen englischsprachigen Übungsleiter zum Beispiel zu bekommen. Also ich habe meine Übungsleiter so ausgewählt, dass ich möglichst deutschsprachige habe, weil ich selber gar nicht auf Englisch präsentieren wollte damals und ich eigentlich recht unsicher war in Englisch zu meiner Uni-Zeit. Natürlich war extrem viel auf Englisch und wir haben auch Arbeiten auf Englisch schreiben müssen und Vorlesungen waren auf Englisch. aber in der übung was selber zu präsentieren auf englisch war schon eine gewisse hürde und die probiert da eigentlich rundherum zu arbeiten also die sehr später kommen, wie dann vorlesungen halten haben müssen auf englisch das war auch noch mal eine große hürde muss ich dazu sagen also meine englische meine erste englische vorlesung, Da habe ich mich schon sehr gut vorbereitet und das war dann schon eine schwierige Hürde für mich, aber danach ist es gut gegangen, wo ich dann einfach gemerkt habe, okay, es geht und man wird sicherer und man wird besser im Englisch. Dann wird das einfach alles viel leichter und darum finde ich das auch so große Chance, wenn wir zurückspringen zu der Geschichte von der Agentur, dass die einen Englischsprachigen im Team haben. Also man könnte es wirklich als Chance sehen, dass ich da vielleicht auch besser Englisch lernen kann. Und wenn ich mehr Englisch spreche, auch wenn es am Anfang schwieriger ist, dass ich einfach dort reinwachse und besser werde im Englisch sprechen. Und wenn ich dann besser Englisch kann, dann bin ich vielleicht auch interessanter am Arbeitsmarkt später. Oder wenn ich mal mit internationalen Firmen zusammenarbeite oder mit Kunden, dann kann ich einfach besseres Englisch. So habe ich vielleicht dann, so wie ich es auch damals auf der Uni erlebt habe, immer diese diese Hürde oder diese Angst, oh je, ich muss jetzt da irgendwas mit Englisch machen oder vielleicht sogar Englisch verhandeln, was ja dann nochmal schwieriger ist. Und wenn man das halt nie lernt, dann kommt man halt irgendwie in die Situation, wo man es dann unbedingt braucht und dann kann man es halt nicht so gut. Und darum würde ich das eigentlich eher als Chance sehen, dass ich im Team Englisch sprechen kann.",
      "start": 1454352,
      "end": 1586278,
      "confidence": 0.8093264840182645,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber damals war das schon echt unangenehm für dich oder ich meine du hast gesagt du hast dich auch nicht vorbereitet und so weiter und so fort du hattest schon ein bisschen ein bisschen wie soll man sagen schiss und dir ist ja gerade so mal so ein stift durchgegangen oder.",
      "start": 1586678,
      "end": 1599241,
      "confidence": 0.7184705882352941,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja kann man kann man durchaus so sagen also ich habe lange gehofft dass sie dass ich keine englischsprachigen studenten habe dass ich es auf deutsch machen kann und dann waren halt doch einige englischsprachige dann mal drinnen und dann habe ich einfach auf englisch switchen müssen meine folien waren immer auf englisch. aber dann das Ganze mal in Englisch durchzumachen, das war gar nicht so ohne, aber es war dann einfacher, als ich erwartet habe und wie gesagt, man wird dann relativ sicher und nach der dritten Vorlesung passt es dann ganz gut, also dann ist man da auch sicher mit den ganzen Wörtern und kann es auch besser klären und dann ist es teilweise sogar schwieriger zurückzuwechseln ins Deutsche. sobald man da mal sicherer wird. Aber alle, die viel Englisch sprechen, kennen das Problem wahrscheinlich, dass es dann schwieriger wird, wenn man vor allem im Business-Umfeld zum Beispiel oder im IT-Umfeld immer Englisch redet, wie schwierig das dann ist, ins Deutsche mal zu wechseln, weil einem die ganzen englischen Begriffe natürlich nicht einfallen. Und es beschweren sich ja auch viele, dass wir zu viel Englisch sprechen, weil wir immer englische Begriffe einwerfen. Sorry, dafür nochmal an alle. Aber es ist gar nicht so leicht, dass einem immer das deutsche Wort einfällt, vor allem, wenn man im Alltag halt viel Englisch spricht.",
      "start": 1599281,
      "end": 1656851,
      "confidence": 0.7685784753363227,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sehr schön du hast dich grad mit englisch entschuldigt mit sorry dass du zu viel denglisch sprichst wolfgang machst du grad flachwitze oder also der war der war der war echt gut aber naja sorry.",
      "start": 1657191,
      "end": 1668420,
      "confidence": 0.6490857142857144,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist ja jetzt wirklich schon fast fast kann man schon sagen es ist deutsch.",
      "start": 1668480,
      "end": 1671382,
      "confidence": 0.5489285714285714,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist oder natürlich könnt ihr euch jetzt alle da hinstellen hey die beiden haben ja haben ja leicht reden die die die sprechen das ja schon seit ein paar jahren ja das ist richtig aber wir waren auch mal in der position wir haben uns auch in die hose gemacht und wir haben uns auch in die unangenehme situation begeben, Und im Endeffekt sagen wir beide, es war gut, dass wir das getan haben. Und es ist eigentlich wie, wenn du alles andere auch lernst. Du begibst dich erstmal in eine unkomfortable Position, verlässt deine Komfortzone. Fahrradfahren, Schwimmen oder von mir aus auch Snowboard fahren oder Skifahren. Am Anfang enorm weh, weil man konstant hinfällt. Eigentlich ist das nichts anderes mit Englisch lernen. Man muss sich halt einmal nur in die Situation begeben. Also für alle Leute, die in der hinsicht besser werden sollen einfach machen der vorteil ist wie ich schon gesagt habe die englischsprache vergibt einem sehr viel auch native speaker wenn man jetzt zu amerikanern zu engländern australien oder ähnliches spricht vergeben einem da sehr und ich mache das auch heute noch während eines meetings wenn ich auf das wort nicht komme dann sage ich lass uns mal kurz warten ich muss kurz gucken wie wie das wort auf englisch heißt und da habe ich noch nie ein böses kommentar gesehen oder gehört und die leute helfen mir auch ab und zu mal das richtige wort zu finden oder ähnliches also die sind eigentlich eher dankbar, dass man versucht, deren Sprache zu sprechen.",
      "start": 1671422,
      "end": 1746909,
      "confidence": 0.8012460937500004,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also mit Native Speakers habe ich auch noch nie irgendwie schlechte Erfahrungen gemacht, ganz im Gegenteil. Und ich habe mir auch immer oft gedacht, wenn ich mit Native Speakers zusammenarbeite, dass ich besser Englisch reden kann danach. Das stimmt natürlich auf der einen Seite. Auf der anderen Seite bin ich ganz oft zu denen hingegangen und habe gesagt, kann man das so sagen? Würdest du das jetzt so sagen? Und die halbe Zeit konnte man die keine Antwort geben. Wir haben gesagt, ja, klingt irgendwie Ja, könnte man so sagen, klingt vielleicht nicht perfekt, haben dann aber keine andere, bessere Lösung dafür gehabt. Also es ist gar nicht so, dass man da irgendwie dann im Kopf der Native Speaker irgendwie so rüberkommt, als würde man da nur herumstammeln oder so. Ich habe das auch noch nie in irgendeiner Form bei irgendeinem Native Speaker erlebt, dass man so eine Rückmeldung oder irgendwie, dass man nur das Gefühl so bekommen hätte bei jemandem. Ganz im Gegenteil, wenn man sich probiert, mal in die andere Seite zu versetzen, von Leuten, die eben kein Deutsch sprechen zum Beispiel, und dann aber in einer Gruppe sind, wo dann einfach Deutsch gesprochen wird, ich habe mir das selber gar nie so vorstellen können. Und wenn man halt nur im deutschsprachigen Raum unterwegs ist und im deutschsprachigen Raum arbeitet, dann ist man immer auf dieser anderen Seite. Das heißt, man ist ja nie in einer Situation, wo man in der Unterzahl ist. Und ich kann mich ganz an ein einschneidendes Erlebnis erinnern, das war nicht im Business-Umfeld, sondern wie ich unterwegs war und gereist bin. Da war ich mal im brasilianischen Urwald.",
      "start": 1746949,
      "end": 1826476,
      "confidence": 0.7970436363636365,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt bildlich im Urwald oder warst du wirklich im Brasilien in dem Urwald?",
      "start": 1826516,
      "end": 1830918,
      "confidence": 0.8134615384615386,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich war wirklich im Brasilien im Urwald, Amazonas. Und zwar war ich da in einer kleinen Gruppe Die anderen vier Leute waren es, glaube ich, die waren Belgier, ziemlich jungen Studenten, eine Studentin davon, und die haben einfach extrem schnell ins holländische, glaube ich, oder flämische ist es, wenn es Belgier sind, glaube ich, egal, auf jeden Fall in die Sprache gewechselt, die ich eigentlich sehr schwer verstanden habe. Ich habe so ein bisschen folgen können hin und wieder. Aber die haben einfach neben mir extrem schnell gewechselt und man hat dann schon gemerkt, okay, die haben wahrscheinlich nie mit internationalen Leuten gearbeitet, weil die einfach auch bei Themen, wo ich irgendwie mitdiskutiert habe, plötzlich einfach gewechselt haben ins Holländische und dann war ich einfach plötzlich draußen. Und ich bin dann so irgendwie da gesessen und habe mir gedacht, Moment, ich war eigentlich nur im Gespräch drin, hallo, was ist los so in der Richtung? Da merkt man erst einmal, wie unangenehm das ist, wenn einem sowas passiert und normalerweise steht man dann da nicht auf und beschwert sich irgendwie, sondern geht halt vielleicht eher. Und gerade das ist halt dann im Firmenumfeld ein extrem großes Problem, wenn da am Mittagstisch einfach plötzlich auf Deutsch gewechselt wird oder vielleicht auch zwei Gruppen sitzen, die eine redet Deutsch, die andere Englisch. dann hat man gar nicht die Chance von der englischen Gruppe in die deutsche rüber zu wechseln. Und das ermöglicht aber, wenn es interessante Themen sind oder ganz allgemeine Themen oder auch nur, um einfach die Beziehungen zwischen den Leuten zu verbessern, das passiert halt über solche Gespräche und dann kann man da aber gar nicht einsteigen, weil halt die andere Gruppe auf Deutsch redet. Am Mittagstisch, wo man sagt, ja es sind ja eh zwei Gruppen, die eine redet Englisch, die andere Deutsch, warum sollte ich jetzt auch auf Englisch sprechen? Und das sind halt so Kleinigkeiten, die aber unter Umständen extreme Probleme machen. Und man muss sich ja auch immer überlegen, den Leuten passiert es ja nicht einmal, sondern den Leuten passiert es jeden Tag, mehrmals. Und irgendwann geben die halt unter Umständen auf oder wechseln einfach die Firma zu einer internationaleren Firma und sagen einfach, okay, offiziell ist da zwar Englisch die Sprache, aber ich fühle mich halt einfach nicht willkommen, auch wenn das so Kleinigkeiten sind und die wechseln dann in eine andere Firma. Und da muss man sich halt einfach überlegen, okay, will man das oder sind einem die eigenen Mitarbeiterinnen und Mitarbeiter so wichtig oder auch Kolleginnen, dass man das eben beachtet oder nicht. Und solche Kleinigkeiten können, für einen ist es eine Kleinigkeit, aber für die anderen Leute sind es halt so Kleinigkeiten, die einfach hundertmal passieren. Und dann wird es halt eben von einer Kleinigkeit zu einer großen Sache und wird unter Umständen zur Kündigung.",
      "start": 1830958,
      "end": 1973597,
      "confidence": 0.772720930232558,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin mir gar nicht sicher, ob ich das als Kleinigkeit bezeichnen würde, weil das ist einfach respektlos und Respektlosigkeit ist keine Kleinigkeit.",
      "start": 1973957,
      "end": 1980445,
      "confidence": 0.7860869565217391,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber wie oft hast du schon Deutsch gesprochen auf einem Tisch? Garantiert auch schon oft. Mit mir zum Beispiel und daneben sitzen Englischsprachige, die eine andere Konversation gerade führen, aber die einen halben Meter entfernt sind und im anderen Gespräch drin sind.",
      "start": 1980885,
      "end": 1993220,
      "confidence": 0.7577441860465116,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist vollkommen richtig. Ich war auch einer der Personen, die da voll drin war. Ich schließ mich da auch gar nicht aus. Ich sag aber auch inzwischen, dass ich diese ganze Sache meines Erachtens nach gelernt hab. Nicht nur, weil ich ein internationales Team geleitet hab, wo wir viele Deutsche drin hatten, aber dann zum Beispiel auch eine Türkin oder Ähnliches. Und das natürlich dann auch Thema vom One-on-One war. Aber dadurch hab ich natürlich auch gelernt. Und das leider vielleicht auch musste man mir erst zeigen, weil ich ja selbst einer, der Deutschen dann war, dass man dadurch natürlich eine Ungleichheit schafft, dass man nicht allen Leuten die gleichen Voraussetzungen gibt. Aber das Lustige ist, oder was heißt das Lustige? Ich bin jetzt eigentlich in der Situation, wo ich eigentlich dann der Ausländer bin, weil ich jetzt in einer finnischen Firma arbeite. Und immer, wenn ich dann in ein Meeting komme, wo dann drei, vier Finnen sind, ja, die unterhalten sich dann auf Finnisch. Und Achtung, ich spreche kein Finnisch.",
      "start": 1993538,
      "end": 2042286,
      "confidence": 0.7882616279069766,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie schnell wechseln die dann auf Englisch oder wechseln sie auf Englisch?",
      "start": 2042306,
      "end": 2045027,
      "confidence": 0.662,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die wechseln schon sehr, sehr schnell auf Englisch und behalten das dann auch bei. Also da muss man denen lassen Respekt.",
      "start": 2045067,
      "end": 2049810,
      "confidence": 0.7925714285714285,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich habe mir das, muss ich zugeben, abgeschaut bei Trivago von einigen Leuten. Die waren da extrem gut drin, wenn die in der Küche gestanden sind und Deutsch gesprochen haben und es kommt jemand nur nahe an die Gruppe, der englischsprachig ist, haben die auf Englisch geswitcht und zwar teilweise noch im selben Satz. Und ich habe mir das jetzt abgeschaut und probiere das auch zu machen, wenn es irgendwie geht. Und ihr habt ja schon von mehreren Seiten gehört, einfach wie cool das ist und weil die halt wirklich den Switch mitbekommen und die merken, dass sie wertgeschätzt werden. Also es ist nicht so, man geht hin, wartet dann noch zwei Sätze ab und dann wird auf Englisch geswitcht, sondern sofort. Das kommt bei Leuten gut an und ich glaube, das ist halt ein gewisses Zeichen, was man dann einfach setzt oder zeigt, dass einem das halt wichtig ist, dass die Person willkommen ist, wenn sie auf einen zukommt, weil sonst hat man immer dieses Gefühl, wenn ich auf eine Gruppe zugehe, bin ich da jetzt überhaupt willkommen und wenn die halt sofort auf Englisch switchen, ist es sofort klar, switchen, schon wieder ein englisches Wort, auf Englisch umschalten, schwieriges Wort, umschalten oder wechseln, dann ist man da halt einfach willkommen und geht einfach gern auf die Gruppe zu und ich glaube, das bringt halt einfach ein viel besseres Gefühl in der Gruppe, wenn man so was macht. Es ist so ein kleiner Trick, den ich jetzt probiere, einfach möglichst oft anzuwenden und zu machen, weil es ist ja wirklich jetzt nicht schwierig. Und ich glaube, das Klima wird dadurch einfach besser.",
      "start": 2050335,
      "end": 2129842,
      "confidence": 0.7917116788321167,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auf jeden Fall. Auf jeden Fall. Kann ich nur zustimmen. Jetzt lassen wir mal ein bisschen weg von dieser englischen Sprache kommen, weil die originale Frage von Yannis war ja unter anderem, wie sich die Softwareentwicklung und Kultur in Deutschland und Österreich geändert hat, wenn Menschen mit einem anderen Hintergrund kommen und gehen.",
      "start": 2129862,
      "end": 2145125,
      "confidence": 0.7991886792452831,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da gleich eine Frage nachgeworfen. Findest du, dass es mehr englischsprachige Leute gibt in general, hätte ich schon fast gesagt, also im Allgemeinen, auch in Duisburg zum Beispiel, aber jetzt auch in Düsseldorf auf der Straße oder so? Weil ich habe irgendwie das Gefühl in letzter Zeit, also vor allem in Innsbruck, in Amsterdam ist es sowieso schwierig, weil da jeder fast Englisch spricht, Aber auch in Innsbruck, was ja in den Bergen und ziemlich hinten ist teilweise, würde ich fast sagen, in Tirol, abgesehen von dem Tourismus, dass man da wirklich wesentlich mehr Englisch auf der Straße oder in dem Bus einfach hört. Oder auch Kleinkinder zum Beispiel, oder Kleinkinder ist jetzt übertrieben, aber so 5-Jährige. Ich habe letztens mal eine Gruppe von 5-6-Jährigen mit Schultasche gesehen im Bus, die haben einfach Englisch gesprochen miteinander, eine 5-Köpfe-Gruppe oder sowas. Kommt dir das auch vor, dass es irgendwie mehr wird?",
      "start": 2145325,
      "end": 2192834,
      "confidence": 0.7567466666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ein bisschen. Zwei Beispiele. Zum einen mache ich Sport, Crossfit nebenbei. Und da sind jetzt auch immer mal wieder neue Leute, die nur noch Englisch sprechen. Die kommen da rein, machen ein Probetraining mitmachen und so weiter. Also da fällt es mir dann auch auf. Und ich war jetzt die Tage auch auf dem zweijährigen Geburtstag meines Patenkindes. Und sie hat auch einen Kindfreund, einen Freund, der eingeladen war auf diesen Geburtstag. Und da haben die Eltern auch nur Englisch gesprochen. Also irgendwie ich weiß nicht ob es ich sag mal näher kommt und die beiden sind beide in duisburg was mich doppelt überrascht, düsseldorf war es glaube ich schon immer so egal ob du da mittags irgendwie zum burger essen bist oder abends oder so da ist immer irgendwie was englisches um einen herum aber es wird irgendwie mehr aber auch nur von, jüngeren leuten also jetzt nicht eigentlich so dreißig vierzig fünfzig plus da jetzt nicht sondern eher so weiß ich nicht um die fünfzehn bis zwanzig maximal dreißig jahre alte leute sowas.",
      "start": 2192894,
      "end": 2251841,
      "confidence": 0.7773579545454545,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, man ist ja auch verständlich, dass das irgendwie langsam nachwächst und es gibt ja jetzt seltener Leute, die irgendwie mit 50 oder so in ein anderes Land ziehen. Also das ist ja wahrscheinlich eher die Minderheit im Vergleich zu jungen Leuten, die schon vielleicht für das Studium oder so in eine andere Stadt ziehen.",
      "start": 2252828,
      "end": 2267244,
      "confidence": 0.6998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ist dir irgendwas aufgefallen, wo sich die Softwareentwicklung in Deutschland und in Österreich geändert hat durch den internationalen Zuwanderung?",
      "start": 2267484,
      "end": 2272910,
      "confidence": 0.62675,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube grundsätzlich, dass es einfach mehr internationale Leute gibt. Also auch wenn ich so mit Freunden spreche in der Softwareentwicklung, da haben mittlerweile alle irgendwie internationale Leute im Team. Teilweise remote natürlich nur, aber auch vor Ort teilweise. Also ich glaube, dass das schon viel häufiger wird, dass man irgendwie international zusammenarbeitet. und dadurch vielleicht auch mehr Englisch sprechen muss und da hat sich die Sprache vor allem geändert. Ob sich dadurch jetzt die Softwareentwicklung an sich verändert hat, ist die Frage. Vielleicht auch, dass man vielleicht leichter an Informationen kommt und vielleicht Best Practices eher einsetzt, die man über dieses internationale Team einfach vielleicht einfacher bekommt oder einfach durch die unterschiedlichen Ansichten einfach schneller lernen kann oder überhaupt mitbekommt als wie wenn man da nur in seinem, keine Ahnung jetzt für Tirol zum Beispiel, in den Bergen da in seinem Tiroler lokalen Team einfach sitzt und hin und wieder mal einen Blogpost liest maximal.",
      "start": 2273228,
      "end": 2328088,
      "confidence": 0.8099679487179487,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also das Handwerk selbst, da habe ich jetzt keine große Änderung feststellen müssen. Muss ich aber auch zugeben, weiß ich, ich habe noch nie in einer rein deutschen Agentur gearbeitet und mit einer rein deutschen Software. Auch in meiner Agenturzeit damals war ich ziemlich viel im internationalen Umfeld unterwegs. Typo 3 oder Typo 3, das hat natürlich auch sehr viele Einflüsse von der ganzen Welt gehabt, vom Handwerk her. deswegen bin ich mir gar nicht sicher ob sich die softwareentwicklung so selbst geändert hat was natürlich schon ein ding ist dass man mehr und mehr ideen rein kriegt aber ich glaube das hat eher damit zu tun dass man verschiedene leute aus verschiedenen backgrounds hat das bedeutet wenn du jetzt in software in der softwareentwicklung aus berlin aus münchen aus hamburg aus flensburg aus hannover und so in einen raum steckst Und die kennen sich nicht. Ich glaube schon, dass da auch verschiedene Backgrounds da sind und du handwerkstechnisch dann ähnliche Ergebnisse kriegst, wie wenn du jetzt zum Beispiel jemanden aus Finnland, aus den Niederlanden, aus Spanien, aus Österreich und aus Rumänien in einen Raum steckst. Ja, also bin mir nicht sicher, ob sich das Handwerk groß ändert, besonders wenn man viel mit Open Source zu tun hat. Was natürlich schon sich ändert, ist die Art und Weise, wie man kommuniziert und die Art und Weise vom Brainstorming und allem drum und dran.",
      "start": 2328592,
      "end": 2413759,
      "confidence": 0.8345493562231757,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das hat Yannick ja auch gefragt, wie sich die Kultur jeweils in Deutschland oder Österreich geändert hat. Du hast jetzt keinen direkten Vergleich, wenn du fast immer in internationalen Teams warst, aber würdest du irgendwie einen großen Unterschied sehen zwischen internationalen Teams und deutschen Teams in der Kultur, in der Zusammenarbeit?",
      "start": 2413799,
      "end": 2430090,
      "confidence": 0.7678039215686274,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Meine plakative Antwort ist nicht jeder oder wir gehen nicht immer in der Mittagspause Currywurst und Pommes oder Schnitzel essen.",
      "start": 2430270,
      "end": 2435695,
      "confidence": 0.78935,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich war ja mit dir sogar einmal indisch essen wo du mir erklärt hast das war dein erstes mal indisch essen das war gar nicht so lange her noch. Hast du nie mit Indern zusammengearbeitet demnach?",
      "start": 2435735,
      "end": 2444602,
      "confidence": 0.7368888888888887,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe noch nie mit Indern zusammengearbeitet noch nicht in einem Team nein in der Firma vielleicht schon aber, die die thematik mit den pausen und den mittags pausen aber auch weil sie nicht team events oder ähnliches das verändert einen natürlich schon weil man erfährt sehr sehr sehr viel über verschiedene kulturen das fängt im das fängt in der mittagspause an man geht in die küche will sich sein essen warm machen weil man am vortag irgendwie zu viel gekocht hat oder ähnliches und dann fragt man was hast du denn auf deinem teller und auf einmal schwupp dawupp bist du in der diskussion über Gemüse was du noch nie in deutschland gesehen hast was für die aber standard ist weil du noch niemals ein gericht damit kennst was du damit machen würdest das ist immer halt ganz interessant oder oder wie die ihren kaffee kaffee, lebensweise naja da bist du halt der profi wie die ihre getränke trinken tee und so weiter und sofort oder, Also man erfährt unglaublich viel über verschiedene Kulturen und das ist schon enorm spannend. Und ich kann mir vorstellen, dass das für viele Leute in den MINT-Berufen sehr spannend ist, weil die MINT-Berufe natürlich auch sehr, sehr wissensgetrieben sind. Deswegen glaube ich schon, dass das sehr, sehr spannend ist, für diese Art von Leuten, die in unseren Berufen arbeiten, auch für verschiedene Kulturen, mehr über verschiedene Kulturen zu erfahren.",
      "start": 2444622,
      "end": 2519019,
      "confidence": 0.7799618644067793,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das muss ich auch sagen, das war eines der spannendsten Sachen eigentlich bei Trivago und für alle, die es nicht wissen, Trivago hatte damals, ich vermute auch immer noch, damals um die 70 Prozent nicht-deutsche Mitarbeiterinnen und ich glaube so aus ungefähr 60 Nationen um den Dreh herum oder 70 Nationen. Und man ist halt am Abend einfach, wenn man da Bier getrunken hat, dann ist man halt einfach mit der ganzen Welt zusammengesessen. Und da waren halt dann wirklich Leute aus Nepal, aus Kuba, Italien, Frankreich, Finnland, was es auch immer ist. Und man hat halt wirklich am Abend einfach so Geschichten aus aller Welt gehört und hat sich ja direkt mit denen austauschen können. Und das war natürlich schon extrem cool, dass man halt einfach Geschichten aus Brasilien, Nepal und Kuba bekommt, ohne dass man dort hinfliegen muss und hat halt da einfach gute Freunde dann auch. Was macht man mit Freunden? Gemacht? Freunde gemacht?",
      "start": 2519279,
      "end": 2570740,
      "confidence": 0.811751592356688,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Gefunden.",
      "start": 2570760,
      "end": 2571561,
      "confidence": 0.675,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gefunden. Gute Freunde gefunden. Und mit vielen bin ich da auch noch viel in Kontakt. Und das ist halt schon extrem spannend. Also das war für mich eines der spannendsten Sachen, auch obwohl ich davor über die Uni zum Beispiel extrem viel internationale Leute gekannt habe. Aber es war einfach kein Vergleich, wenn du in einer Firma mit 1.800 Leuten arbeitest, wo 70 Prozent international sind.",
      "start": 2571601,
      "end": 2595179,
      "confidence": 0.8128636363636361,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hatte mal einen brasilianischen Mitarbeiter, also er ist von Brasilien nach Düsseldorf gezogen, Grüße an den Paolo, falls ihr uns mal hört. Und er hat mal eine schöne Story erzählt und zwar.",
      "start": 2595500,
      "end": 2604210,
      "confidence": 0.6621818181818184,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "By the way, Paolo spricht besser Deutsch als der Andi.",
      "start": 2604230,
      "end": 2606753,
      "confidence": 0.604,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist korrekt. Hochdeutsch vielleicht, naja, wie dem auch sei, lassen wir das. Er hat mir auf jeden Fall eine schöne Story erzählt und zwar als er das erste Mal in dem Aldi war in Deutschland. war der etwas erschrocken. Und zwar ist das bei Brasilianern oder in Brasilien ist das so, dass der Kassierer oder beziehungsweise dass jemand an der Kasse steht und dir da deine Tüte packt. Also deine Einkäufe werden für dich da eingeräumt. Wer schon mal im deutschen Aldi war, der weiß, da läuft das ein bisschen anders. Da packst du die ganzen Sachen aufs Band, dann ist da jemand, der gefühlt 33 Arme hat und die Artikel so dermaßen schnell über den Scanner zieht, Und am Ende bist du geschwitzt, weil du ja in der Zeit, wie der Kassierer da deine Artikel scannt, in deine Tüte oder in deine Tasche packen musst. Und er war das natürlich nicht gewohnt. Er stand dann da, und dann werden dann die Artikel da reingeballert, bis er einen brasilianischen Kumpel irgendwie mithatte, weil der sagte, ja, ich begleite dich doch mal lieber. Ich zeige dir mal, wie das hier in Deutschland geht. Und das war dann eine neue Geschichte für ihn, warum er denn seine Einkäufe selbst alle einräumen muss. Und natürlich war er von der Geschwindigkeit der Aldi-Kassierer schon beeindruckt. Ich meine, das ist ja auch bemerkswert.",
      "start": 2606793,
      "end": 2667771,
      "confidence": 0.742407894736842,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wenn das das größte Problem ist, was er gehabt hat, dann ist es eh super, wenn er in Deutschland so angekommen ist. Jetzt haben wir schon viel über die Vorteile gesprochen, wenn man in so einem internationalen Umfeld arbeitet und dass es eben extrem bereichernd sein kann, ganz abgesehen davon von deren Background, einfach was man noch mitbekommt von anderen Leuten im Team, von deren Background in anderen Ländern, wie andere Länder einfach funktionieren, was zum Beispiel bei einem internationalen Produkt auch extrem wichtig war, bei Trivago zum Beispiel. wo es halt einfach darum geht, wie suchen zum Beispiel Leute in einem anderen Land nach Hotels, was gibt es da für Begriffe und so weiter. Also da gibt es doch viele kleine Unterschiede. Sogar in Österreich gibt es Unterschiede im Vergleich zu Deutschland. Ein Unterschied ist zum Beispiel, dass wir immer sagen, man bekommt etwas billiger und zwar man bekommt es um fünf Euro. Und ihr sagt, glaube ich, für fünf Euro, oder?",
      "start": 2668391,
      "end": 2718914,
      "confidence": 0.8211707317073169,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich kaufe mir was für fünf Euro, ich bekomme es für fünf Euro, ja.",
      "start": 2718974,
      "end": 2721636,
      "confidence": 0.49692857142857133,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, bei uns sagt man um fünf Euro.",
      "start": 2721676,
      "end": 2723257,
      "confidence": 0.5625,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nee, um 5 Euro ist ja 4,79, 4,70, 5,20, das ist so um 5 Euro.",
      "start": 2723957,
      "end": 2729559,
      "confidence": 0.6540666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, nein, ich bekomme etwas um 7 Euro. Es klingt jetzt ein bisschen komisch. Ich habe einen Salat ganz billig bekommen um 5 Euro. Das heißt nicht ungefähr 5 Euro, sondern halt 5 Euro. Aber eben, das sind so Kleinigkeiten und ich glaube da hat Trivago auch Unterschiede zwischen Österreich und Deutschland, wenn ich mich nicht alles deutsche bei so Angebotsdingen, die groß irgendwie angezeigt worden sind.",
      "start": 2729579,
      "end": 2750047,
      "confidence": 0.6610895522388059,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also es gibt überall unterschiede man muss ja man muss ja auch wissen dass wenn man internationales produkt hat und das auch wirklich weltweit anbietet also ich sage jetzt nicht man hat ein website auf englisch und bietet der ganzen welt darauf zuzugreifen sondern eher, dass wenn man sein produkt auf spezifische märkte anpasst dann muss man sich natürlich auch in diese kulturen anpassen ja, soviel ich weiß ist irgendwo im asiatischen umfeld grün als wahnfarbe und nicht rot bei uns ist rot eher die wahnfarbe und grün eher so okay und im asiatischen umfeld ist das umgekehrt, das beeinflusst natürlich nicht nur die farben sondern auch die user experience ja und von von der schriftart und von der schriftform left to right right to left ja wie zum beispiel im vereinigten arabischen emiraten, Davon rede ich jetzt auch noch gar nicht, sondern es geht ja auch darum, wie preissensitiv sind Kulturen oder ähnliches. Deswegen haben sehr viele internationale Firmen auch Leute aus den jeweiligen Ländern, um die jeweiligen Märkte zu erschließen, weil du musst die Kultur halt einfach kennen. Und wenn man das also wirklich angehen möchte, dann kommt man um internationale Mitarbeiter einfach nicht drum rum und da kommen natürlich dann auch wieder die ein oder anderen Hürden für den Arbeitgeber auf den Zettel. Wie zum Beispiel, damit eine Firma, die zum Beispiel in Deutschland ihren Sitz hat, Leute aus dem Ausland nach Deutschland oder in die EU mit einer Arbeitserlaubnis holt, müssen diese in der Regel als Fachkraft anerkannt werden, weil sonst sagt nämlich der deutsche Staat, hey warum kannst du denn für diesen Job keinen deutschen Bürger nehmen, um natürlich die Arbeitslosenquote niedrig zu halten. Und Wolfgang hast du noch im Kopf was dann für ein requirement geben muss um jemanden aus dem ausland nach deutschland zu holen und als fachkraft zu qualifizieren.",
      "start": 2750567,
      "end": 2860373,
      "confidence": 0.8320879478827359,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du brauchst gewisse anerkannte Studienabschlüsse, das ist gar nicht so einfach international. Da gibt es Tabellen, was anerkannt wird, was nicht anerkannt wird. Wenn man einen akademischen Abschluss hat, ist es allgemein ein bisschen leichter. Ich glaube, man muss auch ein Mindestgehalt anbieten, so um die 55.000 Euro. Euro brutto im Jahr in Deutschland waren es, glaube ich, so um den Dreh herum auf jeden Fall, muss also höher als das sein. Man muss es auch in Deutschland angeboten haben, also die Stelle angeboten haben und ausgeschrieben haben, keine deutschen Bewerber bekommen haben, sinnvolle. Und dann ist es, glaube ich, möglich, internationale Leute auch wirklich ein Arbeitsvisum zu organisieren. Aber das ist schon ein ordentlicher Aufwand, muss man schon auch dazu sagen, also das, vor allem wenn man den in irgendeiner Form unterstützen will, diese Person, die da kommt, dann kann man sich da schon darauf vorbereiten, dass das nicht so einfach geht. Und wer die deutschen Behörden kennt und was ich so mitbekommen habe von diesen deutschen Behörden, die zuständig waren für diese Bereiche, also wir hatten da ja bei Trivago eigene Leute, die das erspottet haben, die habt auch paar Telefonate und so mitbekommen, Puh, das ist hart. Also da kann man sich auf was gefasst machen. Und übrigens auch so ein Klassiker, dort spricht kein Mensch Englisch. Also die, die zuständig sind für alle ausländischen, internationalen Arbeitskräfte und Visa und Aufenthaltstitel, da spricht niemand Englisch. Und wenn er Englisch spricht, dann will er nicht Englisch sprechen. Also das war schon sehr hart, das zu sehen, dass da Leute einfach absolviert worden sind, einfach weil sie nicht only Deutsch konnten.",
      "start": 2861251,
      "end": 2951915,
      "confidence": 0.8038529411764705,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Soviel ich weiß, hat der deutsche Staat irgendwo eine unglaublich lange Liste von allen Universitäten weltweit, die, wo die Abschlüsse dann anerkannt sind in Deutschland, beziehungsweise wie deren Abschlüsse auf unsere Abschlüsse irgendwie gemappt werden. Und ich weiß, zumindest von vielen indischen Universitäten, da stehen bei weitem nicht alle drauf. Also wir hatten damals Bewerber, die hatten Abschlüsse von spezifischen indischen Universitäten, die wurden bei uns einfach nicht anerkannt, weil das dann sehr wahrscheinlich irgendwelche Privatunis oder ähnliches waren, die dann oder beziehungsweise noch nicht auf der Liste standen. Also das ist so eine Sache.",
      "start": 2952395,
      "end": 2988851,
      "confidence": 0.850094736842105,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also es kann schon leicht passieren, dass es mehr als ein halbes Jahr dauert, bis man da irgendwie ein Visum, ein Arbeitsvisum oder sowas bekommt. Also das sind durchaus Zeiten, die gar nicht so unüblich sind. Vor allem, wenn es um irgendwelche Länder geht, wo es eben nicht ganz klar definiert ist.",
      "start": 2989492,
      "end": 3004292,
      "confidence": 0.7977884615384616,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und dieses Arbeitsvisum ist dann natürlich auch an eine Vertragsdauer gebunden und man kann die Leute jetzt nicht für sechs Monate hierüber holen, sondern es muss schon langfristiger Vertrag. Im IT-Umfeld redet man in der Regel ja sowieso über unbefristete Verträge nach dem aktuellen Fachkräftemangel, von daher. Und die Arbeitserlaubnis ist natürlich dann auch daran gebunden in irgendeiner Art und Weise. Details kenne ich da jetzt leider nicht, aber Ein Jobwechsel ist jetzt für diese Leute auch nicht mal eben schnell gemacht wie mit dem Fingerschnippen, sondern der neue Arbeitgeber muss das natürlich dann auch alles mittragen. Eine andere Geschichte ist, haben wir gerade schon mal kurz angesprochen, ist das Sprachtraining. Die Leute müssen natürlich irgendwie in dem Land, in das sie einwandern, auch klarkommen. Und es ist halt mal leider so, dass die meisten Leute, die die Landessprache sprechen, wie zum Beispiel Ärzte, Apotheken oder ähnliches, natürlich ist es im internationalen Umfeld, wie zum Beispiel in Finnland oder in Holland, Ein bisschen was anderes, wie ja schon gesagt, da sprechen viel mehr Leute Englisch, aber dennoch sollte man ein paar Brocken von der nativen Sprache sprechen. Was auch immer hilft ist, das haben wir bei Trivago sehr viel gehabt, ist Länder-Communities. Das bedeutet jetzt mal angenommen, ich bin Brasilianer und ziehe jetzt nach Deutschland und fange bei Trivago an. Dann hatten wir einen brasilianischen Slack-Channel, wo alle Brasilianer dann drin waren. Und die haben sich natürlich dann auch ein bisschen gegenseitig supported, weil auch ein Brasilianer zum Beispiel hat dann gegebenenfalls eine niedrigere Hemmschwelle, ehemalige Landeskollegen und Kolleginnen zu fragen, um einfach so, hey, in Brasilien läuft das doch so, aber wie funktioniert das denn in Deutschland? Ja, man tauscht sich dann einfach mit Gleichgesinnten aus. Das hat natürlich auch sehr viel geholfen. Kann man auch so als Art Mentoring sehen, weil in einem Land umzuziehen ist eine enorm große Hürde. Also ich bin noch nie von zu Hause weggezogen, muss ich zugeben. Ich habe höchsten Respekt vor diesen Menschen, was sie da angehen. Ziehe ich nur meinen Hut vor. Deswegen ist solche Hilfe natürlich ungemein wichtig. Nicht nur eine neue Wohnung suchen, sondern auch, wie funktionieren eigentlich die alltäglichen Dinge im Leben.",
      "start": 3004792,
      "end": 3130650,
      "confidence": 0.8113818681318686,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und mir haben teilweise schon Sachen verwundert, wie da nur nach Deutschland gezogen bin, was in Deutschland schon anders läuft als in Österreich. Wenn man sich dann vorstellt, man kommt irgendwie aus Brasilien oder aus Kuba oder aus China oder so, dann ist das schon eine ganz andere Baustelle, was man da lernen muss und auf was man sich da einlässt. Also wenn man da guten Support bekommt, hilft das natürlich schon extrem. Aber es ist natürlich auch im Team dann gar nicht so einfach. Da treffen natürlich dann viele Backgrounds und verschiedene Kulturen und Ansichten zusammen. Jetzt Andi, du warst ja auch Engineering Manager lang von dem internationalen Team und bist jetzt immer noch. Was sind deiner Meinung nach da die größten Schwierigkeiten und Hürden in dem internationalen Team, in der Zusammenarbeit?",
      "start": 3130990,
      "end": 3173667,
      "confidence": 0.8154887218045113,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was natürlich schon ein Unterschied ist, aber ich bin mir gar nicht sicher, ob das kulturell oder ob das nicht menschlich ist, ist der Hang zur Perfektion und Qualität. Manche Leute, manche Kulturen haben, glaube ich, einen irren Hang zur Effizienz und Produktivität, wo andere Kulturen dann gesagt haben, ach, das ist Arbeit, damit zahle ich meine Miete und es ist gut genug. Aber ich bin mir gar nicht sicher, ob das kulturell ist oder ob das nicht menschlich ist.",
      "start": 3173907,
      "end": 3199473,
      "confidence": 0.7740125,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich kann dir da ein Gegenbeispiel geben. Ich habe mal in einem Team gearbeitet, wo ich der Engineering Manager war und das Team waren primär drei Spanier. Und der spanischen Kultur sagt man eher so nach, die sind irgendwie gemütlich, langsam und nicht so perfektionistisch. Und in dem Team waren zum Beispiel zwei, die waren komplett unterschiedlich. Und der eine war absolut perfektionistisch, Engineering, alles muss perfekt sein, Patterns und so weiter. Und der andere war eher so da bringen wir es auf die Schiene, knallen wir irgendwie raus und wenn drei Bugs drinnen sind, ist auch egal. Also das waren so die komplett unterschiedlichen Charaktere und da hat es auch extrem geknirscht in dem Team, muss man auch sagen, zwischen den zwei. Sie waren sich ihrer Position und ihrer Charaktere durchaus bewusst, aber trotzdem hat es da ganz oft geknirscht natürlich zwischen so zwei Charaktere aber man muss schon sagen es gibt natürlich schon gewisse kulturellen Einflüsse und ich glaube die Kultur ist halt einfach eine Dimension mehr die man im Team hat. Also man hat natürlich sowieso die Charaktere, die unterschiedlichen Charaktere, auch natürlich andere Hintergründe und sei es jetzt Frauen, Männer, andere Einstellungen und so weiter, das hat man sowieso immer im Team, aber da kommt halt einfach noch diese Kulturdimension dazu, die einiges schwieriger macht und Wir haben zum Beispiel viele Brasilianer erzählt, dass sie extrem Schwierigkeit hatten, am Anfang mit den Deutschen zusammenzuarbeiten im Team. Weil die Deutschen haben ihnen halt einfach direkt gesagt, das war scheiße oder da müssen wir was machen bei diesem Code und das ist Bullshit. Und die Brasilianer, die mir das zumindest immer mitgeteilt haben, ist, dass das halt absolut nicht üblich ist, in Brasilien so zusammenzuarbeiten. Die hatten dann wirklich immer das im Kopf, ich bin absolut schlecht, ich habe da nichts delivered und das war absolut schlecht und ich habe jetzt ein Problem. Und die deutsche Seite wollte halt nur Feedback geben. Und für die war das halt einfach gerade heraus, okay, das ist falsch, da müssen wir was verbessern, weiter geht's. Und das ist halt gerade so ein klassisches Beispiel, was ich ganz oft von Brasilianern gehört habe. Und solche Sachen machen die Arbeit natürlich im Team nochmal schwieriger. Aber vor allem, wenn sich die Leute dann verständigen am Ende, bringt es halt, glaube ich, beiden Seiten extrem viel. Und man lernt halt auch empathisch miteinander umzugehen und verstehen, dass da auch andere anders arbeiten, anders ticken. Und das hilft halt dann, glaube ich, im Endeffekt auch, dass man besser miteinander umgehen kann und im Team besser zusammenarbeiten kann.",
      "start": 3199733,
      "end": 3350263,
      "confidence": 0.8005981524249424,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ja, das stimmt. Den Punkt hatte ich leider, der fiel mir gerade nicht ein. Das ist richtig. Wie die verschiedenen Kulturen miteinander kommunizieren oder was deren Kommunikationsteil ist generell. Nehmen wir mal Amerikaner. Amerikaner sind oft sehr hyped, sehr positiv. Ja, awesome, et cetera, et cetera. Wo die Deutschen eher sagen, kein Gemeckere ist ein Lob. Also, das sind halt schon Welten, die da miteinander kollidieren. Apropos kollidieren, dazu gibt es ein unglaublich gutes Buch, Wer mal ein bisschen darüber lernen möchte, wie verschiedene Kulturen kommunizieren, das nennt sich When Cultures Collide. Verlinken wir auch gerne in den Show Notes. Da geht es eigentlich nur genau darum. Da geht es um Kommunikation, wenn verschiedene Kulturen miteinander arbeiten. Sehr interessant. Und ja, auch da in der Kommunikation habe ich, glaube ich, schon diverse Fehler gemacht. Kann ich aber auch nur empfehlen diese art von fehler zu machen weil dann wird einem das echt bewusst weil kultur die kommt die wird dir leider in die wiege gelegt da kann man kann sich keiner von befreien jeder hat sie in irgendeiner art und weise und da knirscht dann halt mal ein bisschen aber umso mehr internationale kulturen in der firma sind, desto eher werden diese auch ausgebügelt, beziehungsweise jeder ist da sich bewusst, mit wem man da arbeitet und dass das alles auch nicht absichtlich geschieht. Das ist glaube ich ganz wichtig, dass man einfach davon ausgeht, dass jeder hier nur Gutes im Sinn hat und nichts absichtlich macht, weil es wird knirschen, das ist unvermeidbar.",
      "start": 3350773,
      "end": 3442318,
      "confidence": 0.8147401574803146,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist natürlich nicht so leicht, immer auf so eine Metaebene zu gehen und zu sagen, okay, es war nicht so böse gemeint. Und ich glaube, es ist halt auch wichtig zu lernen, dass es halt trotzdem nichts hilft, auch wenn es nicht böse gemeint war. Und meine Erfahrung ist halt auch, dass die Leute, die in meinem internationalen Umfeld arbeiten, mit der Zeit auch das lernen und dann halt einfach mehr Empathie entwickeln und die andere Seite einfach besser verstehen können. Und das hilft dann halt in vielen Lebenslagen meiner Meinung nach extrem weiter. auch wenn es jetzt gar nicht mehr um unterschiedliche Kulturen geht, aber dass man halt einfach dieses Verständnis bekommt. Und im Gesamten wird dann meiner Meinung nach die Teamarbeit und die Teamatmosphäre einfach wesentlich besser, wenn du solche Leute im Team hast, die einfach gewöhnt sind, sich auf die Gegenseite einzustellen und einfach auch so verbindend wirken in dem Team. Und das kann man meiner Meinung nach extrem gut lernen, wenn man mit anderen Leuten im internationalen Umfeld zusammenarbeitet.",
      "start": 3442598,
      "end": 3496138,
      "confidence": 0.8074022988505744,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wenn ihr jetzt sagt, Wolfgang, Andi, was labert ihr da? Das betrifft mich alles nicht. Ich sitze hier in meinem Vorort vor Hamburg, in meiner Fünf-Mann-Agentur, mache WordPress-Entwicklung. Ich werde damit nie in Berührung kommen. Halt!",
      "start": 3496632,
      "end": 3509600,
      "confidence": 0.6994594594594595,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Stopp!",
      "start": 3509661,
      "end": 3510321,
      "confidence": 0.942,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Glaube ich nicht. Der Punkt ist ganz einfach, ihr müsst nicht die Firma wechseln, um die ersten Erfahrungen damit zu sammeln. Ihr könnt damit auch im Open-Source-Bereich sehr viel machen, weil Open-Source ist ebenfalls weltweit. Und da habt ihr nämlich genau die gleichen Voraussetzungen. Zwar vielleicht kommt das nicht immer direkt rüber in den Pull Request oder in dem Issue, wenn ihr mit jemandem in geschriebener Form kommuniziert, aber warum joint ihr nicht einfach mal irgendeinem Community Call, irgendeiner Ask Me Anything Session auf Reddit oder oder oder mehr und mehr Open Source Projekte haben Discords, wo die wöchentliche Community Calls oder Show and Tells machen, ähnliches oder mehr und mehr meetup sind durch die pandemie remote gegangen oder mehr konferenzen all da könnt ihr join könnt ihr könnt ihr teil der community werden fragen und da werdet ihr leute aus verschiedenen kulturen haben natürlich werdet ihr da keine tiefgehenden one on ones mit den haben so wie ihr das jetzt in dem internationalen arbeitsumfeld haben würdet wo er manager zum beispiel spania ist oder portugies oder ähnliches, Alles richtig, aber auch da könnt ihr die ersten Erfahrungen im internationalen Umfeld sammeln, ihr könnt eure englische Sprache, eure englische Aussprache oder euer englisches Verständnis, damit fängt man ja auch schon an, verbessern, ohne euch wirklich ins Dunkle zu begeben und einen Job zu wechseln.",
      "start": 3510341,
      "end": 3585130,
      "confidence": 0.7929508928571423,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und für alle in meinem Heimatland, vor allem in Tirol, man kann auch mal anfangen Hochdeutsch zu lernen. Mein Doktorvater zum Beispiel, der war aus Deutschland, war zwar ein Bayer, aber der hat uns immer erklärt, wir müssen Hochdeutsch lernen. Wenn wir einen Vortrag gemacht haben auf Tirolerisch, hat er immer gemeint, ihr müsst Hochdeutsch lernen, das ist wichtig. Ich hab das nie verstanden, warum, bis ich die kennengelernt hab, Andi, und dann gemerkt hab, dass du 50 Prozent von meinem Kauderwelsch gar nicht verstehst, hab ich zurückgedacht an meinen Professor, Professor Specht, by the way, und hab mir gedacht, okay, er hatte doch recht gehabt. Hätte ich früher Hochdeutsch gelernt, hätte es auch besser funktioniert dann bei den Deutschen, mit Andi zum Beispiel. Und wer das überspringen will, kann gleich Englisch lernen, weil Englisch ist einfach dann problemloser, dann hat man das ganze Problem nicht mit Tirolerisch, Österreichisch, Wienerisch, Hochdeutsch. Es macht das Leben dann auch einfacher.",
      "start": 3585330,
      "end": 3635181,
      "confidence": 0.7616329113924049,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Persönlich bin ich mir gar nicht sicher, ob wir jemals zusammen so weit gekommen wären, hättest du Hochdeutsch gelernt. Weil das Interessante ist ja, wir sind ja immer ineinander geraten, wenn ich dich nicht verstanden habe. So sind wir ja ins Gespräch gekommen. Hätte ich dich verstanden, hätte ich je nur gesagt, ah, dummer Akademiker, will wieder immer nur klüger sein, mit dem will ich nichts zu tun haben. Ja, nimm mal dein Kind runter und lauf mal weiter. Aber so habe ich gedacht, wovon redet der? Der will mich doch jetzt veräppeln, oder?",
      "start": 3635221,
      "end": 3658173,
      "confidence": 0.7385425531914894,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, also es kann auch was Gutes haben, lernen wir daraus perfekt. Also alle Sprachen haben ihre Daseinsberechtigung.",
      "start": 3658433,
      "end": 3665456,
      "confidence": 0.6042222222222222,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich persönlich bin mir nicht sicher, ob das gut ist, dass ich dich jetzt kenne und wir jetzt so viel miteinander machen. Also wenn du das gut findest, freue ich mich natürlich. Naja, für mich ist das die Arbeit. Naja, komm, machen wir weiter, machen wir weiter. Aber auch im technischen Umfeld ist es natürlich so, dass die ganzen Firmen, die hochkommen und natürlich auch auf Business Insider und deutsche Startups und so weiter, über die konstant berichtet wird, da kommt ihr nicht um ein internationales Arbeitumfeld rum, weil Speziell nach der Pandemie werden natürlich Leute auch remote eingestellt und da kommen immer mehr und mehr Firmen in diese Kategorie internationale Arbeitsumgebung und besonders bei remote Verträgen und remote Kollegen ist es natürlich nochmal ein bisschen schwieriger Besonders über Video Calls, Zoom Calls, man sieht nicht die komplette Körpersprache. Vielleicht ist die Audioqualität oder Videoqualität nicht so gut. Um da eine vertrauensvolle Verbindung aufzubauen, da gehört schon ein bisschen mehr zu. Da muss man sich vielleicht auch mal persönlich treffen. Und gegebenenfalls sind Zeitzonen auch noch mal eine Hürde. Besonders wenn man jetzt an Amerika oder Südamerika oder Kanada oder den APEC-Bereich, also den asiatischen, passivischen Bereich, Australien, Neuseeland und so weiter denkt, da ist es natürlich dann schon mal eine andere Liga. Aber das kann für viele Leute in der aktuellen Situation der erste Einstieg in das internationale Arbeitumfeld sein. Und da ist natürlich dann genau das, was wir hier besprechen, umso relevanter, weil da trainiert ihr wirklich alle Ebenen der englischen Sprache. Nicht nur das Sprechen, sondern auch das Verständnis und die geschriebene Form. Und die Technik ist ja schon so weit, dass ihr euch da untersupportet. Ich hatte vorhin ein paar Tools erwähnt. DeepL, Machine Learning Translator. Grammarly, Support für englische Rechtschreibung und Grammatik. Klärt das erst mit eurer Firm Security ab, weil manche Leute sagen, okay, das sind eher so ein bisschen Keylogger, weil da pastet man natürlich alles rein und was sie mit dem Text machen, ist natürlich auch fraglich hinten dran. Das bedeutet, schaut mal bitte nach mit eurer Firm Security, aber auch so ein Google Translator, der kann den Text automatisch vorlesen, damit ihr ungefähr wisst, wie die Worte ausgesprochen werden. Apropos zu Aussprache, eine Sache, die ich immer mache, immer wenn ich z.B. Interviews führe oder neue Kollegen kennenlerne, wo ich den Namen nicht gut aussprechen kann, was als Deutscher sehr, sehr oft vorkommt bei internationalen Namen, bevor ich dieses Gespräch beginne, frage ich einfach immer, okay, wie spricht man denn den Namen richtig aus? Und oft haben die Leute schon ein Verständnis dafür, wenn das wirklich ein schwieriger Name ist, dann geben die mir in der Regel in dem zweiten Satz direkt irgendeinen Nickname, der für mich leichter auszusprechen ist. So tritt man da nicht in so ein Fettnäpfchen.",
      "start": 3665476,
      "end": 3825618,
      "confidence": 0.8088952991452992,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Drum darfst du ja Wolfi zu mir sagen, statt Wolfgang. Also Janni, vielleicht kannst du uns auch nochmal eine Message schreiben, ob wir deinen Namen richtig ausgesprochen haben. Und für alle, die jetzt schon Angst haben, dass wir den Podcast auf Englisch machen, keine Angst, wir bleiben auf Deutsch. Wir haben da ja auch gute Rückmeldungen bekommen. Wir würden uns aber auch freuen, was ihr grundsätzlich dazu denkt, zu dem ganzen englischen Hype, ob es eben ein Hype ist oder ob es sinnvoll ist oder ob ihr lieber auf Deutsch bleiben würdet und wie ihr das Ganze seht mit dem internationalen Team und internationalen Kollegen und Kolleginnen, auch im Remote-Bereich, ob das wichtiger wird, ob ihr mit internationalen Leuten zusammenarbeitet, ob ihr da Probleme habt oder ob da alles perfekt wie am Schnürchen läuft. Sendet uns dazu einfach gern ganz formlos ein E-Mail an stetisch at engineeringkiosk.dev oder eben auch auf Twitter unter engkiosk ist der Twitter-Handle. Wir freuen uns wirklich extrem über alle Infos, Feedback, E-Mails, die wir bekommen, weil uns das einfach auch zeigt, dass es ein interessantes Thema ist, ob wir vielleicht in irgendeine Richtung was machen sollen, nochmal machen sollen, tiefer besprechen sollen. Das hilft uns einfach extrem weiter und hoffentlich dann auch euch als Hörerinnen und Hörer da draußen, wenn wir sinnvollen Content produzieren und das Ganze auf Deutsch.",
      "start": 3825818,
      "end": 3903133,
      "confidence": 0.8258973214285711,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und weil wir so international waren, möchte ich zum Abschluss noch drei Flachwitze zum Besten geben, die sehr gut hier passen. Wolfgang.",
      "start": 3903540,
      "end": 3911486,
      "confidence": 0.8643636363636366,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sind jetzt auf Englisch wenigstens Dad-Jokes?",
      "start": 3911506,
      "end": 3914128,
      "confidence": 0.684,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nein.",
      "start": 3914148,
      "end": 3914448,
      "confidence": 0.881,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Keine Dad-Jokes.",
      "start": 3914488,
      "end": 3915289,
      "confidence": 0.4645,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die sind nicht auf Englisch, sondern auf Deutsch.",
      "start": 3915329,
      "end": 3917630,
      "confidence": 0.68625,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir bleiben unserer Herrschaft treu und machen das Deutsch. Okay, dann schieß mal los. Ich bin gespannt, was ich dann wieder alles rausschneiden muss am Ende. Schieß mal los.",
      "start": 3917650,
      "end": 3926777,
      "confidence": 0.7092413793103449,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In welchem Urlaubsort wird am meisten geflucht? Tourette des Mars. Nummer zwei. Ich stecke gerade in der Bredouille. Wie schön. Frankreich. Und der letzte für heute. Was sagt ein Polizist mit sächsischem Dialekt? Ägyptisch oder ich schieße.",
      "start": 3926797,
      "end": 3945021,
      "confidence": 0.7922432432432434,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Den verstehe ich nicht.",
      "start": 3945041,
      "end": 3946362,
      "confidence": 0.46725,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ägypten. Ägyptisch.",
      "start": 3946402,
      "end": 3947943,
      "confidence": 0.878,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ah, ah, okay.",
      "start": 3948023,
      "end": 3950105,
      "confidence": 0.7973333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, Jungs. Ich muss einem Akademiker deutsche Flachwitze erklären.",
      "start": 3950185,
      "end": 3955088,
      "confidence": 0.7608888888888887,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber was soll nicht Sächsisch können, bitte?",
      "start": 3955188,
      "end": 3957590,
      "confidence": 0.49328571428571427,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das war's von heute. Vielen Dank fürs Zuhören.",
      "start": 3957610,
      "end": 3961132,
      "confidence": 0.8667499999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bis später. Ciao.",
      "start": 3961173,
      "end": 3962086,
      "confidence": 0.6526666666666666,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.7916816984858502,
  "audio_duration": 3970.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
