{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/14299012-06a5-4d0d-a131-3c9b7b35f320/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62xneqzgi2-ccb1-4ee1-89be-9f7642b3abc4",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Jeder von euch hat bestimmt schon mal von lokalen Meetups oder Usergroups und Konferenzen gehört. Vielleicht habt ihr sogar schon mal welche besucht. Beides sind wichtige Bestandteile der Community und Plattformen für den Wissensaustausch. Firmen sponsoren sogar Meetups und geben Mitarbeitern sogenannte Konferenzbudgets. Doch habt ihr euch eigentlich schon mal gefragt, wie es hinter den Kulissen aussieht? Was bedeutet es eigentlich, jeden Monat ein Meetup auf die Beine zu stellen? In dieser Episode gebe ich, Andi, mal einen Einblick in die Organisation eines Meetups, was die Hochs und Tiefs sind und auch, wie ihr mit eurem eigenen Meetup starten könnt. Viel Spaß!",
      "start": 2571,
      "end": 33244,
      "confidence": 0.8099607843137256,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist aktuell gerade Juli. Andi, alle anderen Podcaster sind auf Urlaub, machen Pause im Sommer. Was hältst du von Pause und Urlaub?",
      "start": 36517,
      "end": 44083,
      "confidence": 0.8098260869565218,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt im Urlaub alle Podcaster sind im Urlaub, nicht auf Urlaub, weil die fahren ja nicht immer auf eine Insel.",
      "start": 44123,
      "end": 50509,
      "confidence": 0.8407142857142856,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Alle Österreicher sind auf Urlaub.",
      "start": 50549,
      "end": 52190,
      "confidence": 0.8049999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, also ich meine, ich denke, wer viel Content erzeugt, sollte auch viel relaxen. Und ich bin mir ja gar nicht sicher, ob das so vorteilhaft ist, einfach weiterzumachen oder nicht. Aber wir haben auch natürlich auch schon von einigen Hörern gehört, dass der Release-Cycle von einer Woche, den wir an den Tag legen, schon zu langsam ist, weil Wir haben jetzt vor kurzem Feedback bekommen, dass ein Hörer, Grüße an den Nils nach Aachen, uns immer beim Joggen hört. Und das freut uns natürlich ganz besonders. Und das spornt uns natürlich eigentlich auch an, mehr Folgen pro Woche zu produzieren, damit der Nils öfter joggen geht. Also könntest du das natürlich auch so sehen, dass viele Leute im Urlaub sind und somit jetzt sich ein Episodensammelsorium aufbauen, damit sie dann zum Beispiel in einer Woche sieben Tage lang joggen gehen und dabei sieben Tage lang deiner schönen Stimme lauschen dürfen.",
      "start": 52538,
      "end": 101530,
      "confidence": 0.8264437086092715,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vor allem wenn sie so krächzt in der Früh wie heute.",
      "start": 101550,
      "end": 103933,
      "confidence": 0.6809090909090909,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, aber der Grund ist, warum wir keine Sommerpause machen, dieses Projekt hier ist noch relativ jung und wir denken uns, lass uns doch einfach weitermachen. Das heißt nicht, dass wir nicht Urlaub machen. Wolfgang war jetzt auch vor kurzem in Portugal, ich fahr bald auch weg. Was wir dann immer tun, wir produzieren dann immer vor, ist dann immer ein bisschen anstrengend, aber es ist ja nicht so, als sind wir sechs Wochen weg und müssen dann sieben Folgen vorproduzieren, sondern da geht's ja meist nur um ein oder zwei Wochen. wir haben nicht vor in die sommerpause zu gehen obwohl die sommerferien natürlich schon gehen in der gene hier in nordrhein-westfalen.",
      "start": 104333,
      "end": 136387,
      "confidence": 0.8090884955752214,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ihr seid ja ein fleißiges volk dort das sind die bei uns die ferien also die schulferien in österreich sind ja neun wochen die sommerferien ja dafür fehlt.",
      "start": 136427,
      "end": 145091,
      "confidence": 0.7185000000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber irgendwie die herbstferien. Genau, wenn du nämlich die Sommerferien von sechs Wochen rechnest, dann haben wir, glaube ich, noch zwei Wochen Osterferien vorher und zwei Wochen Herbstferien später. Das sind dann im Endeffekt zehn Wochen, aber dann habt ihr elf Wochen, glaube ich, weil ihr habt ja Oster oder Herbst. Irgendwie habt ihr auch, ne?",
      "start": 145131,
      "end": 162559,
      "confidence": 0.6899464285714287,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, Schule ist schon lange her bei mir. Ehe auf der Uni war, übrigens auch auf der Uni, nicht an der Uni. Österreich ist ganz klassisch. Da habe ich mich noch ausgekannt mit den Ferien. Uni gibt es ja noch mehr Ferien eigentlich. Oder, sorry, vorlesungsfreie Zeit heißt das. als Lehrender, aber das ist die einzige Zeit, wo man mal Urlaub machen kann, weil man keine wöchentlichen Veranstaltungen halten muss. Auf jeden Fall geben wir dem Algorithmus keine Chance. Und falls ihr irgendwen kennst, der jetzt sagt, ah, meine ganzen guten Podcasts in der Sommerzeit, die machen alle Pause, dann empfehlt doch den Engineering Kiosk Podcast. Ist ja einer der besten Podcasts, der sogar die O-Notation so erklärt, dass nur 15 Prozent der Leute abspringen, wie in anderen Episoden auch. Vielen Dank an alle Spotify-Hörer, da haben wir zumindestens die Statistiken darüber.",
      "start": 162599,
      "end": 206043,
      "confidence": 0.771535211267605,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich weiß, dass das konstante Publishing von Videos auf YouTube massiv für den Erfolg deines Kanals im Algorithmus berücksichtigt wird. Ich bin mir gar nicht sicher, ob das auch wirklich so der Fall ist bei den Podcast-Plattformen wie Spotify, Amazon Music, Google Podcast und so weiter. Also ich glaube, da gibt es noch relativ wenig Wissen darüber, oder?",
      "start": 206443,
      "end": 228040,
      "confidence": 0.8455762711864406,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hab gerade diese These gehört im Doppelgänger-Podcast, das... Wie heißt dieser bekannte Podcast bei euch da in Deutschland?",
      "start": 228060,
      "end": 235519,
      "confidence": 0.7263684210526314,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Flaschig... Fest und flauschig von Jan Böhmermann und Olli Schulz.",
      "start": 235579,
      "end": 240998,
      "confidence": 0.5226,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, dass die irgendwie zwar Sommerpause haben, aber trotzdem irgendwie so ein wöchentliches Super-Kurz-Update oder so senden. Und die Vermutung der Doppelgänger war, dass das einfach nur für den Algorithmus ist. Die arbeiten ja auch mit Spotify zusammen, dass da trotzdem wöchentlich irgendwas rausbootselt. Sonst müssten die wahrscheinlich ein If-Statement in ihrem eigenen Algorithmus einbauen.",
      "start": 241198,
      "end": 259368,
      "confidence": 0.7897272727272727,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Lass uns nicht über solche Sachen mutmaßen, wo wir eh keine Ahnung von haben, weil wir den Quellcode nicht lesen können.",
      "start": 259688,
      "end": 265134,
      "confidence": 0.7774285714285715,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Denn, Achtung, Moment, wir haben überall eine Meinung, das war's, sorry.",
      "start": 265154,
      "end": 269860,
      "confidence": 0.7202727272727273,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir haben überall eine Meinung, genau.",
      "start": 269880,
      "end": 271722,
      "confidence": 0.7696666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wir haben heute trotzdem ein Urlaubsthema, weil, was ist der größte Nachteil an dieser Urlaubszeit im Sommer?",
      "start": 271762,
      "end": 278369,
      "confidence": 0.8340555555555557,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn wir das jetzt auf Komplettentwickler und Softwareentwickler beziehen, denke ich, dass die meisten natürlich Podcasts und YouTube-Serien Sommerpause machen, aber auch die ganzen lokalen Meetups und Konferenzen, weil auch die Leute wollen natürlich mal Urlaub haben und mal eine Pause haben. Und die Konferenzzeit, zumindest in Europa, ist generell erst im September und Oktober. Da bündeln sich in der Regel die ganzen Konferenzen und Meetups. Gute Meetups laufen ja sowieso immer monatlich. aber auch oft in der Sommerpause, in den Sommerferien pausieren sie.",
      "start": 278569,
      "end": 311368,
      "confidence": 0.7964523809523811,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, du als großer Meetup-Organisator, du bist ja der Organisator des wahrscheinlich größten Tech-Meetups in Deutschland, würde ich fast sagen. Jetzt wenn du sagst, normal man macht da ja kurz Pause, wie lange hast du jetzt Pause gemacht mit deinem Meetup? Seit wann war die letzte Veranstaltung?",
      "start": 311428,
      "end": 327822,
      "confidence": 0.7424042553191492,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Als Kontext für die Hörer, ich habe oder ich organisiere mit einem Kollegen Dominik Siebel, Grüße gehen raus, seit mehreren Jahren das Meetup Web Engineering Düsseldorf. Und was der Wolfgang da in Bezug auf die Größe anspricht, ist die Anzahl der Mitglieder innerhalb der Meetup Gruppe, die jetzt gerade bei 4.200 ist. Was für Meetup schon... Du bist schon.",
      "start": 327862,
      "end": 350331,
      "confidence": 0.7975932203389834,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie so ein Politiker, der eigentlich nicht auf meine Frage antwortet. Wann war die letzte Veranstaltung? Sie haben eine sehr gute Frage gestellt, aber was ich eigentlich sagen wollte ist ja das blablabla. Also, letzte Veranstaltung?",
      "start": 350351,
      "end": 363184,
      "confidence": 0.8142499999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die letzte Veranstaltung fand am 10. März 2020 statt.",
      "start": 363224,
      "end": 366008,
      "confidence": 0.6767777777777777,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da müssen wir auch noch mal drüber reden. Aber wir sind jetzt schon voll in dem heutigen Thema drin und zwar wollen wir über Meetups und Konferenzen reden und zwar weniger von der Besucherseite, da machen wir vielleicht auch mal eine eigene Folge. Aber in dem Fall wollen wir mal hinter die Kulissen schauen, weil Andi ist der Organisator von dem Web Engineering Düsseldorf Meetup. und hat auch kürzlich eine Konferenz organisiert. Und wir wollen einfach mal hinter die Kulissen blicken, wie das denn so läuft auf der Organisationsseite, was da schwierig ist, wie man da vielleicht auch starten kann mit Meetups. Gerade jetzt nach Covid, oder nach Covid ist eine gute Frage, aber hoffentlich mal post-Covid vielleicht will der eine oder die andere ein Meetup starten. wie das so läuft, dass wir da einfach mal ein paar Infos bekommen, wie schwierig oder auch leicht das Ganze ist. Also, Andi, du hast gestartet vor, wie viele Jahren hast du gesagt? 10? 15? Bist du schon so alt? Andi springt ja auf jeden Hype auf. Wann waren Meetups noch der heiße große Scheiß?",
      "start": 368221,
      "end": 431608,
      "confidence": 0.8158241758241759,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meetups waren der große heiße Scheiß, bevor die ganze Sache Meetup genannt wurde, weil damals waren es Usergroups.",
      "start": 431628,
      "end": 436632,
      "confidence": 0.7426111111111112,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt, wie hast du gestartet?",
      "start": 436652,
      "end": 438293,
      "confidence": 0.6928333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin mit der PHP User Group Düsseldorf gestartet. Da muss ich aber sagen, die PHP User Group Düsseldorf hatte den Vorgänger aus der PHP User Group Duisburg, Düsseldorf und Krefeld, die von wem anders gemacht wurde. Und damals, als wir bei Trivago gearbeitet haben, haben wir natürlich sehr viel pp gemacht im zwar so 2013 und haben wir den räumlichkeiten angeboten weil die haben sich eine ganze zeit lang in einer kneipe getroffen in so einem hinterraum, haben wir den die räumlichkeiten angeboten und haben das meetup da gemacht und irgendwann ist das von den leuten halt eingeschlafen die haben halt nichts mehr organisiert und dann haben. das ein paar Leute von uns übernommen. Ich glaub, Mario Müller war damals noch mit dabei, Dominik Siebel und so weiter. Dann haben wir das halt mehr oder weniger weitergeführt. Übernommen möchte ich nicht sagen, denn wirklich weitergeführt. Und daraus ist dann die PHP-Usergroup Düsseldorf entstanden, damals noch auf Zing Events. Und als PHPler haben wir natürlich nicht nur PHP gemacht, sondern auch MySQL und CSS und JavaScript und jQuery und Mutools und Prototype.js und all das, was damals halt so war. Und irgendwann haben wir gesagt, ja, das ist zwar alles schön, dass wir PHP machen, aber wir machen ja auch alles andere. Und dann lass uns doch mal die ganze Sache umbenennen. Und dann haben wir uns in Web Engineering Düsseldorf umbenannt. Und dann sind wir auch von Zing oder Crossing von Zing Events auf die Plattform meetup.com umgestiegen, auf der wir dann jetzt final natürlich auch sind.",
      "start": 439168,
      "end": 523866,
      "confidence": 0.8092364341085272,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wann war das ungefähr, die Umbenennung?",
      "start": 523907,
      "end": 526089,
      "confidence": 0.8007142857142858,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau weiß ich's grad auch nicht. Ich würd irgendwas so sagen, so 2.16, 2.17, vielleicht auch 2.18, irgendwie so was. Aber wir haben auch schon vor der Umbenennung ... Die Umbenennung war eigentlich nur, wir machen's jetzt offiziell, dass wir uns nicht nur immer um PHP kümmern, weil wir vorher natürlich auch schon andere Themen hatten wie Design und Co. Und man muss ja sagen, dass es immer noch sehr, sehr viele Leute gibt, die leider so eine Art Language-Bashing machen. unabhängig davon welches thema auf der usergroup wirklich stattfindet wenn die usergroup oder das meetup php im namen hat sagen die bar da gehe ich nie hin obwohl es dann hier zum beispiel um das thema load testing mit einer millionen usern geht und ist Das gerechtfertigt? Nein, ist es natürlich nicht. Aber wir haben deutlich diverseren Zulauf beobachtet, als wir uns weiter aufgestellt haben und somit das Branding in der Hinsicht den Namen von PRP User Group Düsseldorf in Web Engineering Meetup Düsseldorf umbenannt haben.",
      "start": 526529,
      "end": 583695,
      "confidence": 0.8122934131736528,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie viele Leute waren da so im Durchschnitt bei so einem Meeting? Also bevor ihr die ganze Sache umbenannt habt, zu BHB-Usergroup-Zeiten?",
      "start": 584145,
      "end": 593507,
      "confidence": 0.7591363636363635,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ah, das ist superschwierig generell zu sagen. Natürlich ist über Zeit die Gruppe immer ein bisschen gewachsen und somit natürlich auch unsere Base-Rate an Leuten, die kommen. Aber das Meetup hatte bis zum Corona-Ausbruch, ich sag immer so, immer zwischen 40 und 80 Leute jeden Monat. der das größte mieter was wir jemals gemacht haben waren glaube ich 190 oder 200 leute die da waren und man kann das relativ gut steuern und ich sag relativ in anführungszeichen weil ich nenne das immer computerbild themen sobald man ein thema auf dem meetup hat was kurz davor ist oder jetzt gerade als titel thema in der computer bild ist damals war das so responsive webdesign oder so ja das ist so ein massenthema oder agile projekt agiles projektmanagement mit scrum oder scrum im enterprise oder irgendwie sowas ja so dann hat man relativ großen zulauf und dann ist die bude auch voll geht man jetzt ich nenne es mal Auf ein Nischenthema möchte ich jetzt nicht sagen, aber vielleicht etwas spezielleres Thema, zum Beispiel sowas wie Replacing MongoDB with PostgreSQL oder Build Your Own Design System. Da merkt man schon, da ist der Zulauf geringer. Ich will aber auch nicht sagen, dass die Anzahl der Gäste irgendwie ein Indikator für ein gutes oder schlechtes Meetup ist. Ich sage nur, damit kann man das ein bisschen steuern. Und natürlich hat man immer noch das Riesenproblem von der sogenannten No-Show-Rate.",
      "start": 593567,
      "end": 677473,
      "confidence": 0.8138776371308019,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wie viel wie viel waren da zu den startzeiten dann da bei so einem event.",
      "start": 678368,
      "end": 683475,
      "confidence": 0.7466875000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Startzeiten da waren wir so fünf bis sieben bis zehn maximal das ist unser größerer meetingraum gewesen und da sind wir auch ein jahr drin geblieben bis dann mehr und mehr leute kamen genau.",
      "start": 683515,
      "end": 693107,
      "confidence": 0.8490882352941176,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wie ihr das dann übernommen habt, waren das schon so um die fünf bis zehn Leute, oder?",
      "start": 693848,
      "end": 699029,
      "confidence": 0.8401666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genauso, fünf bis fünfzehn.",
      "start": 699069,
      "end": 701130,
      "confidence": 0.8245,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also du hattest nicht mehr dieses Problem, einmal initial überhaupt eine stabile Gruppe zu bekommen. Du hast die schon übernehmen können?",
      "start": 701170,
      "end": 708471,
      "confidence": 0.7854285714285714,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Von der Perspektive, ja. Ob die Gruppe stabil war, weiß ich nicht. Man hat natürlich immer mal wieder familiäre Gesichter gehabt, aber es kamen auch immer wieder neue Leute.",
      "start": 708511,
      "end": 718513,
      "confidence": 0.8626551724137933,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weil das Schwierigste ist ja wahrscheinlich auch am Anfang mal überhaupt auf zehn Leute zu kommen, die regelmäßig zu einem Event kommen. Und du musst ja dann auch Gäste einladen. Also Leute, die irgendwie einen Vortrag halten.",
      "start": 718832,
      "end": 731615,
      "confidence": 0.7830540540540539,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Heutzutage sehe ich das gar nicht mehr so als schwierig an. Und der Grund ist folgender. Du machst dich, du registrierst dich auf meetup.com, erstellst eine Gruppe. Go User Group Nordrhein-Westfalen. Oder das ist vielleicht ein bisschen doof, weil Nordrhein-Westfalen recht groß ist. Okay, sagen wir einfach mal Go User Group Düsseldorf. Ja? Jetzt gehen wir schon zum Niederrhein. Merkste? Auf jeden Fall. Und du erstellst dann ein Event für in drei Wochen. Dann schickt meetup.com natürlich auch schon relativ viel E-Mails raus und macht Werbung dafür. Ja, also die haben auch so einen Recommendation-Algorithmus drin, dass dann sich schon ein paar Leute, zumindest der Gruppe, joinen. Ob die dann wirklich kommen, ist eine andere Geschichte. Thema No-Show-Rate. Sprechen wir, glaube ich, gleich auch nochmal drüber. Aber der Meetup-Algorithmus hilft da schon sehr, mindestens ein paar Leute hinzukriegen. Was natürlich immer hilft, dass wenn du schon mal ein paar Leute aus deiner Firma hast, die zum Beispiel Go machen, setzt euch einfach hin und macht das zum Ziel, dass ihr ein Talk für euch macht und ihr macht das einfach öffentlich und ladet Leute ein und dann schaut einfach mal, wie viele kommen. Der Anfang ist immer hart, ganz klar, man muss es aber durchziehen, wenn man denn das Ziel hat, und das ist ganz wichtig, wenn man denn das Ziel hat, eine Gruppe von 30, 40, 50 Leuten zu kriegen.",
      "start": 731635,
      "end": 805012,
      "confidence": 0.736917748917749,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was hast du da für No-Show-Rates, die sich auf meetup.com angemeldet haben und dann nicht aufgetaucht sind, so grob?",
      "start": 805052,
      "end": 811417,
      "confidence": 0.712315789473684,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Teilweise ist das schon hart, also teilweise schon wirklich bis zu 50%. Liegt aber unter anderem an vielen Faktoren. Liegt am Wetter. Haben wir sehr heißes Wetter, regnet es, ist es gerade sehr kalt. Obwohl die meisten Leute nur von der Bahn oder vom Auto dann ins Gebäude müssen. Es liegt daran, was für einen harten Tag die jeweiligen Leute hatten. Hatten die einen Ausfall auf der Arbeit? Müssen sie vielleicht Überstunden machen? Kommt irgendwas Spontanes dazwischen? Liegt an deren Motivation? Och nö, die Couch und Netflix ist grad besser. Liegt daran, was geht noch so ab in der Stadt? Vielleicht ein großes Rolling Stones Konzert oder ähnliches? Oder spielt Fortuna? Das war in Düsseldorf immer so eine Sache, wenn Fortuna spielt, dann starten die meist in der Woche zu selben Zeitpunkt wie das Meetup startet und somit sind die U-Bahnen sehr voll, weil in Düsseldorf fährt man eigentlich fast immer nur U-Bahnen, wenn man zu den Büros möchte. Und das ist dann auch so eine Thematik, also schaut drauf an, wie ihr angebunden seid und ob das Stadion auf dem Weg ist und in welcher Liga der Fußballverein spielt.",
      "start": 812106,
      "end": 867836,
      "confidence": 0.7770368421052631,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn du dir jetzt zurück erinnerst an die Anfangszeit, wo du das übernommen hast, was hast du denn da für ein so ein Event geplant? Was war denn da auf der Liste, die du so jede Woche dann durchgegangen bist? Was war zu organisieren? Und wie viel Zeitaufwand war das auch?",
      "start": 868142,
      "end": 883071,
      "confidence": 0.7720000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also jede Woche bin ich hier nicht durchgegangen. Wir hatten einen Meetup-Cycle von einmal monatlich und diesen haben wir auch über sechs, sieben, acht Jahre lang durchgezogen. Und das ist auch einer der Erfolgsfaktoren.",
      "start": 883491,
      "end": 893497,
      "confidence": 0.8360588235294119,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du meinst jetzt Konsistenz einfach durchzuhalten?",
      "start": 893537,
      "end": 895718,
      "confidence": 0.7763333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Durchzuhalten und durchziehen, nicht absagen. Das Problem mit den meisten Meetups ist wirklich, dass sie zwei Events machen, drei Events machen und dann aufhören. Das ist der Standard. Wenn eine neue Gruppe auf meetup.com hochkommt, machen sie ein Event, zwei, drei und danach hörst du nie wieder was von denen.",
      "start": 896238,
      "end": 910486,
      "confidence": 0.7647200000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was glaubst du, wieviel Events muss man durchziehen, bis man so irgendwie auf einem stabilen Level ist, dass auch dann die Leute kommen und dass sich das irgendwie angeschleift hat?",
      "start": 910986,
      "end": 921752,
      "confidence": 0.7665333333333335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Neun bis zwölf, also neun Monate bis zwölf Monate.",
      "start": 922555,
      "end": 925296,
      "confidence": 0.8609999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ein Jahr, dass man da durchhaltet, eine Trockenfase, bis es dann wirklich gut wird.",
      "start": 925476,
      "end": 931259,
      "confidence": 0.7372,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es geht auch schon nach vier Monaten aufwärts doch, du kennst das selbst, gute Meetups sprechen sich rum, interessante Talks, bis die Leute in der Gruppe mal joinen und dann sagen, oh, das ist ein interessanter Talk. Und nicht jeder Gast, der in der Gruppe ist, kommt zu jedem Talk, weil nicht jeder ist für die Themen interessiert. Nur, bis sich die ganze Sache mal rumspricht, bis man ein Netzwerk aufgebaut hat an Speakern, bis man ein Netzwerk aufgebaut hat an Locations, wo man das macht und so weiter. Aber da kommen wir gleich noch zu.",
      "start": 931299,
      "end": 956435,
      "confidence": 0.75909375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bleiben wir vielleicht gleich mal bei den Gästen. Wie hast du diese Gäste, also die Speaker gefunden? Vor allem, wenn man klein ist, ist das ja wahrscheinlich auch nochmal schwieriger.",
      "start": 956475,
      "end": 965305,
      "confidence": 0.7760999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Am Anfang habe ich sehr viel in der eigenen Firma herumgefragt, innerhalb von Trivago, weil wir waren damals so um die, weiß ich nicht, so 70 bis 130 Engineers, irgendwie sowas in einem Raum und mit Engineers meine ich auch Data Scientist und so weiter und so fort oder Designer. Da habe ich erstmal sehr viel herumgefragt, weil das erstmal ein einfacher Zugang war. Danach hab ich mit Leuten auf Meetup selbst gesprochen und dann hab ich die gefragt, hey, woran bastelst du gerade? Ja, ich probier grad CoffeeScript aus. CoffeeScript, für Leute, die sich erinnern, war auch mal so eine Art JavaScript-Dialekt, was dann in JavaScript übersetzt wurde. Gibt's immer noch. Ist, glaub ich, aber heute nicht mehr so hyped, weil es TypeScript gibt. Aber dann hab ich die Person gefragt, ob die nicht mal einen Einstieg 30, 45 Minuten in CoffeeScript machen kann. Und dann nächsten Monat hatten wir ein CoffeeScript-Talk.",
      "start": 965725,
      "end": 1010593,
      "confidence": 0.7320392156862746,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "War das einfach, die Leute zu überzeugen, dass sie einen Talk machen?",
      "start": 1010873,
      "end": 1013782,
      "confidence": 0.7070833333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das kommt auf die Person selbst an, wie extrovertiert, introvertiert diese Personen sind. Aber ich hab nie jemanden gezwungen. Ich hab gefragt, und wenn ein Nein kam, kam ein Nein. Aber was ich auch gemacht hab, ist, ich hab geguckt, welche Konferenzen sind denn zum Beispiel hier in Düsseldorf, und gibt's lokale Speaker? Oder ich habe Leute von anderen Meetups angesprochen, ob die nicht mal einen Talk haben wollen. Oder ich hab Leute auf Twitter in meinem Umfeld gefunden, und denen hab ich dann eine Direct Message auf Twitter geschrieben. Also wirklich, man könnte ab und zu sagen, Cold Calls wie im Sales, dass ich einfach den Mail gedroppt habe. Und ich war sehr überrascht, weil sehr viele Leute wollen das. Sehr viele Leute nutzen Meetups. Und das finde ich eine super Sache. Später hatte ich ein paar andere Techniken entwickelt, wie ich Leuten eine Chance ermöglicht habe, auch durch Meetups ihre Public-Speaking-Skills zu verbessern. Und hab's auch oft dann als Vorbereitung für größere Konferenztalks beworben möchte ich nicht sagen aber argumentiert und das hat sehr gut gezogen aber das heißt auch du.",
      "start": 1014265,
      "end": 1077394,
      "confidence": 0.8157868852459017,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast da schon viel zeit investiert und bist auch die leute aktiv angegangen nachgefragt immer wieder, noch mal nachgehakt und so weiter es war jetzt nicht so du hast es einmal irgendwo ernannt und dann hast du ganz viele einsendungen bekommen ich möchte den talk halten den talk halten sondern ist schon aktiv, Du musst dich um Speaker kümmern.",
      "start": 1077414,
      "end": 1095220,
      "confidence": 0.7760166666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Leute warten nicht darauf, dass jemand fragt und dann rennen die die Bude ein. Das funktioniert nicht.",
      "start": 1095240,
      "end": 1100546,
      "confidence": 0.7748888888888888,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was schätzt du, was ist so Zeitaufwand von pro Monat? Ungefähr jetzt nur mit Speaker kommunizieren und Speaker organisieren?",
      "start": 1100586,
      "end": 1108195,
      "confidence": 0.7540526315789474,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn ich jetzt so drüber nachdenke, würde ich dir wahrscheinlich sagen, es wäre nicht so viel, weil im Endeffekt sind es ein paar E-Mails droppen. Summa summarum sind das bestimmt schon ein paar Stunden, weil du musst natürlich ein bisschen Recherche machen, wer wird denn sprechen, wem hat man denn eine Erfolgschance, dass die Leute ja oder nein sagen. Ich sag mal so vier, fünf Stunden pro Meetup, bestimmt. Bauchgefühl, ja, inzwischen würde ich sagen, okay, das mache ich jetzt so nebenbei.",
      "start": 1108215,
      "end": 1134111,
      "confidence": 0.7710121951219511,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das ist ja nicht schwer, aktuell gibt es keine Events.",
      "start": 1134151,
      "end": 1137292,
      "confidence": 0.8154545454545455,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, aber wenn du einmal in dem Cycle drin bist und einmal die, Die Prozeduren kennst, also es hört ja nicht bei den Speakern auf. Du brauchst ja auch eine Location. Du brauchst ja vielleicht auch jemanden, der ein bisschen was zu essen stellt. Weil du musst dir vorstellen, die meisten Leute kommen von der Arbeit und fahren nicht mehr nach Hause. Die Leute haben dann letztes Mal um 1 Uhr oder 12 Uhr Mittag gegessen und dein Meetup startet um 18, 18.30, 19 Uhr. Die Leute brauchen irgendwas zu essen oder auch zu trinken. All das muss ja organisiert werden. Parkplätze, ordentliches Technik-Setup, Beamer, wie groß ist der Raum, hat die Person eine starke Stimme oder braucht man wirklich eine Audioanlage mit Mikro, etc. etc. Groß Intro-Slides, so nach dem Motto, hey, wir sind hier auf dem Web-Engineering-Meetup Düsseldorf, das passiert heute, das ist das nächste Meetup und wir danken unserem kleinen Sponsor Firma XY für das und hier liegen noch ein paar T3N-Hefte und so weiter und so fort. Also, da hört es ja bei den Speakers nicht auf, ja.",
      "start": 1137352,
      "end": 1191470,
      "confidence": 0.7655549450549455,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie hast du denn das gemacht? Jetzt, wenn du gesagt hast, am Anfang war das bei Trivago und Trivago hat, ich glaube, am Anfang hat es kein Essen gegeben, aber Getränke wenigstens. Später hat es dann so Pizza oder so auch gegeben, wenn ich mich richtig erinnern kann. Wie hast du denn sichergestellt, dass das nicht rüberkommt wie eine Trivago-Veranstaltung? Weil du hast gesagt, okay, du hast auch intern bei Trivago Leute rekrutiert, so als Speaker. Wie stellt man sicher, dass das nicht rüberkommt, als wenn das eine reine Werbeveranstaltung für Trivago wäre? Oder für einen anderen Sponsor, der halt Räumlichkeiten und so weiter stellt, wie es ja oft der Fall ist?",
      "start": 1192198,
      "end": 1223587,
      "confidence": 0.7212500000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin ehrlich, am Anfang habe ich das gar nicht sichergestellt. Ich habe einfach nur, ja, wir waren Trivago-Mitarbeiter und ja, wir haben das Meetup in den Büroräumen von Trivago gemacht. Und später haben wir auch gehört, nachdem wir das ein, zwei Jahre in den Räumen von Trivago gemacht haben, wir gehen mal wieder zum Trivago-Meetup. Das bedeutet, Trivago hatte davon natürlich schon ein paar Benefits. in Bezug auf Recruiting, Employer-Branding, lokale Tech-Szene in Düsseldorf und so weiter und so fort. Ihr müsst immer bedenken, wir reden hier gerade von 2013, 2014, 2015 und so weiter. Da war das noch nicht so mit jedes Start-up und so weiter und so fort. Und da war der Tech-Markt, der Recruiting-Markt noch nicht so wie er heute ist. Das waren andere Zeiten. Aber wir haben schon sehr viel gehört, oh wir gehen zum Trivago-Meetup. Und als ich das dann gehört habe, da habe ich dann angefangen mehr und mehr klarzustellen, dass das kein Trivago Meetup ist. Also Trivago hat hier kein Steak in dem Meetup. Trivago stellt die Räumlichkeiten. Trivago sponsort das Essen und auch den Meetup Account, weil der kostet als Organisator auch Geld.",
      "start": 1223627,
      "end": 1282706,
      "confidence": 0.8036562500000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie viel?",
      "start": 1282746,
      "end": 1283146,
      "confidence": 0.3805,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, ich habe jetzt für sechs Monate jetzt vor kurzem wieder 60 oder 70 Dollar gezahlt. Okay. Trivago hat dann diese Kosten übernommen und waren wir auch sehr, sehr dankbar für. Und dafür hat Trivago dann aber auch halt den Outreach bekommen. Und ich muss auch zugeben, wir haben über das Meetup, aber ich glaube auch locker zehn Leute angestellt oder ähnliches, die über das Meetup dann bei Trivago in jeweiligen Abteilungen angefangen haben. Und da nicht nur im Entwicklungsbereich, sondern auch im Marketing und im Data Science Bereich. Was wir aber dann später gemacht haben ist, weil ich das auch so ein bisschen wollte, um das ein bisschen aufzulockern, ich habe Kontakt aufgenommen zu anderen Düsseldorfer Firmen, Zipgate, Stepstone, SMS Group, Vodafone, Augsmoney und so weiter und so fort und habe mit denen gesprochen, hey wollt ihr nicht mal ein Meetup machen, wir sind die Webengineering Gruppe, wir sind aktuell bei Trivago, aber wir würden gerne monatlich mal die Location wechseln. Und so haben wir dann angefangen durch die location zu rotieren um den leuten natürlich auch die möglichkeit zu geben andere firmen kennenzulernen. Ich habe mein Netzwerk dann so ein bisschen erweitert und C, um auch die Gruppe ein bisschen diverser zu machen, weil du musst ja schon sagen, wenn heute Abend ein externes Meetup in deinen Büroräumen stattfindet, dann ist es natürlich leichter als Mitarbeiter, der noch nie auf einem Meetup war, zu dem Meetup zu gehen, weil du fällst ja eigentlich nur von deinem Schreibtisch dann in die große Küche oder in den großen Meetingraum und musst dich nicht erst ins Auto setzen und dann quer durch die ganze Stadt fahren, um zu irgendeinem fremden Meetup zu sein. Da sind wir dann Stück für Stück durch die Locations getingelt und monatlich haben wir dann die Locations gewechselt. Ja, Metro, ZipGate, PeakWork, SMS Digital, in der Typo3 GmbH waren wir, bei TWT, bei InVision.",
      "start": 1283186,
      "end": 1390722,
      "confidence": 0.796971698113207,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich kann mich noch erinnern, das war eine große Umstellung für mich. Früher bin ich da immer nur einmal gestolpert nach dem Arbeiten und war in einem coolen Vortrag und dann hast du mich da gezwungen durch die halbe Stadt zu radeln zu irgendeinem Gebäude woanders, aber im Endeffekt war es dann sehr cool, weil man halt andere Firmen auch kennenlernt und dort dann die die Teams von den anderen Firmen auch einfach mal kennenlernt und Dinge bequatschen kann die, die man sonst vielleicht gar nicht erreichen könnte diese Leute weil die natürlich nicht zu dir dann kommen.",
      "start": 1392203,
      "end": 1420894,
      "confidence": 0.7588979591836734,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das hört sich jetzt erstmal total positiv an und das war auch total positiv doch als Organisator ist das natürlich eine deutliche Umstellung.",
      "start": 1420934,
      "end": 1427776,
      "confidence": 0.730086956521739,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du meinst jetzt vom Aufwand her auch?",
      "start": 1428381,
      "end": 1430022,
      "confidence": 0.6168571428571428,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "A, vom Aufwand her, aber B auch, ich sag mal, von der Unsicherheit. Was Dominik und ich zum Beispiel gemacht haben, und das möchte ich ganz klar betonen, ich hab das Meetup nicht alleine gemacht. Ich hab das Meetup mit dem Dominik gemacht, und wir haben die Arbeitsaufteilung oft so gemacht, dass ich hab mich ums Organisatorische im Backoffice gekümmert, Speaker organisiert, Daten abgesprochen und so weiter und so fort. Und mein On-Site-Hero war dann der Dominik, hat dann super viel Arbeit on-Site gemacht. Wir haben eine Beachflag zum Beispiel, die wurde an einer entsprechenden Stelle aufgestellt, damit die Leute wissen, wohin die hin müssen. Der hat das Technik-Setup durchgecheckt. Der hat teilweise, wenn wir irgendwie so Name-Badges hatten oder sowas gemacht. Also ich habe das nicht alles alleine gemacht, das möchte ich nur mal ganz kurz erwähnen. Die Organisation hat sich ein bisschen erweitert in der Hinsicht, weil immer wenn man eine neue Location hatte, sind wir vor dem Meetup, also wirklich eine Woche oder zwei oder drei, da hingefahren und haben uns einmal den Raum angesehen. Wir haben uns einmal geguckt, okay, wie sieht die Leinwand aus? Wo stellt man einen Beamer hin oder hängt da schon ein Beamer? Haben wir ein Audio Setup? Wie sieht das Audio Setup aus? Wie kommen die Leute in das Gebäude, weil super viele Firmen haben eine strenge Rezeption mit Key-Badges und Security und so weiter und so fort. Wie einfach ist das Gebäude zu finden? Also wir waren immer einmal vor Ort, bevor wir der Firma zugesagt haben, um die Location anzugucken. Das bedeutet, wir müssen einmal da hinfahren, private Freizeit. Dann ist es natürlich so, du startest das Meetup. Wie läuft das da? Wie viel hat die Firma schon vorbereitet? Haben die dedizierte Leute für Event-Management? Oder machen wir das alles mit der Marketing oder mit der Employer-Branding oder HAA-Abteilung oder ähnliches. Und dann musst du natürlich auch die richtigen Erwartungen setzen. Ich hatte gerade von der No-Show-Rate gesprochen. Natürlich, die Firma schaut auch auf das Meetup, wie viele Leute sind da registriert. Sind da Leute, 80 Leute registriert, hoffen die sich natürlich, dass 80 Leute kommen. Was natürlich nicht der Fall ist, weil die meisten Meetups kostenfrei sind. Nein, nicht umsonst. Genau, nicht umsonst, aber gratis. Und das macht es natürlich sehr einfach auch ich melde mich mal an ich komme aber doch nicht und das ist natürlich für die planung suboptimal speziell wenn es an getränke kaufen geht speziell wenn es an essen geht ja natürlich kann man sagen ja ihr bestellt ja nur pizza nein es ist nicht immer nur pizza weil mit der zeit hat sich das geändert wo früher diese user grups ein kleines nerd treffen waren. hat sich das alles geändert zwischen eigentlich einem größeren Wissensaustausch, gesunderer Ernährung und allem drum und dran. Das bedeutet, wir haben dann natürlich jetzt oft je nach Firma auch kleine Buffets, nicht immer mit warmem Essen, aber hier vielleicht ein paar Sandwiches, dann Veganes, Vegetarisches und so weiter und so fort, weil die ganze Gesellschaft sich ja ein bisschen geändert hat. Und wenn man das jetzt für 40 Leute macht oder für 80, das ist natürlich schon eine Hausnummer. Also da spielt natürlich dann richtig Geld eine Rolle, Food Waste und allem drum und dran. ist dann alles eine schwierige Situation.",
      "start": 1430082,
      "end": 1599889,
      "confidence": 0.8062115732368901,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hast du über diese zehn Jahre irgendwie gemerkt, dass sich die Firmen auch anders verhalten, dass sie einen anderen Mehrwert jetzt auch sehen in solchen Meetups oder erkannt haben, dass es einfacher ist, Firmen zu bekommen als Sponsor oder als Location Sponsor im Vergleich von vor zehn Jahren?",
      "start": 1599929,
      "end": 1616317,
      "confidence": 0.8472083333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hundertprozentig. Der Grund ist ganz einfach, die erhoffen sich natürlich a, Employer Branding und Recruiting dadurch, dass sie dadurch neue Mitarbeiter finden. Weil speziell im Recruiting Bereich, für die Leute, die das nicht wissen, Recruiting ist unglaublich teuer. Wenn du einen externen Recruiter beauftragst, dir Kandidaten zu schicken und es kommt wirklich zum Interview und ihr stellt die wirklich ein, dann zahlt die Firma natürlich nicht nur das neue Gehalt für den neu eingestellten Softwareentwickler oder Softwareentwicklerin, sondern auch nochmal eine Gebühr. an den Rekruter, die dann oft, ich sag mal, 15 bis 40 Prozent des Jahresgehalts ist.",
      "start": 1617076,
      "end": 1652525,
      "confidence": 0.8408877551020405,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Brutto, vor allem, des Bruttojahresgehalts.",
      "start": 1652586,
      "end": 1654987,
      "confidence": 0.5096,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt mal angenommen, die ist einfach zu rechnen, die Person bekommt 100.000 Euro, was natürlich schon nach den Hausnummern ist, ist aber grad einfacher zu rechnen, dann bekommt der Rekruter nur für die Vermittlung 15.000 bis 40.000 Euro dafür, ja? Über diese Zahlen sprechen wir beim Recruiting von einer Softwareentwicklungsstelle. was hat dann die firma also für kosten wenn sie mit ab organisiert der raum ist jeder der meetingraum ist jeder die küche ist da dieses ding ist beheizt somit fällt das unter ferner liefen das ist ein anderes eine andere kostenstelle dann ein bisschen pizza oder ein bisschen buffet, 400 €, 300 €, sagen wir einfach mal so. Essen für 40 Leute. Dann vielleicht ein Mikrofon oder ähnliches. Kann man leihen. Viele Firmen haben sowas aber schon, weil die irgendwelche All-Hands, Town-Halls, Firmen-Events machen. Somit werden die irgendwo eine kleine Box haben und ein Mikrofon sowieso schon. So, und dann war es das eigentlich schon. Und vielleicht mal drei, vier Leute ein paar Überstunden zahlen, dass sie halt von 18 bis 23 Uhr dann noch arbeiten. Also ein paar Überstunden für vier Leute intern. Das sind dann so primär die Kosten, weil die drucken ja keine großen Banner. Die schicken ein paar E-Mails und so weiter und so fort. Klar, es ist auch ein bisschen Arbeitszeit für die, aber das ist ja deren Job, wenn wir von der Employer Branding und von der Personalabteilung, von der Recruiting sprechen. Das ist ja deren Job, somit ist das ganz normale Arbeit für die. Und somit halten sich die Kosten dann eigentlich im Rahmen, wo dann die harte Arbeit auch von uns Organisatoren ausgeht. Speaker finden, einmal die Location checken, ist das was, mit den Leuten organisieren, Expectation Management, dass es diese No-Show-Rate gibt, dass es nicht heißt, wenn 80 Leute registriert haben, dass 80 Leute kommen. dass wir denen kein Hiring versprechen können und so weiter und wirklich auch abchecken, was denn deren Motivation ist. Und ich spreche dann ganz offen mit denen, hey, warum macht ihr das, ja? Und wenn die sagen, ja, wir wollen die Tech-Szene stärken, meine ich so, ist das jetzt wirklich so oder wollt ihr wirklich hier Employer-Branding machen und die Firma nach vorne bringen, ja? Das bedeutet, ich möchte halt wirklich die wahre Motivation, weil das ist ja nichts verkehrtes. Und dann limiten wir die auch und sagen, hey, pass mal auf, Was wir euch anbieten können ist, wir machen das hier und ihr könnt dann auch für zwei, drei Minuten ganz kurz sagen, wer ihr in der Intro-Speech, wer ihr seid, warum ihr dieses Meetup macht. Da habe ich dann immer so ein paar Tipps gegeben, dass ihr keinen Sales-Pitch machen sollt, weil niemand interessiert, wenn in 25 Minuten ein CEO über die Firma spricht, wie toll sie ist, sondern halt wirklich, was ist die Motivation dahinter, wer sind die und so weiter und so fort.",
      "start": 1655007,
      "end": 1808824,
      "confidence": 0.7567219917012451,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn wir gerade da sind und du sagst, okay, die können ein Salespitch machen, hast du da sonst irgendwie Tipps für die Firmenseite, wie die auftreten sollen bei so einem Meetup? Welche Leute oder schicken die die Marketingleute, HR-Abteilung oder wie läuft das am besten ab von der Firmenseite?",
      "start": 1809164,
      "end": 1829616,
      "confidence": 0.7705918367346939,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich würde sagen Content-First und mit Content-First meine ich wirklich Themen gebunden. Das bedeutet schickt die Softwareentwickler dahin schickt Leute die wirklich Ahnung von der Materie haben und fokussiert euch aufs Content und sagt nicht immer wie geil ihr seid und was ihr tolles macht, weil ein Obstkorb juckt heute keinen mehr, umsonst Kaffee juckt halt auch kein Softwareentwickler mehr. Also ihr müsst jetzt nicht das komplette Benefit-Programm von euch durchjuckeln. Macht Content first. Sagt, was ihr seid. Habt ihr ein interessantes Produkt. Ihr könnt auch gerne sagen, dass ihr hiert. Das ist ja kein Geheimnis. Und sofern die Leute interessiert sind, werden die Leute sich entweder über die Firma selbst informieren oder auf euch zukommen. Versucht, das nicht im klassischen Blast-out-Marketing in die Köpfe zu ballern. Die meisten Entwickler sind allergisch gegen sowas. Und da zerstört ihr euch mehr. Deswegen Content-first. Stellt interessante Projekte vor, interessante Technologien, interessante technische Herausforderungen, interessante Projekte. Und ab da geht's halt weiter. stellt ein paar Connections her zu Leuten, die da wirklich arbeiten. Und nicht immer nur die Engineering Manager oder Vice-Presidents oder Directors oder irgendwelche Abteilungsleiter, sondern auch wirklich die Individual Contributor, die mal wirklich was erzählen können, was geil ist. Aber auch ganz offen und ehrlich sagen, ja, pass mal auf, das hier ist nicht so geil, aber hey, wir arbeiten daran. Wir deployen nur einmal die Woche. Ist scheiße, wissen wir selbst. aber wir haben herausforderung 1 2 und 3 weil wir ein großes mono repo haben und deswegen die applikationen immer so lange zum testen braucht etc und er spricht halt ganz offen ehrlich auch über die herausforderung weil auch bei einem firmenwechsel sagt man immer woanders ist auch kacke von daher.",
      "start": 1829656,
      "end": 1931228,
      "confidence": 0.7969010600706715,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich muss auch sagen, von Besucherseite, das war mir eigentlich immer wichtig und das war auch sehr sympathisch, dass das nie irgendwie übertrieben war. Ich kann mich mal erinnern an ein Meetup, das ich in Amsterdam besucht habe von einer japanischen Firma, die dort ein Office hatte. Und dort ist man reingekommen und dann ist man schon begrüßt worden von jemandem von HR. persönlich mit Händedruck und so weiter, das war zwar ganz nett, aber es hatte schon so einen Beigeschmack, wo ich mir so irgendwie gedacht habe, okay, bin ich da jetzt bei einer Recruiting-Veranstaltung. Die Speaker waren gut und es war dann, hat schon alles gepasst, aber es war schon für meinen Geschmack einfach zu übertrieben und zu organisiert und zu HR-lastig. Und dann, wenn man sich halt so fühlt, als wäre man auf irgendeiner Recruiting-Veranstaltung, dann macht das einfach keinen Spaß mehr. Also ich finde auch, umso defensiver das ist und wenn ich dann zufällig mit einem Developer ins Gespräch komme und rausfinde, das ist eine super Firma, dann hat das für mich persönlich viel mehr Wert, als wenn mich da irgendein HR-Mensch anspricht auf so eine Veranstaltung.",
      "start": 1931577,
      "end": 1987925,
      "confidence": 0.7722722513089004,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hatte gerade von unserem größten Meetup kurz gesprochen, da waren so, was hatte ich gesagt, 150, 190 Leute, irgendwie sowas. Und da ging es halt um agiles Projektmanagement und da kamen auch super viele Leute, aber das wussten wir schon, hatten dann entsprechend halt eine größere Räumlichkeit organisiert. Und da sind dann auch ein, zwei Rekruter aufgetaucht, die dann wirklich zu jedem Gast gegangen sind. Hey, suchst du einen neuen Job? Wirklich aggressiv mit der Visitenkarte gewedelt haben und so weiter und so fort. Und die habe ich dann einmal verwarnt. Einer von denen hat es dann ernst genommen und hat dann aufgehört. Die andere Person hat nicht aufgehört und die habe ich dann auch rausgeschmissen. Weil natürlich ist ein lokales Meetup für Rekruter natürlich auch gefundenes Fressen. So wie ihr das kennt, ihr kriegt die Zing-Nachricht oder LinkedIn-Nachricht. Hey, hast du Lust auf ein Telefonat? Nein, habe ich nicht. Gib mir einfach alle Details. Auf einem Meetup haben die Recruiter natürlich direkten Zugang zu den Leuten und können dieses Gespräch entwickeln, verwickeln. Und nach der ersten Verwarnung hat diese Person halt nicht aufgehört. Dann habe ich dann halt, ich sag mal, mein Hausrecht genutzt und habe die Person des Meetups verwiesen, weil ich möchte halt, dass es auch eine sichere Umgebung ist, wo sich jeder auch sicher fühlt. Das Meetup ist nicht primär fürs Recruiting, sondern primär für den Wissensaustausch unter Leuten, die ein ähnliches Handwerk ausüben.",
      "start": 1988292,
      "end": 2057650,
      "confidence": 0.7592426778242681,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hast du da dann irgendwie Regeln aufgestellt diesbezüglich, weil du sagst Verwarnung, also hast du da irgendwie Regeln gehabt für Recruiter oder eben, dass keine Recruiter da sein sollen oder wie hast du es gehandhabt?",
      "start": 2057969,
      "end": 2068054,
      "confidence": 0.7206571428571431,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, Recruiter können ja kommen. Das ist ja nicht das Problem. Diese Menschen haben ja auch das Recht zu lernen. Und ich erzähle ihnen auch gerne, wie Software Engineering funktioniert. Ich fände das ja toll, wenn die zum Beispiel auch in die Industrie kommen. Nur, was ich vermeiden möchte, ist, dass sie, ich sag mal, Leute in Anführungszeichen bedrängen. Nur damit, nur weil sie dann halt das große Geld wittert. Das möchte ich halt. Ja, ich möchte halt eine sichere Umgebung.",
      "start": 2068428,
      "end": 2090054,
      "confidence": 0.7331481481481482,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber hast du das irgendwie kommuniziert? Oder hast du da Regeln irgendwie aufgestellt, die du auch kommuniziert hast? Oder war das einfach Common Knowledge?",
      "start": 2090094,
      "end": 2097598,
      "confidence": 0.6851249999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich glaube, ich war da ein bisschen pragmatischer, und heute würde ich es vielleicht anders machen. Also, wir haben jetzt keinen richtigen Code of Conduct oder ähnliches niedergeschrieben. Ob das jetzt Common Knowledge war, für mich war das Common Knowledge, aber du weißt ja, wie es ist. Was für mich Common Knowledge ist, heißt nicht, dass es für dich Common Knowledge ist. Und somit haben Dominik und ich das eigentlich so betrieben, wie wir das gerne hätten, und haben es nie explizit irgendwie auf irgendeiner Webseite Code of Conduct gemacht. Aber wir müssen auch zugeben, es soll jetzt keine Ausrede sein, Wir haben ja keine Webseite in dem Sinne. Wir haben ja nur diese meetup.com Page. Natürlich können wir das da verlinken und so weiter und sollten wir dann auch mal machen. Haben wir nicht getan. Den Schuh ziehe ich mir gerne an bisher.",
      "start": 2097917,
      "end": 2138588,
      "confidence": 0.7596068965517242,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn ich mir das so vorstelle, dass das ja wirklich ein großes Business ist, auch für Recruiter und Firmen und das sehr schwierig ist, dann wäre das ja auch eine gute Möglichkeit eigentlich da vielleicht Geld zu verlangen für so ein Meetup, wenn man bei irgendeiner Firma ist, also dass es nicht nur das Sponsoring ist, sondern dass die auch vielleicht was bezahlen für die Organisation. Habt ihr mal darüber nachgedacht oder kennst du andere Meetups, die die Geld verlangen wirklich für das Meetup selbst, für die Organisation zum Beispiel?",
      "start": 2138802,
      "end": 2163607,
      "confidence": 0.7880888888888888,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Habe ich darüber nachgedacht? Natürlich habe ich darüber nachgedacht, ob man die ganze Sache monetarisieren kann. Habe ich es verworfen? Ja, habe ich auch. Und der Grund ist ganz einfach die initiale Motivation und der initiale Drive, warum wir dieses Meetup gemacht haben. Und zwar damals, 2012, 2013, wo ich dann als Teilnehmer in diesen Meetups war. war meine motivation zu lernen mich mich über themen über die ich wirklich um die ich mich kümmere um die ich liebe wo ich spaß dran habe ich mit anderen auszutauschen um zu erfahren was die für herausforderungen haben und diese motivation hat sich natürlich immer und immer und immer weitergezogen so habe ich natürlich auch die die speaker ausgewählt so habe ich natürlich auch die themen ausgewählt immer ich habe immer themen genommen, wo ich dann auch was mitnehmen kann eigentlich haben wir das meter betrieben so zu den themen wo dominik nicht wirklich bock drauf hatten und es scheint so als haben wir dann irgendwie ein bisschen zahn der zeit gefunden bei ein paar leuten und die tinken so ähnlich wie wir ob das jetzt gut oder schlecht ist für die diversität weiß ich jetzt nicht aber wir haben uns nie davon leiten lassen was jetzt gerade in der computer bild oder bei heise grad durch die welle getrieben wird. ist das das richtige weiß ich nicht haben wir es deswegen haben wir es auf jeden fall nicht monetarisiert wir sind aber auch ehrlich über die zeit haben wir uns gefragt warum machen wir das denn noch weil wenn du sowas sieben oder acht jahre machst schleicht sich so eine gewisse routine ein und irgendwann schwenkt es um von hey ich habe richtig viel spaß das zu organisieren zu ich muss mal wieder organisieren also zur arbeit Und da bin ich auch ehrlich, die Corona-Pandemie, so schlimm wie sie auch ist und bzw. war, weiß nicht, sagt man schon, die ist rüber, die ist um, weiß ich nicht, Österreich und Holland haben ja diese Corona-Apps abgeschaltet, Deutschland hat jetzt keine Maskenpflicht aktuell mehr, aber das ist schon wieder in Diskussion, als wenn es schon wieder eine Maskenpflicht geben wird. Also ich weiß nicht, ob die Corona-Pandemie schon wieder um ist oder nicht, ist ja auch egal. Wir waren so ein bisschen, in der Organisation vielleicht auch froh, mal eine Pause zu haben, vielleicht eine gezwungene Pause, aber wir waren so, oh, das fühlt sich ja jetzt mal schön an, ja. Aber wir würden halt auch gerne mal wieder als einfacher Gast zu einem Meetup gehen und da haben wir schon gemerkt, dass super viele Meetups, hatte ich ja gerade schon erwähnt, nach einer Zeit aufhören, ja, und nicht so konsistent durchziehen. Monetarisieren. Kenne ich Meetups, die es monetarisieren? Schwer zu sagen. Die Organisatoren, mit denen ich so zu tun habe, sind so auf einem ähnlichen Zug wie ich. Reine Motivation, reines Learning. Es gibt ein paar Events, die Meetup-ähnlichen Style haben. Nennt sich Pitch Club oder ähnliches. Da fließt auch richtig viel Geld. von den Organisatoren. Das ist aber ganz klar Recruiting-Fokus. Auf der anderen Seite kann ich es auch nicht hundertprozentig verneinen, dass ich Leute kenne, die das monetarisieren, weil ich das nicht wirklich weiß, weil über sowas selten gesprochen wird. Könnte man Geld von den Organisatoren, von den Firmen verlangen? Hey, pass mal auf, ich zieh dir jetzt 100, 150, 500 Euro aus der Nase, deswegen organisiere ich hier ein Meetup. Ich denke das würde gehen ja ich denke ein paar Firmen würden das machen. Ich denke aber auch viele würden abspringen. Aber ich will ich mache es nicht ich habe es jetzt auch nicht vor. Meines Erachtens nach geht das gegen den Style und gegen die initiale Motivation weil ich auch sehr Community-Driven bin, sehr Open-Source-Driven bin und ich weiß nicht ich es fühlt sich ich fühlt sich falsch an.",
      "start": 2164094,
      "end": 2359340,
      "confidence": 0.780014018691589,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hast du schon gesagt, am Ende war so ein bisschen die Luft raus, auch vor Corona schon. War das dann der Grund, warum du den nächsten Schritt gemacht hast und dann eine Konferenz aufgezogen hast, weil es zu langweilig war, das Meetup?",
      "start": 2359838,
      "end": 2373365,
      "confidence": 0.8040930232558137,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn du das so sagst, hört sich das schlimm an. Aber ja, genau das war der Grund. Die organisation von meetup war so auch ich mach das mal eben eben nebenher und das meine ich jetzt ich möchte die arbeit nicht runterspielen ich möchte nur sagen Dominik und ich und die firmen wir haben uns eingespielt umso mehr man sowas macht, umso flüssiger läuft das ich hatte ein gutes speaker netzwerk ich wusste wie ich relativ schnell speaker kriege, Ich wusste, dass ich immer eine Location habe. Terminabstimmung waren zwei E-Mails. Das hat alles, ich sag mal, auf gut Deutsch geflubbt. Irgendwann hab ich mich gefragt, was ist der nächste Schritt? Ich will das nicht unbedingt größer machen, weil große und kleine Meet-ups beziehungsweise Stammtische, das sind zwei verschiedene Themen. Man hat eine Gruppe, mit der man sich trifft, austauscht, vertraut das Environment. Oder man macht ein größeres Meet-up, das wird immer anonymer. Das ist auch ein Thema, über das wir sprechen können. wollte ich mal wieder eine herausforderung haben und dann haben wir gesagt lass uns mal eine konferenz starten und dann war der war die erste fragestellung ja was ist denn bei unserer konferenz eigentlich anders als bei anderen konferenzen und das war eine große herausforderung das zu finden aber wir haben es dann später heraus herausgefunden und zwar was wir gemacht haben wir haben die local host konferenz gegründet Die Domain ist immer noch online, nennt sich localhost.engineering. Meines Erachtens noch einer der geilsten Domains, die wir je gekauft haben. Auf jeden Fall war das eine Eintageskonferenz von der Community für die Community. Wir haben die komplett organisiert. Wir hatten einen Speaker aus dem JavaScript-Bereich, Infrastruktur-Bereich. Wir hatten jemanden von Google da, aus Amsterdam. Wir hatten Kyle Simpson da im JavaScript-Bereich. Sehr, sehr großer Name. Alles eine super Sache. Wir haben den Speakern Hotels bezahlt. Wir haben die Tickets enorm günstig angeboten. Ich weiß gar nicht mehr, was der Ticketpreis war. 10, 15 Euro? 20 Euro? Irgendwie so was. Und wir haben 0,00 Euro daran verdient. Jetzt sagt ihr, ja, das kann ja jeder sagen. Ja, das ist stimmt. Wir haben aber auf der Local Hosted Engineering alles transparent gemacht. Das bedeutet, dort findet ihr ein Listing von wie viel Euro wir für Travel and Accommodation, für Essen, für Operations, also das bedeutet Shirts, Adapters, Speakergeschenke usw. ausgegeben haben. Das findet ihr alles da und Wir haben also eine Community-Konferenz erzeugt für einen Tag, ich glaube mit sechs oder sieben Talks. Wir haben die Talks alle aufgezeichnet und alle auf YouTube gestellt. Wir haben alles transparent gemacht. Wir haben nichts versteckt und das kam sehr gut an. Und es war eine Herausforderung, muss ich zugeben.",
      "start": 2373385,
      "end": 2537867,
      "confidence": 0.8001897321428574,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wo siehst du den großen Unterschied zu einem Meetup von der Organisationsseite?",
      "start": 2538280,
      "end": 2542082,
      "confidence": 0.7076666666666668,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist einfach eine, wie sagt man so schön in unserer Industrie, eine Order of Magnitude Higher. Es ist eine andere Liga. Du musst nicht ein Talk oder zwei Talks, was jeweils eine halbe Stunde für einen Abend organisieren und wo viele Organisationen natürlich auch auf die Location abgedrückt werden. Hier musst du wirklich alles machen. Das bedeutet, wie verkauft man Tickets? Wie macht man die ganze Sache steuerlich? Wie organisierst du die Reisen für die Speaker? Organisieren die sich hier selbst? Kommen die selbst zur Location? Oder musst du irgendwas für die buchen? Du musst mit Hotels sprechen. Welches Hotel hast du? Kriegst du vielleicht irgendeine Art Sonderpreis, wenn du schon irgendwie sechs oder acht oder zehn Zimmer vorher nimmst? Du musst Essen ordern. Du musst gucken, dass das Essen ordentlich da ist. Du musst die Technik checken. Du musst eine Location für den ganzen Tag entweder mieten oder bereitstellen und wir haben das zum Beispiel, ich glaube, an einem Samstag gemacht. Das bedeutet, auch wenn du ein Büro nimmst, muss da ja Personal sein, da muss da Security sein, Rezeption, du musst eine Reception haben, wo die Leute ankommen, du musst Helfer haben, du musst, was passiert, wenn der Strom ausfällt, du musst überall Mehrfachstecker-Dosen haben, du musst Räume haben, wo die Leute sich zusammensetzen können, du musst Getränke haben, vielleicht hast du eine Barista da, die dir einen Kaffee macht oder einen Tee und so weiter und so fort, ja, also das ist nochmal eine ganz andere Liga.",
      "start": 2542142,
      "end": 2624903,
      "confidence": 0.774772908366534,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hast du da irgendwie das Meetup nutzen können in irgendeiner Form, außer dass du jetzt weißt, wie Meetup-Organisation funktioniert?",
      "start": 2625493,
      "end": 2632279,
      "confidence": 0.6865789473684208,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich habe von der Organisation natürlich vom Meetup sehr, sehr viel gelernt und sehr viel anwenden können auf die Konferenz. Und ja, wir haben das konstant beworben, weil die Konferenz wurde primär von zwei Meetups aus Düsseldorf organisiert. Einmal den Webengineering Düsseldorf und einmal von den Webworkern NRW. Das Webworker NRW Meetup wird vom vom Shep gemacht und der hat sich da stark mit eingeklinkt und wir haben es dann konstant auch über die Meetups beworben, weil das war ja auch eine Konferenz, die von uns Meetup-Organisatoren organisiert wurde. Wir hatten Spaß, war aber auch richtig viel Arbeit. Es war auch im Nachhinein noch Arbeit, nicht nur Aufräumen an dem Tag, sondern die komplette Abwicklung, Rechnungen bezahlen, die ganze Sache steuerlich verpacken. Ich hatte dann hier noch ein paar Diskussionen mit meinem Steuerberater und mit dem Finanzamt. weil ich das alles um mein Gewerbelaufen habe und so weiter. Passt das? Passt das nicht? Ging bisher noch alles durch, aber das hört nicht auf. Ja, dann die Videos editen, auf YouTube stellen, vielleicht nochmal ein Dankeschön an die Speaker, ein paar Statistiken teilen und so weiter und so fort. Ja, also das ist nicht so, ach, wir haben jetzt hier aufgeräumt und jetzt ist alles gut. Ne, da ist noch richtig viel Malorien hinten dran.",
      "start": 2632780,
      "end": 2697265,
      "confidence": 0.7806883720930233,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wenn du jetzt sagst, du weißt nicht, ob du es nochmal machen würdest, muss ich dich jetzt gleich korrigieren, weil ich war da ja auch involviert in dem Ganzen und wir haben gemeinsam beschlossen, dass wir es auf jeden Fall wieder machen wollen. Das war noch zu Corona-Zeiten, also vor Corona-Zeiten. Drum ist da jetzt viel Wasser rein. Den Rhein, naja, bei uns ist es kein Rhein, aber egal, der hat den Rhein hinuntergeflossen. Aber unsere Entscheidung und auch auf der Webseite steht, wir machen das irgendwann, irgendwann wieder.",
      "start": 2697648,
      "end": 2725797,
      "confidence": 0.7443333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das stimmt. Wie gesagt, Zeiten haben sich geändert. Ich weiß es noch nicht, ich weiß es noch nicht. Genauso wie mit dem Meetup. Wir haben jetzt seit März 2020 keine Meetups mehr gemacht. Und jetzt war ich in den letzten Tagen in Kontakt mit dem Meetup-Organisator vom WebWorker NRW. Grüße an den Chap nochmal. Und da kam auch die Idee, ob wir jetzt diesen Sommer noch mal ein, zwei Sessions machen. Wir hätten auch schon Locations und den einen oder anderen Speaker hätten wir auch schon ready. Ich weiß noch nicht. Auf der einen Seite hätte ich mal wieder Bock, auf der anderen Seite muss ich auch ehrlicherweise zugeben, dass ich mich nach sechs, sieben, acht Jahren, zehn Jahren die ganze Sache frage, wofür mache ich das eigentlich? weil die motivation oben zu halten ist schon nicht einfach besonders die negativen seiten auf der einen seite da habe ich natürlich sehr viel dafür dazu gelernt und immer die talks zu machen und zu sehen ist es ist auch immer so eine super erfahrung und ich habe auch super viel positives feedback von den speakern bekommen, die sehr dankbar waren, was wir für eine Chance denen denn ermöglicht haben, ihren Talk mal für zum Beispiel eine Konferenz zu üben und ähnliches oder mal über ein Thema zu sprechen, was ihnen am Herzen liegt. Alles super, ja, und das freut mich auch immer. Im Vorhinein ist es jedoch doch schon noch ein bisschen Arbeit, das darf man nicht wegreden. On-Site ist man schon immer enttäuscht, wenn sich 100 Leute angemeldet haben und dann 30 oder 40 Leute kommen, weil es gerade ein schöner Tag ist, ohne irgendwie mal abzusagen oder zwei Minuten vorher absagen. Das drückt schon sehr auf die Motivation. Und dann, falls man es irgendwie auch mal nicht geschafft hat, die Erwartungshaltung von der Firma, die dann zum Beispiel die Räumlichkeiten sponsert, richtig zu setzen, sind die auch enttäuscht und dann geht man da irgendwie mit so einem Mulmeln da raus. Also ist, und man, auf der anderen Seite, man opfert natürlich auch private Abende dafür und allem drum und dran. Man ist jetzt nicht immer um 9 Uhr dann zu Hause. Also das sind auch schon die negativen Seiten, ja. Und wir hatten uns auch schon überlegt, ob wir nicht ein Eintrittsgeld geben, so nach dem Motto, okay, wenn du nicht anmeldest, zahlst du einen Zehner und du kriegst dann, weiß ich nicht, 5 Euro, wenn du wieder rein, wenn du, wenn du wirklich da bist, kriegst du 5 Euro zurück und 5 Euro geht dann irgendwo auf einem Source Foundation als Sponsoring. haben wir auch schon überlegt um gefühlt ein bisschen dieser dieser hohen no show rate entgegen zu wirken aber immer wenn geld involviert ist es ist immer so ein bisschen schwierig und ich weiß auch nicht ob das dann wirklich der richtige weg ist weil wir wollen auch leuten die sich das gegebenenfalls nicht leisten können die möglichkeit geben, zum meetup zu kommen und zu lernen oder einfach nur leute die möglichkeit geben vielleicht diese überlegen in die softwareentwicklungsindustrie zu wechseln als quereinsteiger und gar nicht so wissen ist das was für mich dass sie einfach dahin kommen und einfach was lernen deswegen alles schwierig vielleicht bin ich auch zu idealistisch unterwegs ich weiß es nicht liebe hörerinnen und hörer gebt mir mal feedback was ihr dazu denkt aber Das möchte ich nun mal als negativen Aspekt in die Welt schießen, dass als Organisator die Motivation schon sehr drückt und man deswegen schon überlegt, ob man nicht ganz aufhört mit sowas.",
      "start": 2725837,
      "end": 2904923,
      "confidence": 0.7844312080536917,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also man sieht schon, es ist nicht so einfach und nach zehn Jahren die Motivation zu behalten ist scheinbar auch nicht so einfach. Also an alle, die die nächste Generation vielleicht, die jetzt sich überlegen, ein Meetup zu starten. Und falls ihr irgendwo in Düsseldorf unterwegs seid, hint, hint, vielleicht wäre jetzt eine gute Möglichkeit, einen Andi anzuschreiben und vielleicht irgendwas zu übernehmen. Könnte man ja profitieren von so einer Gruppe. Jetzt könnte eine gute Möglichkeit sein. Aber sonst, wenn jetzt jemand so ein Meetup starten will, ganz neu, nächste Generation, vielleicht bist du einfach zu alt, Andi, stellt sich wahrscheinlich jetzt auch mal die Grundfrage, macht man das offline oder hybrid oder ist sowieso nunmehr alles online? Vielleicht auch da die Frage, was war die Entscheidung oder was war der Grund, dass ihr jetzt nicht online gegangen seid während Corona?",
      "start": 2905753,
      "end": 2958245,
      "confidence": 0.8201418439716311,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist derselbe Grund, warum wir die Talks auch im Meetup nicht aufzeichnen. Ich denke, es ist sehr wichtig, on-site zu sein und auch die Gespräche vor dem Beginn der Talks mitzuerleben und auch daran teilzunehmen und danach. Es geht so ein bisschen um Netzwerke. Es geht dabei um eine lockere Atmosphäre, vielleicht eine Cola, ein Wasser oder vielleicht auch ein Bierchen oder einen Radler zu trinken. und einfach über über Gott und die Welt und einfach mal vielleicht auch über schwierige Themen wie Emacs oder Wim, Whitespaces oder Tab, war es auch ordentlich zu diskutieren. Und ich habe noch nie erlebt, dass im Online-Meetup-Environment das wirklich ans Fliegen geht. Entweder hast du eine sehr kleine Gruppe, die sehr eingeschworen ist und dann immer da ist, wo man dann als Neuling relativ schwer hat, da reinzukommen, so bei fünf, sechs, sieben Leuten im Zoom oder Google Meet, Oder man hat eine sehr anonyme Gruppe, die sehr groß ist, wo dann zum Beispiel ein Thema besprochen wird und dann 90% der Leute sich für dieses Thema gar nicht interessieren.",
      "start": 2958721,
      "end": 3015895,
      "confidence": 0.7854887640449437,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also du würdest auf jeden Fall offline präferieren demnach?",
      "start": 3016135,
      "end": 3020396,
      "confidence": 0.7218888888888889,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, wir präferieren 100% offline.",
      "start": 3020436,
      "end": 3023057,
      "confidence": 0.5718,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und du würdest dann auch einem Newbie, der jetzt startet, mit einem Meetup auch offline empfehlen dementsprechend?",
      "start": 3024044,
      "end": 3029746,
      "confidence": 0.694764705882353,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das kommt immer ganz aufs Ziel an. Ich persönlich denke, speziell jetzt in dem Remote-Environment, wir sitzen acht Stunden teilweise remote zu Hause vor dem Computer, machen eine Pause, allem drum und dran, und dann sich abends nochmal vor den Computer zu setzen, um dann nochmal an einem Talk zu sitzen, weiß ich nicht. Es ist anstrengend für den Kopf, es ist anstrengend für den Augen, besonders bei Videocalls ist es immer so eine Sache. Weil auch wenn ich einen Talk hier am Computer gucke oder am Fernseher, ist es halt so, ich mache halt immer was dabei. Ich mache halt immer was nebendran und fokussiere mich gar nicht so wirklich auf den Talk. Wohingegen du bei einem lokalen Meetup oder bei einer Konferenz dir ja natürlich explizit Zeit nimmst fürs Lernen. Du gehst da hin, setzt dich auf einen Stuhl und reservierst dir wirklich Zeit, dir den Talk anzusehen und fokussierst dich darauf. So ähnlich wie darum, du setzt dich aktiv mit einem Buch in den Garten, um zu lesen. Das, finde ich, ist ein wichtiger Unterschied.",
      "start": 3029786,
      "end": 3075837,
      "confidence": 0.7395955056179782,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber durch Corona sind jetzt auch extrem viele Meetups online und die kann jetzt natürlich irgendwelche extrem coolen Meetups in New York, in weiß weiß wie wo, in irgendwelchen Google Headquarters oder so plötzlich mitverfolgen, was früher einfach nicht gegangen ist, weil das halt wirklich nur vor Ort bei der Location möglich war. Glaubst du, dass das jetzt irgendwie mehr Konkurrenz ist, dass es jetzt schwieriger ist, wenn du ein Offline-Meeting machst, dass da gar nicht mehr so viele Leute hingehen, weil die einfach zu faul sind, weil sie sagen, kann ich eh online irgendwo schauen und vielleicht noch die cooleren Speaker als irgendein Local Speaker?",
      "start": 3076137,
      "end": 3109721,
      "confidence": 0.7844339622641507,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also das ist natürlich auf jeden Fall ein enorm großer Vorteil, dass du jetzt Zugriff auf fast alle Meetups hast, die es online machen. Es ist deutlich einfacher, Speaker zu finden, auch als Organisator, weil die können sich einfach von zu Hause einloggen. Gar keine Argumentation, das ist super. Von Konkurrenz spreche ich bei Meetups generell nicht. Der Grund ist ganz einfach, Meetups, Offline-Meetups, ganz wichtig, sind regional begrenzt. Wir haben keinen Hockey-Stick-Growth, wir können nicht skalieren, weil wir regional begrenzt sind. Und das ist auch okay. Es kommt darauf an, was du für eine Motivation hast und ob du es als Konkurrenz siehst. Willst du das Meetup monetarisieren, natürlich hast du dann Konkurrenz. Umso mehr Meetups in einer Stadt sind, umso weniger Leute kommen wahrscheinlich zu deinem monetarisierten Meetup, weil diese bereits gesättigt sind. Machst du es aus Community-Gedanke, machst du es aus Lern-Gedanke, dann ist dir eigentlich die Anzahl der Leute, Egal, und du freust dich eigentlich um jedes andere Meetup, was sowas ähnliches macht wie du, damit du einfach mal als Organisator auch als zum Gast, als zum anderen Meetup gehen kannst. Deswegen ist das eher eine tolle Sache, dass andere Leute dieses Movement mittreiben. Ähnlich wie Open Source, ja, ich find das super. dass wenn es zu einem problem vier lösungen gibt ja dann hast du die wahl ist macht das die ganze zeit komplizierte zu wählen was der beste tool ist ja aber hatten jeder andere anforderung ja natürlich deswegen spreche ich bei diesen art von offline meetups nicht von konkurrenz ich finde das toll wenn leute online meetups Ich war auch schon mal bei dem einen oder anderen dabei, hab auch schon mal auf dem einen oder anderen gesprochen. Ich hab für mich herausgefunden, es ist nichts für mich, weil ich merke, nach einem vollständigen Arbeitstag möchte ich eigentlich abends nicht noch mehr in einem Zoom-Call hängen, weil das einfach super anstrengend ist für den Augen, für den Kopf, und dann wirklich dabei zu bleiben. Ich präferiere Offline-Meetups, ich präferiere, mit Leuten in Gespräch zu kommen. Aber ich kann auch verstehen, wenn andere Leute, die vielleicht größere Menschenmassen meiden wollen, also 30, 40 Leute, oder die nicht sehr gern unter leute sind die anderen weg präferieren finde ich finde ich auch okay finde ich super aber dafür gibt es ja jetzt inzwischen mark für beide seiten.",
      "start": 3110289,
      "end": 3229543,
      "confidence": 0.7725969387755109,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay also ich finde eigentlich offline ist auch wesentlich angenehmer und interessanter und ich habe auch teilweise wenn ich wie herumgereist bin, In meinem Sabbatical habe ich auch hin und wieder einfach mal versucht, eine Local Meetup Gruppe zu finden und bin einfach spontan dorthin. Das war eigentlich auch immer ganz nett, einfach mal in einem anderen Land Leute kennenzulernen. Teilweise ist die Sprachbarriere dann schwierig, wenn es nicht Englisch ist, aber im Normalfall ist es heutzutage eh oft Englisch. Also ich sehe auch auf jeden Fall einen großen Need noch rein von mir aus für so offline Meetups. Wenn jetzt jemand so ein Meetup gründen will oder starten will, die nächste Generation, die eben noch motiviert ist im Gegensatz zu dir, was würdest du denn so als Starttipp den Leuten mitgeben? Wie startet man denn am besten so ein Meetup?",
      "start": 3229603,
      "end": 3277920,
      "confidence": 0.7847375886524826,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin ja noch ein bisschen motiviert, nur nicht mehr so, ah komm, ja, lass uns jetzt mal treiben wie ganz am Anfang. Ich weiß, wie es funktioniert und es war jetzt auch ein bisschen toll, knapp zwei Jahre Pause zu haben. Deswegen, ich bin mir nur nicht sicher, weil ich habe mich halt in diesen zwei Jahren halt ein bisschen anders orientiert, was wir machen. Deswegen machen wir unter anderem jetzt zum Beispiel diesen Podcast. Ist ja auch so eine Art, ich nenne es mal Meetup-Ersatz. Was würde ich Neulingen als Starttipps geben? Lasst euch nicht unterkriegen, startet einfach. Startet Lean. Was bedeutet das? Sprecht mit eurer Firma. Hallo lieber Chef, denkst du ich kann heute Abend den Meetingraum hier benutzen? Holt euch einen größeren Meetingraum und sucht euch ein oder zwei Speaker. Limitiert die Talks. Wir haben zum Beispiel immer gemacht zwei Topics, a 30 Minuten. vielleicht nicht vom selben Thema, sondern eins aus dem Bereich Datenbanken, Backend-Infrastruktur oder ähnliches, dann das andere aus dem Bereich Frontend oder Data Science, also irgendwie nicht relevante Themen. Es ist immer toll, zwei Themen zu suchen, die nicht direkt was miteinander zu tun haben, weil das zwingt euch auch so ein bisschen über den Tellerrand zu schauen. Das habe ich auch immer sehr gemocht, warum ich immer die diverse Themenauswahl hatte. Weil die Leute kommen in der Regel für ein Thema und dann gehen natürlich manche auch, aber manche bleiben und indirekt haben wir die dann so gezwungen, dass die dann auch mal über den Tellerrand schauen und viele waren dann immer sehr dankbar. Aber lasst euch nicht unterkriegen, startet Lean. Ihr werdet am Anfang keine 40 Leute haben, sondern vielleicht 10 oder so oder 5, aber es ist ja völlig egal. Beruft euch bitte auf eure Motivation. Warum wollt ihr das machen? Wollt ihr euer Netzwerk erweitern? Wollt ihr was Neues lernen? Was ist also die Motivation? Oder wollt ihr einfach nur der Star des Abends sein? Dann würde ich das nicht empfehlen, ein Meetup zu starten. Aber macht euch klar, warum macht ihr das? Weil nur wenn die Motivation stimmt, habt ihr auch Durchhaltevermögen. Holt euch einen Partner oder eine Partnerin, die euch hilft. Und Achtung, hier, bitte, bitte, bitte, einer muss den Hut aufhaben. Einer muss der Hauptdriver sein. Weil sonst, wenn zwei, drei Leute verantwortlich sind, ist jeder verantwortlich und dann ist wieder keiner verantwortlich. Deswegen einer muss der Haupttreiber sein, einer muss wirklich Gas geben und dann die Aufgabenverteilung absprechen. Aber startet Lean, habt nicht so hohe Erwartungen. Es ist wie mit jedem Projekt. Startet, macht es kontinuierlich und über Zeit kommen die Leute und die ganze Sache wächst, weil ich bin ganz ehrlich, niemand wartet auf euch. Niemand wartet darauf, dass ihr das nächste CSS oder das nächste JavaScript Meetup macht, sondern es gibt so viel YouTube Talks und Co. Deswegen müsst ihr leider Durchhaltevermögen haben, sofern ihr das Ziel habt, 30, 40, 50 Leute anzusprechen. Wenn ihr das nicht habt, Dann macht so ne Art Stammtisch ja das Stammtisch da trifft sich immer nur so ne Art von ne kleinere Gruppe und ohne Talk sondern ihr geht dann irgendwie was essen oder was trinken oder oder trefft euch irgendwo und quatscht einfach über Themen einfach so Freestyle. Gibt's dann auch so andere Formate, Lean Coffee zum Beispiel. Oder gibt viele Art von Gruppenformaten, die man da anwenden kann. Muss nicht immer ein Frontal-Talk sein. Wir haben auch sehr viel mit den Formaten rumgespielt, wie zum Beispiel, ich hatte einmal ein Format, der nannte sich Explain Me Like I'm Five. Das ist kopiert aus einem Subreddit, wo jemand eine Frage stellt, und dann gibt's da Leute, die erklären diese Frage, als wärst du ein Fünfjähriger. Wie zum Beispiel, wie funktioniert eine Kernschmelze? Und dann wird das so erklärt, als wenn das ein 5-Jähriger versteht. Und das haben wir auch mal gemacht, da haben wir zum Beispiel Leute gehabt, die haben dann Scrum so erklärt, dass das ein 5-Jähriger versteht. Mit Pantomime und allem drum und dran. War recht lustig. Ach und haltet die Kosten niedrig. Das bedeutet stellt nicht so hohe Anforderungen. Wenn ihr ein paar Wasser, ein bisschen Cola da habt, dann reicht das völlig. Setzt euch Grenzen. Ihr müsst nicht immer das komplette Buffet auffahren. Wenn es ein bisschen Pizza ist, stellt da ein bisschen Pizza hin. Leute, es gibt immer Hater, es gibt immer Leute, die meckern. Verstehe ich alles. Wenn ihr eure Firma in Obstkorbstimme habt, sorgt dafür, dass da halt ein paar Äpfel und ein paar Bananen sind. Es gibt immer Leute, die hätten es anders gemacht. Der Punkt ist, die kommen, die haten und gehen wieder. Haben aber dann oft nie was für die Community gemacht. Lasst euch von sowas nicht runterkriegen. Sondern zieht einfach euer Ding durch und sagt euch, hey, passt mal auf, ich bin die extra Meile gegangen, ich hab hier was organisiert, ich hab hier einen Speaker organisiert und eine Speakerin. Und ihr habt jetzt die Möglichkeit, hier for free zu lernen. Also einmal kurz den Bubble halten und einmal ein bisschen die Erwartungen runterschrauben. Wenn, was ich zum Beispiel auch gemacht habe, bei solchen Hatern ist, die, ich hatte mal eine Person, die sagt, hey, wäre mal ein bisschen cool, wenn wir gesünderes Essen haben. Sag ich, ja top, pass auf, wir haben dieses Budget, ja, ich übertrage das an dich, bitte kümmere dich darum, um für dieses Budget gesünderes Essen zu finden, Caterer oder ähnliches und so weiter und so fort. Dann habe ich dann ein, zwei E-Mails gewechselt und dann ist die ganze Sache im Sande verlaufen, weil die Person auch wieder keine Zeit hat. Es ist nicht, dass ich das nicht favorisiere. Es geht einfach nur darum, ich habe limitierte Kapazität und wenn jemand meckert, dann soll die Person nicht kommen. Harte Meinung vielleicht, aber ich mache es primär aus meiner Motivation heraus. Ich verbiege mich nicht immer für andere. Es ist nicht, dass ich gesundes Essen nicht bevorzuge, doch manchmal hat man Grenzen. Und diese Grenzen können aufgehoben werden, sofern Leute mithelfen. Diese Person hat gemeckert. Ich habe dann Mithilfe gebeten. Und das ist dann im Sondervorlaufen auf Basis von der Grenze dieser Person.",
      "start": 3278140,
      "end": 3604521,
      "confidence": 0.7768481624758229,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube ganz allgemein, dass man nicht in einer Erwartungshaltung dorthin gehen sollte zu Meetups. Ich werde da jetzt extrem gut versorgt mit Essen und Getränke und sonst was. Und ich kann mich erinnern an die Anfangszeiten von dem Meetup in Innsbruck. Innsbruck ist so klein, dass es nur ein Meetup gibt. Repp und Speck hat es geheißen. War sogar von Deutschen eigentlich gegründet in Innsbruck. Und die hatten am Anfang Bier, aber du hast fürs Bier einfach zahlen müssen. Die haben einfach ein paar Kisten Bier gekauft und haben gesagt, bitte zahlt einfach zwei Euro pro Bier oder sowas. Also das war auch überhaupt kein Problem, weil es erwartet sich ja niemand, dass da irgendwer privat sein Geld ausgibt, damit du ein gratis Bier hast. Vor allem, wenn die eh schon ihre Zeit kostenlos zur Verfügung stellen und alles organisieren. Wenn da natürlich jetzt eine riesen Firma dahinter steht und die Location sponsert und alles, dann können die schon auch noch ein Bier sponsern, meiner Meinung nach. Aber wenn man das irgendwie einfach startet und das auch dementsprechend kommuniziert, dann ist das auch völlig okay, wenn da überhaupt nichts steht. Und es geht ja eigentlich um den Content und nicht um das Bier und die Pizza oder um ein großes Buffet. Das ist ja nice to have, aber für den Lean-Start, meiner Meinung nach, braucht man interessierte Leute und ein interessantes Topic. Und die Leute kommen ja wegen dem Inhalt prima, hoffentlich.",
      "start": 3605833,
      "end": 3684127,
      "confidence": 0.7873580246913573,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich kann nur empfehlen, startet mehr solche Meetups. Wir brauchen sowas wieder. Ich weiß, Corona ist schwierig. Ich verstehe das alles. Und besonders hier in Deutschland, alle reden schon wieder von irgendeiner Winterwelle. Ist eine schwierige Thematik.",
      "start": 3684167,
      "end": 3697071,
      "confidence": 0.7354864864864865,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hoffe, das haben jetzt alle mitbekommen. Der Andi hat sich jetzt selbst Mut zugesprochen und sich selbst probiert zu motivieren. Wenn ihr da mithelfen wollt, schreibt bitte am besten eine Message auf Twitter oder einen Tweet für den Andi, wenn ihr noch mehr sehen wollt. Der Andi hat ja in seinem Meetup im Web Engineering Düsseldorf, ich glaube, ungefähr 1000 Leute oder sowas drinnen. Ich hoffe auch, dass es da Überschneidungen gibt mit unserer Hörerschaft. Also, wenn ihr mehr wieder wollt, mehr Events vom Web Engineering Düsseldorf, habt ihr doch großes Einzugsgebiet, dann tweetet, motiviert den Andi, damit der Andi dann auch wieder endlich ein Event startet oder wenn ihr Lust habt, mitzuhelfen. Ich glaube, der Andi ist auch sicher offen diesbezüglich, wenn jemand da auch seine Zeit investieren will.",
      "start": 3697111,
      "end": 3739427,
      "confidence": 0.7821603053435113,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn ihr auch ein Meetup starten wollt, dann könnt ihr mich auch gerne anschreiben. Ich stelle hier und da auch nochmal ein bisschen Tipps oder Antworten zu spezifischeren Fragen zur Verfügung. Auch wenn ihr eine Konferenz organisieren wollt, können Wolfgang und ich da auch sehr viel Insights sharen. Falls ihr Speaker braucht zu bestimmten Themen, können wir auch helfen mit einem gewissen Speaker-Netzwerk. Wir haben auch sehr viele Speaker. die auch oft reisen in Deutschland oder ähnliches oder manche Leute reisen auch so für Meetups hin und her auf Basis dann von deren eigenem Budget. Also da gibt es ziemlich viele Möglichkeiten, wo wir gegebenenfalls aushelfen können.",
      "start": 3739447,
      "end": 3776634,
      "confidence": 0.8016074766355139,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und lasst uns mal wissen, wie ihr zu dem ganzen Offline-Meetup-Thema steht, ob ihr Online-Meetups bevorzugt oder ob ihr zu Offline-Meetings geht überhaupt noch oder ob das ein Thema wäre. Mir kommt vor, es ist alles eingeschlafen. Also die ganz großen Meetups sind schon wieder Offline oder so Hybrid teilweise. Aber ich finde eben auch, es ist irgendwie eingeschlafen, die ganze Szene. Und meiner Meinung nach wäre es sehr schade, wenn die schlafend bleibt, sondern von meiner Seite wäre es schon cool, wenn die auch wieder aufwacht und da ein gutes Angebot ist, weil es einfach auch fürs Netzwerk und fürs Leute treffen sehr wichtig ist. Und gerade wenn jetzt viel mehr Leute remote arbeiten in Zukunft, ist es glaube ich auch sehr interessant, einfach wieder vor Ort mal andere Leute zu treffen und wirklich Gesichter zu sehen im echten Leben und nicht nur im Metaverse.",
      "start": 3777415,
      "end": 3826087,
      "confidence": 0.8319520547945207,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Lasst euch von den negativen Aspekten nicht unterkriegen. Ich denke, im Allgemeinen die positiven Aspekte überwiegen. Und ich würde auch fast sagen, dass ich einen Großteil meines existierenden Wissens von Meetups habe und von anderen Leuten, weil ich mich denen ausgetauscht habe, weil ich sitzen geblieben bin, weil ich immer über meinen Tellerrand geguckt habe. Und Meetups sind eine tolle Sache und eine tolle Option, neues Wissen auf einfache Art und Weise zu kriegen, weil sich abends hinzusetzen, sich ein Gitterprojekt anzuschauen und das zu klonen und das zu testen ist natürlich schon eine Hausnummer an Arbeit und Time Investment und auch Brain. Investment und wenn man in einem Meetup sitzt und einfach mal ein Talk von einem guten Speaker oder einer guten Speakerin, die das sehr spaßig herüberbringt, dann kriegt man eine Idee von einem anderen Bereich. Man muss es ja nicht immer super anwenden können, aber man kriegt dann eine Idee, man kriegt eine Idee für die Use Cases und falls man so eine Art von Use Case dann mal hat, dann kann man sich das gewisse Thema natürlich schon ein bisschen besser, ein bisschen tiefer ansehen und dann vielleicht zur Anwendung bringen. Also das kann ich wirklich nur an den Tag legen. Macht das, organisiert mal ein Meetup, seid euch bitte bewusst. Das braucht ein bisschen Zeit. Was ich aber auch sagen kann ist, umso öfter ihr es macht, umso mehr Routine kommt ihr da rein. Wie bereits besprochen, am Anfang war es schon sehr viel Arbeit, ich war auch nervös und allem drum und dran. Inzwischen ist es so, ich mache es eigentlich auf der linken Popo-Backe, schreibe ein paar E-Mails und dann steht die ganze Baustelle. Und man wird halt deutlich sicherer, weil man auch seine eigenen Erwartungen vielleicht korrigiert hat und nicht immer allen gerecht werden möchte.",
      "start": 3826587,
      "end": 3925713,
      "confidence": 0.7973531353135315,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hast du da irgendwie so eine Liste, die du da immer monatlich durchgegangen bist mit Sachen oder Checkliste oder sowas, die wir sharen könnten?",
      "start": 3926093,
      "end": 3935284,
      "confidence": 0.7668749999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ne Checkliste hab ich nicht. Ich habe mal vor ein paar Jahren einen Blogpost veröffentlicht und dieser Blogpost heißt Lessons learned from running a local meetup. Das verlinken wir unten auch in den Shownotes. Der ist schon wieder vier oder fünf Jahre alt. Da stehen aber wertvolle Tipps drin.",
      "start": 3935344,
      "end": 3955039,
      "confidence": 0.7860408163265307,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, es hat sich ja nicht so viel geändert, wahrscheinlich organisatorisch.",
      "start": 3955079,
      "end": 3958419,
      "confidence": 0.7514545454545455,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da hat sich schon noch ein bisschen was geändert und ich sollte mal eigentlich eine Version 2 davon machen. Aber da steht dann zum Beispiel drin, wie zum Beispiel, soll ich ein neues Meetup machen oder soll ich vielleicht einem existierenden Join? Das ist vielleicht auch eine Möglichkeit. Schaut mal rum, welches Meetup bei euch in der Gegend zu eurem Thema eingeschlafen ist und schreibt mal rein, ob ihr das nicht übernehmen könnt.",
      "start": 3958460,
      "end": 3975183,
      "confidence": 0.7261643835616435,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Zum Beispiel das Web-Engineering-Meetup Düsseldorf.",
      "start": 3975863,
      "end": 3978604,
      "confidence": 0.7254,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Zum Beispiel.",
      "start": 3978644,
      "end": 3979425,
      "confidence": 0.9045,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wenn ich das jetzt richtig verstehe, Andi, dann hast du gerade versprochen, da diesen Blog-Post zu updaten und einen neuen Blog-Post auf unserem engineeringkiosk.dev-Blog zu schreiben, damit die Welt mehr über Meetups weiß und Meetups startet. Ist das korrekt? Jaja, ich sehe ein Nicken. Du brauchst gar nicht antworten. Ich sehe quasi ein Nicken. Das ist schon okay.",
      "start": 3979465,
      "end": 3998633,
      "confidence": 0.6961355932203388,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich packe es ganz unten auf meine Liste, mit dem Kommentar kommt Zeitkontrat. Ich habe es in meiner Liste, ich verspreche gar nichts. Ihr kennt, dass solche Blogposts werden nicht in fünf Minuten geschrieben, sondern eher in einer Woche oder zwei. Von daher, ich habe noch eine ganze Menge andere auf der Liste, wie zum Beispiel eine neue Engineering-Kiosk-Episode zu produzieren, Herr Gassler. Und das dürfen wir natürlich nicht schleifen lassen. Somit schreibt mir gerne ein paar Fragen, ein paar spezifische Fragen. Ich bin auch sehr gerne bereit, diese zu beantworten oder irgendwie Connections herzustellen. Von daher würde ich dann bevorzugen, dass Leute mit spezifischen Fragen das Meetup und Konferenzthema wieder an den Start kriegen und bevor ich dann wieder einen Blogpost schreibe.",
      "start": 3999573,
      "end": 4043415,
      "confidence": 0.8008699186991868,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, also ihr habt das jetzt, wenn ich das nochmal zusammenfassen darf, wenn ihr 20 Fragen, 20 Tweets sendet mit Fragen, dann wird Andi das in einem Blogpost beantworten, diese 20 Fragen. Dann haben wir einen schönen Blogpost. Also bitte sendet uns Tweets, engkiosk auf Twitter. E-Mail kennt ihr ja schon alle, hoffentlich stetig at engineeringkiosk.f. Und jetzt ganz neu, Wir haben uns so eine WhatsApp-Nummer besorgt und ihr könnt uns jetzt Voice-Messages auf WhatsApp senden und wir werden versuchen, diese Voice-Messages auch dementsprechend in unsere nächsten Episoden einzubauen. Also bitte sendet uns auch gerne Voice-Messages auf WhatsApp. Wir verlinken die Nummer natürlich in den Show Notes. Wir würden natürlich gerne auch sowas wie Signal verwenden. Da bin ich jetzt überfragt, ob wir das mit unserer virtuellen Nummer schaffen. werden wir aber auch noch checken und im Falle dementsprechend auch verlinken.",
      "start": 4044508,
      "end": 4100926,
      "confidence": 0.8031063829787236,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Job, was soll ich dazu noch sagen? Alles ist gesagt. Vielen Dank an alle Damen und Herren, die uns hier zugehört haben. Wir wünschen euch einen schönen Tag. Bis bald.",
      "start": 4101087,
      "end": 4110991,
      "confidence": 0.7778333333333336,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und hoffentlich sehen wir uns dann bald irgendwo auf einem Meetup oder auf der nächsten Local Host Conference. Tschau. Tschüss. Diese Scheißfliege. Wie kann man denn da arbeiten am Land und leider so Viechern?",
      "start": 4111031,
      "end": 4127506,
      "confidence": 0.7343529411764707,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.782066839459629,
  "audio_duration": 4128.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
