{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/2c663235-5a00-4499-abf0-a205f4ad2b39/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62x2pw74pf-3926-44bd-978b-3e57eea9f32c",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Dass ich sehr, sehr fähige Leute ohne akademischen Titel gesehen habe. Ich habe sehr, sehr fähige Leute mit akademischen Titeln gesehen und ich habe auch Quereinsteiger gesehen.",
      "start": 2480,
      "end": 9820,
      "confidence": 0.8170000000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das mag stimmen, aber wie sieht das die Industrie? Ist ein akademischer Titel wichtig für einen besseren Job, ein besseres Gehalt oder ist er sogar kontraproduktiv, gerade in Firmen, in denen akademisch als Schimpfwort gilt? Alles rund um Studium, Ausbildung und akademische Titel diskutieren wir in dieser Episode. Einerseits als Hiringmanager, aber auch mit meinen 32 Semestern Studiumerfahrung und mit Andis schulischer Ausbildung, seiner beruflichen Ausbildung und seinem Bachelorstudium. Und ja, ihr habt richtig gehört, da kommt ziemlich viel Ausbildung zusammen. Also Bildung, fertig, los!",
      "start": 11541,
      "end": 44802,
      "confidence": 0.8391294117647058,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wolfgang, du bist ja Akademiker. Mich würde mal interessieren, hast du noch einen Bachelor und einen Master gemacht oder warst du noch in der Diplomzeit?",
      "start": 49905,
      "end": 57028,
      "confidence": 0.6113200000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Immer dieser Unterton. Es ist unglaublich, dieser Unterton, wenn irgendwas mit der Uni kommt. Aber um deine Frage zu beantworten, das war eine sehr eigenartige Konstruktion. Ich war schon im neuen Modell, aber dieses neue Modell war noch nicht Englisch, sondern Deutsch. Das heißt, ich habe diesen Baccalaureus gemacht oder das Baccalaureat. Und danach den eigentlichen Master, aber da war in Österreich irgendwie noch nicht so das System bereit und darum habe ich am Ende einen Diplom-Ingenieur bekommen, was bei uns eigentlich dem Diplom-Studium entspricht. Also es war ein komplettes schräges System, aber kurz danach war dann wirklich der Bachelor und Master.",
      "start": 57068,
      "end": 93804,
      "confidence": 0.8249705882352936,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn du von neuem Modell sprichst, meinst du Bachelor und Master?",
      "start": 93824,
      "end": 97586,
      "confidence": 0.7582727272727273,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, ja, Bologna.",
      "start": 97626,
      "end": 99046,
      "confidence": 0.6496666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, das bedeutet, danach bist du dann in die Promotion gegangen, richtig?",
      "start": 99106,
      "end": 103108,
      "confidence": 0.7385833333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau danach habe ich einen Doktor gemacht und die war einer der letzten die den Doktor gemacht haben, weil danach war der Ph.D. dann.",
      "start": 103688,
      "end": 110051,
      "confidence": 0.7080000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du während deiner kompletten Universitätszeit bereits gearbeitet als Freelancer im Software Bereich in der Softwareentwicklung oder sagst du okay nee ich habe das erst nach meinem Diplom gemacht oder erst als ich den Ph.D. angefangen habe.",
      "start": 110091,
      "end": 122637,
      "confidence": 0.7951351351351351,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe schon in der Schule angefangen mit Freelancing. Da war das natürlich nicht so professionell noch, aber ich hab da schon Jobs erledigt und Auftragsarbeiten gemacht im Softwarebereich. Es war mehr dann so Webzeug und Javascript und irgendwelche PHP zusammen gehacktes Perl, PHP irgendwie so zusammen kopiert, weil Ahnung hatte ich überhaupt keine.",
      "start": 122697,
      "end": 144909,
      "confidence": 0.7879814814814817,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie alt warst du da?",
      "start": 145329,
      "end": 146311,
      "confidence": 0.4668000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja es hat wahrscheinlich so mit 16 begonnen.",
      "start": 146351,
      "end": 149194,
      "confidence": 0.6416249999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Würdest du jetzt retrospektiv sagen, dass das Studium dich zu einem besseren Softwareentwickler gemacht hat oder die jahrelange Erfahrung von deinem ehemaligen Webdesign gehacke wie du es gerade beschrieben hast. Also hat das Studium wirklich dazu beigetragen, dass du bessere Software schreibst, qualitativere Software schreibst, größere Softwareprojekte annehmen kannst? Oder sagst du, ich bin mir gar nicht sicher, ob das Studium wirklich einen großen Unterschied gemacht hat und nicht die Berufserfahrung ausstattgegeben war?",
      "start": 149234,
      "end": 177302,
      "confidence": 0.7964520547945206,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ob ich qualitative Software schreiben kann, ist sowieso eine große Frage, ganz allgemein. Ich kann mich auch erinnern, ich bin, wie ich auf die Uni gekommen bin, hat man da natürlich irgendwie Softwareentwicklung 1 oder so, der erste Kurs, und ich hab mir gedacht, kein Problem, ich kenn schon BHB, ich kenn Pearl, ich hab da schon weiß ich wie viele Projekte gelöst, ich brauch mich da überhaupt nicht vorbereiten, ich kann da einfach hingehen, ist doch gar kein Problem. Und wir haben da C gelernt und ich hatte natürlich keine Ahnung von Pointer, von Speichermanagement oder was das auch überhaupt ist als BHP-Programmierer. Und bin da nochmal ordentlich eingefahren, hab eine negative Note ausgefasst. Und das hat mir dann so ein bisschen die Augen geöffnet, dass da auch irgendwo vielleicht schwierigere Sachen im Hintergrund sind, Theorie im Hintergrund ist, die man vielleicht nicht nur lernt, wenn man ein bisschen BHP-Code zusammen kopiert. Im Gesamten muss ich schon auch sagen, ich glaube, die Praxis ist extrem wichtig, weil man auf der Uni einfach nicht lernt, in einem Team zu arbeiten oder in einem größeren Projekt und das fehlt einfach. Auch wenn du die theoretischen Grundlagen hast, dir fehlt einfach die Praxis und ich glaube, das ist in jedem Beruf so. Und bei anderen Berufen wird jetzt halt vielleicht eher in der Ausbildung in irgendeiner Form mitgemacht. Als Elektriker, da lernst du halt auch am Bau, wie du die Kabel verlegst, nicht nur in der Schule, wie so Kabel aussieht. Und ich glaube, den Mix sollte man eigentlich bevorzugen. Und das fehlt vielleicht im Studium. Oder ist auch schwierig einfach im Studium.",
      "start": 177741,
      "end": 262467,
      "confidence": 0.7752029520295203,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sagst du indirekt, dass Leute ohne Studium in der Softwareentwicklung nichts auf die Kette kriegen?",
      "start": 262507,
      "end": 266708,
      "confidence": 0.6663333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das würde ich nie behaupten, ich bin ja nicht so wie du, der sich da gleich ein ganzes Land als Feind macht und ganz Deutschland beleidigt oder so, ich beleidige sicher nicht die, die nicht studiert haben und ich kenne natürlich viele gute Programmierer und Programmiererinnen, die Quereinsteiger sind oder die nicht an der Uni waren oder an der Fachhochschule oder teilweise vielleicht auch nur eine Ausbildung gemacht haben, du hast ja auch eine Ausbildung gemacht, oder?",
      "start": 267208,
      "end": 290847,
      "confidence": 0.7683896103896104,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe eine schulische Ausbildung gemacht, danach habe ich eine berufliche Ausbildung gemacht.",
      "start": 290887,
      "end": 294610,
      "confidence": 0.7782307692307692,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Moment, was ist da der Unterschied? Für uns Österreicher, bei uns gibt es keine schulische und berufliche, bei uns gibt es nur eine Lehre.",
      "start": 294850,
      "end": 304474,
      "confidence": 0.7465416666666664,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eine Lehre ist aber gleichzusetzen mit der beruflichen Ausbildung, oder?",
      "start": 304494,
      "end": 308135,
      "confidence": 0.7828999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wahrscheinlich, ja. Also es gibt natürlich auch Schulen, die irgendwie ein bisschen, keine Ahnung, Informatik Schwerpunkt haben oder so, dann hast du halt da ein paar Stunden mehr Informatik pro Woche.",
      "start": 308155,
      "end": 318898,
      "confidence": 0.7021612903225808,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eine schulische Ausbildung ist, es gibt ja wahrscheinlich verschiedene Modelle in Deutschland, dennoch ist das mehr oder weniger ein Fachabitur. Das bedeutet, nach der 10. Klasse kannst du zum Beispiel zu einem Berufskolleg gehen und kannst dort eine schulische Ausbildung machen, wie zum Beispiel Informationstechnischer Assistent und am Ende der zweieinhalb oder drei Jahre hast du dann auch ein Fachabitur.",
      "start": 319319,
      "end": 340334,
      "confidence": 0.7861666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt, du machst eigentlich so Lehre mit Abitur, ist das dann?",
      "start": 340824,
      "end": 344465,
      "confidence": 0.7479999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn du die Lehre mit einer Berufsausbildung gleichsetzt, dann ist das schon was anderes. Denn in der schulischen Ausbildung mit der Fachabitur hast du nur zwei Praktika, A4 oder 6 oder 8 Wochen. Und deine Schulfächer sind eher im Bereich des Fachthemas. Das bedeutet, was habe ich dann zum Beispiel gemacht? Ich habe eine schulische Ausbildung mit Fachabitur zum informationstechnischen Assistenten gemacht. Und da hatte ich Schulfächer wie zum Beispiel Elektrotechnik. Ich habe meine eigenen Platinen geätzt. Wir haben dann auch Netzwerkverkabelung gemacht. Ich habe hier und da mal Strippen gezogen in so einem Schulraum und Netzwerkanschlüsse gekrimmt und ein Active Directory aufgesetzt. Aber ich hatte auch Softwareentwicklung im Bereich C++ und Mathematik und ähnliches. Das bedeutet, Dein ganzes Abitur ist dann primär eigentlich auf diese Fachrichtung ausgelegt. Und dann bist du nach zweieinhalb, drei Jahren, hast dann Fachabitur, was fast gleichzusetzen ist mit einem Abitur. Der Unterschied ist dennoch, dass du mit dem Fachabitur nicht an jede staatliche Hochschule in jedes Studium gehen kannst. Für manche Studienbereiche ist das dann okay. Das bedeutet, mit dem informationstechnischen Assistenten hätte ich dann ein Informatikstudium. an einer staatlichen Hochschule machen können. Für andere Studiengänge hätte ich dann sehr wahrscheinlich noch so einen Eingangstest machen müssen, aber ich hätte dann jetzt nicht zum Beispiel Gesundheit oder ähnliches studieren dürfen.",
      "start": 344485,
      "end": 426739,
      "confidence": 0.8374212962962965,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also sowas schulisches gibt es natürlich bei uns auch, ja. Das nennt sich HTL bei uns, höhere technische Lehranstalt und da gibt es halt dann verschiedene Schwerpunkte, je nachdem in was für eine Schule du gehst und hast dann am Ende auch Abitur, ja. Okay, also sowas gibt es bei uns auch.",
      "start": 426979,
      "end": 440446,
      "confidence": 0.7450576923076926,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wohingegen natürlich die berufliche Ausbildung ein bisschen was anders ist. In der beruflichen Ausbildung hast du in der Regel zwei, zweieinhalb oder drei Jahre, bist primär in einem Betrieb und hast dann alle x Wochen Schule. Entweder in einem Blockmodell oder in einem Wochenmodell, dass du zwei Tage die Woche irgendwo in der Berufsschule bist, aber deine hauptaufgabe ist dass du dann ein auszubildender in einem betrieb bist und dort in den jeweiligen abteilungen ich sag mal rum tingelst ja du wechselst dann die abteilung sofern es abteilung gibt ich habe meine ausbildung bei einer kleinen webagentur gemacht da gab es jetzt nicht so viele abteilungen weil wir nur zehn leute waren.",
      "start": 440606,
      "end": 479213,
      "confidence": 0.7832410714285715,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Moment aber du hast jetzt die schulische und die berufliche gemacht oder.",
      "start": 479273,
      "end": 482115,
      "confidence": 0.727,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau.",
      "start": 482775,
      "end": 483396,
      "confidence": 0.922,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hat man da einen Titel dann? Schließt man diese berufliche irgendwie aus? So Geselle oder so wie bei einer Lehre?",
      "start": 484196,
      "end": 490440,
      "confidence": 0.7776500000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Am Ende der Berufsausbildung hast du auch einen Titel. Ich bin ausgebildeter Fachinformatiker, Fachrichtung Anwendungsentwicklung, genau.",
      "start": 490480,
      "end": 496824,
      "confidence": 0.785625,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da hätte es andere Bereiche auch noch gegeben, neben Anwendungsentwicklung.",
      "start": 496844,
      "end": 500667,
      "confidence": 0.8209,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt noch Fachinformatiker, Fachrichtung, Systemintegration. Das war früher so der ganz klassische Systemadministrator.",
      "start": 501150,
      "end": 507836,
      "confidence": 0.9125,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der Netzwerke.",
      "start": 507876,
      "end": 509117,
      "confidence": 0.42500000000000004,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber primär der wirklich Strippenzieher, Active Directory und so weiter. Und ich habe vor kurzem über Reddit gelernt, dass es jetzt noch eine dritte Fachrichtung gibt. Die wurde neuerdings eingeführt. Ein Moment. Fachinformatiker für Daten- und Prozessanalyse.",
      "start": 509177,
      "end": 525270,
      "confidence": 0.8345789473684211,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also dieses Big Data und Data Science kommt schon überall rein, oder?",
      "start": 525785,
      "end": 529086,
      "confidence": 0.3835,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Aufgabe für Experten in diesem Schwerpunkt ist es, datenbasierte Lösungen für digitale Produktions- und Geschäftsprozesse zu entwickeln. Es geht also um das Analysieren von Arbeits- und Geschäftsprozessen, Analysieren von Datenquellen und Bereitstellen von Daten, Nutzen der Daten zur Optimierung von Arbeits- und Geschäftsprozessen sowie Optimierung digitaler Geschäftsmodelle, Umsetzen des Datenschutzes und Datensicherheit. Ist also wirklich auch wieder so ein Mix von allem, wenn man in den Bereich Fachinformatiker gehen müsste.",
      "start": 529126,
      "end": 557474,
      "confidence": 0.8797464788732395,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Klingt fast so wie Data Engineer mit ein bisschen Prozessoptimierungszeug irgendwie dabei.",
      "start": 557494,
      "end": 563578,
      "confidence": 0.65925,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da würde ich jetzt mal in Frage stellen, wie viel der Data Engineer wirklich mit dem Datenschutz oder der Datensicherheit selbst zu tun hat. Aber ich glaube, das ist dann je nach Firmengröße der Fall. Es ist nur so, du hast gerade so ein bisschen kritisch gefragt, warum habe ich erst eine schulische Ausbildung gemacht und warum habe ich danach noch eine berufliche Ausbildung gemacht? Als ich die schulische Ausbildung gemacht habe, kam ich dann da raus und hatte mehr oder weniger nur Fachabitur und es war relativ schwer, diesen wirklich anerkannt zu bekommen, dass die Firmen sagen, oh, der hat jetzt wirklich was auf dem Kasten, den kann ich jetzt einstellen. Ich habe zwar einen Kollegen, viele Grüße an den Daniel, der hat nach der schulischen Ausbildung direkt einen Job bekommen, auch in dem Bereich, das ist super, aber auch nur über Vitamin B. Viele meiner Kollegen haben danach noch eine berufliche Ausbildung gemacht und sind dann erst richtig in den Job eingestiegen. Inzwischen sagt man sogar, dass diese schulische Ausbildungen gar nicht so wirklich so den Wert haben. Die hat mir nicht geschadet, ganz im Gegenteil. Ich habe deutlich mehr über Elektrotechnik gelernt als in meiner beruflichen Ausbildung. Und ich habe dadurch Fachabitur, was mir natürlich dann später für mein Studium geholfen hat. Es war jetzt also keine verschwendete Zeit.",
      "start": 563598,
      "end": 629303,
      "confidence": 0.8106261261261256,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich muss ja auch sagen, ich habe die Leute, die bei uns eben aus dieser, nennen wir es mal so, auch schulischen Ausbildung, HTL, eben gekommen sind, die habt ihr ja auch erlebt, wie ich damals auf der Uni Einführung in die Informatik gemacht habe, als Übungsleiter und habe dann natürlich den Unterschied gemerkt, wenn jetzt Leute gekommen sind, einfach nur mit mit Matura oder Abitur und den Leuten, die halt wirklich so eine Ausbildung schon genossen haben und die waren schon auf einem anderen Level, muss man auch sagen. Wir haben das dann in der Gruppe unter den Lehrenden, also unter allen Übungsleitern mit dem Professor damals, dann einfach probiert so zu lösen und das war eigentlich, finde ich, super interessante Herangehensweise, weil wir gesagt haben, das Problem ist immer, ich habe das davor auch schon öfters gemacht, dass die Leute von der HTL einfach sofort einsteigen können, genau wissen, wie man programmiert und die anderen komplett abhängen oder sie langweilen sich dann teilweise. Und was wir dann einfach gemacht haben, war, dass wir eine andere Sprache verwendet haben. Und zwar haben wir einfach OCaml verwendet und funktionale Programmierung und damit waren einfach alle bei Null. Die Leute sind eigentlich gekommen mit ihren C-Kenntnissen und Prozedural und plötzlich war das funktional und sie haben keine Ahnung mehr gehabt, um was es geht. haben sich teilweise extrem schwer getan, weil sie super in den Prozeduralen drinnen waren und durch diese funktionale Programmiersprache, wir haben dann später schon auch C gemacht, aber haben eben das vorgezogen, die funktionale Programmierung und so haben wir jeden bei dem gleichen Stand abgeholt und jeder hat quasi bei Null starten müssen. Das war eigentlich ganz coole Erfahrung und hat auch ganz gut funktioniert und so waren alle auf dem gleichen Level.",
      "start": 629343,
      "end": 723785,
      "confidence": 0.8045135135135134,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich tue mir immer relativ schwer mit dieser Aussage, Leute von dieser Uni oder Leute mit diesem Background sind auf einem anderen Level, weil im Endeffekt haben diese Leute dann ein wenig Glück oder einen Vorteil oder einen Lernvorteil oder einen Lernvorsprung. Ich kann aber auch eindeutig bestätigen in meiner beruflichen und schulischen und akademischen laufbahn ja ich weiß ein bachelor ist gegebenenfalls nur ein studienabbrecher oder was sein professor auch immer gesagt hat deswegen zählt das vielleicht nicht wenn ich sage ich hatte eine akademische laufbahn dennoch kann ich sagen.",
      "start": 723805,
      "end": 757148,
      "confidence": 0.8097582417582416,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das kann ja auch eine abgebrochene laufbahn sein ist ja schon okay mit diesem bachelor abschluss aber ich zitiere natürlich nur.",
      "start": 757168,
      "end": 763212,
      "confidence": 0.5558095238095239,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meinen professor bitte Ich kann aber auf jeden Fall sagen, in jedem Bereich, schulische, berufliche oder akademische Laufbahn, waren auch komplette Flachpfeifen dabei. Komplette Flachpfeifen, die alles auswendig gelernt haben. Und wenn du mal eine Frage stellst, die Thema 1 und Thema 2 versucht zu verbinden, dann steigen die halt aus und gehen rückwärts wieder weg. Also von daher. Und wenn du jetzt wieder kommst, haben wir wieder auf Leute zu beleidigen. Kennst du den Kabarettisten Serdar Sumuncu?",
      "start": 763252,
      "end": 791470,
      "confidence": 0.7514230769230771,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich nicht.",
      "start": 791490,
      "end": 792731,
      "confidence": 0.775,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Serdar Sumuncu, den nennt man unter anderem auch den Hasskasper, weil der halt immer so relativ drastisch ist und allem drum und dran. Google den mal und zieh dir vielleicht mal ein bisschen was auf YouTube rein. Ich finde eine Sache sehr schön, was er sagt. Der beleidigt auch sehr viel, der sagt aber, das ist okay, weil der beleidigt einfach alle. Der beleidigt nicht die eine Gruppe oder die andere Gruppe, der beleidigt halt einfach alle. Und somit sind dann wieder alle gleich. Und so ist das bei mir hier auch.",
      "start": 792771,
      "end": 816777,
      "confidence": 0.7769456521739129,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Beleidigst du dich selber auch?",
      "start": 816797,
      "end": 818919,
      "confidence": 0.6587999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich sehe das nicht als Beleidigung. Ich denke, es ist sehr wichtig, dass man über alles und jeden und auch über sich selbst kontinuierlich lachen kann. Wenn man das kann, dann ist man, glaube ich, in einem glücklichen Leben. Und deswegen sehe ich das nicht als Beleidigung. Ich meine, ich verstehe manche Themen auch nicht und manche Themen habe ich auch einfach kein Interesse, die zu lernen. Das bedeutet, ich habe gerade von diesen Flachpfeifen geredet. In manchen Themenbereichen war ich auch einfach nur komplette Flachpfeife. Das habe ich dann gelernt und hätte sie mir so eine Frage gestellt, um zwei Themen zu verbinden, wäre ich auch rückwärts wieder rausgegangen. Von daher, ja, teilweise beleide ich mich auch.",
      "start": 818959,
      "end": 852696,
      "confidence": 0.820542372881356,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn sich jetzt manche schon denken, was labern die da jetzt schon wieder so lange um irgendwelche allgemeine Themen, Dieses Thema ist eigentlich schon unser Episodenthema und wir sind schon voll in der Diskussion drinnen, weil was wir eigentlich besprechen wollten ist der Unterschied zwischen Uni, Hochschule, Ausbildung. Gibt es da Unterschiede? Weil wir haben da eigentlich sehr viel Feedback bekommen von von Hörerinnen und Hörern, vom Jonathan zum Beispiel, ob es da dann irgendwelche Gehaltsunterschiede später gibt, ob wir da irgendwo Unterschiede sehen. Der Mischa hat uns das mal auch vorgeschlagen, auch unsere Erfahrung, wie weit das Studium geholfen hat zum Beispiel oder ob man dann anpassungsfähiger ist oder nicht, das ist immer die klassische Argumentation für ein Studium oder auch von Anna die Frage, ob wir zum Beispiel als Hiringmanager in irgendeiner Form das als Kriterium mit einbezogen haben oder ob das für uns eben wichtig war. Und genau um diese Fragen probieren wir heute zu kreisen und vielleicht sie auch zu beantworten. Und da ist es ja auch ganz interessant, weil der Andi eben die ganze schulische Seite auch mit abdecken kann und dann eben diesen Bachelor bei irgendeiner, wie heißt, wie hat das geheißen, deine Hochschule, war das überhaupt eine Hochschule, wo du deinen Bachelor gemacht hast?",
      "start": 852716,
      "end": 926202,
      "confidence": 0.8167203791469192,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist eine private akkreditierte Hochschule.",
      "start": 926682,
      "end": 929644,
      "confidence": 0.8883333333333332,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist da, wo man diese Titel einfacher kaufen kann. Warst du mal dort auch?",
      "start": 930405,
      "end": 934587,
      "confidence": 0.7996666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Erstens, sei nicht so frech.",
      "start": 934627,
      "end": 936428,
      "confidence": 0.7824,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast mir gerade gelernt, ich muss mich beleidigen.",
      "start": 936448,
      "end": 938730,
      "confidence": 0.5735555555555556,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe gesagt, ich beleidige jeden. Wir müssen hier aber auch Good Cop, Bad Cop spielen. Ich bin sozusagen der Bad Cop. Aber nee, ich hab auch für mein privates Studium monatlich eine Gebühr gezahlt, das ist korrekt.",
      "start": 938750,
      "end": 950915,
      "confidence": 0.7826315789473686,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie teuer war das?",
      "start": 951035,
      "end": 952235,
      "confidence": 0.618,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe, glaub ich, 330, 340 Euro pro Monat an die private Hochschule gezahlt.",
      "start": 952275,
      "end": 957957,
      "confidence": 0.7589285714285713,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, das ist schon ganz ordentlich.",
      "start": 958237,
      "end": 959797,
      "confidence": 0.4018333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Mein ganzes Studium hat dann irgendwas zwischen 12.000 oder 14.000 Euro gekostet, über zweieinhalb, dreieinhalb Jahre. Die Preise sind auch öffentlich auf der FOM.de vom Fachhochschule für Ökonomie und Management bedeutet das.",
      "start": 959817,
      "end": 972160,
      "confidence": 0.81021875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber das, dass man da nie hingehen muss und einfach den Titel bekommt, ist natürlich ganz gut.",
      "start": 972314,
      "end": 976158,
      "confidence": 0.7297647058823529,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt keine Anwesenheitspflicht, das ist richtig. Ich muss aber zugeben, ich war sehr oft da, weil mich viele Sachen auch interessiert haben. Und mir war es jetzt nicht so wichtig, den akademischen Titel zu haben. Es ist natürlich schön, Aber wie ich ja bei dir raushöre, ist ein Bachelor of Science ja nichts wert. Dennoch haben mich manche Themen wirklich, wirklich interessiert und ich hab ein paar echt interessante Leute getroffen. Also wie zum Beispiel Algorithmen fand ich sehr interessant. Bei diesem Professor hab ich dann später auch meine Bachelorarbeit geschrieben über Software Repository Mining. Das bedeutet, wie finde ich aus Metadaten des Softwareentwicklungsprozesses neue Erkenntnisse. Sehr spannendes Thema. Aber auch andere Themen. Ich denke, durch mein Wirtschaftsinformatikstudium verstehe ich die Welt besser und verstehe auch ziemlich viele Prozesse in Unternehmen besser, weil es halt sehr viel auch mit Betriebswirtschaftslehre, Volkswirtschaftslehre zu tun hat. Und wenn du mal wirklich weißt, wie Versicherungen eigentlich Geld verdienen, wie denn eigentlich mal so ein Zins bestimmt wird, was ein Euribor ist und allem drum und dran, dann versteht man auch sehr viele Hintergründe von zum Beispiel aktuellen Krisen. Ich denke, das hat mir schon geholfen. Natürlich gab es aber auch Leute, die haben die Kohle gezahlt und die haben dann natürlich links und rechts geguckt, okay, bei welchem Professor kann ich die Klausur schreiben, wo ist sie am einfachsten und haben sich versucht durchzumogeln. Dennoch sind sie dann bei meines Erachtens nach relativ einfachen Klausuren dann dreimal durchgerasselt und somit ausgeschieden, wie zum Beispiel Datenbanken, wo es eigentlich darum ging, ein paar, meines Erachtens nach, basic SQL-Querys auf MySQL zu schreiben. Und warum sage ich meines Erachtens nach? Ich verstehe, dass das Thema für manche Leute echt kompliziert sein kann. Dennoch denke ich, dass dies kein schwieriges Thema ist zu erlernen, weil es genug Lernressourcen zum Thema gibt, wie funktioniert ein GroupBy, was ist ein WHERE-Statement, wo setzt man HEAVING an, und was ist eigentlich eine SQL-Transaktion? Ich denke, mit ein bisschen Arbeit kann man sich das alles beibringen und es ist nichts Unmögliches. Deswegen klassifiziere ich das als Basic, weil ich denke, auch wenn du einen akademischen Titel haben möchtest, dass du dann ein bisschen Arbeit investieren musst, auch wenn du dafür monatlich zahlst.",
      "start": 976198,
      "end": 1106434,
      "confidence": 0.8234477211796248,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hast du uns schon gerettet, dass wir da keine Abmahnungen oder irgendwelche Klagen bekommen von den Hochschulen. Also es sind auch Leute rausgeflogen und man kann sich demnach den Titel nicht erkaufen.",
      "start": 1107112,
      "end": 1118074,
      "confidence": 0.7977272727272728,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Regeln sind meines Wissens nach die gleichen wie an Hochschulen. Das bedeutet, wenn ich dreimal durch eine Klausur rassle, dass ich dann diesen Studiengang nicht mehr machen darf und dass du pro abgelegte Klausur oder Heimarbeit, also eine schriftliche Arbeit, irgendwie eine Seminararbeit nennt sich das genau, glaube ich, dass du dadurch deine Punkte sammelst und dass du für die Bachelorthesis dann eine gewisse Anzahl an Punkten haben musst und so weiter und so fort. Das bedeutet Zulassungsbeschränkungen und so weiter und so fort. Also das gibt es schon. Man muss aber auch sagen, dass in der Industrie die privaten Unis hier und da mal so einen kleinen Hit bekommen haben. Das habe ich am eigenen Leib erfahren. Ich habe mich mal irgendwann bei einem Unternehmen beworben und vor mir saß jemand, der hatte glaube ich auch einen Doktortitel. Dann hat er meinen Lebenslauf gesehen und hat wirklich gesagt, ah, du hast an der Form studiert, verstehe. Also, ich muss dir ganz ehrlich sagen, Titel von der FOM nehm ich nicht ernst, das ist private Uni, die meisten kaufen sich den, deswegen tut mir leid, aber deinen Bachelorabschluss erkenne ich hier nicht an.",
      "start": 1118554,
      "end": 1186112,
      "confidence": 0.7841546391752579,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hat er dir wirklich so ins Gesicht gesagt?",
      "start": 1186627,
      "end": 1188169,
      "confidence": 0.5287777777777776,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das hat er mir fast O-Ton mäßig so gesagt. Fand ich ein bisschen erschreckend, weil wir waren in den ersten zehn Minuten des ersten Gespräches. Also es ist jetzt nicht so, als waren wir schon im dritten Gesprächs-Cycle oder eine Stunde drin und er weiß genau, was ich auf dem Kasten hab oder halt auch nicht, wo meine Stärken und Schwächen liegen, sondern er fing sofort an. Da war ich so, herzlichen Glückwunsch, wo bin ich denn hier gelandet? Ich meine, im Endeffekt, dieser Mensch war schon sehr fähig und allem drum und dran und später konnte ich ihn dann auch überzeugen, dass ich weiß, wovon ich rede. Dennoch habe ich hier und da diese Art von Vorurteil in der Industrie wahrgenommen und speziell bei, ich nenne es mal, bei den alten Hasen, bei den alten Rekruten, bei den alten Leuten, die damals noch ein Diplom gemacht haben, war ja genau die Diskussion auch im Bologna-Prozess damals, dass die Leute Alle die ein Diplom hatten, dass die Bachelor und Master nicht anerkannt haben, weil die gesagt haben, das ist ja nichts.",
      "start": 1188189,
      "end": 1242071,
      "confidence": 0.7857734806629832,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber das war eine traditionelle Firma schätze ich mal, das war jetzt kein Startup.",
      "start": 1242131,
      "end": 1246054,
      "confidence": 0.4947142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "War eine größere Firma, war auch eine Firma, die nicht ursprünglich aus dem Digitalbereich kam, war eine Firma, die aber in den Digitalbereich muss, um zu überleben.",
      "start": 1246074,
      "end": 1255943,
      "confidence": 0.8765185185185184,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe zum Beispiel bei Trivago auch mit vielen Kollegen vor allem die Erfahrung gemacht, dass da eine Feindseligkeit gegenüber so akademischen Laufbahnen war. Also da hören jetzt wahrscheinlich auch ein paar zu, die diese Meinung hatten, aber wenn da irgendwo ein Doktor zum Beispiel gestanden ist in dem Lebenslauf, Dann hatte der Kandidat oder die Kandidatin schon minus fünf Punkte, bevor sie in das Interview reingegangen sind. Also es hat schon noch auch die andere Seite gegeben, dass Leute wirklich gesagt haben, okay, die haben ja nur die Uni-Erfahrung oder die haben nie was anderes gesehen oder nicht richtig und der will ja dann nur da irgendwie, anstatt zu deliveren, nur irgendwie in seiner Theorie herumarbeiten und Das war schon teilweise schwierig, da ein anderes Mindset auch reinzubringen und ein bisschen mehr Offenheit gelten zu lassen. Ich verstehe schon, woher das kommt.",
      "start": 1256575,
      "end": 1307657,
      "confidence": 0.7939580419580423,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das Vorurteil des Fachidioten, das gibt es halt immer noch, muss man sagen. Und es gibt aber nicht nur den Fachidioten, es gibt auch das erste Vorurteil, da hat jemand einen Doktortitel. der ist für diese Stelle, die ich hier gerade suche, überqualifiziert. Hast du schon mal so was am eigenen Leib erlebt?",
      "start": 1307697,
      "end": 1325191,
      "confidence": 0.7403396226415095,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das habe ich nur von extrem vielen Leuten gehört. Ich habe das aber nie irgendwie bestätigt bekommen. Das war immer so, ja, man hat dann irgendwie ein Problem, weil man ist ja überqualifiziert. Das mag vielleicht sein bei ganz, ganz großen Firmen, die ein sehr starres Schema haben, wo du als Doktor vielleicht irgendwo dann in einem anderen Gehaltsbereich fällst oder so, dass die dich dann einfach nicht einstellen können, obwohl du Vielleicht wollen würdest, weil du mit diesem Doktor einfach in der Tabelle woanders landest und diese Job ist aber definiert in einer gewissen Gehaltsrange, aber ob das in der Realität wirklich passiert, kann ich mir eigentlich mittlerweile kaum mehr vorstellen oder zumindest weniger. Hast du mal irgendwas konkretes gehört, dass es passiert wäre wirklich?",
      "start": 1325231,
      "end": 1366579,
      "confidence": 0.7878650793650795,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was konkretes habe ich da jetzt nicht gehört, was ich aber schon weiß, immer wenn ich irgendwie einen Lebenslauf sehe und dort sehe ich, dass diese Dame oder dieser Herr einen akademischen Titel hat, dann setze ich natürlich in meinem Kopf natürlich schon ein paar gewisse Erwartungen voraus. Was meines Erachtens nach aber auch falsch von mir ist, weil das dann eigentlich persönlicher Bias ist, weil auch Quereinsteiger und Leute ohne einen akademischen Abschluss, die können trotzdem mir die Schuhe ausziehen in dem Fachbereich, für den ich einstellen möchte. Und das heißt nicht automatisch, dass jemand mit einer akademischen Ausbildung dort besser ist oder schlechter. Ich sage nur, dass man gegebenenfalls andere Erwartungen haben kann in Bezug auf das, was man an der Uni lernt. Und das ist natürlich ganz klar und primär sicheres Auftreten bei völliger Ahnungslosigkeit.",
      "start": 1367139,
      "end": 1411826,
      "confidence": 0.8263695652173912,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dem kann ich nur beipflichten, weil ich kenne Leute, die sind durch die Uni gekommen, teilweise bis zu dem Doktor und da stellt es mir alle Haare auf. Also es gibt, klar sind es schwarze Schafe, aber es gibt Leute, die einen Informatik-Doktor bekommen haben, die ihn, ehrlich gesagt, meiner Meinung nach nicht verdient haben. Aber wer schaut denn dann schon später rein, ob du in deiner Doktorprüfung irgendwie eine 4 bekommen hast? Zur Erklärung, Österreich, Noten 1 bis 5, 5 ist negativ, 4 ist die schlechteste positive Note. Das ist gerade noch durchgekommen. Wenn du das schaffst, bei dem Doktor eine 4 zu bekommen, das ist Katastrophe eigentlich. Aber checkt ja niemand, weil das Zertifikat Doktor hast du am Ende doch bekommen. Und auch sonst, was Leute einfach irgendwie durch den Bachelor durchgerutscht sind, weil sie halt einfach links und rechts kopiert haben und irgendwie die Klausuren geschafft haben. Es gibt's auch, wie gesagt, sind schwarze Schafe. Der Großteil bemüht sich ja, aber wenn du keine Lust hast zum Lernen, dann kommst du schon irgendwie durch, aber hast am Ende auch keine Ahnung.",
      "start": 1412316,
      "end": 1469402,
      "confidence": 0.7945271739130435,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber du machst das nicht daran fest, dass diese Leute keine Zeile Code schreiben können, oder? Weil ich mein, der Bereich Informatik, oder dass ich einen Doktor in Informatik hab, das kann ja alles sein.",
      "start": 1469442,
      "end": 1477847,
      "confidence": 0.6635714285714285,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nein, da geht es um Verständnis und andere grundlegende Dinge, weil wenn jetzt jemand Doktor in Informatik hat, dann erwarte ich mir einfach gewisse Basiskenntnisse und Verständnis von Informatik. Da geht es nicht darum, dass jemand Pattern XY kennt. Es gibt ja viele Bereiche, aber so ein gewisses Grundverständnis und Programmieren sollte man wohl auch irgendwo mal gelernt haben und können. Schönprogrammieren ist nochmal eine andere Sache, das sagt mir den Uni-Leuten auch immer nach, das möchte ich auch gleich wieder mal widerlegen. Die meisten Leute im akademischen Bereich schreiben keinen sauberen Code, kann es nur immer wieder betonen. Also die Chance, dass wenn jemand von der Uni kommt, der einen Doktor hat und auch immer nur an der Uni war, dass der dir jetzt jeden Tag over-engineerten Code liefert, also die Chance ist so so gering, weil der gewöhnt ist, normalerweise einfach schnell zu hacken, irgendwas auf die Schiene zu bekommen, um möglichst schnell zu publizieren. Und da wird nicht überlegt, ist das ein super sauberer Code, den später zehn andere Wissenschaftler noch bearbeiten können oder erweitern können, weil das passiert in der Realität eh viel zu selten. Also das ist schnell und hacky.",
      "start": 1478331,
      "end": 1548292,
      "confidence": 0.821348717948718,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Mit publizieren meinst du dann wissenschaftliches Paper publizieren?",
      "start": 1548332,
      "end": 1551335,
      "confidence": 0.709375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, die Ergebnisse, weil du programmierst ja eigentlich nur, um irgendwelche Ergebnisse zu bekommen und dann publizierst du die Ergebnisse und mittlerweile hat sich das ein bisschen geändert. Da publiziert man teilweise auch den Code mit. Früher ist der einfach irgendwo in der Versenkung verschwunden, den hat niemand gesehen. Das war ja auch ein Problem, dass man das nie nachvollziehen konnte. Wie bist du denn überhaupt zu diesem Ergebnis gekommen? Also klar, wenn du jetzt Forschung machst in der Softwarearchitektur oder irgendwo, wie baut man schönere Software, klar, dann beschäftigst du dich tagtäglich mit den ganzen Patterns und solchen Dingen. Aber jetzt alle anderen Disziplinen, da geht es darum, möglichst schnell irgendwas zu erreichen. Und selten, wie gesagt, gibt es natürlich auch Ausnahmen, aber das, was ich so mitbekommen habe, ist eigentlich möglichst schnell ans Ziel zu kommen. Da geht es nicht darum, einen schönen Code zu bauen.",
      "start": 1552006,
      "end": 1597110,
      "confidence": 0.7873648648648642,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe aber auch die berufliche Erfahrung gemacht, wo ich mit Doktoren zusammengearbeitet habe, da musste ich denen mal ein bisschen Pragmatismus beibringen, weil die wollten dann natürlich dann immer den perfekten Code schreiben und das muss ja reliable sein bis unter das Dach und so weiter und so fort und in vielen Fällen war das einfach nicht der Fall, zumindest waren das nicht die Anforderungen und da musste ich, schon ein bisschen beibringen und wie man pragmatisch arbeitet, aber auch wie man sich für diese Aufgabe nicht drei Monate im Bunker versteckt und dann nach drei Monaten etwas rauskommt, sondern wie man kleine Milestones macht und dann zum Beispiel täglich deployed, damit man kontinuierlichen Value liefert und nicht erst nach drei Monaten.",
      "start": 1597780,
      "end": 1632203,
      "confidence": 0.8107642276422763,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sowas kann ich natürlich eher nachvollziehen, weil wenn man sich überlegt, wie wissenschaftliches Arbeiten funktioniert, du bist ja meistens alleine oder in einem ganz kleinen Team, aber sehr oft alleine, arbeitest geheim in deinem stillen Kämmerchen, hast wenig Kontakt und arbeitest halt auf diese Publikation hin. Und wenn man dann in einem Team arbeitet, und ich glaube, da ist der größte Unterschied wirklich in einem großen Team oder in einer großen Firma, diese Strukturen, da hast du halt ganz selten irgendwie Zugang auf der Uni. Auch die Teams auf der Uni sind meistens sehr kleine Teams. An der Spitze steht irgendein Professor, der People Management technisch wahrscheinlich weniger Ahnung hat und einfach da ein kleines Team leitet, aber mehr auf der wissenschaftlichen Seite. Also wenn man das vergleicht mit der Industrie, da ist glaube ich ein wirklich großer Unterschied. Und darum ist meiner Meinung nach auch extrem wichtig, dass man als Student oder Studenten einfach möglichst früh den Kontakt zur Industrie sucht, wenn man dort mal auch landen will, nebenbei neben dem Studium arbeiten oder Praktika machen, irgendwelche Projekte machen mit Firmen. Das ist, glaube ich, extrem wichtig, weil man kann diese Dinge nur lernen, wenn man wirklich mal drinnen ist. Wie wirst du dein Teamwork lernen, ohne jemals in einem großen Team gearbeitet zu haben?",
      "start": 1632768,
      "end": 1704659,
      "confidence": 0.8076250000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist ein fairen Punkt, ich würde aber auch sagen, abhängig von deinen Hobbys kannst du das natürlich auch schon lernen. Wenn du jetzt bei den Pfadfindern bist oder eine Pfadfindergruppe leitest, dann kommst du halt nicht weit ohne Teamwork. Weil wenn du nämlich ein großes Zelt aufbauen möchtest, dann brauchst du halt auch Teamwork. Aber das kann man jetzt vielleicht nicht bei jedem voraussetzen.",
      "start": 1705079,
      "end": 1721537,
      "confidence": 0.7096923076923077,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das stimmt, aber du hast natürlich auch noch so Sachen wie, wie arbeitest du jetzt wirklich auf der technischen Seite in dem Team? Wie schaut das aus, wenn du in einem Git arbeitest, wo 30 Leute daran arbeiten tagtäglich? Wie schaut denn das überhaupt mit dem Ablauf aus? Wie stimmst du dich ab? Wie werden so Projekte organisiert? Klar kannst du bei den Pfadfindern lernen, wie verhältst du dich im Team, aber wie werden Projekte organisiert, aufgesetzt im IT-Bereich und was für Tools verwendest du da und was sind da übliche Abläufe. Diese Sachen kann man meiner Meinung nach ganz schwer an der Uni lernen. Und da musst du wirklich konkret halt in den Job. Das ist das gleiche wie du lernst als Elektriker irgendwie, wie du das Kabel biegen musst, aber in der Realität auf der Baustelle, wo dann alles anders aussieht und wie man das dann in der Realität durchzieht und mit mehreren Leuten dort arbeitet und andere Wetterverhältnisse hat und irgendwas wurde vergessen und dann fehlt wieder irgendwas. Diese ganzen Dinge, die kann man eigentlich nur im Job lernen.",
      "start": 1722037,
      "end": 1781399,
      "confidence": 0.8058681318681318,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn wir den Spieß jedoch mal umdrehen, lernt man natürlich auf der Uni auch, selbstständig zu arbeiten und Zeit zu planen, weil wenn man eine Seminararbeit schreiben muss oder irgendeine Deadline hat, etwas zu veröffentlichen, dann muss man sich da leider auf den Popo setzen und Gas geben.",
      "start": 1781759,
      "end": 1796775,
      "confidence": 0.8705208333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da lernt man vor allem das möglichst zu prokrastinieren, da lernt man das prokrastinieren, damit man möglichst lange wartet und dann einen Tag vor der Deadline sich hinsetzt und irgendwas rausknallt, möglichst schnell.",
      "start": 1797055,
      "end": 1811986,
      "confidence": 0.8143333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie man auch immer das macht, man lernt es auf jeden Fall selbstständig bis zu einem bestimmten Datum hinzubekommen.",
      "start": 1812006,
      "end": 1817550,
      "confidence": 0.8490526315789474,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder man fährt einmal ein und weiß dann, dass es so nicht funktionierte.",
      "start": 1817990,
      "end": 1821052,
      "confidence": 0.7763076923076924,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und das merkt man dann hier und da schon im klassischen Beruf, dass es da einen Unterschied gibt zwischen Leuten mit einer akademischen Ausbildung und Leuten, die ihren klassischen Werdegang mit einer Berufsausbildung gemacht haben und so weiter. Viele Leute musst du schon noch wirklich mehr an die Hand nehmen. Und wenn ich jetzt aus Engineering-Manager-Sicht spreche, dann kommt auch oft immer so der Vorwurf an, die du micromanage deine Leute. Und was ich hiermit meine ist, dass als engineering manager werden leute mit berufserfahrung und leute ohne berufserfahrung anders behandelt und meines erachtens nach sollten die auch anders behandelt werden, weil leute die neuen beruf sind juniors oder ähnliches die brauchen halt mehr guidance die brauchen halt mehr händchen halten und, Das ist nicht Micromanaging meines Erachtens nach, sondern es ist nicht alleine laufen lassen und gegen die Wand rennen lassen, weil wenn man konstant gegen die Wand rennt und nichts auf die Kette kriegt, dann ist das auch demotivierend für die Leute. Und viele Leute setzen das gleich mit Micromanaging, was ich völlig falsch sehe. Micromanaging ist vielleicht ein bisschen Kontrollfreak sein oder ähnliches. Man lässt ja von diesen Leuten auch wieder los, umso mehr man merkt, dass diese Leute selbst den Marathon laufen können.",
      "start": 1821092,
      "end": 1891957,
      "confidence": 0.8425990338164249,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie würdest denn du das jetzt ganz allgemein sehen, wenn du jetzt Bewerbungen rein bekommst und du hast da Bachelor, Master, Doctor? Meines Wissens, lass mich mal überlegen, du hast auf jeden Fall Leute ohne Ausbildung eingestellt, oder? Oder sehr Junior-Leute? Du hast Leute mit Doctor eingestellt?",
      "start": 1892157,
      "end": 1908884,
      "confidence": 0.771914893617021,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hab Studienabbrecher eingestellt.",
      "start": 1908924,
      "end": 1910245,
      "confidence": 0.8085,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du meinst jetzt Leute mit einem Bachelor oder wirkliche Studienabbrecher?",
      "start": 1910685,
      "end": 1913928,
      "confidence": 0.5922000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Leute, die ihr Studium begonnen haben und das Studium nie zu Ende gemacht haben.",
      "start": 1913968,
      "end": 1917592,
      "confidence": 0.8343571428571428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Soll ich jetzt die Frage nochmal stellen? Okay, lass mal das. Okay, du hast also alle eingestellt. Das heißt, du hast auf jeden Fall mal einen guten Rekord, dass du keine abgelehnt hast, mit oder ohne Titel.",
      "start": 1917612,
      "end": 1928942,
      "confidence": 0.6192702702702703,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe auch mit und ohne Titel Leute abgelehnt.",
      "start": 1928962,
      "end": 1930964,
      "confidence": 0.7768888888888889,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich, aber du hast ein gutes Sampleset, weil du halt von allen Bereichen Leute eingestellt hast. Jetzt im Nachhinein gesehen, haben sich die Leute genau so entwickelt, wie du dir das gedacht hast? Oder hast du da irgendwo Unterschiede gemerkt?",
      "start": 1931607,
      "end": 1945278,
      "confidence": 0.7935749999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es kommt auf die Art und Weise an, wie du einstellst, wie du das Interview führst und wie du suchst. Umso höher der akademische Titel und umso mehr der studierte Themenbereich zu der Rolle passt, die ich hire, desto mehr hire ich vor Skill oder lege Mehrwert auf Skill. Wohingegen ich bei kompletten Juniors, bei Leuten, die jetzt gerade ihre Berufsausbildung weg haben oder vielleicht sogar Quereinsteiger sind, da gehe ich oft in Richtung hire for Attitude. Motivation sehe ich das Feuer in den Augen. haben die ein eigenantrieb da müssen die nicht alles wissen ich muss aber sehen dass sie sich selbst auf die auf die popo wackel setzen können und die arbeit investieren um sich den kram drauf zu schaffen.",
      "start": 1945318,
      "end": 1988677,
      "confidence": 0.8495327868852459,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bin eh mal froh dass du nicht in meinem interview warst damals bei trivago wenn ihr als datenbank doktor dann manager geworden bin. Gut, dass da andere Leute im Interview waren. Da hätte ich schon zu wenig akademische Ausbildung für den Engineering Manager gehabt.",
      "start": 1988697,
      "end": 2003348,
      "confidence": 0.740659090909091,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, nee, nee, nee, nee. Also ich möchte nicht sagen, dass ich bei akademischen Titeln das Hire for Attitude weglasse. Ich sage nur, dass ich dann erwarte, dass man die Grundlagen und die gelernte Theorie in der Uni, dass man sich schon mal ein paar Gedanken gemacht hat, wie dies in der Praxis denn vorkommt, wie relevant die jeweiligen Bereiche sind und so weiter und so fort. Und auch für die Firma, wo man sich bewirbt. Nehmen wir mal ein Beispiel. Wenn du mir jetzt mit der Mikrosekundenoptimierung bei irgendwelchen Algorithmen ankommst und dich bei Trivago bewirbst für das Frontend, dann bin ich mir nicht sicher, ob Trivagos Business einen wirklichen Uplift hat, wenn du jeden Algorithmus um eine Mikrosekunde optimierst. Bei 10 Sekunden Optimierung ist es eine andere, wie sagt man so schön, Order of Magnitude.",
      "start": 2003368,
      "end": 2054248,
      "confidence": 0.8043357664233576,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ah, du hast mit der Mikrosekunde bei so vielen Usern, bei Millionen von täglichen Usern hast du schon viele Sekunden gespart. Denk doch mal an unsere Umwelt, Green IT, Andi, sparst du ganz viel Strom, wenn du deine Mikrosekunde optimierst.",
      "start": 2054770,
      "end": 2069655,
      "confidence": 0.7661749999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist richtig, der Impact ist aber ein Unterschied, ob du die Optimierung auf Serverseite oder auf Clientseite machst. Denn auf Clientseite wird deine Optimierung nicht fühlbar sein, weil dann bei jedem Rechner eine Mikrosekunde gespart wird. Und das ist in einem Bereich, das spürt der Mensch nicht. Wohingegen auf dem Server, da wäre ich so ein bisschen bei dir, weil dann der Server unter den theoretischen umständen und achtung im stream mache ich hier gerade meine hände mit den anführungszeichen eine optimierung und theoretisch könnte dann der server mehr user abfangen dennoch erwarte ich dann dass du dich wenigstens ein paar minuten damit beschäftigt hast und ob das jetzt wirklich hier der größte uplift ist und dass das die wichtigste aufgabe ist indem man arbeiten sollte oder ob es da nicht größere wie sagt man so schön fish to fry gibt und das meine ich mit higher for skill und higher for attitude ich sage nicht dass man das higher for attitude dann weglässt und speziell bei solchen rollen wie einem Senior Engineer, einem Staff Engineer, wie bei einem Engineering Manager. Das sind ja Multiplikatorrollen. Das sind Rollen, die man bei einem falschen Hire die wirklichen Schaden im Unternehmen machen können und auf die Reputation, auf die Retention des ganzen Teams einen großen Einfluss haben. Speziell da spielt natürlich die Attitude eine wichtige Rolle.",
      "start": 2069935,
      "end": 2150968,
      "confidence": 0.8208222222222219,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hast du irgendwie Erfahrung gemacht, dass das schwer war für so Leute, die jetzt, nehmen wir mal an, die haben irgendwie den Doktor und sind es nicht gewohnt, so in kleinen Schritten zu deliveren und sowas. Da würde ich jetzt argumentieren, okay, das kann jeder schnell lernen. Hast du da irgendwie die Erfahrung gemacht, dass das mal Leute, nicht schnell gelernt haben oder dass das irgendwie ein Problem war, weil die Argumentation ist ja auch immer, dass die Leute, die Studium haben oder in der akademischen Welt waren, sehr anpassungsfähig sind und schnell Sachen verstehen können, gerade jetzt auf der technischen Seite, weil die Grundlagen alle da sind, aber vielleicht auch vom Prozess an sich, dass sich die Leute schneller anpassen, keine Ahnung, oder auch nicht. Hast du da irgendwie Erfahrung damit in die eine oder andere Richtung?",
      "start": 2151603,
      "end": 2193947,
      "confidence": 0.7902028985507251,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe jetzt keinen wirklichen Unterschied festgestellt zwischen Doktoren und Nichtstudierten, ob der eine oder die andere das schneller versteht oder nicht. Ich denke, es kommt immer auf eine wichtige Sache an. Immer wenn du etwas von Leuten möchtest oder erwartest, erklär denen den Hintergrund dahinter und warum wir das machen. Und sofern jeder den Use Case versteht und warum das wichtig ist, dann wird die Zeit, wie die Leute das lernen, sehr reduziert. Natürlich gibt es immer noch Leute mit Lernschwäche und allem drum und dran, das ist aber eine andere Baustelle, da beschäftige ich mich jetzt nicht mit. Aber wenn du den Leuten erklärst, warum das sinnvoll ist, in kleinen Schritten zu delivern, und die Leute haben wirklich eine Motivation, auch etwas für die Firma zu tun und in ihrem Job zu performen, das setzt sich voraus, jetzt hier bei meiner Argumentation. Dann ist es nur eine Sache des Trainings. Ich kann verstehen, dass eine Arbeitsumstellung, wie du arbeitest, Zeit kostet und dass das schwierig ist. Weil jeder hat seine Habits, jeder hat seine Gewohnheiten und Gewohnheiten umzustellen ist schwierig. Besonders wenn du 5 oder Vielleicht auch zehn Jahre für den Doktortitel brauchst.",
      "start": 2194327,
      "end": 2256680,
      "confidence": 0.8314051282051284,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Tja, wer braucht denn so lange für den Doktor?",
      "start": 2256700,
      "end": 2259440,
      "confidence": 0.604,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dann hast du fünf Jahre oder zehn Jahre etwas trainiert.",
      "start": 2259480,
      "end": 2263561,
      "confidence": 0.8568,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Außerdem habe ich es, glaube ich, unter zehn Jahre geschafft. Das waren nur neuneinhalb Jahre oder so.",
      "start": 2263601,
      "end": 2267962,
      "confidence": 0.6120588235294119,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dann lernst du es halt neuneinhalb Jahre und dann gehst du in eine neue Umgebung, wie zum Beispiel in eine Firma, in eine Webfirma, die im Internet Geld verdient, die schnelllebig ist. Und dann musst du innerhalb von wenigen Monaten deine gewohnheit die letzten neuneinhalb jahre gelernt hast ablegen und das ist schwierig da da geht es gar nicht darum um große planung kleine planung da geht es auch um es gewohnheit das ist völlig egal in welchem bereich wir sind das ist psychologie das ist wie menschen verhalten.",
      "start": 2268002,
      "end": 2293855,
      "confidence": 0.8141348314606738,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich glaube das ist eben auch wenn man es von der anderen seite sieht wenn du jetzt, zehn Jahre Java-Developer warst und nur in deinem Java-Ökosystem gearbeitet hast und dann kommst du in irgendein Startup, wo du fünf verschiedene Sprachen verwenden sollst und möglichst dynamisch einfach dazwischen hin und her springen sollst und möglichst viele Bereiche abdecken sollst. Das hast du wahrscheinlich in deinen zehn Jahren Java einfach nie gemacht. Und ich habe auch viele Interviews geführt mit solchen Leuten, die dann auch gesagt haben, na, sie wollen nur Java entwickeln. Sie haben keine Lust, da andere Sachen zu machen. Und das war dann einfach kein Fit, ganz klar, also für beide Seiten, weil du, wenn wir da irgendwie dynamische Leute suchen, dann funktioniert das halt mit solchen Leuten nicht. Das heißt jetzt nicht, dass es nicht Java-Entwickler gibt, die eben auch flexibel sind, aber ich habe eben mit vielen gesprochen, die das nicht waren. Ich glaube Vielseitigkeit ist mir persönlich zumindest einfach immer sehr wichtig und mir war es wichtiger, dass Leute einfach mehr Sachen gemacht haben und nicht wie sie es gemacht haben, ob das jetzt Uni war, in der Industrie oder sonst wo, aber dass sie halt ein breites Wissen einfach mitbringen, weil es für mich ein Zeichen ist, dass die Leute erstens neugierig sind und interessiert sind an Dingen, Und dass sie halt dann auch vielleicht schneller wechseln können oder auch einfach vielleicht ein breiteres Wissen haben. Wenn man breiteres Wissen hat, kann man sich glaube ich auch schneller anpassen an gewisse Dinge und auch die Dinge schneller verstehen.",
      "start": 2294515,
      "end": 2377900,
      "confidence": 0.8115340909090905,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber genau das geht ja in den Bereich Hire for Attitude, was ich erzählt habe. Sind die Leute neugierig? Sind die Leute offen für neue Meinungen, für neue Lösungsansätze? Oder sind diese Personen so stark auf ihre Meinung fixiert und sagen, das ist die einzig richtige Lösung, der einzig richtige Weg, wie wir das jetzt machen.",
      "start": 2377960,
      "end": 2394692,
      "confidence": 0.8719821428571427,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das hat weniger mit dem Studium zu tun oder Nichtstudium, würde ich sagen.",
      "start": 2394712,
      "end": 2398774,
      "confidence": 0.7787142857142858,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau.",
      "start": 2398794,
      "end": 2399454,
      "confidence": 0.776,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir haben bei Trivago, habe ich das ja auch sehr stark erlebt, dass das akademisch ein Schimpfwort war. Das ist ja wirklich tagtäglich als Schimpfwort verwendet worden. Wenn irgendwer was vorgeschlagen hat, was nur irgendwie Wenn es um Patterns gegangen ist oder Refactoring oder Technical Depth oder keine Ahnung, irgendwann ein neues System einführen, was verbessert, was die Welt verbessern sollte oder halt unsere Welt damals, hat es sofort geheißen, ja akademisch, das ist der akademische Herangehensweise, er will nur akademisch da sein und es war sofort so dieses, abcanceln, sofort, das ist nur sinnlos, auch teilweise bis zum C-Level nach oben, ist das als Schimpfwort missbraucht worden. Was mich persönlich natürlich immer gestört habe, weil ich mich da persönlich auch angegriffen gefühlt habe, aber auch viele andere, die einfach was sauber machen wollten, bei denen hat sofort geheißen, ja, das ist akademisch.",
      "start": 2399474,
      "end": 2448208,
      "confidence": 0.7911608391608388,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man muss ja auch sagen, speziell auf das Umfeld, in dem man aktiv ist, da kann dir diese akademische Ausbildung und die ganzen theoretischen Grundlagen natürlich auch sehr helfen. Gehen wir mal in den Machine Learning Bereich, Artificial Intelligence, Big Data, Datenmodelle, Prozessen von Riesenmengen von Daten in sehr kurzer Zeit. Da braucht man natürlich schon diese knallharte Algorithmentheorie. Da braucht man natürlich schon diese Grundlagen von neuralen Netzwerken und allem drum und dran. Was wir natürlich jetzt hier gerade besprechen, ist der sehr generell gehaltene Job eines Entwicklers und einer Entwicklerin, eines Produktmanagers, einer Designerin, einer Engineeringmanagerin oder ähnliches.",
      "start": 2449062,
      "end": 2492383,
      "confidence": 0.83518,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber auch da glaube ich, dass ein Studium durchaus, oder nicht nur durchaus, sondern dass ein Studium wirklich weiterhelfen kann. Und ich habe das auch selber erlebt, weil teilweise sogar bei Leuten, ich glaube, ich habe das Beispiel eh schon mal in irgendeiner anderen Episode gebracht, wo wir etwas einführen wollten, wo binäre Operationen involviert waren und wie schwer das für viele war, auch die, die einen Mastertitel teilweise gehabt haben oder zumindest ein Bachelor. die einfach noch nie etwas von einer binären Operation gehört haben in ihrem Leben. Und die wollten teilweise auch das nicht unbedingt verstehen, kommt natürlich noch dazu, aber da hast du halt eine gewisse Grundlage oder eine Basis Wissen, was dir einfach hilft, um solche Sachen zu verstehen. Oder wenn es dann um, was wir letztes Mal besprochen haben, wenn man dann mit Redis irgendwie mal in die Tiefe gehen muss, was passiert da eigentlich mit einer HashMap, was passiert da vielleicht für einen Algorithmus, was wird da gemacht? Solche Grundlagen, Lernst du halt auf der Uni, auch wenn du sie vielleicht gar nicht brauchst und später kommst du mal irgendwann drauf, oh, das Basiswissen ist jetzt vielleicht ganz hilfreich, die O-Notation, wie wir das auch letztes Mal in der Episode 28 besprochen haben. Und wenn ich da wieder einen Vergleich verwenden darf zum Elektriker, Der Elektriker lernt ja auch in der Theorie sehr viel über Strom und lernt nicht nur Hochvoltanlagen, also was wir so im Haushalt haben mit den 230 Volt, sondern auch zum Beispiel Niedervolt. Irgendwie was passiert bei 12 Volt. Die meisten Elektriker haben wahrscheinlich ihr Leben lang nie mit diesen niedrigen Voltzahlen mehr gearbeitet. Die machen einfach irgendwelche Hausinstallationen. Und jetzt plötzlich wird Gleichstrom mit Solaranlagen zum Beispiel wieder extrem wichtig. Und vielleicht erinnern sich jetzt viele zurück, wie war das mit dem Gleichstrom und haben dort die Grundlage schon und können jetzt vielleicht mit Solaranlagen das ganze System besser verstehen. Also auch da lernt man halt in der Ausbildung oft Sachen, die man akut nicht braucht, aber später dann irgendwann mal ganz hilfreich sind, weil man einfach ein gewisses Basiswissen hat.",
      "start": 2493118,
      "end": 2614309,
      "confidence": 0.8096090651558074,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist richtig. Aber ich möchte auch sagen, die Leute ohne akademische Ausbildung, und da kommen wir wieder zurück auf dieses Hire for Attitude, sind relativ schnell in der Lage, sich einen Überblick über ein Thema zu beschaffen, nennen wir es mal Binär-Operationen. Es ist ja nicht so, als gibt es kein YouTube, gibt es kein Google, es gibt ja die größte Education-Plattform meines Erachtens nach, das Internet.",
      "start": 2614349,
      "end": 2636636,
      "confidence": 0.8147826086956522,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du kannst auch die Wikipedia-Seite durchlesen.",
      "start": 2636696,
      "end": 2638637,
      "confidence": 0.4088333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Punkt ist, du kannst ja inzwischen alles lernen. Und das meine ich ja mit Hire for Attitude. Es kommt ein neues Thema, die Leute setzen sich mal eine Stunde oder zwei hin und verschaffen sich einen Überblick. Keiner erwartet, dass man in jedem Thema ein Experte ist. Doch es geht darum, offen für Neues zu sein und dir wenigstens einen Überblick zu schaffen und wissbegierig. Wissbegierig muss man ja generell sein für den Job des Softwareentwicklers und der Softwareentwicklerin, weil du musst halt schon so eine gewisse Tendenz haben, tief in ein Thema einsteigen zu wollen. Und du musst auch eine gewisse Resistenz mitbringen. Ich frage die Leute oft, was begeistert die eigentlich an Softwareentwicklung? Weil Softwareentwicklung ist eigentlich eine total schreckliche Sache für dein Leben. Du sitzt vor dem Computer, programmierst, programmierst, programmierst. Drei Stunden, vier Stunden, vielleicht auch acht Stunden. Vielleicht hast du acht Stunden durchprogrammiert. Drückst auf Compile und der Computer schreit dich an. Mäh. Semikolon in Zeile 4711. Ist doch total frustrierend. Dann kriegst du die Semikolon, dann machst du das Semikolon dahin, und bist du vielleicht noch in der Skript-Sprache, hast keine konkrete Typisierung. Can't convert into float. Es ist total frustrierend. Und danach bist du erst mal eine Stunde oder zwei Stunden damit beschäftigt, irgendwelche Fehler aus deinem schwarzen Terminal an einem hellen Tag, wo die Sonne vielleicht noch auf den Screen knallt, zu beheben. Und am Ende bist du dann noch im Web unterwegs und dein Button sitzt halt nicht richtig aligned, weil du ihn nicht vertikal und horizontal zentrieren kannst. Es ist eine total frustrierende Arbeit- und Handwerksgeschichte meines Erachtens nach. Und deswegen frage ich mich halt oft, warum machen die Leute das? Und auf Basis dieser Antwort kann man sehr viel herausfinden.",
      "start": 2639097,
      "end": 2737337,
      "confidence": 0.7974295532646047,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was wäre denn da jetzt eine perfekte Antwort, die du gerne hören würdest? Oder hast du da irgendwie mal eine coole Antwort gehört? Weil für die Fehlermeldungen bin ich kein Programmierer geworden.",
      "start": 2737357,
      "end": 2746763,
      "confidence": 0.6899687500000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube das ist keiner. Ob es die perfekte Antwort gibt, weiß ich nicht. Was man aber glaube ich sehr gut sehen kann, ist ob die Antwort auf dem Herzen kommt. Wenn die Leute anfangen mit einem konkreten.",
      "start": 2747253,
      "end": 2756482,
      "confidence": 0.8061578947368421,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Problem Ja, das ist jetzt sehr romantisch, die Antwort vom Herzen, warum man denn in die Programmiersprache verliebt ist.",
      "start": 2756522,
      "end": 2763157,
      "confidence": 0.389578947368421,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Von Herzen meinte ich eher mit dem eigenen Antrieb. Es gibt Leute, die gehen in den Job, weil in der IT wird sehr gut bezahlt. Ja, das kann eine Motivation sein, alles super. Aber diese Motivation, die hat keinen intrinsischen Driver, meines Erachtens nach. Wenn du jetzt aber jedoch mal ein eigenes Problem hast und du bist kein Softwareentwickler und du setzt dich mit der Materie auseinander, du baust dir eine kleine Automatisierung, Und löst das dann am Ende? Wie das dann auch gelöst ist, ist ja völlig egal. Hauptsache es läuft und löst dein Problem.",
      "start": 2763317,
      "end": 2792229,
      "confidence": 0.7920104166666664,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann da eigentlich nicht nur die einzige Antwort sein, man will irgendwie etwas erschaffen und das Resultat ist dann das ausschlaggebende? Oder hast du jemals gehört, dass irgendwer sagt, er ist an dem Tool an sich interessiert und er programmiert, weil er programmieren will, weil die Sprache so schön ist?",
      "start": 2792269,
      "end": 2809954,
      "confidence": 0.8124000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, ich habe schon alles in dem Bereich gehört. Es ist ja auch okay, weil jeder Mensch anders ist. Doch das ist halt der Unterschied, was ich auch so ein bisschen meine mit Hire for Attitude. Wenn du solche Leute hast, die konstant lernen wollen, die sich weiterentwickeln wollen, die nicht stehenbleiben wollen, die auch bereit sind, mal zwei Schritte nach links zu gehen, das ist halt Lernfähigkeit. Und dann ist mir auch egal, ob du Doktor bist oder Maler und Lackierer. Weil diese intrinsische Motivation haben sehr viele Leute ja auch in der Freizeit. Super viele Leute machen zum Beispiel Holzbearbeitung in der Freizeit. Bauen sich kleine Schränke oder ähnliches. Und irgendwo müssen die das ja auch gelernt haben. Vielleicht learning by doing, ist ja völlig egal. Punkt ist, diese intrinsische Motivation, diese Lernfähigkeit und dieses Spaß für dieses Handwerk muss ja irgendwo herkommen. Und ich frage mich die ganze Zeit, warum kann man diesen Spaß für dieses Handwerk nicht bei seinem täglichen Job haben? Warum sucht man sich immer einen Job, bei dem man nicht auch Spaß hat, den man gerne macht? Natürlich gibt es immer Areale im Job, die nicht so Spaß machen. Aber dafür wird man ja auch dann im Endeffekt bezahlt. Aber es bockt ja keinen, das zu machen, was man liebt. Und ich denke, das ist so eine sehr gute Kombination. Und das ist speziell bei Leuten, die Quereinsteiger sind, die noch nicht so viel Erfahrung haben, für mich immer so ein Kicker, da wo ich sage, okay, diese Leute können alles lernen, diese Leute haben Bock. Und da setze ich dann natürlich keine akademische Ausbildung voraus.",
      "start": 2809994,
      "end": 2893213,
      "confidence": 0.8157956204379564,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Würdest du jetzt quereinsteigend empfehlen, nebenbei noch ein Studium zu machen, irgendwie so am Abend Fernstudium, was es da halt so für Konstrukte gibt, berufsbegleitend?",
      "start": 2893921,
      "end": 2902606,
      "confidence": 0.6998000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe es gemacht und ich muss sagen, es ist sehr, sehr anstrengend. Es ist nicht anstrengend in den ersten sechs Monaten.",
      "start": 2903146,
      "end": 2908189,
      "confidence": 0.7838636363636362,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es war bei dir berufsbegleitend?",
      "start": 2908249,
      "end": 2909950,
      "confidence": 0.7352,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Berufsbegleitend, genau. Ich habe gegen fast zeitgleich, als ich meine Ausbildung gemacht habe, habe ich abends und am Wochenende dann noch an der Fachhochschule für Ökonomie und Management Wirtschaftsinformatik auf Bachelor of Science studiert, genau.",
      "start": 2909990,
      "end": 2922838,
      "confidence": 0.7579428571428574,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Moment, während der Ausbildung?",
      "start": 2923533,
      "end": 2924617,
      "confidence": 0.9115,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja.",
      "start": 2925018,
      "end": 2925440,
      "confidence": 0.725,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt, du hast zwei Ausbildungen parallel gemacht?",
      "start": 2925480,
      "end": 2927950,
      "confidence": 0.723375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, oder ein bisschen versetzt.",
      "start": 2927990,
      "end": 2929074,
      "confidence": 0.7842,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das nennt sich Attitude.",
      "start": 2930234,
      "end": 2932836,
      "confidence": 0.33725000000000005,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Sache ist, wenn man ein Studium nebenbei beginnt, nebenbei meine ich entweder an so einer privaten Fachhochschule in dem Abend- und Wochenendmodell oder an einer Fernuni, in Deutschland gibt es dann die Fernuni Hagen zum Beispiel, oder es gibt auch super viele staatliche Universitäten, die auch sowas anbieten. Ich weiß, die Universität Bochum macht sowas im Security-Bereich. Das ist schön. Das sieht auch total toll aus, und das macht man dann vielleicht auch, wenn man noch in der Honeymoon-Phase ist, so die ersten zwei, drei Monate, hey, alles spannend, wie kommt man denn hier klar? Jeder sollte sich mal wirklich bewusst werden, ob man das wirklich leisten kann, weil spätestens nach sechs, sieben, acht, neun Monaten wird's richtig anstrengend. Spätestens nach der zweiten Klausurphase wird's richtig anstrengend, wenn man sich dann noch dahinsetzen muss, Seminararbeiten schreiben muss. Und diese Klausuren sind ab und zu auch echt nicht einfach, man muss wirklich, wirklich lernen. Und dann fragt man sich schon, okay, warum mach ich die? Was ist die Motivation, um diesen akademischen Abschluss zu haben? Denn meines Erachtens nach braucht man für einen Großteil der aktuellen Jobsuche im IT-Sektor keinen akademischen Abschluss. Zum Beispiel, ich habe das größtenteils gemacht wegen, das hört sich jetzt total hochgestochen an, aber akademischen Spaß. Und ich überlege mir jetzt immer mal wieder, kommt auch der Gedanke hin, mach ich noch ein Masterstudium? Einfach nur des akademischen Spaßes wegen, weil manche Bereiche finde ich unglaublich interessant und da würde ich einfach mehr darüber erfahren wollen. Das Masterstudium würde mich beruflich nicht mehr weiterbringen, weil ich diverse Jahre berufliche Erfahrung habe. Also es würde nicht mehr auf mein Gehalt einspielen oder ähnliches. Dennoch würde ich gerne so etwas machen. Ich mache es gerade nicht wegen der Zeit.",
      "start": 2932876,
      "end": 3025502,
      "confidence": 0.8085360824742268,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In Österreich gibt es so ein Konzept, das nennt sich Bildungskarenz. Gibt es sowas in Deutschland auch? Das heißt, du kannst, wenn der Arbeitgeber einverstanden ist, kannst du, ich glaube, ein paar Jahre sogar oder ein Jahr quasi deinen Job so ähnlich wie mit einem Sabbatical pausieren und bekommst dann aber vom Staat ein Teil zumindest von deinem Gehalt, aber relativ viel bezahlt. Also es ist so, wie wenn du ein Kind bekommst, nur dass du eben eine Bildung konsumierst.",
      "start": 3025542,
      "end": 3054403,
      "confidence": 0.7641250000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Klingt cool, bin ich mir nicht sicher, ob sie sowas haben. Ich glaube, wir haben sowas nicht. Ich würde es aber nicht ausschließen, weil der Bund bietet sehr, sehr viele Förderprogramme, von denen die meisten Leute keine Kenntnis haben und deswegen weiß ich nicht.",
      "start": 3054443,
      "end": 3067369,
      "confidence": 0.7855454545454545,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also das ist recht unkompliziert zu bekommen, solange der Arbeitgeber zustimmt. Und ich kenne auch sehr viele Leute, die es machen. Gibt es auch Teilzeit, dass du eben halb arbeitest und halb studierst zum Beispiel. Voraussetzung ist, dass du eben noch, glaube ich, kein Studium hast. Also kannst du jetzt nicht endlos studieren.",
      "start": 3067729,
      "end": 3083300,
      "confidence": 0.7889245283018869,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ich jedoch weiß, ist, dass viele Arbeitgeber ein Studium nebenbei fördern, teilweise mitfinanzieren. Besonders größere Unternehmen haben sowas bereits in Prozessen in ihrem Lernmodell hinterlegt. Kleinere Firmen, wenn man dann mal mit seinem Vorgesetzten spricht und das mal anstößt, sind da auch sehr offen für. Zum Beispiel damals, als ich mein privates Studium gemacht habe, hat mich meine Firma ebenfalls dabei unterstützt, auch finanziell. Das kann ich nur empfehlen, aber ich würde jeder Person wirklich empfehlen, bei vielen Dingen, die ihr macht, wo wollt ihr arbeiten, welchen Job sucht ihr euch, wollt ihr studieren oder nicht, seid ihr vielleicht Quereinsteiger oder überlegt, von einem ganz anderen, nicht-informationstechnischen Bereich in die Informationstechnik zu gehen, überlegt euch immer, was ist eure Motivation. Denn ohne die richtige Motivation habt ihr kein langes Durchhaltevermögen. Wenn die Motivation stimmt, habt ihr einen Treiber, Und das macht die ganze Sache deutlich einfacher, länger durchzuhalten. Weil das Problem ist nicht zu starten. Das Problem ist wirklich durchzuhalten und die ganze Sache über einen längeren Zeitraum zu machen.",
      "start": 3083840,
      "end": 3146987,
      "confidence": 0.8149941520467835,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sehr interessant, weil du sagst, manche Arbeitgeber unterstützen das. Man würde meinen zum Beispiel Google als Vorbild-Arbeitgeber, würde ich fast sagen, unterstützt sowas auch. Aber meines Wissens, zumindest vor ein paar Jahren, habe ich mal die Aussage gehört von einem HR-Menschen bei Google, den ich gefragt habe, wie sie das so machen, ob sie das unterstützen. Und er hat nur gemeint, ja, natürlich unterstützen wir die Leute. Wir akzeptieren die Kündigung sofort und wünschen dann auch viel Glück und sie können sich dann gern nach dem Studium noch einmal bei ihm melden. Aber Google ist ja auch bekannt dafür, dass sie beinahe nur mehr Leute einstellen, die einen Doktor haben und das einfach voraussetzen können, beziehungsweise so viele Bewerbungen haben, dass sie sich das halt einfach aussuchen können.",
      "start": 3147536,
      "end": 3188334,
      "confidence": 0.8100312499999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man natürlich auch sagen muss, du hast auch kein gutes Team, wenn du nur Doktoren hast.",
      "start": 3188394,
      "end": 3191756,
      "confidence": 0.6236470588235294,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das musst du Google sagen.",
      "start": 3192296,
      "end": 3193456,
      "confidence": 0.5515999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bezüglich des akademischen Titels und der Jobsuche ist es natürlich auch so, ich habe ich eine kleine Story. Damals, 2012, 2013, als ich auf Jobsuche war, habe ich mich neben Trivago auch bei Aldi Süd beworben. Auf einer Stelle, die ich sehr interessant fand, wurde eingeladen, kam ins Bewerbungsgespräch. Am Ende des ersten Bewerbungsgesprächs wurde mir gesagt, Herr Grumwald, Sie sind für die Stelle, auf die Sie sich beworben haben, qualifiziert, aber ich kann Ihnen die leider nicht geben. Entschuldigen Sie, warum können Sie mir diese nicht geben? Diese Stelle bedarf einer akademischen Titel und ich sehe, Sie haben Ihren Bachelor of Science noch nicht abgeschlossen. Das ist korrekt, aber ich verteidige diese Arbeit in drei Monaten. In drei Monaten ist die bereits geschrieben oder in vier oder fünf Monaten relativ nah auf jeden Fall. Gibt es denn die Möglichkeit, dass ich bei Ihnen anfange und sofern ich dann den Titel habe, dass ich dann in diese höhere Stelle rutsche? Nee, das kann ich Ihnen nicht versprechen. Das war für mich dann ein K.O.-Kriterium in der Hinsicht.",
      "start": 3193476,
      "end": 3246321,
      "confidence": 0.8123841807909606,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenigstens war er ehrlich.",
      "start": 3246341,
      "end": 3247743,
      "confidence": 0.655,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Mir wurde gesagt, ich bin für die Stelle qualifiziert, aber aufgrund von Schema F kann ich diese Stelle nicht haben. Damals war ich enttäuscht. Inzwischen verstehe ich es. Große Firmen müssen Fairheit schaffen. Ob man diese Barriere als Fairheit einführen sollte, weiß ich jetzt auch nicht, muss ich zugeben. Oder ob es da nicht andere Mittel gibt, wie zum Beispiel strukturierte Interviews oder irgendwelche Assessment-Centers, um zu schauen, dass auch nicht Leute ohne akademischen Titel für eine Stelle qualifiziert sind. Man muss aber auch dazu sagen, das war 2012, 2013. Damals war ich ein bisschen enttäuscht, aber ich kann verstehen, warum. größere Firmen ein Schema F brauchen und deswegen auch zum Beispiel Google sehr viel voraussetzt, wie zum Beispiel irgendwelche super tiefen Informatikfragen im ersten Hiring-Manager-Call oder im ersten Recruiting-Call, weil die sagen, okay, wenn du irgendwie nichts von Bitshifting verstehst, dann brauchst du hier ja gar nicht anfangen. Das können die voraussetzen, weil die halt einfach nur eine Art von Filter brauchen.",
      "start": 3247783,
      "end": 3308633,
      "confidence": 0.8345153374233131,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hoffe, dass es bei Aldi mittlerweile anders ist, aber ich kenne auch noch einige Firmen und gerade wenn es keine IT-Firma ist, also die ein IT-Produkt hat und die vielleicht für den ganzen Konzern oder für die ganze Firma da ein Schema haben, eben wie Aldi zum Beispiel, der halt auch Leute in den Filialen zum Beispiel hat und nicht nur IT-Leute, Dann kenn ich das schon auch noch, dass die Firmen genau das haben und die Titel spielen da eine große Rolle oder die Ausbildung spielt eine große Rolle und da kannst du teilweise einfach gar nicht mehr in Stufen höher steigen ohne Studium. Also das Problem gibt es definitiv immer noch. Finde ich sehr schade und gehört meiner Meinung nach gelöst, weil, wie gesagt, es gibt extrem fähige Leute ohne Studium und es gibt leider auch extrem unfähige Leute mit Studium. Also das als Kriterium zu setzen, das kann eine Hilfe sein, aber das als hartes Kriterium zu machen, ist meiner Meinung nach absolut fehl am Platz. Und man sieht ja jetzt mittlerweile bei den meisten Stellenausschreibungen auch schon Hochschulabschluss oder gleichwertige Berufserfahrung. Also das sieht man ja wenigstens in den Jobausschreibungen schon öfter.",
      "start": 3309086,
      "end": 3373531,
      "confidence": 0.8112538071065989,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich denke, die ganze Thematik wird sich aber auch in den nächsten paar Jahren ändern. Man redet ja von Generation Z, Generation Y und so weiter und so fort. Und ich denke, dass in vielen klassischen Firmen oder traditionellen Firmen Leute an Entscheidungspositionen sitzen, die gegebenenfalls noch eine alte Denkensart haben. Über Zeit wird diese Denkensart sich meines Erachtens nach anpassen müssen, auch um am Markt relevant bleiben zu müssen oder zu können. Deswegen stelle ich mal die These auf, Zeit wird viele dieser probleme die wir jetzt gerade ansprechen oder diese herausforderung lösen man muss aber auch mal ganz kritisch fragen sind das denn probleme ist denn schema f und das requirement eines akademischen abschlusses für einen gewissen job ein ein fehler weiß ich nicht ich will aber auch sagen dass ich sehr sehr fähige leute ohne akademischen titel gesehen habe ich habe sehr sehr fähige leute mit akademischen titel gesehen und ich habe auch Quereinsteiger gesehen die sehr sehr gute arbeit machen zum beispiel haben wir zwei ehemalige kollegen grüße an den dejan so viel ich weiß war dejan maler und lackierer und ist dann zum softwareentwickler geworden natürlich ist er dann nicht sofort bei trivago eingestiegen vom maler und lackierer sondern war dann zwischenzeitlich bei einer anderen webagentur aber, Diese Person hat eine so hohe intrinsische Motivation, er ist ein unglaublich fähiger und guter Entwickler geworden.",
      "start": 3374021,
      "end": 3455591,
      "confidence": 0.8557598253275106,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ist Teamlead mittlerweile oder?",
      "start": 3455651,
      "end": 3458312,
      "confidence": 0.5506,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Teamlead oder wenn nicht sogar Teamlead von Teamleads genau, also Director nennt sich das dann glaube ich. Er lief aber auch immer mit einem Fachbuch rum und hat in jeder Pause irgendwas gelesen, hat er mir auch mal erzählt. Weil er ab und zu das Gefühl hat, dass als Quereinsteiger muss er mehr tun, um auf den gleichen Wissenbasis zu kommen. Meines Erachtens nach hat er schon sehr, sehr viele Akademiker weit überholt. Aber er hat auch Spaß dran, da merkt man halt schon die Motivation. Die andere, das andere Beispiel, was ich nennen möchte, ist die Melanie. Auch da Grüße an sie. Sie war mal im Assistenzbereich von einer großen Firma, für eine große Managementfirma. Und ist dann noch als Quereinsteiger zu einer Webfirma gegangen, weiß ich gar nicht in welcher. Auf jeden Fall ist sie jetzt PHP Entwickler.",
      "start": 3458352,
      "end": 3505445,
      "confidence": 0.8051857142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Würdest du demnach sagen, für Quereinsteiger macht es mehr Sinn, irgendwo bei einer kleinen Agentur oder bei einer kleinen Firma zu starten, anstatt irgendwie bei einer größeren Firma anzufragen, weil die vielleicht flexibler sind?",
      "start": 3505465,
      "end": 3518430,
      "confidence": 0.836235294117647,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich denke, dass bei größeren Firmen oder speziell bei Start-ups und High-Growth-Firmen die Anforderungen an die jeweiligen Mitarbeiter andere sind. Ich denke, speziell wenn es an Job-Leveling geht, Junior, Senior, Staff und so weiter und so fort, ich denke, dass da mehr auf Performance-Kriterien angelegt werden, wo kleinere Firmen oft solche Strukturen wie Performance-Kriterien, Performance-Measurement und so weiter gar nicht haben und deswegen diese kleineren Firmen, kleine Webagenturen zum Beispiel, sehr, sehr gut sind, um einen Job reinzuschnuppern. Weil vielleicht auch ab und zu, je nach Webagentur, natürlich die Probleme gar nicht so komplex sind. Ich lehne mich mal weit aus dem Fenster, aber wenn man jetzt eine kleine Landingpage macht mit Kontaktformular für eine Apotheke oder den lokalen Doktor, ist das für Quereinsteiger, kann das schon eine sehr herausfordernde Aufgabe sein. wohingegen neuer Microservice weltweit skaliert auf Kubernetes, der in Kafka schreibt, und sich beim Startup noch irgendwas, die Level DB von lokal auf Disk in den Memory zieht, bla, bla, bla. Also, ich glaub, das sind schon zwei Welten. Und bis man dann die Komplexität von modernen Websystemen komplett überschauen kann als Quereinsteiger, da möchte ich jetzt niemandem zu nahe treten, Aber ich denke, es ist wie bei jedem Lernprozess von einem neuen Skill. Man fängt klein an und wächst mit seinen Aufgaben. Und deswegen denke ich, eine kleine Webagentur oder ähnliches ist ein super Start. Und von da geht man dann weiter. Man muss ja nicht in einer kleinen Webagentur in Rente gehen. Man schaut, ob man da wirklich Spaß dran hat und so weiter und so fort. Nach ein, zwei, drei Jahren kann man dann ja immer noch weiter gucken.",
      "start": 3518940,
      "end": 3612892,
      "confidence": 0.812248175182481,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hab keine Ahnung, ob wir jetzt Schüler oder Schülerinnen haben, die uns auch zuhören, aber würdest du ein Studium empfehlen, wenn man in den ganzen IT-Bereich einsteigen möchte?",
      "start": 3613052,
      "end": 3621777,
      "confidence": 0.7147241379310346,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaub, da kommt's immer ganz drauf an, in welchem IT-Bereich man einsteigen möchte und was man für Vorkenntnisse hat. Ich seh das immer so, wenn ich mir so einen Hörsaal von Informatikstudenten ansehe, und ich hab schon auch mal die ein oder andere Lehrveranstaltung geleitet.",
      "start": 3622037,
      "end": 3636746,
      "confidence": 0.7884999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber auch nur auf so einer Hochschule.",
      "start": 3636766,
      "end": 3638206,
      "confidence": 0.534625,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es tut mir leid, dass du jetzt hier mit dem Pöbel reden musst.",
      "start": 3638467,
      "end": 3640708,
      "confidence": 0.6879230769230769,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Heißt das bei euch übrigens auch Fachhochschule?",
      "start": 3641148,
      "end": 3643350,
      "confidence": 0.6578571428571429,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt Hochschule, es gibt Fachhochschule.",
      "start": 3643390,
      "end": 3645412,
      "confidence": 0.7991666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wo ist der Unterschied?",
      "start": 3645432,
      "end": 3646332,
      "confidence": 0.70075,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du nicht gesagt, man kann das alles auf Wikipedia nachschauen?",
      "start": 3646392,
      "end": 3648734,
      "confidence": 0.6052727272727272,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das stimmt allerdings. In Österreich gibt es nur Fachhochschulen. Ich glaube die Uni ist ja eigentlich auch eine Hochschule. Hochschule ist vielleicht der Überbegriff. Kann das sein? Bei uns in Österreich ist das glaube ich so.",
      "start": 3648774,
      "end": 3659643,
      "confidence": 0.7245555555555554,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich meine, ich habe auch immer irgendwo gelesen, dass es gar keine Fachhochschulen mehr gibt. Ist ja überhaupt völlig egal. Soll man ein Studium haben? Es kommt immer ganz auf die, auf deine Aspiration an. Wenn du jetzt sofort, deine erste Firma soll Google sein, Microsoft oder ähnliches, dann macht zum Beispiel ein Studium in der Mathematik oder ähnliches schon Sinn. Wenn du jetzt aber sagst, nö, ich möchte einfach programmieren, ich habe Spaß und so weiter und so fort, das hindert einen nicht, dann später auch bei Google, Microsoft, Netflix und so weiter zu landen. Doch es kommt immer ganz drauf an was was du so drauf hast und in welchem bereich der informatik du du sein möchtest möchtest du projektmanager sein productowner möchtest du manager sein möchtest du softwareentwickler softwareentwicklerin sein möchtest du data scientist es kommt immer ganz drauf an ich würde sagen. Es ist kein Muss. Ich würde sagen, wenn du eine intrinsische Motivation hast und ordentlich Drive, dann kriegst du auch als Junior ohne Studium nach dem Abi einen Job. Mit Studium ist es wahrscheinlich leichter, wirf dich aber auch um dreieinhalb bis vier bis sechs Jahre zurück, wenn du so möchtest, in deiner beruflichen Laufbahn, weil du erstmal das Studium absolvieren möchtest.",
      "start": 3660208,
      "end": 3721104,
      "confidence": 0.7309038461538458,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, du kannst ja auch nur Bachelor machen.",
      "start": 3721144,
      "end": 3722866,
      "confidence": 0.5185000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, dann ist es dreieinhalb Jahre oder drei Jahre.",
      "start": 3722886,
      "end": 3724427,
      "confidence": 0.5568888888888889,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also meine Empfehlung wäre, auf jeden Fall mal ein Bachelor zu machen, wenn man Matura oder Abitur hat, also wenn man die Möglichkeit hat zu studieren. Wenn nicht, dann gibt es sicher gute andere Wege, aber sonst würde ich mal ein Bachelor machen, einfach um reinzuschnuppern und dann kann man ja entscheiden, ob man weitermachen will oder nicht. parallel auf jeden Fall zu arbeiten. Irgendwo. Zumindest im Praktika, aber am besten einfach irgendwie einen 10-Stunden-Job oder 15-Stunden-Job neben dem Studium. Das sollte sich schon irgendwie unterbringen lassen. Vielleicht nicht sofort im ersten Semester, einmal ein, zwei Semester studieren, dann sich irgendeinen Programmierjob oder sowas zu suchen, weil da bekommt man einfach beide Seiten super mit.",
      "start": 3725102,
      "end": 3765132,
      "confidence": 0.8202173913043476,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich denke, auch ein super Einstieg ist die Mitarbeit von Open-Source-Projekten. Speziell, wenn man an größere Open-Source-Projekte geht oder an was Komplizierteres, ich nenne es mal einen Compilerbau oder an der Programmiersprache. Wenn man das neben seinem Studium macht oder neben seiner Ausbildung oder neben seiner Freizeit oder in eurer Freizeit, dann ist das natürlich ein super Kickstart. Nicht jeder braucht einen Compilerbau, muss ich zugeben. Aber das zeigt natürlich auch schon, wie weit man ist und macht so eine Art von ... Requirements von irgendeinem Studium natürlich schon ein bisschen wert. Angenommen ich habe jetzt ein Studium gemacht, ich habe jetzt ein Diplom oder ein Bachelor, würdest du mir empfehlen weiterzumachen und dann ein Doktortitel anzustreben?",
      "start": 3765544,
      "end": 3803369,
      "confidence": 0.7488376068376074,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also wenn du Master schon hast, sonst Master kann ich auf jeden Fall empfehlen, weil es schon nochmal eine gute Breite gibt. Wie gesagt, meine Favoritvariante ist immer nebenher zu arbeiten. Also ich gehe von dem Bereich jetzt aus, weil nur Uni und nur akademisch, da ist man schon sehr eingeschränkt. Ist natürlich schon auch möglich, aber man vergibt sich da natürlich auch eine gewisse Chance, andere Sachen auch zu lernen. Doktor kann man machen, wenn man wirklich sehr interessiert ist oder halt in die akademische Welt sowieso reingehen will. Wenn man in die Industrie will, braucht man garantiert keinen Doktor. Wenn man die Zeit hat, kann es auch in der Industrie noch so einen Industriedoktor machen, berufsbegleitend, in Kooperation mit einer Uni vielleicht die Möglichkeit gibt es auch. Ist auf jeden Fall kein Muss, aber wenn man klar dazu Lust hat, ist gut. Man braucht sich aber nicht erwarten, dass man dann automatisch mehr verdient, automatisch bessere Jobs bekommt. Ich glaube, die Zeiten sind vorbei, wo man einfach mit dem Doktor dann durchs Leben geht und ein feines Leben hat.",
      "start": 3803409,
      "end": 3860413,
      "confidence": 0.8283646408839775,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber es gibt auch die Möglichkeit, mit einem Bachelorabschluss einen Dr. Vater zu finden, oder? Ein Master ist kein hartes Requirement, oder?",
      "start": 3860753,
      "end": 3867876,
      "confidence": 0.7846818181818183,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Für Deutschland bin ich sowieso überfragt. Ich glaube, in Österreich brauchst du einen Master.",
      "start": 3867896,
      "end": 3872757,
      "confidence": 0.721,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Diese Frage überlassen wir unseren Hörerinnen und Hörern. Wenn ihr darüber mehr Kenntnis habt, schreibt uns doch einfach mal eine E-Mail an stetisch at engineeringkiosk.dev oder sagt uns kurz über Twitter Bescheid at ingkiosk. Dort sind wir Tag und Nacht erreichbar.",
      "start": 3872797,
      "end": 3886642,
      "confidence": 0.8068292682926831,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und natürlich auch gerne eine Voice Message auf unsere WhatsApp-Nummer, die steht in den Show Notes. Freuen wir uns natürlich auch immer, würden wir dann auch in den nächsten Episoden gerne einbauen, wenn es passend ist und darüber sprechen. Natürlich klären wir das vorab mit euch ab, also keine Angst, dass wir da irgendwas veröffentlichen.",
      "start": 3887243,
      "end": 3904422,
      "confidence": 0.8181272727272726,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das waren wieder wir beide, Andi und Wolfgang. Einmal aus dem Duisburger Kioskstudio und einmal aus dem Innsbrucker Kioskstudio. Wir hoffen ihr hattet ein bisschen Spaß in dem ganzen Thema Hochschule, Ausbildung, Uni, Akademisch, Doktortitel. Ist das überhaupt relevant? Muss das sein? Was gibt es für unterschiedliche Ausbildungsmodelle? Und ansonsten wünschen wir euch einen schönen Tag. Ciao!",
      "start": 3904722,
      "end": 3930013,
      "confidence": 0.8288947368421052,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.7973348130442177,
  "audio_duration": 3936.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
