{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/acb5234c-92c1-4998-8c83-ddb1b16fff38/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62xa2r3eph-377f-4660-a071-4f3864b7c2fc",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Wenn ich euch in der Nacht aufwecke und frage, wie sieht euer Recruiting-Prozess aus? Könnt ihr es beantworten? Habt ihr einen Recruiting-Prozess? Wer entscheidet bei euch, ob jemand eingestellt wird und wie kommt diese Entscheidung zustande? Recruiting ist doch das Wichtigste in der Firma, oder? Und damit willkommen zu einer neuen Episode im Engineering-Kiosk, in der wir genau diese Fragen klären und aus unseren vielen Jahren IT-Recruiting erzählen. Und nebenbei versuchen wir auch noch herauszufinden, ob man False Positives oder False Negatives optimieren sollte. Los geht's. Rolfgang.",
            "start": 3405,
            "end": 33904,
            "confidence": 0.8197241379310347,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wusstest du eigentlich, dass wir eins unserer Jubiläen verpasst haben?",
            "start": 37212,
            "end": 40914,
            "confidence": 0.7292000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Von uns Zweien.",
            "start": 40954,
            "end": 42054,
            "confidence": 0.7433333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Von uns Zweien. Von uns Zweien und diesem Side Project, diesem Podcast.",
            "start": 42074,
            "end": 46637,
            "confidence": 0.7694166666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und zwar welches?",
            "start": 46677,
            "end": 47837,
            "confidence": 0.8276666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und zwar haben wir das Jubiläum der Perlenhochzeit verpasst. Die Perlenhochzeit wird bei einem 30. Hochzeitstag gefeiert.",
            "start": 47877,
            "end": 57382,
            "confidence": 0.8579411764705884,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber 30 Jahre machen wir dieses Podcast noch nicht.",
            "start": 57402,
            "end": 60844,
            "confidence": 0.7388888888888889,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jahre, Episoden, alles dasselbe.",
            "start": 60884,
            "end": 63645,
            "confidence": 0.775,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du meinst ein Jahr ist eine Episode?",
            "start": 64099,
            "end": 66582,
            "confidence": 0.6369999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Im modernen Zeitalter könnte das schon so gelten, weil es wird sehr viel gestartet, aber sehr wenig über eine lange Zeit gezogen. Die Motivation ist da schon oft noch ein Faktor. Deswegen sehe ich das so, dass eine Episode gegebenenfalls schon ein Jahr sein könnte. Auf jeden Fall verteilen wir Weisheiten für ein ganzes Jahr.",
            "start": 66622,
            "end": 85894,
            "confidence": 0.8512181818181819,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei ich ja ganz gut finde, dass man viele Sachen einfach mal probiert und startet und wenn man dann merkt, okay, es war vielleicht doch nicht das Richtige, dass man dann halt wieder abbricht. Aber klar, es gibt auch ganz viele Podcasts, die natürlich da jetzt gerade während Corona inklusive uns aus dem Boden geschossen sind und vielleicht nicht überlebt haben. Die Guten überleben halt. Ist ja völlig in Ordnung.",
            "start": 86449,
            "end": 107215,
            "confidence": 0.8291857142857145,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin ein Freund davon, viel Zeug auszuprobieren, aber ich denke auch, viele Projekte werden zu früh gestoppt, weil man gegebenenfalls keinen Progress sieht, keine Metrik geht nach oben oder man setzt sich vielleicht einfach die falschen Ziele oder gar keine Ziele, beziehungsweise eine Abbruchmetrik oder ähnliches. Das hört sich jetzt total professionell an, aber so meine ich das gar nicht, denn das Side-Projekt sollte immer noch Spaß machen. Doch ich denke, dass viele Leute sehr schnell demotiviert sind, weil sie den erhofften Erfolg für ihr Projekt nicht sehen. Und dann hätten sie gegebenenfalls einfach nur zwei, drei, vier Wochen weitermachen müssen und dann wäre vielleicht irgendein Graph nach oben gegangen, irgendeine, ein User hätte eine E-Mail geschrieben oder ähnliches.",
            "start": 107715,
            "end": 150557,
            "confidence": 0.798641666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oder auch nicht. Das weiß man natürlich nie.",
            "start": 150597,
            "end": 153438,
            "confidence": 0.770375,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist korrekt, das ist korrekt.",
            "start": 153458,
            "end": 154358,
            "confidence": 0.333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "By the way, wer an diesen Ausführungen schon wieder zu lang werden und gerne ein anderes Podcast sucht, wir haben ja eine Liste German Tech Podcasts auf unserer Webseite www.engineeringkiosk.de Da könnt ihr auch mal andere Podcasts finden und reinhören, weil wir sind ja nicht so auf dieser Schiene, dass wir die einzigen sind, die irgendwie sinnvolle Sachen machen. Ist sowieso zu bezweifeln, ob wir sinnvolle Sachen machen. Darum haben wir eben diese Liste gemacht, die ist auf jeden Fall sinnvoll. Und da könnt ihr gerne mal in irgendein anderes Podcast reinhören. Das sind mittlerweile wie viele Podcasts gelistet?",
            "start": 154940,
            "end": 186603,
            "confidence": 0.7465555555555556,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aktuell sind es 36 deutschsprachige Tech-Podcasts und wir haben glaube ich noch so zehn oder zwölf in Review, also ich denke im Endeffekt werden es so 50 Podcasts.",
            "start": 186643,
            "end": 197265,
            "confidence": 0.7917857142857141,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wenn ihr diese Episode hört sind es wahrscheinlich schon wieder mehr.",
            "start": 197305,
            "end": 200766,
            "confidence": 0.7240833333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Quantität ist jedoch nicht alles, Qualität zählt auch. Und deswegen müssen wir uns mal irgendwas überlegen, wie wir diese Liste, diese kuratierte Liste gegebenenfalls ein bisschen sinnvoller machen. Sinnvoller in Bezug auf Filtern, weil ich denke, eine lange Liste ist sehr gut für Inspiration. Und wenn man sich mal wirklich mal eine halbe Stunde Zeit nimmt, da mal durchscrollt, sich mal ansieht, worüber die Leute so sprechen, da kann man auch einen Fokus setzen, möchte ich eher News-Podcast, möchte ich eher Gelaber und Chitchat. Oder möchte ich knallhartes Wissen um die Ohren, denn ich denke, diese Liste bietet alles.",
            "start": 200806,
            "end": 234763,
            "confidence": 0.8258989898989896,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also für deine Aufmerksamkeitsspanne von dem Goldfisch, von wie vielen Minuten ist das eindeutig zu lange Liste, ich hab schon verstanden. Also du wirst wieder knackig kurz, gib mir die drei wichtigsten und du verlierst dann die ganzen anderen 47 guten Podcasts, die dir viel mehr entsprechen würden.",
            "start": 234803,
            "end": 250847,
            "confidence": 0.7477083333333329,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du musst nicht so negativ denken wenn du drei knackige auswählst hast du drei knackig gute was ein wind von drei podcasts.",
            "start": 251187,
            "end": 259896,
            "confidence": 0.8486818181818183,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja du bekommst dann immer das vorgeschlagen was alle hören es ist so wie auf spotify du kannst ja nie dann die die wirklichen nischenprodukte finden die eigentlich extrem geil werden die die coolste musik war sondern du bekommst nur immer die kassenschlager vorgeschlagen.",
            "start": 259916,
            "end": 272730,
            "confidence": 0.7518863636363636,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hast also Angst, dass du das Beste verpasst.",
            "start": 273050,
            "end": 275132,
            "confidence": 0.755,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 275172,
            "end": 275733,
            "confidence": 0.648,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und ich glaube, da sind wir schon wieder beim heutigen Thema. Die Überleitung ist so flach. Heute machen wir mal eine Episodenfortsetzung sozusagen. In Episode 25 haben wir über Interviewskills gesprochen. Und was sollte ein Kandidat denn bei einem Interview mitbringen, beziehungsweise wie kann man selbst das Interview steuern, wenn man sich bei einer Firma bewirbt.",
            "start": 275773,
            "end": 298074,
            "confidence": 0.8739107142857142,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wie kann man eben das Beste nicht verpassen, sondern den besten Hire machen.",
            "start": 298574,
            "end": 303877,
            "confidence": 0.8686428571428574,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Heute drehen wir den Spieß mal ein bisschen um. Heute spielen Wolfgang und ich die Firma, den Hiringmanager, die Person, die Leute einstellen möchte.",
            "start": 303897,
            "end": 312982,
            "confidence": 0.8275416666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist extrem schwierig für uns, weil wir ja das nur ein paar Jahre gemacht haben und uns das sehr schwerfällt, natürlich in diese Rolle zu schlüpfen.",
            "start": 313002,
            "end": 320786,
            "confidence": 0.7704444444444444,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde fast sagen, wir haben mehr Erfahrung, Leute einzustellen, als uns einstellen zu lassen. Das ist korrekt.",
            "start": 321146,
            "end": 326969,
            "confidence": 0.8743888888888888,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie viele Interviews hast du geführt in deinem Leben?",
            "start": 327594,
            "end": 330635,
            "confidence": 0.6802222222222222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich weiß es nicht. Dreistellig ist es bestimmt.",
            "start": 330675,
            "end": 333475,
            "confidence": 0.8583749999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, garantiert. Es waren bei mir alleine schon irgendwie 400 oder 500 vielleicht sogar. Dann müssen es bei dir noch mehr wahrscheinlich gewesen sein.",
            "start": 333655,
            "end": 341297,
            "confidence": 0.6877083333333331,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich finde es aber immer beachtlich, wenn die Leute die Zahlen ganz genau kennen. Ich habe 357 Interviews geführt. Also ich verstehe, dass man die Interviews vielleicht irgendwie für sein Brack-Dokument, für seine Beförderung oder irgendwie mitschreibt. Aber über die ganze Karriere finde ich das schon eine beachtliche Disziplin, wenn man genau weiß, wie viele Interviews man gemacht hat. Denn ich weiß es einfach nicht.",
            "start": 341657,
            "end": 362088,
            "confidence": 0.8307230769230768,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war bei mir relativ einfach, weil ich habe natürlich GDBA-compliant, wie ich so bin, Notes mitgeführt von allen Interviews. Und die hatten einfach einen Tag. Und wenn man nach diesem Tag sucht, dann sehe ich, wie viele Interview-Notes ich geführt habe. Und daraus kann ich schließen, wie viele Interviews ich gemacht habe.",
            "start": 362348,
            "end": 379842,
            "confidence": 0.8041509433962263,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Notizen zu erfassen ist jetzt nicht das Problem. Dein Problem ist, glaube ich, das Löschen der Notizen, oder? Warum ist das ganze Thema relevant? Recruiting ist eine der wichtigsten Aktivitäten, die eine Firma überhaupt machen kann. Und die Entscheidungen, die bei einem Recruiting-Prozess getroffen werden, bestimmen auch die Kultur der Firma. Vor allem, wenn es um die ersten Personen geht, die man einstellt. Denn wenn man eine Firma gründet oder in eine kleine Firma hineintritt, Die ersten Personen, die angestellt werden, haben sehr, sehr viel Einfluss auf Prozesse, wie gearbeitet wird, Mindset vom Produktmanagement, wie mit Kunden umgegangen wird, aber auch was Personalentwicklung und Co. betrifft. Man kann wirklich sagen, die ersten Hires bestimmen die Kultur der Firma.",
            "start": 380305,
            "end": 427927,
            "confidence": 0.8683277310924367,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei ich das immer schräg finde, diesen Satz, dass das die ersten Hires sind, natürlich bestimmen die die Kultur, aber auch die späteren Hires bestimmen die Kultur und ich glaube man sieht das auch ganz oft bei so Hypergrowth Firmen, wo extrem viel eingestellt wird, wo dann die Qualität nach unten geht oder vielleicht die Hürden nach unten gehen. weil man einfach die Leute braucht und das versaut dann auch die ganze Kultur. Also ich glaube, das ist einfach immer die Recruiting-Geschichte beeinflusst die Kultur. Am Anfang ist es vielleicht noch kritischer, aber eigentlich ist es immer so meiner Meinung nach und drum ist für mich auch Recruiting einer der wichtigsten Punkte, weil wenn du die falschen Leute hirest, hast du dann einfach die falschen Leute, die deine gesamte Firma verenden freut. verändern und die sitzen halt dann natürlich auch an Schalthebeln und können das auch dementsprechend machen. Das willst du ja auch. Du willst denen Freiheit geben und darum ist es natürlich wichtig, dass du das vorab schon in irgendeiner Form abklärst, ob das eine sinnvolle Person ist für dein Team.",
            "start": 428348,
            "end": 487352,
            "confidence": 0.798115384615384,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehe ich ein bisschen anders, weil hast du jetzt eine Firma mit 20, 30, 40 Leuten, sind die Leute, die du einstellst, haben einen enormen Impact auf die Kultur, weil ich denke eine Firma mit 30 bis 40 Leuten, ist so eher vergleichbar mit einem jet ski oder einem segelboot und wenn du da jemanden falsches einstellst der zum beispiel sehr laut ist.",
            "start": 487372,
            "end": 508102,
            "confidence": 0.7468253968253971,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was ist denn jetzt der vergleich zum jet ski.",
            "start": 508142,
            "end": 510462,
            "confidence": 0.5865555555555555,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja warte doch mal du bist ja schon wie so ein kleiner welpe ja du hast mir gerade was mit mit mit aufmerksamkeit spanne gesagt ja jetzt gedulde dich doch mal. Diese Leute, die sehr laut sind und gegebenenfalls Schaden in einer 20-, 30-, 40-Mann-Firma machen können, das ist ja was anderes in Bezug auf die Schnelligkeit, wie die Kultur zerstört werden kann. Wohingegen du bei einer Firma mit 300, 400, 800, 1.000 Leuten, wenn du da einen falschen Hai hast, der sehr laut ist, der zerbricht gegebenenfalls nur die Kultur in einem lokalen Umfeld, in einem Team oder in einer Abteilung. Eine Person in einer 300 400 800 Personenfirma hat dann nicht mehr so einen großen Impact und das ist dann eher so die AIDA.",
            "start": 510502,
            "end": 556640,
            "confidence": 0.7760634920634922,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das stimmt und wie bringst du jetzt 10 Leute auf so einen Jetski?",
            "start": 556660,
            "end": 559103,
            "confidence": 0.5275384615384616,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Deswegen bin ich ja auf Segelboot umgestiegen oder Katamaran. Der Punkt ist aber, wenn jetzt hier ein Segelboot oder Katamaran wenden muss oder eine AIDA. Ich glaube, da sind ein paar Welt inzwischen in Bezug auf Schnelligkeit und deswegen ist es schon eine andere Sache, wie Leute eine Kultur verändern können. Denn du weißt ja, eine Kultur baut man über Jahre auf, kann aber in Minuten zerstört werden.",
            "start": 559885,
            "end": 583014,
            "confidence": 0.8122058823529412,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, diesen Punkt gebe ich dir ja. Es ist sicher langsamer, aber auch wichtig.",
            "start": 583634,
            "end": 588257,
            "confidence": 0.7793571428571429,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und da reden wir noch gar nicht von Firmen, die schnelles Wachstum an den Tag legen müssen, die venture capital backed sind oder ähnliches. Das kann auch bei der ganz kleinen Webagentur mit fünf Leuten der Fall sein. Ein falscher Hire kann auch da für Unruhe sorgen. Aber eine Sache, die wir auch schon gesehen haben, wenn man in einer Firma arbeitet, die ein sehr schnelles Wachstum an den Tag legt, pro Monat 10, 15, 20, 25, 30 Leute einstellt, dann bedeutet das natürlich auch, dass man den Recruiting-Prozess in einer gewissen Art und Weise skalieren muss. Und skalieren heißt jetzt hier nicht Hockey-Stick, Hyper-Growth, sondern eher die Arbeit vom Recruiting auf mehrere Schultern verteilen. Und das führt dazu, dass sehr, sehr viele Leute, die gegebenenfalls noch nie in einem Recruitingprozess waren, dann auf einmal sogenannte Hiringmanager sind, den Prozess mitshapen und Entscheidungen treffen. Und das kann, muss nicht, kann dazu führen, dass man natürlich auch in relativ kurzer Zeit Leute in die Firma kriegt, die bei einem langsamen Wachstum nicht in die Firma gekommen wären. Auf Basis einfach nur, weil mehr und mehr Leute Entscheidungen treffen, gegebenenfalls Prozesse überspringen, gegebenenfalls gar nicht den Prozess kennen oder oder oder.",
            "start": 588317,
            "end": 667485,
            "confidence": 0.8628341708542713,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es heißt ja auch immer, Leute einstellen sollte man nicht delegieren, also gerade als Chefin sollte das nicht an andere weitergeben, sondern sollte das selber machen. Der Meinung bin ich auch. Ich glaube, das ist extrem wichtig, weil man eben die Kultur beeinflusst und wirklich entscheidet, wer an Bord kommt. Das Problem ist, dass du halt irgendwann an den Punkt kommst, da musst du das Ganze abgeben. Und das habe ich auch persönlich mitbekommen, wie schwer es manchen Leuten fällt, das Ganze zu delegieren, weil das halt auch ein extrem wichtiger Punkt ist. Also das braucht man gar nicht wegdiskutieren. Und darum ist es aber auch ganz wichtig, dass man den Leuten, denen man das delegiert, noch wichtiger ist als vielleicht andere Punkte, wo man mal sagt, okay, delegier irgendwas weg und schau mal, ob das funktioniert oder schau mal, ob der zurechtkommt mit dem Thema, kann man mal frei laufen lassen. Aber ich glaube, bei Recruiting ist es dann wesentlich wichtiger, wirklich zu kontrollieren und zu helfen, wie das Ganze funktioniert und auch seine Entscheidungsprozesse zum Beispiel weiterzugeben. Und das ist dann auch schon wieder eine schwierige Sache, weil ganz viele am Anfang natürlich einfach nach Bauch entscheiden. Und wenn der Hiringmanager das delegiert oder der Chef, die Chefin, das weiterdelegiert, dann muss man auch irgendwie ein Framework setzen oder einen Prozess definieren, wie können das denn die anderen machen und zwar in derselben Qualität, wie ich das gemacht hätte. Und da kommt man dann schon in den Bereich, dass man eben einen ordentlichen Prozess aufsetzen muss und das auch irgendwie formalisieren muss, auch wenn das oft ungewünscht ist und viele Leute sagen, ja, aber meine Bauchentscheidung ist viel besser. Aber gerade wenn es um Delegieren geht oder wenn ein Team zusammenarbeitet beim Hiring, dann ist es meiner Meinung nach nur möglich, in einer sinnvollen Qualität das Ganze zu machen, wenn man auch den Prozess formalisiert hat und auch die Entscheidungen formalisiert.",
            "start": 667525,
            "end": 774663,
            "confidence": 0.8275263157894739,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Cloudflare ist ja jetzt zum Beispiel gar nicht so eine kleine Firma, aber ich habe vor kurzem gelesen, dass der CTO von Cloudflare sich immer noch jeden Kandidaten anschaut und ich glaube sogar ein kurzes Interview mit dem führt für alle Engineers oder im Tech-Sektor, die bei Cloudflare eingestellt werden. Wenn das wirklich noch so ist, Respekt.",
            "start": 775303,
            "end": 795500,
            "confidence": 0.8717192982456141,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das Problem, was ich auch selber erlebt habe öfters, dass dann eben dieser Final Call noch Pflicht ist, aber der komplett unnötig ist, weil der ist extrem kurz, der Entscheider kommt da nur rein, macht da einen superschnellen Check, teilweise kommen dann extrem eigenartige Meinungen von dem Chef damals zum Beispiel zurück, wo man sich irgendwie denkt, hat der mit dem überhaupt gesprochen. Also der bekommt dann auch kein sinnvolles Bild mehr und das war am Ende nur mehr, um diesen Prozess in irgendeiner Form stabil zu halten und hat eigentlich nichts beigetragen zu dem Ganzen und war sogar kontraproduktiv und meistens nur, dass es halt alles langsamer war. Also das bringt dann natürlich meiner Meinung nach auch nichts, wenn der nur mehr so alibi-formhalber in irgendeiner Form involviert ist. Also meiner Meinung nach entweder ordentlich involviert, die Verantwortung tragen, aber dann auch dementsprechend die zeit investieren weil das ist ein großes zeitinvestment oder eben sinnvoll delegieren aber beides oder so eine mischform ist meiner meinung nach dann eher kontraproduktiv.",
            "start": 795980,
            "end": 854895,
            "confidence": 0.8211286549707602,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also halbgaren quatsch muss man da nicht machen weil es geht ja um die karriere von menschen aber ich denke, dass der Final Call dann zum Beispiel mit einem C-Level-Management oder ähnliches schon Sinn macht, weil man dann auch als Kandidat sehen kann, komme ich auch irgendwie mit dem Top-Level-Management klar? Oder man kann ja auch evaluieren, ist die Firma was für mich, denn wenn das C-Level-Management unbedingt ein Final Call haben möchte und sich dann nicht in der Lage ist, wenigstens die vorherigen Interviewnotizen durchzulesen, wie wichtig ist mir das dann bei dieser Firma anzufangen?",
            "start": 855215,
            "end": 884961,
            "confidence": 0.7928437500000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei, es kommt auch wieder darauf an, wie groß die Firma ist. Macht das Sinn? Bin ich mit dem überhaupt in irgendeiner Form involviert? Oder wenn die Firma 1.000 Leute hat, dann wäre mit dem C-Level, je nachdem, wo ich einsteige in dieser Firma, aber eher weniger zu tun haben. Wenn es 10.000 Leute sind, noch weniger. Also man muss sich das natürlich auch dementsprechend überlegen. Aber auch da muss ich sagen, weder als Kandidatenseite und von meiner Erfahrung auf der Firmenseite, nur weil ein Interviewprozess schlecht ist, heißt es noch nicht, dass die Firma schlecht ist. Weil eben leider sehr oft vergessen wird, wie wichtig dieser Recruiting-Prozess ist.",
            "start": 885529,
            "end": 918460,
            "confidence": 0.8185229357798165,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Arbeit delegieren. Arbeit delegieren verbinde ich immer mit Zeitinvestment. Wie viel Zeit hast du so damals bei deinen Einstellungsaktivitäten mit Recruiting verbracht? Pro Tag, pro Woche?",
            "start": 918500,
            "end": 928869,
            "confidence": 0.8335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, gleich vorweg, ich bin da, glaube ich, kein guter Maßstab, weil ich habe teilweise, glaube ich, 80 Prozent meiner Zeit investiert in Interviews und Recruiting in meiner Hochphase. Das heißt, ich war da teilweise, ich würde fast sagen, 30 Stunden pro Woche im Recruiting-Prozess. Also es war schon eine harte Zeit teilweise. Insofern ist es schwierig zu sagen, kommt auch darauf an, wie viele Interviews man führt, wie sehr man involviert ist in den ganzen Bereich. Also ich habe das in verschiedensten Formen erlebt, aber ich würde mal sagen, wenn man in irgendeiner Form Hiring Manager ist, dann schafft man das kaum unter einem Tag pro Woche, würde ich mal sagen, wenn man wirklich intensiv auch daran arbeitet. Also das würde ich fast als unteres Limit sehen. Wie ist das bei dir?",
            "start": 929769,
            "end": 973273,
            "confidence": 0.7732556390977445,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist so eine Art Tagesform bei mir, aber ich investiere schon recht viel Arbeit da rein. Als Daumenregel habe ich mal gehört, Pro offene Stelle sollte ein Hiringmanager eine Stunde pro Tag investieren. Hat man also jetzt vier offene Stellen, ist es eigentlich so 20 Stunden pro Woche, die man als Hiringmanager investieren sollte, um die Stellen zu besetzen. Das ist nicht nur Leute screenen, Interviews führen, sondern gegebenenfalls auch Active Sourcing oder ähnliches. Oder das kann auch sein, einen Vortrag für ein Meetup vorbereiten, was zum Ziel hat, auf die Firma Aufmerksamkeit zu machen oder ähnliches. Ja, also Recruiting heißt jetzt nicht nur, man muss immer in Gesprächen sein, sondern Recruiting kann auch in der Hinsicht bedeuten, Recruiting-Aktivitäten führen, eine Gastvorlesung an der Uni zu halten, auf einen Karriere-Tag zu gehen oder oder oder.",
            "start": 973313,
            "end": 1024382,
            "confidence": 0.8247037037037035,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich finde es auch ganz interessant und gut, dass das in Stunden pro Tag angegeben war, weil ihr habt jetzt gesagt, mindestens einen Tag pro Woche, aber in der Realität kannst du natürlich das nicht blocken auf einen Tag. Das ist auch so ein großes Problem von Recruiting, vor allem mittlerweile und es wird immer kritischer, dass dieser Prozess möglichst schnell ist. Und wenn du jetzt als Hiringmanager nur einmal pro Woche irgendwelche Entscheidungen triffst oder jemanden in der Pipeline in die nächste Phase verschiebst, eine Person, dann funktioniert das natürlich nicht. Also auch da, das ist so ein Vorgang, den man zwar nebenbei machen kann, aber der durchaus viel Zeit frisst, weil man eben viele Entscheidungen trifft und vielleicht dann auch wieder Feedback reinbekommt von Interviews und Wenn man aktuell am Arbeitsmarkt in irgendeiner Form erfolgreich sein will, muss man einfach extrem schnell sein, weil sonst hat die Person einfach fünf andere Angebote in der Zwischenzeit bekommen und dann ist die Person weg.",
            "start": 1024801,
            "end": 1079353,
            "confidence": 0.7923536585365856,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sprechen wir über Personen. Was würdest du sagen, wie findet man die richtigen Leute bzw. was waren deine besten Hires und wo hast du diese Personen gefunden oder wie bist du zu diesen Hires gekommen? Oder haben die gesagt, ein Doktor in Datenbanken aus Österreich, das klingt interessant.",
            "start": 1079373,
            "end": 1098550,
            "confidence": 0.8366875000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich kann jetzt eigentlich gar nicht auf eine Quelle irgendwie runterbrechen. Ich glaube, es sind aus allen unterschiedlichen Kanälen gute Leute irgendwie reingekommen. Glücklicherweise, Aber eine Quelle, die eigentlich ganz gut funktioniert hat, waren einfach persönliche Empfehlungen, wo irgendwo gute Leute, die schon in der Firma waren, irgendwie Freunde reingebracht haben über fast eine andere Pipeline, weil mit denen gehst du dann doch anders um, mit denen trinkst du einfach mal einen Kaffee, die kommen einfach in der Firma vorbei. Diese Leute waren oft qualitativ einfach wesentlich besser, vielleicht war es auch weil man da einen anderen Zugang hat und die Leute anders kennenlernt. Aber dieser Weg von Empfehlungen aus dem eigenen Team oder aus dem eigenen Umkreis, das war eigentlich schon eine sehr gute Quelle und die vergisst man auch ganz oft, weil man denkt halt einfach an die klassischen Kanäle und probiert auch Werbung zu machen, aber man vergisst die eigenen Mitarbeiterinnen und Mitarbeiter, dass die vielleicht einfach in ihrem Freundeskreis, in der Umgebung wirklich gute Leute kennen. Und gerade im IT-Bereich ist es ja so, dass die alle untereinander irgendwie befreundet sind, bekannt sind, vielleicht gemeinsam studiert. Und so kann man schon gute Leute auch mit reinbekommen.",
            "start": 1099010,
            "end": 1169992,
            "confidence": 0.8121194029850746,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ich immer gefährlich finde bei persönlichen Empfehlungen ist, wenn du jetzt zum Beispiel gerade den Job gewechselt hast, zwei Wochen da bist, dann ist man ja meist noch in so einer Art Honeymoon-Phase, wo wir wieder bei Hochzeiten sind, wie wir diese Episode begonnen haben. Und dann direkt deine ganzen Leute anschreibst, hey, supergeile Firma, komm sofort rein, komm sofort rein. Das finde ich immer so ein bisschen gefährlich, denn ich denke, man sollte schon drei, vier, fünf, vielleicht sogar sechs oder mehr Monate da sein, wenn man seine Kollegen anspricht. Weil speziell dann hat man erst ein realistisches Bild. Wenn die Honeymoon-Phase so langsam dem Ende entgegengeht, man gegebenenfalls auch die Probleme sieht, den staubigen Server im Datacenter, den man nicht anfassen darf, die Prozesse, die vielleicht nicht so gut laufen, weil, wie sagt man so schön, woanders ist halt auch Kacke. Das finde ich immer so ein bisschen gefährlich bei den persönlichen Empfehlungen. Deswegen sollte man da aufpassen und ganz einfach auch realistisch bleiben.",
            "start": 1170362,
            "end": 1226568,
            "confidence": 0.8266586826347306,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei mir als Firma das dann eher egal ist, wenn die Person gute Leute reinbringt, kann mir das eigentlich egal sein, ob das vielleicht zu früh war, wenn man es ganz hart sieht. Das Problem ist natürlich, wenn die sich dann zusammentun, alle unglücklich sind und dann irgendwie gemeinsam wieder als große Gruppe die Firma verlassen.",
            "start": 1226923,
            "end": 1242710,
            "confidence": 0.8343928571428568,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da bin ich anderer Meinung. Ich denke, dir sollte das nicht egal sein, weil da geht es nämlich in die Retention rein. Wie lange bleiben die Leute? Wenn die Leute unter falschen Versprechungen geheiert wurden, und das musst du als Hiringmanager ja noch niemals schuld sein, sondern das kann ja ein Mitarbeiter, der die persönliche Empfehlung ausgesprochen hat, dem Kollegen oder der Freundin erzählt haben und du diese falschen Versprechungen dann gar nicht korrigierst, weil du zum Beispiel da gar nichts darüber Bescheid weißt, kann das dich natürlich auch ein bisschen in den Popo zwicken später, wenn die Person nach drei, vier oder sechs Monaten direkt wieder weg ist, weil gegebenenfalls waren deine Kosten für diesen Higher jetzt nicht so super hoch, wegen der persönlichen Empfehlung. Dennoch hast du ein Zeitinvestment gemacht, dennoch hast du ein Onboardinginvestment gemacht, dennoch hast du ein Equipmentinvestment gemacht. Gut, das ist jetzt glaube ich der geringste Kostenpunkt an der ganzen Thematik. Aber dein Ziel ist es ja diese Higher mindestens ein Jahr, mindestens anderthalb oder mindestens zwei Jahre zu halten, bis die mal wirklich voll auf Speed sind und sich komplett allein in der Firma bewegen können ohne deine Guidance.",
            "start": 1243110,
            "end": 1306968,
            "confidence": 0.8051632653061224,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da sind wir schon beim ganz wichtigen Thema, und zwar False Negatives versus False Positives, was hier ganz oft so genannt wird in dem Prozess. Also da geht es darum, falsche Negativentscheidungen zu machen oder falsche Positiventscheidungen zu machen. Eine falsche Negativentscheidung wäre, dass man jemanden ablehnt, der aber extrem gut ist und eine falsche Positiventscheidung wäre, man bringt jemanden rein, wo sich dann aber herausstellt, es ist einfach keine passende Person, das war kein guter Fit und man hat dann eben, wie der Andi jetzt gerade erwähnt hat, diese ganzen Einstiegskosten und muss sich vielleicht halbes Jahr oder vielleicht sogar noch länger, ein Jahr herumschlagen, irgendwann dann vielleicht eine Kündigung aussprechen, im Idealfall in der Probephase, aber in der Realität passiert das halt oft auch nicht. Man bemüht sich und irgendwann dann hat man eineinhalb Jahre investiert, hat extrem viel Zeit investiert und damit auch Geld und hat dann die falsche Person. Was würdest du sagen, Andi, ist false negative oder false positive wichtiger oder auf was sollte man sich mehr konzentrieren?",
            "start": 1307528,
            "end": 1370229,
            "confidence": 0.8396358381502889,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Mir blutet immer das Herz, wenn ich einen fähigen Kandidaten oder eine fähige Kandidatin ablehnen muss, weil ich ein ungutes Gefühl habe. Ich bin eher der Meinung, ich lehne auch fähige Kandidaten eher ab, anstatt eine falsche Entscheidung zu treffen. Es tut mir immer weh, aber wenn irgendwas nicht passt, denke ich dennoch, dass das die richtige Entscheidung ist, dass wir dann nicht zusammenkommen. Weil eine Person kann einen negativen Effekt auf die Teamkultur, Teamperformance, Teamzusammenhalt haben. Denn ich sage immer, immer wenn eine Person das Team verlässt oder eine Person das Team joint, hat man ein neues Team. weil die Wege, die Kommunikationswege sich ändern, weil man gegebenenfalls einen introvertierten Menschen reinbekommt oder ein introvertierter Mensch geht, ein extrovertierter Mensch kommt rein oder geht, ist sehr laut. Das kann einfach das komplette Team-Environment ändern, deswegen bin ich da eher auf der, ist das jetzt die false negative Seite oder false positive, muss ich zugeben, weiß ich gerade gar nicht.",
            "start": 1370269,
            "end": 1429396,
            "confidence": 0.8137375000000004,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist immer dieses Problem mit diesen Wörtern. Aber meiner Meinung nach, wie du gesagt hast, die falschen Negativentscheidungen sind weniger kritisch als die falschen positiven Entscheidungen. Weil man kann sich das Ganze einfach so auch überlegen, wenn du eine falsche positive Entscheidung getroffen hast, also du stellst jemanden ein und musst ihn dann wieder kündigen oder der verlässt die Firma wieder, dann fängst du das ganze Recruiting von vorne an. Das heißt, du hast sowieso die gleichen Kosten oder den Aufwand wie bei einer falschen negativen Entscheidung, wo du jemanden ablehnst, weil du musst ja weiter recruten. Das heißt, du musst weiter Leute suchen, aber du suchst nicht nur Leute weiter, wenn du jemanden eingestellt hast und das ein Fehler war, sondern du hast die ganze Zeit investiert, du hast die Zeit verloren, du hast mit der Person gearbeitet, du hast vielleicht sogar eine negative Teamstimmung und musst jetzt trotzdem wieder recruten. Das heißt, Eine falsche negative Entscheidung hat immer natürlich weniger Auswirkung oder Impact als eine falsche positive Entscheidung, wo du wirklich jemanden dann einstellst. Und darum ist die falsche positive natürlich immer teurer als eine falsche negative. Natürlich ist es für die Kandidatin oder den Kandidaten nicht so einfach, wird natürlich abgelehnt. Auf der anderen Seite muss man auch sagen, wenn das ein guter Kandidat ist oder eine gute Kandidatin, die wird woanders garantiert eine Stelle finden. Und nur weil du einen Fehler gemacht hast und scheinbar das Potenzial nicht erkannt hast, wird höchstwahrscheinlich sofort jemand anderer das Potenzial erkennen. Und dann hast du zwar eine gute Person verloren, aber ich würde sagen, in den meisten Fällen ist es immer noch besser, als eine falsche Person angestellt zu haben. Also darum würde ich auf jeden Fall auf die false positives optimieren, also probieren, möglichst wenig falsche Entscheidungen zu treffen, wenn man jemanden wirklich einstellt.",
            "start": 1429436,
            "end": 1534309,
            "confidence": 0.8250977198697067,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es ist nicht nur für den Kandidaten schwer, meines Erachtens nach auch für das Team. Denn ich hoffe, ihr bindet euer komplettes Team mit ins Recruiting ein, wenn ihr einen neuen Teammember sucht oder eine neue Teammemberin. Denn diese Personen, eure Teammitglieder, investieren auch sehr viel Zeit, Mühen und Energie in diese Interviews. Ich bin immer ein Freund davon, von Transparenz. Und sofern ich eine Entscheidung getroffen habe, wir machen mit dem Kandidaten weiter oder diesen Kandidaten lehnen wir ab. kommuniziere ich das allen Interviewteilnehmern auch mit meinen Gründen, warum und wieso, denn ich habe auch schon Firmen erlebt, die ziehen die ganze Zeit die eigenen Engineers mit in die Interviews und dann diese Leute wissen nie, was denn mit dem Outcome ist und dann irgendwie drei, vier, fünf Monate später fängt die Person halt an oder halt auch nicht. Und das ist halt ein bisschen schade, denn diese Leute investieren sehr viel Arbeit und Energie rein und wissen halt nicht wofür. Aber jetzt reden wir ja schon so ein bisschen über Entscheidungen treffen, aber wie kommst du denn zu diesen Entscheidungen? Was sind denn deiner Meinung nach Interview Best Practices, die dir helfen, die richtige Entscheidung über die Kandidatin, über den Kandidaten zu treffen?",
            "start": 1534669,
            "end": 1599924,
            "confidence": 0.809907317073171,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wie ich am Anfang schon erwähnt habe, ganz wichtig ist der Prozess. Und Prozess klingt am Anfang natürlich sehr negativ, aber meiner Meinung nach muss man sich halt wirklich überlegen, wen suche ich denn da eigentlich? Das heißt, was sind meine Anforderungen? Einfach zu sagen, ich brauche zusätzlich irgendwie einen Entwickler oder sowas, das funktioniert sogar in relativ kleinen Firmen meiner Meinung nach nicht. Man muss sich wirklich überlegen, ok, welche Art von Entwickler suche ich? Suche ich einen Senior? Suche ich einen Junior? Habe ich die Kapazitäten, um einen Junior auszubilden? Brauche ich irgendein Spezialwissen? Brauche ich irgendwie jemanden, der im Cloud-Bereich sich super gut auskennt, Erfahrung hat im Deployment? Jemanden wie Andy, der GitHub-Actions in- und auswendig kennt, wie in der letzten Episode gezeigt? Und das muss ich mir einfach am Anfang mal überhaupt zurechtlegen. Wen suche ich? Und das im Idealfall auch aufschreiben. Und da scheitert schon. Die meisten machen diesen Schritt gar nicht. Wen suche ich eigentlich?",
            "start": 1600422,
            "end": 1658244,
            "confidence": 0.80016049382716,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist das nicht Teil der Jobausschreibung? Sie sollten diese Qualifikation mitbringen oder ist das was anderes, wovon du gerade sprichst?",
            "start": 1658284,
            "end": 1664569,
            "confidence": 0.8014000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das hängt natürlich stark damit zusammen, aber es wird halt ganz oft einfach dann irgendeine Jobdescription erstellt, wo irgendwie 20, 30 Bereiche drinstehen und so jemanden gibt es sowieso in der Realität nicht. Und man hat sich eigentlich gar nicht so genau überlegt, sondern sieht einfach, okay, wir haben ein Team von fünf Leuten, die können das, das, das und das. Das heißt, wir suchen jetzt auch eine zusätzliche Person, die alles kann von diesen fünf anderen Personen. So läuft es ja oft ab. Und man hat sich ja eigentlich nicht wirklich überlegt auf der Firmenseite, wen suche ich, wie kann der mein Team ergänzen, haben wir irgendwie neue Aufgaben, neue Projekte, brauchen wir vielleicht ein neues Wissen oder wollen wir vielleicht auch irgendwie neues Wissen reinbringen, wenn wir jetzt alles Doktoren im Team haben oder alles Leute, die direkt von der Uni kommen, die keine Verträge mehr bekommen haben, kennen auch so eine Firma, die hat fast nur Doktoren, will ich dann vielleicht mal eine andere Person reinbringen oder will ich vielleicht mal eine Frau reinbringen. Also all diese Entscheidungen, wenn es auch um Diversity geht oder was soll die Person dann am Ende machen, die muss ich mir im Vorhinein einfach mal zusammenschreiben, aufschreiben, diskutieren im Team und erst dann kann ich meiner Meinung nach eine Job Description machen, um dann wirklich die Leute zu suchen.",
            "start": 1665033,
            "end": 1733084,
            "confidence": 0.7921535087719299,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe auch oft die Erfahrung gemacht, dass Job Descriptions recht zusammen kopiert werden von anderen Firmen, die entweder etwas ähnliches machen oder etwas ähnliches suchen. Und dass Job Descriptions in der Regel Anforderungen haben, die ein Mensch gar nicht erfüllen kann. Deswegen fahre ich das Mantra, wenn du eine Job Description liest und mehr als 50% schon kannst, bist du überqualifiziert meines Erachtens nach. Okay, jetzt habe ich also eine Liste von Sachen, die ich suche. Von Sachen, von Attributen, von Qualifikationen, die ich in einer Person sehen möchte. Was mache ich damit? Wie geht es weiter?",
            "start": 1733444,
            "end": 1765271,
            "confidence": 0.8065612244897958,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also daraus kann man natürlich die Job Description dann erstellen, ganz klar. Aber daraus kann man dann auch eine Liste an Fragen erstellen. Das heißt, wie kann ich abprüfen, ob die Kandidatin dem entspricht, was ich mir vorstelle. Und dazu muss ich natürlich wissen, was die Kandidatin am Ende machen soll. Oder der Kandidat, der dann am Ende der Mitarbeiter wird.",
            "start": 1765311,
            "end": 1785183,
            "confidence": 0.8601967213114754,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du mal ein Beispiel?",
            "start": 1785383,
            "end": 1786804,
            "confidence": 0.42840000000000006,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn du jetzt zum Beispiel jemanden suchst, der einfach nur ein paar Skripte schreiben soll, um da vielleicht ein bisschen Prozesse zu verbinden, irgendwelche kleinen Skripte, um irgendwas hin und her zu schieben, dann ist die Frage, musst du dem jetzt irgendwie Fragen stellen zur Big-O-Notation, zu Komplexitäten oder wie man einen Datenbankindex optimiert zum Beispiel. würde ich mal bezweifeln, dass das sinnvoll ist. Sondern ich würde halt einfach checken, okay, hat der ein gutes Verständnis von Prozessen? Kann der Prozesse gut verstehen? Kann der dann das Skript schreiben, um da vielleicht Daten von Prozess A zu Prozess B zu schaufeln? Also versteht derjenige wirklich das, was er dann schlussendlich machen muss? Und ich glaube, das ist auch ganz wichtig, dass man diese Fragen möglichst ähnlich zum realen Job aufsetzt. Also nicht irgendwelche Fragen, die in der Theorie liegen und vielleicht irgendwelche Algorithmen, wenn du dann den ganzen Tag eigentlich nur high-level irgendwas, ein Skript schreibst oder was zusammen klickst in der Oberfläche. Das macht wenig Sinn. Und manchmal sind eben auch andere Skills wie das Verstehen von Prozessen viel wichtiger als die eigentlichen Programmierkenntnisse. Und so muss ich mal dementsprechend auch die Fragen überlegen, welche Fragen stelle ich den Kandidaten und Kandidatinnen, um eben das zu messen oder mir ein Bild zu machen, damit ich dann die Entscheidung sinnvoll treffen kann.",
            "start": 1786824,
            "end": 1864395,
            "confidence": 0.8065225225225232,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Kritik, die ich da immer gehört habe, war, du nutzt ja deine Kandidaten dafür, deine aktuellen Probleme zu lösen. Weil man kann halt ganz einfach sagen, immer wenn du Fragen aus dem aktuellen Arbeitsalltag stellst, sind die zwar sehr arbeitsnah, was super ist, man könnte aber ja auch sein aktuelles Problem, an dem man jetzt gerade sitzt, fragen und somit dann die Kandidaten nutzen, um in Anführungszeichen umsonst zu arbeiten und dir die Lösungen zu geben oder eine bessere Lösung zu finden.",
            "start": 1864815,
            "end": 1893873,
            "confidence": 0.8204457831325299,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe sogar mal von einem Kandidaten, beziehungsweise über die HA-Abteilung natürlich, eine E-Mail bekommen, den habe ich abgelehnt. Der wollte danach Geld haben für seine Aufgabe, die er zu Hause gelöst hat, weil er irgendwie gemeint hat, jede Zeit, die man da irgendwie verbringt, muss auch bezahlt werden und er erwartet sich da jetzt. Ein Gehalt für die Aufgabe, die er da zu Hause gelöst hat. Im Nachhinein war er dann sehr froh, dass ich ihn abgelehnt habe. Das war scheinbar die richtige Entscheidung vom Mindset.",
            "start": 1894502,
            "end": 1920189,
            "confidence": 0.7571954022988505,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es gibt aber Firmen, die senden dir einen Take-Home-Test nach Hause oder sagen, mach mal bitte einen Pull-Request oder kontribute zu einem Open-Source-Repository deiner Wahl und vergüten das dann. Weil die sagen, okay, du hast dann zur Open-Source kontributet oder du hast den Take-Home-Test gemacht und deswegen hast du dich hingesetzt, deine Freizeit geopfert und auch gearbeitet. Deswegen vergüten wir das jetzt mit einem Stundenlohn von x. Also es ist nicht so, als gibt es keine Firmen, die das dann nicht wertschätzen.",
            "start": 1920229,
            "end": 1947713,
            "confidence": 0.8077317073170729,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das stimmt natürlich, man kann das durchaus machen von der Wertschätzung. Ehrlich gesagt, ich glaube nicht, dass man da extrem viel rausziehen kann. Man kann natürlich als Interview schon Dinge rausziehen, wenn man einfach mit smarten Leuten diskutiert über ein reales Problem, kann man da vielleicht schon auf die eine oder andere Sache aufmerksam gemacht werden. Also das kann sehr wohl sein, aber das sollte, glaube ich, auch im Interesse von beiden Seiten sein und wir haben das ja auch in der Folge 25 besprochen. dass wenn man sich irgendwo bewirbt und eine Diskussion führt, dass man da auch selber vielleicht irgendwelche Informationen rausziehen kann. Interessante Dinge, wie arbeiten andere Firmen und so geht es halt auch von der Hiringmanager-Seite oder von der Interviewer-Seite. Ihr bekommt halt auch Informationen, wie arbeiten andere Leute, wie arbeiten andere Firmen. Gibt es vielleicht eine interessante Lösung für dieses Problem. Wobei ich natürlich auch sagen muss, in der Realität ist es oft so, dass diese Probleme einfach so komplex sind, an denen man arbeitet, dass man die einfach nicht unterbekommt in einem Interview, weil man da einfach eine Stunde erklären müsste, wo ist das eigentliche Problem oder zwei Stunden. Wenn man sich so einen Teilaspekt wirklich rauspicken kann, ist das sehr gut, aber in der Realität funktioniert das meiner Meinung nach einfach seltener. Also man hat nicht diese Probleme, die man in zehn Minuten erklären kann, die sofort klar sind dem Kandidaten. und der dann eine Lösung bringen kann. Also in der Realität schaut das meistens nicht so aus und ich sehe das mehr auch so als Möglichkeit, dem Kandidaten mal zu zeigen, an was man arbeitet, aber meistens muss man das Problem einfach vereinfachen oder vielleicht ist es ein Problem, was man vor ein paar Jahren gehabt hat, das vereinfacht man dann und dann soll die Kandidatin zum Beispiel irgendwas drauf programmieren oder dieses Problem lösen. Aber ich kann mir ehrlich gesagt in der Realität kaum vorstellen, dass man da irgendwie sinnvoll den Code verwerten kann zum Beispiel. Also, dass man in irgendeiner Form Recruiting dafür missbrauchen könnte, um jetzt irgendwie Sachen zu, Lösungen zu bekommen. Das kann vielleicht mal entstehen und eine interessante Information sein, aber irgendwie sinnvoll zu nutzen ist meiner Meinung nach erstens die falsche Herangehensweise, weil es geht darum, gute Leute zu finden und in der Realität ist es, glaube ich, einfach nicht möglich.",
            "start": 1948333,
            "end": 2072202,
            "confidence": 0.8020278481012654,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie stehst du gegenüber sehr harten Fragen oder diese Fragen, wo man gegebenenfalls gar keine richtige Antwort drauf gibt? Wie zum Beispiel, wir haben jetzt ein hohes Gebäude mit zehn Etagen, haben vier Aufzüge. Wie würdest du an das Problem herangehen, die Aufzugssteuerung zu programmieren? Wie stehst du solchen Fragen gegenüber?",
            "start": 2072598,
            "end": 2095373,
            "confidence": 0.8456666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist das jetzt ein hartes Problem für dich?",
            "start": 2095413,
            "end": 2096994,
            "confidence": 0.67525,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich denke, dieses Problem gibt dir sehr viele Möglichkeiten, eine einfache und langweilige Lösung zu bauen oder ein enorm komplexes, verteiltes System, wo eine Leader Election gemacht werden muss und Co. Ich denke, dass diese Art von Problemen dir die komplette Spannweite von hartem Problem bis super leichtes Problem gibt, aber auch verschiedene aspekte abdeckt wie zum beispiel nicht nur wie du baust du das backend sondern also hast du zum beispiel eine zentrale komponente die vier aufzüge steuert oder hast du vier komponenten eine komponente pro aufzug und lässt die miteinander kommunizieren und hast gar keine zentrale komponente oder wie baust du das user interface auf wo zum beispiel wählt der mensch der mit dem aufzug fahren möchte die etage aus vor dem aufzug also außerhalb des aufzuges oder im aufzug Also ich denke, dass diese Aufgabe enorm groß oder komplex sein kann und deswegen würde ich gerne wissen, wie du gegenüber solchen Fragen stehst.",
            "start": 2098297,
            "end": 2161192,
            "confidence": 0.8567051282051281,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hast du schon die Interviewfrage Nummer eins von Trivago verraten, die wir zumindest damals gestellt haben, weil ich glaube, das war wirklich die beliebteste Frage, die gestellt worden ist. Und das ist meiner Meinung nach keine harte Frage, also die klassischen Hard-Questions, die man so versteht, wenn man über Recruiting liest, weil das sind üblicherweise diese harten Algorithmen-Fragen zum Beispiel. wo es nur eine richtige Antwort gibt. Jetzt sitzt da eine Kandidatin an so einer Frage, überlegt eine halbe Stunde und kommt am Ende nicht zu einem Ergebnis. Was hast du dann herausgezogen? Meiner Meinung nach überhaupt nichts, weil du hast nur eine halbe Stunde verbraten und weißt, dass diese Person nicht diese extrem harte Frage beantworten kann. Aber vielleicht hätte sie eine 20% leichtere Frage beantworten können. Oder es hat irgendein anderes Problem gegeben mit dieser Frage. Also meiner Meinung nach harte Fragen, so Null-Eins-Fragen, finde, weil sie den perfekten Algorithmus oder sowas, finde ich jetzt einfach nicht sehr sinnvoll. Und das, was du erwähnt hast, so eine weitläufige Frage, würde ich es mal nennen. Die hat viel mehr Potenzial, weil da kann ich eben in alle Richtungen gehen. Das ist so eine Diskussionsfrage. Einfach da kann man gut dann mit einer Kandidatin zum Beispiel diskutieren, wie würde diese Liftsteuerung aussehen? Wie schaut's aus, wenn ich jetzt irgendwen suche, zum Beispiel der mir sehr ausfallsichere Systeme baut, dann kann ich fragen, wie würdest du diesen Aufzug ausfallsicher bauen? Wenn du da eine Datenbank im Hintergrund hast, wie würdest du diese ausfallsicher bauen? Wie ist es, wenn es einen Stromausfall gibt, würdest du es in die Cloud legen oder nicht? Also du kannst anhand von so einer einfachen Aufzugsfrage alle Bereiche abdecken und Ich glaube, ich habe die auch in meinem Interview damals bei Trivago übrigens bekommen, diese Frage. Und wir sind, glaube ich, so weit gekommen, dass wir irgendwie dann sogar über das Interface gesprochen haben, über die Usability von dem Interface und wie man Leute den Aufenthalt im Lift möglichst kurzweilig gestalten kann. Und wie kann ich das schaffen, dass nicht jeder in den Boden starrt. Also wir sind da teilweise sogar in sehr kreative Ecken gegangen, haben aber auch hardcore technische Sachen besprochen. Also ich glaube, so eine Frage eignet sich sehr gut. Der große Nachteil an so einer Frage ist, dass sie natürlich nicht vergleichbar ist. Weil du kannst natürlich in ganz anderen Bereichen gehen und hast dann keine Vergleichbarkeit von Kandidat 1 zu Kandidatin B. Das funktioniert natürlich nicht. Und da sind natürlich einzelne kurze Fragen besser dafür geeignet, um Kandidaten zu vergleichen. Aber ich glaube, man braucht ja nicht jede Frage wirklich so als Diskussionsfrage aufbauen und dann hat man vielleicht auch andere Fragen, wo man dann Kandidaten eben sehr gut vergleichen kann und da ist aber natürlich wichtig, dass man jedem Kandidatin und jeder Kandidatin die gleichen Fragen überhaupt stellt und dass man nicht jedes Mal aus dem Bauch heraus die Fragen stellt, die ihm gerade so einfallen. Das kann man natürlich auch machen, aber man sollte schon eine gewisse Anzahl an Fragen haben, die man immer stellt, um auch so ein besseres Gefühl zu bekommen, wie antworten denn Leute auf diese Fragen und dann bekommt man nach Eigentlich relativ schneller Zeit, sofort so ein Gefühl nach den ersten drei Antworten. Oh, das ist ein guter Fit, schlechter Fit, in welche Richtung geht das? Aber wenn man immer andere Fragen stellt, hat man natürlich nie diese Erfahrung, die man da sammeln kann bei so einem vordefinierten Fragenset.",
            "start": 2161212,
            "end": 2355698,
            "confidence": 0.8016752136752134,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Strukturierte Interviews finde ich super, doch was ich wichtig finde ist, dass du nicht das komplette Interview nur damit durchziehst, weil ich denke auch, das limitiert so ein bisschen die Möglichkeit für den Kandidaten das Interview zu steuern, weil du bist ja mit den strukturierten Fragen aufgekommen und wenn diese halt einfach nicht gut formuliert sind, beziehungsweise nicht gut gewählt ist, limitierst du eigentlich die Fragestellung auf Sachen, die nur du weißt, denn ich habe auch schon gesehen, dass Es strukturierte Interview Fragenkataloge gibt mit, du hast die Frage und dann drei Antworten. Die beste Antwort, die mittlere Antwort und die schlechte Antwort. Und da frage ich mich, geht das nicht ein bisschen zu weit?",
            "start": 2356300,
            "end": 2393103,
            "confidence": 0.8334695652173914,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, wobei das schon sehr hilfreich sein kann für die, vor allem für Hiringmanager oder Interviewer, die recht neu sind. weil die bekommen dann was an die Hand gegeben. Wenn du diese Fragen bekommst und gar keine Ahnung hast, was denn so Antworten sein können, dann ist es für dich im ersten Moment schon extrem schwierig. Wenn du da aber schon ein paar Beispielantworten bekommst, kann es schon helfen zu verstehen, in welche Richtung die Frage gehen soll. Und vor allem, diese Fragen sind jetzt nicht hundertprozentig genau definiert. Es ist jetzt keine 0 oder 1 Frage. Bei Behavioural Questions wäre es zum Beispiel sowas wie, was ich ganz gerne gefragt habe, wann war denn das letzte Mal, wo du jemandem geholfen hast? Komplett frei. Aber du könntest natürlich auch fragen, wann war denn das letzte Mal, wo du irgendwie einer weiblichen Person in deinem Team beim Deployment geholfen hast oder so. Das ist jetzt hausgemacht natürlich, aber das geht schon sehr ins Detail. Sowas würde ich natürlich nie fragen, sondern da geht es natürlich wirklich darum, so ein allgemeines verständnis von der person zu bekommen aber trotzdem ist es jedes mal die gleiche frage das kann jeden fragen und die kann natürlich auch eine antwort bekommen habe ich mal in der realität bekommen von einer person die gemeint hat ja ich habe gerade gestern meinem team geholfen einem teammitglied weil ich muss jeden Tag allen Teammitgliedern helfen, den ganzen Tag. Ich muss denen ständig erklären, was sie machen müssen, weil die haben keine Ahnung und ich bin der Einzige, der im Team eine Ahnung hat und ich muss das jeden Tag machen. Das war wirklich eine Antwort, die ich bekommen habe. Das war jetzt meiner Meinung nach eine schlechte Antwort. Wenn ich sowas zum Beispiel reinschreiben würde, dann hat jemand, der jetzt neu ist beim Interviewen, gleich eine Vorstellung, okay, was sind gute Antworten, was sind schlechte Antworten, was sind da überhaupt mögliche Antworten.",
            "start": 2393143,
            "end": 2490493,
            "confidence": 0.7907907692307687,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich will gar nicht bestreiten, dass das nicht vorteilhaft ist. Ich möchte nur ein bisschen Aufmerksamkeit drauf lenken, dass strukturierte Interviews auf der einen Seite nicht alles sind, weil ja, die sind dafür da, um Antworten und Kandidaten zu vergleichen. Und das sollte man auch tun, um den besten Kandidaten oder die beste Kandidatin für die jeweilige Position zu finden. Gar keine Frage. Dennoch möchte ich noch Bewusstsein dafür schaffen, dass wir immer noch über Menschen reden und man zwei Menschen natürlich sehr schwer miteinander vergleichen kann.",
            "start": 2490813,
            "end": 2515336,
            "confidence": 0.8187471264367814,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wichtig ist da vielleicht auch, man vergleicht ja nicht die Menschen, man vergleicht die Meinung von den Interviewern. Weil oft ist es ja auch so, dass es unterschiedliche Interviewer sind und wenn man die gleichen Fragen stellt, dann können die halt dementsprechend ihre Meinung dazu sagen, ihre Bewertung, wie sie das sehen, ob sie mit so jemandem zusammenarbeiten wollen oder nicht. Aber wenn du keine Fragen hast, die jeder stellt, dann hast du natürlich null Vergleichbarkeit und da kannst du überhaupt nichts machen. Also das ist auch dafür da, dass man einfach untereinander über die gleichen Fragen sprechen kann. Man kann es ja auch im Nachhinein diskutieren. Okay, wir sind uns ganz sicher bei Person A und Person B. Was hat er denn geantwortet auf diese Frage? Und dann kann man mal diskutieren. Ja, okay, wenn das so ist, okay, wenn diese Antwort gekommen ist, dann wollen wir den vielleicht wirklich nicht einstellen in unser Team oder passt er nicht in unser Team? Also solche Dinge sind natürlich schon angenehm, weil man das einfach als Grundlage hat, über sowas zu diskutieren. Vielleicht auch noch in dem Zusammenhang ganz ganz wichtig, man muss es sich natürlich aufschreiben, Notizen machen, was ist geantwortet worden, so grob zumindest, oder was war mein Eindruck von der Antwort, weil sonst hat man natürlich auch nichts in der Hand danach.",
            "start": 2515610,
            "end": 2582930,
            "confidence": 0.8059999999999995,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Meines Erachtens nach solltest du das gegebenenfalls gar nicht so grob notieren, sondern schon recht detailliert.",
            "start": 2582970,
            "end": 2588836,
            "confidence": 0.805125,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, es soll kein stenografisches Protokoll sein.",
            "start": 2588856,
            "end": 2591398,
            "confidence": 0.6095714285714285,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, das jetzt nicht. Aber du möchtest ja auch deinen Interviewprozess verbessern. Du möchtest ja auch wissen, okay, was haben jetzt die letzten 10, 15, 20, 25 Kandidaten geantwortet? Macht diese Antwort eigentlich Sinn für meine finale Entscheidung? Aber Wolfgang, jetzt nehmen wir doch einfach mal das Beispiel an, okay, du hast jetzt drei Personen, die haben alle gleich geantwortet. Alles super. Und jetzt hast du Lebensläufe. Einer kommt aus einer Webagentur von Wanner Eickel, einer direkt von Stanford und eine Person hat die letzten fünf Jahre bei Microsoft am Azure DevOps Produkt gearbeitet. Hat die Historie der Kandidatinnen und Kandidaten eine Relevanz für dich? Also ich meine, wie würdest du jetzt weitergehen? Du hast jetzt die drei Personen, hast aber nur eine Stelle zu besetzen, strukturiert, interviewtechnisch sind die alle auf dem gleichen Level.",
            "start": 2591968,
            "end": 2640041,
            "confidence": 0.780125925925926,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gibt es eigentlich dieses Wanne-Eichel wirklich? Das ist eine Stadt, oder? Von deiner Lieblingsagentur dort.",
            "start": 2640061,
            "end": 2645367,
            "confidence": 0.7423333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es ist nicht dein Ernst.",
            "start": 2645407,
            "end": 2646248,
            "confidence": 0.7704,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja ich bin ja als Österreicher, ich kenne ja nicht alle Käfer in Deutschland.",
            "start": 2646768,
            "end": 2651751,
            "confidence": 0.6797142857142856,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also Wanne-Eickel ist doch kein Kaff, Wanne-Eickel ist eine kreisfreie Stadt im nördlichen Ruhrgebiet.",
            "start": 2651811,
            "end": 2657575,
            "confidence": 0.682,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ah ist sogar Ruhrgebiet, unglaublich.",
            "start": 2657655,
            "end": 2660917,
            "confidence": 0.7939999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist ein richtiger Pott ist das, 21 Quadratkilometer groß.",
            "start": 2661017,
            "end": 2663658,
            "confidence": 0.5257777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber auf deine Frage zurückzukommen, natürlich ist das extrem schwierig, das muss ich schon auch sagen. Wenn man da CVs vor sich liegen hat mit Stanford, mit Amazon, Leute von Google, dann hat man da schon ganz andere Gedanken im Hintergrund, muss ich auch ganz ehrlich zugeben. Was mir dann auch ein bisschen die Augen geöffnet hat, ist, wie oft dann teilweise Leute in dem ersten Screening-Interview schon rausgefallen sind, obwohl sie bei Amazon waren. Keine Ahnung, ob der einfach Amazon reingeschrieben hat, ob er bei Amazon war, ich hab das natürlich nicht überprüft, aber am Ende muss die Person trotzdem passen. Und nur weil die bei Amazon war, heißt es noch lang nicht, und gerade von Amazon zum Beispiel, heißt es noch lang nicht, dass die in dieses Team jetzt reinpasst, weil da geht's vielleicht um andere Dinge, um andere Stärken, um eine andere persönlichkeit die man sucht oder das team sind andere persönlichkeiten und diese persönlichkeit von amazon passt einfach jetzt gar nicht in dieses team rein aber wer sagt, ihm ist es komplett egal und wenn der amazon steht dann hat es keine bedeutung ich glaube dass das einfach eine lüge ist und dass das, schwierig ist, aber man muss sich da einfach im Klaren sein. Es gibt halt diese ganzen Biases, die man hat. Das kann in alle Richtungen gehen. Geht dann auch in die Richtung Geschlecht natürlich, falls das ersichtlich ist im CV. Darum gibt es ja oft, dass in CVs, auch gerade in englischen Ländern, dann oft die Vornamen abgekürzt werden, dass man auch das Geschlecht nicht sieht oder das Alter. Also das alles spielt natürlich rein in den Bias. Oder hat er vielleicht bei einer Firma gearbeitet, wo man früher mal selber war oder wo man einfach ein großer Fan davon ist, von dem Produkt. Das spielt natürlich alles mit rein und die ganze Bias-Schiene ist natürlich ein großes Problem und die begegnet man halt am einfachsten damit. Erstens strukturierte Interviews, eben immer dieselben Fragen. mehrere Interviewer, möglichst divers natürlich die Interviewer, dann bekommt man höchstwahrscheinlich möglichst viele Perspektiven und Einblicke und wenn dann einer extrem gebiased ist und selber das gar nicht bemerkt hat, dann weisen ihn hoffentlich die anderen Leute darauf hin. Und sonst soll man halt einfach, wenn man weiß, dass man einen gewissen Bias hat, und den sollte man halt möglichst gut kennen, das ist natürlich gar nicht so einfach, aber dann halt einfach genau hinschauen und sich überlegen, okay, ist der von Amazon, passt der aber trotzdem zu meinem Team, bringt mir das überhaupt was, was der bei Amazon gemacht hat oder bei Google, oder will der nur extrem viel Geld dann am Ende und ich kann es eh nicht bezahlen, oder bringt mir der vielleicht irgendwie eine Unruhe rein, in dem Fall, weil wir einfach anders arbeiten, Also man muss das schon immer möglichst objektiv betrachten, ist natürlich schwierig, aber wenn man sich selber dessen bewusst ist, ist das glaube ich schon eine ganz gute Herangehensweise, um den Bias dann am Ende zu verringern und möglichst objektiv das Ganze zu betrachten.",
            "start": 2666580,
            "end": 2834861,
            "confidence": 0.8268307392996102,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was man aber dann schon voraussetzen kann ist, dass diese Big Tech Firmen Google, Microsoft, Amazon eine gewisse Hiring Bar haben. Das bedeutet, in Bezug auf theoretische Skills und ähnliches hat diese Person in der Regel diese Hiring Bar dann natürlich überstanden. Das kann man dann in der Regel voraussetzen, sofern es kein Acquihire war. Ein Acquihire ist, wenn Google zum Beispiel eine andere Firma aufkauft, dann werden die ganzen Software-Engineers in der Regel mit nach Google übernommen, ohne durch den Interviewprozess zu laufen. Sofern das ein Acquihire war, ist das ein anderer Entry in eine Big-Tech-Firma. Auf der anderen Seite als Kritik kann man aber auch sagen, hey, ich bin eine junge Firma, ich hab noch wenig Strukturen, und diese Big-Tech-Firmen, Amazon, Google, Microsoft, sind sehr, sehr strukturiert. Da gibt es eigentlich für alles einen Prozess und für alles eine Anleitung, und es gibt kaum noch eine offene Frage. können die Leute eigentlich in einem Unternehmen arbeiten, wo es all das noch nicht gibt. Weil das erfordert eine andere Art von Attributen und eine andere Art von Skills, als in einem komplett strukturierten, komplett gemanagten Unternehmen zu arbeiten. Das bedeutet, man muss auch sicher sein, um mit Unsicherheiten umzugehen. Und es gibt auch einfach Leute, die bevorzugen strukturierte Unternehmen. Deswegen möchte ich sagen, nur weil die Person einen großen Namen auf dem Lebenslauf hat, heißt das nicht, die Person ist dafür geeignet.",
            "start": 2835321,
            "end": 2918890,
            "confidence": 0.8545236051502147,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich kenne auch eine Geschichte von einem Kandidaten, der einfach überfordert war, wie er gehört hat, was denn alles nicht funktioniert in der Firma. Und davor war er bei Google. Und der war es halt einfach nicht gewöhnt, selber Sachen zu deployen oder sich um irgendwie solche Dinge zu kümmern. Der hat halt gesagt, ja, das haben andere gemacht. Wir hatten da das perfekte Tooling. Und ich habe erstens selber keine Ahnung, wie man das überhaupt macht. Und ich möchte auch ehrlich gesagt nicht in so einer Umgebung arbeiten, wenn ich das nicht vollautomatisiert alles wegabstrahiert und wegautomatisiert habe. Und ich mich halt bei Google nur auf meinen Spezialbereich konzentrieren können. Und das kannst du natürlich in einer kleineren Firma, das kann auch eine sehr große Firma sein, aber nicht vergleichbar natürlich mit Google. Dann hast du halt vielleicht einfach Dinge, die man machen muss, die Teil der Aufgabe sind. Und jemand, der bei Google halt nur auf seinen Miniprozent Spezialbereich fokussiert war, der will sich halt mit dem ganzen anderen Pipelines und Tooling rundherum einfach nicht mehr rumschlagen. Und daher ist für mich eigentlich der CV, Uni, alter Arbeitgeber und so weiter, das kann ein Signal sein. Ich freue mich am Anfang vielleicht, cool, da bewirbt sich jemand von Google. aber dann kommt er in die normale Pipeline, wird hoffentlich möglichst normal behandelt wie alle anderen auch. Man geht die Fragen durch, man geht den Prozess durch und am Ende trifft man genauso wie mit allen anderen eine fundierte Entscheidung hoffentlich und es ist nicht mehr oder weniger für mich im Idealfall zumindest. Aber gehen wir mal genauer in diesen Entscheidungsprozess am Ende rein. Wie entscheidet man sich denn, ob jetzt jemand gut geeignet ist? Man hat diesen Fragekatalog, hat die Antworten, hat im Idealfall auch die Rückmeldungen von allen Interviewern bekommen. Wie trifft man dann die Entscheidung?",
            "start": 2918930,
            "end": 3024283,
            "confidence": 0.8093042071197407,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das Einfachste wäre natürlich, man trifft sich in einem Raum oder in einem Google Meet oder in einem Zoom und quatscht einfach drüber. Doch das hat einen heftigen Nachteil. Und zwar ist das nämlich die Beeinflussung voneinander. Meines Erachtens nach sollte man nach jedem Interview-Step, sofern man einen Multi-Stage-Interview-Prozess hat, ein Formular rumsenden, wo jeder dann seine Meinung abgibt. So was wie nach dem Motto, hat die Kandidatin diesen Interview-Step bestanden? Ja, nein. Meines Erachtens nach sollte dort nicht maybe oder vielleicht stehen, weil das ist immer sehr schwierig. Diese Menschen sollen eine harte Entscheidung treffen. Ja, nein. Dann frage ich oft ab in diesem Formular, was hat den Kandidaten Was hat den Interviewern gefallen am Kandidaten? Was hätte der Kandidat besser machen können? Und dann noch ein Feld für generelle Beobachtungen. Da kann einfach alles reingeschrieben werden. Sobald alle Interviewteilnehmer dann dieses Feedback gegeben haben, dann kann der Hiringmanager entweder eine Entscheidung treffen, machen wir weiter, wird ein Angebot gemacht oder, oder, oder. Oder man kann sich nochmal danach zusammensetzen und darüber diskutieren. Wichtig ist aber, dass man das Feedback vorher in geschriebener Form übermittelt hat, damit man sich, wenn man drüber spricht, nicht gegenseitig beeinflusst, weil die erste Person, die ihre Meinung, ihr Resultat teilt, beeinflusst dann eigentlich schon die zweite Person. Was ich dann auch noch oft mache, ich teile das Feedback, was von jedem submittet wurde. im Interviewkreis, damit diese Personen voneinander auch lernen können und vielleicht hier und da noch den einen oder anderen Skill entwickeln, wo drauf man zum Beispiel beim Interview achten könnte oder nicht. Weil besonders, wenn du neue Personen mit in den Interviewprozess mit einbeziehst, diese Personen müssen natürlich auch mal erst ein Gefühl dafür entwickeln, welche Fragen sind gut, welche Fragen nicht gut. Natürlich helfen da ein Teil der strukturierten Interviews sehr, aber wie wertet man das denn jetzt? Wie zum Beispiel, dass man vielleicht mit sehr nervösen Kandidaten ein bisschen anders umgehen muss, als mit Leuten, die sehr selbstsicher auftreten.",
            "start": 3024303,
            "end": 3140897,
            "confidence": 0.8175407854984892,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube ganz allgemein, was auch noch ein guter Tipp ist, wenn man jetzt wirklich beurteilt als Interviewer, dass man sich anschaut, okay, wo liegen die Stärken von dem Kandidaten oder der Kandidatin und nicht, wo liegen die Schwächen. Weil ganz oft hat man irgendwie so eine Matrix, die man abcheckt, Datenbankwissen, algorithmisches Wissen, keine Ahnung. Und man hat dann irgendwie drei Bereiche, die sehr negativ sind und man sagt dann, ja, okay, der war da extrem schlecht in diesen Bereichen und wir wollen ihn daher nicht. Ist natürlich legitim, wenn man jetzt wirklich auf diese Bereiche angewiesen ist, aber ich würde mir einfach fokussieren, okay, wo ist der Kandidat wirklich stark, wo kann er uns weiterbringen und klar, man wird immer Bereiche finden, wo eine Kandidatin schlechter ist oder ein Kandidat und Da könnte man immer argumentieren, ja, aber der kennt sich da nicht aus in dem Bereich, in Datenbanken. Und wir haben ja auch irgendwie Datenbanken. Dass man vielleicht Datenbankenwissen lernen kann und das vielleicht gar nicht so wichtig ist in dem Bereich, wenn man Software Engineer ist, könnte man auch argumentieren, okay, der ist aber extrem stark in der Architektur von Software, in Clean Code und so weiter. Und darum wollen wir ihn unbedingt. Also man sollte sich wirklich auf diese Stärken konzentrieren und nicht durch die Schwächen beeinflussen lassen. Weil wichtig ist einfach, dass es eine Person ist, die einen weiterbringen kann in einem gewissen Bereich. Und das muss kein, wie man in Österreich sagt, Wunderwuzi sein, der in jedem Bereich alles machen kann. Also das gibt es ja fast nicht. Und dafür ist natürlich auch dann der High-Rank-Manager da, der am Schluss eben dieses Feedback einsammelt und die Einzelentscheidungen und dann wirklich eine finale Entscheidung trifft oder auch im Team mit den Interviewern das Ganze diskutiert. Da ist eben wichtig, wie der Andi schon erwähnt hat, dass man diese Sachen vorab schriftlich niedergeschrieben hat, damit man sich nicht dann beeinflussen lässt, weil das muss man erst mal schaffen, wenn man in einer Fünferrunde steht. Der Einzige ist, der ein hartes Nein hat und dann sagen vier Leute, der war aber super. Dann auf seinem Nein-Standpunkt zu beharren, ist wirklich schwierig. Wenn man das im Vorhinein abgegeben hat, dann steht das mal auf Papier. Und ich habe das auch schon oft erlebt, egal ob Nein oder Ja, dass dann in der Diskussion am Ende die Leute wirklich gesagt haben, ja okay, ich habe zwar Nein gehabt, aber der Aspekt, der hat mir gefehlt in meinem Interview. Schauen wir noch mal tiefer rein oder könnten wir uns überlegen. Aber dann hat man eine gute Diskussionsbasis. Aber sonst hat man da automatisch sich beeinflussen lassen und bevor man überhaupt seine Meinung sagt, hat man vielleicht schon einfach irgendwas übernommen von den anderen Leuten. Also darum, hart aufschreiben und erst danach diskutieren. Und der Pro-Tipp ist auch, möglichst schnell nach dem Interview das runterzuschreiben. Nicht eine Woche zu warten, sondern wirklich sofort runterschreiben. Was waren die Antworten? Wie hat mir der Kandidat oder die Kandidatin gefallen? ist es ein ja, nein, sollen wir in den nächsten Step gehen, wie auch immer der Prozess dann ist und auf keinen Fall, ich habe mal einen Freund gehabt, der hatte vergessen dieses Formular auszufüllen oder hat es rausgeschoben und am Ende wusste er nicht mal mehr, wer dieser Kandidat überhaupt war. Er hat den Namen zu dem Bild nicht mehr zuordnen können, der hat viele Interviews geführt und hat es fast nicht mehr geschafft rauszufinden, wer der eigentliche Kandidat war.",
            "start": 3141117,
            "end": 3328306,
            "confidence": 0.8108505942275044,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin ein Freund vom schnellen Feedback, dennoch finde ich es auch völlig okay, wenn man je nach Position mal eine Nacht darüber schläft.",
            "start": 3328346,
            "end": 3334009,
            "confidence": 0.7362916666666665,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Solange du dich dann noch erinnern kannst, wen du interviewt hast am Vortag, ist das vollkommen okay. Aber ich komme ja auch langsam in ein Alter, da ist das schwieriger. Und dann mache ich lieber sofort die Notizen. Aber man kann sich ja auch die Ja-Nein-Entscheidung dann zum Beispiel auf den nächsten Tag aufsparen. Kann man mal die Facts, die Hard Facts runterschreiben und dann das Ja-Nein kann man sich ja auf den nächsten Tag noch überlegen. Sofern das der Prozess hergibt, weil ich kenne auch Firmen, die machen das wirklich hardcore in den nächsten 15 Minuten. Der Kandidat bleibt in der Leitung und bekommt sofort die Resultate bzw. den Outcome, wie weitergemacht wird, mitgeteilt.",
            "start": 3334529,
            "end": 3368936,
            "confidence": 0.7764695652173915,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Finde ich super, weil jetzt gerade besonders nach der aktuellen Marktlage ist es recht schwierig, weil manche Firmen haben einen sehr langen Interviewprozess, drei, vier, fünf, sechs Steps. Dann kriegt man vielleicht noch eine Homework-Aufgabe nach Hause geschickt, dann ein Architekturinterview, dann nochmal ein Hands-Interview und dann dies und dann das. Und speziell bei der aktuellen Marktlage, da es eigentlich mehr IT-Jobs gibt als Leute, die diese besetzen können, ist, glaube ich, ein schneller beziehungsweise kurzer Interviewprozess schon sehr vorteilhaft.",
            "start": 3368976,
            "end": 3396285,
            "confidence": 0.7391500000000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, möglichst schnell. Das ist, glaube ich, heutzutage wirklich das absolute Ziel. Möglichst schnell und trotzdem aber noch sinnvoll und qualitativ. Und wenn man das möglichst strukturiert macht, dann hat man da, glaube ich, auch die Möglichkeit, weil dann hat man einfach einen Prozess, wie das abläuft. Hat das gut definiert, die Leute interviewen können anhand der vordefinierten Fragen und auch der Job Description, was wirklich gesucht wird, gut bewerten und am Ende kann man dann möglichst schnell eine Entscheidung treffen. gemeinsam im Team oder am Ende natürlich der Hiring Manager hat natürlich das finale Vote dann. Aber jetzt hätte ich noch eine abschließende Frage an dich und zwar wir haben ja am Anfang gesprochen über die False Negatives und False Positives, dass man die False Positives möglichst klein halten will, weil man möglichst wenig Geld und Zeit verlieren will natürlich. Wie ist es mit der aktuellen Lage am Jobmarkt? Wenn man jetzt sieht, dass es so schwierig ist, Leute zu bekommen und dass das eigentlich die große Herausforderung ist, geht es dann nicht schon so weit in die Richtung, dass man sagen müsste, False Negatives, also Leute, die ich ablehne, obwohl sie gut sind, dass man diese Zahlen möglichst minimieren sollte und nicht mehr die False Positives, dass es vielleicht so teuer ist, einen guten Hire zu übersehen, dass das teurer ist, als jemanden ein halbes Jahr einzustellen und dann drauf zu kommen, Es war nicht die richtige Person?",
            "start": 3396785,
            "end": 3475964,
            "confidence": 0.8038999999999994,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Valide Frage, denke ich dennoch nicht. Ich denke, es gibt noch sehr viel Optimierungspotenzial in anderen Bereichen, Länge des Interviewsprozesses, Menschlichkeit des Interviewprozesses. Und ich denke auch, dass es auch sehr viel mit Firmenreputation zu tun hat, dass man da auch noch sehr viel machen kann. Ich denke nicht, man sollte die Qualität oder Entscheidungsgrundlage ändern. Und ich denke nicht, man sollte mehr Risiko eingehen, eine falsche Person einzustellen, die dann Team-, Abteilung- oder Firmenkultur zerstören kann. Weil ich denke, die Kosten sind mittel- bis langfristig deutlich höher als die Kosten für Recruiting. Und bevor die anderen Optimierungsfelder nicht ausgenutzt wurden, denke ich nicht, dass man diese Entscheidungsgrundlage bezüglich False-Negatives, False-Positives anders behandeln sollte.",
            "start": 3476004,
            "end": 3521867,
            "confidence": 0.8410701754385965,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was ich mir gut vorstellen könnte, ist, dass man vielleicht in Zukunft ein bisschen zurückgeht in Richtung extrem aufwendig gestaltete Interviews. Es hat ja so Testtage oder so hat es oft gegeben, dass man wirklich den ganzen Tag mit der Firma zusammenarbeitet oder mit Leuten, um sich dann eine Meinung zu bilden. Ich könnte mir vorstellen, dass man das vielleicht sogar erweitert, dass man sagt, okay, du kannst jetzt eine Woche bei uns arbeiten, bekommst auch bezahlt, eine Woche kannst du dir vielleicht freinehmen sogar beim alten Job und dann entscheiden beide Seiten nochmal, ist das ein guter Fit für beide Seiten. Also sowas könnte mir eigentlich ganz gut vorstellen, dass das in Zukunft vielleicht häufiger gemacht wird, weil das ja auch im Interesse vielleicht der Kandidaten und Kandidatinnen sein könnte, dass man die Firma wirklich gut kennenlernt in der Woche und auch den alten Job noch gar nicht kündigen muss. Also sowas könnte mir vorstellen, dass das vielleicht schon mal Firmen ausprobieren. Wäre auf jeden Fall meiner Meinung nach eine Ein Versuch wert.",
            "start": 3522647,
            "end": 3578562,
            "confidence": 0.8117586206896548,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehe ich ein bisschen anders, speziell im Remote-First-Umfeld. Ist das alles ein bisschen schwieriger, wenn du sagst, okay, 100-prozentige In-Office-Kultur, ja, vielleicht. Auf der anderen Seite, zweites Gegenargument wäre auch noch.",
            "start": 3578602,
            "end": 3590195,
            "confidence": 0.7983225806451614,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Warum siehst du das Problem bei der Remote-Seite?",
            "start": 3590235,
            "end": 3592978,
            "confidence": 0.46875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich denke, es ist ein anderes Verhalten, wenn du mit deinen Kollegen direkt im Büro sitzt, weil du dann viel mehr, viel mehr peerst und viel mehr Leuten über den Weg läufst und dann, ich sag mal, so die wirkliche Kultur und den Umgangston in der Abteilung mitkriegst durch, ich sag mal, Flurfunk, als in einem Remote-Setup.",
            "start": 3593582,
            "end": 3609725,
            "confidence": 0.7918421052631579,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ja, aber wenn du remote arbeitest, dann schlussendlich, dann ist es ja das selbe Setup. Das ist einfach dieser Setup, in dem du dann später arbeiten würdest.",
            "start": 3610106,
            "end": 3616967,
            "confidence": 0.7352857142857144,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist richtig, aber gegebenenfalls erfüllt dann dieser Demo-Tag oder Demo-Woche oder wo ich eine Woche schon ziemlich hart finde, muss ich zugeben. Ich finde Demo-Tag schon hart, aber ist eine andere Geschichte.",
            "start": 3617317,
            "end": 3628442,
            "confidence": 0.7487941176470588,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, weil eben eine Woche wäre dann schon fast ein Anstellungsverhältnis, weil du bekommst ja auch bezahlt. Du bist schon so weit gekommen, dass alle sagen, okay, ja, es sieht gut aus, aber wir wollen einfach nochmal eine Woche zusammenarbeiten. Es ist sozusagen die bessere Form von, hey, du fängst bei uns an und wir kommen dann in der Probezeit drauf, okay, es war nichts und wir feuern dich wieder. Sozusagen der Zwischenschritt zwischen den zwei Varianten.",
            "start": 3629444,
            "end": 3653702,
            "confidence": 0.7870779220779222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das zweite Gegenargument, was ich bringen würde, und das sehe ich persönlich so, vielleicht ist sowas anders, aber das Investment von Kandidatenseite ist schon eine ziemlich hohe Hausnummer. Besonders für einen Job, wo man in der Regel nicht in Rente geht. Also ich bin jetzt 35, ich denke, ich werde über meine Karriere hinweg schon noch die eine oder andere Firma sehen. Warum sollte ich dann, auch wenn ich es bezahlt kriege, ein höheres Zeitinvestment als eine ganze Woche machen, weil bei dieser Demowoche bleibt es ja nicht. Es geht ja auch schon vorher zugegangen mit den Interviews. Warum sollte ich dieses hohe Zeitinvestment überhaupt bringen, ohne die wirkliche Job Security dann zu haben? klar man kann man sagen okay in deutschland hat man in der regel sechs monate probezeit und ja da hat man auch eine kündigungsfrist von zwei wochen und so weiter und so fort aber machen wir uns mal nichts vor ein arbeitgeber in deutschland hat 25 bis 30 urlaubstage wenn ich davon fünf urlaubstage opfer dann ist das von 30 urlaubstagen ein sechstel wo ich nicht mit meiner familie in den urlaub fahren kann schon ein hartes investment.",
            "start": 3654122,
            "end": 3715617,
            "confidence": 0.7994687499999995,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du kannst ja auch schauen, ob du unbezahlten Urlaub bekommst, weil du bekommst ja dann von der Firma bezahlt, für die du arbeitest. Das wäre ja auch noch möglich. Ich glaube, es ist arbeitsrechtlich vielleicht auch ein bisschen schwierig. Aber ich habe gerade kürzlich jemanden erlebt, der von sich aus gesagt hat, bei einer Bewerbung, ob er sich das nicht mal zwei, drei Tage anschauen kann. Der arbeitet nicht Vollzeit und hat gemeint, in diesen Tagen kann er sich das gerne mal anschauen und er würde die Firma einfach besser kennenlernen und für ihn ist das ein wichtiger Schritt und er will sich das einfach persönlich ansehen. Also hat mich gewundert, aber ich finde es eigentlich eine gute Herangehensweise, weil du halt eine Firma viel besser kennenlernst, wenn du wirklich ein, zwei Tage mal mit denen zusammenarbeitest. Also dieser Demo-Day, das ist halt so ein bisschen Show und ein halbes Interview, das finde ich eher weniger geeignet. Hilft natürlich auch schon, aber umso länger, umso besser. Also vielleicht entwickelt sich da ja in Zukunft irgendwas. Vor allem für Leute, die halt eben jetzt keine Job-Hopper sind und jede sechs Monate ihre Firma wechseln. Wenn die da halt wirklich eine fundierte Entscheidung treffen wollen, Also wie gesagt, ich fände es auf jeden Fall wert, das mal zu bedenken, den Gedanken. Aber ich würde mich auch freuen auf Feedback und Input von allen, die uns jetzt gehört haben, was ihr dazu denkt, wie ihr eure Interviews strukturiert. Lasst uns das gerne wissen. Auch mit einem Audio-Feedback oder einer Voice-Message auf WhatsApp können wir dann auch gerne in den nächsten Episoden mal einbauen. Würden uns wirklich freuen. Und sonst wie immer Feedback auf EMG Kiosk auf Twitter oder bei E-Mail unter städtisch-at-engineering-kiosk.de Das war es von uns.",
            "start": 3716097,
            "end": 3815257,
            "confidence": 0.7829183673469385,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ein kleiner Einblick im Bereich Recruiting aus Firmensicht.",
            "start": 3815277,
            "end": 3818378,
            "confidence": 0.8182499999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oh, bevor wir jetzt abschließen, haben wir noch einen guten Link? Irgendwas? Haben wir gute Links zu dem Thema? Wir haben tausende Links zu dem Thema. Wir werden uns überlegen und ein paar Links in die Shownotes packen.",
            "start": 3819158,
            "end": 3830503,
            "confidence": 0.7376578947368422,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Schaut doch mal, wie der Recruiting-Prozess von eurer Firma aktuell ist. Vielleicht seid ihr sogar involviert und vielleicht habt ihr dann den einen oder anderen positiven Anschluss bekommen, da mal eine Änderung durchzuführen und die ganze Sache objektiver anstatt subjektiver zu gestalten. Wir hoffen, ihr konntet was mitnehmen und wünschen euch einen schönen Tag.",
            "start": 3830863,
            "end": 3847727,
            "confidence": 0.7280925925925927,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bis bald. Ciao.",
            "start": 3847767,
            "end": 3849448,
            "confidence": 0.37633333333333335,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.8072805920183267,
    "audio_duration": 3868.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}