{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/ebe153fc-4f58-49f5-a141-0e8243192204/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62xpt17c0n-7a1f-4eb5-b2fc-9f364148441e",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Heute geht es um ein Evergreen-Thema, über das nicht viele Leute sprechen. Gehälter in der Softwareindustrie. Im Speziellen um Gehaltsbausteine, wie sechsstellige Gehälter aufgebaut sind, ob diese gerechtfertigt sind und wie kleinere Firmen mit der Entwicklung in der Industrie umgehen. Eigentlich wollten wir ein neues Format, die gemischte Tüte, ausprobieren. Doch wir haben uns ganz einfach verquatscht. Wie, was, warum, hört ihr in den nächsten 50 Minuten. Los geht es jedoch mit dem Feedback-Cycle vom Podcasting. Viel Spaß mit dieser Episode. Eine Sache, Wolfgang, die mich irgendwie beim Podcasten stört, ist, dass der Feedback-Cycle so super lang ist. Weil in der Regel macht man ja keine Live-Podcasts, sondern man nimmt einen Podcast auf, schneidet vielleicht nochmal ein Intro davor, ein bisschen Musik drunter und dies und das und dann hat man in der Regel ja so ein Scheduling-Intervall, dass man wie zum Beispiel wir jeden Dienstagmorgen die neue Episode ruft. Und das bedeutet natürlich auch, dass man in der Regel vorher aufnimmt. Also wir nehmen in der Regel nicht am Montagabend auf oder am Dienstagmorgen, sondern vielleicht eine halbe Woche oder eine Woche davor. Das bedeutet jetzt also eigentlich, dass der Feedback-Cycle von unseren Hörerinnen und Hörern schon so ein bisschen später ankommt, beziehungsweise wir das Feedback später besprechen können. So. Und vor zwei Wochen haben wir eine Episode rausgehauen, die hieß, Wie Claudi bist du?",
            "start": 4298,
            "end": 94000,
            "confidence": 0.8142433628318588,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment, Moment, da muss ich jetzt einhaken, weil eigentlich ist es nur zwei Wochen jetzt her, weil du auf deinen Entspannungsurlaub da zur Recreation oder keine Ahnung was wolltest und darum nehmen wir jetzt so spät auf oder strahlen wir das Ganze so spät aus.",
            "start": 94680,
            "end": 109933,
            "confidence": 0.8002666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also, ich war nicht im Entspannungsurlaub, ich war mit dem lokalen Kegelclub auf Tour. Das ist die erste Baustelle.",
            "start": 110273,
            "end": 116518,
            "confidence": 0.7716842105263156,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, noch schlimmer, es ist nicht mal ein Entspannungsurlaub und darum haben wir so viel aufnehmen müssen für die Dose, dass ich in der Zwischenzeit, während du da auf der fallen Haut liegst, ausspiele und in die Welt raussende.",
            "start": 116538,
            "end": 128806,
            "confidence": 0.7535897435897436,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wir hatten auch intern im Kegelclub Diskussionen, ob die Kegeltour als Urlaub gewertet werden kann oder nicht.",
            "start": 128827,
            "end": 135513,
            "confidence": 0.8697777777777778,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und was war der Outcome?",
            "start": 136413,
            "end": 137314,
            "confidence": 0.6614000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaub, alle haben sich drüber lustig gemacht, dass das bei weitem kein Urlaub ist, sondern eher, wir bräuchten jetzt eine Woche Urlaub von uns selber, weil wir es einfach nicht mehr sehen können. Aber so viel dazu. Dennoch, zurück zum Feedback zu der Episode, wie cloudy bist du? Ich hörte so zwischen den Zeilen bei dem einen oder anderen Tweet, dass du der neue Cloud-Hater bist. Ich persönlich hab jetzt gar nicht so viel Feedback bekommen. Hast du mehr Feedback von diversen Leuten bekommen?",
            "start": 137653,
            "end": 164439,
            "confidence": 0.7574823529411766,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich kenne scheinbar mehr Cloud-Fanaten als nicht Cloud-Fanaten, aber ich habe eigentlich von beiden Seiten Feedback bekommen. Für die einen war da Cloud-Hater, was ja überhaupt nicht der Fall ist. Wir haben ja sogar eigentlich nur die Cloud besprochen. Und andere Leute haben das gemerkt, nur Cloud, und die waren überhaupt gegen die Episode, gegen dich auch. Also es gibt schon Leute, die gegen dich auch sind. Aber primär war ich der Cloud-Hater, weil Cloud sich halt doch durchgesetzt hat mittlerweile.",
            "start": 165507,
            "end": 192353,
            "confidence": 0.8182317073170732,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich denke, summa summarum kann man sagen, okay, beide Extreme, 100% On-Premise, 100% Bare-Metal-Server, 100% Cloud, ich glaube, das kommt immer ganz auf die Situation an. Und jedes Extrem hat ja in irgendeiner Art und Weise schon Nachteile, meines Erachtens nach. Naja, wie gehst du mit dem neuen.",
            "start": 192734,
            "end": 211618,
            "confidence": 0.7466041666666664,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Image als Cloud-Hater um?",
            "start": 211658,
            "end": 212939,
            "confidence": 0.81925,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kannst du damit leben? Oder sagst du, uh, wir müssen jetzt eine der nächsten Episoden wieder all in Cloud machen, weil das ist die Zukunft und ohne ... Ja, es braucht immer.",
            "start": 212959,
            "end": 221458,
            "confidence": 0.755625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jemanden, der in diesem Podcast gegen dich redet. Und das fällt halt immer auf mich zurück. Insofern muss ich auf der Schiene bleiben. Habe auch kein Problem damit. Ich habe auch einiges zu lachen gehabt. Wir haben einen super Tweet bekommen als Antwort von einem YouTube-Video über Bear Mettleson. Nennt sich dieser Typ. Ist eigentlich ein Werbevideo. Aber verlinken wir natürlich gerne in den Show Notes. Solltet ihr euch alle mal anschauen. Ist wirklich ein sehr gelungenes Video über einen Lead, der in der Bear-Metal-Zeit bleiben will. Jetzt bekomme ich sicher wieder ganz viel Feedback von der anderen Seite, dass ich zu cloudy bin.",
            "start": 221498,
            "end": 254850,
            "confidence": 0.7947788461538461,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wolfgang, seh das so, du bist der Ältere oder Weisere von uns beiden und du kennst ja das Schriftwort Old Man yells at Cloud und du bist leider hier Old Man.",
            "start": 254870,
            "end": 265577,
            "confidence": 0.8010967741935483,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Old Man yells at Andi, ja.",
            "start": 265637,
            "end": 266938,
            "confidence": 0.6739999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, so viel zum Feedback zur Episode 34, wie Claudi bist du. Wenn ihr diese noch nicht gehört habt, hört doch noch mal ganz kurz rein und dann könnt ihr noch mal, gern noch mal gegen Wolfgang und seine Cloud-Meinung ein bisschen wettern.",
            "start": 268159,
            "end": 283055,
            "confidence": 0.7723953488372095,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und weil ich nach dem Feedback so zerstört bin, hab ich mir gedacht, wir können nicht das gleiche Format weiterfahren, drum bringen wir halt mal ein anderes Format.",
            "start": 283095,
            "end": 289983,
            "confidence": 0.7340714285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Heute machen wir im Kiosk Xianggong mal eine gemischte Tüte. Also früher bin ich immer zum Kiosk gegangen, hatte einen D-Mark und habe gesagt, ich hätte gerne für einen D-Mark eine gemischte Tüte. Und dann habe ich mich vor diese kleinen Schubladen gestellt und habe gesagt, ja für 10 Pfennig weiße Mäuse und für 20 Pfennig saure Zungen und da gab es noch die, wie hießen die denn, Coca-Cola Gums oder sowas.",
            "start": 290871,
            "end": 316940,
            "confidence": 0.7612916666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Kolakracher.",
            "start": 317560,
            "end": 318462,
            "confidence": 0.6395,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kolakracher, genau, Kolakracher, so hießen die.",
            "start": 318702,
            "end": 321646,
            "confidence": 0.65,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wie viel hat man da um eine D-Mark bekommen, war das dann wirklich so ein Sack voll oder war das, wenn ich das gerade umrechne in unsere damalige Währung in Schilling, da hat man nicht viel bekommen, glaube ich, um eine D-Mark.",
            "start": 321666,
            "end": 332602,
            "confidence": 0.6975581395348838,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also eine gemischte Tüte für 2 Mark war schon recht groß und da hast du dann ab und zu mal schon Bauchschmerzen bekommen, weil da so viele Süßigkeiten drin waren. Aber für eine D-Mark würde ich schon so sagen, war eine gute gemischte Tüte für einen Mittag nach der Schule. Also nach der Grundschule oder sowas. Das war schon eine tolle Zeit. Weil wir im Engineering-Kurs sind, machen wir heute mal eine gemischte Tüte. Wie sieht eine gemischte Tüte im Podcast-Sektor aus? Und zwar bekommen wir immer mal wieder Feedback von Hörerinnen und Hörern mit neuen Fragen. Wie steht ihr denn dazu? Könnt ihr mal eine Folge zu Thema X machen? Und so weiter und so fort. Wir haben inzwischen auch schon eine recht große Liste an Feedback, Fragen und Wünschen auch bekommen. Jede Frage kann natürlich eine eigene Episode sein, doch wir dachten uns, dass wir einfach mal die ein oder andere Frage aufgreifen aus verschiedenen Bereichen, wie zum Beispiel Karriere oder Tech oder ähnliches und wir schmeißen die jetzt einfach mal hier in diese Episode. Einer von uns stellt die Frage beziehungsweise gibt eine kleine Einleitung, was wir als Feedback bekommen haben und die andere Person Gebt einfach mal ihre Meinung dazu ab, und dann diskutieren wir das Ganze mal. Wir versuchen die ganze Sache pro Frage zu timeboxen. Ich sag mal so auf 10, 12, maximal 15 Minuten. Kann aber auch einfach nur sein, yo, so stehen wir dazu. Schauen, wie es wird. Neues Format. Ob das ein dauerhaftes Format wird, wissen wir beide auch noch nicht. Werden wir mal schauen. Gebt uns auf jeden Fall mal Feedback nach der Episode, wie ihr diese gemischte Tüte denn so findet. Starten wir mal mit dem ersten Thema. Wolfgang, du warst vor kurzem auf YouTube zu sehnen, und zwar in einem anderen... Zu sehnen. Zu sehnen, zu sehnen. Und zwar warst du als Gast im SuperDuper Developers Club beim Nils Langner und hast über Bewerbungsgespräche gesprochen, beziehungsweise der Titel hieß, so bekommst du den Job oder auch nicht, Gespräch mit Wolfgang Gastler. Und das passt sehr gut zum Thema, denn die erste Frage ist Gehalt. Gehaltsbausteine und 300.000, 400.000, 500.000 Euro Jahresgehälter, wie man sie von Google und aus Amerika kennt.",
            "start": 333082,
            "end": 466548,
            "confidence": 0.8149865591397856,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe übrigens eine interessante Frage bekommen, in dem Zuge auch schon vorab, ob man mit meinem österreichischen Dialekt schlechter einen Job bekommt, oder schwieriger einen Job bekommt, oder weniger bezahlt bekommt. Was denkst du?",
            "start": 467043,
            "end": 477512,
            "confidence": 0.7599428571428573,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mein erster Gedanke ist, dass ich rassistisch bin. Mein zweiter Gedanke, ich hoffe nicht. Und mein dritter Gedanke, die Realität ist hart, ich könnte mir das schon vorstellen.",
            "start": 477532,
            "end": 485839,
            "confidence": 0.7809642857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe zu wenige Data Points, keine Ahnung, ehrlich gesagt, ob das irgendwie signifikant wäre.",
            "start": 485899,
            "end": 491543,
            "confidence": 0.7591333333333332,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was ist denn dein Gedankengang dazu?",
            "start": 491924,
            "end": 493525,
            "confidence": 0.6176666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich habe die Frage nicht gestellt. Es war irgendwer irgendwo.",
            "start": 494235,
            "end": 497297,
            "confidence": 0.8306363636363637,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber hast du denn mal gefragt, woher die Frage kommt?",
            "start": 497338,
            "end": 499399,
            "confidence": 0.6405000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, der Hintergrund ist einfach so wie immer. Ihr wollt euch alle über Österreicher lustig machen. Dementsprechend wurde diese Frage in den Raum geworfen. Aber gefühlt habe ich natürlich immer weniger bekommen als andere. Ganz klar. Aber das ist ja sowieso die Grundeinstellung, haben wir übrigens in einem YouTube-Video auch besprochen, dass man immer das Gefühl hat, dass man weniger verdient als die anderen, weil man immer irgendwen kennt, der mehr verdient.",
            "start": 499439,
            "end": 520571,
            "confidence": 0.7892602739726029,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das Problem ist immer, also mehr geht immer und du findest auch immer jemanden, der mehr zahlt. Die Frage ist nur, was musst du dafür machen? Man kann halt nicht erwarten, dass man 200.000 Euro verdient und dann eine 32-Stunden-Woche hat. Vielleicht gibt es Leute da draußen, die das machen. Ich weiß nicht, wie realistisch das ist. Der Punkt ist aber hier bei der Frage, wie sieht denn so ein 200.000, 300.000 Euro Gehalt aus? Kriegen die Menschen dann pro Jahr 200.000 Euro überwiesen? Die Antwort ist relativ einfach, wenn wir über so hohe Gehälter reden. Nein, diese Menschen bekommen nicht 200.000, 300.000, 400.000 Euro überwiesen. Denn deren Gehalt ist nicht deren Basisgehalt, also diese Zahl ist nicht deren Basisgehalt, sondern diese Zahl nennt man im Sektor der IT Total Compensation.",
            "start": 520591,
            "end": 567451,
            "confidence": 0.8017878787878784,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich sehe das grundsätzlich ein bisschen anders. Es stimmt natürlich, dass du nicht alles automatisch immer bekommst. Aber im Endeffekt bekommt man natürlich dieses Geld schon raus, auch wenn man das jetzt in Aktien bekommt, in Equity am Ende. Das kann natürlich unter Umständen fallen, aber es ist sogar so weit mittlerweile in der Industrie, wenn die Aktien fallen, dass das teilweise kompensiert wird, dass du trotzdem dieses Gehalt bekommst, also trotzdem dieses Geld wirklich überwiesen bekommst. Du bekommst es vielleicht am Ende des Jahres oder im nächsten Jahr, aber im Endeffekt bekommst du das schon überwiesen. Also ich glaube, diese Ausrede, das ist ja eigentlich kein echtes Geld. das auch viele sagen und darum bekomme das ja auch gar nicht im endeffekt bekommt was.",
            "start": 567731,
            "end": 606853,
            "confidence": 0.8101269841269838,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du springst ja direkt schon in die bausteine einer total compensation lass uns doch mal ganz kurz durch die bausteine gehen und zwar, wenn wir von total compensation also von it gehältern sprechen dann sprechen wir in der regel von vier bausteinen innerhalb der total compensation wir sprechen von dem basisgehalt, Und das ist in der Regel das Gehalt, was eigentlich jeder bekommt. Das ist nämlich genau das, was monatlich auf deinem Konto landet und das, was wirklich jeden Monat gleich bleibt. Ich rechne jetzt einfach mal irgendwelche Steueranpassungen und betriebliche Altersvorsorgeanpassungen und Krankenversicherungen, gesetzlich, privat, das rechne ich alles mal raus. Wenn die Steuerbausteine alle gleich bleiben, dann kriegt man eigentlich jeden Monat das gleiche Brutto Netto überwiesen. Das ist das sogenannte Basisgehalt. Als zweiten Baustein gibt es den sogenannten Signing Bonus. Der Signing Bonus wird in der Regel einmalig gezahlt, wenn man den Job wechselt. Man kann eigentlich dahinter die folgende Aussage treffen, wenn du bei mir als Firma den Job annimmst, zahle ich dir nochmal 5.000 Euro, 10.000 Euro oder 20.000 Euro als Einmalzahlung dafür, dass du als Fachkraft zu mir in die Firma gekommen bist. Dieser Signing-Bonus kann natürlich einmal ausgezahlt werden oder irgendwie gestückelt werden. Du unterschreibst jetzt den Vertrag. Sagen wir mal 10.000 Euro ist gerade leichter zu rechnen. Du unterschreibst jetzt den Vertrag und kriegst 5.000 Euro. Nach der Probezeit kriegst du nochmal 2.000 Euro und wenn du ein Jahr bleibst, dann kriegst du 3.000 Euro. Ja, also die Stückelung des Signing-Bonus kommt immer ganz auf die Firma an. Punkt ist aber, das ist der zweite Gehaltsbaustein.",
            "start": 606893,
            "end": 708650,
            "confidence": 0.8139772727272723,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bisher hast du alles überwiesen bekommen, oder?",
            "start": 708671,
            "end": 710911,
            "confidence": 0.624,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hatte noch nie einen Signing-Bonus.",
            "start": 710951,
            "end": 712811,
            "confidence": 0.7921666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Von daher... Okay, aber normal den Signing-Bonus bekommt man sofort zu Beginn und zu Basisgehalt bekommt man natürlich auch überwiesen.",
            "start": 712851,
            "end": 719553,
            "confidence": 0.8095000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Als dritter Baustein gibt es das sogenannte Equity. Equity, auch genannt Firmenanteile. Sehr kompliziertes Thema. In Europa nennt man sowas ESOP, WESOP. Stiller gesellschaft an der gmbh oder oder oder punkt ist man besitzt einen prozentualen anteil an der firma. Diese firma muss nicht an der börse sein sie kann auch privat gehalten werden.",
            "start": 719853,
            "end": 743242,
            "confidence": 0.8530363636363635,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sowas gibt es auch oder man bekommt das recht darauf anteile dann zu kaufen.",
            "start": 743262,
            "end": 748485,
            "confidence": 0.8590714285714285,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau also das ist ja genau die komplexität dabei da gibt es verschiedene modelle. die unterschiedlich in verschiedenen Ländern gehandhabt werden. Auch die Versteuerung ist ein großes Thema da. Das kommt unter anderem darauf an, auch an welcher Börse gehandelt wird. Zum Beispiel das Verkaufen als deutscher Staatsbürger an der amerikanischen Nasdaq läuft ein bisschen anders, als wenn ich jetzt Aktien oder meine Firmenanteile am deutschen DAX, an der Frankfurter Börse oder ähnliches verkaufe. Das ist ein alles kompliziertes Thema und wir sind natürlich auch keine Steuerberater und wir dürfen euch natürlich auch alles nicht empfehlen, was ihr tut und das werden wir auch nicht tun. Ich will nur sagen, das ist zum Beispiel ein dritter Gehaltsbaustein, der zum Beispiel so aussehen könnte, wenn ich jetzt 200.000 Euro Total Compensation habe. pro Jahr, dann könnte das zum Beispiel aussehen, dass ich 50.000 oder 80.000 Euro jedes Jahr an Firmenanteile bekomme. Das ist Standard bei sehr vielen Firmen im aktuellen Tech-Sektor.",
            "start": 748525,
            "end": 813453,
            "confidence": 0.8465250000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bei großen Firmen, die üblicherweise dann auch Public sind oder großen Startups in dem Bereich. Im privaten Bereich ist es wahrscheinlich bei einem Mittelständler. In Deutschland gibt es das wahrscheinlich selten.",
            "start": 813473,
            "end": 824638,
            "confidence": 0.8188387096774193,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mehr und mehr Firmen gehen in die Richtung, denn mehr und mehr Mitarbeiter wollen natürlich auch wissen, wofür sie arbeiten. Und sie wollen natürlich auch einen Anteil am ganzheitlichen Erfolg des Unternehmens haben. Speziell bei den aktuellen Generationen, die jetzt auf den Arbeitsmarkt kommen, ist der Purpose ja immer wichtiger. Und Equity beziehungsweise Firmenanteile spielen da eine wichtige Rolle. Wir müssen uns aber mal ganz kurz auf den Hintern setzen. Weil das heißt jetzt nicht, dass ich 1% der Firma bekomme oder 5% der Firma bekomme, sondern wir reden da in der Regel von 0,00 und so weiter Prozent.",
            "start": 825218,
            "end": 862853,
            "confidence": 0.84489898989899,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, üblicherweise wird das ja auch so definiert, dass du einen Geldbetrag genannt bekommst, jetzt keine Ahnung, nochmal 50.000 pro Jahr dazu und du bekommst aber diese 50.000 nicht in Euro, sondern in Anteilen. Und meistens wird es zu Beginn, wenn du den Job beginnst, wird es einfach umgerechnet, was sind die aktuellen Anteile wert und dann bekommst du so und so viele Anteile im Wert von 50.000 Euro und die Anteile können dann später nach oben gehen, nach unten und das ist dann eigentlich dein Risiko, wobei eben mittlerweile das viel seltener auch ein Risiko ist, weil die Firmen unter Umständen sogar danach kompensieren, wenn der Aktienpreis zum Beispiel stark nach unten geht. Also das Risiko wird immer kleiner, Diese.",
            "start": 862893,
            "end": 906129,
            "confidence": 0.8141652892561979,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Equity bekommt man zum Beispiel wie den Signing Bonus nicht einmalig. Also man kann natürlich auch einmalige Equity Grants bekommen von der Firma. Doch wenn wir von der Total Compensation sprechen, dann sprechen wir von sogenannten Yearly Refreshern. Das bedeutet jedes Jahr bekommt man dann Anteile im Wert von 50.000 Euro. Was passiert, wenn die Firmenbewertung während dieses Jahres hoch ging? Dann bekommt man weniger Anteile, man bekommt dennoch die Masse an Anteilen, um dann monetär auf 50.000 Euro zu bekommen. Wenn jetzt jedoch aber die Firmenbewertung in diesem Jahr hoch ging, sind deine vorherigen 50.000 Euro natürlich mit dem prozentualen Anstieg der Bewertung auch gestiegen. Das bedeutet, Du hast aus deinen vorherigen 50.000 Euro mehr Geld gemacht. Wie man jetzt aber in der Industrie sieht, Wirecard, Thema Klarna, kann die ganze Sache auch in die andere Richtung gehen. Das bedeutet, dass deine 50.000 Euro natürlich dann auch deutlich weniger wert sind. sehr viele Leute eine kritische Einstellung gegenüber Firmenanteilen, weil das halt kein pure Cash ist, also es ist aktuell noch kein Cash, was du so überwiesen bekommst, sondern es sind, es ist Papiergeld, nennen wir es mal, ja, es ist Geld, was du gerade nicht ausgeben kannst, es ist Geld, was du später erst veräußern kannst. Sofern diese Firma noch nicht an der Börse ist. Wenn die Firma an der Börse ist, dann kannst du es natürlich veräußern. Da geht es natürlich dann auf die Haltefristen ein, nennt man dann im Englischen Vesting. In der Regel ist so ein Equity Grant, du kriegst jetzt 50.000 Euro Anteile an drei oder vier Jahre gebunden, wo du dann 33% oder 25% pro Jahr verkaufen kannst. Das bedeutet, man nennt das auch Golden Handcuffs, also auch die goldenen Handschellen, dass du dann wegen Geld länger bei der Firma bleibst, ist auch noch ein negativer Punkt. Und natürlich die Volatilität dieses Wertes spielt natürlich auch eine Rolle. Ich nenne das immer High Risk, High Reward. Obwohl das natürlich mit einem gewissen Zwinkern zu sehen ist, da in der Regel das Basisgehalt von ITlern bereits sehr gut ist. Equity kann noch mal einen hohen Uplift haben. kann aber auch einen hohen Downlift haben und deswegen sind ziemlich viele, ja ich kenne das zumindest aus dem deutschen Bereich, Leute sehr konservativ eingestellt und sehen Equity nicht sehr gerne, die hätten lieber ein höheres Basisgehalt.",
            "start": 906169,
            "end": 1051139,
            "confidence": 0.8145820512820512,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kann man ja üblicherweise auch dementsprechend verhandeln und viele Firmen bieten das ja sogar an, dass du dir das aussuchen kannst, wie viel Basisgehalt, wie viel Equity und da einen gewissen Spielraum hast. Was hältst du denn von Boni und jährlichen Boni, die so auch meistens herumschwirren in dem ganzen Bereich?",
            "start": 1051159,
            "end": 1067070,
            "confidence": 0.7811764705882352,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jährliche Boni, meinst du Zielgesetze Boni?",
            "start": 1067090,
            "end": 1070251,
            "confidence": 0.8318333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Je nachdem, gibt ja beides. Gibt Firmen, also grundsätzlich ist immer ein Ziel daran geknüpft, meines Wissens, an dem Bonus, aber es kann natürlich dein persönliches Ziel sein und es kann ein Firmenziel sein.",
            "start": 1070271,
            "end": 1081134,
            "confidence": 0.8238235294117648,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist nämlich der vierte Gehaltsbaustein, jährliche Boni. Ich persönlich bin da kein richtiger Fan davon. Nicht weil ich nicht an persönliche Ziele glaube, das schon, doch ich denke in der heutigen Zeit verändert sich das Umfeld so schnell, so stark. Und wenn die Firmenstrategie oder die Strategie der Abteilung oder irgendein großes Event eintritt, wo dann mal ganz klar die Arbeit über den Haufen geworfen wird und wo an etwas anderes gearbeitet wird, weil das gerade wichtiger ist, dann fallen in der Regel die jährlichen Ziele hinten ran. Ich bin da kein wirklicher Fan von. Ich bin eher ein Fan von Equity. weil du dann ganz klar am großen Ganzen mitarbeitest und wenn jeder irgendwie andere Ziele hat, dann arbeitet jeder irgendwie nur so für sich. Klar, in der perfekten Welt sollten die persönlichen Ziele schon im ganzen Team aligned sein und in dieselbe Richtung gehen. Ist das immer so? Gute Frage. Aber ich denke schon, diese Ziele müssen so gesteckt werden, dass man sie alleine erreichen kann, weil es ist ja auch dein Gehalt. Und speziell bei manchen Positionen finde ich es schwierig. Nehmen wir mal den Site-Reliability-Engineer oder den System-Administrator. Die Stabilität des ... Und angenommen, ein Ziel ist die Stabilität des Systems. Die ist unglaublich abhängig von der Software, die man betreibt. Unglaublich abhängig von dem Software-Entwicklungsteam und so.",
            "start": 1081968,
            "end": 1162171,
            "confidence": 0.8195336322869954,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du willst jetzt als SRE nur rausreden, dass die Developer eigentlich schuld sind an der Stabilität.",
            "start": 1162586,
            "end": 1166828,
            "confidence": 0.6588125,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oh nein, nehmen wir mal Data Science. Ich bin ja auch kein Data Science, ja? Nehmen wir nur mal Data Science, und du bist kontinuierlich damit zu Gange, deine Daten zu säubern, ja? Und hast nicht das richtige Tooling, weil es keine Data Engineering-Abteilung gibt, die dir einen Hadoop-Cluster dahinstellt oder Ähnliches, und es wird auch kein Geld für BigQuery ausgegeben werden, sondern du hantierst einfach mit großen CSV-Tabellen und Excel und Co. auf deinem lokalen Laptop. Und du bist halt kontinuierlich am Datenreinigen, aber niemand will Zeit und Arbeit in saubere Daten investieren. Und dann kommt als Ziel, dann kommt am Jahresende die Nachricht, du hast dein jährliches Ziel nicht erreicht, weil du zu langsam mit deinen Datenanalysen bist. Verstehst du? Das ist halt schwierig.",
            "start": 1167188,
            "end": 1204323,
            "confidence": 0.7713888888888888,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also ich glaube, man findet immer Ausreden. Und ich glaube, das ist das große Problem am Bonus. Es erwartet sich jeder den Bonus, ist enttäuscht, wenn man einen Bonus nicht bekommt. Vielleicht geht es dann sogar so weit, dass man dann kündigt. Das heißt, der Bonus wird eigentlich immer erwartet und man findet dann vielleicht Ausreden. Und die meisten Leute planen dann den Bonus eigentlich schon fix ein. Und der hat dann meiner Meinung nach eher negative Auswirkungen im Endeffekt. Also ich bin auch kein Fan von Bonus. Ich finde Equity da wesentlich besser.",
            "start": 1204363,
            "end": 1230413,
            "confidence": 0.7754000000000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Obwohl man sagen muss, bei Equity hat man natürlich als einzelner Mitarbeiter deutlich weniger Einfluss. Auf das Gesamtergebnis, wobei man bei einem Boni bei guten Zieldefinitionen natürlich schon mehr Einfluss hätte, das muss man ja auch fairerweise sagen.",
            "start": 1230453,
            "end": 1241885,
            "confidence": 0.8343421052631579,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wobei die meisten Boni ja auch eher an Firmenziele geknüpft sind, wie viel Umsatz hat es gegeben oder es ist irgendwie abhängig vom Umsatz vom Gewinn. Und darauf hat man natürlich auch nur wenig Einfluss, außer man sitzt jetzt ganz, ganz weit oben in der Hierarchie. Und da hat man meistens dann eh irgendwelche direkten Ziele, die verknüpft sind mit den einzelnen Boni. Da bekommt man dann sowieso andere Boni. Aber auch da, finde ich, ist es die falsche Motivation, wenn es dann nur darum geht, irgendwie den Gewinn zu erhöhen oder den Umsatz zu erhöhen. Auch das bezweifle ich mal, ob das Sinn macht. Aber gut, es ist sehr üblich auf jeden Fall. Und in Deutschland wahrscheinlich wesentlich üblicher als Equity.",
            "start": 1241925,
            "end": 1277202,
            "confidence": 0.8041885245901643,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da stimme ich dir zu. Jetzt ist die Frage, Weihnachts- und Urlaubsgeld, das rechnen wir in jährliche Boni mit rein, oder?",
            "start": 1277242,
            "end": 1282887,
            "confidence": 0.8346190476190475,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist Teil vom Basisgehalt, das bekommst du ja immer.",
            "start": 1283467,
            "end": 1285909,
            "confidence": 0.6368181818181818,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, es kommt darauf an, wie das im Vertrag geregelt ist. Wenn das eine Gratifikation ist, eine Gratifikation kann zum Beispiel über zehn Jahre ausgezahlt werden, ist aber dann immer noch keine.",
            "start": 1286069,
            "end": 1295517,
            "confidence": 0.8171875000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Pflicht, Okay, das ist für alle Österreicher und Österreicherinnen natürlich immer verwirrend, weil du hast Urlaubs- und Weihnachtsgeld verpflichtend in Österreich. Du bekommst einen 13. und 14. Monatsgehalt in Österreich. Darum ist die Verwirrung. In Deutschland ist das natürlich dann etwas Zusätzliches.",
            "start": 1295537,
            "end": 1311117,
            "confidence": 0.7516666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ganz genau, in Deutschland ist das nämlich keine Pflicht vom Arbeitgeber. Wie dem auch sei, das sind halt die 4 Bausteine eines Gehaltes, was normal als Total Compensation gilt. Basisgehalt, Signing Bonus, Firmenanteile und den jährlichen Bonus. Das heißt jetzt nicht, dass ihr immer alles bekommen müsst. Ich bekomme zum Beispiel auch nicht alles. Wir wollten euch aber mal ganz kurz den Kontext erklären, dass diese 200, 300, 400.000 Euro Gehälter kein Basisgehalt sind, sondern in der Regel aus einem bis sogar allen vier dieser Bausteine besteht. Und dass das natürlich nicht alles Kohle ist, was die Leute sofort bekommen. und dass da auch ein gewisses Risiko mit hineinspielt, speziell bei den Firmenanteilen oder bei den Boni.",
            "start": 1311713,
            "end": 1360272,
            "confidence": 0.8261709401709407,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hast du schon am Anfang diese Zahl 300.000 und so erwähnt, geht ja vor allem dann eher um die amerikanische Seite höchstwahrscheinlich, weil in Deutschland bekommt man jetzt seltener 300.000, obwohl es natürlich auch immer mehr in die Richtung geht, muss man dazu sagen. Aber ich glaube es ist schwierig jetzt als Developer 300.000 zu bekommen in Deutschland. Und da haben wir eine interessante Frage von Jonathan bekommen, ob es sich langfristig überhaupt noch lohnt in Deutschland zu bleiben und man nicht einfach nach Amerika gehen sollte als Entwickler.",
            "start": 1360292,
            "end": 1388211,
            "confidence": 0.7477222222222223,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich denke es lohnt sich noch in Deutschland zu bleiben denn diese Gehälter werden sehr sehr oft an der sogenannten cost of living angepasst. Eine 40-Quadratmeter-Wohnung in New York kostet mit hoher Wahrscheinlichkeit mehr als in Duisburg. Und das Gleiche ist für die Bay Area oder für San Francisco und Co., wo man oft diese Big-Tech-Firmen hat. Und daher kommen dann auch oft diese Gehälter. Dasselbe gilt für Kanada oder auch Texas oder Ähnliches, ja.",
            "start": 1388231,
            "end": 1418138,
            "confidence": 0.8115199999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Glaubst du, dass das eigentlich fair ist? Ihr habt kürzlich mal mit einem Google Lead gesprochen oder diskutiert eigentlich und ihre Ansicht war, es ist die gleiche Arbeit, die du machst. Warum bekommst du weniger Geld? Nur weil du woanders lebst?",
            "start": 1418758,
            "end": 1431215,
            "confidence": 0.8088780487804879,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sehr gute Frage, weil ich denke auch unter anderem die Kosten drumherum sind auch anders.",
            "start": 1431235,
            "end": 1436502,
            "confidence": 0.8587999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber du arbeitest ja remote für, keine Ahnung, Google und Google ist es ja eigentlich egal, in welcher Stadt du lebst. Für Google ist es dieselbe Arbeit, selbe Kosten.",
            "start": 1436948,
            "end": 1445653,
            "confidence": 0.7462666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das stimmt ja nicht. Google teilt die Mitarbeiter in Projekte ein und die Projekte sind in der Regel location-dependent, wie zum Beispiel in Zürich wird YouTube gemacht, die V8-Engine von Chrome wird in München gemacht. und so weiter und so fort ja also deswegen ist das halt nicht ganz egal und je nach qualifikation wird halt nicht alles in jedem projekt oder in jedem produkt gebraucht also deswegen ist das jetzt nicht so egal wo ich aber bei dir bin ist nehmen wir mal an Wir sind in der Lage die Mieten und die Krankenkasse und alles was da und die steuerlichen Zustände zu normalisieren. Wo ich bei dir bin und wohin es gehen sollte ist, dass jeder gleich viel bei der gleichen Arbeit netto hat. Und da kommen wir, das geht natürlich nicht, beziehungsweise es ist unglaublich schwierig, speziell wenn wir über Cost of Living sprechen, aber zum Beispiel bei staatlichen Steuern müsste das doch theoretisch gehen, weil die Cuts, also wie viel Steuern wir in Deutschland zahlen zum Beispiel, Steuerklassen und Co. kennen wir, wir kennen die in Amerika, wir kennen die in Kanada, das müsste ja theoretisch gehen.",
            "start": 1446113,
            "end": 1509786,
            "confidence": 0.8210208333333332,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, es ist noch viel komplizierter, weil du musst ja auch diese Sachen einrechnen wie Sozialversicherung, das soziale Netz. Wie teuer ist es denn, deine Kinder auf die Uni zu schicken zum Beispiel? Auch da ist Amerika, Europa ganz anderer Unterschied. In Deutschland bekommst du Universität normalerweise gratis, in Amerika sicher nicht. Also die Kosten sind schon unterschiedlich. Nichtsdestotrotz, und das war eben die Argumentation von ihr, weil google die gesagt hat warum verdienen wir in europa weniger als die selben personen in amerika für google sind genau die selben kosten.",
            "start": 1510493,
            "end": 1542368,
            "confidence": 0.8203152173913044,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist es denn unterm strich wirklich weniger also hat man weniger verstehst du kann man sich weniger leisten oder geht es nur darum die zahl die ich auf meinem bankkonto habe weil das ist ja der clou.",
            "start": 1542428,
            "end": 1551797,
            "confidence": 0.8409999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn du in amerika das doppelte verdienst hast du am ende garantiert auch mehr.",
            "start": 1551817,
            "end": 1555300,
            "confidence": 0.8011428571428569,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weiß ich jetzt nicht, dafür zahlt man halt, dafür wird man z.B. bei, wenn man essen geht, hat man da ja in der Regel 10% Tipp, was verpflichtend ist. Nehmen wir mal als kleines Beispiel und ich glaube das summiert sich halt schon hoch.",
            "start": 1555789,
            "end": 1567375,
            "confidence": 0.7827954545454546,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ein ehemaliger Kollege von mir hat immer gemeint, der kam aus Brasilien und Der hat gemeint, Deutschland ist so Single-feindlich, weil als Single hast du gar nichts von dem tollen deutschen System, dass die Unis gratis sind für deine Kinder oder die Kindergärten oder die Schulen. Das heißt, Amerika wäre viel besser für Singles, weil du da viel mehr Geld bekommst, das du direkt ausgeben kannst. Und wenn du eben diese Universitäten für deine Kinder brauchst, muss es dir halt wert sein. In Deutschland zahlst du automatisch mit, obwohl es für dich selbst gar keinen Vorteil hat. Also er hat immer gemeint, Singles sind in Deutschland benachteiligt.",
            "start": 1567415,
            "end": 1598582,
            "confidence": 0.7847009345794396,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Auf der anderen Seite kann man auch sagen, vom Kindergeld kann man jetzt auch kein Kind großziehen.",
            "start": 1599213,
            "end": 1603276,
            "confidence": 0.8217647058823531,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, aber nur ganz allgemein. Du zahlst ja für die Universität mit deinen Steuern mit, obwohl du sie gar nicht nutzt, wenn du keine Kinder hast. Oder für die Gratisschulen zum Beispiel. Du zahlst sie natürlich mit, aber kannst nicht davon profitieren. In Amerika bekommst du das ganze Geld, musst es ausgeben für deine Kinder. Wenn du keine Kinder hast, kannst du es persönlich verwenden, das Geld.",
            "start": 1603296,
            "end": 1622631,
            "confidence": 0.7644925373134329,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber diese Person hatte ja sehr wahrscheinlich auch kostenlose Bildung. zumindest bis zum zehnten schuljahr weil das ist verpflichtend in deutschland ja das war.",
            "start": 1622651,
            "end": 1629638,
            "confidence": 0.77156,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In brasilien keine ahnung das ist korrekt.",
            "start": 1629698,
            "end": 1631461,
            "confidence": 0.6584285714285716,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber man kann jeder ist ja frei also in der regel frei seinen wohnort zu wählen beziehungsweise etwas zu ändern niemand wird ja gezwungen in deutschland zu bleiben.",
            "start": 1631481,
            "end": 1641234,
            "confidence": 0.8558214285714285,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also nur nochmal zur Klarstellung, nicht damit ich wieder so einen Shitstorm abbekomme. Ich bin auch nicht der Meinung, dass man automatisch immer gleich viel verdienen sollte. Vor allem finde ich es immer ganz interessant, wenn dann Leute, die bei solchen Tech-Firmen arbeiten und ein mittleres, sechsstelliges Gehalt bekommen, sich dann irgendwie beschweren, dass sie noch weniger verdienen als die in Amerika. Aber okay, es ist ein anderes Thema, eine persönliche Einstellung.",
            "start": 1641462,
            "end": 1662860,
            "confidence": 0.793652777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt ist es natürlich so, dass es auch eine gewisse Imbalance zwischen den Gehältern gibt. Also ich nehme mir jetzt mal den Bandarbeiter bei Mercedes oder die Kassiererin bei Aldi oder natürlich auch die Bandarbeiterin bei Mercedes und dann den IT-Gehältern. Die sind ja schon recht oft. Also wenn wir von sechsstelligen Gehältern reden, hattest du gerade erwähnt, da reden wir von 100.000 Euro.",
            "start": 1663240,
            "end": 1687023,
            "confidence": 0.8265937499999995,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ja, und da spricht man eigentlich von, also bei Google zum Beispiel, da arbeitet niemand für 100.000, vor allem nicht in Amerika. Also wie gesagt, da sind wir bei wesentlich mehr und das geht dann schon in die Richtung 300, 400, weiter nach oben. Da gibt es einen interessanten Artikel übrigens von GayGay, Nachname vergesse ich leider immer, der sehr viel über die Branche schreibt, vor allem über die großen Tech-Konzerne, der auch so ein bisschen Licht in das Ganze reinbringt, verlinken wir gerne, der auch davon schreibt, dass eben diese hohen Gehälter nicht der Standard sind und dass das eben die großen Tech-Firmen zahlen und dass du da aber wirklich im Top-Bereich sein musst, um auch reinzukommen und das aber auch nicht für jede Frau, jeder Mann ist, so eine Stelle, muss man auch dazu sagen. Und man vergleicht sich halt dann gerne mit diesen 300.000, 400.000 Top-Gehältern in der USA oder 500.000 vielleicht sogar und will dann vielleicht bei einem kleinen Mittelständler in Deutschland auch dementsprechend Gehälter aufrufen. Wir haben das auch diskutiert in der YouTube-Diskussion mit Nils, dass das halt schon sehr durch die Decke geht aktuell und da halt schon die Frage ist, ist da irgendwo ein Ende in Sicht oder schießt das weiter so in die Höhe? Ist das fair?",
            "start": 1688425,
            "end": 1762808,
            "confidence": 0.804648148148148,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja das ist ja genau die frage die ich stelle ist das fair ist die ist die balance auch gerechtfertigt und ich habe jetzt nicht die finale antwort aber das worüber ich so oft nachdenke ist der impact deiner arbeit hast du, weil viele viele software entwickler und software entwicklerin die schreiben ja code die automatisieren etwas weg. Und im besten Falle braucht man nach dem geschriebenen Code, nach dem Deployment, für diese Aufgabe keinen Menschen mehr. Das bedeutet, sie sind ein Multiplikator. Und nehmen wir mal die These, die jetzt sehr theoretisch ist, weil sie nicht genau so stimmt in der Praxis, beziehungsweise so nicht auf die Praxis angewendet werden kann, umso mehr Code geschrieben wird, umso mehr impact kann durch automatisierung erzeugt werden desto weniger aktive menschen braucht man das.",
            "start": 1763408,
            "end": 1816103,
            "confidence": 0.8191136363636364,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist ja auch die idee mit dem mit dem software service produkten aktuell und warum die eigentlich so hohe börsenwerte aktuell fahren die ganzen it unternehmen, weil die durch die Automatisierung für den gleichen automatisierten Prozess trotzdem noch Geld bekommen von jedem User, von jedem Kunden. Und das ist ja eigentlich das Problem. Ich frage mich halt auch auf lange Sicht, kann man das endlos so fortführen, weil irgendwann gibt es einen Konkurrenten, der vielleicht das auch automatisiert, aber mit einem halben Preis anbietet, weil er ja gar nicht mehr diese Person wegrationalisiert hat oder automatisiert hat.",
            "start": 1816123,
            "end": 1847843,
            "confidence": 0.8399278350515467,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Übertragen wir diesen Arbeitsimpact, diese Automatisierung eigentlich mal auf eine andere Branche. Warum sind Automationsroboter in der Industrie einfach so teuer? Weil sie halt den menschlichen Faktor aus der Rechnung nehmen. Roboter können jetzt glaube ich noch nicht ein vollständiges Auto bauen, weil manche Sachen halt einfach nur von Menschen gemacht werden müssen. Aber diese Art von Investitionen, die man, man kauft sich jetzt einen Roboter und der baut dann die Reifen an und ich habe davon, wie ihr merkt, ich habe keine Ahnung von Fließbandarbeit in einem Auto, in einer Autofirma. Ich habe noch nie ein Auto zusammengebaut. Aber daran halte ich mich halt oft so fest und denke mir, okay, du schaffst Wert, der dauerhaft gemacht wird und der dann auch, ich nenne es mal skalieren kann, weit über deine limitierende zeitliche Komponente hinaus.",
            "start": 1848223,
            "end": 1897700,
            "confidence": 0.8183161764705879,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber Autobranche ist ein gutes Beispiel. Wenn du dort irgendwas automatisierst und die Produktion billiger machst, dann wird ja das Auto auch billiger. Es ist ja nicht so, dass die Autos auf dem gleichen Stand sind, also auf dem gleichen Preislevel wie vor 30 Jahren ohne Automatisierung. Das heißt, die Autos sind ja alle viel billiger geworden durch die Automatisierung. Wenn man aber in die Software-Ecke schaut, die großen SaaS-Firmen, da geht der Preis nicht nach unten, obwohl die Automatisierung passiert ist. Also eigentlich müsstest du ja sagen, nach einer gewissen Zeit müsste sich ja das auch amortisieren und einfach der Preis nach unten gehen. Aber die User bei den großen SaaS-Firmen zahlen immer noch ihre monatlich 50 Euro Usergebühr oder halt Account, für den Account diese Gebühr. Und wenn es dann eine Million User sind, zahlt immer noch jeder User diese 50 Euro.",
            "start": 1898522,
            "end": 1944335,
            "confidence": 0.8216666666666662,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich bin mir gar nicht sicher, ob Autos wirklich billiger geworden sind. Ich meine, wann hast du dir das letzte Mal ein Auto gekauft?",
            "start": 1945255,
            "end": 1950779,
            "confidence": 0.5653333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ist schon sehr lange her. Aber ich glaube grundsätzlich, dass die Autos schon billiger geworden sind für das, was drinnen steckt. Weil sonst müssten ja die Gewinne extrem nach oben gegangen sein bei den Autofirmen in den letzten 30 Jahren. Und die verdienen zwar alle ganz gut, aber dass die Gewinne gleich schnell gestiegen sind, Wie im SAAS Bereich zum Beispiel, das müsste man dann auch an irgendwelchen Börsenkursen zum Beispiel sehen.",
            "start": 1950839,
            "end": 1972552,
            "confidence": 0.8315753424657536,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also nehmen wir mal das urdeutsche Auto, der VW Golf. Ich glaube jeder kennt ihn, Klassiker. Das Basismodell ist glaube ich kontinuierlich teurer geworden.",
            "start": 1972732,
            "end": 1983943,
            "confidence": 0.7889166666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber das ist die Inflation. Natürlich, das Geld wird weniger wert, aber im Endeffekt, ich glaube sogar, dass der Betrag, den du für einen VW zahlst, wahrscheinlich relativ stabil geblieben ist in den letzten 10, 20 Jahren ungefähr, grob, aber die Inflation natürlich stark das Geld entwertet hat. Also wahrscheinlich bekommst du jetzt einen VW für weniger als vor 20 Jahren, wäre meine Vermutung.",
            "start": 1984578,
            "end": 2006660,
            "confidence": 0.7940923076923078,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber das ist das ist ja jetzt interessant weil wir reden ja die ganze zeit von big tech von den saas unternehmen und so weiter und jetzt kommen wir mal auf die agitur in wanne eicke. Sind die gehälter in klassischen webagenturen die kundenprojekte entgegennehmen die die webseite für audi machen die die webseite für den lokalen brillenoptiker machen augenoptiker machen. sind die auch so gestiegen? Weil das ist ja eigentlich ganz klassische Software-Engineering-Arbeit gegen Geld.",
            "start": 2007060,
            "end": 2033838,
            "confidence": 0.8216184210526318,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bevor ich diese Frage beantworte, gibt es eigentlich die Agentur aus Wanne-Eickel? Die würde ja von allen automatisch Werbung bekommen. Das ist ideal, über die spricht jeder. In allen Podcasts überall, über die wird ständig gesprochen. Also, wer in Wanne-Eickel wohnt, vielleicht mal eine gute Idee für eine Agentur. Und diese Agentur, Sollte auf jeden Fall.",
            "start": 2033878,
            "end": 2054989,
            "confidence": 0.7746785714285712,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Google-Werbung schalten auf Agentur Wanne-Eickel, also das würde ich jetzt gerade machen.",
            "start": 2055030,
            "end": 2058811,
            "confidence": 0.8221666666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und diese Agentur würde wahrscheinlich heutzutage mehr bekommen für dieselbe Arbeit, die sie vor 20 Jahren geleistet hat, oder?",
            "start": 2058851,
            "end": 2065053,
            "confidence": 0.7972105263157895,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, meine Frage ist aber, sind die Gehälter genauso exorbitant gestiegen wie bei Software-as-a-Service-Startups, wie bei N26, HelloFresh, Klana und wie sie alle heißen?",
            "start": 2065092,
            "end": 2079856,
            "confidence": 0.8155416666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber genau das ist glaube ich das Problem, dass sich Agenturen solche Personen gar nicht mehr leisten können, weil der Wettbewerb einfach viel viel höher geworden ist und seitdem es Remote Arbeit gibt noch viel höher geworden ist, weil man auch nicht mehr an Wanneickel gebunden ist, sondern halt auch Remote arbeiten kann für Shopify zum Beispiel, Google erlaubt glaube ich keine Remote Arbeit übrigens, aber ganz viele anderen firmen natürlich schon und dann steht man durch automatisch in konkurrenz mit den großen tech firmen obwohl man nur in warneike irgendeine kleine agentur bude hat.",
            "start": 2080396,
            "end": 2111776,
            "confidence": 0.8045052631578946,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was heißt das denn in der konsequenz heißt das dass mehr agenturen über zeit aussterben werden weil die gehaltsspanne zwischen diesen saas und produktfirmen deutlich größer wird und die agenturen dann nur noch leute finden die sich wirklich explizit auf agenturarbeit einlassen weil ich kann mir gut vorstellen in diesen saas firmen produktfirmen das ist nichts für jedermann und für jeder frau das ist eine andere art zu arbeiten nicht jeder möchte da arbeiten was völlig okay ist aber das limitiert natürlich auch den talentpool für die lokalen agenturen und speziell mit jährlichen boni signing bonus und co die werden ja nicht mit, mit fünfstelligen zahlen um sich schmeißen klar equity können die auch liefern das ist dann nur eine struktursache mit mit notar und anwälten und was was der geil nicht was da alles zu gehört dass das wird halt schon gehen aber meine frage ist inwieweit werden oder werden sich die großen agenturen durchsetzen und die kleinen sterben schneller.",
            "start": 2111816,
            "end": 2171316,
            "confidence": 0.8298819875776399,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich kann mich mal erinnern, du hast uns vorgeschlagen, wie wir zusammengearbeitet haben und vor allem im Recruiting-Bereich zusammengearbeitet haben. Du hast gemeint, wir sollten doch einfach eine Agentur kaufen und die Agentur als Ausbildungsstätte verwenden und dann die guten Leute dort rausnehmen und die Agentur eben nur als Ausbildung sehen. Ich glaube, du hast es im Podcast ja auch schon mal erwähnt. Und ich glaube in die Richtung geht's. Agenturen bilden wahrscheinlich sehr viele Leute aus und müssen sich halt dann einfach die Newcomer am Markt nehmen, die ganz jungen, um überhaupt noch irgendwie Leute zu bekommen, weil den alten Senior wird man wahrscheinlich kaum mehr bekommen. Also vielleicht bekommt man irgendjemand, der schon lange dabei ist und in der Firma war. sitzt und die Person ist noch nie nach außen gegangen, weil sie sich einfach so wohl fühlt. Diese Person kann man vielleicht als Senior behalten, aber eine neue Senior Person rein zu bekommen auf dem Markt, wo so viel gezahlt wird, wird wahrscheinlich immer, immer schwieriger. Und da muss man wahrscheinlich auf die Jugend setzen und einfach probieren, direkt die Jugend zu übernehmen. Wobei das auch immer schwieriger wird, wenn man sich anschaut auf der Uni. Die Leute, die studieren, haben alle einen Nebenjob schon, teilweise bei großen Firmen und steigen dann direkt ins große Business ein und sind gar nicht mehr am Markt verfügbar für die kleineren Firmen.",
            "start": 2172248,
            "end": 2246372,
            "confidence": 0.8447068965517238,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich muss nochmal ein bisschen Kontext geben, wegen dieser Agentur kaufen. Ich bin ein riesen Fan von Agenturen. Ich denke, jeder sollte nach seiner schulischen Ausbildung, akademischen Ausbildung erstmal in eine Agentur. Und vielleicht sogar in eine kleinere. 10, 20, 30 Leute. Der Grund ist ganz einfach, man ist dann nicht nur Softwareentwickler. Und da gibt's nicht für alles eine einzelne Person, sondern man lernt da so dermaßen viel über den ganzen Produktlebenszyklus von Software, von Webseiten, von Produkten, die man da schraubt, weil man lernt so viel über Kommunikation, man telefoniert mit Kunden, arbeitet Konzepte aus, fährt mal vielleicht mit zum Kunden. Zum Beispiel damals habe ich unter anderem für die Bitburger Braugruppe gearbeitet und hatte dann auch so tolle erlebnisse einfach mal eine private brauereiführung zu kriegen und allen drum und dran und das ist sind schon tolle erlebnisse aber ich habe auch mit den kunden telefoniert ich habe rechnungen gestellt ich habe recht angebote geschrieben und so weiter und so fort ich denke das ist eine gute schule um wie nenne ich es sich auf die harte realität vorzubereiten, Du willst ja nur, dass.",
            "start": 2246572,
            "end": 2308936,
            "confidence": 0.8166470588235294,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Alle anderen auch da durchgehen durch diese harte Schule und statt einem Yearly Bonus oder Equity einfach mal nur eine Pizza hingestellt bekommen, weil sie eine ganze Nacht durchgearbeitet haben, so wie du damals.",
            "start": 2308976,
            "end": 2319525,
            "confidence": 0.8358235294117647,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich denke, das erdet Leute, weil ich denke, wenn Leute direkt nach dem Studium in diese super Hyped Software as a Service Startup Welt gehen, Und da reden wir über weitem, nicht nur von einem Obstkorb, der da hingestellt wird, den kriegst du in der Agentur natürlich auch, sondern mit überall Xbox, immer im Bierkühlschrank und alles junge Leute und alles ist cool, alles ist Hipster und Geld wird immer nachgeschmissen und blabliblub und alles ist perfekt ausgeshaped. Jeder kümmert sich um komplett dein Learning von hinten bis vorne. Also da wird man ja richtig auf gut Deutsch betüttelt. Und ich meine, in manchen Firmen gibt es sogar, die machen sogar deine Wäsche und allem drum und dran. Aber es geht halt so weit wegen Top Talent. Und deswegen denke ich mir, das ist halt leider nicht die Realität.",
            "start": 2320066,
            "end": 2364819,
            "confidence": 0.8039424460431654,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber Moment, ist das dann nicht vergleichbar, wenn wir zurück in die Cloud gehen? und sagen, man bekommt jetzt alles automatisch aus der Cloud und die Leute verlernen ja, wie sie selber einen Server ins Work stellen. Das wäre ja das Gleiche wie mit der Agentur, wo du sagst, man muss mal durch diese harte Schule gehen. Muss man das überhaupt? Oder kann man nicht einfach direkt weiter oben einsteigen, wo es besser ist und für alle vielleicht einfacher ist und man auch verwöhnt wird, wenn man es hart formuliert? Dasselbe wie in der Cloud, wo man halt verwöhnt wird und alle Services einfach dort raussputzeln.",
            "start": 2364839,
            "end": 2394921,
            "confidence": 0.806424528301887,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, das denke ich nicht. Ich denke, das ist was Unterschiedliches. Wo ich ein bisschen bei dir bin, ist, dass die Cloud zu gutes Marketing hat. Das Marketing in der Cloud sagt, okay, du drückst auf diesen Knopf und dein Service läuft und du musst dich um nichts mehr kümmern. Was einfach eine Lüge ist. Du musst dich in der Regel bei klassischen Cloud-Providern trotzdem um dein Datenbank-Backup kümmern. Du musst dich trotzdem um Reconnection-Logik in deinem Code kümmern und so weiter und so fort.",
            "start": 2394961,
            "end": 2417920,
            "confidence": 0.7556823529411765,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, bei Cloud Native wird das Backup irgendwo im Hintergrund automatisch gemacht. Kannst du dazuklicken?",
            "start": 2418140,
            "end": 2423503,
            "confidence": 0.7117333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Boah, da würde ich mal hier und da mal die richtigen Seiten lesen. Es gibt sehr wahrscheinlich Datenbanken, wo das Service ist, wo das geht. Es gibt aber auch sehr viele Services, wo das nicht der Fall ist. Und es ist auch sehr oft so, nur weil da High Availability dran steht, heißt das nicht, dass das High Availability ist. Und für High Availability, da redet man in der Regel von der Serverseite und nicht von der Clientseite. Wie dem auch sei, wir gehen hier schon wieder zu tief. Ich denke, das Marketing von Cloud ist einfach unglaublich gut und der Teufel liegt im Detail. Und genau das denke ich auch bei der Realität, wenn es bei der Jobwahl geht.",
            "start": 2423983,
            "end": 2460345,
            "confidence": 0.7922833333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das heißt, du meinst, dass eigentlich die Obstkörbe und das Verwöhnen eigentlich nur Marketing ist, um die Leute in diese großen Firmen zu bekommen?",
            "start": 2460385,
            "end": 2466691,
            "confidence": 0.81875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich kann mir schon vorstellen, dass sehr viele Leute direkt nach dem Studium Firmen auf Basis der Benefits geben. Trivago zum Beispiel ist bekannt für die jährliche Trivago on Tour. Da fährt die ganze Firma weg, macht Party, Team get together und so weiter. Super Ding, ja, find ich klasse, find ich super. Sollten mehr Firmen tun. Doch ich denke auch, dass zum Beispiel ein Party-Image für die Firma sehr viele junge Leute anlockt und dass das unter anderem ein Key-Kriterium sein könnte, wenn du zwei gleichwertige Angebote auf dem Tisch hast. Und wenn man als Fresh Graduate, als frischer Uniabgänger, dann in so was kommt und das dann als Standard sieht, dass so die Arbeitswelt ist, Das finde ich halt falsch, ja. Weil dann fordert man immer, fordert man immer, fordert man immer. Und deswegen sage ich, oder deswegen kam damals die Idee, vielleicht war sie auch ein bisschen scherzhaft, aber umso mehr wir alle darüber nachgedacht haben, umso cooler fand man die Idee eigentlich, dass wir eine Agentur haben, wo man das alles mal lernt. Du kannst halt nicht Nein sagen in einer Agentur. Du kannst halt nicht zum Kunden gehen, das geht nicht. Sondern du musst halt immer, okay, wir könnten das, das. Okay, man hat Budgetgrenzen. Etc., etc. Und ich denke schon, man lernt eine ganze Menge. Man lernt links, man lernt rechts, man baut vielleicht auch mal eine Infrastruktur auf. Und in einer großen Firma hat man halt für alles eigene Positionen. Und das war der Kontext dahinter.",
            "start": 2467251,
            "end": 2553898,
            "confidence": 0.8051259842519676,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber wenn du dann nur mehr dein ganzes Leben in großen Firmen arbeitest, wo das alles erledigt wird, warum brauchst du dann dieses Wissen? Wenn du immer in deinem Schlaraffenland dann weiterlebst, bei Google oder vielleicht sogar, ja, keine Ahnung, ob es bei traditionellen großen Konzernen auch so zugeht, aber nehmen wir mal die IT-Konzerne.",
            "start": 2553938,
            "end": 2569662,
            "confidence": 0.7416181818181818,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ganz einfach, weil ich denke, dass dieses Wissen einem sehr stark hilft, vom Junior zum Mittellevel, vom Mittellevel zum Senior, vom Senior zum Staff und so weiter, sich hochzuarbeiten karrieretechnisch, weil man einfach ein deutlich früheres und deutlich besseres Verständnis von links und rechts hat. Umso höher man geht, umso weniger macht man eigentlich, nur seinen Coding Job, sondern man arbeitet nicht nur für sein Team, man arbeitet für die ganze Abteilung, für die ganze Firma, man nimmt nicht nur Probleme entgegen, sondern zeigt Probleme auf und so weiter und so fort. Und ich denke, dass wenn du mehr Kenntnis über andere Abteilungen, über andere Prozesse hast, sondern einfach mal einen Agenturpitch mitgemacht hast, dann weißt du schon zum Beispiel automatisch, wie du aus einer fixen Idee wirklich was Präsentierbares machst und das deinem Chef oder deinem Chef-Chef verkaufst und so weiter und buff bist du, leitest du ein eigenes Projekt hin und so. Und ich denke, dass die Leute, die durch die harta Agenturschule gegangen sind, sowas auf jeden Fall schon mal mitbekommen haben und nicht erst erneut lernen müssen, was Jahre dauert, auch in der Agentur.",
            "start": 2570242,
            "end": 2630679,
            "confidence": 0.8125053191489361,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da hätte ich übrigens noch eine andere Frage diesbezüglich. In den Agenturen oder ganz allgemein die Developer, die so in unserem Alter sind oder aufwärts, gibt es denn diese Developer, die 60 Jahre alt sind und noch Developer wirklich sind oder in der Agentur arbeiten? Kennst du solche Leute?",
            "start": 2631427,
            "end": 2650239,
            "confidence": 0.806918367346939,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, kenne ich.",
            "start": 2650279,
            "end": 2650879,
            "confidence": 0.541,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ihr habt das mit Nils gerade diskutiert in unserem Nachgespräch vom YouTube-Video. Und meine Frage war auch, es können ja nicht alle Teamlead werden, wobei er gemeint hat, die Branche wächst so stark, es könnten wahrscheinlich alle, die damals in den 90ern angefangen haben, vielleicht sind die alle Teamleads. Also es gibt mittlerweile so viele IT-Firmen, es wäre vielleicht kein Problem. Aber ich persönlich kenne wirklich nur sehr, sehr vereinzelt Leute, die über 50 oder vielleicht sogar 60 sind und noch als Developer arbeiten. Also das ist, die kann ich an einer Hand abzählen.",
            "start": 2650919,
            "end": 2681716,
            "confidence": 0.7700106382978719,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich kenne diverse Leute, die ein Alter 40 und plus haben.",
            "start": 2682243,
            "end": 2688569,
            "confidence": 0.8482727272727272,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja hey, 40 ist ja jung. Moment, 40 zählt nicht, 50 plus. Muss ich jetzt schon mal reingrätschen, da 40 als alt zu bezeichnen.",
            "start": 2688589,
            "end": 2695795,
            "confidence": 0.6598333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber auch 50 plus kenne ich diverse Leute, die in Agenturen arbeiten, ja. Aber ich kenne auch den einen oder anderen Entwickler, der 50 plus ist und in Scale-ups, Start-ups, Software-as-a-Service-Firmen arbeitet, sehr wahrscheinlich dann nicht als Mid-Level-Engineer, aber als Senior-Engineer, weil Senior-Engineer ist ja auch so ein Level, wo man stehen bleiben kann, nicht muss, aber kann.",
            "start": 2695835,
            "end": 2719797,
            "confidence": 0.7912931034482756,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das geht dann halt schon sehr in die Rolle, dass man irgendwie ein Lead hat und die Leute supportet und halt da sein Wissen einbringt und nicht wirklich Hands-on an der Tastatur sitzt, oder?",
            "start": 2719837,
            "end": 2729265,
            "confidence": 0.7597428571428572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Doch, doch. Hands on an die Tastatur.",
            "start": 2729904,
            "end": 2733285,
            "confidence": 0.5244285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay.",
            "start": 2733345,
            "end": 2733765,
            "confidence": 0.23,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Diese Art von Menschen haben natürlich dann oft, okay, alles schon gesehen, been there, done that, und haben natürlich dann oft schon mal eine sarkastischere Einstellung, schwarzer Humor und allem drum und dran, weil sie ja schon sehr lange in der Industrie sind und sehr viel Zeug gesehen haben. Und immer wenn jemand dann mit einer neuen Datenbank von Hacker News ankommt, dann wird einmal gegrinst und dann wird weitergemacht. Aber das trifft natürlich nicht auf alle zu. Das hört sich jetzt total böse an, aber so meine ich das gar nicht. Diese Leute educaten schon sehr viel, so ist das nicht, weil die halt einfach unglaublich viel Wissen über Zeit angesammelt haben, was einfach essentiell für diese Art von Firmen ist. Und besonders, wenn jemand 40 oder 50 ist und dann schon 10, 15 Jahre in derselben Firma ist. Also dieses Wissen ist einfach unbezahlbar.",
            "start": 2733785,
            "end": 2779272,
            "confidence": 0.7706506849315071,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Glaubst du, dass Leute, die, nehmen wir mal jetzt an, eine 60-jährige Entwicklerin, die meiste Zeit in der Agentur gearbeitet oder irgendwo Java entwickelt, sucht jetzt einen neuen Job. Glaubst du, dass das gleich einfach ist? Also es ist wahrscheinlich nicht gleich einfach, klar, aber dass das einfach ist, noch einen Job zu finden oder dass man da auch so viele Jobangebote bekommt? Ohne dass du dir jetzt irgendwie Staff Engineer irgendwo warst, sondern du warst halt immer Entwickler in irgendeiner Firma, hast dich weiterentwickelt, aber warst halt immer normaler Entwickler und bist einfach durchgegangen, bist in kleinen Strukturen geblieben, immer eine Firma mit drei, vier Leuten, irgendwas kleines und suchst jetzt mit 60 plötzlich einen neuen Job, weil deine Firma pleite gegangen ist.",
            "start": 2779552,
            "end": 2817843,
            "confidence": 0.7792822580645158,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Denke ich jetzt gar nicht einfach. Und ein Aspekt, der gegen dich spricht, ist glaube ich die Geschwindigkeit, in der du lernen kannst, denn die nimmt einfach mit dem Alter ab. Du hast auch schon sehr viel gesehen, dennoch, wenn man die Firma wechselt, bis man produktiv ist, dauert es ein paar Monate. Und Produktivität heißt jetzt nicht nur, die richtigen Leute kennen und wen muss ich fragen, sondern auch, wie navigiere ich durch die Codebase, wie sieht die Architektur aus, wie ist der Scope meines Teams, meiner Abteilung und so weiter und so fort und welche Probleme gibt es und was ist eigentlich das Wichtige, was wir anpacken sollten. Aber auch schon allein die Frameworks lernen und was da nicht noch alles gibt. Ich denke, die Zeit zum Lernen, bis man das alles drauf hat, ist einfach eine unterschiedliche zwischen jungen Leuten und weiseren Leuten.",
            "start": 2817883,
            "end": 2865737,
            "confidence": 0.7996369863013696,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das hast du sehr schön formuliert.",
            "start": 2866177,
            "end": 2868059,
            "confidence": 0.39566666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das meine ich nicht negativ, das ist einfach die Natur. Ich glaube, du hattest das auch irgendwann mal erwähnt. Und da ist auch die Frage, will man das denn, ja? Also, klar, du hast jetzt ein Szenario geschrieben, wo man eigentlich gezwungen wird, das zu tun. Aber da ist die Frage, ob man dann sich nicht in einem gleichwertigen Segment umschaut. Nehmen wir mal an, wir reden jetzt von einer Agentur, die macht Typo 3. Ja, hab ich sehr viel früher gemacht. Und die eine Agentur geht pleite. Wenn man so lange in dem Sektor unterwegs ist, dann kennt man sich. Dann kennt man vielleicht ein paar benachbarte Agenturen und so weiter. Und wenn man dann zum Beispiel mit einem Content-Management-System sehr gut arbeitet, dann kann man sein Verhandlniswissen natürlich sofort wieder einsetzen. Wenn man jetzt von der klassischen Agentur aber in N26 joint, das ist eine ganz andere Liga, eine ganz andere Arbeitsweise, ja. Du machst keine Kundenprojekte, du arbeitest nämlich für die Firma, ja, die ist eine ganz andere Art von wie investieren Entwickler ihre Zeit, ja. Jeder Bugfix zahlt aufs eigene Konto ein, wo ein Bugfix in der Agentur gegebenenfalls trotzdem noch vom Kunden bezahlt werden muss, ja.",
            "start": 2868359,
            "end": 2933459,
            "confidence": 0.7986039603960395,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ich halt da vielleicht noch als Chance sehe, ist einfach, wenn diese Entwicklerin in der Agentur war, hat sie eben vielleicht auch viele andere Sachen gelernt und gerade zwischenmenschliche Kommunikation und diese Dinge und auch, wenn die jetzt zum Beispiel einfach aufgrund des Alters irgendwie langsamer wäre oder so, Dafür hat sie so viel gesehen in ihrem Leben vielleicht, auch mit Kunden, gerade in der Kommunikation und natürlich auch gewisse technische Dinge am Weg. Das heißt, ich könnte mir sogar vorstellen, dass wenn die bei N26 einsteigt, vielleicht, dass sie solche Fähigkeiten mitbringt im Team, dass man das kompensieren kann, dass man im Alter einfach langsamer ist mit Lernen oder ähnlichen Dingen. gibt schon Möglichkeiten. Ich würde es nicht ausschließen, aber ich glaube auch, dass es sehr schwierig ist und man das halt automatisch, wenn man irgendwo sieht, oh je, da ist jemand 60. Vor allem in Deutschland ist es dann noch schwieriger mit Kündigungen und so, wenn die Leute älter sind. Das macht das Ganze ja auch nicht leichter, dass man da, glaube ich, dann schon sehr vorsichtig ist als Firma, ob man irgendwen aufnimmt, der in dem Alter ist. Leider, muss man auch dazu sagen. Aber ich glaube, es gibt Es gibt sehr fähige Leute in dem Alter, gar keine Frage. Und die Erfahrung macht schon viel aus. Und das ist jetzt nicht nur die technische Erfahrung. Gerade nicht die technische Erfahrung, weil die technische kann man vielleicht am schnellsten aufholen, würde ich sagen. Der Rest ist immer schwieriger. Aber jetzt haben wir die erste Frage langsam beantwortet von unserer gemischten Tüte. Und wir sind eigentlich am Ende der Episode. Andi, es war sehr gut. Dein Time-Boxing hat perfekt funktioniert, das du vorgeschlagen hast. Wir haben uns natürlich schön in dieser Box bewegt und haben sie immer extendet, bis wir eine ganze Episode hatten. Hat nicht sehr gut funktioniert.",
            "start": 2934639,
            "end": 3032849,
            "confidence": 0.820884615384615,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war, glaube ich, ein totaler Fail. Aber ich fand es trotzdem sehr nett, mit dir über Gehaltsbausteine, Gehälter und Co. zu sprechen. Was ich faszinierend fand, wir haben eigentlich wenig konkrete Cases behandelt, so nach dem Motto, wie viel sollte man heutzutage verdienen, beziehungsweise was ist gerecht, was ist nicht gerecht, was ist angemessen.",
            "start": 3032889,
            "end": 3052897,
            "confidence": 0.7995999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wen das interessiert, der kann in das YouTube-Video schauen mit Nils, wir verlinken das, da haben wir auch ein bisschen drüber gesprochen, was man denn verdienen sollte heutzutage.",
            "start": 3052937,
            "end": 3061500,
            "confidence": 0.7347857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dennoch bin ich ein Fan von diesem gemischte-Tüten-Format, auch wenn wir das jetzt nicht gemacht haben.",
            "start": 3062580,
            "end": 3068384,
            "confidence": 0.8771250000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir lernen ja aus unseren Fehlern, oder? Wir wollen da ja eine gute Fehlerkultur demonstrieren.",
            "start": 3068404,
            "end": 3073527,
            "confidence": 0.7987333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist aber auch relativ schwierig, ein Thema von allen Seiten zu beleuchten. Aber das tun wir mal, weil ab und zu haben wir eine ganz kurze Meinung, ab und zu haben wir eine längere Meinung. Wir halten das mal im Kopf für die nächsten Episoden. Wenn ihr auf jeden Fall noch mehr zu diesen Gehaltsbausteinen wissen wollt, lasst es uns doch mal wissen, denn eigentlich kann man zu jedem Baustein, Basisgehalt, Signingbonus, Equity und Yearlybonus, eine ganze Menge noch zu sagen, wie baut man denn Verhandlungen auf, Ist das denn sinnvoll, wenn man sein aktuelles Gehalt transparent niederlegt oder ist das vielleicht ein Nachteil? Was ist E-SOP? Was ist V-SOP? Wie geht man mit Equity Pre-IPO, also vor dem Börsengang um? Wie geht man danach um? Was sind gute Vestingzeiten von Equity? Was sind angemessene Ranges bei Signingbonus? sollte man auf eine jährliche Gehaltserhöhung pochen oder ist es auch okay, einfach mehrere Jahre kein Gehalt, keine Gehaltserhöhung zu pochen und so weiter und so fort. Ich glaube, das Thema ist unendlich. Lasst uns mal konkrete Fragen zukommen.",
            "start": 3073567,
            "end": 3140033,
            "confidence": 0.8080337078651679,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was mich noch interessieren würde, ist auf jeden Fall, wenn wir mal annehmen, die Gehälter steigen für Developer jetzt irgendwo auf 200.000 plus 300.000 in Deutschland, Glaubt ihr, es ist noch fair? Das würde mich wirklich interessieren. Lass uns das mal wissen auf Twitter engkiosk oder bei E-Mail stetisch at engineeringkiosk.dev.",
            "start": 3140053,
            "end": 3162471,
            "confidence": 0.7996470588235295,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war's von uns.",
            "start": 3162491,
            "end": 3163692,
            "confidence": 0.84375,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment, Moment. Bevor wir jetzt da die gemischte Tüte, die keine gemischte Tüte war, abschließen, mache ich das jetzt noch zur gemischten Tüte. Wir haben nämlich eine zweite Frage gehabt. Was ist der Unterschied von einem Software-Developer zu einem Software-Engineer? Und ich glaube es gibt keinen Unterschied. Damit haben wir jetzt zwei Fragen beantwortet und damit ist es eigentlich eine gemischte Tüte jetzt. Zwei Fragen ist bereits gemischt und damit können wir jetzt anfangen.",
            "start": 3163732,
            "end": 3186285,
            "confidence": 0.7980945945945946,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube es gibt einen Unterschied, aber ich glaube der Titel sagt dasselbe, denn Ich denke der Software-Entwickler, Software-Developer, Software-Ingenieur, ich glaube das Wort oder die Wörter werden einfach im gleichen Kontext Austausch verwendet. Dennoch denke ich, dass zwischen Entwickler, Developer und Ingenieur schon ein Unterschied ist. Speziell in der Vorbereitung und Planung der Umsetzung deines Projektes beziehungsweise deines Changes und.",
            "start": 3186325,
            "end": 3218766,
            "confidence": 0.8085483870967746,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also man merkt schon, warum unsere Episoden immer so lang werden. Andi hat jetzt schon wieder eine ganze Episode angestartet, aber ich lasse dir mal deine Meinung. Schreibt uns ein bisschen Feedback, wir freuen uns drüber. Auch bitte bei WhatsApp, gerne Message direkt auf WhatsApp. Wer nicht auf Twitter ist, die Nummer steht in den Show Notes. Oder eine Audio Message, würden wir uns auch drüber freuen. Und habt noch einen produktiven Tag. Tschau. Bye bye. Warum sagst du bye bye? Willst du nichts Deutsches sagen? Tschüss.",
            "start": 3220687,
            "end": 3249159,
            "confidence": 0.7276896551724137,
            "channel": null,
            "speaker": "B"
        }
    ],
    "confidence": 0.8019628256725249,
    "audio_duration": 3255.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}