{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/8efb56e2-5d56-4618-bfd8-91e08efff60b/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62xpghsqg3-acde-4a3c-a904-bddb4abb82be",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Wer liest heutzutage eigentlich noch IT-Bücher? Wo wir doch alle Digital Natives sind, es YouTube-Videos zu jedem Thema gibt und man alles googeln kann und fünf Blogartikel findet. Und doch gibt es zu jedem IT-Thema mindestens ein Fachbuch. Doch habt ihr euch eigentlich mal gefragt, wie es ist, ein IT-Fachbuch zu schreiben? Was da wirklich dahinter steckt und ob man dadurch nicht doch reich werden kann? In seinen jungen Jahren hat Wolfgang ein Buch über MySQL geschrieben. In dieser Episode geht es um seine Erfahrungen und ob er es nochmal tun würde. Viel Spaß! Wie gut würdest du dich einschätzen in deinen Schreibskills? Also ich meine wir sprechen da öfter darüber, dass ich ein mega Fan davon bin Schreibskills zu fördern und oft delegierst du mir ja auch Arbeit, weil du denkst ich schreibe besser, was ich bezweifle. Das bedeutet ich muss öfter Tweets schreiben oder ähnliches. Und deswegen würde ich gerne mal deine Selbstreflexion, deine Selbsteinschätzung haben von einer Skala von 0 bis 10, wie du dich denn in Schreibskills bewerten würdest. Wo 0 ist, ich kenne das Alphabet und 10 ist, ich schreibe für mein Leben gern und denke, dass ich auch sehr gut daran bin.",
            "start": 5263,
            "end": 79338,
            "confidence": 0.8076818181818182,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, man muss das unterscheiden, auch was man schreibt. Also ist es jetzt ein englischer Blogpost? Ist es ein deutsches Drama? Oder ist es ein wissenschaftliches Paper oder ein Antrag? Und ich habe schon sehr viel, glaube ich, in meinem Leben geschrieben, besonders zu Uni-Zeiten, wenn wir Anträge geschrieben haben. Und da muss man sich dann schon viel aus den Fingern saugen, damit diese Anträge gut klingen. Und ich glaube, darin bin ich ganz gut, irgendwas so umzuschreiben, dass es besser klingt, als es vielleicht ist. Also gerade wenn es um Anträge geht, habe ich, glaube ich, einiges an Erfahrung. Aber bei so einem klassischen Blogpost, nachdem ich da selber einfach kein Fan davon bin, vom Schreiben in den Blogpost, bin ich wahrscheinlich dementsprechend auch schlechter. Auf einer Skala ist es schwierig einzuschätzen. Aber ich persönlich bin eigentlich kein großer Fan vom Schreiben. Insofern leidet wahrscheinlich die Qualität auch darunter. Also ich bin ein großer Fan vom Reden. Und wenn ich mit dir über irgendwas reden kann, ist mir das zehnmal lieber, als ich muss irgendeinen Blogpost schreiben.",
            "start": 79665,
            "end": 136430,
            "confidence": 0.7789944134078209,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hast gerade gesagt, du denkst, du bist sehr gut darin, Dinge gut zu formulieren und Dinge gut klingen zu lassen. Ich glaube, du hast Anträge erwähnt, Uni-Anträge oder Förderanträge oder ähnliches.",
            "start": 136450,
            "end": 146761,
            "confidence": 0.766125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also klassische Förderanträge, du musst irgendwie 25 Seiten schreiben.",
            "start": 147133,
            "end": 150656,
            "confidence": 0.7995555555555555,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weißt du was ich höre? Du kannst scheiße als Gold verkaufen.",
            "start": 150696,
            "end": 153357,
            "confidence": 0.7198181818181819,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist ja auch ein gutes Kind, oder?",
            "start": 153778,
            "end": 155779,
            "confidence": 0.49957142857142856,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So, ich würde sagen, da sind wir beim Thema. Wir sprechen heute über Schreiben. Wir sprechen heute über das Schreiben von Büchern, von IT und Fachbüchern. Denn der Wolfgang hat in seinen jungen Jahren mal ein Buch über die Relationale Datenbank MySQL geschrieben und das Buch hieß MySQL, das umfassende Handbuch.",
            "start": 155819,
            "end": 178318,
            "confidence": 0.837,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wenn man es ganz genau nimmt, sind es ja eigentlich drei Bücher, weil es ist ja in drei Auflagen erschienen und wir haben da ja auch immer Sachen geändert.",
            "start": 178358,
            "end": 184583,
            "confidence": 0.7179666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da kommen wir dann gleich zu. Heute drehen wir den Spieß mal um. Normalerweise interviewt der Wolfgang mich. Heute interview ich mal den Wolfgang. Und wir klären alles darüber, was es heißt, ein IT-Fachbuch zu schreiben. Lohnt sich das? Was waren die Ups? Was waren die Downs? Und würde der Wolfgang das noch mal machen? Und hat er dort Scheiße als Gold verkauft? Aber bevor wir einsteigen, ich hab mir in letzter Zeit noch mal dein Interview mit Nils Langner angesehen. Und eine Frage, die mir bekannt vorkam, die ich auch schon mal vorher gehört hab, eine Interviewfrage, war, wie gut kennst du dich im Bereich MySQL aus? Zwischen null und zehn. Null ist, ich hab noch nie etwas gemacht. Eins ist, ich hab ein Hello World geschrieben. Zehn ist, ich hab ein Buch über das Thema geschrieben. Wolfgang, wie gut kennst du dich inzwischen mit MySQL aus, nachdem du ein Buch über MySQL geschrieben hast?",
            "start": 185304,
            "end": 244216,
            "confidence": 0.8278076923076927,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe das im Interview auch mit dem Nils erwähnt, dass ich eben ganz anderer Meinung bin, als wenn man ein Buch geschrieben hat, dass man nicht auf der Skala auf 10 ist. Nur weil ich ein MySQL-Buch geschrieben habe, glaube ich nicht, dass ich irgendwie der absolute MySQL-Profi bin. Und vor allem ist das Buch schon länger her, jetzt bin ich definitiv schon weit weg von MySQL und kenne mich definitiv weniger aus als früher, weil für das Buch muss man doch viel recherchieren und muss auch viel lernen, muss man ganz klar sagen, weil man probiert ja Sachen auch aus und checkt natürlich, ist das wirklich richtig, was man da schreibt. Und da lernt man schon viel, aber es ist weit weg von einem MySQL-Profi, würde ich sagen. Viele Leute blicken da immer so nach oben, oh, der hat ein Buch geschrieben. Also ich glaube nicht, dass das wirklich viel aussagt. Natürlich, derjenige hat sich beschäftigt mit dem Thema, aber ich glaube, man ist auf jeden Fall kein Profi. Man ist vielleicht ganz gut darin, Sachen dann aufzuschreiben und verständlich zu erklären, aber man ist kein Profi in dem Bereich, auch wenn es viele glauben.",
            "start": 244616,
            "end": 303808,
            "confidence": 0.7809746192893404,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bevor wir jetzt hier in die fragerunde einsteigen gib uns mal ganz kurz einen generellen überblick über das buch selbst wie heißt es wo wurde es veröffentlicht worum ging es ging es denn im detail, das bedeutet kapitel oder ähnliches was habt ihr im buch behandelt was hier habt ihr nicht behandelt und ich rede schon von ihr, hast du das alleine geschrieben hast du das mit co autoren geschrieben wie viel seiten hat es und zu welchem preis wurde es gekauft du sagtest gerade drei bücher gib mir mal so einen generellen überblick über das ganze buch was, was hätte ich hier auf dem tisch liegen hätte ich ein exemplar davon.",
            "start": 304248,
            "end": 339292,
            "confidence": 0.8056071428571426,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich kann dir mal nur exemplar schicken ich habe noch einige, die als kostenlose exemplare bekommen habe damals vom verlag, Also vielleicht gleich vorweg, dieses Buch kann man nicht mehr kaufen, zumindest die Print-Ausgabe. Ist ja schon etwas älter, das ist also keine Werbeepisode. Es geht wirklich darum, was ist denn so im Hintergrund abgelaufen. Weil viele Leute fragen mir das immer, wie ist denn das so, ein Buch zu schreiben? Und darum haben wir auch diese Episode. Also es ist keine Werbeepisode, ihr könnt es eigentlich nicht mehr kaufen. Also ich glaube, es gibt irgendeine Digitalversion oder so, die hin und wieder gekauft wird. Aber wer liest denn überhaupt noch Bücher heutzutage? Auf jeden Fall ging es um MySQL, hat drei Editionen gegeben, das war prima einfach, weil immer MySQL-Versionen neu rausgekommen sind und dann haben wir halt das dementsprechend updatet. War auch gar nicht so einfach, weil MySQL damals wirklich viele neue coole Features rausgehauen hat und wir da recht viel updaten haben müssen. Weil wir eben den Anspruch hatten, eigentlich so ein umfassendes Handbuch, wie das auch geheißen hat, zu machen, das halt wirklich alles abdeckt. Von der Installation, ein paar Grundlagen sogar in SQL, wobei das war natürlich recht kurz gehalten, weil es um die Datenbank selber geht. Aber von der Installation, Administration, Performanceoptimierung bis hinten war sogar so ein Index, das hat man damals so gemacht. wo man einfach alle Befehle nochmal aufgelistet hat. Quasi so eine Doku, würde ich fast sagen, dass man heutzutage irgendwie online hat. Das war da hinten nochmal drinnen. Ist, glaube ich, immer noch in vielen Büchern. Keine Ahnung, ob das noch Sinn macht heutzutage. So, wo man nachschlagen kann, was denn die einzelnen Befehle machen. Und so eine kurze Beschreibung drin hat. Also das waren einige hundert Seiten, glaube ich, von den 800 Seiten von diesem Buch, waren dieser Index hinten. Wahrscheinlich so 200 Seiten oder sowas. Aber der war natürlich auch ziemlich aufwendig und vielleicht war es auch, weil es ein deutsches Buch war, dass einfach die Übersetzung ganz praktisch war, aber interessanterweise wollten das die Leute, zumindest hat das der Verlag immer behauptet. Und zu deiner Frage, habe ich das alleingeschrieben? Diese 800 Seiten? Nein, natürlich nicht, weil 800 Seiten alleine schreiben, das muss ich jetzt klar wieder, absolute Horror. Ich hatte zwei Co-Autoren, also wir waren zu dritt und wir haben uns das eigentlich gleichmäßig aufgeteilt und jeder hat sich so seine Schwerpunkte rausgesucht. Ihr habt zum Beispiel dieses Performance-Kapitel geschrieben, der Stefan hat sich auf diese ganzen Einleitungen und Erklärungen von SQL und so gestürzt, wo es wirklich darum geht, Sachen möglichst einfach zu erklären für so Einsteiger. Stefan ist da super drin. Die Eva, die mitgeschrieben hat, die hat glaube ich auch die Verteilung zum Beispiel. übernommen und so haben wir uns halt das aufgeteilt, ganz unterschiedlich, jeder hat ein paar Kapitel übernommen und so haben wir es überhaupt geschafft auf 800 Seiten zu kommen, weil sonst ist es einfach Horror, für mich zumindest, manche mögen das vielleicht aber 800 Seiten ist viel Arbeit.",
            "start": 339672,
            "end": 509682,
            "confidence": 0.7795725490196077,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mit Verteilung meinst du Sharding oder?",
            "start": 509722,
            "end": 511463,
            "confidence": 0.7006666666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, genau, also da ist wirklich Replikation und solche Dinge.",
            "start": 512361,
            "end": 515745,
            "confidence": 0.8383,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hast gerade gesagt, eigentlich waren es drei Bücher, das heißt, ihr habt das Ding zweimal geupdatet, also die dritte Edition gibt es oder gab es?",
            "start": 515765,
            "end": 524854,
            "confidence": 0.8002692307692308,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, ja, also aktuell ist die dritte Edition draußen. Der Verlag hat uns auch angeboten, weiterzumachen, haben wir aber abgelehnt und daher steckt es jetzt sozusagen bei der dritten Edition fest.",
            "start": 524874,
            "end": 535964,
            "confidence": 0.8206129032258065,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wann habt ihr das Buch begonnen zu schreiben? In welchem Jahr oder Monat? Und wann war die erste Edition zum Kaufen verfügbar?",
            "start": 535984,
            "end": 545928,
            "confidence": 0.886,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich glaube, die erste haben wir 2013 veröffentlicht, wenn ich das jetzt richtig recherchiert habe. Wie lange wir dafür gebraucht haben, ist recht schwierig. Mein Professor hat immer das als Ausrede gehabt. Der hat immer gemeint, ich habe für einen Doktor nur so lange gebraucht, weil ich das Buch geschrieben habe am Weg. Ich bin der anderen Meinung, das hat andere Gründe gehabt. Aber es war natürlich das Buch teilweise auch schon viel Zeit und wir haben es so im Endeffekt, würde ich mal sagen, in einem Jahr geschrieben, wobei wirklich Zeit, die es in Anspruch genommen hat, würde ich mal so sagen, irgendwo Richtung drei bis sechs Monate, würde ich mal sagen, da, wo man wirklich hauptsächlich an dem Buch gearbeitet hat.",
            "start": 546748,
            "end": 583050,
            "confidence": 0.7718306451612901,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hauptsächlich bedeutet fünf, sechs, sieben Stunden am Tag, oder?",
            "start": 583858,
            "end": 587700,
            "confidence": 0.6736666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist natürlich alles schwer messbar. Und wie gesagt, das hat sich halt über Jahr gezogen. Aber wenn man das runterbricht, vermute ich mal, dass es irgendwo zwischen drei und sechs Monate Fulltime waren. Ich meine, man kann nicht acht Stunden sich einfach hinsetzen und schreiben. Das funktioniert natürlich nicht. Irgendwie so in der Größenordnung. Und du musst ja auch Research betreiben. Wir haben auch ein Datenset kreiert. Große Flughafendatenbank haben wir die genannt, um so Tests zu machen, eben Performanceoptimierungen, dass man die erklären kann an einem Beispiel. Das war damals auf CD-ROM mit dabei oder was DVD, kann mich gar nicht mehr erinnern. War ein paar Gigabyte oder so Datensets, verschiedene Größen, damit man auch, wenn man einen schwachen Computer hat, hat man ein kleineres Datenset gehabt. Also wir haben uns das schon durchüberlegt, damit wir da eben ein Beispiel haben, und an dem Beispiel hat man dann in allen Kapiteln die Dinge eben jeweils beschrieben. Also, dass man da ein durchgängiges Beispiel hat.",
            "start": 587740,
            "end": 636757,
            "confidence": 0.7223952095808389,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was habt ihr für einen Textstack genutzt, um das Buch zu schreiben? Habt ihr das alles in Word geschrieben? Weil ich kann mich daran noch erinnern, immer, wenn ich in Word irgendwie so eine wissenschaftliche Arbeit geschrieben hab, und dann irgendwie falsch daneben geklickt hab, dann war das ganze Inhaltsverzeichnis wieder umformatiert, und das war wieder Horror. Oder habt ihr Latex genutzt? Oder Latex, Latex, wie heißt das denn? Ich weiß es auch nicht. China, China, Chemie.",
            "start": 636797,
            "end": 660887,
            "confidence": 0.7427012987012985,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also unser Wunsch war Latex zu verwenden, weil wir halt aus der Wissenschaft kommen und wir haben das auch gekannt. Also allein beim 20-seitigen Antrag in Wort ist das teilweise eine Katastrophe. Du klickst irgendwo, machst eine Neuzeile und plötzlich springt dir das gesamte Format irgendwie um. Aber der Verlag hat gesagt, entweder ihr verwendet unser Word-Dokument oder ihr müsst alles selber machen. Ihr könnt gerne LaTeX verwenden, aber da müsst ihr alles selber setzen und am Ende muss es so rauskommen, wie wir das wollen. Und das war uns dann doch zu großes Risiko und dann haben wir Word verwendet oder verwenden müssen, mehr oder weniger. Und es war aber eine gute Entscheidung, weil am Ende der Verlag eben sehr viel übernommen hat von den ganzen Sätzen. Die hatten auch extrem viele Makros in Word. Das heißt, wie man mit Bildern umgeht und wo die Bilder dann liegen und man hat so globale Ersetzungen durchführen können. Also die haben ziemlich viel Magic in dieses Word reingebaut. Ich habe das nie ganz verstanden. Aber am Ende hat es erstaunlich gut funktioniert und wir hatten, glaube ich, pro Chapter eine Word-Datei und das hat am Ende ganz gut skaliert. Also, es hat mich gewundert, aber die hatten das wirklich drauf. Aber das ist halt auch deren tägliches Brot und die hatten das scheinbar irgendwie optimiert in Word. Und darum waren wir ganz froh, am Ende nicht LaTeX genommen zu haben, weil jeder, der LaTeX kennt, das ist schon schwierig, da irgendwas hinzubiegen, wenn es mal nicht der Standard sein soll.",
            "start": 660907,
            "end": 739357,
            "confidence": 0.8203204633204633,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber wenn ich dich jetzt richtig verstanden habe, habt ihr ja natürlich viele Probleme von Word umgangen, weil ihr dann pro Chapter ein einzelnes Dokument hattet.",
            "start": 739817,
            "end": 748059,
            "confidence": 0.7699230769230769,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, wir hatten aber auch nur acht Chapters oder so, acht Kapitel. Also die Kapitel waren dann schon sehr groß und du musst dir vorstellen, gerade so bei Installationskapiteln, da hast du extrem viele Screenshots drinnen, da geht ein Kapitel schon mal über 100 Zeiten oder noch länger. Also das kann schon sein.",
            "start": 748099,
            "end": 764002,
            "confidence": 0.8052264150943399,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du sagtest gerade, der Verlag hat ziemlich viel übernommen. Kannst du da mal ganz kurz einen Abriss geben, was das heißt übernommen und was habt ihr gemacht? Also ihr habt geschrieben und researched, ihr habt den Content geliefert. Und was hat der Verlag dann übernommen, was passiert dann, was muss dann passieren, bis das Buch in den Händen gehalten werden kann?",
            "start": 764342,
            "end": 779070,
            "confidence": 0.7470819672131146,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das haben wir uns natürlich auch immer gefragt, was macht dieser Verlag eigentlich, weil der zieht ja ganz gut Kohle eigentlich ab von dem Buch. Aber im Endeffekt, was er jetzt macht, wenn es ums Schreiben geht, die lesen sich das natürlich mal durch, da gibt es einen Lektorat, der gibt Empfehlungen auch, der gibt es auch am Ende mal weiter zu einem anderen Profi, würde ich mal sagen, oder irgendeiner Person, die sich auskennt in dem Bereich und das wird nochmal durchgecheckt, dann bekommt man da auch nochmal Feedback. Also das ist deren QA-Cycle sozusagen, dass sie jemanden suchen, der sich in dem Fach auskennt und dann dementsprechend das Buch nochmal liest, aber sie lesen es auch einfach so, Rechtschreibfehler, die ganzen Dinge, teilweise schreiben sie auch mal einen Satz um, wenn der irgendwie krumm ist oder sowas, also rein inhaltlich. Und wenn man dann das Ganze abgeschlossen hat und auch das Layout fixiert hat, dann geht das nochmal zu irgendwelchen Designspezialisten, würde ich es mal nennen. Ich habe die Vermutung, dass die irgendwo anders sitzen, nicht in Deutschland, aber bin mir nicht so ganz sicher. Im wissenschaftlichen Bereich wird das oft gemacht, bei großen Verlagen auf jeden Fall. Und die machen das dann final auf dem PDF, auf diese Fahne nennt sich das. Und die kontrolliert man nochmal, ob irgendwas fehlerhaft ist. Aber da kann man dann auch keinen Text mehr ausbessern, außer man hat irgendwo ein Type oder sowas. Das geht schon noch. Aber du kannst jetzt kein Bild mehr verschieben. Also das ist dann wirklich diese Sätzen am Ende. Das ist dieses typische, was man kennt, wo dann so diese, diese Schnittmarken auch oben sind, wo dann das Papier geschnitten wird und sowas. Also wirklich das finale Produkt, was sich nicht mehr bewegt. Und das macht dann eben auch irgendwer und da wird dann schon nochmal genau geschaut, wie sind die Umbrüche, passt das mit Bildern, müssen wir ein Bild auf die nächste Seite setzen und ich glaube, dass da viel manuelle Arbeit dahinter steckt, aber ich habe es natürlich nie miterlebt, ich habe nur das finale Dokument dann gesehen und ich glaube, dass da einiges an Arbeit dahinter steckt.",
            "start": 779090,
            "end": 889294,
            "confidence": 0.7996931506849313,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber Bock es selbst zu machen hattest du ja anscheinend auch nicht.",
            "start": 889334,
            "end": 891295,
            "confidence": 0.49441666666666656,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, das ist eine Scheißarbeit, 800 Seiten irgendwie das Design zu checken und da irgendwelche Fehler auszubessern, wenn irgendwo ein Bild abgeschnitten ist oder auf der falschen Seite oder zu viel Leerraum und diese ganzen Dinge. Also ich kann mich erinnern, wir hatten auch so komische Anmerkungen in diesem Word, weil wer diese Rheinberg-Bücher, übrigens ist der Verlag, früher hat der Galileo geheißen, das waren früher diese blauen Bücher, mittlerweile sind sie, glaube ich, primär so grün, Das ist der größte deutsche IT-Verlag, früher war es zumindest. Und die haben links und rechts immer so Symbole. Das ist jetzt eine Glühbirne, das ist irgendwie ein Tipp oder solche Dinge. Und die hatten wir in Word irgendwie über so Anmerkungen gemacht. Und ich glaube, die Leute, die dann wirklich diese Fahne setzen, die machen das dann wirklich handisch. Die lesen das und sehen, da gehört diese Glühbirne hin. Und dann ziehen die wahrscheinlich irgendwie dieses Symbol rein oder Also keine Ahnung, wie gut das funktioniert, automatisiert, aber damals war es, glaube ich, ziemlich manuell alles. Also da ist viel manuelle Arbeit noch dahinter und das wirst du natürlich auf keinen Fall selber machen. Auf 800 Seiten da irgendwelche Icons einfügen und solche Sachen checken.",
            "start": 892089,
            "end": 958598,
            "confidence": 0.7849117647058829,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Verlag macht natürlich noch ein bisschen mehr. Neben den Sätzen machst du das ganze Marketing und so weiter darunter, unter das Buchcover. Oder hast du dich hingesetzt mit einem Zettel und einem Stift und hast ein Buchcover gezeichnet?",
            "start": 958618,
            "end": 966906,
            "confidence": 0.5932820512820514,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war sogar eine lange Diskussion über das Buchcover und ich hatte ein wirklich geniales Buchcover. Und zwar habe ich ein Bild gefunden, wo jemand am 5 Meter Sprungbrett steht in einem Schwimmbad und so einen Delfin umarmt, so einen Gummidelfin, so einen aufblasbaren Delfin, und sich nicht traut, runterzuspringen. Und ich habe mir gedacht, das ist eigentlich ideal, weil das Maskottchen von MySQL ist ja ein Delfin und der traut sich da nicht runterspringen. Es war eigentlich super und alle waren große Fan von diesem Bild, aber am Ende hat der Verlag gesagt, das passt nicht in unser Konzept von unserer Cover, weil unsere Bücher müssen alle irgendwie edlig ausschauen, da gibt es einen gewissen Stil und der Stil passt leider nicht. Und dann haben wir irgendwie so ein komisches, irgendwelche, ja ich weiß gar nicht, was das ist eigentlich, aber irgendwie so Kugeln, die irgendwie miteinander verknüpft sind, keine Ahnung. Sagt eigentlich nicht viel aus, aber eher so Graf-mäßig würde ich fast sagen. Aber das war dann der Wunsch vom Verlag und dem haben wir uns gebeugt. Also der macht schon mehr und Marketing macht er dann natürlich auch, wenn man heutzutage ein CT aufschlägt, also das Magazin, dann hast du da höchstwahrscheinlich irgendwo so eine Reinwegwerbung drinnen, wo die neuesten Bücher vorgestellt werden. Die gehen auf Messen natürlich, die haben ihre Connections und die bewerben das Buch natürlich auch.",
            "start": 967727,
            "end": 1043363,
            "confidence": 0.7668448275862072,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie bist du jetzt zu dem Verlag gekommen oder wie ist der Verlag zu euch gekommen? Oder hattest du wahrscheinlich immer den Drang als kleines Kind ein Buch über eine Datenbank zu schreiben?",
            "start": 1043403,
            "end": 1052485,
            "confidence": 0.759363636363636,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es ist eigentlich sehr, sehr witzig entstanden. Der Stefan wollte eigentlich ein Buch über Open Source schreiben. Das war immer sein Wunsch. Und der hat den Verlag angeschrieben, hat gesagt, ich würde gern dieses Open Source Buch schreiben, so mit einem kurzen Abstract, einer Idee. Und die hatten das dann besprochen und haben gesagt, Ich glaube, das verkauft sich nicht, offensichtlich interessiert niemanden. Es war mehr so ein Meta-Buch. Aber wir haben gesehen, in deinem CV, da steht irgendwas mit Datenbanken. Du hast Datenbanken studiert, Masterarbeit und so weiter geschrieben. Und wir suchen eigentlich jemanden, der ein MySQL-Buch schreibt, weil wir wollen so ein reines Datenbank-Buch machen. Es hat dieses BHB und MySQL gegeben. Ich glaube, das ist vom Kofler oder so, wenn mich nicht alles täuscht. Das ist ein ganz bekanntes Buch. Das gibt's in der wahrscheinlich zwanzigsten Auflage jetzt. Verkauft sich wie Sau, BHB und MySQL, so ein Klassiker hast du sicher schon gesehen. Aber sie hatten kein reines MySQL-Buch und drum war dann die Frage, willst du das nicht schreiben? Und Stefan hat mit uns studiert und wir waren halt am Datenbankinstitut dort angestellt, Eva und ich, und das hat ganz gut gepasst. Und er hat uns halt gefragt, wollen wir gemeinsam ein Buch schreiben, weil 800 Seiten alleine ist halt doch etwas hart. Und so sind wir zufällig zum Buch gekommen. Es war auch ganz interessant, das ein bisschen zu lernen, wie Verlage so ticken, weil die Verlage suchen eigentlich meistens junge Leute, zumindest der Rheinberg Verlag, die einfach offen sind, ein Buch zu schreiben, weil man muss das auch verstehen, du verdienst mit dem Buch sehr, sehr wenig. Das heißt, jemand, der schon in dem Business drin ist, der wird wahrscheinlich eher kein Buch mit einem Verlag schreiben, weil finanziell ist das absolut uninteressant. Und darum suchen die eigentlich junge Autoren und man muss sich das auch im Hinterkopf behalten, wenn man ein Buch kauft, ist es ganz oft kein super Spezialist, der da dahinter steckt oder Spezialistin, sondern einfach jemand, der halt offen ist, ein Buch zu schreiben und natürlich gewisse Qualitätskriterien erfüllt, aber das muss kein absoluter Profi sein oder eine Spezialistin.",
            "start": 1052868,
            "end": 1165213,
            "confidence": 0.7795654596100277,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hast das finanzielle angesprochen. Was verdient man mit so einem Buch? Weil du sagst, man wird nicht reich.",
            "start": 1166155,
            "end": 1171880,
            "confidence": 0.7291052631578947,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also man kann sich das ganz gut durchrechnen. Dieses Buch hat, glaube ich, 50 Euro. Kostet es aktuell 49,90. Ja, genau.",
            "start": 1171920,
            "end": 1178607,
            "confidence": 0.7147619047619048,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was ja schon nicht wenig ist, ne?",
            "start": 1180772,
            "end": 1182273,
            "confidence": 0.4681428571428571,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, das ist schon relativ viel. Aber ich glaube, das ist relativ normal für so ein IT-Buch, für so ein dickes. Und von diesen 50 Euro kommt mal die Steuer weg, dann bist du irgendwo so bei 40 Euro. Dann bekommt der Handel nochmal 10 Euro und der eigentliche Nettopreis, den der Verlag bekommt, ist 30 Euro. Das heißt, wenn der Verlag ein Buch verkauft, bekommt er 30 Euro. Unser Deal war, wir bekommen 10% von diesem Nettopreis, das heißt 3€. Das heißt wir haben 3€ pro Buch bekommen, wir sind 3 Autoren. Das heißt jeder Autor hat 1€ bekommen pro verkauften Buch.",
            "start": 1182333,
            "end": 1216497,
            "confidence": 0.7622135922330098,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gut, wie viele Bücher habt ihr jetzt verkauft?",
            "start": 1216517,
            "end": 1218138,
            "confidence": 0.324125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube, unser Buch ist gar nicht so schlecht gelaufen. Ich glaube, wir haben so Auflagen von zweieinhalbtausend Stück pro Auflage gehabt, wenn ich das richtig im Kopf habe. Und dann bekommst du halt, wenn du zweieinhalbtausend Bücher verkaufst, was im deutschsprachigen Raum für ein IT-Buch, glaube ich, gar nicht so schlecht ist, dann bekommst du halt theoretisch zweieinhalbtausend Euro, musst es aber danach noch versteuern, weil das ist natürlich normales Einkommen, was du versteuern musst. Und man muss das auch so sehen, dass da viele Exemplare natürlich verschenkt werden. Also die 2.500 werden meistens nicht verkauft, sondern du hast Belegexemplare, da bekommen irgendwelche Leute, die Rezensionen schreiben sollen, Testexemplare. Wir bekommen ein paar Exemplare als Autoren. Also du verkaufst gar nicht die 2.500 üblicherweise. Das geht auch raus an die ganzen Buchhandlungen, da bekommst du noch kein Geld, nur weil es in der Buchhandlung steht. Das ist alles auf Kommission gekauft und du bekommst erst Geld, wenn die Buchhandlung das wirklich kauft, weil die kann es auch theoretisch zurückschicken und so weiter. Also da gibt es viele Dinge, die man beachten muss und am Ende hat man da vielleicht ein paar tausend Euro rausbekommen, wenn man das so sieht. Also finanziell ist das wirklich uninteressant. Ich glaube sogar, wir haben über diese Tantiemen, die man bekommt, also wir haben Ich weiß nicht, du kennst wahrscheinlich diese Abgabe, die da oft in Diskussionen war, wenn man eine Festplatte kauft oder einen Kopierer, da musst du ja so eine Abgabe zahlen. Da war auch Amazon mal groß im Gespräch, weil die es, glaube ich, nicht gezahlt haben oder nicht zahlen wollten oder so für Festplatten.",
            "start": 1218648,
            "end": 1305143,
            "confidence": 0.7663236363636361,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Noch nie gehört ne keine Ahnung ich kenn ich kenn ne Abgabe bei wenn ich neue Autobatterie kaufe ja so zum Beispiel Autobatterie Pfand und Versicherung und allem drum und dran und Sicherheitszuschlag und schieß mich tot, das nervt mich hart weil ich Tage Autobatterien kaufen muss aber keine Ahnung was man bei Festplatten abdrucken musste habe ich das noch nicht gehört.",
            "start": 1305884,
            "end": 1325520,
            "confidence": 0.7660322580645161,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also ich glaube, das gibt es immer noch, weil du ja mit Festplatten Sachen kopieren kannst, urheberrechtlich geschützte, und dann geht es in so einem allgemeinen Topf und in Österreich nennt sich das Literar Mechaner, die das dann verteilt an alle, die irgendwie urheberrechtliche Dinge geschrieben haben oder auch Kopierer, weil mit Kopierer kopierst du ja urheberrechtlich geschütztes Material. Das heißt, immer wenn du einen Kopierer kaufst oder einen Scanner, glaube ich auch, dann zahlst du einen gewissen Anteil und dann geht es in diese zentrale Kasse und die verteilen das dann an alle, die irgendwas geschrieben haben. Und je nachdem, wie viele Exemplare du verkaufst, wie viele Seiten das Ganze hat, bekommst du da nochmal Tantiemen von dieser zentralen Kasse. Auch wenn du ein wissenschaftliches Paper schreibst und es irgendwo veröffentlicht wird, in so einem Springerbuch oder so, dann bekommst du auch davon diese Tantiemen. Und ich glaube, das war fast nochmal so viel wie der eigentliche Betrag, den wir vom Verlag bekommen haben. Also wenn du 2.000 Euro vom Verlag bekommst, dann haben wir glaube ich auch nochmal 2.000 Euro fast an Themen bekommen. Also von dieser Kopierabgabe haben wir da auch nochmal profitiert.",
            "start": 1325916,
            "end": 1391761,
            "confidence": 0.8065837563451772,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber die tracken jetzt nicht mit, wie oft das kopiert wurde, sondern die sagen einfach nur, okay, wir gehen davon aus, das wird immer mal kopiert und so weiter, deswegen kriegst du jetzt einfach diesen Batzen.",
            "start": 1391821,
            "end": 1400148,
            "confidence": 0.7182222222222222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das wird irgendwie anteilsmäßig alles berechnet. Ja, extrem, extrem schwindeliges Zeug, muss man auch dazu sagen. Aber wir waren natürlich froh, weil da irgendwo wieder Geld reingekommen ist. Aber es sind auch keine großen Summen, die man da bekommt. Also, wie gesagt, man wird, glaube ich, nicht reich. Vielleicht, man kann davon leben, wenn man solche Klassiker wie dieser Kofler, der, glaube ich, BHB und MySQL oder auch Linux hatte, so ein Standardwerk im deutschsprachigen Raum. Wenn man natürlich solche Mengen dann verkauft, dann ist das wahrscheinlich besser und da hat man dann auch ein paar Bücher und das sind dann so Evergreens, die ständig verkauft werden. Da ist es dann vielleicht möglich oder wenn du ein internationales Buch hast, also sogar da, wenn du jetzt ein super spezialisiertes Buch hast bei O'Reilly, dann wird das wahrscheinlich trotzdem nicht so oft verkauft wie jetzt irgendein Harry Potter oder sowas. Und wir hatten, glaube ich, mit den 10% eh eigentlich ganz hohen Betrag. Wenn man so hört, die normalen Autoren, die so normales Buch schreiben, so ein Taschenbuch, die liegen meistens eher so bei 6% von dem Preis. Jetzt musst du dir überlegen, wenn du so ein Taschenbuch schreibst, das irgendwie 8€ kostet und du bekommst dann irgendwie 6% von dem Nettopreis, da bekommst du irgendwie paar Cent, Also da musst du schon viele Bücher verkaufen, damit du davon leben kannst. Also Bücher schreiben als Lebensunterhalt kann ich niemandem empfehlen.",
            "start": 1400503,
            "end": 1475301,
            "confidence": 0.7797949790794984,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und die Beträge, die du genannt hast, das ist ja keine Einmalauszahlung gewesen, sondern irgendwie über ein, zwei, drei Jahre.",
            "start": 1475941,
            "end": 1482947,
            "confidence": 0.8469000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die bekommst du einfach halbjährlich. Gibt es eine Abrechnung. Ich bekomme immer noch Abrechnungen. Mittlerweile sind es die E-Books und da bekomme ich halt dann immer wieder mal sieben Euro oder so von den E-Books überwiesen.",
            "start": 1482967,
            "end": 1495398,
            "confidence": 0.735,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber gibt es nicht irgendwelche Deals, dass du auch während des Schreibens schon mal Geld bekommst? Weil ich hab dich jetzt so verstanden, dass du während des Schreibens ja kein Geld bekommen hast, sondern erst als das Buch fertig war und in den Verkauf ging.",
            "start": 1495978,
            "end": 1506712,
            "confidence": 0.7738444444444443,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, wenn du J.K. Rowling oder so bist und einen neuen Harry Potter schreibst, bekommst du das sicher. Aber wenn du der kleine Wolfi bist und dann MySQL-Buch schreibst, dann bekommst du da gar nichts. Du hast sogar eine, in dem Vertrag gibt es so eine Verramschungsklausel, nennt sich die, glaube ich, wenn du weniger Bücher als, keine Ahnung, weniger als 50 Bücher pro Monat verkaufst oder so, dann behält sich der Verlag vor, das zu verrampschen und die können das dann einfach um 2 Euro verschenken sozusagen, werde weniger dein Buch und dann bekommst du von den 2 Euro dementsprechend deinen Anteil. Also, wie gesagt, Bücher schreiben ist in dem Sinne nichts, wo man viel Geld damit verdient.",
            "start": 1507488,
            "end": 1545996,
            "confidence": 0.7567478991596641,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das bringt mich zu der nächsten Frage. Wie Simon Zimek es immer sagt, start with why. Warum hast du das dann gemacht? Was bringt es, ein Buch zu schreiben?",
            "start": 1546036,
            "end": 1553798,
            "confidence": 0.7395862068965517,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, der Stefan war einfach so überzeugend, der hat gesagt, wir müssen ein Buch schreiben. Es ist natürlich extrem cool, ein Buch zu schreiben, weil wer hat schon ein Buch? Und noch dazu beim renoviertesten deutschen IT-Verlag. Das ist ja auch nicht was, was jeder hat. Also man kann sich damit schon abheben. Und es ist erstaunlich. Ich meine, ich habe das extrem cool gefunden. Ich war natürlich schon auch stolz, dieses Buch zu haben. Aber ich hätte mir nie gedacht, wie viel Eindruck das hinterlässt, wenn du im CV so ein Buch drinnen stehen hast. Es glaubt wirklich jeder, du bist absoluter Profi in Datenbanken und in MySQL. Und jeder spricht dich auf dieses Buch an. Und sogar jetzt im Nachhinein, jeder erinnert sich irgendwie, dass er schon mal ein Buch geschrieben hat, der das irgendwo gehört hat. Und ich habe das gerade gar nicht groß rausgesaunt, aber irgendwie sind dann die Leute auf das zu sprechen gekommen und die waren total fasziniert, dass ich ein Buch geschrieben habe. Mir hat das jetzt irgendwie einmal Jemand angesprochen, ein Student, der in der Uni-Bibliothek dieses Buch gesehen hat und meinen Namen gesehen hat und hat mich dann gefragt, ob ich das bin. Der hat unser Podcast gehört und hat mich gefragt, ob ich das bin. Ich war ganz erstaunt, dass das noch irgendwie rumliegt. Der ist fast aus allen Wolken gefallen, dass er da irgendwie so einen Autor kennt. Obwohl da nicht so viel dahinter steckt, wie man vielleicht glaubt, ist es doch ganz cool, das im CV stehen zu haben. Und ich glaube, das bringt einen am meisten, dass man einfach da ein Buch drinnen stehen hat. Und der Verlag hat es auch ganz klar gesagt am Anfang, ihr werdet nicht viel verdienen und das macht auch niemand wegen dem Geld, sondern um die Reputation aufzubauen. Und die meisten ihrer Autoren verdienen eigentlich das Geld über Consulting dann. Und als Consultant kann man sagen, man hat ein Buch geschrieben. Also es funktioniert meistens über den Weg und das war auch die klare Kommunikation vom Verlag, ihr werdet nicht viel Geld bekommen, aber nutzt es halt anders irgendwie.",
            "start": 1554258,
            "end": 1660019,
            "confidence": 0.7750614525139666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hattest du denn gute Gigs danach? Hattest du denn viel Consulting-Jobs oder haben sich neue Türen geöffnet auf Basis des Buches? Also ich meine, ist natürlich jetzt ein bisschen schwierig, das retrospektiv zu betrachten, weil du kein Paralleluniversum hattest, wo du kein Buch geschrieben hast und so weiter und so fort. Doch denkst du, die Reputation und die Arbeit war es wert, was sich danach über die Jahre ergeben hat.",
            "start": 1660039,
            "end": 1684931,
            "confidence": 0.820157142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich glaube, es war auf jeden Fall wert, das zu schreiben, weil ich da am Weg extrem viel gelernt habe. Auch über MySQL, weil wenn du so ein Performance-Kapitel zum Beispiel schreiben musst, also das war sicher das härteste Kapitel, wo ich am meisten Zeit investiert habe, weil du dir halt wirklich überlegen musst, wie bringst du das rüber, was für Beispiele nimmst du, ist das wirklich so? Dann haben sich die MySQL-Versionen geändert, dann haben meine ganzen Performance-Beispiele nicht mehr funktioniert, weil MySQL besser geworden ist. Das heißt, alles, was ich optimiert habe, habe ich wieder rausschmeißen können bei der nächsten Edition. weil das alles schon optimiert war von MySQL. Das heißt, du musst wieder neue Beispiele finden. Also, du lernst schon da auch sehr viel über das Datenbanksystem. Gar keine Frage. Ganz nebenbei das Schreiben und alles, was dazugehört natürlich. Ob es mir jetzt wirklich so viele Türen geöffnet hat, ist schwierig. Ich habe es aber auch nicht genutzt. Also, wenn ich jetzt wirklich Consultant geworden wäre im Datenbankbereich, dann hätte ich das wahrscheinlich stärker nützen können. Aber in dem Fall war ich noch länger an der Uni. Und als Freelancer habe ich das jetzt nicht irgendwie groß als Aushängeschild verwendet, habe ich auch nie gebraucht eigentlich, aber man hätte das sicher noch besser verwenden und ausnützen können. Und wie gesagt, so im Allgemeinen, im CV natürlich, das im CV zu haben ist natürlich schon praktisch, würde ich mal sagen, und macht das Leben schon einfacher bei Interviews zum Beispiel, die Leute sprechen ja auch immer drauf an.",
            "start": 1685742,
            "end": 1761987,
            "confidence": 0.7712222222222229,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hattest erzählt, du hattest das Angebot vom Verlag weiterzumachen und eine vierte Edition zu machen oder eine dritte Edition dann jetzt. Wieso habt ihr abgelehnt?",
            "start": 1762147,
            "end": 1771132,
            "confidence": 0.7538846153846153,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das war primär eine Zeitsache, weil, wie gesagt, das Updaten kostet doch ziemlich viel Zeit und du bekommst halt jetzt nicht wirklich extrem viel Geld oder so damit. Und wir waren einfach alle der Meinung, wir haben Jobs, wir haben andere Sachen zu tun und da jetzt nochmal so viel Zeit zu investieren, gerade damals, wie uns der Verlag gefragt hat, waren wir alle sehr, sehr eingespannt und wollten einfach die Zeit nicht investieren. Und du hast ja am Papier, am CV, wenn du jetzt nur von dem ausgehst, hast du dieses Buch ja schon. Und die vierte Edition würde jetzt vielleicht nochmal, keine Ahnung, 2000 Euro einbringen oder irgend so was in der Größenordnung. Aber du investierst halt schon viel Zeit. Vor allem, das war dann damals gerade, wo MySQL 8 rausgekommen ist, beziehungsweise die Nachfolger-Versionen. Und da hat sich ziemlich viel geändert und da hätten wir schon viel, viel ändern müssen und die Idee war auch, dass der Verlag das weitermacht und eigentlich einen vierten Autor mit reinbringt und wir bleiben so am Cover stehen und haben so einen halben Ghostwriter, der als vierte Person dazukommt, der steht dann auch am Cover. Aber irgendwie hatten sie ja auch Probleme, da jemanden sinnvoll zu finden. Und vielleicht auch dann zu wenig Interesse vom Verlag. Und daher ist das irgendwie im Sande verlaufen. Wir haben zumindest seitdem nicht mehr wirklich was gehört diesbezüglich.",
            "start": 1771593,
            "end": 1845719,
            "confidence": 0.8096794871794872,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hattest gerade gesagt, beim Schreiben über ein Thema recherchiert man sehr viel und man lernt auch sehr viel. Ich habe immer das Gefühl, umso mehr ich über ein Thema weiß, desto mehr weiß ich, was ich nicht weiß, und fühle mich danach dümmer. Weil du ja dann in die Tiefen des Themas einsteigst und merkst erst mal, okay, wie komplex ist das eigentlich. Und du kennst halt deine Gaps, bist aber im generellen Vergleich dennoch sehr tief drin und sehr weit. Hattest du das gleiche Gefühl bei MySQL beim Schreiben des Buches?",
            "start": 1846591,
            "end": 1876398,
            "confidence": 0.8074516129032255,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, um wieder zurückzukommen auf diese eigentliche Frage, wie gut ist man in einem Bereich zwischen 0 und 10? Das haben wir in diesem YouTube-Video mit Nils ja auch besprochen, dass jemand, der ein Buch geschrieben hat oder auf Level 10 wäre vielleicht, der würde sich selber nie auf 10 einstufen, sondern der stuft sich auch irgendwo in der Mitte ein, weil er eben auch weiß, dass es immer andere Leute gibt, die mehr Ahnung haben. Und das merkst du dort natürlich auch. Es gibt Themen, da sind andere immer besser. Das heißt, du wirst dich nie auf 10 einstufen. Das ist ja eigentlich auch die Idee von dieser Frage. Wenn sich Leute auf 10 einstufen, dann ist meiner Meinung nach irgendwas faul. Weil wahrscheinlich kannst du die Oberprofis fragen und wenn du Monty von MariaDB, den Erfinder von MySQL, fragst, ob er nicht 10 ist, würde er sich wahrscheinlich auch nicht auf 10 einstufen, weil es gibt halt andere, die in gewissen Bereichen einfach mehr Ahnung haben in MySQL, bin ich mir hundertprozentig sicher. Und wir hatten das ja auch schon mal besprochen in der Folge mit dem Impostor-Syndrom, dass du halt immer andere Leute erkennst, die mehr Ahnung haben und dadurch wirst du selber immer runtergestuft. Oder man hat immer das Gefühl, dass man zu wenig verdient, weil man auch immer andere Leute kennt, die mehr verdienen. Und das ist halt immer relativ, wie du dich selber einstußt.",
            "start": 1877259,
            "end": 1951327,
            "confidence": 0.8068499999999992,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kommen wir jetzt mal zu einer Frage, die mir konstant schon im ganzen Podcast unter den Nägeln brennt. Wie viel Amazon Reviews hast du gekauft und was kostet ein Review?",
            "start": 1951347,
            "end": 1960091,
            "confidence": 0.7205333333333336,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich persönlich habe gar keine gekauft. Also wir haben das Buch an einige Leute ausgesendet, wir haben dem Verlag auch Namen zugesendet und der Verlag hat die dann an die Leute ausgesendet und die haben ein Gratisexemplar bekommen dafür, dass sie eine Rezension schreiben. Wobei da jetzt nicht dabei gestanden ist, muss eine gute sein, muss man auch dazu sagen. Aber bei manchen Rezensionen bin ich mir nicht sicher, ob die gekauft waren. Weil wenn du auf Amazon gehst und ein paar Rezensionen durchliest, das sind extrem positive Rezensionen und das sind Leute, die tausende Rezensionen schreiben. Also du siehst ja immer, wie viele Rezensionen eine Person geschrieben hat. Und da gibt es halt Leute, die schreiben 6000 Rezensionen über Kreuz und Quer durch die Bank und ich bin mir nicht sicher, ob da jemand großer MySQL Spezialisten ist. Und diese Rezensionen schauen meiner Meinung nach sehr gekauft aus. Ich habe keine Ahnung, ob das der Verlag macht, ob das zufällig passiert oder ob die einfach nur an solche Leute halt ausschicken, wo sie wissen, okay, für ein Gratisexemplar, was die dann weiterverkaufen, schreiben sie eine Rezension und die ist dann gut. Also vielleicht ist das so halb unwissend. Keine Ahnung, wie das funktioniert, aber ein, zwei Rezensionen sind schon drinnen. Da würde ich schon sagen, die müssen fast gekauft sein. Aber dadurch wir eh sehr viele gute Rezensionen haben, auch andere von Leuten, die es garantiert, die nicht bezahlt wurden, bin ich eigentlich ganz zufrieden, wenn da halt ein, zwei am Start dabei waren, um das irgendwie anzukurbeln, dieses Geschäft. Vielleicht macht man das so. Aber da habe ich ehrlich gesagt zu wenig Einblick. Das sind jetzt alles Mutmaßungen, wie das zustande kommt, keine Ahnung. Aber es ist schon so mit den Rezensionen, ist jetzt ein anderer Bereich, aber wenn du zum Beispiel auf die Bewertungen von unserer Fahrschul-App gehst im App Store, wenn du die durchliest, auch wir selber, wenn wir die lesen, bei der Hälfte glauben wir, die sind gekauft. Die sind so überschwänglich und wie toll diese App ist und wie hilfreich, wo wir immer selber denken, jeder andere, der die liest, die müssen gekauft sein. Aber da kann ich garantieren, dass sie nicht gekauft sind, weil wir noch nie Geld ausgegeben haben oder dafür Geld hätten. Aber das ist einfach Wahnsinn, wie überschwänglich manche Leute so Rezensionen oder Kommentare schreiben.",
            "start": 1960979,
            "end": 2085815,
            "confidence": 0.8096987341772148,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also vertraust du deiner eigenen Arbeit einfach nicht?",
            "start": 2086636,
            "end": 2088697,
            "confidence": 0.69875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, auch da wieder, wenn man den Einblick hat, wie schlimm der Code ist und was da im Hintergrund abläuft und wie alt das Design ist, dann fragt man sich immer, warum die Leute so überschwänglich sind. Aber scheinbar bringt es denen was, ja.",
            "start": 2089478,
            "end": 2100990,
            "confidence": 0.8053181818181819,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hast du ein IT-Fachbuch geschrieben, liest du eigentlich selbst IT-Fachbücher?",
            "start": 2101010,
            "end": 2104533,
            "confidence": 0.6845454545454546,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist die Frage, was man unter IT versteht. Also so technische IT-Bücher, glaube ich, ist schon lange her, dass ich mal eines gekauft habe. Natürlich, wenn es so um Leadership-Themen, Team-Sachen geht, Kommunikation und solche Dinge, da lese ich schon Bücher, aber ich bin jemand, der wahrscheinlich eher weniger Bücher liest. Also gegen Bill Gates oder so, der da, keine Ahnung, seine zehn Bücher pro Woche vertilgt, da kann ich sicher nicht mithalten. Also bei mir kann dir an einer Hand abzählen, was ich pro Jahr lese, das ist eher weniger.",
            "start": 2105374,
            "end": 2133313,
            "confidence": 0.763230769230769,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Liegt vielleicht auch daran, dass Bill Gates inzwischen Privatier ist und wir noch für unser Geld arbeiten müssen.",
            "start": 2133883,
            "end": 2139789,
            "confidence": 0.7891111111111111,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie viele Bücher liest du so? IT Bücher? Wann hast du das letzte technische Buch gekauft?",
            "start": 2139809,
            "end": 2145555,
            "confidence": 0.7126874999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich kaufe mir keine Bücher über eine bestimmte Software oder eine bestimmte Version oder sowas, das jetzt nicht. Technisches Buch, die letzten waren eins über System Design, also sehr viel Architektur und allem darüber dran, also sehr viele generelle Patterns würde ich mal nennen. Oder Data Intensive Applications, wo es sehr sehr viel um Datenstrukturen, Datenbanken, verschiedene Datenbankentypen geht.",
            "start": 2145575,
            "end": 2170846,
            "confidence": 0.8235254237288134,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das ist ja auch schon zehn Jahre her, wo du das gekauft hast, oder?",
            "start": 2170886,
            "end": 2173567,
            "confidence": 0.6150666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hatte mir erst die digitale Version gekauft, die habe ich dann auch gelesen und dann habe ich mir das nochmal in Papier gekauft, genau, weil manche Bücher sind einfach so gut, die möchte ich einfach im Schrank stehen haben und ab und zu finde ich, dass die Haptik des Papiers auch toll.",
            "start": 2174475,
            "end": 2189125,
            "confidence": 0.8183962264150948,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber warum kaufst du jetzt ein Buch eigentlich? Weil, also bei uns war immer die Frage, warum kauft jemand dieses MySQL Buch? Du hast alle Informationen, die in dem Buch sind und sogar noch mehr in der Online-Dokumentation.",
            "start": 2189165,
            "end": 2200313,
            "confidence": 0.8158157894736842,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich möchte nicht immer vor dem Rechner oder vom iPad hängen und möchte auf den Screen gucken und die Online-Dokumentation lesen. Jetzt kann mir natürlich die eine oder andere Person sagen, hey, du kannst dir die Online-Dokumentation auch exportieren und auf den Kindle packen. Ja, das ist richtig. Man muss aber auch sagen, der Schreibstil ist maßgeblich unterschiedlich. Wenn ich jetzt ein technisches Buch lese von jemandem, der drückt das ja ganz anders aus, der erklärt mir das ja besser, wohingegen dann zum Beispiel eine technische Dokumentation von der Datenbank sehr, sehr objektiv ist, knallhart auf den Fakt und der baut da keine Story oder kein Beispiel drum. Deswegen ist es schon eine andere Art zu lernen und eine andere Art, das auch zu verstehen.",
            "start": 2200773,
            "end": 2246974,
            "confidence": 0.8174523809523813,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, das ist auch mit der Zeit, wenn man sich besser auskennt, dann weißt du halt genau, wo du nachschauen musst und dann schaust du halt genau dieses Problem nach, das du hast und ein Buch, hat halt einen Flow von 0 bis 100 sozusagen und du kommst langsam in ein Thema rein. Und wenn du neu bist in dem Thema, hilft dir das natürlich einfach, den Überblick zu bekommen, weil die Online-Doku hat halt mehr als diese 800 Seiten und du musst halt selber dann rausfiltern, wo steht das Wichtige drin.",
            "start": 2247014,
            "end": 2274112,
            "confidence": 0.8111935483870965,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man muss ja auch sagen, man muss ja auch lernen, Dokumentation zu lesen, weil jede Dokumentation ist ja anders aufgebaut. Die Dokumentation von Go ist anders aufgebaut als die von PHP, als die von Python, obwohl es alles drei Programmiersprachen sind. Und ich brauche immer meine Zeit, bis ich sicher durch eine Navigation einer Software navigieren kann. Und Bücher, wie du schon sagtest, haben eine Art roten Faden. Die erklären in der Regel nicht das spezifische Setting, sondern eher das High-Level-Konzept. Wohingegen dann zum Beispiel Tutorials auf Blogposts oder auf YouTube in der Regel mit dir eine To-do-App bauen. Danach weißt du, wie du eine To-do-App baust, aber verstehst die hinterlegenen Konzepte nicht, weil die oft nicht erklärt werden. Und da bin ich persönlich ein Fan davon, okay, die generellen Konzepte kennenzulernen, vielleicht anhand eines großen Beispiels, was ich unglaublich gut finde. Es gibt ein Buch, ich glaube, das ist in Data Intensive Applications von Martin Kleppmann, der erklärt das Problem von Hot Partitions in Datenbanken wie DynamoDB. wenn es darum geht, dass ganz viele Leute eine sehr minimale Anzahl an Items selektieren oder schreiben wollen, anhand des Beispieles der Präsidentenwahl in Amerika. Weil dort du ganz viele Wähler hast, aber nur zwei Items. Und wenn du dann so was wie deine Modem B nutzt, dann kriegst du relativ schnelle Hot Partitions und dann kriegst du relativ schnell Performance-Probleme. Und anhand von so was erklärt er das. Und das versteh ich, das find ich super. Kommen wir mal zurück zum Buch. Würdest du nochmal ein Buch schreiben?",
            "start": 2274612,
            "end": 2377853,
            "confidence": 0.8357159533073932,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, eindeutig nicht. Beziehungsweise es kommt darauf an, was für ein Buch, aber ich würde definitiv nicht nochmals in der Art ein Buch schreiben, zusammen mit einem Verlag. Wenn, wäre es auf jeden Fall Englisch, weil du einfach automatisch mehr Leute ansprichst, wobei natürlich die Konkurrenz auch viel größer ist. Und wenn, würde ich wahrscheinlich versuchen, irgendwas selber zu publizieren, damit du den Verlag rausbekommst aus der ganzen Geschichte. Aber was man natürlich schon sehen muss, du musst dann das Marketing selbst machen. Und drum machen das ja meistens Leute, die schon einen gewissen Namen haben oder in der Szene bekannt sind. Die machen dann ein eigenes Buch und publizieren das selbst. weil die dann natürlich schon diesen Marketing-Channel haben oder die Reichweite und wenn die auf Twitter irgendwas raushauen, so wie der Peter Levels zum Beispiel mit seinem Buch, das er online geschrieben hat, der hat 100.000 Follower, wenn der das da rausknallt, dann kaufen die Leute das direkt und er bekommt halt die vollen 20 Dollar von diesem Buch und bei uns war es halt 1 Euro pro Buch und da hast du dann schon einen anderen Hebel im Endeffekt. Also ich glaube, Bücher an sich oder diese Art zumindestens, dass du kuratierst das Wissen und das halt in einem schönen Format, in einem einfach verständlichen Format rüberbringst, sei es jetzt in dem Buch, Online, Blog, Video, was es auch immer ist. Ich glaube, das macht schon noch Sinn, gerade für Einsteiger, um in ein Thema reinzukommen. Aber ich glaube, der Weg über den Verlag wird vielleicht in Zukunft immer weniger. Zumindest sieht man das ja auch. Es gibt viel mehr Angebote online, Online-Kurse, YouTube-Videos, Online-Bücher. Und da hat man halt dann direkten Zugriff zu seinem Lieblingsautor oder nennst Tech-Fluencer, Influencer, whatever it is. Und dann kannst du das Buch selber vertreiben und auch dementsprechend Geld damit machen. Das bekannteste Beispiel aus dem Datenbankumfeld ist wahrscheinlich der Markus Wienand. österreichischer Kollege, weiß nicht, ob den einige kennen, was wahrscheinlich viele mehr kennen, ist sein Blog, ist Use the Index, Luke, wo er nur über Indizes, Datenbanken, SQL schreibt und er hat so einen Klassiker aufgelegt, wo er SQLer erklärt in dem Buch und zwar für alle gängigen Datenbanken, DB2, Oracle, MySQL und so weiter und wo sind die Unterschiede und der macht viel Consulting, der macht Trainings und der ist halt nur auf diesem SQL-Zug, sitzt da oben und der ist hoch professionalisiert und spezialisiert auf SQL und der vertreibt sein Buch auch selbst zum Beispiel und der macht schon über das Buch auch Geld und macht natürlich über Consulting auch viel Geld, aber das Buch ist schon auch ein wichtiges Standbein von ihm. Ich habe mal mit ihm geredet und er hat gemeint, das macht schon einiges aus und ist auch ein wichtiger Teil von seinem Einkommen.",
            "start": 2377893,
            "end": 2537710,
            "confidence": 0.8071191489361705,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Würdest du Leuten empfehlen, ein Buch zu schreiben, die noch kein Buch geschrieben haben?",
            "start": 2538850,
            "end": 2543233,
            "confidence": 0.8292857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch da ist wieder die Frage, wenn du Cinex schon erwähnt hast, why? Warum willst du das schreiben? Willst du was lernen? Willst du das in deinem CV stehen haben? Willst du Geld damit verdienen? Bist du schon bekannter als Person, als Autor? Hast du schon Reichweite oder nicht? Dementsprechend ist dann auch die Frage eben mit Verlag, ohne Verlag, wie das ist. Aber grundsätzlich die Erfahrung, ein Buch zu schreiben, wenn man die Zeit investieren will und jetzt keinen Return im finanziellen Sinne erwartet, dann kann ich es nur empfehlen, weil man lernt natürlich extrem viel und diese Art zu schreiben und wie man Sachen einfach verständlich erklärt, das ist schon sehr wertvoll, meiner Meinung nach. Also das kann ich schon empfehlen, aber wenn es jemand fürs Geld macht oder so, würde ich es auf keinen Fall empfehlen. Und die andere Frage ist, wie viele Bücher heutzutage noch gekauft werden, muss ich ganz klar sagen. Diese Verlage existieren alle noch, aber keine Ahnung, wie gut es denen, ehrlich gesagt, geht. Also meiner Meinung nach muss das stark zurückgegangen sein. Wer kauft heutzutage so ein Standardwerk MaisQL? Bin ich mir nicht sicher, ob es da noch so viele gibt, wenn du online gehen kannst auf YouTube und da 10 Stunden groß gratis bekommst MaisQL mit Video und allem drum und dran. Oder würdest du jetzt einem Einsteiger ein Buch empfehlen, wenn jetzt zum Beispiel jemand von deinem Team auf dich zukommt und sagt, hey, ich möchte Kafka lernen. Würdest du dann dem ein Buch empfehlen oder irgendwas anderes? Oder was würdest du empfehlen?",
            "start": 2543713,
            "end": 2624102,
            "confidence": 0.7789619771863119,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das klingt nach einer so simplen frage aber die frage ist alles andere als simpel weil ich denke dann immer drach okay wie lernt diese person am besten was ist denn das ziel kafka zu lernen ist es eine applikation zu schreiben ist es das konzept dahinter zu verstehen ist es zu kafka zu kontributen und abhängig von diesen fragen würde ich glaube ich andere sachen empfehlen, Bei den generellen Konzepten macht, glaube ich, ein Buch schon Sinn. Besonders, wenn du jetzt sagst, hier Appended Log und allem drum und dran, also zu verstehen, warum Kafka so performant ist und was der Unterschied zwischen Streaming und Message Queuing ist. Ich glaube, da macht ein Buch schon Sinn, wenn es darum geht, Kafka zu nutzen, Daten zu schreiben, Daten zu lesen, vielleicht mit KSQL oder Ähnliches zu hantieren und mehrere Topics zu joinen. Dann würde ich gegebenenfalls ein anderes Tutorial erwähnen, wenn es um die Administration geht. würde ich, glaube ich, eher so Learning by Doing machen. Fahr mal Cluster hoch, schieß mal eine Note weg und so weiter. Also deswegen, da würde ich je nach Ziel eine andere Empfehlung machen.",
            "start": 2624882,
            "end": 2684140,
            "confidence": 0.8099263157894742,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber es stimmt natürlich, manche Leute bevorzugen schon noch das Papier oder zumindest was Schriftliches und andere bevorzugen natürlich Videos, wie wir auch besprochen haben bei dem Knowledge Sharing. Da gibt es schon Unterschiede, wie Leute lernen. Das ist natürlich ein guter Punkt. Aber auch da frage ich mich, Wie viele werden in Zukunft noch Bücher kaufen? Und wenn ich dann eine Digitalversion kaufe, ist halt dann schon die Frage, ist das dann nur noch ein Buchformat? Das würde ich mir jetzt bei MySQL zum Beispiel auch fragen. Würde ich so ein klassisches Buchformat wählen? Oder würde ich vielleicht irgendwie was halb Interaktives, also im Sinne von, dass ich dieses Online-Medium zum Beispiel nutzen kann, dass ich irgendwie Links mache? Gewisse Sachen kann ich tiefer reingehen, wenn ich da noch nicht Bescheid weiß. Manche kann ich dann überspringen. Also das ist so ein bisschen wie so eine Online-Doku, aber doch kuriert und gefiltert und besser erklärt. Aber dass ich halt mir selbst dann auswählen kann, wie gehe ich durch dieses ganze Dokument durch. Und da kann man dann vielleicht auch Videos einbauen zwischendrin, also so ein interaktives, multimediales Medium vielleicht, so wie man früher bei der CD gedacht hat, das wird die Zukunft, in Zukunft ist alles multimedial auf einer CD, vielleicht sowas im Internet, das würde mir persönlich jetzt eigentlich am am interessantesten vorkommen und wenn ich nochmal was schreiben würde, würde ich eigentlich in die Richtung vielleicht irgendwas gehen, aber auch das dann zu verkaufen und den Zugang kostenpflichtig zu machen und solche Dinge ist dann, glaube ich, schon schwierig und da fällt dann wieder viel auf Marketing zurück, wie gut ist dein Marketing und erreichst du Leute damit. Aber rein lerntechnisch ist, glaube ich, die bessere Lösung als ein ganz klassisches trockenes Buch.",
            "start": 2684180,
            "end": 2778177,
            "confidence": 0.7805844594594593,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn wir jetzt jemanden haben, den du noch nicht abgeschreckt hast und die Person möchte immer noch ein Buch schreiben, was wäre die Nummer 1 Empfehlung, die du dieser Person geben würdest, um das Ziel, ich habe ein Buch, zu erreichen?",
            "start": 2778917,
            "end": 2793543,
            "confidence": 0.8267560975609758,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, man kann auf jeden Fall mit Verlagen sprechen. Einfach die Verlage anschreiben und einfach mal nachfragen, ob sie Interesse haben. Das hat damals eben mein Co-Autor Stefan auch gemacht mit seiner Open-Source-Idee und die sind ins Gespräch gekommen. Man muss natürlich irgendwo ein Background aufweisen können wahrscheinlich. Also es hat bei uns natürlich super funktioniert. Wir forschen in Datenbanken auf der Uni, das war dann relativ easy. Also ganz bei null kann man wahrscheinlich nicht starten, außer man macht dann wieder eben im Selbstpublishing Da kann man natürlich immer bei Null starten und wenn man gut ist, wird man es auch irgendwie schaffen, muss halt viel in Marketing investieren. Aber ich glaube, die zwei Wege gibt es und dann würde ich am ehesten mit der Verlagsvariante starten und da bekommt man ja dann auch mit, ob das was Sinnvolles ist. Das ist so ähnlich, wie wenn man eine Idee hat, dass man möglichst schnell zu Investoren gehen soll, um Feedback zu bekommen. Weil wenn alle Investoren sagen, das ist eine dumme Idee, Und alle Verlage sagen, das ist eine dumme Idee, was du da schreiben willst, dann ist es vielleicht auch im selbst publizierenden Modus schwierig, wahrscheinlich die Audience zu finden, die Leute, die dann dafür zahlen. Also da ein Feedback zu bekommen, ist wahrscheinlich gar nicht so schlecht. Und vielleicht sagt ein Verlag, super Idee, wir suchen gerade jemanden, wir supporten auch junge Leute, so wie der Rheinberg Verlag. dann kannst du da ein Buch natürlich schreiben. Aber was man sich schon im Klaren sein muss, es ist ein großes Zeitinvestment und man bekommt gar nicht so viel raus am Ende, aber du lernst extrem viel. Im CV schaut es gut aus. Und vielleicht noch als Pro-Tipp Co-Autoren suchen, weil ich glaube alleine wäre ich da nie an ein Ende gekommen. Also da war schon Stefan und Eva sehr, sehr hilfreich und wir haben uns da halt gegenseitig auch motiviert. war auch teilweise sehr harte zeit also unsere bürokollegen haben teilweise ziemlich gelitten darunter die haben gemeint da sind oft die fetzen geflogen wie man bei uns sagt bei den streitgesprächen also die haben da viel mitgemacht, aber der outcome war dann glaube ich ganz gut dementsprechend aber es ist auf jeden fall eine harte zeit die man da durchmacht.",
            "start": 2793803,
            "end": 2908626,
            "confidence": 0.7975926892950393,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn du jetzt nochmal ein buch schreiben müsstest würdest du nochmal ein buch über ein spezifisches software mit versionen schreiben oder würdest du eher, etwas im Bereich generelle Konzepte und Co schreiben, was nicht so schnell veraltet und nicht an einen Software-Release-Zyklus gebunden ist.",
            "start": 2908646,
            "end": 2923353,
            "confidence": 0.7462954545454544,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das stimmt, das ist ein guter Punkt natürlich. Also wenn du jetzt irgendwas schreibst über Kommunikation, dann ist das sicher länger valide und gültig, als wenn du jetzt über die MySQL-Version 8.1.2.3 Alpha irgendwas schreibst. Das stimmt natürlich, da hast du natürlich auch bessere Chancen. Umso allgemeiner, umso besser natürlich. Aber ich glaube, auch da ist es dann natürlich schon schwierig konkurrenztechnisch. Es gibt ja schon sehr viele Sachen, die gecovert sind. Also da musst du schon eine Nische finden, wo das wirklich gut funktioniert. Oder du hast halt so ein Spezialwissen, dass das auch gut funktioniert. Aber auf der anderen Seite, umso spezieller das Wissen, umso schwieriger ist es, wieder Leute zu finden, die das weil wenn du jetzt ein Hardcore MySQL-Performance-Buch schreibst, dann ist es halt auch schwierig, Leute zu finden, die das überhaupt lesen und brauchen. Du bist natürlich mit einem allgemeinen Buch, wie wir es geschrieben haben, viel besser dran, weil das halt viel breitere Masse anspricht natürlich. Oder wenn du jetzt anschaust, dieses neue Observability-Buch von Rayleigh, das ist schon sehr speziell natürlich, aber ist auf Englisch und hat dadurch wahrscheinlich eine ganz gute Audience und ist fast ja auch ein Werbebuch, muss man auch ganz klar dazu sagen für die Autoren.",
            "start": 2923634,
            "end": 2990555,
            "confidence": 0.7865845410628018,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber auch da können die Autoren einen sehr guten Background vorweisen mit Honeycomb und einer doch sehr erfolgreichen Plattform im Bereich Observability.",
            "start": 2991476,
            "end": 3001130,
            "confidence": 0.8330454545454543,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Eben, also ich sehe das, das ist halt für Honeycomb und die Autorinnen ist das halt fast ein Werbebuch und die haben das auch geschrieben, nicht damit sie dieses Geld bekommen, weil auch da über O'Reilly kann man nicht vorstellen, dass das extreme Summen einspielt, sondern das ist halt für sie eine Werbung und für die Firma und um auch in der Szene einfach einen Grundstein zu setzen, die wollen ja auch dieses Wort Observability einfach prägen. und vielleicht in die Geschichte eingehen und ich glaube, dass das eher im Hintergrund steht und weniger die finanzielle Seite. Also wie gesagt, ich glaube ganz allgemein finanziell ist es eher Seltenheit, dass du viel verdienst mit einem Buch.",
            "start": 3001860,
            "end": 3040576,
            "confidence": 0.8105344827586209,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Thema Ghostwriter. Bist du damit schon mal in Berührung gekommen, dass du einfach jemandem bezahlst, der für dich ein MySQL Buch schreibt und deinen Namen darunter setzt?",
            "start": 3040616,
            "end": 3047520,
            "confidence": 0.6765925925925926,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie gesagt, der Verlag hat uns das angeboten, dass eben der Vierte dazukommt. Wir bleiben am Buch, der macht die Veränderungen, die Updates und man macht sich dann irgendwie so einen Schlüssel aus. Das war so die Idee von dem Verlag. Er war kein echter Ghostwriter. Da habe ich dann auch gesagt, okay, ich würde gerne nicht mehr am Buch stehen, weil ich dann zu wenig Einfluss habe und mein Name, ich möchte nicht mehr, dass mein Name oben steht. Aber zu dem ist es eh gar nie gekommen. Es war also auch nicht so einfach. Darum habe ich da keine Erfahrung diesbezüglich, aber auch einen richtigen Ghostwriter, obwohl ich jetzt viele wissenschaftliche Arbeiten geschrieben habe. Ich habe sie alle selber geschrieben, habe nie einen Ghostwriter gehabt, auch nicht für meine Doktorarbeit. Insofern habe ich da keine Erfahrung damit. Ich habe nicht mal Erfahrung mit irgendwie SEO-Texten von anderen Leuten, auch wenn ich weiß, dass das der Standard ist und viele Leute machen. Auch da habe ich eigentlich keine Erfahrung, wie gut das funktioniert. Wie schaut es bei dir aus? Hast du mal irgendwie Kontakt gehabt? Für deine, für deine Bachelorarbeit zum Beispiel, welcher Ghostwriter hat dir das geschrieben? Das war ja so Open Source Zeug und Open Source Mining, oder? Hast du da überhaupt eine Ahnung?",
            "start": 3048200,
            "end": 3110144,
            "confidence": 0.7150000000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mir wurde das schon mal angeboten, dass meine Bachelorarbeit mir Ghost geschrieben wird, ja.",
            "start": 3110164,
            "end": 3116867,
            "confidence": 0.7705714285714285,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Damals, wie du die geschrieben hast.",
            "start": 3116887,
            "end": 3119188,
            "confidence": 0.596,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jaja, ganz genau. Und ich glaube, die Grundidee war, dass erst eine wissenschaftliche Arbeit von 10 Seiten oder sowas darüber geschrieben wird. Habe ich aber nie in Anspruch genommen, weil ich persönlich halte davon nichts.",
            "start": 3119768,
            "end": 3132607,
            "confidence": 0.8331714285714286,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was hätte das gekostet?",
            "start": 3132647,
            "end": 3133528,
            "confidence": 0.728,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das weiß ich gar nicht mehr, muss ich wirklich, ich glaube über Preis haben wir gar nicht so wirklich geredet, weil das von vornherein für mich einfach nicht in die Tüte kommt. Ich denke, wenn man einen akademischen Abschluss haben möchte, muss man auf die Arbeit investieren, auch wenn du sagst, man wätscht als Studienabbrecher. Aber ich denke wirklich, jeder der da versucht irgendwie einen kurzen Weg zu gehen, hat in der langen Sicht mehr Nachteile, weil im Endeffekt Mein Studium war sehr sinnvoll für meine berufliche Karriere und auch das Wissen. Von daher denke ich, jeder der versucht da irgendwie einen Abgezug zu nehmen, schießt sich einfach nur selbst ins Knie.",
            "start": 3134114,
            "end": 3164907,
            "confidence": 0.7466696428571425,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie man ja auch bei vielen Politiker sieht mittlerweile. Irgendwann kommt es dann raus.",
            "start": 3164927,
            "end": 3169011,
            "confidence": 0.6517142857142858,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich sehe das ja auch bei sehr vielen Leuten, die sich mit ihrem IT- und Projektmanagementstudium und so weiter und so fort brüsten und dann im Job ganz offensichtlich keine Ahnung von Toten und Blasen haben.",
            "start": 3169732,
            "end": 3180202,
            "confidence": 0.8335555555555555,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das gibt es auch bei genug Leuten, die die selber geschrieben haben. Also das eine ist natürlich keine Garantie, dass jemand dann gut ist in dem Feld, nur weil er das selber geschrieben hat. Es gibt ja auch verdammt schlechte Arbeiten. Und nachdem ich viele Arbeiten betreut habe, weiß ich ja, dass es nicht nur gute Arbeiten gibt. Und keine Ahnung, ob die Ghost-gewritet waren damals. Aber ich hoffe, dass man dann eine bessere Arbeit bekommt, wenigstens, wenn sich ein Ghostwriter schreibt.",
            "start": 3180862,
            "end": 3203648,
            "confidence": 0.7797108433734941,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das ist ein gutes Stichwort. Ein gutes Stichwort, um den Podcast zu beenden. Sehr, sehr spannend. Besonders...",
            "start": 3204409,
            "end": 3212058,
            "confidence": 0.7363684210526317,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie bist du jetzt von Ghostwriter? Was hat Ghostwriter mit Podcast beenden zu tun?",
            "start": 3212078,
            "end": 3216304,
            "confidence": 0.6321428571428571,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich ghoste dich jetzt.",
            "start": 3216344,
            "end": 3217265,
            "confidence": 0.5235,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ah, okay. Okay, passt.",
            "start": 3217729,
            "end": 3219690,
            "confidence": 0.376,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sehr, sehr spannend, den Einblick, besonders ins Finanzielle. Finde ich eigentlich schade, dass es das alles so schlecht verdient ist, beziehungsweise dass der Vorteil dann wirklich nur Lebenslauf technisch und Reputation ist und man dann natürlich den Ball Volley nehmen muss und daraus dann selbst noch eine Karriere bauen muss. Und das scheint ja dann auch jetzt nicht von alleine zu kommen, sondern noch sehr viel Arbeit zu investieren, damit man.",
            "start": 3219710,
            "end": 3245784,
            "confidence": 0.8661267605633802,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "... There is no free lunch.",
            "start": 3245794,
            "end": 3246685,
            "confidence": 0.31033333333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ich dir jetzt so zuhöre, bin ich mir gar nicht sicher, ob das ein super Marketingkanal ist oder nicht, weil du investierst halt sehr, sehr viel Zeit upfront. Dann weißt du nicht, ob das Buch sich verkauft. Und dann, also wenn Punkt 1 und Punkt 2 schon erfolgreich waren, dann kannst du erst eine Art von Karriere und Reputation um dein Buch bauen. Und dann musst du immer noch Zeit investieren, um das Geld zu verdienen. Also, das klingt für mich sehr viel, dass fünf Sachen hintereinander erfolgreich sein müssen, bevor du dann einen richtigen Benefit daraus ziehst. Und das frage ich mich dann.",
            "start": 3247245,
            "end": 3281489,
            "confidence": 0.814771428571428,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, es ist so ähnlich wie bei einem Side-Project oder bei einem Produkt, was du anfängst. Du weißt natürlich erst danach, ob es wirklich funktioniert, nach dem ganzen Marketingaufwand. Das ist halt ein Investment, was du machst. Und sonst hast du halt viel dabei gelernt. Das ist beim Buch selber. Du hast viel dabei gelernt, wenn es nicht erfolgreich ist. Und wenn du es mit einem Verlag zusammen machst, die haben schon Ahnung und die kümmern sich schon darum. Also, dass da eine absolute Niete dann rauskommt, ist wahrscheinlich eher unwahrscheinlich.",
            "start": 3281589,
            "end": 3306257,
            "confidence": 0.708065934065934,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei natürlich der Unterschied ist, bei der Produktentwicklung hast du diverse andere Methoden, eine frühe Evaluation zu machen, wohingegen bei einem Buch du nur das Feedback von dem Verlag hast und der Verlag sagt, okay, würde ich machen oder würde ich nicht machen, wohingegen du bei Produkten natürlich schon sehr, sehr früh auch Geld einnehmen kannst. Und was beim Buch dann halt einfach nicht ist beim Buch, erst wenn es fertig ist.",
            "start": 3306297,
            "end": 3329843,
            "confidence": 0.7637916666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das stimmt, aber du kennst ja auch die Marktlage. Also bei irgendeiner technischen Software kannst du ja auch gut einschätzen, wie weit verbreitet die ist und ob da ein Buch funktioniert. Also die Verlage machen da schon auch im Hintergrund ein bisschen Research und hören sich da um. Also es ist nicht so, dass man da absolut mit Null startet. Da hat man schon einen ganz guten Partner mit so einem Verlag, muss man auch ganz ehrlich dazu sagen.",
            "start": 3329863,
            "end": 3351742,
            "confidence": 0.7846835443037976,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ich mir das alles so anhöre, würde ich jedoch in die Selbstpublishing-Ecke gehen. Das bedeutet, ich würde mir vielleicht ein halbes Jahr, dreiviertel Jahr, ja, eine Twitter-Audience aufbauen, mir ein Profil machen, weil auch diese Audience kann man sich natürlich dann später anders zunutze machen. Und dann vielleicht durch irgendwelche Online-Tools im Selbstpublishing gehen. Leanpub ist, glaube ich, so was. Du kannst auch in die Richtung gehen, okay, zahle, was du möchtest, aber mindestens fünf Dollar. Oder, wie Peter Leavers es gemacht hat, mit seinem Bootstrapper-Book, mit dem Early Access. Das bedeutet, da haben Leute gezahlt, bevor überhaupt Kapitel geschrieben wurden, und er hat dann Feedback von den Kapiteln bekommen und so weiter und so fort. Also, ich glaub, ich würd eher die Route gehen, weil es vielleicht näher an dem Zyklus einer oder eines Produktentwicklung ist, und dann würd ich das Buch wirklich als Produkt sehen und nicht als Buch wie sterbende Verlage. sondern halt eher im digitalen sinne was nicht heißt dass das buch nur digital vertrieben werden muss es gibt ja auch wirklich es gibt zum beispiel amazon print on demand da kann ich dann mein buch drucken lassen wenn du es bestellt hast und das geht dann innerhalb von drei tagen raus also das gibt gibt es ja alles.",
            "start": 3352062,
            "end": 3420096,
            "confidence": 0.8032102803738318,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber da muss man schon noch ganz klar sagen, da sollte man sich irgendwo im Marketing auskennen, wie das so abläuft. Weil wenn man das noch nie gemacht hat, glaubt man gar nicht, wie viel Zeit das in Anspruch nimmt und ob man das auch machen will. Weil du schreibst dann sicher nur 50 oder weniger Prozent deiner Zeit an dem Buch und der Rest ist pures Marketing und Online-Vertrieb. Also da hast du wahrscheinlich über die Hälfte Marketing und das muss dann allen im Klaren sein, dass das auch bedeutet und man diese Zeit investieren muss. Und da bin ich mir nicht sicher, gerade wenn es technische Leute sind, ob man da so viel Spaß dran hat. Also damals, wenn wir das selbst gepublished hätten und gestartet hätten mit so einem Selbstmarketing, dann bin ich mir sicher, dass wir nie auf diese Verkaufszahlen gekommen wären. Vor allem, weil ich damals zum Beispiel auch viel weniger Ahnung hatte über dieses Ganze, wie man eine Audience aufbaut, online, auf Twitter und so weiter. Und was wir jetzt zum Beispiel auch mit dem Podcast machen. Also das muss man schon auch lernen und die Lust dazu haben und Spaß daran zu haben. Und ich kenne halt ganz viele technische Leute, die keinen Spaß daran haben. Und das muss man sich halt immer vor Augen führen und damit da jetzt nicht jemand sofort anfängt, irgendwie ein Buch zu schreiben und glaubt, morgen kommen dann ganz viele Leute und zahlen dir Geld dafür.",
            "start": 3420777,
            "end": 3492512,
            "confidence": 0.8117630522088357,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Morgen nicht, aber übermorgen.",
            "start": 3493192,
            "end": 3494812,
            "confidence": 0.58075,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Im Idealfall, ja. Aber lasst uns mal wissen, ob ihr überhaupt noch Bücher konsumiert in irgendeiner Form, ob das für euch ein Thema ist, oder ob Bücher einfach schon tot sind. Wie immer unter stetisch at engineeringkiosk.dev. Ganz klar, stetisch, so wie der Tisch, auf dem man isst, weil wir haben gerade ein Feedback bekommen, das viele Leute stetig verstehen. Stetisch at engineeringkiosk ist der Stetisch. Stetisch at engineeringkiosk.dev, Twitter, ING Kiosk, wie immer. Und wir würden uns wirklich mal freuen, wenn wir eine Voice Message bekommen. Ich kann mal die Nummer ansagen, das ist plus 4915678136776. Ganz einfach zu merken, steht aber natürlich auch in den Show Notes. Wenn ihr uns da mal eine Message schreiben könntet auf WhatsApp oder eine Voice Message senden oder auch bei E-Mail eine Voice Message, wir würden das nach Rücksprache einbauen, würden uns aber wirklich freuen, wenn wir da mal Feedback bekommen und dementsprechend das auch in die Episoden einbauen können in Zukunft.",
            "start": 3494852,
            "end": 3550646,
            "confidence": 0.79269375,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Am liebsten hätte ich natürlich gerne so richtig geile Audio Rants, wo wir mal richtig schön einen auf die Nase bekommen. Wo jemand mal richtig Feedback für uns hat, wo wir nicht schlafen können und noch eine Nacht drüber nachdenken müssen.",
            "start": 3551026,
            "end": 3563396,
            "confidence": 0.8179512195121952,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, dir reichen die ganzen Reddit und E-Mail Rants noch nicht, oder?",
            "start": 3563437,
            "end": 3567520,
            "confidence": 0.6920833333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Von meinem letzten Reddit-Rant, wo ich ja gebasht wurde vom Moderator, hab ich dann mal die Faktenlage zusammengetragen, hab ich die dann mal rüber gesendet und was ist passiert? Logisch, ich habe keine Antwort gehört. Ich mag es nicht, wenn Leute mir was an den Kopf werfen, ich antworte objektiv und da kommt einfach nichts zurück. Das geht mir gegen den Strich. Ich wollte gerade sagen, hart auf den Sack, aber gegen den Strich. Naja, soviel dazu. Wir beenden diese positive Buchfolge jedoch nicht so negativ, sondern wünschen euch einen schönen Tag und denkt doch mal ein bisschen drüber nach, ob ihr ein Buch jetzt schreiben wollt oder nicht. Herr Wolfgang hat unglaublich gute, viele Tipps für euch und ist bestimmt für die eine oder andere Frage nochmal offen, falls ihr da mehr wissen wollt.",
            "start": 3567900,
            "end": 3614357,
            "confidence": 0.812792592592593,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auf jeden Fall. Bis bald. Ciao.",
            "start": 3614397,
            "end": 3616378,
            "confidence": 0.6915,
            "channel": null,
            "speaker": "B"
        }
    ],
    "confidence": 0.7865968992248038,
    "audio_duration": 3621.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}