{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/11242e21-b242-48d0-b0b6-9e0170d80c49/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62xcw7w58o-999d-4a5a-a6e2-e5499ed9c22f",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zur Episode 39 vom Engineering Kiosk. Normalerweise haben wir ein Thema, was die Episode bestimmt. In dieser Episode spielen wir etwas mit dem Format und beschäftigen uns mit vier Themen, die uns als Userfragen zugespielt wurden. Es geht dabei um den Unterschied von Software Developer und Software Engineer, ob alles, was auf GitHub gehostet ist, automatisch Open Source ist, ob wir Git wirklich so dezentral nutzen, wie es gedacht ist und wie unser Home Office so aussieht. Viel Spaß dabei! Alle guten Dinge sind zwei, oder? Und deswegen versuchen wir... Moment, bei euch.",
            "start": 4011,
            "end": 40561,
            "confidence": 0.8307553191489359,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In Duisburg sind alle guten Dinge zwei?",
            "start": 40581,
            "end": 43184,
            "confidence": 0.7565714285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bei uns in Duisburg sind wir froh, wenn wir überhaupt was geschafft kriegen, siehe den Duisburger Hauptbahnhof.",
            "start": 43224,
            "end": 47108,
            "confidence": 0.6976470588235293,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also alle guten Dinge sind eins bei euch.",
            "start": 48147,
            "end": 51050,
            "confidence": 0.6416249999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Alle guten Dinge sind, wenn wir mal anfangen. Aber heute machen wir mal alle guten Dinge sind zwei. Denn heute versuchen wir das Format der gemischten Tüte endlich mal einzuführen. Wir haben die ganze Sache erfolglos in Episode 36 versucht.",
            "start": 51070,
            "end": 65545,
            "confidence": 0.8415249999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, weil du so viel redest und nicht mehr aufhörst zu reden, wenn man dir eine Frage stellt. Ich hab sogar am Ende von der Episode dich wieder rausschneiden müssen, weil du bei einer ganz kurzen Frage, die man mit einem Satz beantworten sollte, wieder irgendwie vier Minuten oder so geantwortet hast.",
            "start": 67266,
            "end": 82998,
            "confidence": 0.7481346153846155,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sprach er und redete mir rein.",
            "start": 83800,
            "end": 85281,
            "confidence": 0.7115,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du warst bei der gemischten Tüte.",
            "start": 86441,
            "end": 88242,
            "confidence": 0.6211666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gemischte Tüte. Was ist eine gemischte Tüte? Früher bin ich immer zum Kiosk gegangen, hab eine D-Mark oder zwei D-Mark auf den Tresen gelegt und konnte mir dann von den Süßigkeiten eine gemischte Tüte aussuchen. Ich hätte gern zwei Cola-Kacher, drei saure Zungen und so weiter. Zwei weiße Mäuse, die waren immer klasse. Aber Lakritz war nie dabei.",
            "start": 88282,
            "end": 107372,
            "confidence": 0.851,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist gut, wer will sowas?",
            "start": 107992,
            "end": 112475,
            "confidence": 0.6436666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich weiß auch nicht, ich mag auch keinen Lakritz, aber es gibt auch Leute, die mögen Kaiserschmarrn mit Rosinen.",
            "start": 112975,
            "end": 118398,
            "confidence": 0.8147894736842105,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist einzig wahre.",
            "start": 118418,
            "end": 120979,
            "confidence": 0.45575,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Deswegen versuchen wir heute erneut das Format der gemischten Tüte zu etablieren.",
            "start": 121019,
            "end": 125522,
            "confidence": 0.8431666666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und statt den weißen Mäusen haben wir intelligente Fragen von unserer Hörerschaft, die wir versuchen zu beantworten.",
            "start": 125881,
            "end": 133343,
            "confidence": 0.8874117647058823,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Diese Fragen haben wir über Zeit gesammelt. Wir haben diese Fragen auf verschiedene Arten und Weisen bekommen, via E-Mail, via Twitter, manchmal auf Meetups oder Ähnliches. Und wir maintainen eine lange Liste von diesen Arten von Fragen, wo wir uns dann immer ein Thema rauspicken, über das wir hier im Podcast sprechen.",
            "start": 133723,
            "end": 150088,
            "confidence": 0.7925192307692306,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, falls ihr eine Frage habt, bitte nur her damit, wir beantworten sie dann irgendwann mal.",
            "start": 150933,
            "end": 155697,
            "confidence": 0.72,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir versuchen diese Fragen zu timeboxen, irgendwas so zwischen 10 und 15 Minuten und dann springen wir zum nächsten. Ich würde sagen, springen wir mal direkt rein. Die erste Frage, die wir bekommen haben, ist Wolfgang, was ist der Unterschied von einem Software-Developer, Developerin und einem Software-Engineer, einer Software-Ingenieurin?",
            "start": 155717,
            "end": 173273,
            "confidence": 0.8076326530612246,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Heißt es eigentlich Developer oder Developper? Das frage ich mich die ganze Zeit. Das sagen mittlerweile so viele Leute Developer, dass ich schon glaube, es ist richtig, aber ich kann mir das eigentlich nicht vorstellen. Aber das ist ein anderes Thema, du brauchst es jetzt gar nicht beantworten. Die Frage kam von von Nils und wir hatten die schon versucht in einem Satz zu beantworten, also ich habe sie in einem Satz beantwortet in Folge 36, du in vier Minuten, die ich dann rausgeschnitten habe, also lass ich dir mal den Vortritt, du kannst jetzt deine vier Minuten, ich könnte einfach die vier Minuten reinschneiden jetzt vom letzten Mal, das wäre ja noch einfacher, aber ich lass dir mal den Vortritt. Vielleicht noch mal zur Erinnerung, meine Einsatzantwort war, es gibt keinen Unterschied zwischen Software-Developer und Software-Engineer.",
            "start": 174107,
            "end": 216576,
            "confidence": 0.7299781021897811,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das challenge ich ein bisschen, denn es gibt keine industrieweite Definition von Software-Developer und Software-Engineer und auch in Job-Descriptions wird der Begriff austauschbar behandelt. Ich denke, mehr und mehr Job-Descriptions gehen von Software-Developer zu Software-Engineer mit der These, dass sich das sehr wahrscheinlich professioneller anhört. Persönlich denke ich, der Unterschied ist, dass ein Software-Ingenieur wirklich, ich nenne es mal, Ingenieurshaft an die Arbeit rangeht und das Handwerk mit einer professionelleren Brille betrachtet. Was meine ich damit? Ich meine damit, ein Design-Dokument schreibt, also man bekommt eine Anforderung und dann denkt man wirklich mal einen Tag, zwei oder länger darüber nach, wie baue ich das dann am besten. man schreibt die Anforderungen mal auf, man dokumentiert sie, man schreibt ein Design-Dokument, man geht verschiedene Arten, verschiedene Lösungsarten durch, man schreibt Pro und Con auf für welche Lösungsart, man hat dann wirklich, ich nenne es mal auch einen Decision-Log, also einen Entscheidungs-Log, warum man welche Lösung denn auch wirklich verworfen hat. Damit man nämlich später sagen kann, in zwei Jahren, ja das ist ja alles scheiße, warum haben wir es damals nicht so gemacht, dann kann man diese Vorarbeit, die ein Software-Engineer macht, dann wieder raus von sagen okay die rahmenbedingungen damals waren ganz anders und hier ist die grundlage weswegen wir uns für die aktuelle lösung.",
            "start": 216616,
            "end": 297872,
            "confidence": 0.8165627906976743,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Entschieden haben aber ist das nicht ist das nicht eher ein senior engineer also wo würdest du jetzt wenn du eine job anzeige siehst software developer würdest du jetzt sagen die leute die sich dort bewerben haben alle diese fähigkeiten nicht oder wo ist der unterschied zwischen einem senior software developer und senior software engineer siehst du dann irgendwo einen unterschied Also mir kommt ja fast vor, das ist diese krankhafte, okay krankhafte lasse ich weg, wenn ich das mit Deutschland verbinde, also diese Hochhebung des Begriffes Ingenieur, Ingenieur in Deutschland, die ihr so gerne betreibt und das Ingenieurswesen so wichtig sei und dass ihr in Deutschland so die großen Ingenieure seid. Bei uns ist das fast ein Schimpfwort in Deutschland, wenn man Titel Ingenieur hat, so ein billiger Titel, den man relativ billig bekommt.",
            "start": 297892,
            "end": 343831,
            "confidence": 0.7538592592592591,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man sagt ja auch German Engineering. haben senior software developer diese fähigkeiten nicht natürlich haben sie diese fähigkeiten und ich sage ja auch dass der begriff austauschbar.",
            "start": 343851,
            "end": 353880,
            "confidence": 0.7627777777777778,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Verwendet wird aber warum willst du dann dann überhaupt einen unterschied rein reklamieren wenn sie sowieso austauschbar sind und so verwendet werden und niemand dann großen unterschied sieht außer dass es cooler klingt das ist nämlich auch meine Meinung dass es glaube ich nur cooler klingt mittlerweile zumindest im deutschsprachigen raum im englischsprachigen raum bin ich mir gar nicht sicher und darum wird es einfach mehr verwendet.",
            "start": 353900,
            "end": 376019,
            "confidence": 0.7578656716417911,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja gut aber alter weine neuen schläuchen auszuschenken hat machen wir jeden tag in der it also von daher.",
            "start": 376039,
            "end": 381463,
            "confidence": 0.7403157894736841,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das muss man nicht noch unterstützen.",
            "start": 381483,
            "end": 382684,
            "confidence": 0.6423333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also jeder, der sagt irgendwie Microservices ist super was Neues. Nee, ist nicht was Neues. Wir haben halt nur neuere Tools mit Sidecar Patterns und Service Meshes und blablabla drumherum. Und deswegen, warum sollen wir da bei Titeln aufhören? Ich stimme dir zu, dass der Unterschied wirklich schwammig ist, ja? Und sollte man einen Job ablehnen, weil man dann Software Developer heißt? Nein, sollte man nicht. Denn ich denke, es kommt ganz auf die Philosophie und auf den Qualitätsanspruch des Arbeitgebers an, aber auch den Qualitätsanspruch, den man selbst an den Tag legt. Natürlich gibt es auch 10, 20, 30 oder mehr Prozent an Software-Developer, die auch Design-Dokumente schreiben.",
            "start": 383268,
            "end": 420682,
            "confidence": 0.7924311926605505,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn du jetzt einen Job ausschreiben würdest, was würdest du verwenden? Welchen Begriff für einfach einen Entwickler oder Entwicklerin, die du suchst?",
            "start": 421482,
            "end": 429670,
            "confidence": 0.7016363636363635,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Software-Engineer. Ich denke halt, dass der Wandel des Begriffes von Software-Developer nach Software-Engineer sich gegebenenfalls auch ein bisschen an dem Wandel der Welt drumherum orientiert. Wo früher immer IT eine Kostenstelle war, ist das heute der Innovationstreiber in der Firma. Und wo früher man gesagt hat, okay, da Software-Developer, das sind nur die Nerds im Keller, und die kann es ja keinem Kunden zeigen, hat sich das ja jetzt auch gewandelt. Und ich denke halt, dass Software-Engineer, der Begriff des Software-Engineers das auch ein bisschen unterschreibt.",
            "start": 430194,
            "end": 462004,
            "confidence": 0.8270116279069769,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, ich bin auf jeden Fall gespannt, was unsere Community so auf Twitter dazu zu sagen hat.",
            "start": 462825,
            "end": 468090,
            "confidence": 0.777705882352941,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das zieht sich natürlich auch in Backend-Developer, Backend-Engineer, Frontend-Developer, Frontend-Engineer. Ja, also ich meine, die machen die gleiche Arbeit, so ist das nicht.",
            "start": 468130,
            "end": 475757,
            "confidence": 0.7274166666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich sag nur deutsche Ingenieurskunst. Aber gehen wir mal zum nächsten Punkt, zur nächsten Frage.",
            "start": 476337,
            "end": 481239,
            "confidence": 0.8284666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, ich glaub, das ist ein Streitthema, da kommen wir nie bei, ne? Naja, ist ja auch okay. Okay, die nächste Frage, die uns erreicht hat, war folgendes. Ist eigentlich alles, was auf GitHub ist, open source und darf ich das einfach so verwenden? Also im Videostream grübelt der Wolfgang gerade.",
            "start": 481299,
            "end": 498086,
            "confidence": 0.8045490196078432,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich erinnere mich jetzt gerade, dass einer unserer Hörer, der Simon, mir mal geschrieben hat, dass wir in einer Folge so ungenau über Open-Source-Lizenzen gesprochen haben und dass das eigentlich viel komplexer sei. Jetzt bin ich fast zu ängstlich, diese Frage zu beantworten, weil ich wieder die Open-Source-Lizenzen durcheinander bringen könnte oder zu ungenau definieren könnte. Meine schnelle Antwort wäre, es ist alles zugänglich, das heißt es ist vielleicht open, aber nicht im Sinne von Open Source und Open Source Lizenzen, weil im Endeffekt muss man immer genau prüfen, was für eine Lizenz dahintersteckt, wäre meine Antwort in einem Satz. Also es ist ein privates Repository, aber dann habe ich sowieso keinen Zugriff.",
            "start": 499075,
            "end": 536685,
            "confidence": 0.7692389380530976,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir reden jetzt hier nur von Public Repositories.",
            "start": 536705,
            "end": 538526,
            "confidence": 0.7735,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist deine Meinung?",
            "start": 539656,
            "end": 541879,
            "confidence": 0.7605,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein, es ist nicht alles Open Source und es darf auch nicht alles verwendet werden. Nur weil der Quellcode öffentlich zugänglich ist und lesbar, heißt das nicht, dass du den Quellcode nehmen kannst und in deinem privaten oder kommerziellen Projekt nutzen kannst. Wenn keine Lizenz angegeben ist, dann unterliegt das immer noch dem klassischen Problem des Intellectual Properties. Und eine Lizenz muss nicht unbedingt immer nur durch ein dediziertes License-File angelegt sein. Das kann einfach auch so sein, dass in den Quellcodedateien im Header eine Lizenz drin steht oder irgendwo anders in dem Repository. Aber auch wenn der Quellcode bei einem GitHub-Repository Open Source ist, also der Source Code ist offen, heißt das nicht, dass der Code Open Source ist und mit dem zweiten Open Source meine ich unter einer Open Source Lizenz steht. Und auch wenn er eine Lizenz hat, heißt das nicht, dass diese Lizenz wirklich eine Open Source Lizenz ist.",
            "start": 541919,
            "end": 601756,
            "confidence": 0.8544901960784317,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und dann gibt's ja noch den Unterschied zwischen Free und Open Source und nur Open Source und Libre und die ganzen Geschichten. Also es gibt ja nicht mal die Open-Source-Lizenzen.",
            "start": 602656,
            "end": 614539,
            "confidence": 0.7588000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist richtig. Ich sag mal so, dass die gängigen Lizenzen im Open-Source-Bereich, eine MIT, eine BSD, eine GPL, eine Apache 2, das sind halt schon Lizenzen, die offiziell von den großen Organisationen als Open-Source-Lizenzen deklariert sind. Wenn es natürlich jetzt in diese Free Software und Libre Ecke geht, dann ist das alles natürlich nochmal ein bisschen spezieller aufgezogen und da geht es natürlich dann auch sehr speziell in diese GPL Ecke. Das bedeutet zum Beispiel, wenn ich eine GPL lizenzierte Software nutze und in meine Software mit einbaue, und die auch modifiziere, dann muss das Resultat ebenfalls unter GPL neu lizenziert werden. Dann kann ich die nicht einfach unter Apache 2 lizenzieren. Was es dann wiederum automatisch opensource macht, das ist bei der MIT-Lizenz zum Beispiel jetzt nicht der Fall. Die MIT-Lizenz oder Software, die unter MIT lizenziert ist, kann ich in meine Software einbauen, modifizieren und dann auch verkaufen.",
            "start": 614559,
            "end": 676025,
            "confidence": 0.8317218543046357,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und da hat eben der Simon, einer unserer Hörer, damals bei Folge 4 auch kritisiert, dass wir gesagt haben, dass GPL dann nicht so gern von Firmen verwendet werden, weil man da eben dann daraus auch wieder Open Source immer generieren muss. Und da hat er eben auch zu Recht gesagt, es stimmt nicht, dass Firmen da automatisch die Hände davon lassen. Und das beste Beispiel ist ja auch der Linux-Körner selber, der GPL ist und dementsprechend durchaus von Firmen verwendet wird.",
            "start": 677002,
            "end": 702912,
            "confidence": 0.8402073170731708,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist korrekt, aber da kommt es ja ganz drauf an, wie GPL-lizenziertes Software verwendet wird. Wenn ich das Endprodukt, nämlich den Linux-Kernel, einfach so nutze, dann kann ich den ja auch in mein kommerzielles Projekt mit einbauen. Wenn ich aber jetzt den Wolfgang-Kernel mache, und nutze den Source-Code vom Linux-Kernel und modifiziere den weiter und verkaufe den Wolfgang-Kernel danach. Das geht nicht, weil mein Wolfgang-Kernel muss ich dann unter GPL-Lizenz stellen.",
            "start": 703472,
            "end": 733447,
            "confidence": 0.8267638888888889,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und was ja heutzutage auch viel gemacht wird, und das haben wir ja gerade kürzlich besprochen mit Elasticsearch zum Beispiel, dass immer mehr diese Lizenzen kommen, die sagen, du darfst es zwar verwenden, außer wenn du ein Produkt damit baust und es als Service wieder anbietest. Es gibt ja auch zum Beispiel diese Kafka-Alternative Red Banda, sind ein Drop-In-Replacement und sind, glaube ich, in C geschrieben, wenn mich nicht alles täuscht. Auf jeden Fall nicht in Java. Und behaupten auch, sie sind schneller und die haben genauso die gleiche Lizenz. Darfst du natürlich anwenden, aber du darfst kein Service anbieten in der Cloud, weil das wollen sie für sich natürlich behalten, um irgendwie Geld zu machen mit der Software. Das ist ja mittlerweile ein ziemlich klassisches Pattern und auch verständliches, weil du halt damit noch irgendwo einen Revenue Stream hast von deiner Open Source Software.",
            "start": 734076,
            "end": 779388,
            "confidence": 0.7842482758620688,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nehmen wir doch mal das Beispiel von Elasticsearch. Elasticsearch hat einen Lizenzwechsel gemacht. Das bedeutet aber, dass alle vorherigen Versionen, die bereits released wurden, noch unter der alten Lizenz stehen. Das bedeutet, du könntest jetzt als Cloud-Provider die älteren Versionen von Elasticsearch immer noch betreiben als Cloud-Offering.",
            "start": 779928,
            "end": 796840,
            "confidence": 0.8034893617021276,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, was einmal unter einer Lizenz draußen war, kannst du natürlich nicht mehr zurückziehen und verhindern.",
            "start": 797242,
            "end": 803231,
            "confidence": 0.7911250000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ganz genau. Aber kommen wir nochmal zur Frage, ist denn alles, nur weil das auf GitHub jetzt öffentlich einsehbar ist, kann ich das denn nutzen? Die Antwort ist einfach nein. Und die Realität sieht da ein bisschen anders aus, weil die Leute nutzen einfach die Software und kaum, also die meisten kleineren Firmen werden jetzt keine Lizenzchecks haben über alle Dependencies. Wir hatten da auch schon mal in einer Episode drüber gesprochen, wie kompliziert es eigentlich ist, alle Dependencies von deiner Software herauszufinden. Da geht's dann natürlich unter anderem in das Thema Bill of Materials, sogenanntes BOM, was all dieses Inventar natürlich kategorisiert und was es dann durch Super macht. Aber es ist generell ein sehr schwieriges Thema zu wissen, welche Lizenzen eigentlich in deiner Applikation so alles verwendet werden. Sind diese Lizenzen überhaupt untereinander kompatibel? Ist das eigentlich überhaupt legal, was ich mache?",
            "start": 803271,
            "end": 854945,
            "confidence": 0.8321805555555556,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was auch ganz oft passiert ist, dass es gar keine Lizenz gibt, keine definierte Lizenz und damit ist es auf keinen Fall Open Source, nur weil der Source Code verfügbar ist. Damit ist es eigentlich automatisch proprietär und du darfst den Source Code nicht verwenden. GitHub hat da ja ein bisschen gegengesteuert, dass du automatisch jetzt angeboten bekommst, eine Lizenz zu kreieren, wenn du ein Repository erstellst. Aber es kann natürlich immer noch ein Repository irgendwo herumschwirren, das ganz praktisch ist, aber keine spezifische Lizenz definiert hat. Und das macht dann natürlich auch ein Problem im Zweifelsfall.",
            "start": 856003,
            "end": 889890,
            "confidence": 0.8011752577319586,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn man natürlich rechtlich auf der sicheren Seite sein möchte, ist das natürlich auch ein Problem, wenn ich ein Repository habe, wo keine Lizenz definiert ist. Dann kommt der Wolfgang, macht einen Pull-Request, somit haben wir beide Intellectual Properties dieser Software und danach setze ich einfach eine Lizenz drauf und stelle Wolfgangs Code, den er in die Software überführt hat, unter eine Open-Source-Lizenz.",
            "start": 889910,
            "end": 914543,
            "confidence": 0.8534603174603173,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was du eigentlich nicht mal darfst, weil es ja urheberrechtlich bei mir liegt.",
            "start": 915111,
            "end": 918973,
            "confidence": 0.7677692307692309,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ganz genau. Das bedeutet, wenn ich einen Lizenzwechsel habe oder eine Lizenz einführe, muss ich eigentlich die Erlaubnis von allen vorherigen Contributoren haben. Deswegen gibt es natürlich auch diese CLAs, ein Contributor License Agreement, was man bei sehr großen Projekten oft unterschreiben muss, bevor man einen Pull Request machen kann. Und die Details unterscheiden sich natürlich von CLA zu CLA, aber summa summarum steht da eigentlich drunter, okay, ich trete meine eigentlichen Intellectual Property-Rechte an dieses Projekt. Und an dieses Projekt ist entweder eine Association, eine Organisation oder, ja, eine Firma oder ähnliches ab, damit diese nämlich einen solchen Move später machen können. Und deswegen war ja unter anderem für größere Projekte wie Elastic es möglich, Lizenzen zu ändern, ohne das Agreement von den vorherigen Contributors einzukriegen.",
            "start": 919013,
            "end": 969468,
            "confidence": 0.8215433070866139,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ganz oft ist es ja auch, dass Projekte Dual Licensing fahren. Das heißt, sie haben einerseits eine Open Source License und dann aber auch eine proprietäre Lizenz, so wie MySQL. Und wenn du dann natürlich Contributions bekommst, dann wirst du die ja auch im Zweifelsfall für deinen proprietären Zweig mit einbinden, wenn das was Sinnvolles ist für dich. Und dadurch musst du natürlich auch so Agreements dementsprechend. Bei MySQL meines Wissens gibt es das auch abnicken.",
            "start": 970208,
            "end": 995778,
            "confidence": 0.7590131578947369,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es gibt auch recht viele Projekte, die sagen, du bist Privatanwender oder du machst mit der Anwendung meiner Software kein Geld, dann kannst du die nutzen. Wenn du diese kommerziellen nutzen möchtest, bitte frag bei mir an, dann gebe ich dir eine Erlaubnis oder schicke dir eine Lizenzkostenrechnung. Sowas gibt es auch, was natürlich dann im Endeffekt für die Frage bedeutet, ist eigentlich alles, was auf GitHub ist, Open Source und darf ich das verwenden? Die Antwort ist nein. Es muss eine Lizenz in dem Projekt definiert sein. Dann kommt es darauf an, was für eine Lizenz und wie sieht die aus? Es gibt offizielle Listen, die sagen, das ist eine offiziell anerkannte Open Source Lizenz. Jede Lizenz bringt Rechte und Pflichten mit, wie zum Beispiel Alles, was unter Apache 2 lizenziert ist, ist recht safe, weil man in der Apache 2 Lizenz sogar das Recht hat, die unterliegenden Patente mitzunutzen, falls diese Software irgendwelchen Patenten unterliegt. Somit passt ein bisschen auf, was ihr da nutzt. In der Realität kennen sich aber sehr, sehr wenige Anwälte damit aus, weil das ein sehr komplexes Thema ist, besonders wenn wir das ganze Thema weltweit spannen. Intellectual property ist in vielen Ländern einfach anders gehandhabt. In Amerika wird es anders gehandhabt als in Deutschland. Das soll jetzt hier keine Rechtsberatung sein, aber als Pragmatiker ist es auch oft so, wo kein Kläger, da kein Richter.",
            "start": 996738,
            "end": 1079765,
            "confidence": 0.8263922413793106,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oh, die österreichische Herangehensweise.",
            "start": 1079805,
            "end": 1081427,
            "confidence": 0.75325,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich würde halt sagen, passt ein bisschen auf, besonders wenn ihr größer werdet. Kommen wir zur Frage 3.",
            "start": 1081987,
            "end": 1088842,
            "confidence": 0.8073333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wer sich da näher informieren will, Wikipedia ist da natürlich ein guter Start, aber die Liste ist ewig lang von Licenses. Es gibt auch so Online-Projekte, die da ein bisschen helfen, so wie chooselicense.com oder unter opensource.org findet man auch einige Informationen zu den ganzen licenses. Creative Commons haben wir auch noch gar nicht erwähnt, aber auch die haben auf der Webseite so einen kleinen Wizard, wo man dann einstellen kann, was will ich eigentlich erreichen mit der License und am Ende wird die richtige License ausgegeben. Also da gibt es einige Hilfe im Internet, wo man ganz gut eigentlich damit starten kann.",
            "start": 1088852,
            "end": 1123259,
            "confidence": 0.8184807692307692,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir verlinken euch die entsprechenden Links in den Shownotes. Springen wir direkt weiter. Bleiben wir beim Thema Git. Wolfgang, die Frage 3 handelt um das Versionskontrollsystem Git selbst. Ist Git wirklich dezentral? Weil irgendwie arbeiten wir doch immer nur mit GitHub und wenn es down ist, gehen wir eh einen Kaffee trinken.",
            "start": 1124079,
            "end": 1145529,
            "confidence": 0.8108076923076926,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich verwende sowieso nur CFS.",
            "start": 1145589,
            "end": 1147289,
            "confidence": 0.5306,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du bist auch keine 20 mehr, ne? Aber die Frage hat einen wahren Kern, wenn Github wirklich down ist, wenn wir mal wieder das Github Unicorn kriegen, dann ist auf Twitter die Hölle los, Hacker News hat wieder einen Top Beitrag, Github ist wieder down und in letzter Zeit war das ja nicht wirklich selten, dass Github mal einen Hickup hatte.",
            "start": 1147449,
            "end": 1167267,
            "confidence": 0.7350163934426229,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wobei meistens die Suche eigentlich, die hat bei mir immer ein Problem. Verwenden sicher Elasticsearch im Hintergrund.",
            "start": 1167787,
            "end": 1173372,
            "confidence": 0.7794705882352941,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weiß ich nicht. Aber warum ist das so? Warum gehen wir immer Kaffee trinken, wenn GitHub direkt down ist? Weil im Endeffekt ist die Frage schon valider. Nutzen wir Git als dezentrales Versionskontrollsystem? zentral und nutzen wir dann eigentlich nur das Feature from Branchen und Mergen, was den Vorteil von Git gegenüber Subversion hat, weil irgendwie habe ich schon ein bisschen das Gefühl, dass sehr sehr viele Leute Git ähnlich wie Subversion nutzen und ohne zentralen Server, man kann schon arbeiten, aber man limitiert sich halt selbst.",
            "start": 1173412,
            "end": 1204783,
            "confidence": 0.8234252873563216,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube halt, dass GitHub ja auch viel mehr ist als Git. Git ist schon dezentral und du kannst es auch dezentral nutzen. Du kannst halt keine sinnvollen Pull-Requests in der Web-Oberfläche zum Beispiel machen. Das ist aber kein Git-Feature. Das ist halt alles, was GitHub rundherum gebaut hat. Eine coole Suche in dem Source-Code, die extrem schnell ist. Pull-Requests, Issues. Also alle Features rundherum und ich glaube, das macht eigentlich GitHub aus und darum ist es halt mittlerweile ein sehr zentrales System, das man auch nutzt und als zentrales System nutzt und das geht halt weit über das eigentliche Git hinaus. Der Sourcecode, nur weil du den Sourcecode lokal hast, hilft dir das halt nur geringfügig weiter, wenn du den richtigen Branch noch nicht ausgecheckt hast oder die ganzen Kommentare nicht dazu hast zum Pull-Request.",
            "start": 1205702,
            "end": 1253374,
            "confidence": 0.8046470588235294,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das ist korrekt, aber ich meine, natürlich können wir, wenn wir Git haben, wir können, auch wenn GitHub down ist, können wir lokal commiten, wir können lokal branchen, wir können lokal mergen. Und ja, im Vergleich zu Subversion konnten wir das nicht, denn jede Operation, so gut wie jede Operation hatte einen Kontakt zum zentralen Server.",
            "start": 1253754,
            "end": 1273305,
            "confidence": 0.819385964912281,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kannst du vielleicht für unsere junge Hörerschaft noch ganz kurz erklären, was SVN ist?",
            "start": 1273769,
            "end": 1278212,
            "confidence": 0.7815714285714287,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "SVN ist ein zentrales Versionskontrollsystem, was, ich würde schon fast sagen, in der Softwareindustrie als Vorgänger von Git gesehen wurde. Ich meine, es gibt natürlich neben Git auch noch Mercurial und Perforce und andere Versionskontrollsysteme, aber ... CVS? CVS war ja noch vor Subversion.",
            "start": 1278732,
            "end": 1299364,
            "confidence": 0.8275454545454547,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe gerade nachgeschaut, die aktuelle CVS-Version ist von 2008, aber ich kenne zumindest noch mindestens eine Organisation, die CVS verwendet.",
            "start": 1299724,
            "end": 1308752,
            "confidence": 0.746952380952381,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also Subversion haben wir, ich sage mal, vor Git verwendet und mit wir meine ich eigentlich die Industrie. Git gab es natürlich schon sehr, sehr lange, aber zu Room ist Git erst zu einem späteren Zeitpunkt gekommen. Subversion hatte die Eigenheit, dass jede Operation auch ein SVN-Log, was dann eigentlich ein Git-Log ist, also gib mir mal die letzten Comments, eine Kommunikation zum Server brauchte. Und als Git kam, Git hatte die Features von Branching und Merging als sogenannten First Class Citizen, also das war das Kernfeature eigentlich von Git. Man konnte branchen in Subversion, man konnte mergen in Subversion. Doch das war alles immer ein bisschen komplizierter und bei weitem nicht so einfach, weil diese Features im Nachhinein erst zu Subversion kamen. Und Git hat den ganzen Spieß ein bisschen umgedreht, besonders wenn es um Teamarbeit geht und Co.",
            "start": 1309853,
            "end": 1363997,
            "confidence": 0.8108785714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Weißt du, wann Git entwickelt wurde? Rat mal.",
            "start": 1364017,
            "end": 1367742,
            "confidence": 0.71825,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Git wurde schon sehr, sehr früh entwickelt. Keine Ahnung.",
            "start": 1367782,
            "end": 1370485,
            "confidence": 0.7046666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, wirf mal eine Zahl raus.",
            "start": 1371110,
            "end": 1372833,
            "confidence": 0.7486666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "1998.",
            "start": 1372843,
            "end": 1374085,
            "confidence": 0.5,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gar nicht so weit daneben, aber es war erst 2005, die erste Release. Ich hatte auch immer gedacht, das ist eigentlich älter, aber Linus ist da sehr spät damit um die Ecke gekommen.",
            "start": 1374095,
            "end": 1385211,
            "confidence": 0.8409393939393939,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So und das Riesenproblem war jetzt natürlich bei Subversion, wenn der zentrale Subversion-Server down war, konntest du wirklich gar nichts machen, du konntest noch niemals mehr committen. Und dann hat natürlich, dann kam Git und hier sagt, hey cool, wir sind ja jetzt dezentral und allem drum und dran, wir können ja jetzt ein Git-Log machen auf deiner lokalen Festplatte und man kann ja Committen und Branchen und Mergen und was weiß der Geier nicht. Und dann kam natürlich dieses Konzept von sogenannten Remotes. Das bedeutet, weil jeder ja eine komplette Kopie des Git-Repositorys hat, auf seiner lokalen Feststätte, müssen wir uns irgendwie organisatorisch drauf einigen, wo ist denn jetzt die richtige Git-Realität? Also, wo ist denn jetzt das, die Kopie des Git-Repositorys, welches wir als Team sagen, okay, das ist die Source of Truth, das ist unsere Software, diese Software liefern wir jetzt aus. Und dazu haben wir irgendwie GitHub wiedergemacht. Das bedeutet, wenn du mal ein bisschen weit rausgehst, kann man jetzt theoretisch die Behauptung aufstellen, GitHub ist unser zentraler Subversion-Server. Weil dort die verschiedenen Changes an den verschiedenen lokalen Kopien wieder zusammenfließen und womit wir kommunizieren. Obwohl wir natürlich GitHub gar nicht bräuchten. Das bedeutet, ich könnte mir jetzt einfach sagen, hey, öffne mal bitte Git-Port bei dir, Wolfgang, dann gib mir mal kurz deine Git-Remote-URL oder welche IP-Adresse ich dich bekomme oder unter gasla.dev und dann push ich dir meinen Branch rüber, genauso wie GitHub.",
            "start": 1386112,
            "end": 1471560,
            "confidence": 0.8050627615062758,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja und so ist es ja ursprünglich gemacht worden. Also es gibt ja nicht wirklich einen SVN-Port oder so, aber einfach klassisch SSH. Und das war genau die Idee früher. Du hattest einen Server und dort hast du mit SSH einfach deine Änderungen abgelegt und gepusht. Also alles das, was heutzutage über GitHub funktioniert, hat man früher einfach bei SSH gemacht oder machen vielleicht einige immer noch. Und darum läuft es ja im Hintergrund auch über SSH ab. Und darum verwendest du auch SSH-Keys, wenn du mit GitHub arbeitest, weil im Hintergrund ist einfach bei SSH abgelegt wird. Und so war auch die ursprüngliche Zusammenarbeit zwischen den Entwicklern, die dann Git verwendet haben. Und da hat es halt einen oder mehrere zentrale Server gegeben, genau. Und das gibt halt jetzt eine coole Web-Oberfläche oben drüber. Das ist eigentlich, was GitHub ausmacht.",
            "start": 1473305,
            "end": 1518638,
            "confidence": 0.8002765957446807,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist korrekt, aber hast du das Gefühl, dass das Feature von Git Remote oder von Remotes selbst von sehr vielen Entwicklern verstanden ist oder denken die, der Name Origin oder Upstream sind fixe Begriffe?",
            "start": 1518938,
            "end": 1533171,
            "confidence": 0.8445428571428572,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich frage mich immer, wie relevant das ist. Muss ich verstehen, wie mein Elektromotor von meinem Tesla funktioniert, nur weil ich einen Tesla fahre. Ich fahre übrigens keinen Tesla, aber...",
            "start": 1533732,
            "end": 1542976,
            "confidence": 0.6948387096774193,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist ein valider Punkt, aber kommen wir auf die Frage zurück. Ist Git wirklich dezentral, beziehungsweise nutzen wir die dezentralen Features von Git, oder ist es einfach nur valide, dass wir alle aufhören zu arbeiten, wenn Git up-down ist? Weil wir sagen, wir können nicht arbeiten, obwohl wir arbeiten könnten.",
            "start": 1542996,
            "end": 1560363,
            "confidence": 0.7766274509803922,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube schon, dass man die dezentralen Features auch nutzt, weil jeder, der mal SVN verwendet hat, weiß, dass das schon anders abläuft und mit den sauberen Branches und dass man da wirklich lokal auf der KUBI arbeitet und mehrere Branches hat und da auch wechseln kann. Und alle diese Dinge, die ja sehr stark sind bei Git, ist jetzt die Frage, ob das ein dezentrales Feature ist an sich. Aber diese Features werden schon stark genutzt. Also ich würde schon sagen, grundsätzlich Vermute ich zumindest, dass den meisten Entwicklerinnen schon klar ist, dass das dezentral ist und die auch in gewisser Weise das so nutzen. Aber wie gesagt, es ist halt viel mehr, was GitHub ausmacht und anbietet. Und ich glaube, das ist der große Unterschied, weil wenn deine Idee nicht funktioniert, kannst du auch nicht programmieren, obwohl der Source-Code vielleicht da ist. Also du brauchst halt gewisse Tools und GitHub ist halt mittlerweile auch ein Tool geworden, vor allem wenn es darum geht, zusammenzuarbeiten. Und da brauchst du halt die Kommentare, weil wie willst du deinen Pull-Request verbessern, wenn die Kommentare fehlen von deinem Review, von deinem Code-Review?",
            "start": 1561218,
            "end": 1622372,
            "confidence": 0.8012251308900522,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Code-Reviews werden gemacht von Leuten, die nicht an sich glauben. Wir machen Main-Based Development, Master-Based Development. Achtung, wer den Begriff Trunk-Based Development schon mal gehört hat, dieser kommt aus dem Bereich Subversion, weil in Subversion war eigentlich das ungeschriebene Gesetz, dass der Master-Branch beziehungsweise der Main-Branch Trunk hieß. Nur mal so als kleine Story aus dem Krieg.",
            "start": 1622412,
            "end": 1648312,
            "confidence": 0.8138421052631576,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und weil wir gerade Code Reviews erwähnt haben, wir haben da eine eigene Episode dazu gemacht, Episode 16 zu Code Reviews, da gehen wir natürlich auch auf ein paar Dinge in dem Bereich ein. Was ich übrigens kürzlich gerade erfragt habe oder gehört habe, dass in der Gamebranche SVN noch sehr stark ist, dass die eine Kombination aus SVN und Git teilweise verwenden, weil Git so Probleme macht mit großen Dateien und die haben ja sehr große Dateien und Assets und die teilweise so eine Kombination fahren aus SVN und Git, um mit ihren extrem großen Repositories und großen Dateien irgendwie zurecht zu kommen.",
            "start": 1648698,
            "end": 1683986,
            "confidence": 0.8078846153846152,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das stimmt, Subversion war deutlich besser in der Handhabung von großen Dateien, von Binaries und Co. Natürlich gibt's das auch alles in Git, mit Git LFS und allem drum und dran.",
            "start": 1685067,
            "end": 1694952,
            "confidence": 0.84103125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das funktioniert aber in der Gamebranche scheinbar nicht. Das reicht nicht aus für deren Use Case. Kann ich jetzt leider nicht genau sagen, warum, aber das funktioniert nicht so gut. Darum haben die teilweise Eigenentwicklungen, die dann eben so hybrid auf Git für den Source Code und für die ganzen Assets und so weiter auf SVN basiert.",
            "start": 1694972,
            "end": 1711880,
            "confidence": 0.7623684210526315,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Falls ihr in der Gamebranche unterwegs seid, lasst uns doch mal wissen, wie ihr da mit großen Binaries umgeht. Wer auf jeden Fall ein bisschen mehr über dieses dezentrale Feature von Git, sogenannten Git-Remotes, lernen möchte, der kann sich ganz einfach mal ein bisschen damit beschäftigen, wie zum Beispiel Forking auf GitHub funktioniert, weil das ist eigentlich nichts anderes. Ihr forkt ein populäres Open-Source-Projekt, ihr forkt das in euren GitHub-Repository. Was ihr dann eigentlich macht ist, ihr müsst nicht euer geforktes Repository in einen anderen Ordner klonen. Ihr könnt auch einfach euer geforktes Repository als zweiten Remote lokal anlegen und dann den Remote pullen. Somit habt ihr eigentlich zwei Repositories, zwei verschiedene Realitäten in einem lokalen Clone, in einem lokalen Checkout. Und da merkt man relativ schnell, dass Begriffe re-upstream und origin eigentlich nur irgendwelche Wörter sind, weil man kann seinen lokalen Fork auch Hans-Peter oder Wanne-Eickel nennen. Das ist kein Problem, das obliegt euch. Forkt einfach mal ein Repository. und macht doch mal ein bisschen Gedanken über Git-Remotes, dann kommt ihr relativ schnell drauf, dass hey, Git ist ja doch dezentraler als ich dachte und wir brauchen GitHub nicht. Natürlich, wenn man GitHub jetzt als Issue-Tracker, Milestone-Tracker, Project-Tracker und ähnliches nutzt, dann ist es natürlich eine andere Geschichte, aber das ist ja dann wieder fern von Git. Ich hatte auf jeden Fall ein bisschen Spaß, über diese Frage nachzudenken, und ich denke, wir können uns alle ein bisschen an die Nase fassen und Git dezentraler nutzen. Ist natürlich auch ein bisschen mehr Aufwand, wenn ich die ganze Zeit quer übers Internet zu dir lokal auf die Festplatte pushe und co. Eigentlich ist ein Git ja so schon das größte Napster der Welt, ne? Weil eigentlich kann man ja dadurch auch einen guten File-Transfer machen, oder?",
            "start": 1715406,
            "end": 1827009,
            "confidence": 0.8164155405405407,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber mit einer zentralen Stelle, also Peer-to-Peer ist es noch nicht ...",
            "start": 1827049,
            "end": 1831830,
            "confidence": 0.6914166666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber wenn ich möchte, dann pushe ich was zu dir rüber. Dann pushe ich dir ein Branch rüber in deine Git-Kopie, oder? Das wäre doch möglich.",
            "start": 1831840,
            "end": 1838125,
            "confidence": 0.764923076923077,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn man das Ganze sehr breit sieht, ja, dann kann man da natürlich Parallelen ziehen, das stimmt.",
            "start": 1838491,
            "end": 1843154,
            "confidence": 0.722,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Lassen wir die kriminellen Gedanken.",
            "start": 1843554,
            "end": 1845156,
            "confidence": 0.8478000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wer sonst noch mehr zu Git wissen will, die Git-Dokumentation selbst ist eigentlich sehr gut und hat sehr gute Beispiele. Und was ich auch immer ganz nett finde, ist die Webseite learngitbranching.js.org, wo man ein bisschen spielerisch durch die ganze Branching-Geschichte durchgehen kann und Commands ausprobieren kann und das auch besser verstehen kann. Also wer da mal in die Tiefe gehen will, auch mit so, wie die ganzen Bäume erzeugt werden und wann man jetzt wirklich einen neuen Branch, einen neuen Ast aufmacht und wann nicht, da kann man eigentlich ganz gut sich mal durchspielen. Aber kommen wir mal zur nächsten Frage. Und zwar die Frage kommt von unter anderem von Mario, die haben wir aber schon mehrfach gestellt bekommen, wahrscheinlich Corona bedingt vor allem. Die Frage war nämlich, wie sieht euer Büro, Homeoffice Setup, mobile Setup, wie auch immer aus? Und nachdem jetzt keiner mehr im Homeoffice arbeitet, beantworten wir die Frage. Jetzt nachdem Corona vorbei ist oder so ähnlich, zumindest hoffentlich.",
            "start": 1845196,
            "end": 1905634,
            "confidence": 0.8288109756097561,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir hatten ja schon drüber gesprochen also deutschland hält noch an dieser korona warnen fest und ich habe jetzt vor kurzem auch gelesen da wurde wieder mehr geld reingeschossen und österreich und die niederlande haben die schon abgeschaltet richtig.",
            "start": 1906174,
            "end": 1919257,
            "confidence": 0.8372307692307691,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja wir haben korona sowieso abgeschrieben.",
            "start": 1919297,
            "end": 1921758,
            "confidence": 0.541,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich meine die deutschen minister reden schon da irgendwie drüber winterwelle und blabliblub.",
            "start": 1921798,
            "end": 1926279,
            "confidence": 0.8398461538461538,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also ich glaube auch, dass da sicher noch einiges kommt im Winter, da werden wir noch Spaß haben. Aber aktuell, glaube ich, gibt es keinen besonderen Druck mehr, dass man da im Homeoffice arbeitet, auf jeden Fall. Darum besprechen wir die Frage jetzt, wo sie nicht mehr so wichtig ist.",
            "start": 1926999,
            "end": 1940626,
            "confidence": 0.7836078431372546,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber Homeoffice wird ja nicht verschwinden. Deswegen, wie sieht euer Büro-, Mobile- und Homeoffice-Setup aus? Was ist euch besonders wichtig und wo drückt der Schuh?",
            "start": 1940666,
            "end": 1948670,
            "confidence": 0.6976799999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also erzähl mal, wie sieht dein Homeoffice-Setup aus?",
            "start": 1949369,
            "end": 1953612,
            "confidence": 0.721625,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe meinen eigenen Raum dafür, wo mein Schreibtisch drinsteht mit Aktenordnern, blabliblub. Das ist mir sehr wichtig, dass ich einfach die Tür schließen kann. Ich habe einen höhenverstellbaren Schreibtisch von fully.com.",
            "start": 1953652,
            "end": 1966622,
            "confidence": 0.804875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich klicke, als wäre es irgendwie ein Rad, so Mountainbike.",
            "start": 1966682,
            "end": 1968964,
            "confidence": 0.37059999999999993,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, das ist ein Online-Shop, der Büromaterialien verkauft. Höhenverstellbaren Schreibtisch find ich schon sehr, sehr wichtig, weil ich mich auch öfters einfach hinstellen möchte. Ich hab einen ordentlichen Schreibtischstuhl. Ich hab jetzt keinen ... Ich hab mit einem Ikea-Stuhl angefangen, aber da hab ich gemerkt, ich sitze krummer denn je. Deswegen hab ich mir einen ordentlichen ergonomischen Schreibtischstuhl gekauft. Einen Moment, guck grad, wie der heißt. Mein höhenverstellbarer Schreibtisch ist der Jarvis von Fully.com und ich habe den Haag Capisco ergonomischen Bürostuhl. Nicht ganz günstig beides, beides so circa um die 800 bis 1000 Euro. Meines Erachtens nach ist das aber sehr, sehr gut investiertes Geld, weil ich das jeden Tag mindestens acht Stunden nutze und das Geld für auch deine Gesundheit, glaube ich, ganz gut investiert ist.",
            "start": 1969908,
            "end": 2020850,
            "confidence": 0.8200859375000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und was hast du Computerbildschirm technisch?",
            "start": 2021310,
            "end": 2024151,
            "confidence": 0.7505000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Computertechnisch bin ich auf einem MacBook Pro M1 unterwegs. Bildschirm ist ein riesen Bildschirm. Ich weiß gerade gar nicht wie viel Zoll. Auf jeden Fall sehr groß.",
            "start": 2024191,
            "end": 2034675,
            "confidence": 0.7955925925925925,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist ja super. Andi schaut gerade, kommt mir vor in alle Richtungen in dem Videocall. Der muss riesig sein. Es hat so ausgeschaut, als hätte er gerade links und rechts in die Ecken von seinem Raum irgendwie geschaut.",
            "start": 2034735,
            "end": 2046040,
            "confidence": 0.7488157894736844,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein, mein Laptop ist links neben meinem großen Bildschirm auf einem Laptop-Stand. Ich habe eine externe Webcam von Logitech 1080p. Ich nutze nicht die Build-In-Kamera von Macbook. Ich arbeite mit der kabellosen Tastatur und dem Trackpad von Apple. Ich bin also ein Apple-Jünger, tut mir leid, aber ich habe mich mal sechs Monate auf einem Thinkpad mit Fedora versucht, da bin ich irgendwie nicht mit warm geworden. Podcast-technisch habe ich einen NT-USB von Rode mit zugehörigen Mikrofon-Arm. Und meine Kopfhörer, da laufe ich entweder auf Apple EarPods oder auf dem Bose QC35 mit Bluetooth. Das ist so mein Setup. Im Büro selbst habe ich noch ein Blackboard, was eigentlich, naja, ein Whiteboard in schwarz ist, mit so Art von Kreidelstiften. Was mir aber enorm wichtig ist, dass man sich auch mehr und mehr bewegt. Das bedeutet, ich bin noch am überlegen, ob ich mir noch irgendwie ein kleines Sportgerät kaufe, so ein kleines Laufband für unter den Schreibtisch oder ähnliches, damit man ein bisschen mehr Bewegung hat, weil da drückt nämlich dann auch der Schuh. Man muss sich halt wirklich zwingen aufzustehen, sich zu bewegen, weil sonst sitzt man hier acht Stunden.",
            "start": 2046480,
            "end": 2123773,
            "confidence": 0.8210625000000004,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt wohnst du eh schon in der Pampa, hast die Natur vor der Tür. Warum gehst du denn nicht raus? Du hast ja ein Handy. Mittlerweile ist es zwar schwierig, immer noch in Deutschland eine sinnvolle Verbindung am Handy zu bekommen oder überhaupt eine Verbindung, wenn man außerhalb von den Großstädten ist. Aber mittlerweile ist es ja so weit, dass du einfach ein Meeting auch draußen machen kannst. Geh doch da zu deinem Fluss. Wie heißt dieser große Fluss?",
            "start": 2124441,
            "end": 2146146,
            "confidence": 0.7774430379746834,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Geh doch da zu deinem Fluss. Der Fluss heißt Rhein, ja?",
            "start": 2146186,
            "end": 2148626,
            "confidence": 0.7643636363636364,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ja, genau.",
            "start": 2148666,
            "end": 2149146,
            "confidence": 0.4223333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist, glaube ich, die meistbefahrenste Wasserstraße in Deutschland.",
            "start": 2149186,
            "end": 2152887,
            "confidence": 0.7463333333333335,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da sieht man wieder dieses Blitzen in Andis Augen, wenn es um den Rhein geht. Ja eben, spazier doch am Rhein und mach da ein Meeting. So wie wir das früher auch bei Trivago gemacht haben, gemeinsam am Rhein spazieren gehen und mal das, was wir jetzt bei Podcast machen, einfach mal am Rhein machen.",
            "start": 2153885,
            "end": 2169213,
            "confidence": 0.8055272727272732,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, da bin ich ehrlich, das muss ich einfach mehr machen. Ich muss die Flexibilität vom Homeoffice einfach mehr nutzen. Ich muss einfach mit meinem Handy einfach mal mehr rausgehen. Ab und zu mache ich das aus dem Garten heraus, weil ich auch im Garten WLAN habe. Das ist natürlich ganz gut, wenn man halt einen fähigen Laptop hat mit einer großen und langen Akkulaufzeit, weil auch so ein Google Chrome zieht halt in der Videokonferenz schon ein bisschen was an der Batterie. Aber das ist einfach, wo man sich ein bisschen zwingen muss, mehr die Flexibilität wirklich zu nutzen. Mobiltechnisch, ich mache immer einen Hotspot auf, auf meinem Handy, falls ich irgendwo bin und tazza darüber. Und da bin ich dann wirklich ganz normal mit meinem MacBook M1 unterwegs. Würde ich fast sagen, relativ Standard Setup, großer Bildschirm, nichts Spezielles. Ich finde wirklich einen guten ergonomischen Bürostuhl ungemein wichtig, weil das geht direkt auf euren Rücken. Wenn ihr euch wirklich einen kaufen möchtet, schaut mal in irgendwelchen Läden bei euch in der Gegend und Testet den wirklich, weil nicht einfach im Internet irgendwas bestellen. Die Stühle von Ikea sind auch gut, doch wenn ihr wirklich da mal ein bisschen in Ergonomie einsteigt, dann werdet ihr schon merken, dass ein unglaublich guter Stuhl viel wert ist. Und ja, bekommen wir sehr wahrscheinlich auch kostet. Die sind dann nicht günstig. Ich habe gefühlt überall wo Gesundheit draufsteht ist halt alles enorm teuer.",
            "start": 2169793,
            "end": 2251659,
            "confidence": 0.8032489626556018,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und die sind auch gar nicht unbedingt immer die besten. Also da scheiden sich schon auch die Geister. Darum finde ich auch mal draufsetzen einfach und das ausprobieren und einen der gut ist. Aber es muss nicht immer weit über 500 Euro sein nur damit es irgendwie sinnvoll ist. Also es gibt auch kostengünstigere Stühle auch gebrauchte teilweise sehr gute. Aber am Ende muss einfach der Stuhl passen meiner Meinung nach.",
            "start": 2251679,
            "end": 2274043,
            "confidence": 0.8351830985915494,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich hab jetzt kein Audio Mixgerät oder ähnliches. Super viele Leute haben das ja. Ich hab auch keine Spiegelreflexkamera als externe Webcam.",
            "start": 2274123,
            "end": 2283369,
            "confidence": 0.8336521739130435,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So was gibt's.",
            "start": 2283389,
            "end": 2285091,
            "confidence": 0.6206666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Super viele Leute, die sich damit mit der Optimierung eines Videos und Audios beschäftigen, machen so was. Ich hab kein Ringlicht hinterm Bildschirm für Beleuchtung. Ich hab hier keine Philips Huey-Lampen für tolles Ambiente. Wie sieht dein Setup aus?",
            "start": 2285131,
            "end": 2299941,
            "confidence": 0.8452051282051283,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin ja ein großer Fan von kostengünstiger Hardware, die aber qualitativ gut ist. Und ich bin auch ein großer Fan, die Sachen sehr lange zu verwenden, solange sie gut funktionieren. Darum verwende ich zum Beispiel auch ein ThinkPad Notebook, was jetzt acht Jahre alt ist. Ist jetzt wirklich langsam in den Jahren gekommen, aber funktioniert immer noch sehr gut. Und ich habe ganz früher eigentlich auch immer mir meine Arbeitsplätze wesentlich besser eingerichtet. Und dann ist irgendwann Trivago gekommen und da habe ich auch noch einen Arbeitsplatz gehabt und irgendwann waren dann meine Teams so groß, dass die über mehrere Stockwerke verteilt waren und die hatte dann diese Philosophie, dass sie einfach gerne auch mit den Teams arbeiten möchte oder bei denen hin und wieder sitzen möchte oder mit den Leuten. Und irgendwann habe ich dann gemerkt, eigentlich dieser Schreibtisch, den ich dort habe, den verwende ich gar nie mehr, weil ich immer irgendwo unterwegs bin oder irgendwo in einem Team sitze. Und am Ende hatte ich eigentlich nur mehr meinen Laptop, den ich immer mit hatte. Ich hatte nicht mal das Netzteil mit und habe mich einfach an irgendeinen Platz gesetzt, wo ein freies Netzteil war und habe dann von dort ausgearbeitet oder habe mir irgendwo eines ausgeliehen. Und das habe ich dann irgendwie weitergelebt. Und wie ich dann auf Reisen war, mehrere Monate lang, habe ich mich eigentlich auch daran gewöhnt, einfach auf einem 14-Zoll-Notebook zu arbeiten. Und das habe ich mir irgendwie beibehalten. Also ich brauche eigentlich wesentlich seltener als externe Displays, weil ich einfach auf den kleinen Displays auch sehr gut arbeiten kann und mir das zurechtgelegt habe. Und das unterstützt mich natürlich bei einem mobileren Lebensstil, wo ich auch aus dem Zug oder so arbeite, wenn ich unterwegs bin. Und das Größte, was ich eigentlich mittlerweile so immer mit mir mitschleppe neben dem Notebook, ist eigentlich dieses Mikrofon. Dieses Podcast-Mikrofon, damit wir ja immer unsere Episoden aufnehmen können. Aber auch das ist eigentlich ein sehr kostengünstiges Samsung-Mikrofon. Kein Kondensator-Mikrofon, sondern ein dynamisches Mikrofon, weil das für das Podcasten meiner Meinung nach besser ist. Aber da muss ich auch sagen, das ist das, was jetzt bei Remote Work für mich am wichtigsten ist, einfach einen guten Ton zu haben und ein sinnvolles Mikro. Weil das stört mich am meisten in so Meetings, wenn du einfach eine schlechte Audioqualität hast. Und das geht einfach extrem auf den Kopf und man bekommt Kopfweh. Und wenn man in langen Meetings ist und 100.000 Geräusche hat und Rückkopplungen. Meiner Meinung nach macht es sehr viel aus, wenn es dann um die Qualität von dem Meeting geht. Und das ist mir eigentlich wichtig, einen guten Ton zu haben. Die Kamera ist viel weniger wichtig, meiner Meinung nach. Und ob das jetzt gut beleuchtet ist, sinnvoll, einigermaßen sinnvoll beleuchtet werden natürlich schon gut. Aber der Ton ist das Wichtigste. Und sonst bin ich da eigentlich sehr mobil unterwegs mit meinem Notebook. Und da habe ich mir das eben zurechtgelegt, dass ich dort auch schnell arbeiten kann, arbeite sehr viel mit so Desktops, die ich wechseln kann, also so virtuellen Desktops, damit ich hin und her springen kann, viel mit Shortcuts. Und da kann ich dann eben auch mobil im Zug zum Beispiel super arbeiten und super produktiv arbeiten. oder aus einem Café oder an den verschiedenen Schreibtischen, auch wenn ich natürlich jetzt irgendeinen Standing-Desk oder so gerne verwende mal, aber ich probiere schon, möglichst mobil zu bleiben. Und ehrlich gesagt, ich sehe jetzt wenig Unterschied in meiner Code-Qualität, die am Ende rauspurzelt, ob ich jetzt einen großen Bildschirm oder einen kleinen Bildschirm habe.",
            "start": 2301731,
            "end": 2495207,
            "confidence": 0.7937757475083057,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja gut, bei der Screen-Größe, ich glaube, da kommt es wirklich ganz darauf an, wie du arbeitest. Du sagtest gerade, du hast sehr viele virtuelle Desktops, wenn du da deinen Workflow angepasst hast, alles super. mehrere Fenster aufzuhaben auf dem großen Screen, speziell auch in der Videokonferenz, wenn du dein Screen shares oder ein paar Codefenster auf hast, mal gegebenenfalls zwei, drei mit einem Terminal etc. Das ist schon hilfreich. Ich kenne auch Leute, die stellen ihren Bildschirm senkrecht, damit die mehr Code auf einem Bildschirm kriegen. Sowas habe ich jetzt auch nicht.",
            "start": 2495247,
            "end": 2526634,
            "confidence": 0.7489139784946237,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wenn ich vielleicht jetzt wirklich 100% meiner Zeit coden würde, was ja immer weniger wird bei mir, dann würde ich vielleicht auch wieder den größeren Bildschirm auch bevorzugen, weil es schon praktisch ist, aber ich habe ehrlich gesagt gelernt damit auszukommen und wie gesagt, Coding ist bei mir jetzt nicht der Hauptbestandteil meiner Arbeit, würde ich mal sagen und dementsprechend komme ich auf einem kleinen Notebook eigentlich ganz gut aus. Da ist mir eigentlich wichtiger, dass ich einfach mobil bin und jederzeit schnell arbeiten kann. egal wo ich bin, ob ich jetzt im Zug bin, auf irgendeinem Schreibtisch sitze, in einem Café arbeite, bei einem Kunden bin, dass ich da einfach möglichst schnell bin.",
            "start": 2526874,
            "end": 2562512,
            "confidence": 0.7613043478260869,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was mir recht wichtig ist, sind so Sachen, die eigentlich gar nicht mit dem Homeoffice beziehungsweise mit einem Computersetup zu tun haben, zum Beispiel Mein Rudergerät finde ich enorm wichtig für mich, dass ich einfach mal.",
            "start": 2562552,
            "end": 2572942,
            "confidence": 0.79925,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hast du den Rhein vor der Tür und du brauchst ein Rudergerät wieder daheim, kannst du dich nicht in so ein Boot setzen und dort rudern?",
            "start": 2572962,
            "end": 2578843,
            "confidence": 0.6141851851851853,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab hier keinen Steg direkt vor der Tür, das ist das Problem. Und Intervalltraining in einem Rudergerät, in einem Ruderboot auf dem Rhein ist auch ein bisschen schwierig. Nee, aber das ist halt so relativ wichtig für mich, wo man einfach mal 10, 20 Minuten drauf springen kann. Einfach mal ein bisschen was anderes machen kann, aber das zählt jetzt eher nicht zum Equipment. Sucht euch auf jeden Fall irgendwas, damit ihr mal weg vom Screen kommt. Also ein eigener Raum ist unglaublich wichtig, Schreibtisch, Stehschreibtisch, ich benutze ihn jeden Tag.",
            "start": 2578883,
            "end": 2607253,
            "confidence": 0.7473369565217393,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das muss man sich aber natürlich erstmal leisten können, einen eigenen Raum, muss man auch dazu sagen. Weil die wenigsten Leute haben natürlich einen eigenen Office-Raum mit eingeplant, die in einer Wohnung leben oder sich eine Wohnung zugelegt haben. Vor allem, wenn man natürlich irgendwo in der Großstadt lebt, hat man ja selten mit einem Büro geplant, vor Corona zumindest.",
            "start": 2607792,
            "end": 2625756,
            "confidence": 0.7861666666666665,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist korrekt. Und ich hatte auch sehr viele Kollegen, die haben ihren Bildschirm dann auf dem Küchentisch aufgebaut. Bin mir halt nicht sicher, ob man da konstant wirklich von zu Hause arbeiten kann.",
            "start": 2626256,
            "end": 2635478,
            "confidence": 0.7746764705882355,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kommt wahrscheinlich auf die Umgebung drauf an natürlich. Aber ich glaube, möglich ist alles. Und wie gesagt, ich habe das eigentlich mir so zurechtgelegt, dass ich von überall recht schnell arbeiten kann. Und dadurch bin ich auch nicht verwöhnt, sage ich mal, mit irgendeinem großen Bildschirm, weil sonst hat man eben dieses Problem, ah, mir fehlt Der große Bildschirm-Arme fehlt dieses Gimmick, diese Tools. Und wenn man gar nie auf diesen Zug aufspringt so stark, dann ist man auch weniger anspruchsvoll und kann dann eben auch schnell losstarten. Eine externe Maus ist mir zum Beispiel noch auch wichtig, weil ich bin kein Touchpad-Freund.",
            "start": 2635976,
            "end": 2667829,
            "confidence": 0.7974563106796116,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe dieses Apple Trackpad extern und somit bin ich auch eins zu eins im Flow mit dem Trackpad von Apple selbst auf dem MacBook. Es gibt immer wieder Stimmen, die sagen, okay, das ist nicht ergonomisch und so weiter. Ja, das kann vielleicht sein, aber ich habe jetzt noch nie Probleme gehabt und ich mache das schon seit Jahren mit meinem Handgelenk oder ähnliches.",
            "start": 2667929,
            "end": 2687255,
            "confidence": 0.8189230769230771,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich glaube auch, dass man da einiges machen kann ergonomisch, aber ich bin da auch der Meinung, lieber eine Stunde weniger arbeiten und dann eine Stunde irgendwo an die frische Luft rausgehen. Im Idealfall hat man einen Berg vor der Tür oder so, wie wenn man in Österreich wohnt, dann kann man das natürlich nutzen, aber man kann auch ihn rein nutzen. Ich bin ja auch immer an den Rhein gegangen, wie ich in Düsseldorf gewohnt habe, ist ja auch okay. Aber ich glaube, das bringt viel mehr, da eine Stunde rauszugehen, anstatt sich irgendwie eine fancy ergonomische Maus zu kaufen im Endeffekt, und dafür aber diese Stunde eben zu arbeiten, anstatt an die frische Luft zu gehen.",
            "start": 2687526,
            "end": 2720730,
            "confidence": 0.7675126050420167,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die ganze Hardware, die wir gerade genannt haben, die Wolfgang hat, die ich habe.",
            "start": 2720750,
            "end": 2724511,
            "confidence": 0.7811428571428572,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die Berge meinst du?",
            "start": 2724531,
            "end": 2726391,
            "confidence": 0.59525,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Berge. Listen wir natürlich in den Show Notes auf. Wir packen auch ein Foto dazu, wie denn unser Schreibtisch so aussieht. Gegebenenfalls müsste man dann aufräumen. Aber vielleicht machen wir auch einfach jetzt gleich einfach mal ein Foto und dann könnt ihr das alles nachlesen. Vier Fragen, einigermaßen gut getimboxt. Das war unsere gemischte Tüte. Wolfgang, wie fandest du das Format als erstes?",
            "start": 2726431,
            "end": 2748313,
            "confidence": 0.7142656249999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Anders.",
            "start": 2749065,
            "end": 2749825,
            "confidence": 0.934,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist das jetzt so, wie ich habe gekocht und du sagst, es schmeckt interessant, oder?",
            "start": 2749865,
            "end": 2754548,
            "confidence": 0.754733333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das muss ich mir noch überlegen. Aber es ist schon sehr positiv, dass wir es geschafft haben, in der Zeit durch die vier Fragen durchzukommen. Lasst uns auch mal wissen, was ihr so denkt über dieses Format. Schickt uns auf jeden Fall Fragen. Wir sind immer glücklich über die Fragen und werden die auch beantworten im Rahmen von langen Folgen, kurzen Folgen, irgendwo am Rande, wie sich das auch immer ausgeht. Sorry, ausgeht ist schon wieder so ein österreichischer Ausdruck. Versteht wieder niemand. Also wie sich es zeitlich so machen lässt.",
            "start": 2754588,
            "end": 2784441,
            "confidence": 0.8233478260869568,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war es von uns in der heutigen Episode. Wir wünschen euch einen schönen Tag.",
            "start": 2784461,
            "end": 2788043,
            "confidence": 0.7837333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bis bald. Andi, du kannst doch nicht diese Episode jetzt beenden, ohne unsere ganzen tollen Feedback-Kanäle zu erwähnen.",
            "start": 2788063,
            "end": 2794310,
            "confidence": 0.7482777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Lass es einfach weg. Da droppen die Leute eh raus.",
            "start": 2794350,
            "end": 2796811,
            "confidence": 0.7041,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dir ist jetzt klar, dass ihr das auf keinen Fall rausschneiden würdet.",
            "start": 2796831,
            "end": 2799793,
            "confidence": 0.7245,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist mir egal.",
            "start": 2799813,
            "end": 2800854,
            "confidence": 0.71575,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber wir könnten ja nochmal wieder erwähnen, dass man uns liken kann. Kann man uns liken? Ja, Sterne vergeben. Aber noch wichtiger wäre eigentlich, anderen Leuten einfach Bescheid zu sagen. wie cool denn der Engineering Kiosk ist. Und wer es weniger cool findet, der kann ja auch noch auf unsere Webseite gehen, engineeringkiosk.dev, da findet man ja eine lange Liste von anderen coolen Podcasts, die man sich dann anhören kann. Also auch diese Liste kann man gerne teilen mit anderen Leuten und die darauf aufmerksam machen, weil am Ende geht es darum, irgendwo Knowledge zu sharen und zu verbreiten. Und ob das jetzt wir sind oder andere Podcasterinnen, ist eigentlich ja wirklich egal. Und damit auch von meiner Seite, ich werde jetzt höchstwahrscheinlich auf den Berg gehen. Zumindest wenn der Nebel sich langsam verzogen hat. Und dann mal dort meine Ergonomie abholen.",
            "start": 2800894,
            "end": 2848656,
            "confidence": 0.8320492957746477,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Viel Spaß dabei Wolfgang. Ich werde heute auch noch an den Rhein gehen, weil mein Hund mich in diese Richtung zerren wird.",
            "start": 2848696,
            "end": 2855060,
            "confidence": 0.7692272727272726,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dann grüß mir den Rhein doch schön.",
            "start": 2855080,
            "end": 2857622,
            "confidence": 0.7738571428571427,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich bestell schöne Grüße. Tschüss, bis bald. Tschau.",
            "start": 2857662,
            "end": 2860544,
            "confidence": 0.475,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7969876862455393,
    "audio_duration": 2866.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}