{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/f8dd318f-27d4-4c20-97a0-cd5530afec77/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62xhhz36te-15fe-430a-95ff-d3958dc3efda",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk. Cool, dass du wieder dabei bist. Heute geht es um das Thema Leadership. Im Speziellen um die Dynamiken innerhalb eines Teams. Noch spezieller um die fünf Phasen, die ein Team auf ihrem Weg zu einem hochperformanten Team in der Regel durchlebt. Welche Phasen gibt es? Was fühlen die Teammitglieder in diesen Phasen und welche Bedürfnisse entstehen? So wie die Frage, welcher Leadership-Style pro Phase benötigt wird. Wenn du jetzt denkst, ach, ich bin ja gar nicht in einer Leadership-Position, sondern nur Software-Engineer oder Individual-Contributor, schalte nicht ab! Das Thema ist nicht nur für Engineering-Managerinnen und Engineering-Manager relevant, sondern auch für Senior-Engineers, Projekt-Manager oder ähnliche Positionen bzw. für Leute, die auf dem Weg dorthin sind. Wir denken auch, dass jedes Teammitglied verantwortlich für die Kultur innerhalb eines Teams ist. Vielleicht nimmst du ja was mit, was du in nächster Zeit anwenden kannst. Und nun, viel Spaß!",
            "start": 4180,
            "end": 60483,
            "confidence": 0.8391699346405233,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So, Andi, willkommen zu einer neuen Episode Engineering Kiosk. Ich fang mal mit einer wichtigen Frage an. Hast du dir schon mal überlegt, was für Material dein Sarg haben soll?",
            "start": 66955,
            "end": 76697,
            "confidence": 0.7781333333333332,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nicht so direkt, aber ich bin eher so der Freund davon, dass die Leute, sofern es die denn gibt, die sich dann später um mich trauern oder Ähnliches, dass sie eigentlich gar keinen Aufwand mit mir haben. Weil ich bin ja eher so ein ... Also, ich bin nicht so der große Friedhofsgänger oder Ähnliches. Deswegen bin ich, glaub ich, eher so ein Fan davon, Verbrennen mich und verstreuen mich im Wald oder irgendwie sowas.",
            "start": 76717,
            "end": 99964,
            "confidence": 0.7474133333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du brauchst ja trotzdem mal einen Sarg davor. Ich habe nämlich jetzt gerade gelesen, dass es jetzt einen Sarg aus Pilzen gibt, der dann, sobald er in der Erde ist, wieder sich reaktiviert quasi und du dann schneller das Endstadium erreichst durch diese Pilze. Voll cool und voll bio natürlich auch noch.",
            "start": 99984,
            "end": 116772,
            "confidence": 0.779173076923077,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der kostet doch bestimmt voll viel, weil der nicht maschinell gefertigt werden kann, oder?",
            "start": 116792,
            "end": 120054,
            "confidence": 0.7634285714285715,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, der wächst. Der wächst. Der kostet, ich glaube, 1.000 Euro oder 1.500 Euro. Wird auch begleitet von der Bodenkultur-Universität in Wien, dieses ganze Projekt. Scheint aber eine coole Sache zu sein. Also wenn du noch Materialfragen hast, das wäre eine gute Möglichkeit.",
            "start": 120475,
            "end": 134991,
            "confidence": 0.6975116279069767,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt habe ich mal wirklich jetzt noch eine Frage, die mich wirklich interessiert. Wie lange braucht denn die Herstellung des Sarges, wenn du sagst, der wächst? Also die haben so eine Form oder was und da packen die dann so Pilzsamen irgendwie rein oder was machen die? Dann wächst der so vier Jahre vor sich hin oder was passiert dann?",
            "start": 136009,
            "end": 150938,
            "confidence": 0.7554666666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Immer diese Detailfragen. Ich kann dir dann gerne den Link schicken, packen wir gerne in die Show Notes. Wer sich da interessiert, kann da gerne mal näher sich damit befassen. Wir in Österreich sind ja ganz allgemein mit diesen Themen, gerade in Wien, da ist ja dieser Tod und so weiter immer sehr im Vordergrund.",
            "start": 150958,
            "end": 168433,
            "confidence": 0.8093818181818182,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bei der Wiener Oper oder wo jetzt genau?",
            "start": 168473,
            "end": 170695,
            "confidence": 0.503125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, bei der Wiener Bestattung. Kennst du das Wiener Bestattungsmuseum, wie heißt das zufällig? Ist das mal untergekommen?",
            "start": 170715,
            "end": 176962,
            "confidence": 0.7435555555555555,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ihr habt ein Museum über Bestattungen.",
            "start": 177002,
            "end": 179085,
            "confidence": 0.7570000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube schon. Ich weiß nicht, ob das wirklich ein Museum ist. Auf jeden Fall ist das von dieser offiziellen Abteilung, Stadtmagistratsabteilung irgendwas, die das ganze Friedhofszeug da organisieren. Die haben auch einen sehr coolen Webshop, die sind sehr bekannt worden, weil sie zum Beispiel eine Maske verkauft haben zu Corona-Zeiten, wo irgendwo oben steht, Corona leugnen sichert Arbeitsplätze. Vielleicht ist dir die mal untergekommen. Oder sie haben auch so Playmobil, so mit dem Leichenwagen und dem Wie heißt dieser Mensch, der neben dem Sarg ist? Keine Ahnung, dieser schwarz angezogene. Also da kann man sehr viel ganz coole Dinge kaufen, wenn du mal Geschenksidee brauchst.",
            "start": 180326,
            "end": 216194,
            "confidence": 0.7798504672897197,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe es gerade gedacht, wir Deutschen haben irgendwie einen am Kopf, weil in Berlin gibt es ein Currywurstmuseum oder ein Bud Spencer Museum, aber jetzt, sorry, ihr schießt den Vogel ab, meines Erachtens nach.",
            "start": 216214,
            "end": 226080,
            "confidence": 0.7781428571428569,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gibt übrigens eine sehr coole Podcast Episode, wo der Chef von diesem Bestattungsmuseum beziehungsweise der Leiter von der Magistratsabteilung interviewt wird. Also wir machen sogar Podcast Interviews zu diesem Thema. Kann man gerne auch noch verlinken.",
            "start": 226620,
            "end": 240690,
            "confidence": 0.7696388888888889,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wolfgang, du hast mir im Vorgespräch gesagt, du hast eine gute Einleitung fürs Thema. Jetzt bin ich gespannt, wie du daraus zum Thema eine Überleitung machst.",
            "start": 241010,
            "end": 249035,
            "confidence": 0.728576923076923,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, wir wollen ja heute über Teams sprechen. Und es gibt ja diese schöne Floskel, wenn eine Person das Team verlässt, hast du eigentlich ein neues Team. Also wenn ein Teammitglied zum Beispiel dann so diesen Bildsarg benötigt, dann hast du ein neues Team und musst wieder von null starten eigentlich. Also da gibt es keine Teamänderung, sondern es ist ein kompletter Neustart. Du kennst diesen Spruch dazu, oder?",
            "start": 249055,
            "end": 273625,
            "confidence": 0.8207101449275361,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich weiß jetzt nicht ob es da wirklich den spruch gibt aber ich bin fest davon überzeugt wenn es eine veränderung eine fluktuation im team gibt wenn jemand ins team hineinkommt oder das team verlässt dass du dann ein neues team hast da bin ich auch fest der meinung von das jetzt mit pilzsägen zu vergleichen oder damit zu schreiben halte ich schon hart makaber aber gut es gibt ja.",
            "start": 274345,
            "end": 296794,
            "confidence": 0.8305571428571427,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch den den truck Faktor, den wir schon mal besprochen haben, wie viele Leute vom Bus überfahren werden müssen, damit das Projekt nicht mehr fortgeführt wird. Also das spielt alles zusammen. Und als Österreicher, das ist unsere Mentalität, da kann ich nichts dafür.",
            "start": 296834,
            "end": 309741,
            "confidence": 0.8102790697674418,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, aber richtig. Wir sprechen heute über Teams, nicht Microsoft Teams, sondern eher die Dynamiken innerhalb eines Teams. Und Wolfgang, da habe ich mal eine Frage für dich. Und zwar hast du dich ja mit hoher Wahrscheinlichkeit in deiner beruflichen Karriere auch ab und zu mal mit anderen Teamleitern, Engineeringmanagern, Abteilungsleitern und so weiter und so fort unterhalten.",
            "start": 310121,
            "end": 331729,
            "confidence": 0.7989310344827585,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du meinst außer mit dir?",
            "start": 331749,
            "end": 332969,
            "confidence": 0.608,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Außer mit mir.",
            "start": 333009,
            "end": 333870,
            "confidence": 0.6213333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Soll vorgekommen sein.",
            "start": 333890,
            "end": 334850,
            "confidence": 0.7366666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du dann ab und zu mal die frage bekommen oder selbst die frage gestellt ja hey und wie läuft es.",
            "start": 335286,
            "end": 340473,
            "confidence": 0.7539047619047617,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bei dir im team so ja natürlich.",
            "start": 340513,
            "end": 343076,
            "confidence": 0.7924285714285714,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du dann auch eine ehrliche antwort bekommen oder ist das so eine floskel wie wie geht es dir gut wie.",
            "start": 343096,
            "end": 350846,
            "confidence": 0.8160476190476192,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Geht es dir gut Es kommt darauf an, wer gefragt hat. Wenn man natürlich ein gutes Verhältnis gehabt hat mit dieser Person, dann hat man sich da schon ausgetauscht und auch über Problemfälle vielleicht diskutiert. Wenn das in einem gestützten Rahmen stattgefunden hat, hat man da durchaus Details besprochen. Und wenn die negativ waren oder gerade wenn sie negativ waren, natürlich.",
            "start": 350866,
            "end": 371716,
            "confidence": 0.8426557377049182,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber jetzt mal summa summarum bei so einem Meetup oder so, was kam denn da als Antwort? Ja, alles super, hochperformantes Team, Track Record vom Feature Shipping und besser geht sowieso nicht.",
            "start": 371756,
            "end": 384167,
            "confidence": 0.6819062499999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, nach außen hin funktioniert immer alles gut, sehr klar.",
            "start": 384207,
            "end": 387269,
            "confidence": 0.8205,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was schätzt du denn, wie viel Prozent der Teams, die jetzt in Deutschland operieren im Software-Business, sind denn wirklich hochperformante Teams?",
            "start": 387309,
            "end": 396093,
            "confidence": 0.8447619047619047,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ist die Frage auch, wie man das misst. Was ist denn ein hochperformantes Team?",
            "start": 396133,
            "end": 399816,
            "confidence": 0.7295333333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man beantwortet eine Frage nie mit einer Gegenfrage. Hat dir das deine Mutter nicht beigebracht?",
            "start": 399856,
            "end": 404038,
            "confidence": 0.7956666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, in dem Fall ist es eine gute Gegenfrage.",
            "start": 404375,
            "end": 406816,
            "confidence": 0.7005555555555556,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das tut man trotzdem nicht.",
            "start": 406836,
            "end": 408217,
            "confidence": 0.7,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also du willst jetzt eine Zahl hören. Also wenn man die Performance misst nach dem Wolfgang Index von 2013, dann würde ich sagen, dass ca. 40% der Teams über 3,7 liegen.",
            "start": 408237,
            "end": 422785,
            "confidence": 0.7813870967741935,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was ist denn der Wolfgang Index?",
            "start": 422825,
            "end": 424226,
            "confidence": 0.6758333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es muss jemand nach überlegen.",
            "start": 425006,
            "end": 425947,
            "confidence": 0.6256,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, also ich habe natürlich auch keine Antwort auf diese Frage, doch ich denke mir, wenn wir über Team Dynamiken sprechen, dann sprechen wir natürlich über die Entwicklung eines Teams und unter anderem auch, welche Phasen ein Team denn so durchmacht. Und wenn ich halt mit anderen Engineering-Managern so spreche und dann halt die Frage stelle, und wie läuft's bei dir so im Team, und das eigentlich ernst meine, aber das halt dann als, wie geht's dir, Floskel, rüberkommt, dann ist irgendwie alles immer performing und hochperformant und was weiß der Geier nicht alles. Und dann denk ich mir so, das kann doch nicht sein.",
            "start": 426387,
            "end": 459745,
            "confidence": 0.8139904761904765,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und du würdest dir erwarten, mein Team ist gerade in der zweiten Phase, die ist der Storming-Phase, und befindet sich gerade im Übergang zur dritten Phase. So was?",
            "start": 459785,
            "end": 468130,
            "confidence": 0.7953214285714285,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielleicht noch nicht so hart theoretisch, aber einfach mal sagen, okay, knarzt ein bisschen, aber wir bewegen uns irgendwie in die richtige Richtung. Also einfach mal das genauso wie, oh, heute geht's mir nicht gut, weil ich schlecht geschlafen habe und mir am Rücken was erzogen habe.",
            "start": 468868,
            "end": 482081,
            "confidence": 0.7897446808510638,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das ist halt, weil auch die Erwartungshaltung so ist, dass Teams immer gut funktionieren müssen. Und auch von der Chefin, die Teams sollen ja gut laufen. Jetzt haben wir gerade ein neues Team letzte Woche erstellt, warum performt das noch nicht sinnvoll?",
            "start": 482121,
            "end": 494435,
            "confidence": 0.8126046511627907,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und genau das ist das Thema heute. Wir sprechen heute über die fünf Phasen bei der Entwicklung eines Teams.",
            "start": 494755,
            "end": 502406,
            "confidence": 0.8120526315789474,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und warum muss ich das wissen? Was bringen mir diese fünf Phasen?",
            "start": 502426,
            "end": 505410,
            "confidence": 0.7895833333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Meines Erachtens nach helfen diese fünf Phasen dir eigentlich zur Erreichung deines eigenen Ziels und du bist jetzt der Teamleiter, der Lead Engineer, der Engineering Manager oder Abteilungsleiter und meiner Meinung nach sollte dein Ziel sein, dich selbst obsolet zu machen. Also du machst dich selbst überflüssig für deine Abteilung, für dein Team oder ähnliches. Erst wenn du das geschafft hast, hast du einen guten Job gemacht. Also wenn das Team wirklich alleine sich bewegen kann, wenn die Richtung klar ist, aber auch wenn die Personen und die Mitglieder innerhalb des Teams Konflikte lösen können, dann brauchen sie dich nicht mehr, um das vorgegebene Ziel zu erreichen. Diese fünf Phasen der Teamentwicklung geben dir, ich sag mal, einen Leitfaden vielleicht sogar. Damit kannst du dann mehr oder weniger reflektieren, okay, wie weit bist du denn noch von deinem Ziel entfernt bzw. was ist denn jetzt benötigt oder was ist notwendig?",
            "start": 505750,
            "end": 556780,
            "confidence": 0.8144133333333331,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich stehe solchen Modellen eigentlich immer sehr kritisch gegenüber, die irgendwas in fünf Phasen einteilen oder in irgendwas die vier Quadranten oder so irgendwas. Aber wie es ja so schön heißt, es gibt nur falsche Modelle, aber manche, die sind sinnvoll oder hilfreich. Und ich glaube halt, Modelle helfen einem, dass man gewisse Dynamiken einfach besser verstehen kann. Und wenn man sich das im Kopf dann irgendwie so zurechtdenkt mit diesen Phasen, wie so ein Team sich entwickelt, Dann hat man einfach so einen Referenzpunkt, wo man dann vielleicht auch seine eigenen Aktionen drauf anpassen kann. Oder auch wenn man mit jemand anderem spricht, dass man einfach die gleiche Terminologie hat. Dass man sagt, okay, mein Team ist gerade in der Storming-Phase, weil die haben das und das Problem oder die machen gerade diese Phase durch. Dann hat man gleich das gleiche Vokabular, das man verwendet. Und das hilft einem natürlich dann auch beim Austausch zwischen Teamleads. So sehe ich das immer als so ein Modell, wie mir das irgendwas weiterhelfen kann oder das hilft mir ein wenig bei der Orientierung. Aber es ist sicher kein starres System, das immer richtig ist oder immer auf jedes Team zutrifft.",
            "start": 556820,
            "end": 620795,
            "confidence": 0.8019747474747476,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du musst dem Modell ja auch nicht erst blind folgen. Ich sehe das so ein bisschen wie so ein Design-Pattern. Das Design-Pattern löst eine Art von Problem und wie du das dann gegebenenfalls implementierst, da kannst du ja auch von dem Standard abweichen. Von daher würde ich sagen, Die Phasen geben dir so eine Art Guideline, so einen Wanderweg vielleicht. Ob du dann jetzt aber eine Abkürzung beim Wanderweg nimmst oder vielleicht doch mal bei der Hütte einkehrst und dir ein paar Maß reinknallst, sagt ja der Wanderweg nicht.",
            "start": 620815,
            "end": 647554,
            "confidence": 0.7388314606741573,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auf welcher Hütte gibt es denn Maß? Auf welchen Hütten bist du unterwegs? Es gibt nur große Bier maximal, das ist ein halber Liter. Maß gibt es doch auf keiner Hütte.",
            "start": 647594,
            "end": 655260,
            "confidence": 0.6979032258064516,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Merkst du, wie wenig in der Natur bin?",
            "start": 655280,
            "end": 657202,
            "confidence": 0.620375,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, dann wenn du schon nicht in der Natur bist, dann erklär mal, du hast ja diese ganze Literatur gewälzt von dem guten alten Tuckman. Woher kommt dieses Modell und was sind die fünf Phasen?",
            "start": 657959,
            "end": 668733,
            "confidence": 0.8049142857142856,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ganz, ganz, ganz früher, so ungefähr in den 60ern und 70ern, gab es einen amerikanischen Psychologen, der nannte sich Bruce Tuckman. Und der amerikanische Psychologe Bruce Tuckman hat sich der Untersuchung von den Dynamiken von Teams versprochen. Und dieser Mann ist mit fünf Phasen rausgekommen. Und diese fünf Phasen besprechen, ich nenn's mal, oder beschreiben den Werdegang von Teams. Und das muss jetzt nicht ein Softwareentwicklungsteam sein, das kann jetzt irgendein Team sein. Das kann ein Fußballteam sein oder ein Pfadfinderteam oder was weiß ich nicht. Auf jeden Fall wird laut der Theorie durchlebt, jedes Team mehr oder weniger, kürzer oder länger, diese fünf Phasen. Und diese fünf Phasen nennen sich wie folgt. Phase 1 ist Forming, das ist so die Einstiegs- und die Findungsphase. Phase 2 ist Storming, das ist dann die Auseinandersetzungsphase und Streitphase, die Konfliktphase, wo es so richtig zur Sache geht. Phase 3 wird sie als norming beschrieben dass du die regelungs- und übereinkommensphase phase 4 ist dann das was jeder sagt was man jeder hat das ist so die performing phase ja die arbeit so die leistungsphase wo es so richtig geht komm lass den ganzen kram mal schippen und phase 5 ist dann gegebenenfalls der einstieg von wolfgang ja die auflösungsphase die sogenannte morning or adjoining phase nennen wir.",
            "start": 668773,
            "end": 753249,
            "confidence": 0.796384259259259,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sie einfach mal bildsphase bildsphase Wir erweitern.",
            "start": 753269,
            "end": 757050,
            "confidence": 0.7192857142857144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das Modell und jede dieser Phasen hat bestimmte Attribute oder auch wie sich die Teammitglieder fühlen oder was man als Teamleiter beobachten kann, aber auch welcher Leadership-Style von euch als Engineering-Manager, Abteilungsleiter, Teamleiter oder Lead-Engineer oder Projekt-Lead oder vielleicht auch Projekt-Manager benötigt wird oder beziehungsweise am besten passt.",
            "start": 757090,
            "end": 781185,
            "confidence": 0.8646875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und vielleicht nochmal zur Einordnung, also diese Phasen durchläuft ein Team von Beginn, wenn es gegründet, erstellt wird, bis zum Ende, wenn es aufgelöst wird. Also es hat jetzt nichts mit einem Projekt zu tun, sondern wirklich mit der Entwicklung von dem Team selbst, von der Gründung bis zum Ende. Und da werden diese Phasen durchlaufen, können aber auch komplett unterschiedlich lang sein. Und das kann über Jahre gehen, kann über Monate gehen, bis es eben irgendeinen Bildsaustritt zum Beispiel gibt und das Team quasi wieder von vornhinein anfangen muss.",
            "start": 781964,
            "end": 812743,
            "confidence": 0.8440111111111113,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In der Praxis kommt sowas öfter vor, als ihr denkt. Eine klassische Reorganisation in eurer Firma. Pups, kann das sein, dass euer Team aufgelöst wird und ihr werdet einem anderen Team zugewiesen oder einer anderen Abteilung. Oder es gibt eine Art Projektausschreibung in der Agentur und es wird ein neues Projektteam zusammengestellt.",
            "start": 812783,
            "end": 828592,
            "confidence": 0.7087115384615387,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder es kommt eine neue Studentin, einfach die das Team joint oder mehrere Leute oder Praktikant, was es auch immer ist. Jemand verlässt das Team, wechselt in ein anderes Team. Also es gibt unzählige Gründe, warum ein Team sich neu formieren muss. Und das kommt also wirklich tagtäglich vor. Und gerade als Team Lead ist es sehr wichtig, dass man da ein Auge drauf wirft und das auch sieht und dementsprechend reagiert. Also dass man nicht sagt, okay, das Team funktioniert gut, da kommt ein neuer Student rein, wird schon alles klappen. kann ich gleich weitermachen, das Team wird gleich gut weiter funktionieren. Es ist eben genau nicht so und da muss man als Teamlead dann eben reinspringen und auch dementsprechend anders agieren, als man es vielleicht davor gemacht hat. Und genau darum geht es in diesen fünf Phasen auch.",
            "start": 828944,
            "end": 873736,
            "confidence": 0.7979714285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Steigen wir einfach mal in die erste Phase ein. Die erste Phase wird Forming-Phase genannt, so die Einstiegs- und Findungsphase. Das ist die Phase, wo die Teammitglieder das erste Mal Kontakt miteinander haben. Eigentlich wird da so das Team selbst zusammengestellt. Du hast jetzt einfach mal fünf Personen, die haben noch nie zusammen miteinander gearbeitet und sagen jetzt so, ihr müsst jetzt ein Problem lösen. Niemand hat wirklich eine Vorstellung davon, welche Rolle jeder einzelne im Team irgendwie spielen wird. Die Teammitglieder selbst kennen sich noch nicht und müssen sich erstmal kennenlernen. Jeder hat 10.000 Fragen, sowas wie, was mache ich hier eigentlich? Was ist der Zweck des Teams? Warum bin ich hier und welches Ziel habe ich eigentlich? Das Ganze spiegelt sich dann natürlich erstmal in dieser Phase durch geringe Produktivität nieder, man ist irgendwie busy mit kontinuierlichen irgendwelchen Routinen, wie zum Beispiel, ihr habt jetzt gerade mal Scrum eingeführt oder habt gesagt, okay, ihr wollt jetzt irgendwie in Scrum arbeiten, oh ja, wie laufen denn die Stand-Ups eigentlich ab, Team-Organisationen, also alles ist da irgendwie so ein bisschen ungeklärt. Dennoch ist es so, dass natürlich, wenn man in einem neuen Team joint, man ist erstmal voller Optimismus. Man ist stolz darauf, hey cool, ich wurde für die Gruppe ausgewählt, für das Projekt, meine Skills werden hier benötigt. Aber zeitgleich fragt man sich auch irgendwie, warum bin ich eigentlich hier und was wird eigentlich von mir erwartet.",
            "start": 874071,
            "end": 955437,
            "confidence": 0.8039537815126054,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das beste Beispiel dafür ist eine Onboarding Gruppe zum Beispiel. Wenn man dort reinkommt, dieses Gefühl, was man da hat, alle sind super optimistisch, sind froh, dass sie da starten können, haben aber keine Ahnung, was sie eigentlich genau tun sollen und was erwartet wird. genau dieses gefühl hat man auch wenn man in einem team neu startet das.",
            "start": 956317,
            "end": 975300,
            "confidence": 0.8435593220338982,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Standard verhalten von den einzelnen leuten ist eigentlich okay man ist erstmal super höflich vielleicht sogar sehr ruhig man versucht irgendwie so eine art akzeptables gruppenverhalten zu etablieren und beobachtet vielleicht auch sehr viel weil man weiß ja gar nicht okay wie reagieren denn die anderen drauf man versucht irgendwie die ersten Entscheidungen zu treffen oder die ersten Einigungen, wie wir jetzt erstmal ein bisschen weitermachen, also man geht alles immer sehr vorsichtig vor, seltenst kommt da jemand hin, haut auf den Tisch und sagt so in die Richtung gehen wir, weil jeder irgendwie das gleiche Bedürfnis hat, erstmal zu wissen, okay warum bin ich hier, was ist denn der Auftrag und das Zweck des Teams, Welches Ziel haben wir denn? Und was wird eigentlich von uns erwartet? Aber auch, welche Rollen und Verantwortlichkeiten gibt's denn im Team? Wer übernimmt eigentlich was? Also, jeder hat so ein bisschen die gleichen Fragen und ist deswegen halt ... Viele nehmen sich dann da auch erst mal zurück. Was auch völlig okay ist, weil du bist in einer neuen Gruppe von Menschen und keine Ahnung, wie die Menschen sich verhalten. Das wird natürlich auch unglaublich schwierig, menschen aus verschiedenen kulturen sind und nicht nur zum beispiel nur aus deutschland oder aus österreich dann wird dieses problem natürlich größer.",
            "start": 975320,
            "end": 1048989,
            "confidence": 0.8135581395348835,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und diese herausforderung es reicht schon deutschland und österreich als herausforderung und darum braucht es auch jemanden der das ganze leitet und da auch stark involviert ist und in dem fall ist es einfach der lied es braucht dann starken leadership style der sich um die dinge kümmert kümmern.",
            "start": 1049029,
            "end": 1067561,
            "confidence": 0.8044081632653064,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In diesem kontext heißt wirklich direktion geben ja also in in dem style ist das jetzt gar nicht verkehrt ganz klar anzusagen wir gehen jetzt nach links ja und dass der dass der teamleiter oder der lead engineer oder der projektmanager wirklich die Entscheidungen trifft und der Gruppe sagt, was zu tun ist. In diesem Kontext, in dieser ersten Phase, in der Forming-Phase, ist es von Vorteil, ganz klare Grenzen zu setzen, die ersten Entscheidungen zu setzen, aber auch zu erklären, warum man diese Entscheidung so trifft. Und wirklich man kann wirklich fast sagen das team wirklich aktiv leitet.",
            "start": 1067601,
            "end": 1106394,
            "confidence": 0.854919191919192,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und auch ziele setzt weil das team ist noch nicht bereit von sich aus in irgendeiner form ziele zu definieren in dieser phase weil da einfach zu viel noch unklar ist das heißt es auch ganz viel information geben input geben, Und eventuell eben auch schon ein Ziel setzen, wo soll die Reise denn hingehen, damit diese Klarheit im Team dann einfach genutzt werden kann, um in die nächste Phase zu kommen, um mal überhaupt anzufangen und zu starten.",
            "start": 1106434,
            "end": 1131458,
            "confidence": 0.8612278481012657,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In der Regel habt ihr als Teamleiter sowieso mehr Kontext, mehr Input. Ihr wurdet sehr wahrscheinlich von eurem Vorgesetzten oder auch von eurer Vorgesetzten bereits ein paar Wochen vorher informiert, dass eine Reorganisation stattfindet, dass ein neues Projekt kommt. Und ihr vielleicht sogar habt ihr das Team zusammengestellt. Das bedeutet, ihr habt den kompletten Kontext, den müsst ihr natürlich weitergeben. Und somit müsst ihr natürlich die erste Richtung vorgeben für das Team, damit das Team sich darauf fokussieren kann, sich untereinander einmal kennenzulernen und die ersten Fragen beantwortet zu haben.",
            "start": 1131758,
            "end": 1163508,
            "confidence": 0.8116666666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn es dann alles ein bisschen klarer wird, dann geht das Team in die zweite Phase, und zwar die Storming-Phase, also auch genannt Auseinandersetzungs- und Streitphase, also da, wo die ersten Konflikte eigentlich entstehen. Das passiert eigentlich dann, wenn begonnen wird zu arbeiten, also wenn das Ziel klar ist, relativ klar, und dann mal losgelegt wird, weil dann entstehen die ersten Konflikte. Wie machen wir irgendwas? Wie lösen wir denn ein Projekt? sind die Charaktere eben nicht mehr zurückhaltend, sondern fangen ja das erste Mal an, auch wirklich ihre Meinung zu sagen. Und dann hat man natürlich automatisch Konflikte.",
            "start": 1164048,
            "end": 1198592,
            "confidence": 0.8365959595959596,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Meines Erachtens nach geht es da richtig zur Sache, ja. Da habe ich ab und zu mal das Gefühl, da kommen so ein bisschen die Tiere wieder aus uns raus, ja. Da wo die ganzen Leute sagen, okay, was ist denn jetzt eigentlich meine Position in der Gruppe, ja. Ich bin jetzt hier der stärkere Charakter. Da kann es halt mal wirklich so zwischen Wettbewerb und Konflikte zwischen Teammitgliedern kommen, ja. wirklich zwischenmenschliche konflikte treten an die oberfläche und wer wer zeigt jetzt dominanz jedes einzelne teammitglied versucht halt wirklich sich in beziehung zu anderen zu setzen und sagt okay ich bin besser als der oder neben da bin ich nicht so schwach und ab und zu kann das echt unschön werden Man liest sogar im Internet hier und da mal von Verletzungen eines sogenannten Code of Conducts oder ähnliches. Kann's dann auch etwas lauter werden. Bin ich natürlich überhaupt kein Fan von, und ich hoffe, keiner von euch geht da zu weit. Sondern in dieser Phase ist halt ganz viel Toleranz und auch Geduld gefragt. Aber die Phase kann halt echt schmerzhaft sein, meines Erachtens.",
            "start": 1198612,
            "end": 1255365,
            "confidence": 0.7803494623655914,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und sie ist auch natürlich überhaupt nicht produktiv, weil sich Entscheidungen einfach extrem lang rauszögern, weil man eben diese Konfliktbewältigung auch in den Entscheidungsprozessen drin hat, dass man eben mit Leuten streitet, dass man sich nicht entscheiden kann und dadurch verzögert sich das natürlich und die Produktivität leidet natürlich auch darunter, weil einfach nichts weitergeht. Aber ganz wichtig, diese Phase braucht es für ein sinnvolles Team. Man kann natürlich probieren diese Phase zu verkürzen, aber sie ist natürlich in irgendeiner Form nötig. Und vor allem, wenn die Leute sich überhaupt nicht kennen von dem Team, die Teammitglieder, dann dauert die einfach länger. Wenn jetzt nur ein neues Teammitglied dazukommt oder eines weggeht, kann das natürlich wesentlich schneller sein. Aber im Normalfall braucht es in irgendeiner Form diese Phase, um die Rangordnung herzustellen, um die Positionen auch genau festzulegen, wer macht was, wer hat welches Spezialgebiet. Also Rangordnung klingt natürlich sehr negativ, aber einfach die Positionen wie in einer Fußballmannschaft festlegen.",
            "start": 1255685,
            "end": 1317230,
            "confidence": 0.8559437500000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die große Herausforderung in dieser auseinandersetzungs- und Streitphase ist natürlich, dass sich das Team auf seine Ziele konzentriert und sich nicht durch emotionale Fragen ablenken lässt, ja? Die Dauer der Phase kann relativ gut verkürzt werden, desto reifer die jeweiligen Personen sind. Nehmt mal an, ihr habt ein paar Senior Engineers oder Staff Engineers oder Ähnliches, die sind schon mal durch ein paar Teams gegangen und die haben schon mal ein paar Projekte gemacht. Dann kennen die diese Art von Phase. Umso mehr Erfahrung die einzelnen Teammitglieder haben, desto schneller werden natürlich die ersten Entscheidungen getroffen, desto mehr Geduld ist vorhanden oder Toleranz und auch mal über seinen Schatten zu springen oder ähnliches.",
            "start": 1317910,
            "end": 1359811,
            "confidence": 0.8086017699115043,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich würde nicht unbedingt unterschreiben, dass alle Personen mit viel Erfahrung dann sehr vernünftig sind. Aber im Idealfall hat die eine oder der andere vielleicht schon mal gelernt, dass es Sinn macht, sich irgendwo zurückzuhalten und flexibel zu sein und hat vielleicht auch gelernt, die Kommunikation zu verbessern in der Phase. Aber es gibt auch sehr seniorige Leute, die absolute Streithähne sind und das macht dann vielleicht auch einen guten Senior aus, wenn er das eben gut beherrscht, dass er über so eine Phase schnell drüber kommt im Team.",
            "start": 1359831,
            "end": 1392234,
            "confidence": 0.8225,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kommunikation ist ein super Stichwort. Jeder der Teammitglieder wird sich dann fragen, okay, wie offen kann ich denn jetzt hier in dieser Gruppe sein? Was sind die Risiken, aber auch die Benefits, wenn ich offen kommuniziere oder mich ein bisschen mehr geschlossen halte? Oder man stellt sich auch die Fragen, okay, gehe ich denn mit einher mit dem mit dem sinn und zweck des teams oder auch mit der art und weise wie wir problemen lösen und diese fragen wird sich da jeder stellen und dann abhängig davon welche rollen sich wie etablieren für sich selbst beantworten denn in dieser phase kommt es wirklich gegeben kommt es wirklich zu macht kämpfen zusammenstößen durch den mangelnden Ersten Konsens ist natürlich auch mangelnder Fortschritt. Geht da einher, wie der Wolfgang schon sagte, das ist halt nicht wirklich produktiv. Und es kann wirklich im Worst Case dann zu Verwirrungen, mangelndem Interesse oder zum Ausstieg aus dem Team führen, dass man sagt, okay, ich fühle mich einfach hier nicht aufgehoben.",
            "start": 1392454,
            "end": 1449635,
            "confidence": 0.8300180722891564,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und das ist dann auch wieder sehr wichtig, dass man als Teamleiter das im Auge hat. Es können auch viele Angriffe gegen einen selbst als Teamleitung passieren, also auch da muss man eine dicke Haut haben unter Umständen und man muss eben auch dafür sorgen, dass das nicht zu extrem wird und dann vielleicht irgendwelche Mitglieder eben raus droppen oder im schlimmsten Fall so unglücklich sind, dass sie dann kündigen oder solche Sachen. Also da muss man die die Wogen schon glätten und da muss man einen guten Mittelweg finden.",
            "start": 1449775,
            "end": 1478499,
            "confidence": 0.8298333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Eine Abgrenzung möchte ich doch noch mal ganz kurz tun. Wir reden jetzt hier nicht über toxische Environments, über Firmen, wo wir uns alle beleidigen oder Ähnliches, ja? Wir reden hier über die Phase, wo neue Leute lernen, miteinander zu arbeiten, produktiv zu arbeiten, komplexe Probleme zu lösen. Und da wir uns alle in der Regel in einem professionellen Umfeld befinden, werden wir in dieser Phase natürlich nicht persönlich, wir greifen keine Leute an oder Ähnliches, ja?",
            "start": 1478799,
            "end": 1507158,
            "confidence": 0.834909090909091,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber genau das ist, glaube ich, die Aufgabe vom Team Lead, dann auch das zu garantieren oder sicherzustellen, dass eben genau dieses Verhalten nicht passiert, weil das kann sehr leicht passieren und darum ist es umso wichtiger, dass der Team Lead oder die Führungskraft ganz allgemein da eben sehr intensiv reingeht. Guidance gibt, auch das Verhalten steuert, wenn da irgendwer über die Stränge schlägt, dass man das auch wieder einfängt und dass man das also wirklich die glättet, diese Wogen glättet, damit es gut über die Bühne gehen kann, weil es braucht diese Phase, aber man kann das Ganze eben glätten, um das schneller über die Bühne zu bringen. Und da ist der Teamlead auf jeden Fall gefordert.",
            "start": 1507638,
            "end": 1546111,
            "confidence": 0.8392288135593218,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und der Teamlead muss wirklich vor Ort sein. Ja, also in dieser Phase ballert man nicht seine Woche mit Meetings zu. Und auch wenn der Chef Meetings hat Dauer zu Ballad, dann sagt man die mal ab, weil da muss man wirklich da sein, Guidance geben, ein hohes Engagement an den Tag legen, aber auch sehr supportive sein und auch Teil der Diskussion sein, Teil der Lösungsfindung sein, weil im Endeffekt auch in dieser Phase trifft die Engineering Managerin oder der Engineering Manager im Endeffekt immer noch die endgültige Entscheidung, sofern es zu keinem Gruppenkonsens kommt.",
            "start": 1546291,
            "end": 1579823,
            "confidence": 0.8354270833333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Im Idealfall kann man da natürlich schon einen Gruppenkonsens erreichen, ist aber in der Realität durchaus schwierig und dann muss halt dementsprechend der Lead darüber wieder entscheiden.",
            "start": 1580353,
            "end": 1589942,
            "confidence": 0.7352592592592592,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist aber auch so, dass diese Phase ungemein wichtig ist, weil auch bei diesen Entscheidungen lernt das Team, was sie tun sollen, wenn das Team selbst nicht weiterkommt. Wie lösen wir uns aus diesem Blocker und wie kann aber auch effektives Feedback gegeben und empfangen werden für Konversationen? Also diese Art von Streitgesprächen, das ist jetzt nicht alles nur, oh nee, das ist eine Phase, da müssen wir durch, die hassen wir alle, sondern mittel- bis langfristig bringt die jedes Teammitglied weiter für das zukünftige Arbeiten.",
            "start": 1589983,
            "end": 1620177,
            "confidence": 0.8263678160919541,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wenn wir uns dann alle ein bisschen beruhigt haben, dann kommen wir in die Norming-Phase, in die Phase 3, in die Regelungs- oder Übereinkommensphase, wo man einen Contract bildet zwischen den ganzen Mitgliedern, dass man wirklich sagt, okay, wer spielt eben auf welcher Position. Ich habe halt so viele Fußballbilder, obwohl ich überhaupt keine Ahnung von Fußball habe. Du musst mich korrigieren, Andi, wenn da irgendwas nicht stimmt. Aber ich glaube, man spielt da an fixen Positionen, oder? Bei diesem Spiel. Egal. Auf jeden Fall, man entscheidet und macht diese Contracts, wer eben welche Rolle einnimmt. Und das passiert dann schlussendlich nach dieser Storming-Phase in der Norming-Phase.",
            "start": 1620557,
            "end": 1658749,
            "confidence": 0.8058981481481483,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man kann sogar fast sagen, okay, die Norming-Phase ist ja vielleicht ein normales Arbeitsumfeld, wenn das Team sich ein bisschen gefunden hat. Aber generell da in der dritten Phase, in der Norming-Phase, sollte sich dann so eine Art Team-Zurehörigkeit bilden. Okay, ich gehöre zum Team hier. Ich fange an, den Leuten zu vertrauen. Ideen werden weitergeteilt, offenere Kommunikation passiert, gemeinsame Entscheidungen werden getroffen, vielleicht sogar neue Routinen werden erstellt. Also man fängt wirklich langsam lösungsorientiert miteinander zu arbeiten. Und da sind jetzt nicht mehr die Teammitglieder das eigentliche Problem, sondern man fokussiert sich wirklich auf das Problem, welches zu lösen ist, anstatt mit der Frage, wie arbeite ich eigentlich in der Gruppe zusammen, mit wem kann ich eigentlich kommunizieren. fängt halt wirklich nach und nach an konstruktiv miteinander zu arbeiten nachdem man in phase 2 in der storming phase ich sag mal so das gröbste ausgekehrt hat und das gröbste ist halt wirklich so diese diese startphasen ja wie wie planen wir wer hat welche rolle wer hat welche fähigkeiten und so weiter und so fort nachdem das alles geklärt ist da fangen wir langsam an mal so ein bisschen zu arbeiten das bedeutet natürlich auch dass diese phase deutlich produktiver wird, weil wir haben ja schon ein paar Probleme gelöst, wir haben ja schon ein paar Hürden gemeistert und da können wir uns dann jetzt auf das wirkliche Problem, auf das wirkliche Ziel des Teams fokussieren.",
            "start": 1659555,
            "end": 1742254,
            "confidence": 0.7951265822784809,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und als Teamlead ist man dann an dem Punkt angekommen, wo man sich weiter rausnehmen kann aus den Entscheidungen, aus dem Team. dass man mehr in den Laissez-Faire-Stil wechselt, dass man sich natürlich um das Team kümmert, dass man immer noch zuhört, dass man das auch monitort, wie schaut das Ganze aus und dass man die Teammitglieder natürlich auch unterstützt, encouraged, so weiterzumachen, wie sie das in dieser Norming-Phase auch machen, also eher so eine unterstützende Rolle einnehmen. Man kann natürlich noch Diskussionen anregen und so ein bisschen anleiten, aber man nimmt sich immer weiter zurück, weil das Team jetzt sich eben gefunden hat und seinen Rhythmus gefunden hat und auch eine klare Rollenverteilung und dadurch ist der Lead eben nicht mehr so wichtig, dass der in jeden Entscheidungsschritt eingebunden ist und ständig im Team in irgendeiner Form involviert ist.",
            "start": 1742294,
            "end": 1796883,
            "confidence": 0.8300928571428573,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, da würde ich, ob ich da genau so mitgehen würde, weiß ich jetzt auch nicht, ja. Also ich meine, du hast mich halt voll bei dem Leadership-Style Lassie Fair, ja, da bin ich voll dabei. Aber man muss ja schon sagen, es ist ja schon ein harter Cut zwischen dem Leadership-Style von Phase 1, Forming, und Phase 2 Storming. Bei Phase 1 war es sehr, sehr hart direktiv. Bei Phase 2 war es sehr intensiv, Guidance geben, immer noch die endgültigen Entscheidungen treffen. Und jetzt bei 3 hört sich das so an, okay, lassie fair, okay, ich zieh mich einfach zurück und lass mal machen. So ist das meines Erachtens nach nicht. Meines Erachtens nach tritt man ein bisschen in den Hintergrund und lässt mehr Raum für das Team. Und ich, ich, ich vergleich das immer so ein bisschen wie, wie soll ich das sagen, es hört sich jetzt total hart an, aber wie so ein Puppenspieler, ja? Weil im Endeffekt ziehst du die Zügel im Hintergrund, ja? Du hörst natürlich sehr viel zu, du bist natürlich Teil von sehr vielen Diskussionen und wie du schon sagtest, Encouragey Leute. Aber dadurch gibst du denen natürlich auch eine Art von Management-Coaching. Du gibst denen natürlich auch eine Art von Leadership-Skills, dass die Probleme jetzt mal langsam gelöst werden müssen. Und du sagst dann, hey, ja, ich komm mal nicht weiter her, aber hast du denn schon den Weg probiert? Oh nein, mach ich mal. Und dann geht das Teammitglied wieder zum Team, probiert einen anderen Weg und kommt zurück, ja, super, das war's. Also du kontrollierst halt schon die ganze Sache. Ich red nicht von Micromanaging, ganz und gar nicht, aber ich red halt schon so ein bisschen, ja, vielleicht Puppenspieler. Das bedeutet, du trittst mehr und mehr in den Hintergrund und lässt wirklich mehr Freiraum für die Teammitglieder und dass die sich auch mal entfalten können.",
            "start": 1797184,
            "end": 1892891,
            "confidence": 0.7750914826498421,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Der gute Tackmann würde sich jetzt in seinem Bildsack umdrehen, garantiert, wenn du Laissez-Faire mit Puppenspieler vergleichst und wie du kontrollierst. Aber nennen wir es mal Coaching, da sind wir auf einer Linie. Ja, man muss auf jeden Fall mehr coachen und schon noch involviert sein, aber man kann sich immer mehr rausnehmen. Aber man ist sicher noch nicht auf einem absoluten laissez-faire-Style.",
            "start": 1893071,
            "end": 1917111,
            "confidence": 0.803174603174603,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, genau, vielleicht wollte ich das genau sagen, weil ich denke, das haben wir noch gar nicht besprochen, es ist ja nicht so, als kann man nur von Phase 2 auf Phase 3 gehen und dann von Phase 3 auf Phase 4. Die ganze Thematik kann natürlich wieder umschwappen, dass man auch wieder zurückfällt, ja? Dass man zum Beispiel, es gab irgendeine Veränderung und irgendwie sind manche Themen doch noch nicht ganz so gut geklärt worden. Dann heißt das natürlich, okay, man kann auch von der Normingphase wieder zurück in Phase 2 rutschen, wo dann wieder richtig viel Konflikt und Tobabo im Team ist. Deswegen mein ich so, komplett nach der offensichtlichen Konfliktphase in die Lassie-Fair-Schiene zu rutschen, in die 100-prozentige Lassie-Fair, find ich immer ein bisschen schwierig oder beziehungsweise herausfordernd.",
            "start": 1917531,
            "end": 1961296,
            "confidence": 0.7965038167938931,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auf jeden Fall, Puppenspieler und Leadership-Style sollten meiner Meinung nach in einem Satz vorkommen.",
            "start": 1961336,
            "end": 1967838,
            "confidence": 0.7337142857142859,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hoffe, ich werd jetzt nicht aus dem Kontext gerissen und geschnitten hier, aber ihr wisst, was ich meine.",
            "start": 1967878,
            "end": 1973499,
            "confidence": 0.815315789473684,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich erwarte mir einen ordentlichen Shitstorm auf Twitter, bitte.",
            "start": 1973739,
            "end": 1976920,
            "confidence": 0.5551111111111111,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Macht einen TikTok-Reel oder wie die ganzen Sachen heißen, macht das da draus und dann hoffe ich, dass da wenigstens ein Meme draus wird.",
            "start": 1977520,
            "end": 1985927,
            "confidence": 0.7422916666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber nehmen wir mal an, die Norming-Phase funktioniert und es funktioniert eben alles gut und man springt nicht wieder zurück in eine Phase, sondern es funktioniert, man verbessert das Ganze, dann geht man eben über in die Phase 4, in die Performing-Phase, in die Arbeits- und Leistungsphase.",
            "start": 1985967,
            "end": 2001299,
            "confidence": 0.8623191489361702,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja das ist natürlich genau die phase in der sich jeder teamleiter befindet mit deinem team oder teamleiterin wenn man mit irgendwem spricht ja mein team high performance track record etc etc.",
            "start": 2002120,
            "end": 2013395,
            "confidence": 0.817875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist dann diese meetup phase oder wenn man auf dem meetup ist und über sein team erzählt ist das team immer in der performing phase.",
            "start": 2013415,
            "end": 2019543,
            "confidence": 0.7761923076923074,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ganz genau, ganz genau. Es gab nie was anderes. Es ist ungefähr, wie geht's dir? Mir geht's immer gut. Nee, aber im Endeffekt ist es genau die Phase, die eigentlich jeder erreichen möchte. Das bedeutet, wo das ganze Team flexibel ist, wo das ganze Team eine hohe Performance aufweist und wo das ganze Team wirklich weiß, worauf es zusammen zusteuert, wo jeder weiß, was zu tun ist, sie sind autonom unterwegs und der Teamleiter oder Teamleiterin kann mehr oder weniger als so eine Art Ambassador angewiesen werden. Ja, also jetzt nicht jemand, der immer nur die Zügel in der Hand hat und nach vorne rennt, sondern wo das ganze Team, ich sag mal so als Pulk, sich selbst organisiert, sich selbst bewegt, wo gegebenenfalls auch komplett neue Vorschläge gemacht werden. Hey, pass mal auf, das Meeting macht mir irgendwie keinen Sinn, was haltet ihr denn mal davon, wenn wir das ein bisschen abändern und so weiter. Wo einfach komplett offene Kommunikation herrscht, wo jeder versucht, am Ziel miteinander zu arbeiten und den Status Quo nach vorne zu bewegen.",
            "start": 2020203,
            "end": 2074498,
            "confidence": 0.7908764044943822,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wenn du Ambassador sagst, meinst du damit, dass der Teamlead eben genau auf diese Meetups gehen soll und sein Team verkaufen soll? Also im positiven Sinne, dass alles gut läuft und einfach die Ideen von dem Team und was das Team macht nach außen trägt.",
            "start": 2074864,
            "end": 2087771,
            "confidence": 0.7982826086956523,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, logisch, aber nur dann mit dem Ziel, Recruiting anzustoßen, damit man dann jemanden dazukriegt, dass man wieder in die Forming-Phase kommt, ne?",
            "start": 2088146,
            "end": 2095848,
            "confidence": 0.7897391304347827,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, das ist das perfekte Team. Das ist eben, was jeder haben will. Auch wo großes Vertrauen in der Gruppe herrscht. Jeder hat Spaß. Man sieht auch eine gewisse Kreativität. Wenn wir da zum Beispiel zurückdenken an die Episode 33, da habe ich Andi ja interviewt als Teamlead. Und da habe ich ihm die Frage gestellt, wie man Innovation fördert. Und das ist natürlich auch genau diese Phase, wo dann Innovation entsteht, weil einfach diese Kreativität in der Gruppe verfügbar ist. Die Leute entfalten sich selber, sind kreativ und haben einen extrem hohen Output und es geht extrem viel weiter in dem Team. Also es ist einfach ein Team, das super viel auf die Straße bringt und wie ich schon gesagt habe, das jeder Teamlead oder jede Firma natürlich haben will, so ein Team.",
            "start": 2095888,
            "end": 2140760,
            "confidence": 0.7939850746268657,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ich euch fragen würde, wie ist denn gerade dein Job und ihr sagt ganz im Ernste macht super viel Spaß, ich kann mich persönlich entfalten und das Team ist sowieso super geil, dann sind das gegebenenfalls gute Attribute, dass ihr mit eurem Team in der Phase 4, in der Performing-Phase seid, wo ihr wirklich alles ansprechen könnt, denn In einem solchen Team kann man halt schon ein Verhalten beobachten, was halt sehr unik ist, ja? Wo das ganze Team zum Beispiel hinter dem Output steht, wo schnelle Entscheidungen getroffen werden, wo aber auch irgendwie sehr viel Humor im Spiel ist und ein guter Zusammenhalt entsteht, ja? Wo ihr wirklich sagt, hey, wir sind ein Team und wir sind keine Gruppe. Und das fühlt sich dann auch wirklich so an. Und genau in dieser ...",
            "start": 2141460,
            "end": 2182552,
            "confidence": 0.8074000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist der Unterschied zwischen einem Team und einer Gruppe?",
            "start": 2182562,
            "end": 2184624,
            "confidence": 0.4737,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt holt es aber die Theorie raus. Ein Team selbst teilt zum Beispiel ein einziges Ziel, wo natürlich eine Gruppe irgendwie verschiedene Ziele, jeder hat verschiedene Ziele, was dann in irgendeiner Art und Weise dann zu einem großen und ganzen Ziel gemixt wird, nenne ich es mal. ein team ist auch verantwortlich füreinander wohl in der gruppe halt jeder für sich mehr oder weniger verantwortlich ist also wenn.",
            "start": 2185360,
            "end": 2211251,
            "confidence": 0.7906029411764706,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man gemeinsam bei einem meetup ist mit anderen leuten die auch am meetup sind dann ist man schon eine gruppe aber man ist noch lang kein team Kennst.",
            "start": 2211271,
            "end": 2219357,
            "confidence": 0.8322857142857144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du eigentlich den Unterschied zwischen einem Paar und einer Gruppe? Na, erzähl. Und zwar gibt es einen Unterschied im mathematischen Sinne und im sozialen Sinne. Ich glaube, im mathematischen Sinne ist eine Gruppe ein Element oder eine Ansammlung von zwei Elementen und im sozialen Sinne ist man erst zu dritt eine Gruppe. Habe ich irgendwann mal von einem Doktor der Mathematik irgendwie.",
            "start": 2219397,
            "end": 2242288,
            "confidence": 0.8191290322580644,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, mathematische Gruppe ist sowieso noch mal was anderes.",
            "start": 2242628,
            "end": 2245809,
            "confidence": 0.5766666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Auf jeden Fall, ein Team selbst hat natürlich auch einen hohen sozialen Kontakt miteinander, wo das in der Gruppe, wie zum Beispiel bei der Meetup, eher so mäßig ist. Also, es ist genauso, wie die Kommunikationsstrukturen innerhalb eines Teams sind, sind eigentlich, jeder kommuniziert mit jedem, wo natürlich in der Gruppe halt oft, dass dann der Gruppenleiter die Kommunikation in der Hand hat. Also, das ist schon ein enormer Unterschied. In der Phase vier ist es jetzt aber da so, dass ... Der Leadership-Style Laissez-faire eigentlich genau der richtige ist, weil das Team braucht nicht mehr so viel Leitung, der Teamleiter oder Teamleiterin muss nicht mehr so viel eingreifen, weil die Ziele sind klar, das Team weiß, wie die Probleme zu lösen sind und kennt die Richtung und weiß, wie es Probleme aus dem Weg läuft.",
            "start": 2245829,
            "end": 2289553,
            "confidence": 0.826889705882353,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Entscheidet nämlich auch sehr schnell und macht die Entscheidungen selber. Auch da ist der Teamlead auf keinen Fall mehr eingebunden, weil das eigentlich so gut funktioniert, dass der selbst genau weiß, wie die sinnvollen Entscheidungen getroffen werden, was der Prozess dafür ist und wie die Entscheidungen gut zustande kommen und das Ganze eben auch schnell funktioniert und durch diese Schnelligkeit eben auch viel auf die Straße gebracht wird am Ende.",
            "start": 2290093,
            "end": 2312230,
            "confidence": 0.8287142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber auch hier bin ich ein Advocate dafür, dass man natürlich in Phase 1, 2 und 3 Maßnahmen geschaffen hat, dass man auch in Phase 4 immer noch den Output und woran das Team arbeitet und so weiter sehr gut beobachten kann, ohne wirklich das Team zu blocken. Weil das Team ist jetzt die Einheit, die alleine agiert und wo man dann jetzt so nach und nach, sofern das Team auch in dieser Performing-Phase wirklich bleibt, mal überlegen kann, kann man sich hier langsam mal rausziehen oder hat man jetzt ein hochperformantes Team und wirst du eigentlich noch benötigt als Engineering Manager, als Engineering Managerin? Und ein guter Indikator ist, wenn du nur noch reportest, wenn du nur noch nach oben gibst, was das Team eigentlich gemacht hat, und sonst, ich sag mal, die One-on-Ones so ein bisschen langweilig werden, was es eigentlich nie sein darf, bitte, ja, wenn die One-on-Ones langweilig werden, dann müsst ihr mehr Vorbereitung in die One-on-Ones stecken, meines Erachtens nach. Weil in diesem Zeitraum brauchen die Mitglieder mehr Coaching, vielleicht die ersten Maßgaben, um die Performance zu messen und, und, und. Sowas sind dann immer gute Indikatoren für vielleicht sogar Promotions, Beförderungen und so weiter und so fort auch.",
            "start": 2312610,
            "end": 2381905,
            "confidence": 0.8241225490196075,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und es ist auch wichtig zu erwähnen, dass eben auch wenn jetzt Laissez-Faire-Stil und man soll sich rausnehmen, wie du schon richtig sagst, die 101 zum Beispiel, die finden immer noch statt. Also der ganze Coaching-Bereich, diese Aufgabe von dem Team-Lead ist absolut intakt, auch in der Performing-Phase, weil die Leute brauchen natürlich Coaching, die wollen sich weiterentwickeln. Da kommen dann natürlich auch so Dinge, kann ich selber in irgendeiner Form wachsen, in meiner Position, will ich vielleicht selber ein Team übernehmen. Also irgendwann ist man ja dann auch am Ende, wenn alles so gut läuft und dann will man ja auch vielleicht in die eine oder andere Richtung weiterentwickeln. Und da muss natürlich der Teamlead dann auch wieder da sein und die Unterstützung anbieten. Und sobald dann natürlich ein Team-Mitglied aussteigt, in ein anderes Team wechselt, das Team übernimmt, fängt man natürlich wieder von vorne an, ist das klar. Also die Performing-Phase dauert halt oft auch nicht so lange, das muss man auch ganz klar sagen.",
            "start": 2382605,
            "end": 2434118,
            "confidence": 0.803077844311377,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich würde jetzt nicht sagen, wenn eine Person rausgeht oder eine Person dazukommt, dass man sofort wieder bei Phase 1 bei der Forming-Phase anfängt. Das würde ich jetzt nicht sagen. Ich glaube, das kommt wirklich ganz stark darauf an, wer das Team verlässt. Eine extrem laute Person, eine extrem starke Person oder ähnliches. Und auch, wie groß das Team ist. Der Punkt ist aber, es wird durchgeschüttelt. Und ein Team in einer Phase zu halten, wenn das Team sich ändert, das ist unglaublich schwierig. Das ist vielleicht gar nicht möglich, meines Erachtens.",
            "start": 2434538,
            "end": 2462674,
            "confidence": 0.798728260869565,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich glaube schon, dass die Phasen wieder durchlaufen werden, aber halt wahrscheinlich viel, viel schneller. Und ob man das jetzt wirklich dann unterscheiden kann, aktuell sind wir in der Norming-Phase und Storming-Phase, das ist dann die Frage. Aber es ist auf jeden Fall, wie du richtig sagst, durchgeschüttelt und es muss schon wieder klargestellt werden, weil die verlassene Position muss ja irgendwie abgedeckt werden oder vielleicht kommt jemand neuer rein, dann ist es nochmal schwieriger. es wird schon wieder zurückgeworfen in irgendeiner Form. Man stellt sich das ja vor, ein super performantes Team, fünf Leute, und plötzlich ist da einer weg. Das ist ein Fünftel, was dann fehlt. Das Team muss das irgendwie kompensieren. Derjenige war vielleicht extrem humorvoll, und jetzt fehlt diese humorvolle Person im Team. Also, das ist gar nicht so leicht zu verkraften, wie man sich das vielleicht vorstellen würde, wenn das wirklich eine Schlüsselposition war.",
            "start": 2462754,
            "end": 2509931,
            "confidence": 0.815413333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also, Flachwitze erzählen könnte ich auch, ja?",
            "start": 2510411,
            "end": 2513132,
            "confidence": 0.8202857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Humor, hab ich gesagt, nicht Flachwitze erzählen.",
            "start": 2513332,
            "end": 2515553,
            "confidence": 0.5907142857142855,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber der Wolfgang sagte auch gerade, diese Phasen halten nicht super lange. Was natürlich schon wichtig zu erwähnen ist, dass so eine Performingphase ist natürlich der heilige Gral, ja? Und die hat man nicht einmal und dann bleibt die. Sondern man muss sich halt schon ein bisschen umsehen, was halt links und rechts von einem passiert. Wie verändert sich die Firma, wie verändert sich der Markt, wie verändert sich die Wirtschaft generell? Das bedeutet, wir sprechen natürlich jetzt ganz einfach von diesen Phasen, aber man muss natürlich im Kopf halten, alles was außen herum passiert muss in irgendeiner art und weise stabil bleiben und dass sich nicht ändern dass man sich natürlich nur auf das team und nur auf die phase konzentrieren kann und dann wenn alles perfekt ist dann geht man diesen diesen theoretischen weg den wir hier beschreiben was natürlich in der realität nicht möglich ist ja weil die teams drumherum bewegen sich die die ökonomische Lage im Markt ändert sich jetzt besonders gerade mit der hohen Inflation, Produkte werden relevanter oder halb weniger relevant, die Strategie ändert sich vielleicht, das Management ändert sich und so weiter und so fort. Das bedeutet natürlich muss die Teamleiterin und der Teamleiter konstant Arbeit da reinstecken, um diesen Status von diesen Phasen mehr oder weniger konstant nach oben zu treiben oder wieder abzufangen und wieder nach vorne zu treiben auf Basis der Änderungen außerhalb des Teams. Und das klingt jetzt gerade einfacher als gesagt. Nee, das ist richtig harte Arbeit, weil man weiß ja nie, was geändert wird. Und ab und zu schüttelt eine neue Strategie oder eine Re-Org in eurer Firma das ganze Team durch, weil die Mission und die Vision dann auf einmal nicht mehr stimmt. Deswegen, benötigt der Leadership-Style Lassifare? Ja. Mir ist aber sehr wichtig, das heißt, nicht zurücklehnen, Füße auf den Tisch und acht Stunden Candy Crush spielen.",
            "start": 2516573,
            "end": 2623014,
            "confidence": 0.8469743589743589,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du willst ja nur wieder deine Puppenspieler-Schnüre da haben.",
            "start": 2623094,
            "end": 2625996,
            "confidence": 0.6377777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein nochmal ganz kurz wegen den popen spieler natürlich reden wir über menschen und so weiter und sofort also also man man möchte keine menschen ändern und man möchte die auch nicht kontrollieren ganz und gar nicht sondern es ist einfach nur eine analogie.",
            "start": 2626436,
            "end": 2637627,
            "confidence": 0.7218863636363637,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt sind wir eh schon auf der sarkschiene da ist eh schon alles verloren. Aber kommen wir mal zur letzten phase, phase 5, morning oder adjoining, spricht man das so aus? Auf jeden Fall die Auslösungsphase.",
            "start": 2637767,
            "end": 2650379,
            "confidence": 0.725527777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Auslösung? Wer wird denn hier ausgelöst?",
            "start": 2650419,
            "end": 2653081,
            "confidence": 0.5193333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sorry, Auflösung. Also so wie der Bildsack sich auflöst unter der Erde, die Auflösungsphase. Und die ist gar nicht zu unterschätzen. Man vergisst die immer, aber auch der Teamlead ist dort gefordert.",
            "start": 2653141,
            "end": 2663771,
            "confidence": 0.8069999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Generell geht es da um die Phase, wenn das Team einfach selbst aufgelöst wird. Das kann unterschiedliche Gründe haben, eine Reorganisation, die Firma ist insolvent oder man arbeitet einfach in einer Agentur und hat das Projekt einfach abgeschlossen. Das hat einen definierten Anfang und definiertes Ende. Das ist natürlich dann sehr schade weil man ist natürlich zusammen durch diese vier phasen gegangen bis hin zum heiligen graal zu der performing phase wo wo alles geklappt hat wo alles gestimmt hat.",
            "start": 2664311,
            "end": 2691963,
            "confidence": 0.8341375000000003,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hoffentlich zumindest.",
            "start": 2692003,
            "end": 2693284,
            "confidence": 0.91,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hoffentlich und dann wird auf einmal das team ausgelöst nicht ausgelöst.",
            "start": 2693304,
            "end": 2697087,
            "confidence": 0.6096363636363636,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt sagst du auch schon ausgelöst.",
            "start": 2697107,
            "end": 2698829,
            "confidence": 0.5183333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann wird das team natürlich aufgelöst. Und da trauert man halt schon so ein bisschen, man vermisst die anderen Teammitglieder, weil man hat ja auch eine ganze Menge durchgemacht, man hat sehr viel Energie da reingepackt, sich auf eine Technologie zu einigen, auf einen Cloud-Provider, auf eine Code-Struktur und so weiter und so fort.",
            "start": 2698849,
            "end": 2716353,
            "confidence": 0.8306296296296296,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also die anderen Teammitglieder gehen einem ab, wie wir in Österreich sagen.",
            "start": 2716893,
            "end": 2721134,
            "confidence": 0.8624999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In Deutschland sagt man mir, geht einer.",
            "start": 2721214,
            "end": 2722955,
            "confidence": 0.881,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ab, wenn, Nein, wir gehen die Teammitglieder ab. Andi, jetzt hast du so viel Österreichs schon gelernt. Was heißt das?",
            "start": 2722995,
            "end": 2729978,
            "confidence": 0.72565,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe keine Ahnung. Ernsthaft nicht. Du isst ja immer noch Kaiserschmarrn mit Rosinen. Ich verstehe dich aber bis heute nicht.",
            "start": 2730118,
            "end": 2736701,
            "confidence": 0.6624761904761906,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, wenn man die Teammitglieder vermisst, gehen sie einem ab.",
            "start": 2736741,
            "end": 2739803,
            "confidence": 0.8632,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, okay.",
            "start": 2740263,
            "end": 2741464,
            "confidence": 0.5825,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also man vermisst die anderen Teammitglieder. In Österreich, sie gehen einem ab. Das Team geht einem ab.",
            "start": 2741504,
            "end": 2746146,
            "confidence": 0.821235294117647,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man vermisst ihn natürlich, wenn man Vertrauen aufgebaut hat, weil man durch, ich sag mal so auf gut deutsch, durch dick und dünn gegangen ist. Und das kann natürlich auch dazu führen, dass man nicht mehr mit anderen Leuten zusammenarbeiten möchte, weil man natürlich sich an die vorherige Zeit zurücksehnt.",
            "start": 2746466,
            "end": 2763265,
            "confidence": 0.8457999999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also gerade wenn dann die Leute in ein anderes Team wechseln, ist es dann durchaus eine Herausforderung in der Forming-Phase, weil diejenigen vielleicht einfach sagen, okay, das wird nie mehr so gut, das Team funktioniert nicht und sehen nur die negativen Dinge. Also auch da braucht es unter Umständen ein bisschen Zeit, beziehungsweise, was natürlich auch immer super ist in dieser Auflösungsphase, dass man als Teamlead sich darum kümmert, eine ordentliche Abschlussparty zu machen, irgendwie einen offiziellen Abschluss macht, damit sich eben alle irgendwie mit diesem Abschluss anfreunden können und dann offiziell einen Abschluss finden. Und da eignen sich natürlich solche Farewell-Partys, Abschluss-Partys, auch wenn jemand das Team verlässt, sollte man das ja irgendwie machen, nochmal Danke sagen. Vielleicht auch ein kleines Geschenk, was es auch immer ist, aber dass man da wirklich in dem offiziellen Rahmen dem Team nochmal Danke sagt und ein Abschlussstrich oder ein Schlussstrich unter dieses ganze Kapitel setzt. Und das ist natürlich auf jeden Fall Aufgabe von der Teamleiterin oder dem Teamleiter.",
            "start": 2763665,
            "end": 2822134,
            "confidence": 0.8126826347305396,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt ist es natürlich so, jetzt haben wir die theoretische, psychologische Dynamik zwischen Teammitgliedern und eines Teams so ein bisschen beschrieben. Und ich frage mich halt, muss wirklich jedes Team durch all diese Phasen durch?",
            "start": 2822830,
            "end": 2836073,
            "confidence": 0.7961999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, da sind wir wieder bei dem Punkt, ob ein Modell immer stimmt. Ich glaube, es ist eine Anleitung. Im Endeffekt, man kann jetzt darüber diskutieren, ob es wichtig ist, ob jetzt ein Team durch alle Phasen läuft oder nicht. Keine Ahnung, was in der Literatur wirklich steht. Ich glaube, am Ende ist es einfach wichtig, dass man dieses Modell im Kopf hat und dementsprechend reagieren kann, wenn man eine Phase erkennt. Und wenn da eine Phase jetzt einfach so kurz ist, dass man die überspringt oder dass man die nicht wahrnimmt, dann ist das auch okay. Aber es hilft halt. Es gibt einem einfach ein Tool an die Hand, das man verwenden kann, um sein eigenes Handeln als Teamlead zum Beispiel einfach zu beeinflussen und dementsprechend auszurichten. Und das ist für mich viel wichtiger, als zu sagen, okay, geht man wirklich durch jede Phase, muss man die jede Phase erkennen, sondern es ist ein hilfreiches Tool, um die Teamentwicklung zu verstehen, aber mehr ist es auch nicht, für mich zumindest.",
            "start": 2836113,
            "end": 2889934,
            "confidence": 0.8442865497076021,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Wolfgang hatte in der Episode auch öfters mal erwähnt, und jetzt sind wir in Phase 3 und danach sind wir in Phase 4. Stellt euch das jetzt nicht so vor, ihr geht Freitag von der Arbeit nach Hause und am Wochenende seid ihr dann in Phase 4. Das ist jetzt nicht so, wir sind jetzt im nächsten Level oder ähnliches, sondern das ist alles ein fließender Prozess. Man kann gar nicht so wirklich 100% sagen, wann der Zeitpunkt war, welche Phase man wie wo übersprungen hat. Und es ist jetzt auch nicht so, als kommuniziert das Team effektiv, oh ja, Ich werd mir grad bewusst, wir sind jetzt grad voll in Phase 2. Wir sind grad in der Storming-Phase. Wir müssen uns jetzt hier kebbeln. Nee. Das hilft einfach nur als psychologisches Modell, um ein bisschen Guidance zu geben. Und ist auch nicht der heilige Gral, ja? Ich hab's immer zum Beispiel in meiner Praxis genutzt und nutze es auch immer noch, um zum Beispiel morgens einfach mal einen Kaffee zu nehmen, in den Garten zu gehen und einfach mal überlegen, okay, was sind eigentlich die nächsten Schritte? Was läuft eigentlich gut im Team und was läuft schlecht im Team? Was ist eigentlich so letzte Woche passiert? Und dann nehme ich mir schon noch mal die ein oder andere notiz raus die diese phasen beschreibt und frage mich okay kann man das irgendwie so sehen dass wir in irgendeiner dieser phasen sind also haben wir eine ganz klare vision mission oder ist das team noch dabei herauszufinden wie die zusammenarbeiten also. das das hilft mir schon so ein bisschen im kopf mich ich sag mal so festzuhalten und meine meinen nächsten schritte so ein bisschen zu planen weil sonst bin ich immer einer der sehr ungeduldig ist und sagt okay jetzt müssen wir sofort die performing phase beziehungsweise wir knallen jetzt das komplexe problem drauf und dann stelle ich fest ey das team ist gar nicht auf einer wellenlänge wie sie das komplexe problem eigentlich lösen Und dann denke ich mir, okay, gehen wir nochmal zwei, drei Schritte zurück. Das tut dann ein bisschen weh, das zu akzeptieren, aber ist dann wieder notwendig, um halt wirklich mal ein selbst formendes Team zu haben.",
            "start": 2890495,
            "end": 3002811,
            "confidence": 0.7848529411764708,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und was, glaube ich, auch ganz wichtig ist, dass man erkennt, dass eben ein Team nicht sofort performt und ein Output liefert. Das heißt, gerade zu Beginn, man muss dem Team Zeit geben, um sich eben zu finden durch diese Forming-Phase, Storming-Phase und sogar vielleicht, gut, in der Norming-Phase sollte das Team schon einigermaßen produktiv sein, aber zumindest die ersten zwei Phasen, die brauchen Zeit. Und wenn die Leute noch nie miteinander gearbeitet haben und sich vielleicht gar nicht kennen, dann braucht es natürlich wesentlich länger und man muss da vielleicht auch mehr mithelfen als Teamlead in der ganzen Startphase. Hingegen, wenn sich die Leute schon kennen, schon fünfmal miteinander gearbeitet haben, dann geht es wahrscheinlich relativ schnell.",
            "start": 3002851,
            "end": 3042157,
            "confidence": 0.8215762711864404,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hat sich seit den 60ern und 70ern schon ein bisschen was geändert. Also mindestens einmal Corona war dazwischen.",
            "start": 3043045,
            "end": 3049249,
            "confidence": 0.8511578947368421,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und man baut Särge nicht mehr aus Holz, sondern aus Pilzen.",
            "start": 3049289,
            "end": 3052371,
            "confidence": 0.8214545454545454,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und solche Phasen zu beobachten, fällt natürlich in einem Büro deutlich einfacher. In einem Meetingraum und so weiter und so fort. Man kriegt so ein bisschen mit, was die Personen bei der Kaffeemaschine bequatschen. Was denkst du denn, wie verhalten sich diese Phasen und diese Teamdynamiken in einem Remote-Setup?",
            "start": 3052391,
            "end": 3068480,
            "confidence": 0.7645102040816326,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, dass die Gefahr ist, dass sich diese Phasen auch gerne verschleppen, dass man vielleicht schon glaubt, man ist produktiv, man hat die Position gefunden, es läuft alles und dann wird man wieder zurückgeworfen, weil einfach wesentlich weniger Kommunikation passiert. Und wenn man die Phasen vielleicht nicht gut durchlebt hat, dann fällt man halt eher wieder in eine Phase zurück, weil man eben dann wieder einen großen Konflikt im Team hat. Und ich kann mir vorstellen, dass das einfach durch die fehlende physische Präsenz und das ständige Zusammensein, dass das durchaus schwieriger wird. Was ist deine Erfahrung?",
            "start": 3069096,
            "end": 3100838,
            "confidence": 0.8434693877551022,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich arbeite remote. Ich arbeite in einem remote Team. Ich arbeite an einem neuen remote Team, was so vorher auch noch nicht zusammengearbeitet hat. Das bedeutet, eigentlich bin ich so das Exempel für diese Theorie hier jetzt gerade. Und meiner Erfahrung nach ist es in einem 100-Prozent-Remote-Setup enorm schwierig, so was wirklich hinzukriegen, weil das erfordert sehr viel Disziplin von jedem Einzelnen, besonders sich in Meetings über solche Themen zu unterhalten. Was wir aber gemacht haben, ist, wir hatten schon zwei, drei Offsites, wo wir uns eine Woche mal in Helsinki oder in Berlin getroffen haben und dann eine Woche in so einen Coworking-Space eingesperrt haben und da natürlich sehr viele Themen dieser Art klären konnten. Also wirklich mit physischer Präsenz. was das Arbeiten dann, wenn man wieder zu Hause ist, im Remote-Setup deutlich einfacher macht. Ja, weil die Leute kennen sich. Es ist wirklich, wirklich, wirklich faszinierend, wenn man sich diese Theorien hier mal durchliest und wirklich, okay, das Verhalten beobachtet und welche Bedürfnisse die Teammitglieder haben. Und das mal reflektiert, wenn man jetzt in einem Remote-Team ist und dann Offsite in einem Coworking-Space hat für eine Woche oder ähnliches und dann wieder zurückgeht. Die Leute vertrauen sich wirklich mehr. Die kommunizieren ganz anders. Wir haben wirklich mal Zeit, sich vor ein Whiteboard zu setzen und verschiedene Diagramme durchzugehen, was natürlich viel einfacher von der Hand geht, weil man einen Stift in der Hand hat, man kann mal kurz was wegwischen. Geht auch alles online mit Miro und Google Whiteboard, Jamboard und wie sie alle heißen, aber es ist halt einfach nicht dasselbe. Genauso wie eine Retrospektive online nicht dasselbe ist, wie in einem Büro oder einem Co-Working-Space, als wenn man haptisch ein paar Post-its an eine Glasscheibe legt. Und auch wenn ich diesen Job schon ein paar Jahre mache, es fasziniert mich immer wieder, wie nah doch diese Phasen an der Realität sind.",
            "start": 3101519,
            "end": 3203168,
            "confidence": 0.7914380952380953,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das kann ich auch definitiv bezeugen. Also diese Phasen, die habe ich schon auch oft erlebt und durchlebt. Und das eine Mal besser, das andere Mal schlechter durchlebt oder gesteuert. Aber man bekommt ja dann auch ein besseres Gefühl dafür. Und das Gefühl ist halt, glaube ich, online auch noch mal schwieriger zu haben. Aber da ist man als Teamlead auch nochmal mehr gefordert, dass man vielleicht auch härter durch diese ganzen Phasen sinnvoll durchsteuert und vielleicht auch besser unterstützt, dass man halt auch gewisse Spiele macht, gewisse Fragen stellt, dass man da einfach auch die Phasen besser abschließen kann, damit man eben nicht wieder in Phasen zurückfällt.",
            "start": 3203509,
            "end": 3239219,
            "confidence": 0.8132385321100917,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt ist es natürlich so, dass Wolfgang und ich diese ganzen Phasen und Teamdynamiken innerhalb von 50, 60, 70 Minuten durchgesprochen haben. Und auch wir haben diese Thematiken nicht durch irgendeinen Podcast gelernt, sondern durch etliche Leadership-Workshops, wo wir dann zwei, drei, vier Tage zusammen saßen, die ganzen Teamdynamiken durchgespielt haben und so weiter und so fort. Falls ihr mehr über dieses Thema wollt, empfehle ich euch wirklich mal, fragt auch mal eure Vorgesetzte und Vorgesetzten, ob ihr nicht an irgendeinem Leadership-Programm mal teilnehmen könnt, wo sowas mal besprochen wird. Gutes Leadership-Training und gute Leadership-Workshops behandeln sowas. Da gibt es noch viel mehr Modelle dieser Art. Und damit baut ihr euch über Zeit sogenannte Toolbox auf, einfach einen Werkzeugkasten, was ihr nicht kontinuierlich nach der Theorie anwenden müsst, aber wo ihr immer mal wieder darauf zurückgreifen könnt. Und auch wenn ihr sagt, hey, ich bin ja gar kein Engineering Manager, gar keine Engineering Managerin, gar keine Abteilungsleiterin. Meines Erachtens nach helfen diese Theorien nicht nur Abteilungsleiterinnen oder Teamleiterinnen, sondern auch Senior Engineers, Staff Engineers, Projektmanager, weil im Endeffekt all diese Skills und all diese Beobachtungen helfen euch, wenn ihr irgendwas leitet. Sei es ein Projekt aus technischer Sicht, sei es das Management eines Projektes oder, oder, oder. Fragt einfach mal nach. ob ihr in dieser Richtung nicht einen Workshop haben könnt.",
            "start": 3240040,
            "end": 3321712,
            "confidence": 0.8071085972850685,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und falls ihr Feedback für uns habt oder noch andere Ideen oder Meinungen, ob ihr glaubt, dass Tugman ganz falsch gelegen ist, dann schreibt uns. Auf Twitter engekiusk oder an stetisch at engineeringkiusk.dev. Wir freuen uns auch über Audionachrichten an unsere Handynummer, steht in den Shownotes. Würden uns da auf Erfahrungsberichte freuen oder auch Infos, wie ihr die Teamentwicklung seht und wie ihr die ganze Sache angeht.",
            "start": 3321732,
            "end": 3350240,
            "confidence": 0.8338358208955221,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich würde mich ja wirklich mal interessieren, was die Hörerinnen und Hörer über uns denken, in welcher Phase wir uns befinden und ob wir jemals aus der Stormingphase, aus der Auseinandersetzungsphase rauskommen bei diesem Podcast. Naja, so viel dazu. Vielen Dank, ich hoffe ihr habt ein bisschen was mitgenommen. Testet es mal aus, setzt euch mal hin, denkt mal ein bisschen über euer Team nach, auch in dem ihr arbeitet und ob ihr noch in der Storming- oder bereits in der Performing-Phase seid. Viel Spaß, bis später. Tschüss. Ciao.",
            "start": 3350300,
            "end": 3376774,
            "confidence": 0.6947333333333335,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.8034509646302244,
    "audio_duration": 3380.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}