{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/70811d1e-a0f6-48df-be86-fa83099e4bec/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62xhg1he1a-3612-45d8-82fd-3b030de69d23",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Mein Team zieht nicht an einem Strang. Wir arbeiten in die falsche Richtung. Kennst du? Schon einmal gehört? Dann eine kurze Frage. Wie lautet die Vision und Mission deiner Firma? Du hast eine Antwort. Okay, nächste Frage. Wie lautet die Vision und Mission von deinem Team, in dem du tagtäglich viele Stunden verbringst? Du hast eine Antwort oder hältst du das ganze Thema für esoterik und denkst eigentlich nur Geschleichte, alle die eine Vision haben sollen besser zum Arzt. Aber genau darum dreht sich die Episode. Wir klären, was eine Vision und eine Mission ist, warum diese wichtig für eine Firma und auch für dein Team ist, stellen uns die Frage, warum wir eigentlich genau für diese Firma arbeiten, was für einen Effekt die Vision und Mission auf dein Team haben kann, ob es auch ganz ohne funktioniert und wie man das ganze Thema angehen kann. Also los geht's.",
      "start": 188,
      "end": 51060,
      "confidence": 0.8425973154362418,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir haben ja schon mal in diesem Podcast über Themen wie Bildergenerierung und Dolly oder Delhi oder Dolly und dieses ich gebe da irgendwas ein und da wird ein Bild generiert gesprochen und du bist ja ziemlich Hyped, ist das richtig?",
      "start": 55560,
      "end": 69808,
      "confidence": 0.7186585365853657,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, wir versuchen die AI zu nutzen, dass ich dann irgendwann auch die AI als Gesprächspartner habe in diesem Podcast. Das ist eigentlich das Ziel von dem Ganzen, das ist die Vision.",
      "start": 70223,
      "end": 79675,
      "confidence": 0.7995000000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann man da nicht einfach jetzt ein Alexa oder so ein Google Home hinstellen?",
      "start": 79716,
      "end": 83320,
      "confidence": 0.5830714285714285,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, du bist schon aktuell noch besser als Alexa. Andi ist besser als Alexa. Noch.",
      "start": 83420,
      "end": 87446,
      "confidence": 0.6397999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Zu dem ganzen Thema habe ich gestern eine Podcast-Folge gehört von unseren entfernten Kollegen aus dem Index-Out-of-Bounds-Podcast. Und zwar haben die sich in Episode 40 über Tech-Trends, die uns begeistern, gesprochen. Und da ging es auch um Machine Learning, Augmented Reality und solche Geschichten. Und da habe ich einen Begriff gehört. Und zwar den Begriff Prompt Engineering. Hast du das schon mal gehört?",
      "start": 88046,
      "end": 111391,
      "confidence": 0.7522857142857142,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja natürlich, das machen wir mit Suchmaschinen eigentlich seit Jahren.",
      "start": 111603,
      "end": 115227,
      "confidence": 0.7519,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich fand diesen Begriff unglaublich cool eigentlich und da haben die beiden vorausgesagt, dass es wohl bald Stellenausschreibungen gibt für Prompt Engineers, weil wenn die ganze Thematik so weitergeht, dass man dann wohl spezielle Skills braucht, um diese Prompts, also diese Eingaben, zu schreiben. Und ein Beispiel war, einer hat wohl einen Kollegen, der spielt wohl seit Wochen mit diesen AIs rum, die halt so Bilder generieren kann. Und diese Person ist wohl relativ gut darin, jetzt inzwischen die entsprechenden Prompts zu schreiben, um dann halt deutlich bessere und qualitativ hochwertigere Bilder zu erstellen.",
      "start": 115247,
      "end": 155689,
      "confidence": 0.8292765957446807,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei ich glaube eigentlich, dass das immer so ist, weil du hast ja das User Interface. Bei einem Photoshop war das genauso. Du hattest im Kopf, was du machen willst als Designer. Das ist eigentlich die Hauptarbeit. Und dann musst du das in dem Tool umsetzen, in dem Photoshop. Und du musst genau wissen, wie du das Tool anwendest. Jetzt hast du einen Prompt, wo du eingibst, was du haben willst. Und du musst natürlich das möglichst gut eingeben. Jeder, der mal CodePilot verwendet hat, ist dasselbe. Du musst versuchen, möglichst gut einzugeben, wie der Code am Ende von Copilot aussehen soll, was der machen soll. Das heißt, du wirst besser im Beschreiben des Ziels. Also deine Hauptaufgabe ist eigentlich jetzt, das Bild aus deinem Kopf, was du hast als Ziel, als Vision zu transferieren in Text, in eine Propt.",
      "start": 155989,
      "end": 197496,
      "confidence": 0.8017071428571425,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau nur dein Photoshop Beispiel finde ich ist ein bisschen off, weil mit Photoshop du natürlich dann die die Button klickst und dann irgendwelche Filter drauf legst und so weiter und so fort.",
      "start": 197936,
      "end": 206807,
      "confidence": 0.7109393939393941,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Andere Art von Interface, aber im Endeffekt geht es natürlich um was ähnliches.",
      "start": 206827,
      "end": 211653,
      "confidence": 0.8274615384615386,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau du hast halt du hast halt jetzt nicht so einen Prompt, du hast halt jetzt kein wirkliche Eingabemaske, wo man wirklich Text eingibt, weil Prompt Engineering wird dann auch natürlich ganz klar mit Natural Language Processing in Verbindung gesetzt, ja, dass du halt, wie du sagtest, der Maschine die entsprechenden Anweisungen gibst, so dass dieser Prompt, dieser Text dann halt auch entsprechend gelesen werden kann.",
      "start": 211693,
      "end": 232885,
      "confidence": 0.8115454545454543,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, am nähersten für uns Entwickler und Entwicklerinnen kommt wahrscheinlich Stack Overflow Engineering, Prompt Engineering, dass du wirklich diese Google-Suche so eingibst, dass du genau diesen Treffer hast für deinen Bug, für deine Fehlermeldung. Da weiß man auch schon ganz gut, wie man so eine Suche definieren muss, damit man zu einem guten Ziel kommt. Und ich glaube, das kommt am nähersten dem Ganzen, aber es wird sicher komplexer und das ist ein großes Thema in Zukunft.",
      "start": 233225,
      "end": 259519,
      "confidence": 0.8164615384615386,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und zwar hab ich diese Episode von Christian und Thomas vom Index-Out-of-Bounds-Podcast bei der Hunderunde gehört. Und so ungefähr auf der Hälfte der Hunderunde war die Episode zu Ende, und dann hab ich noch ein bisschen drüber nachgedacht. Und zwar hab ich drüber nachgedacht, okay, wir haben jetzt also hier dieses Dolly und generier mir ein Build-Tool. Das ist Prompt Engineering. Und GitHub Copilot ist ja eigentlich nichts anderes. Ich geb da ja was ein, und der setzt mir eine Funktion hin. Und dann hab ich gedacht, hm, du weißt ja, dass ich im Site-Reliability-Engineering unterwegs bin. Und Reliability Engineering ist eigentlich der Aufgabenbereich, der rauskommt, wenn du Software-Ingenieure mit dem Bereich von Operations beauftragst. Das ist so die Grundlegendefinition von Google. Und Software-Ingenieure sind ja faul. Und dann hab ich mich gefragt, kannst du dir vorstellen, dass wir das irgendwann, mit wir meine ich, die Tech-Industrie und so weiter, das Ganze so weit treiben, dass man Operations, also Server betreiben, Cloud aufsetzen und Reliability und Failover und Storage und was da nicht alles gehört, durch Prompt Engineering steuern kann. Also ich meine jetzt nicht nur, hey, GitHub Copilot, setzt mir bitte jetzt hier via Terraform eine AWS-Instanz auf, sondern ich meine wirklich komplett Operations. Wir haben einen Inzident. Kann ich durch Prompt Engineering in fünf bis zehn Jahren meinen Inzident lösen? Oder kann ich dadurch Upgrades machen? Oder ... na ja, die ganze Thematik halt.",
      "start": 259978,
      "end": 346823,
      "confidence": 0.7769618644067796,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist eine sehr intelligente Frage, weil eigentlich können die Dinger ja nur unter Anführungszeichen bestehendes Wissen verknüpfen. Also verknüpfen ist eh schon übertrieben, weil es kann die AI eh nur geringfügig, aber zumindest bestehendes Wissen nutzen. Und das Problem bei diesen ganzen Bugs und Incidents ist ja oft, dass man gar nicht weiß, um was es sich eigentlich handelt. Aber wenn man natürlich genug Datenpunkte hat, wie man reagiert, auf Inzidenz und vielleicht bei Standard Inzidenz, also die Festplatte läuft voll oder sowas, dass man da vielleicht dann mit einer AI reagieren kann, könnte man durchaus vorstellen. Oder man geht in die Richtung, dass man Prompt Engineering macht, dass man sagt, okay, man gibt dann nur mehr ein, das ist ein Festplatten-Error, clean die Festplatte oder löscht irgendwelche Logs und was dann wirklich gelöscht wird, passiert automatisch, aber klingt auch sehr Erschreckend muss ich sagen, aber könnte man durchaus vorstellen, dass zumindestens die Arbeit erleichtert wird in Zukunft vom Incident Management.",
      "start": 347203,
      "end": 408191,
      "confidence": 0.8184567901234565,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und warum habe ich dieses Intro gewählt? Weil jetzt die flache Überleitung zu unserem heutigen Thema kommt. Wolfgang, wie würde deine Vision und Mission zu dieser Frage aussehen, wenn du eine Firma gründen würdest, die dieses Ziel erreichen möchte?",
      "start": 408231,
      "end": 422314,
      "confidence": 0.8727948717948718,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, meine Mission wäre, den ganzen DevOps-Leuten mehr Freizeit zu bringen.",
      "start": 422654,
      "end": 427875,
      "confidence": 0.8784166666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da gehe ich sowas von mit. Und wie wird die Vision aussehen?",
      "start": 427916,
      "end": 431657,
      "confidence": 0.5540833333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Vision ist jetzt schon schwieriger. Die Vision, wenn man so rechnet, zehn, 15 Jahre, die werden irgendwie konkreter vielleicht in Richtung Tools, die richtigen Tools an die Hand geben, um im Alltag etwas zu erleichtern, um die Incident Management zu erleichtern. Irgendwie vielleicht was Konkreteres, wobei 15 Jahre natürlich auch immer schwierig ist. Das ist, wie man schon sieht, nicht sehr einfach und vor allem, wenn du mir jetzt so spontan fragst, innerhalb von Sekunden irgendwas zu erstellen, weil es wurde ja auch unterschätzt, dass die Vision und Mission doch ein wichtiger Punkt ist in Teams und in Firmen und man das nicht so einfach übers Knie brechen kann in ein paar Sekunden. Also da steckt schon teilweise viel dahinter und man sollte es auch nicht unterschätzen, wie wichtig das ist und wie viel Zeit es braucht.",
      "start": 431677,
      "end": 475475,
      "confidence": 0.8216666666666669,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt habe ich dich natürlich einfach so bloßgestellt, aber holen uns doch mal bitte kurz alle ab. Wovon reden wir hier eigentlich und was ist das heutige Thema?",
      "start": 475635,
      "end": 482039,
      "confidence": 0.7802857142857142,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also heute geht es um die Vision und die Mission von Teams und wie das die Teamarbeit verbessern kann. Und für alle, die jetzt sagen, ich hatte nämlich auch mal so einen Kollegen, der gesagt hat, wer eine Vision hat, soll zum Arzt. Auch allen, die diese Meinung haben, hört mal kurz weiter, weil im Endeffekt betrifft es wirklich jeden und jede in dem Team und Eine gute Vision und Mission zu haben in einem Team oder in der Firma kann wirklich das tägliche Leben, die Entscheidungen, die man so tagtäglich in seinem Hamsterrad trifft, wirklich erleichtern und verbessern und beschleunigen. Also wir probieren jetzt, derjenige fühlt sich vielleicht angesprochen mit der Meinung, dass man zum Arzt soll, wenn man eine Vision hat, aber wir probieren dich jetzt zu überzeugen, falls du zuhörst. Andi, ist dir irgendwo mal Vision, Mission untergekommen in deinem Engineering-Manager-Leben?",
      "start": 482059,
      "end": 529160,
      "confidence": 0.8387430555555548,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich will nicht fast sagen täglich, aber schon recht regelmäßig. Und zwar ist es halt oft so, dass ich halt besonders in One-on-Ones oder Teamgesprächen, wo wir ein bisschen mehr über Arbeitsprozesse und Priorisierung sprechen, dass dann die Teammitglieder anfangen, okay, aber warum priorisieren wir denn jetzt Thema A über Thema B? Und das ist immer eine sehr, sehr gute Frage. dann versucht man da Kontext drüber zu geben und irgendwann endet man halt an dem Punkt, wo man erklärt, wofür man eigentlich arbeitet. Also was ist eigentlich unsere Northstar-Metrik? Was ist eigentlich unser übergeordnetes Ziel und weswegen arbeiten wir hier natürlich? Und die Antwort ist nicht, dass wir die Geschäftsführerin reicher machen, sondern was ist denn der übergeordnete Zweck neben Geld, neben Reichtum, neben erfolgreichem Unternehmertum? Also was treibt uns denn alles an und wozu kontributieren wir hier eigentlich?",
      "start": 529521,
      "end": 580030,
      "confidence": 0.8028652482269503,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn du jetzt zurückdenkst an deine ganzen Teams, die du bisher geleitet hast oder auch wo du drin warst, wenn dir da jetzt immer jemand eine Frage gestellt hätte, was ist denn dein Ziel, was ist deine Vision oder deine Mission als Team oder als Firma, hättest du da immer eine Antwort gehabt bei allen Firmen?",
      "start": 580631,
      "end": 596393,
      "confidence": 0.8149285714285716,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nein, überhaupt nicht. Und zwar besonders in meiner beruflichen Anfangszeit war mir das eigentlich völlig egal, weil ich war froh, dass ich einen Job habe, ich hatte Spaß am Programmieren, alles super. Über Zeit stellt man sich halt die Frage, warum stehe ich eigentlich jeden Morgen auf und warum arbeite ich eigentlich genau für diese Firma. Ich möchte nicht sagen, das ist die Midlife-Crisis, weil da bin ich, glaube ich, noch nicht. Aber man stellt sich halt schon die Frage, okay, warum mache ich das Ganze hier und wofür? Und ich beobachte das auch bei den Teams und bei den Teammitgliedern. Die Leute, die jetzt keine 18 oder 20 sind, sondern ein bisschen länger schon im Job, die nehmen halt mehr und mehr teil an diesen Diskussionen, was man wie priorisiert, welche Arbeit denn wirklich wichtig ist und welche Arbeit eigentlich wirklich einen Impact für das Business hat und das übergeordnete Ziel zu erreichen. Und nein, ich habe natürlich nicht immer eine Antwort gehabt, weil ich muss auch zugeben, dass nicht jede Firma, in der ich gearbeitet habe, von Anfang an eine Vision oder Mission hatte. Und es ist ja auch was anderes, wenn die Firma eine Mission und eine Vision an die Wand schreibt, dann gilt es ja immer noch als Teamleiter und Engineering Manager und Abteilungsleiter. die herausfordernde Übersetzungsaufgabe zu leisten. Das bedeutet, nur weil die Firma eine Vision und Mission hat, heißt das ja nicht, dass das Team sich dazu connecten kann und genau weiß, wie man dazu kontributiert.",
      "start": 596433,
      "end": 673919,
      "confidence": 0.80965873015873,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, das ist auch wirklich ein schwieriger Punkt, weil das, was du jetzt ansprichst, ist so dieses Purpose und jeder will für eine Firma arbeiten mit einem sinnvollen Purpose. Kann man das eigentlich überhaupt ins Deutsche übersetzen? Purpose, Zweck?",
      "start": 674555,
      "end": 687243,
      "confidence": 0.7774500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Moment, ich mache mal Prompt Engineering bei DeepL. Verwendungszweck und Zweck, Ziel.",
      "start": 687263,
      "end": 691985,
      "confidence": 0.7630833333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, klingt sehr schwach. Also Purpose Driven, wie es so schön heißt. Das ist ja auf der Firmenebene, aber wenn du jetzt in einem DevOps-Team bist, dann bist du ja sehr, sehr weit weg von der eigentlichen Vision und Mission. Und es ist zwar schön, wenn du bei Patagonia arbeitest, die haben zum Beispiel die Mission We are in business to save our home planet. Ist natürlich sehr cool, aber wenn du jetzt in irgendeinem DevOps-Team bist, bist du halt doch sehr weit weg von diesem Missionsstatement und drehst dich da in deinem Hamsterrad, Incident Management, spielst Feuerwehr den ganzen Tag. Und dann fragt sich es natürlich schon, wie kommst du aus diesem Hamsterrad raus und bei den täglichen Entscheidungen, wo ist da die Mission und die Vision von deinem DevOps-Team zum Beispiel? Und wie steht es in Connection zu dem Firmenstatement oder zu der Mission von der Firma? Und da merkt man halt oft, dass ich auch, gerade wenn sich Leute bei mir zum Beispiel in 101 oder so beschwert haben, es ist so chaotisch im Team, alle laufen in irgendeine andere Richtung und wir sind eigentlich nur im Hamsterrad und kommen da gar nie raus, da merkt man halt dann oft, dass eben solche Werte oder irgendwelche Ziele oder so Leitlinien, irgendwelche Säulen fehlen, an denen man sich auch festhalten kann, wo man dann tagtäglich bei einer Entscheidung sagen kann, okay, wir haben diese zwei Projekte, wie weit kontributieren die zu unseren Zielen, zu unserer Mission, zu unserer Vision und ist dann im Endeffekt A oder B besser. Und wenn eben diese Leitlinien fehlen, dann hat man im tagtäglichen Geschäft wirklich ein Problem und kann eben nicht so schnell entscheiden. Und ich glaube, darum ist es eben wichtig, solche Visionen und Missionen, auch wenn viele drüber lachen und dann sagen, du musst zum Arzt, wenn du so eine Vision hast, dass dir die aber schon helfen können und vor allem auch argumentativ helfen können in der Diskussion mit einer Kollegin, Kollegen zum Beispiel. Was machen wir? Was ist wichtiger? In welche Richtung sollen wir gehen, wenn wir etwas umsetzen? Was ist besser? Und da sollen eigentlich diese Missionen und Visionen helfen, um wirklich schneller voranzukommen. Und ich glaube, das unterschätzt man, wie wichtig das im tagtäglichen Leben ist, vor allem, wenn man in einem Team arbeitet und vielleicht nicht allein oder zu zweit, aber sogar zu zweit kann es schon hilfreich sein, wenn man sich einfach gemeinsam ein Ziel setzt, wo will man hin, weil dann Entscheidungen einfach viel, viel leichter fallen. Und dann wird schon weniger Chaos im Team. Und darum sollte man sich immer fragen, also vielleicht fragt euch jetzt mal selber, haben wir in unserem Team eine Mission und eine Vision? Haben wir die auf Firmenebene, ist vielleicht schon eher bei größeren Firmen der Fall, aber haben wir die wirklich auf Team-Ebene, auch wenn wir nur zwei Personen sind, haben wir dann ein richtiges Ziel? Muss ja gar nicht Vision und Mission heißen, aber ein Ziel. Das ist mal ein guter Anfang.",
      "start": 692025,
      "end": 845687,
      "confidence": 0.8047357001972396,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So Wolfgang, jetzt schwafelnd war schon die ganze Zeit über Vision und Mission und du hast sie auch schon von Patagonia genannt, du als alter Bergsteiger. Aber bisher habe ich immer noch keinen Plan, was eine Vision ist, was eine Mission ist und wo eigentlich der Unterschied ist.",
      "start": 845951,
      "end": 858090,
      "confidence": 0.7485833333333335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, die zwei Begrifflichkeiten werden ja auch ganz gerne gemeinsam verwendet. Und je nachdem, wie detailliert man sich das natürlich anschaut, kann man einfach Ziele sagen im weitesten Sinne, ist schon okay. Aber wenn man sich das ein bisschen genauer anschaut und vielleicht auch definieren will, dann sollte man die zwei Begrifflichkeiten schon auseinanderhalten. Und der große Unterschied ist eigentlich, dass die Mission einer Firma oder eines Teams definiert, für was die Firma steht. Das heißt, langfristig, jederzeit, was sind die Werte von einer Firma, was ist der Sinn, dieser Purpose, wie du schon richtig sagst, was sind die Werte und was sind die Ziele. Das sollte in einem kurzen Statement verankert sein, so wie bei Patagonia zum Beispiel, mit dem We are in business to save the planet. Das ist immer gültig, das ist jetzt kein Ziel, sondern das ist, warum sind wir da oder auch als Team zum Beispiel, wir sind da, um die Infrastruktur aufrechtzuerhalten, Oder wir sind da, um das Leben der Entwickler zu vereinfachen. Zum Beispiel, wenn die Entwickler eher die Kunden sind. Also das ist der Sinn des Teams. Im Gegensatz dazu, die Vision, die ist eigentlich ein Ziel auf fünf bis zehn Jahre. Was will man wirklich konkret erreichen? Die ändert sich natürlich auch dementsprechend immer wieder mal. Die Mission sollte sich im Idealfall natürlich weniger ändern, weil das ist ja so eigentlich ein Wert, den man hat als Team. und als Firma und dann hat man immer die konkretere Vision, wo will man hingehen, so wie du gesagt hast, dieser Node-Stern-North-Star-Metrik, wo will ich eigentlich hin, was ist unser gemeinsames Ziel als Team, als Firma und dann kann man sich konkret dann im Alltag oder in den jährlichen Planungen überlegen, wie kommt man zu diesem Ziel hin. Also die Sachen sind schon sehr unterschiedlich und braucht auch beide und darum sollten die Dinge gut überlegt sein und definiert sein, weil die eben, würde ich mal sagen, fünf bis zehn Jahre mindestens gültig sein sollen.",
      "start": 858759,
      "end": 975668,
      "confidence": 0.8497921686746991,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hast du mal ein, zwei Beispiele von populären Unternehmen zu deren Vision und Mission, damit wir mal was zum Anfassen haben?",
      "start": 975928,
      "end": 982495,
      "confidence": 0.840809523809524,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nehmen wir mal Tesla als Beispiel. This mission statement is to accelerate the world's transition to sustainable energy. Und die Vision is to create the most compelling car company of the 21st century by driving the world's transition to electric vehicles. Also da sieht man schon, die Vision ist jetzt konkret auf Autos bezogen und die Mission ist, dass man die Transition zur Sustainable Energy schafft. Also das ist ein größeres Ziel und das kann natürlich jetzt mit Autos erreicht werden, wie in der Vision. Aber die Grundwerte sind eigentlich, dass man diese Wende schafft, die Energiewende. Und die könnte natürlich auch mit etwas anderes als Autos passieren. Also da sieht man schon auch den Horizont und wie konkret das Ganze ist. Das eine bezieht sich auf die nächsten 15 Jahre, der Leader zu werden mit den E-Cars und auf der anderen Seite die grundsätzlichen Werte, wo man hin will. Und darum, die Werte sind wahrscheinlich wesentlich länger gültig und im Idealfall eben immer gültig und die Vision kann sich dann eben je nachdem auch öfters ändern. Also dieses Tesla Beispiel finde ich ganz gut, weil das eine schöne Trennung zeigt. Man muss dazu sagen, ganz viele Companies, da klingen die Mission Statements teilweise wie die Vision Statements. Wie gesagt, ich finde, das sollte schon eine klare Trennung sein. Andi, hast du vielleicht Negativbeispiele, wie etwas nicht sein sollte?",
      "start": 982515,
      "end": 1062720,
      "confidence": 0.7961834061135373,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ein relativ schlechtes Beispiel für eine Vision ist zum Beispiel, nehmen wir mal vom Baumaschinenhersteller, wenn man sagen würde, wir wollen die größte...",
      "start": 1063000,
      "end": 1071468,
      "confidence": 0.7523750000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist klar, dass du wieder mit einer Baumaschine kommst. Wirklich weit weg von Tech und irgendwas, was man auf dem Bauernhof verwenden kann.",
      "start": 1071508,
      "end": 1077713,
      "confidence": 0.7316666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da könnte man zum Beispiel sagen, wir wollen der größte Baumaschinenhersteller in Europa werden. Und das ist halt relativ schlecht, weil er setzt einfach Baumaschine und Europa durch jedes andere Produkt, Branche oder Region. Weil wenn man da mal drüber nachdenkt, ist das halt nicht wirklich inspirierend und so eine Vision und Mission sollten halt schon inspirierend sein. Weil wenn man jetzt mal wirklich drüber nachdenkt, im Endeffekt wollen Kunden ja gar keine Baumaschine kaufen. Sie wollen Löcher kaufen. Aber das Problem ist, Löcher kann man halt nicht kaufen. Weil wenn man mal drüber nachdenkt, ok warum hab ich eigentlich eine Baumaschine, das besagt eigentlich, ok ich möchte ein Loch bohren und ein Loch bohren möchte ich in der Regel um etwas da durchzuziehen oder etwas aufzuhängen. So nehmen wir mal das Beispiel von etwas aufhängen. Wenn man jetzt mal von diesem Use Case ausgeht und sagt, ok wenn ich könnte, würde ich ein Loch kaufen. Wenn man das weiter denkt, dann fängt man automatisch an, Innovationen zu entwickeln und vielleicht sogar neue Wettbewerber zu erkennen, also wirklich eine reale Unternehmensbedrohung, bevor es eigentlich zu spät ist. Und das kann natürlich dazu führen, okay, wenn ich jetzt keine Löcher kaufen kann, muss ich denn überhaupt ein Loch bohren? Wenn man die ganze Thematik dann halt mal bei 1, 2, 3, Bier weiterdenkt, könnte es natürlich sein, dass man alternative Systeme, wie zum Beispiel den Tesa Power Strip entwickelt, was dann auch die Möglichkeit hat, etwas aufzuhängen, ohne ein Loch zu bohren. Wenn man da jetzt mal weiterdenkt, kann man natürlich auch für einen Bohrmaschinenhersteller eine Vision und eine Mission erstellen, die vielleicht gar nicht wirklich mit Bohrmaschinen zu tun hat, sondern irgendwie, wir wollen das Aufhängen von Regalen revolutionieren oder für jedermann zugänglich machen oder oder oder.",
      "start": 1077753,
      "end": 1177743,
      "confidence": 0.8064949494949493,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist ja das, was auch Tesla oder Patagonia gemacht hat, die eben mit der konkreten Vision gar nichts mehr zu tun haben. Wir wollen die Energiewende vorantreiben, wir wollen unsere Umwelt schützen. Das hat mit der eigentlichen Vision gar nichts zu tun, sondern eben das sind die Grundwerte und das wäre das gleiche wie du sagst, unseren Kunden zu helfen etwas aufzuhängen und Und da kann halt Bohrmaschine im weitesten Sinn ein Punkt sein. Und ich glaube, das, was du jetzt gesagt hast, ist schon ein guter Punkt, wie man auch zu dieser Vision überhaupt kommt oder zu dieser Mission. Weil man muss sich ganz gut überlegen, was hat man denn eigentlich für Kunden? Und das muss man als Team auch überlegen. Wenn du jetzt ein DevOps-Team hast, musst du dir überlegen, Wer sind eigentlich deine Kunden? Und deine Kunden sind wahrscheinlich nicht die Kunden von deiner Firma, sondern die Kunden sind vielleicht die Developer, denen du eine möglichst einfache Entwicklungsumgebung geben willst, dass die einfach Sachen deployen können, dass die Sachen stabil betreiben können, dass die gut schlafen können. Das heißt, deine Kunden sind dann vielleicht Entwicklerinnen intern in der Firma. Und das muss man zu Beginn mal wirklich überlegen, für wen ist dieses Team eigentlich da? Für wen arbeitet man? Für wen sitzt man denn in diesem Hamsterrad? Und dazu muss man mal einfach hinauszoomen, aus diesem Hamsterrad herauskommen, mal das Hamsterrad stoppen, einen Schritt zurück. Für wen arbeite ich eigentlich und wer sind unsere Kunden? Und das ist natürlich gar nicht so eine leichte Frage, aber eigentlich die wichtigste Frage zu Beginn, um überhaupt auf diese Mission zu kommen. Und wenn man dann mal die Mission hat, wenn man weiß, was die Werte sind, was man eigentlich grundlegend erreichen will, jeden Tag, dann kann man auf die Vision gehen. Wie wollen wir jetzt konkret unsere Mission weitertreiben und in den nächsten fünf bis 15 Jahren etwas erreichen im Sinne unserer Mission?",
      "start": 1177783,
      "end": 1284525,
      "confidence": 0.8210584615384613,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich stimme dir schon zu, aber ich denke gerade auch darüber nach, über die Teamkonstellation, weil innerhalb eines Teams gibt es ja sehr wahrscheinlich auch Leute, die sagen, okay, ich gehe jetzt einfach nur zur Arbeit, ich setze mich hier hin, mache acht Stunden meiner Arbeit, ohne dass ich über den größeren Sinn und Zweck nachdenke, weil ich muss ja arbeiten, um die Miete zu zahlen. Das bedeutet Leute, die gar keine Relation zum Produkt, zur Firma oder ähnliches haben wollen, was ich meines Erachtens nach völlig okay finde. Man muss ja arbeiten, um die Miete zu bezahlen, um die Kosten zu bezahlen und somit ist die Arbeit Mittel zum Zweck, weil ganz unten drunter gebrochen ist die Definition von Arbeit, Zeit und Fähigkeit im Austausch von Geld, was völlig okay ist. Ich bin persönlich einer der sagt okay ich muss ein bisschen Sinn in meiner Arbeit sehen ich muss das Produkt glauben weil ich denke mir wir verbringen so viel Zeit auf der Arbeit, dass ich das nicht sinnlos wegschmeißen soll. Meine Frage ist jetzt eigentlich, was du ja jetzt indirekt forderst ist dass das ganze Team sich kontinuierlich Gedanken macht okay wer sind meine Kunden und wie kann ich denen keine Bohrmaschine verkaufen sondern eigentlich Löcher.",
      "start": 1284705,
      "end": 1341936,
      "confidence": 0.8021826923076923,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Naja, es ist ja nicht so, dass man das tagtäglich macht, sich diese Gedanken. Und das kommt ja meistens auch von oben in irgendeiner Form, dass man sich sagt, okay, wir setzen uns jetzt mal zusammen als Team und überlegen uns jetzt vielleicht Mission und Vision in einem Workshop oder wie man das auch immer handhabt. Und da sollte dann natürlich jede Person im Team eingebunden sein. Und ich glaube schon, dass man einen gewissen Sinn auch sehen muss. Und vielleicht ist man weniger verknüpft mit dem Ziel der Firma. Wenn jetzt die Firma, keine Ahnung, Betten herstellt, hat man vielleicht auch weniger Bezug. Aber wenn ich im DevOps-Team arbeite, dann sind ja meine Kunden nicht mehr die Leute, die ein Bett kaufen, sondern die Entwicklerinnen. Und dafür sollte dann schon brennen, dass ich ein cooles System auf die Beine stelle für meine Entwicklerinnen zum Beispiel, dass ich denen hilfe, wenn ich im Support-Team bin. Ich finde, dafür muss man eigentlich dann schon brennen. Und das hat nichts mit Bettenverkaufen zu tun, aber man hat halt dann auch andere Kunden in dieser Bettenfirma und für die sollte man in irgendeiner Form brennen. Das heißt ja nicht, dass man tagtäglich mit voller Motivation an die Sache drangehen muss, aber eine gewisse Grundmotivation, meiner Meinung nach, sollte da schon vorhanden sein. Und sogar wenn die Motivation nicht vorhanden ist und man wirklich nur tagtäglich in die Firma geht und sagt, man will jetzt arbeiten, dann muss man ja doch Entscheidungen treffen und wenn man im Team diskutiert, sollen wir A oder B machen, dann ist es auch gut zu wissen, wer sind die Kunden, was ist unsere Mission, was ist unsere Vision, machen wir A zuerst oder machen wir B zuerst. Also auch das, wenn mir eh alles egal ist eigentlich, auch das hilft dann trotzdem in meinem Alltag einfach, außer ich bin alleine, dann kann ich immer das für mich entscheiden, aber sobald ich im Team bin, werde ich früher oder später solche Diskussionen haben und da hilft eine Mission und eine Vision auf jeden Fall weiter.",
      "start": 1342214,
      "end": 1446618,
      "confidence": 0.8143815028901737,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber was ich jetzt eigentlich fragen wollte ist, du hast dann jetzt irgendwie die Hälfte des Teams, die sind völlig engaged und die haben Bock auf sowas und die wollen wirklich den Sinn und Zweck ihrer Arbeit sehen und die andere Hälfte, die sitzt dann da einfach und sagt immer, pass mal auf Wolfgang.",
      "start": 1447338,
      "end": 1459583,
      "confidence": 0.7149818181818179,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn du Visionen hast, sollst du zum Arzt.",
      "start": 1459603,
      "end": 1461764,
      "confidence": 0.5195,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, sowas zum Beispiel oder wenn die sagen, Wolfgang gib mir die Aufgabe und ich mach die einfach, gut ist, du bist mein Abteilungsleiter hier, komm ich mach einfach was von mir verlangt. Meine Frage ist jetzt eigentlich, okay, du rufst jetzt ein Meeting ein oder sagst Workshop 4, 5, 6, 7, 8 Stunden. Lass mal versuchen irgendeine Vision und eine Mission für unser Team zu kriegen, zu bauen, die anhand der Firmenvision und Mission abgeleitet ist. Jetzt ist es ja so, du brauchst ja schon 100% Engagement von den Teammembers. Du brauchst ja schon, okay, die müssen ja dabei sein, die müssen ja vielleicht ein bisschen ihren Senf dazugeben und so weiter. Lässt du die Hälfte des Teams dann einfach außen vor und sagst, okay, pass mal auf, wenn ihr keinen Bock habt, dann setzt euch einfach dahin, spielt mit der Nintendo Switch, und wenn wir fertig sind, kriegt ihr das Ergebnis? Oder hattest du so was schon mal? Und wenn ja, wie bist du damit umgegangen?",
      "start": 1461784,
      "end": 1504527,
      "confidence": 0.6838869047619046,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, so Mission und Vision kommen ja auch teilweise, muss man ganz ehrlich sagen, von oben. Also, die Firmen Mission und Vision, die wir jetzt als kleines Teammitglied wahrscheinlich weniger beeinflussen können. Wenn man weiter runtergeht auf die Teamebene, hoffentlich wird ein ... wird eine Teamlead-Person das Team einbinden natürlich. Wer nicht motiviert ist, eingebunden zu werden, der wird sich halt weniger beteiligen an der ganzen Sache. Ist aber auch okay, dass da nicht volles Commitment dabei sein kann bei jedem, ist auch klar. Manche, wie es halt immer ist, sind motivierter, sind weniger motivierter. Aber man kann im Nachhinein zumindest sagen, ihr wart alle eingebunden. Ihr hättet da auch was ändern können. Das heißt, im Nachhinein kann sich dann eigentlich auch niemand mehr beschweren, wenn er mit der Vision nicht einverstanden ist, wenn man sich nicht daran beteiligt hat. Also ich glaube, das ist schon wichtig, alle irgendwie ins Boot reinzuholen. Aber dass nicht jeder gleich motiviert mitwirkt bei sowas, ist auch klar. Und wenn du eine harte Meinung hast, dass du zum Arzt sollst, wenn du eine Vision hast, dann wirst du vielleicht die Person auch gar nicht umstimmen können. Aber ich würde die Person trotzdem mitnehmen, ganz klar. Extremer wird es natürlich, wenn du jetzt Leute hast, die aktiv dagegen arbeiten, wenn du jetzt in so einem Workshop so eine negative Energie drin hast von jemandem. Aber das ist natürlich ein grundsätzliches Problem, glaube ich, wenn du so jemanden im Team hast. Da würde ich halt empfehlen, das einfach vorab möglichst abzuklären, wenn man schon weiß, okay, es gibt Personen, die haben da eine negative Einstellung darüber. Es ist sowieso gut, wenn man im Vorhinein mal vielleicht Einzelgespräche führt, um das zu erklären, was das Ziel ist, dass man das vielleicht auch erklärt, was ist eine Mission, was ist eine Vision, warum machen wir das eigentlich, was bringt uns das, dass die Leute vielleicht auch die Vorteile erkennen darin und dann schon positiver in diese Workshops reingehen. Also Vorgespräche sind normal immer zu empfehlen und vielleicht kann man dann die eine oder den anderen noch mitnehmen und für die anderen ist es einfach auch gut, sich vorzubereiten auf auf so einem Workshop, um mehr Input dann geben zu können. Also möglichst früh abholen ist, glaube ich, immer eine gute Möglichkeit, um alle ins Boot zu holen. Übrigens, um jetzt mal die ketzerische Frage rauszuholen, hat dein aktuelles Team, Andy, wo du Teamlead bist, eine Vision und eine Mission?",
      "start": 1504567,
      "end": 1635408,
      "confidence": 0.8087250608272502,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Antwort ist ja und nein. Also, erstens...",
      "start": 1635428,
      "end": 1638090,
      "confidence": 0.83075,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt nur ja oder nein.",
      "start": 1638530,
      "end": 1639791,
      "confidence": 0.6623333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, richtig. Deswegen sage ich ja oder nein. Mein Team hat jetzt gerade nicht eine eigene Vision und Mission. Es ist aber auch so, dass es immer öfter aufkommt in Teammeetings und Co. Das bedeutet, über kurz oder lang werden wir auch eins erstellen. Zweitens ist es auch so, dass die Firma sehr, sehr starkem Wachstum unterliegt und deswegen, dass die Teamkonstellation auch noch sehr, sehr neu ist. Das bedeutet, wir sind vielleicht sogar noch in der Forming- oder in der Norming-Phase, wenn du dich an Teamphasen erinnerst und noch gar nicht so wirklich in der Storming-Phase und dann Für alle, die jetzt.",
      "start": 1639811,
      "end": 1679931,
      "confidence": 0.8343203883495143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Keine Ahnung haben, von was da Andi redet, haben wir eine eigene Episode zu den fünf Phasen der Teamentwicklung, verlinken wir in den Show Notes.",
      "start": 1679951,
      "end": 1686294,
      "confidence": 0.7541199999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das bedeutet, wenn spätestens, wenn wir wirklich kurz vor Ende der Storming-Phase sind, werden wir uns damit auseinandersetzen. Es ist aber jedoch so, dass ich natürlich in einer Tech-Firma arbeite und wir natürlich auch ein Technologie-Produkt haben, das bedeutet Database as a Service. Und deswegen, also unsere Firmenmission ist, to make developers life easier, also das Leben von Entwicklern einfacher zu machen und da wir eine Infrastruktur.",
      "start": 1686314,
      "end": 1708649,
      "confidence": 0.8111194029850748,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist das die Vision oder die Mission?",
      "start": 1708669,
      "end": 1710470,
      "confidence": 0.6045714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Mission.",
      "start": 1710490,
      "end": 1711251,
      "confidence": 0.698,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Mission, okay. Habt ihr auch eine Vision auf der Firmenseite, die öffentlich ist?",
      "start": 1711291,
      "end": 1715475,
      "confidence": 0.7243571428571427,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nein, ich glaube, die ist nicht öffentlich. Deswegen kann ich die jetzt auch hier nicht nennen, weil wir sind ja keine Public Listed Company, deswegen ist es immer ein bisschen schwierig, was ich nennen darf und was nicht. Der Punkt ist aber, dass wir eine Infrastrukturfirma sind und ich natürlich als SAI mit einem SAI-Team, mit einem Infrastruktur-Team natürlich ganz vorne dabei bin. Das bedeutet, es ist jetzt für unser team deutlich einfacher direkt zu der firmen mission zu kontributen weil wir verantwortlich für produktion sind für production das bedeutet wenn die datenbanken nicht laufen ist das leben von entwicklern eindeutig nicht einfach und deswegen ist es ist das vielleicht eine unfaire frage weil es kommt immer ganz stark auf die firma an in welchem team man ist und die größte herausforderung die ich halt auch sehe ist eine vision und mission zu formulieren wo wirklich jede abteilung kontributen kann und speziell in so riesen firmen ist es unglaublich hart eine griffige vision für einen multinationalen internationalen mischkonzern mit diversifizierte produkt portfolio zu erstellen ja.",
      "start": 1716728,
      "end": 1778091,
      "confidence": 0.8254628571428574,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also dieses bingo jetzt diese bingo kombination.",
      "start": 1778191,
      "end": 1781793,
      "confidence": 0.5417142857142858,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Her Also wie würdest du zum Beispiel Riesenkonzerne wie 3M bezeichnen? Das sind mit hoher Wahrscheinlichkeit multinationale Mischkonzerne mit diversifizierter Produktportfolio, oder?",
      "start": 1781893,
      "end": 1791499,
      "confidence": 0.8166818181818182,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "3M ist ganz easy, wir erleuchten die Welt quasi.",
      "start": 1791579,
      "end": 1795561,
      "confidence": 0.8252222222222222,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie erleuchtest du denn mit Post-its und Helmen die Welt?",
      "start": 1795601,
      "end": 1798003,
      "confidence": 0.7936,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hab gedacht, die haben überall Reflektionssachen oben, ne?",
      "start": 1798103,
      "end": 1800885,
      "confidence": 0.5385555555555556,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hab noch nie reflektierende Post-its gesehen. Na ja, aber der Punkt ist ganz einfach, wenn du halt so einen Riesenschiff hast, dann ist es natürlich unglaublich hart.",
      "start": 1801885,
      "end": 1810009,
      "confidence": 0.6306785714285714,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber ich glaub natürlich, genau da ist es umso wichtiger, dass du auf Team-Ebene oder auf Subfirma-Ebene solche Missionen und Visionen hast. Und ich glaub sogar, was du jetzt gesagt hast, für dein Team, das ist auch so eine Ausrede. Wir kontribuieren da eh zu dem globalen Ziel. Weil ich glaub, dass das schon wichtig ist, auf der Team-Ebene auch so eine Mission und Vision zu haben. weil du ein ganz anderes Teamgefühl dann bekommst, wenn du auch das gemeinsam als Team entwickelst und gemeinsam dahinter stehst, da hast du so ein gemeinsames Teamgefühl, dass du auch viel besser in die Performingphase zum Beispiel kommst mit einem Team, weil der Teamzusammenhalt auch gestärkt wird. Wenn du mal durch so einen Workshop durchgehst und dir gemeinsam überlegst, wofür du stehst, das hat natürlich schon auch vorteile und sogar wenn man das gar nicht mission und vision nennt sondern einfach gemeinsame ziele und ganz dumm an die sache drangeht und sagt einfach was sind denn unsere gemeinsamen ziele was wollen wir erreichen ohne da jetzt einen großen fast rum zu machen mit workshop und pipapo dann, Ich glaube, bringt das auch schon viel weiter und stärkt das Team. Also ich würde auf jeden Fall sagen, dass das hilfreich ist und auch das tägliche Leben wirklich erleichtert. Und das ist, glaube ich, ein Baustein, um auf diese Performing-Phase zu kommen, um ein gutes Team zu haben, was sich als Team fühlt und auch gemeinsam als Team agiert und so wirklich die Sachen auf die Straße bringt.",
      "start": 1810069,
      "end": 1888467,
      "confidence": 0.8014347826086958,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das bestreite ich auch gar nicht. Das habe ich auch ganz von Anfang gesagt, dass es kommen wird. Und genauso wie relevante Themen wie zum Beispiel ein Team Charter. Was ist das Team eigentlich? Wofür steht das Team eigentlich? Wir hatten auch Werte mal ganz kurz angesprochen. Und welche Verantwortlichkeiten hat das Team? Und auch vielleicht eine Abgrenzung zu machen, welche Verantwortlichkeiten hat das Team nicht? Weil es ist ja auch immer, eine Gefahr, dass in einem Start-up, Scale-up oder ähnliches, in einer kleineren Firma, deine Abteilung als sogenanntes Catch-all-Department ist. Ja, so nach dem Motto, wir wissen gerade nicht, wohin und deswegen wird dieses Team dieses Produkt machen und das, keine Ahnung, wie gesagt, ist ein Suchmaschinenprodukt und ihr müsst dann nebenbei noch den Registrierungsservice machen. Sorry, aber das passt vorne und hinten nicht ins Portfolio. Und deswegen ist halt auch so eine Vision und Mission und auch ein Team-Charter schon recht sinnvoll, um die Identifikation des Teams zu stärken. Während du gesprochen hast, habe ich aber gerade mal nachgeschaut. Was ist das Mission Statement von 3M? Das Mission Statement von 3M, die machen ja wirklich alles. Post-its, Gehörschutz, Helme, du von mir aus auch Reflektoren, das wusste ich jetzt auch noch nicht. Aber die machen ja wirklich alles. Mich würde auch nicht wundern, wenn die auch Klopapier machen. So, 3M hat sich verpflichtet, durch Umweltschutz, soziale Verantwortung und wirtschaftlichen Fortschritt aktiv zu einer nachhaltigen Entwicklung beizutragen.",
      "start": 1888647,
      "end": 1960877,
      "confidence": 0.7425168067226892,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Scheint irgendwie sehr in zu sein, jetzt einfach als Mission Statement immer auf die Umwelt zu drehen, dann hat man da keine Probleme und das klingt gut. Das müsst ihr vielleicht bei eurer Firma auch machen. Ihr probiert mit Databases as Service die Energiewende zu forcieren.",
      "start": 1961648,
      "end": 1974418,
      "confidence": 0.7879347826086956,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Achso, meinst du in wir machen das Leben von Entwicklern einfacher, kommt Sustainability zu kurz? In dem Mission Statement stimmt das schon. Na ja, der Punkt ist aber, Wolfgang, ich stimme dir schon zu, um wirklich ein Performing-Team zu haben, sollte die Richtung klar sein, die Nord-Star-Metrik. Und wofür tun wir das denn Ganze? Denn ich denke, wenn jedem der Sinn und Zweck klar ist, wird über mittel- bis langfristig Innovation gefördert und auch wirklich die Kreativität der Mitarbeiter gefördert und hoffentlich dann auch genutzt. Somit kann man natürlich auch aus eigenen Ideen eigene Produkte machen, weil man kann ja immer sich auf das Mission und Vision Statement zurückziehen und sagen, hey, pass mal auf, diese Idee wird uns genau an diesem Statement contributen.",
      "start": 1974879,
      "end": 2019074,
      "confidence": 0.7823951612903227,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder auch umgekehrt, man kann auch sagen, okay, dieses Request, was jetzt da reinkommt, auch von der Chefetage vielleicht kann man sagen, okay, hey, das passt aber überhaupt nicht mit unserem Mission Vision, Statement zusammen. Sollen wir das wirklich machen? Macht das Sinn? Bringt uns das wirklich weiter? Also man kann da dann auch challengen mit sowas. Ich glaube, das ist schon auch ganz praktisch. Und man muss ja auch dazu sagen, dieses Statement, das ist ja der Outcome von einem längeren Prozess. Und der Prozess an sich ist auch ganz wichtig. Weil du diskutierst da ja am Weg ganz viel, bis du mal zu diesem Statement kommst und da hast du dann vielleicht zehn Statements zur Auswahl zwischendrin, machst ein Voting. Also der ganze Prozess schweißt ja auch zusammen und der hilft auch die Gedankengänge anzuregen. dass man darüber nachdenkt, was machen wir mit unserem Team eigentlich? Wo wollen wir hin? Also dieser ganze Prozess ist, glaube ich, auch ganz, ganz wichtig für das Team und für alle Mitglieder. Und das kleine Statement, was da am Schluss rausputzelt, das ist quasi nur das Ganze kondensiert aus diesem Prozess und auf das man dann zurückgreifen kann. Aber der Prozess an sich ist auch ganz, ganz wichtig. Und alles, was während dieses Prozesses dann.",
      "start": 2019094,
      "end": 2086505,
      "confidence": 0.8161877934272301,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Entsteht, Falls ihr diese Episode mal hört und ihr seid doch gar nicht wirklich im Klaren darüber, was ist eigentlich die Vision, die Mission von meiner Firma, in der ich gerade arbeite, das ist zum Beispiel ein perfektes Thema für das nächste One-on-One oder für die nächste Town-Hall oder All-Hands-Meeting, wenn ihr sowas regelmäßig habt oder so Ask-Me-Anything-Sessions für euren Vorgesetzten oder Abteilungsleiter oder vielleicht CEO oder Geschäftsführer. Und das sind Fragen, die sollten die meisten eigentlich parat haben. Und dann könnt ihr auch kritische Fragen stellen. Okay, hab ich jetzt verstanden, aber wie kontribute denn ich zu dieser Vision und Mission? Was ist denn meine konkrete Aufgabe? Und das sind sehr, sehr gute Fragen, um mal wirklich den Purpose und das Warum hinter eurem Job wirklich zu fragen. Und natürlich aber auch, um euren eigenen Impact in der Firma gegebenenfalls zu korrigieren, beziehungsweise zu verbessern oder neu auszurichten. Jetzt stellt sich natürlich die Frage, kann die ganze Sache auch ohne Ziele funktionieren? Also das bedeutet, kann eine Firma auch erfolgreich sein ohne Vision und Mission Statement?",
      "start": 2086545,
      "end": 2145467,
      "confidence": 0.8087401129943502,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, es geht natürlich immer ohne und es kann auch eine Firma geben, die andere Wege gefunden hat, klar. Was ich aber glaube schon glaube ist, dass wenn man im Team arbeitet, dass das einfach das Leben erleichtert. Als Einzelperson kann ich das vielleicht nur ohne Mission, ohne Vision irgendwie durchführen, da bin ich mein eigener Chef, da kann ich tagtäglich entscheiden, was ich so will, aber auch da glaube ich sind Ziele gar nicht so schlecht, was man erreichen will, mit einer Firma zum Beispiel, aber sobald im Team arbeitet, und das ist halt im Team das Problem, dass alle irgendwo hinlaufen, jeder hat eigene Präferenzen, jeder will irgendwas Spezielles machen und um ein Team in eine Richtung zu lenken, Ich glaube, es ist ganz wichtig, dass man sich gemeinsam eben mal hinsetzt und darüber nachdenkt, wo will man hin. Und da ist Mission, Vision eine Möglichkeit dazu. Es gibt natürlich auch ganz viele andere Möglichkeiten mit Leitbilder, Wertedefinitionen, OKRs. Es spielt alles in eine ähnliche Richtung, würde ich mal sagen, um ein Team in eine Richtung zu bringen. Aber dass man ein Team in eine Richtung bringt, dass man einen gemeinsamen Strang zieht, dass man in eine gemeinsame Richtung geht und auch in eine Richtung priorisiert, das ist, glaube ich, in irgendeiner Form nötig, um überhaupt ein funktionierendes Team zu haben. Und da ist halt Mission, Vision, Definieren eine Möglichkeit, um eine gemeinsame Leitlinie zu haben.",
      "start": 2145507,
      "end": 2223470,
      "confidence": 0.8312394957983198,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Meines Erachtens nach sind zum Beispiel die Zielsetzungen, wie du bereits sagtest, OKRs, halt nur ein Teil davon. Und Vision, Mission, Teamvision, Teammission, OKRs, also Quartalsziele und Co., die contributen alle zum großen Ganzen, sind aber alles auf verschiedenen Ebenen und alles aus verschiedenen Zeiträumen ausgelegt. Und deswegen, das klingt jetzt alles immer super kompliziert, und vielleicht baut man da auch irgendwie so einen riesen Wasserkopf auf Ja, vielleicht ist es auch valide in einer 5-Mann-Firma oder einer 10-Mann-Firma gar nicht so viel darüber nachzudenken. Und auch je nach Firmenart ist es natürlich eine ganz andere Sache. Wenn ich jetzt eine klassische Agentur bin, die wirklich Auftragsarbeiten für externe Kunden macht, ja, auch die kann eine Vision und Mission haben, wird aber gegebenenfalls schwieriger. Und je nach Größe, wenn es jetzt eine 100-Mann, 200-Mann-Agentur ist, dann sollte man da wirklich schon mal drüber nachdenken, weil es halt umso schwieriger ist, je mehr Leute man an Bord hat, alle in eine Richtung zu lenken.",
      "start": 2223830,
      "end": 2281232,
      "confidence": 0.7906748466257671,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, wenn du keine Ziele hast, dann wird es deine Firma bald nicht mehr geben. Wenn du nur dahin wurschtelst, wie man bei uns in Österreich so schön sagt, dann glaube ich, wird das langfristig nicht funktionieren. Das ist meine tiefste Überzeugung.",
      "start": 2282013,
      "end": 2294230,
      "confidence": 0.7541162790697674,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, da stimme ich dir zu.",
      "start": 2294410,
      "end": 2295592,
      "confidence": 0.6696666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber es geht eine gewisse Zeit sicher ganz gut, ja.",
      "start": 2295632,
      "end": 2298256,
      "confidence": 0.7332,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Frage ist ja, muss man dann immer so einen Wasserkopf da oben drauf bauen. Also das bedeutet, muss man immer eine Vision haben, muss man immer eine Mission haben, muss man dann immer als nächstes Level OKRs haben und so weiter und so fort.",
      "start": 2298631,
      "end": 2307534,
      "confidence": 0.7460444444444444,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Darum habe ich ja auch gesagt, ich glaube, wenn man einfach das ganz simple startet und sagt, was sind unsere Ziele, definieren wir mal gemeinsame Ziele, das ist ja auch schon sowas. Also das andere sind halt definierte Dinge wie Mission, Vision, das hilft halt, da kann man einfach was nehmen, was schon wo es viel Material dazu gibt, wo man was nachlesen kann. Aber man kann sich da auch ein eigenes Framework schaffen. Und wenn man mal einsteigt, ist es vielleicht sogar besser, dass man mit etwas Einfachem einsteigt, je nachdem, was man erreichen will. Aber ich glaube, die Zieldefinition grundsätzlich, die ist wichtig.",
      "start": 2307554,
      "end": 2337093,
      "confidence": 0.8275523809523809,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also falls ihr damit mal ein bisschen starten wollt, meines Erachtens nach solltet ihr irgendwie lean starten, relativ klein, relativ schmal. Und ihr könnt diese Vision, Mission, Ziele und Co auch einfach als iterativen Prozess betrachten. Fangt erstmal mit den kurzfristigen Zielen an. Was ist denn mein Ziel in diesem Monat? Was ist denn mein Ziel in den nächsten drei Monaten? Und dann kann man ja immer weiterdenken, weil umso länger der Zeithorizont, desto unklarer wird das eigentlich, besonders in der schnelllebigen Ekonomie gerade. Und deswegen ist das völlig in Ordnung, falls sich deine langfristigen Ziele über Zeit ändern. Das Wichtige ist nur, dass man die Gründe dafür relativ klar und detailliert formuliert, damit man da auch die Zustimmung und das Verständnis vom Team hat und die ganze Gruppe mitnimmt, falls sich irgendwie die Richtung ändert. Wenn ihr damit starten wollt und ihr seid sogar in der glücklichen Lage, dass ihr vielleicht sogar ein bisschen Budget habt, irgendwie eine externe Person reinzuholen. Es gibt ein paar gute Strategie-Mission-Vision-Coaches draußen und ein Einblick von außen hilft da doch schon sehr. Von außen kann aber auch heißen Abteilungsextern. Das bedeutet, arbeitet ihr in einer Riesenfirma, vierstellige Anzahl an Mitarbeitern, kann das auch helfen, dass ihr einfach mal eine erfahrene Person aus einer ganz anderen Abteilung, aus einem ganz anderen Arbeitsbereich reinholt. Einfach mal jemanden, der, wie soll ich sagen, prozessextern ist und der einfach mal einen anderen Blickwinkel reinbringt.",
      "start": 2337534,
      "end": 2419926,
      "confidence": 0.8144936708860758,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Andi, glaubst du, dass wir jetzt schon alle Spotify-Hörerinnen verloren haben? Unsere Statistiken sagen ja immer, wenn wir irgendwelche team-related Sachen machen, dann sterben uns die Spotify-Hörerinnen und Hörer alle weg und die Apple-Hörer und Hörerinnen bleiben uns scheinbar erhalten. Also für alle, die jetzt auf Spotify hören, vielen Dank, dass ihr noch dabei seid.",
      "start": 2420227,
      "end": 2441484,
      "confidence": 0.8000181818181817,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich verstehe, dass dieses ganze Thema ein bisschen esoterisch sein kann und da war ich auch genau dieser Meinung ganz am Anfang. Doch umso länger ich in diesem Job bin, umso länger ich mich frage, okay, warum stehe ich eigentlich jeden Morgen auf? Warum hebe ich eigentlich die ganzen Server immer auf und die ganzen Prozesse und allem drum und dran? Wofür mache ich das denn? Desto wichtiger finde ich die Antwort auf die Frage, wieso ich für diese spezifische Firma arbeite und nicht für Heckler & Koch zum Beispiel. Weil nämlich auch die eigenen Regeln, die sich viele Entwickler setzen, wie zum Beispiel, ich würde nie für Heckler & Koch arbeiten, ich würde nie für eine Waffenfirma oder ähnliches arbeiten, diese Regel habe ich mir irgendwann mal gesetzt. Und da fragt man sich natürlich, okay, warum setzt man denn diese Regel? Mit hoher Wahrscheinlichkeit, weil man sich mit dem Produkt nicht identifizieren kann oder nicht möchte. Auf jeden Fall ist das ja eigentlich gar nicht so weit entfernt von, ich glaube, an die Mission und die Vision der Firma. Und deswegen kann ich verstehen, wenn ihr sagt, boah, was labern die da jetzt schon wieder für esoterische Kram. Ja, sprecht doch einfach mal mit euren Vorgesetzten und Vorgesetzten über diesen Themen und stoßt das einfach mal an. Macht euch mal Gedanken, okay, was hält mich denn an dieser Firma, warum bin ich hier? Und jetzt sagt nicht immer Kultur. Kultur ist auch so ein Riesenthema, ja. Man muss ja irgendwie, nicht jeder muss Krebs heilen, das verstehe ich, aber ich denke, jeder sollte sich bewusst sein, wofür wir unsere Arbeitskraft, ich nenne es mal, hergeben. Deswegen kann ich verstehen, dass ziemlich viele Leute raus droppen bei dem Thema. Ich denke aber auch, dass diese Personen, dass viele dieser Personen sich noch nicht für solche Themen interessieren. Aber mit dem Alter kommt die Weisheit oder die weißen Haare.",
      "start": 2441504,
      "end": 2534702,
      "confidence": 0.7873993710691828,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Beides meistens, hoffentlich.",
      "start": 2534742,
      "end": 2536403,
      "confidence": 0.765,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dann wird es sich drehen. Naja, aber was wir auch in den Statistiken sehen, Spotify oder Apple, dass manche Hype-Themen, und bei Hype-Themen nenne ich mal zum Beispiel Computerbild-Themen. Computerbild-Themen sind Themen wie vor ein paar Jahren responsive Webdesign oder jetzt vielleicht Docker. dass die recht steil gehen in unseren höheren zahlen und jetzt können wir uns überlegen gehen wir nur auf computerbild themen oder machen wir das was wir denken ist richtig und wo wir spaß haben also was ist eigentlich die vision und die mission vom engineering kiosk.",
      "start": 2536443,
      "end": 2570919,
      "confidence": 0.8182222222222221,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eindeutig uns Spaß zu bereiten. Aber wir sind natürlich auch offen für Feedback und Vorschläge von eurer Seite, was euch interessiert. Wir würden natürlich auch gerne wissen, was ihr zu dem ganzen Thema Mission und Vision denkt und ob ihr immer noch der Meinung seid, dass man, wenn man eine Vision hat, besser zum Arzt gehen soll. Schickt uns das Ganze gerne auf Twitter, ING Kiosk oder auch per E-Mail an stetisch.engineeringkiosk.dev und vielleicht sollten wir die nächste Woche einfach nutzen, Andi, um eine Vision und Mission für Engineering Kiosk zu definieren. Vielleicht publischen wir die dann nächste Woche.",
      "start": 2571337,
      "end": 2603855,
      "confidence": 0.8106767676767674,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Lass uns das machen. Uns würde auch noch sehr, sehr freuen, wenn ihr uns vielleicht ein bisschen weiter empfehlt. Einfach mal eine Episode euren Arbeitskollegen schicken. Und mich persönlich interessiert, was sind die Herausforderungen bei euch zu diesem ganzen Thema? Ist es wirklich hart esoterisch oder was sind eure Probleme bei den Themen Vision und Mission? Das war's von uns für diese Woche. Wir wünschen euch einen schönen Tag.",
      "start": 2603895,
      "end": 2625113,
      "confidence": 0.8183043478260869,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bis bald. Ciao.",
      "start": 2625153,
      "end": 2625754,
      "confidence": 0.38033333333333336,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.8001248602310866,
  "audio_duration": 2633.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
