{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/dec7248a-aa64-4e44-9cd8-e3ff49fd1abc/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "621cp78ldz-f670-42dc-8559-a4321f72c52d",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk. In dieser Folge geht es um Diversity. Ein Thema, was von vielen kontrovers, sehr wichtig, aber auch mit viel Respekt angesehen wird. Wir klären, was Diversität bedeutet und wo der Unterschied zu Inklusion und Gleichberechtigung ist, welcher Effekt dies auf Teams haben kann, wie es um Diversityquoten und Mangel an IT-Kräften steht, aber auch, warum es für viele Leute schwierig ist, dieses Thema zu besprechen. Genug Geschwafel, springen wir direkt rein. Viel Spaß.",
            "start": 4808,
            "end": 33907,
            "confidence": 0.8469876543209878,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Andi, ich gratuliere zur 50. Episode. Hättest du dir jemals gedacht, dass wir so weit kommen? Nee, hätte ich nicht.",
            "start": 38585,
            "end": 44111,
            "confidence": 0.6689999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich bin wirklich froh, dass wir es Woche für Woche durchziehen.",
            "start": 44131,
            "end": 47235,
            "confidence": 0.8606363636363636,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du bist aber ziemlich negativ.",
            "start": 47255,
            "end": 49637,
            "confidence": 0.5568,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich bin realistisch, du kennst das doch. Man beginnt mit etwas Neuem, hat eine Idee, ist motiviert, weil man nicht genau weiß, wie es funktioniert. Ich glaube schon, nach 50 Folgen haben wir schon eine Idee, wie die ganze Thematik funktioniert. Und irgendwann schwenkt das um von Neugier in Arbeit. Und das ist auf der Punkt, wo die meisten Leute aufgeben. Deswegen bin ich von mir, aber auch von uns beiden selbst überrascht, dass wir das mit unseren doch deutlich unterschiedlichen Leben und Lebensstilen hinbekommen.",
            "start": 49678,
            "end": 75349,
            "confidence": 0.8119882352941173,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber nachdem wir jetzt keine großen Feierleute sind, haben wir uns ja entschieden, nicht groß zu feiern, sondern einfach thematisch weiterzumachen. Aber nachdem das ja die 50. Episode ist, habe ich mir was wünschen dürfen, ein Thema wünschen dürfen. Und zwar ist das ja ein Thema, was bei mir schon lange auf der Liste steht, aber wo du dich immer so ein bisschen geweigert hast, über dieses Thema zu reden. Und zwar ist es dieser ganze große Themenblock rund um Diversity. Andi, was hast du für ein Problem damit?",
            "start": 75529,
            "end": 103222,
            "confidence": 0.8013483146067416,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe überhaupt kein Problem mit Diversity. Ich denke, dieses Thema ist unglaublich wichtig. Warum ich nicht gerade Feuer und Flamme war, darüber zu sprechen, ist ganz einfach, weil ich sehr hohen Respekt vor diesem Thema habe. Und mein Respekt kommt primär daher von dem, was ich so in den sozialen Medien über dieses Thema beobachte. Denn ich habe das Gefühl, wenn man darüber spricht, muss man sehr genau aufpassen, was man sagt und wie man es formuliert. Und geschriebene Kommunikation ohne die Körpersprache zu lesen und Co. ist ja auch schwierig, sofern man dort doch die öffentlichen fälle die man beobachtet sind halt so falls jemand mal etwas nicht richtig ausgedrückt hat kommt oft eine sehr laute gruppe und es wird wirklich diese person wird dann öffentlich an den pranger gestellt und speziell wenn man als weißer alter cis mann oder weiße zwei alte weiße cis men unterhalten sich ja jetzt hier auch über diversity ist das so eine sache dass weil wir sind nicht von den negativen elementen die das ganze thema diversity versucht zu lösen betroffen also zumindest merken wir dies nicht wie so stark wie unterrepräsentierte gruppen und deswegen wird halt oft gesagt okay zwei weiße alte cis männer dürfen sich nicht über das thema unterhalten und ihr wisst ja gar nicht worum es geht und ja wir wissen ja auch nicht, wie sich sowas anfühlt, weil wir können uns halt nicht in die Lage von unterrepräsentierten Gruppen versetzen, das ist alles richtig, doch man wird halt recht schnell an den öffentlichen Pranger gestellt und deswegen habe ich höchsten Respekt vor diesem Thema.",
            "start": 103722,
            "end": 187597,
            "confidence": 0.8360299625468166,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube, bei gewissen Aussagen und Leuten macht es sogar Sinn, diese an den Pranger zu stellen, wenn es darum geht, einfach das in die Öffentlichkeit zu bringen, aber da können wir später nochmal drüber reden. Aber du hast natürlich recht, zwei alte weiße CIS-Männer sprechen über Diversity. What could possibly go wrong? Da wird es sicher einiges an Gegenwehr geben, aber ich glaube, es ist trotzdem wichtig und wir werden da später noch drauf eingehen, warum es meiner Meinung nach so wichtig ist, auch über dieses Thema zu sprechen. Und ich glaube, es kann jeder eine Meinung haben und es kann jeder eine Meinung vertreten und darum ist es, glaube ich, auch wichtig, über solche Themen zu sprechen, auch wenn es alte weiße Zismänner sind, aber wir haben natürlich keine Gäste und können daher auch niemanden einladen. Das ist aktuell unsere Regel. Also müssen wir mit uns über dieses Thema sprechen. Aber auch wir sind Teil von dem Ganzen und in der IT, wo Firmen auch probieren, sehr progressiv zu sein. Das ist ein großes Thema und darum finde ich es auch wichtig, dass man darüber einerseits in der IT spricht, aber auch natürlich ganz allgemein, weil es in der Gesellschaft wichtig ist. Und wenn wir jetzt schon über IT sprechen, es hat ja auch in letzter Zeit ein paar so Entwicklungen gegeben, wer es vielleicht verfolgt hat, bei Basecam zum Beispiel, weil die ist ja sehr, wie soll man das am besten sagen, eine Firma, die sich auch sehr stark präsentiert und sehr laut ist. Die haben ja zum Beispiel eine neue Regel eingeführt, dass über Politik intern nicht mehr gesprochen wird, um einfach Konflikte vorzubeugen.",
            "start": 187838,
            "end": 272545,
            "confidence": 0.8041182795698928,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zur Erinnerung Basecamp ist die Firma von den zwei Gründern David Heinemeyer-Hansen kurz für DHH, das ist der Erfinder von dem populären Framework Ruby on Rails und Jason Fried. Die beiden haben Basecamp gegründet, vor kurzem den E-Mail-Service Hey! gelauncht. und sind eigentlich recht bekannt dafür würde ich mal sagen immer so ein bisschen gegen den strom zu schwimmen und deswegen in der ganzen internet community ziemlich für bass zu sorgen und mit der regel.",
            "start": 273065,
            "end": 303002,
            "confidence": 0.8501333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nicht mehr über politik intern zu sprechen über internet tools haben sie natürlich auch ziemlich viel, Gegenwind bekommen, MitarbeiterInnen haben gekündigt, sogar relativ viele. Also das war schon ein großes Thema. Aber es gibt auch andere Entwicklungen, wo vielleicht auch viele jetzt im deutschsprachigen Raum sagen, brauchen wir das wirklich? Pronouns sind so ein Klassiker. Also das haben sicher schon alle mal gesehen. In Slack gibt es jetzt ein eigenes Feld für die Pronouns, wo man eben he, his, her, they, whatever dort reinschreiben kann. Was bei uns vielleicht auch, was ich so mitbekommen habe, auch einiges an Kopfschütteln auslöst, muss man ganz klar sagen, oder auch so harte Regeln in Amerika, die schon relativ üblich sind, dass man zum Beispiel in einem Lift, weißt du was ein Lift ist, Andi, oder heißt das bei euch wieder Fahrstuhl?",
            "start": 303022,
            "end": 351075,
            "confidence": 0.8202681159420289,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Fahrstuhl ist halt schon ein Wort, was wir nutzen, aber ich glaube, das weit verbreiteste ist Aufzug.",
            "start": 351715,
            "end": 356036,
            "confidence": 0.7807058823529411,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Whatever, wir sagen Lift.",
            "start": 356436,
            "end": 358957,
            "confidence": 0.8119999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Lift ist...",
            "start": 359017,
            "end": 360057,
            "confidence": 0.9125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Der Skilift, ich weiß schon, ja.",
            "start": 360077,
            "end": 361637,
            "confidence": 0.5425000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist doch das englische Wort auch für Aufzug, nee, Elevator, ne?",
            "start": 361677,
            "end": 364458,
            "confidence": 0.7817272727272727,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, gibt's beides, britisch und amerikanisch.",
            "start": 364498,
            "end": 368198,
            "confidence": 0.8171666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Habt ihr auch einen Passanoster?",
            "start": 368218,
            "end": 369959,
            "confidence": 0.76,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jaja, natürlich.",
            "start": 369979,
            "end": 370999,
            "confidence": 0.731,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die werden, glaube ich, in Deutschland, sind jetzt gerade verboten, wusstest du das eigentlich?",
            "start": 371039,
            "end": 374080,
            "confidence": 0.7133571428571429,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, sind bei uns natürlich auch verboten, aber es gibt noch so ein paar ganz alte, die irgendwie halt so Sondererlaubnisse haben oder die noch fahren.",
            "start": 374100,
            "end": 381121,
            "confidence": 0.7018846153846157,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ja, ganz genau. In ein paar Ämtern gibt es das, aber da dürfen nur die Beamten mitfahren. Also normale Leute, die in das Amt gehen, dürfen nicht mehr mit dem Paternoster fahren. Ich bin mir nicht sicher, warum. Ich glaube, Verletzungsgefahr oder so.",
            "start": 381591,
            "end": 391538,
            "confidence": 0.7585909090909092,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, wenn man euch auf den Kopf stellt, ist das einfach ein Problem. Aber es gibt eben mittlerweile in Amerika oft die Regel, dass man in einem Lift oder Fahrstuhl oder Aufzug mit einer Frau als Mann alleine nicht mehr fahren darf, sollte, damit eben keine Situationen entstehen, die in irgendeiner Form problematisch sein könnten. Und da habe ich auch schon viel Kopfschütteln gesehen in meinem Umfeld und im deutschsprachigen Raum. Und genau über solche Entwicklungen, auch in Bezug auf IT und unsere Erfahrungen, was wir bisher so miterlebt haben, über die wollen wir in dieser Episode sprechen.",
            "start": 391558,
            "end": 426110,
            "confidence": 0.8290000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hatten wir ja schon erwähnt, dass wir beide zwei alte weiße Cis-Männer, wir können ja nicht über Diversity reden. Warum siehst du das anders? Weil ich meine, wir sind nicht so stark betroffen wie unterrepräsentierte Gruppen. Wir wissen nicht, wie diese Personen sich fühlen. Warum hältst du es trotzdem für wichtig, dass wir über dieses Thema sprechen?",
            "start": 426187,
            "end": 443265,
            "confidence": 0.803844827586207,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich würde nicht sagen, dass wir nicht betroffen sind von Diversity. Wir sollten übrigens auch mal klären, was Diversity überhaupt ist, weil das ist ein großer Begriff, der für alles irgendwie verwendet wird. Aber ich glaube schon, dass wir betroffen sind von dem ganzen Diversity-Thema, weil wir zum Beispiel als Leads ja auch probiert haben, unsere Teams diverser aufzustellen. Wir sind aber natürlich privilegiert. Wir sind jetzt keine unterrepräsentierte Gruppe. Das heißt, wir sehen das ganze Thema natürlich von einer anderen Seite, aber umso wichtiger ist es, glaube ich, dass auch privilegierte Leute über dieses Thema sprechen. Und wir wissen zwar nicht, wie sich das anfühlt, und wir wollen ja auch nicht beschreiben, wie sich sowas anfühlt, aber wir können durchaus unsere Sicht auf das ganze Thema betrachten. Und um wieder zurückzukommen, warum Diversity wichtig ist, da gibt es natürlich jetzt ganz viele Gründe, Aber wenn man ganz wirtschaftlichen Grund sieht, jetzt von der IT-Seite, von Firmenseite, ist einfach, dass wirklich zahlreiche Studien gezeigt haben, dass diverse Teams einfach besser performen, besseren Output haben, mehr Innovation an den Tag bringen, was natürlich jetzt in Tech-Unternehmen noch viel, viel wichtiger ist. Und ich kann auch ein ganz persönliches Beispiel bringen, was lang vor meiner IT-Zeit eigentlich schon an den tag getreten ist ich war sehr lange jugendbetreuer bei der freiwilligen feuerwehr und wie wir dann mädels in der jugendfeuerwehr gehabt haben also elfjährige hat sich einfach die ganze team dynamik geändert und plötzlich für mich als jugendbetreuer war es viel einfacher dieses team zu handeln also was ganz egoistisch ist für mich war, dass es dann für mich als Jugendbetreuer einfacher war, weil einfach die ganzen Burschen nicht mehr so aufgedreht haben. Und man würde vielleicht meinen, dass es eher umgekehrt ist, dass die sich probieren zu profilieren, weil da jetzt Mädels dabei sind. Aber es war eigentlich eher so, dass alle dann Erwachsener waren und das Team wirklich einfacher zu handeln war, interessanter war, besser war, bessere Gespräche und da reden wir von Elfjährigen. Also das ist wirklich schon sehr früh zu erkennen und das war eigentlich so meine erste Begegnung, wo ich dann gemerkt habe, so Teamdynamiken sind anders, bevor ich überhaupt gewusst habe, dass es da ganz viele Studien dazu gibt und den wissenschaftlichen Proof, dass das wirklich auch in der Firmenwelt was bringt, diverse Teams zu haben.",
            "start": 443525,
            "end": 572292,
            "confidence": 0.8344219948849106,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber jetzt hol mich doch mal bitte ab, oder hol auch mal unsere Hörerinnen und Hörer ab. Was ist denn Diversity? Weil ich hab nämlich das Gefühl, da ist irgendwie alles und nichts, beziehungsweise das Wort wird in sehr vielen unterschiedlichen Kontexten fallen gelassen. Und ich würde gern wissen, was ist Diversity, was verstehst du unter Diversity?",
            "start": 572605,
            "end": 590239,
            "confidence": 0.802228070175439,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich glaube, der bessere Begriff, von dem heutzutage im Firmenumfeld auch oft verwendet wird, ist DYE, also D-E-I, steht für Diversity, Equity und Inclusion, also Diversität, Gleichberechtigung und Inklusion. Und da sieht man schon, dass es drei Begriffe gibt, die gerne unter dem Dachbegriff Diversity verwendet werden, die aber unterschiedliche Dinge meinen. Und so gibt es auch eine Bedeutung von Diversity, die zum Beispiel von Inklusion unterschiedlich ist. Und wenn man über Diversity spricht, spricht man eigentlich von der Vielfalt von Menschen und Lebensformen, unabhängig davon, was sie für physische oder psychische Fähigkeiten besitzen oder Merkmale, was ihr Hintergrund ist, ihre Erfahrung, das heißt, ihre sozioökonomischen Hintergründe, die Erziehung, Religion ganz klassisch natürlich, Familienstand, sexuelle Orientierung, Neurodiversität ist mittlerweile auch ganz ein großes Schlagwort, also zum Beispiel Autismus würde da drunter fallen, ganz allgemein Lebenserfahrung, also einfach unterschiedliche Backgrounds in einem Team zum Beispiel haben. Das ist ein diverses Team und dafür steht Diversity.",
            "start": 590507,
            "end": 662291,
            "confidence": 0.8518580645161289,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe aber das Gefühl, dass das im sozialen Kontext unglaublich oft allein auf Geschlecht und Hautfarbe begrenzt wird. Oder ist das gegebenenfalls einfach nur das am leichtesten zu verstehende Thema dann?",
            "start": 662311,
            "end": 676644,
            "confidence": 0.8628125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das wird natürlich immer ganz in den Vordergrund gerückt und ist sicher ein großes Thema, weil da die Unterschiede natürlich auch sehr sichtbar sind und das ein gesellschaftliches großes Problem ist. Aber Diversity ist natürlich auch Österreich und Deutschland, wir zwei zum Beispiel, mit unserem Background, mit unterschiedlichen Backgrounds. unterschiedliche Länder, auch wenn sie jetzt nicht so verschieden sind. Aber wir haben ja, glaube ich, auch schon mal darüber gesprochen, dass wir bei Trivago zum Beispiel eine deutsche und österreichische Variante hatten, weil es einfach kleine, feine Unterschiede in der Sprache gibt. Und sowas findest du natürlich auch eher heraus, wenn du zum Beispiel einen Österreicher und einen Deutschen im Team hast.",
            "start": 676684,
            "end": 711906,
            "confidence": 0.814071428571428,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hattest du gesagt, okay, der Begriff steht unter anderem für ein großes Spektrum an Religion, Familienstand, sexuelle Orientierung oder vielleicht sogar Behinderung. Jetzt ist meine Frage, im Firmenkontext werden ja öfters mal so Diversity Reports erstellt. Und das sind ja Elemente, die den Arbeitgeber ja eigentlich gar nichts angehen. Und in diesen Diversity Reports wird es halt sehr oft auf simpel Geschlecht runtergebrochen. Wie siehst du das, wie spielt das zusammen, dass dann eigentlich im Definitionssinne sehr wichtige Elemente einer diversen Arbeitsbelegschaft, ich will nicht sagen unter den Tisch gekehrt werden, aber nicht mit einbezogen werden, weil sie dort für das Wissen des Arbeitgebers nichts zu suchen haben. Also Beispiel, meine sexuelle Orientierung hat ja meinen Arbeitgeber eigentlich nicht zu interessieren. Genauso wie meine Religion.",
            "start": 711926,
            "end": 760315,
            "confidence": 0.8242857142857141,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, hoffentlich. Trotzdem wird die Religion immer abgefragt, oder? Aber da geht es um die Feiertage, wenn ich mich nicht täusche.",
            "start": 760795,
            "end": 766378,
            "confidence": 0.6707142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Je nach land geht es feiertage steuern blablabla aber die die diese diversity reports die teilweise auch veröffentlicht werden simplifizieren das ganze doch dann oder.",
            "start": 766958,
            "end": 776990,
            "confidence": 0.8144,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Natürlich, aber du musst natürlich irgendwo anfangen und es gibt natürlich gewisse Kategorien, die du durchaus erfassen kannst. Es ist ja auch freiwillig zum Beispiel, dass du das Geschlecht mittlerweile in Formularen und so weiter angibst. Das heißt, es ist ja auch auf freiwilliger Basis. Aber wenn du das natürlich als Firma irgendwie vorantreiben willst und mehr Diversität fördern willst, dann brauchst du natürlich auch irgendwo eine Metrik. So hart es auch klingt, aber du brauchst natürlich irgendwo eine Metrik, um deinen Progress zu messen. Bist du besser? Wird deine Diversität besser in den Teams? Und dann musst du natürlich sowas tracken und auch dementsprechend Reports generieren. Und für uns ist das teilweise ein bisschen komisch, aber in Amerika ist das ja ganz klassisch auch gesetzlich verankert, dass du dementsprechend deinen Background angeben musst, deinen ethnischen Background, weil das halt auch gesetzlich dementsprechend dann bedeutet, dass da andere Mechanismen greifen.",
            "start": 778203,
            "end": 833216,
            "confidence": 0.81806,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich stelle mir gerade die Frage, ob eine Offenlegung mancher dieser Attribute nicht auch zum negativen switchen kann. Beispiel. Angenommen, ich veröffentlich meine sexuelle Orientierung und jemand ist im Team homophob und ich bin homosexuell. Kann das nicht auch ins Negative umschwenken und dann in Diskriminierung enden?",
            "start": 833516,
            "end": 854069,
            "confidence": 0.8041702127659571,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Natürlich. Und da ist die Inklusion dann ganz wichtig, dass man ein Team hat, wo Inklusion gelebt wird. Und für mich war das zum Beispiel auch ein ganz komisches Erlebnis, muss ich sagen, wie ich aus Tirol, aus meinem Tiroler Tal, wenn man es so will, da aus Österreich rausgekommen bin. Und wie bei Trivago gestartet habe damals, habe ich innerhalb kürzester Zeit auch von Team-Mitgliedern, wo ich dann Lead war, das heißt da kommt ein neuer Lead rein, und die hatte da zum Beispiel einen Programmierer in meinem Team, der hat mir im ersten Gespräch erzählt, dass er mit seinem Freund auf Urlaub fährt, mit seinem Boyfriend. Also hat in dem ersten Gespräch schon sehr selbstsicher erklärt, dass er homosexuell ist, was für mich in Tirol fast undenkbar war, weil das würde niemand machen, wenn man die Angst hat, dass man da irgendwie einen Nachteil daraus erfahren würde. Und das ist mir ein paar Mal passiert bei Trivago, was für mich natürlich auch dafür spricht, dass da die Inklusion gelebt wird, dass da niemand die Angst hat, sich zu äußern. Aber wie gesagt, in Tirol, würde ich sagen, ist das immer noch ein großes Problem und die kann mir eigentlich nicht vorstellen, in einem österreichischen Betrieb, dass das jemand so machen würde. Jetzt mach ich mir mal die Feinde, Andi, und mach mir ganz Tirol zum Feind.",
            "start": 854109,
            "end": 927076,
            "confidence": 0.8211315789473687,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, du hast jetzt gesagt, okay, was ist also Diversity? Lass uns mal ganz kurz die zwei, drei Begriffe nennen, die du erwähnt hast, und zwar Inklusion und Gleichberechtigung. Was ist denn genau Inklusion? Also, wovon reden wir denn da? Weil ich find, das ist auch wieder so ein Riesenthema.",
            "start": 927136,
            "end": 942665,
            "confidence": 0.7453399999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, Inklusion haben wir jetzt bei den Beispielen eh schon gehört. Da geht es darum, dass man sich in dem Team wertgeschätzt fühlt, egal was eben der Background ist, woher man kommt, dass man da einfach die gleichen Chancen hat und willkommen wird, dass da keine Barrieren aufgebaut werden oder irgendwelche Benachteiligungen aufgrund eben wie der Religion, Familienstand und so weiter. Also ein diverses Team kann nicht inklusiv sein. Zum Beispiel ein diverses Team kann trotzdem Barrieren aufbauen und Teammitglieder benachteiligen, obwohl es divers ist. Und ein inklusives Team kann auch nicht divers sein. Also es kann natürlich ein Team von deutschen weißen CIS-Männern trotzdem inklusiv sein, weil die einfach offen sind, inklusive Sprache verwenden und keine Barrieren aufbauen. Für die ist das natürlich wesentlich leichter, muss man auch dazu sagen, wenn es jetzt gar niemanden gibt, der vielleicht in irgendeine unterrepräsentierte Gruppe fallen wird, wo man dann diskriminieren kann überhaupt, wenn man gar nicht die Möglichkeit dazu hat. Aber grundsätzlich sind diese Begriffe Diversität und Inklusion eben unterschiedlich und können unabhängig voneinander vorhanden oder nicht vorhanden sein in dem Team zum Beispiel. Beispiel.",
            "start": 942685,
            "end": 1016782,
            "confidence": 0.8295869565217393,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, du sagtest, man sollte keine Hürden aufbauen. Da denke ich mal auch, dass da keine Einschränkung zur Bildung oder sowas sein sollte, oder? Fällt das da drunter?",
            "start": 1016842,
            "end": 1027088,
            "confidence": 0.7860714285714285,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, das wäre dann jetzt eher gesellschaftlich, natürlich weniger in der Firma, aber auch, dass man eben nicht diskriminiert aufgrund der Bildung und dass der Zugang zu allen Ressourcen, und Aufstiegsmöglichkeiten in Firmen z.B. auch vorhanden ist und dass da eben nicht diskriminiert wird, weil du jetzt keinen Doktortitel z.B. hast, kannst du nicht aufsteigen in der Firma. Das wäre z.B. ganz klassisch eben auch nicht inklusiv, weil du willst ja z.B. in deiner Führungsebene dann auch möglichst eine Repräsentation haben von den Leuten in der Firma und du willst dann nicht nur Doktoren haben z.B. im Idealfall. oder eben auch Frauen oder eben auch People of Color, was auch immer.",
            "start": 1027127,
            "end": 1067506,
            "confidence": 0.8212972972972974,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Meine etwas Devils Advocate-Frage wäre, wenn ich mir jetzt die elitären Universitäten in Amerika, Harvard, Stanford und wie sie alle heißen, ansehe, oder generell Universitätsbildung, Collegebildung in Amerika, die kostet ja ein Schweinegeld, inklusive deren elitären Auswahlverfahren. Das ist ja schon eine große Einschränkung beim Zugang zur Bildung. Also meine Frage ist eigentlich, sind diese Universitäten und Colleges überhaupt divers in dieser Hinsicht?",
            "start": 1067546,
            "end": 1092265,
            "confidence": 0.7995555555555557,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist natürlich jetzt nicht so leicht zu beantworten, weil ich bin nicht Harvard und Harvard würde jetzt wahrscheinlich sagen, wir sind sehr inklusiv und würden dir ein Report vorsetzen.",
            "start": 1092805,
            "end": 1100692,
            "confidence": 0.7719333333333331,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wo dann Geschlecht reportet wird oder?",
            "start": 1100732,
            "end": 1102834,
            "confidence": 0.7816666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Unter anderem und die würden dir wahrscheinlich auch zeigen, dass sie Leute aufnehmen, die vielleicht aus einer bildungsfeineren Schicht kommen oder sich das eigentlich gar nicht leisten könnten, aber durch Stipendien zum Beispiel nehmen die auch diese Leute mit auf und bringen die ins System zurück, würden die wahrscheinlich sagen. In der Realität ist es aber so, dass alle Studien bei uns zumindest zeigen, dass die ganze Bildung natürlich nicht inklusiv ist und wenn du aus einer bildungsfeineren Schicht kommst, ist es viel schwieriger zum Beispiel auf die Universität zu kommen. Also unabhängig davon, ob du jetzt was zahlen musst oder nicht oder ob das Elite ist oder nicht. Aber diese Unterschiede gibt es und Inklusion probiert eben dagegen anzukämpfen. Und das ist natürlich in der Gesellschaft auf allen Ebenen, aber spielt natürlich in der Firma genauso mit rein. Und das ist dasselbe, wenn du dann schaust, wie viele weibliche Leads gibt es in deiner Firma und wie viele männliche Leads. Klassiker.",
            "start": 1102874,
            "end": 1155255,
            "confidence": 0.8378641975308646,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, zu den Herausforderungen bezüglich zum Beispiel der diversen Besetzung von Schlüsselpositionen kommen wir gleich noch. Lass uns mal kurz zum zweiten wichtigen Begriff kommen, Gleichberechtigung. Was fällt da runter? Also was verstehst du unter Gleichberechtigung?",
            "start": 1155741,
            "end": 1170757,
            "confidence": 0.8519722222222221,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und dein Harvard Beispiel war eigentlich schon ganz gut, es geht auch in die Richtung von Gleichberechtigung, weil man will in der Gleichberechtigung die Chancengleichheit herstellen und die Fairness und Unparteilichkeit und auch die Akzeptanz von allen Menschen mit den unterschiedlichen Backgrounds ohne irgendwelchen Vorurteilen oder Hindernissen begegnen. Und man verwechselt das oft mit Gleichstellung, dass man sagt, okay, aber es muss ja gleich sein. Also eine Frau muss genau die gleichen Chancen haben wie ein Mann und sollte gleich behandelt werden. Gleiche Chancen, ja. Gleiche Behandlung, nicht. Weil zum Beispiel bei Menschen mit Behinderung ist das ja dasselbe. Du kannst Menschen mit Behinderung, die im Rollstuhl sitzen zum Beispiel, nicht gleichstellen, wenn es darum geht, in ein Gebäude reinzukommen zum Beispiel. Also wenn es da um Barrierefreiheit geht, wie komme ich in ein Gebäude rein, soll die Gleichberechtigung da sein. Das heißt, ein Mensch in einem Rollstuhl und ein gehender Mensch sollen die Möglichkeit haben, ein Gebäude zu betreten. Aber du kannst sie nicht gleichstellen, aber du sollst sie gleich berechtigen, dass sie ins Gebäude reinkommen und dementsprechend Barrieren abbauen oder einen Behindertenparkplatz zum Beispiel. Behindertenparkplatz ist einfach näher. Das ist ein gewisser Vorteil, wenn du es so siehst, aber der soll halt die ganzen anderen Nachteile, die die Person erlebt im Alltag, ausgleichen, damit es eine Fairness und eine Chancengleichheit gibt. Und darauf zielt die Gleichberechtigung ab.",
            "start": 1171117,
            "end": 1257845,
            "confidence": 0.8440611353711797,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, habe ich verstanden. Ich habe jetzt ein gutes Verständnis von Inklusion, ich habe ein gutes Verständnis von Gleichberechtigung.",
            "start": 1258345,
            "end": 1263048,
            "confidence": 0.7051052631578947,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und Diversität hoffentlich.",
            "start": 1263068,
            "end": 1264790,
            "confidence": 0.871,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und Diversity natürlich. Doch warum können bzw. sollten sich zwei alte weiße CIS-Männer nun über das ganze Thema unterhalten, obwohl wir zumindest im europäischen Raum ja als sehr privilegiert gelten? Und was heißt eigentlich CIS und fühlst du dich auch alt?",
            "start": 1264830,
            "end": 1280520,
            "confidence": 0.8170975609756095,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So viele Fragen, Andi. Also erstens, ich fühle mich natürlich nicht alt, aber relativ zu dir bin ich natürlich alt. Zu CIS, was bedeutet CIS? Du hast jetzt so oft CIS verwendet. Was bedeutet CIS? Ich stelle mal die Frage zurück.",
            "start": 1280980,
            "end": 1292503,
            "confidence": 0.7924634146341462,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe selber auch erst vor zwei Monaten gelernt, Grüße gehen an meinen Kegelclub raus.",
            "start": 1292543,
            "end": 1297545,
            "confidence": 0.8768,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment, du hast gelernt, was CIS ist in deinem männlichen Kegelclub.",
            "start": 1297605,
            "end": 1302386,
            "confidence": 0.829090909090909,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Richtig, richtig, richtig. Und zwar...",
            "start": 1302426,
            "end": 1304387,
            "confidence": 0.9132,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das nenne ich mal Bildungsauftrag.",
            "start": 1304407,
            "end": 1305727,
            "confidence": 0.5572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Cis bedeutet, dass ich mich mit meinem äußerlich wahrgenommenen Geschlecht identifiziere. Also jemand guckt mich an und sagt, hey, du siehst aus wie ein Mann. Und dann sage ich, ja, ich identifiziere mich auch als Mann. Aber ich habe auch das Gefühl, wenn wir jetzt darüber sprechen, zwei weiße alte Cismänner, also dieser Satz hat ja schon mal einen sehr negativen Unterton. Oder ist das meine Annahme?",
            "start": 1306147,
            "end": 1327518,
            "confidence": 0.8126865671641791,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, der negative Unterton ist entstanden, weil es gibt viele alte weiße CIS-Männer, die über Sachen sprechen, die sie gar nicht verstehen können. Oder dann erklären, ja eine Person of Color fühlt sich so und so und hat ja diese Probleme. Und ich glaube, das ist das Problem. Also wenn man sich anmutet, über irgendwas zu sprechen, das man selber aber gar nicht erfahren kann. Aber man kann ja trotzdem über Dinge sprechen, die wir erfahren haben, die wir miterlebt haben, die wir zum Beispiel als Teamleads miterlebt haben. die uns auch Leute gesagt haben, und man kann natürlich auch ganz harte Fakten oder auch seine eigene Meinung kundtun. Aber ich mute mir natürlich nicht an, jetzt irgendwie zu erklären, wie sich andere Menschen fühlen, ganz allgemein, oder was die erleben, weil das werden wir nie erleben können.",
            "start": 1328018,
            "end": 1372756,
            "confidence": 0.8320000000000007,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das klingt ja sehr stark nach einer fälschlichen Generalisierung.",
            "start": 1372896,
            "end": 1376519,
            "confidence": 0.8672222222222222,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Inwieweit?",
            "start": 1376579,
            "end": 1377480,
            "confidence": 0.876,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, der Satz, alte weiße Cis-Männer wird mit Leuten in Verbindung gebracht, die sich anmaßen, etwas besser zu wissen. Also vielleicht Mansplaining ist, glaube ich, der Begriff, oder?",
            "start": 1377500,
            "end": 1387669,
            "confidence": 0.8749642857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja.",
            "start": 1388089,
            "end": 1388710,
            "confidence": 0.727,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber das heißt ja bei weitem nicht, dass das auf jeden alten weißen Cis-Mann zutrifft. Also also nicht jeder alte weiße Sisman muss ja Mansplaining machen. Ist die, meine Frage ist halt, ist die Generalisierung nicht auch schon irgendwie gegen diese Art von Diversity? Oder wird da etwas zu falsch? Wird da fälschlicherweise generalisiert?",
            "start": 1388750,
            "end": 1407264,
            "confidence": 0.8209444444444444,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, ich weiß schon, worauf du raus willst. Und das geht ja auch in die Richtung, wo du am Anfang erwähnt hast, dass Leute so einen Pranger gestellt werden in Social Media zum Beispiel, wenn sie irgendwas Falsches gesagt haben. Und ob die Leute denn das nicht so ernst meinen mit der Diversity, weil das ist ja auch nur eine Meinung. Aber ich glaube, was wichtig ist, ist dabei zu sagen, Nur weil man diverse Meinungen zulässt, unterschiedliche Meinungen, heißt es ja nicht, dass man einverstanden sein muss mit dieser Meinung. Und man kann natürlich sehr wohl was dagegen sagen. Also diverse Meinungen sind gut, diverse Leute sind gut, aber man kann natürlich mit gewissen Sachen nicht einverstanden sein. Und ich kann natürlich da auch meine Meinung dann dazu sagen, dass ich nicht einverstanden bin. Und wenn ich das in Social Media dann dementsprechend in die Öffentlichkeit bringe, ist das ja nur fair und derjenige muss dann mit seiner Meinung leben, die er gesagt hat. Und es wäre jetzt nicht so, dass die andere Seite da irgendwie sparsam damit umgehen würde. Und darum ist das ja erst entstanden, weil so viele weiße Zismänner irgendwelche dummen Aussagen getätigt haben, dass das halt dementsprechend dann so entstanden ist. Aber der gewisse Unterton, der dann natürlich mitschwingt, da hast du natürlich schon recht, ist eine Generalisierung, die eigentlich nicht gut ist. Und man ist natürlich als weißer Zismann jetzt nicht automatisch irgendwie rassistisch. Ganz klar.",
            "start": 1407524,
            "end": 1482451,
            "confidence": 0.8137489711934155,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Eine Frage, die ich mir gerade stelle, wenn es mehr Leute gibt, die so denken wie ich, dass sie sehr starken Respekt vor der Thematisierung des ganzen Themas Diversity haben, eine falsche Wortwahl zu nutzen und dann vielleicht direkt ins Feuer geraten, ob das nicht einen deutlich negativeren Effekt hat, als wenn man ganz objektiv über die Thematik sprechen würde? Weil das würde bedeuten, wir sprechen jetzt weniger darüber. Weil es sehr viele Menschen gibt, die sich nicht trauen, darüber zu sprechen.",
            "start": 1482738,
            "end": 1510880,
            "confidence": 0.8694634146341459,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, es ist auf jeden Fall schlecht, wenn sich Leute nicht trauen, darüber zu sprechen und ich glaube, darum war mir das ja auch wichtig, über das Thema zu sprechen, auch wenn ich mir bewusst bin, dass jetzt viele vielleicht dann irgendwas angreifen, was man für Begriffe verwendet und was wir so gesagt haben und unsere Meinung, aber ich glaube, wir müssen halt hinter unserer Meinung stehen und Mir persönlich kommt es halt auch oft vor, dass das dann irgendwie so eine Ausrede ist. Ich sage lieber nichts, weil dann habe ich keinen Konflikt. Aber man muss halt Konflikte in gewisser Weise austragen. Und es ist schade, wenn das so empfunden wird, aber ich kann mir halt auch vorstellen, dass es oft einfach eine Ausrede ist. Ich sage lieber nichts, dann kann ich nichts falsch machen. Und das gilt halt für alles und immer und überall. Dann gibt es halt auch keine Diskussion, das stimmt. Nur weil jemand anderer dann anderer Meinung sein könnte und sagt, okay, ich bin anderer Meinung, wenn ich davor Angst habe, dann ist es natürlich ein Problem, ja. Und ich glaube auch, dass eigentlich bis auf ein paar wenigen eine gute Diskussionskultur da ist. Und wenn man auf einem sinnvollen Level und das nicht polemisierend ist, spricht, dann kann man auch, glaube ich, sehr gute Diskussionen führen. Und dass Social Media nicht der ideale Punkt ist, um solche Diskussionen zu führen, ist, glaube ich, auch klar. Egal welche Diskussion.",
            "start": 1511580,
            "end": 1585006,
            "confidence": 0.7862612244897954,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielleicht ist das das Killer-Argument, dass Social Media einfach der limitierende Faktor ist und dass es da gegebenenfalls sehr einfach ist, etwas rauszuposaunen, aber man ganz viele Effekte einer guten Diskussion gar nicht mitkriegt, wie Körpersprache und Co.",
            "start": 1585406,
            "end": 1597775,
            "confidence": 0.8398421052631577,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt warst du ja auch lange Teamlead und bist noch Teamlead. Hast du irgendwelche persönlichen Erfahrungen gemacht bezüglich Diversity und wie sich die Teams verhalten haben?",
            "start": 1597795,
            "end": 1607122,
            "confidence": 0.8068461538461539,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, habe ich, und ich brech die ganze Sache jetzt auf einen sehr simplen Vergleich runter, weil ich jetzt ganz speziell nur aufs Geschlecht gehe. Was ich aber sagen kann, ist, ich hatte mal das Glück, dass eine Dame in unser Team gekommen ist, als einzige Dame.",
            "start": 1607582,
            "end": 1624134,
            "confidence": 0.865063829787234,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In ein rein deutsches Team war das, oder, damals?",
            "start": 1624154,
            "end": 1626696,
            "confidence": 0.6806666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es war kein rein deutsches Team. Es war kein rein deutsches Team. Wir hatten eine finnische Person dabei, später dann noch eine brasilianische Person. Aber der Anteil an Deutschen war in diesem internationalen Team schon recht hoch. Und sie war keine Deutsche. Das bedeutet, die Sprache war ebenfalls noch mal eine Hürde. Mit Hürde meine ich nicht, dass wir komplett Deutsch kommuniziert haben. Doch wenn sich zwei Deutsche innerhalb des Teams unterhalten haben, war das oft so, dass sie auf Deutsch kommuniziert haben. Was es schwieriger macht für die finnische Person und für die Dame, die aus der Türkei kam.",
            "start": 1626736,
            "end": 1662393,
            "confidence": 0.8477999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und das ist ein gutes Beispiel übrigens für Inklusion. Also wenn man da dementsprechend dann nicht die Sprache wechselt, dann ist es halt nicht sehr inklusiv.",
            "start": 1662773,
            "end": 1670921,
            "confidence": 0.6811153846153846,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber das ist ein gängiges Problem in internationalen Firmen, besonders in der Office-Kultur und besonders wenn man einen hohen Anteil einer Nation hat. Also bei Trivago war das so, ich glaube ca. 30% der Trivago Mitarbeiter waren Deutsche. Da war das ein Standardproblem, eine Standardherausforderung. Du bist in die Küche gegangen und hast Leute Deutsch reden gehört. Und dann kam's oft zu dieser doch recht amüsanten Situation, irgendwie waren in der Küche nur Deutsche, und dann kam jemand rein, der nicht Deutsch gesprochen hat, also jemand aus einem internationalen Umfeld, und dann war das schon Automatismus bei den ganzen Leuten, dass sie dann automatisch innerhalb des Satzes dann auf Englisch gewechselt sind. Und damals hab ich so ein bisschen drüber gegrinst, weil das am Anfang halt so echt komisch ist für deinen Kopf, weil du unterhältst dich ja auf Deutsch, du denkst ja auf Deutsch, und auf einmal kommunizierst du auf Englisch. Aber jetzt bin ich wieder in der internationalen Firma, wo ein Großteil der Mitarbeiter finnisch sind. Das bedeutet, ich bin jetzt also die Person, die kein Finnisch kann. Und ich bin jetzt also die internationale Person, die in die Küche kommt. Und da ist das genauso. Und da ist das auch im Remote-Umfeld genauso. Das bedeutet, wenn ich mal in ein Meeting zwei, drei Minuten zu spät komme, und die unterhalten sich auf Finnisch, ich komme rein und just in dem Moment, ich höre noch zwei, drei, vier finnische Wörter, und just in dem Moment wechseln die dann auf Englisch.",
            "start": 1670981,
            "end": 1744853,
            "confidence": 0.7798293650793647,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wie fühlt sich das an?",
            "start": 1745513,
            "end": 1746514,
            "confidence": 0.4753333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja total, also auf der einen Seite toll, dass sie mich respektieren und mich an dieser Konversation teilhaben lassen, auf der anderen Seite fühle ich mich natürlich ein bisschen schlecht, weil ich komme da rein, ich unterbreche dann jetzt irgendwie deren Gespräch und so weiter. Also ich weiß noch nicht, irgendwie so ein bisschen von beiden Seiten.",
            "start": 1746825,
            "end": 1761645,
            "confidence": 0.7296842105263157,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber ich glaube, noch komischer wäre es ja, wenn die weitersprechen würden auf Finnisch und du dann daneben stehst quasi und überhaupt nicht teilhaben kannst. Das ist ja dann noch ein unguteres Gefühl. Und das habe ich leider sehr oft auch erlebt und auch bei Trivago erlebt. Also es war nicht jeder so, dass das sofort geswitcht wurde. Aber das wäre natürlich das Ideale, weil du lässt natürlich die andere Person sofort wissen, hey, du bist willkommen, du kannst mit einsteigen ins Gespräch. ... ist einfach dieses Öffnen einer Gruppe. Es ist, wie wenn so eine Gruppe in einem Kreis zusammensteht ... ... und sich plötzlich öffnet und dich reinholt, ... ... anstatt in dem Kreis weiter dasteht ... ... und du stehst dann außen irgendwo. Aber kommen wir zurück zu der ursprünglichen Geschichte. Du hast gemeint, die ... ... Site Reliability Engineer ... ... hat dann das Team gejoined ... ... und was ist dann passiert?",
            "start": 1761885,
            "end": 1805661,
            "confidence": 0.75915923566879,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es hat natürlich ein bisschen gebraucht, bis ... ... die Dame wirklich ... ... bereit war, ihre Meinung zu sagen und ... ... allem drum und dran, weil ... ... speziell als Newcomer ist es ja immer so eine Sache, aber ... Nach einer gewissen Zeit hat man schon eine Veränderung im Verhalten des Teams gemerkt und zwar war das ein rein männliches Team, da ging es so wie bei ziemlich vielen männlichen Teams auch ein bisschen um Dominanz und wer ist jetzt der King und wer ist jetzt der lauteste und all dieses Gehabe und, Viele Diskussionen, auch technische Diskussionen, waren dann, ich sag mal, sehr energetisch und hitzig. Aber über Zeit hast du gemerkt, allein durch die Anwesenheit des weiblichen Software-Site-Reliability-Engineers und durch die Argumente und einfach durch den konstanten Wechsel von einer hitzigen Diskussion zurück auf objektive, wurde das ganze Team deutlich, wie soll ich sagen, ruhiger. Und vielleicht sogar würde ich das Wort harmonischer nennen. Und das ist so ein Effekt ... Erst hab ich mich gefragt, was geht denn jetzt hier ab? Aber nach so einer Zeit bin ich halt auch mehr und mehr in dieses Thema Diversity eingestiegen, um mal ein bisschen zu verstehen, und auch ein paar Studien gelesen und so weiter und so fort. Und so, wie ich das jetzt gelesen hab, ist das wohl ein Standardeffekt davon. Und in meinem aktuellen Team hab ich keine Mitarbeiterin. Aber wir versuchen, weibliche Mitarbeiter einzustellen für unseren Team, um halt auch wieder einen ähnlichen Effekt zu haben. Und ich denke, dass ... Also, ich hab damit sehr, sehr positive Erfahrungen gemacht, muss ich zugeben, und hätte es am Anfang gar nicht so gedacht.",
            "start": 1805941,
            "end": 1897759,
            "confidence": 0.7608494623655913,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man muss natürlich auch dazu sagen, dass es jetzt keine Garantie ist, nur weil du eine Frau in das Team reinbekommst, dass sich dann da extrem was ändert. Und es sollte ja auch im Idealfall nicht nur eine Frau sein. Und ganz allgemein, die Diversität betrifft ja nicht nur das Geschlecht. Und man nennt das ja auch Pinkwashing oft, dass man zum Beispiel in die Chefetage dann irgendeine Frau reinberuft, die aber genau alte Denkmuster hat. Und dann sagt man, ja, aber wir haben ja eine Frau in unserem C-Level. Aber dass das vielleicht eine Frau ist mit ganz altem Denkmuster und eigentlich genau gleich agiert wie ihre Vorgänger, dann hat man da eigentlich keinen Gewinn. Also nur das Geschlecht garantiert dir natürlich gar nichts. Aber umso diverser du bist, umso höher ist die Wahrscheinlichkeit, dass das Ganze natürlich besser wird. diverser und im Idealfall dann eben auch sich niederschlägt auf die Innovation, auf die Produktivität vielleicht, auf das Zusammenleben im Team, auf die ganze Teamkultur. Aber Garantie ist es natürlich nie.",
            "start": 1897799,
            "end": 1954438,
            "confidence": 0.8368837209302327,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Natürlich gibt es keine Garantie natürlich ist es abhängig immer von jeder einzelnen Person im Team und das wird auch dann die Team Dynamik bestimmt ganz klar. Soll jetzt aber auch keine Ausrede sein nicht diese Route zu gehen. Du hattest gerade gesagt okay dann wird irgendwie eine Frau in eine Management Position gehoben und die kann auch ein altes Denkmuster haben. Was bei mir da jetzt so ein bisschen aufkommt, sind zwei Themen. Auf der einen Seite die entsprechenden Fachkräfte, zum Beispiel weibliche Fachkräfte. Also nehmen wir mal an, wir haben jetzt als Ziel alle ein diverses Team aufzubauen. Jetzt ist es ja leider nun mal faktisch so, dass die Anzahl an männlichen Systemadministratoren und Zeit Reliability Engineers, das ist jetzt eine Annahme, höher ist als weibliche und ich sage nicht dass das eine ausreihe ist ich sage dass das eine besondere herausforderung ist und wie siehst du das denn weil es ist ja dann also wir haben ja schon ein war of talent ja richtige fachkräfte zu kriegen ist ja schon schwierig und es ist ja so dass die gruppen also die unterrepräsentierten gruppen sind ja noch unterrepräsentierter in den jeweiligen fachbereich Wie lösen wir das Problem?",
            "start": 1954932,
            "end": 2024764,
            "confidence": 0.798105527638191,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich glaube grundsätzlich mal, dass diese Aussage stimmt, was du da sagst. Es gibt weniger weibliche Entwicklerinnen am Markt. Das stimmt damals ganz klar. Die Frage ist, verwendet man jetzt dieses Fakt als Ausrede, dass man sagt, okay, Das ist der Grund, warum wir auch keine Frauen in unserem Team haben und warum wir keine Frauen in unserem Leadership Team haben. Und das ist einfach so. Da können wir nichts dagegen machen. Dann kommt teilweise auch noch die Sache mit Frauen wollen ja gar nie in die Technik. Das ist genetisch bedingt oder sonst irgendein Bullshit, weil es ist schon oft genug widerlegt worden. Oder man sagt, okay, das ist so. Es gibt wenig Frauen. Wir wollen aber trotzdem Frauen in unserem Team haben. Das ist dasselbe wie wenn du sagst, wir wollen einen Senior. Am Markt sind Seniors extrem schwierig zu finden. Oder du willst eine Kafka Spezialistin. Finde mal einen Kafka Spezialisten heutzutage am Markt. Ist auch sehr schwierig. Deswegen sagst du trotzdem nicht, okay, wir können keinen Senior finden. Pech, ist einfach so, wir können keinen Kafka Spezialisten finden, müssen wir halt weiter wurschteln irgendwie. Das macht ja auch niemand, sondern es kostet halt Geld und es kostet Zeit und vielleicht auch eine Veränderung in der Firma, in den Ausschreibungen, dass man eben die Leute bekommt, die man haben will. Und wenn das in der Firma wirklich verankert ist und gelebt wird, dass man zum Beispiel Diversität fördert, dass man jetzt speziell Frauen in irgendeiner Form fördert, probiert reinzuholen in die Firma, dann muss man auch was dafür tun und das ist nicht leicht. Und man kann natürlich sagen, okay, die Uni hat es verschissen, die Uni hätte viel mehr Frauen ausbilden sollen. Das stimmt natürlich auf der einen Seite, aber das ist ein Problem, mit dem muss man halt leben in der Wirtschaft aktuell und man kann ja trotzdem was tun, um diese Leute zu bekommen. Und was ich zum Beispiel gemacht habe, als ganz kleinen Punkt in meiner Recruiting-Pipeline, dass ich einfach Frauen, ich sag's jetzt bewusst, bevorzugt habe, weil das war immer ein großer Kritikpunkt, aber im Sinne von bevorzugt, ich habe zum Beispiel schnell ein Video-Call mit denen gemacht. Aber das ist natürlich ein Vorgehen, das möglich ist bei Frauen, wenn du drei Bewerberinnen hast, kannst du mit denen ein Video-Call machen, wenn du in derselben Zeit 500 Bewerber hast, männliche, dann kannst du mit 500 Leuten einen Videocall machen. Ich würde auch gerne einen Videocall mit denen machen, aber es geht halt einfach nicht. Und so musst du priorisieren, wenn dein Ziel ist, die Diversität zu erhöhen und mehr Frauen reinzubekommen, versuchst du natürlich weniger Frauen in deinem Recruiting-Pipeline zu verlieren, weil du zum Beispiel denen eine Homework gegeben hast, ein Assignment, und die dann rausdroppen, weil sie sagen, hey, ich bin Senior, was soll ich denn da?",
            "start": 2024804,
            "end": 2174165,
            "confidence": 0.806410901467505,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber geht das nicht völlig gegen die Gleichberechtigung?",
            "start": 2174673,
            "end": 2178955,
            "confidence": 0.85725,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist eben die Gleichstellung, die du jetzt sagst. Also ich will nicht die Gleichstellung von weiblichen und männlichen Bewerbern, sondern ich will die Gleichberechtigung. Und nachdem ich viel weniger Frauen habe und die Hürde viel, viel schwieriger ist, vielleicht auch für Frauen, sich durchzusetzen in dem ganzen Bereich oder ich für mich persönlich jetzt das Ziel habe, mehr Frauen zu bekommen, will ich die bewusst bevorzugen. Ganz klar, weil die Männer sind ja schon die ganze Zeit davor bevorzugt worden. Also um jetzt Gleichberechtigung wieder herzustellen, muss ich ja die Frauen bevorzugen, indem meine Pipeline zum Beispiel nach vorne ziehen. Und das heißt ja nicht, dass ich jetzt das Level senke, dass ich jetzt sage, okay, wenn der weiblich steht, dann wird die aufgenommen, egal was sie kann. Sondern es geht nur darum, dass ich versuche, meine Recruiting Pipeline so zu optimieren, dass sie potenzielle Frauen eben nicht verliere in meiner Pipeline aus Prozessgründen. Ich frage natürlich trotzdem dieselben Fragen. Ich will natürlich trotzdem Qualität haben von einer Entwicklerin, aber ich probiere natürlich möglichst wenig Entwicklerinnen zu verlieren, weil ich da eben eh nur so wenig in meiner Pipeline habe. Und das ist dann ein bewusstes Vorgehen von mir und ist vielleicht meine Bevorzugung.",
            "start": 2178995,
            "end": 2249655,
            "confidence": 0.8224975609756099,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du da vielleicht auch Kritik bekommen dazu?",
            "start": 2249695,
            "end": 2251496,
            "confidence": 0.6876249999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du meinst jetzt abseits von dir. Ja, und zwar sogar von Frauen intern. Aber wenn ich denen das erklärt habe, dann war ihnen das schon auch klar, was ich damit meine. Aber im ersten Moment ist es natürlich ganz oft ein Moment, der bevorzugt Frauen und Frauen werden da irgendwie nicht die gleichen Barrieren, jetzt negativ gesagt, in den Weg gelegt oder die Hürden, die sie überkommen müssen. Und das ist auch so ein Grundmechanismus, wenn ich diese Hürden hatte in der Vergangenheit, warum haben das jetzt andere nicht mehr? Das ist das Klassische auch mit der 5-Tage-Woche, die damals 6-Tage-Woche gehabt haben und gearbeitet haben, die waren auch gegen die Einführung der 5-Tage-Woche, weil warum sollten jetzt die Leute einen Tag weniger arbeiten heutzutage, wenn wir früher einen Tag mehr gearbeitet haben? Und das zieht sich halt überall durch und auch Frauen reagieren da oft. Im ersten Moment, Moment, warum wird da irgendwie eine Barriere gesenkt oder die Hürde gesenkt, aber das ist es ja eben nicht. Es ist nur eine Prozessoptimierung, um eben das auszugleichen, die Benachteiligung, die Frauen vielleicht davor erfahren haben und eben darum am Markt nicht verfügbar sind.",
            "start": 2251876,
            "end": 2317727,
            "confidence": 0.8315129533678759,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ist das nicht der Killer-Use-Case für anonyme Bewerbungen? Und mit anonyme Bewerbung meine ich Foto weg, Name weg, Geschlecht weg, Religion weg, Alter weg.",
            "start": 2318307,
            "end": 2328058,
            "confidence": 0.8933999999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie es zum Beispiel in England gang und gäbe ist, da wirst du nie ein Bild auf einer Bewerbung finden, ganz klar. Aber auch da wieder ist die Frage, was du willst. Wenn du die Diversität erhöhen willst als Firma, dann ist dir das ja wichtig, dass du diese Information bekommst. Wenn du einen Kafka Spezialisten suchst, willst du ja auch wissen, dass derjenige oder diejenige Kafka Wissen hat.",
            "start": 2328098,
            "end": 2347911,
            "confidence": 0.7734057971014493,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber Kafka ist arbeitsrelevant, arbeitsrelevant für mein Business, wo mein Geschlecht das ja nicht ist.",
            "start": 2348271,
            "end": 2352973,
            "confidence": 0.6210625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Diversität ist vielleicht auch relevant für dich und wenn du sagst als Business Diversität ist für mich relevant, weil ich die Innovation erhöhen will und es wissenschaftlich bewiesen ist, dass die Innovation in diversen Teams höher ist, dann ist es für dich Business relevant und dann kannst du da natürlich eine Bevorzugung einbauen. Mir ist schon klar, wenn du ein öffentliches Unternehmen bist oder ein Amt, dann schaut das Ganze natürlich anders aus. Dann kannst du nicht so agieren. Aber als Firma, meiner Meinung nach, kannst du natürlich da schon so agieren und solltest du auch, weil anders funktioniert es gar nicht, irgendwie mehr Frauen reinzubringen. Wenn du, sagen wir mal, 30 Prozent in deiner Pipeline verlierst an Bewerbern aufgrund von weil du zu langsam bist. Andere Gründe sind ja ganz egal. Und du verlierst 30 Prozent von 500 Männern und 30 Prozent von drei Frauen, dann ist das natürlich schon ein Problem, weil dann hast du schon von drei Bewerberinnen nur mehr zwei, die überhaupt in Frage kommen, rein aus Prozessgründen. Und da musst du dann natürlich als Firma schon abwägen, was ist wichtiger und wo willst du mehr Zeit investieren und das Ganze fördern.",
            "start": 2353607,
            "end": 2417893,
            "confidence": 0.7980714285714281,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hatte mal die Möglichkeit, bei einem Hackathon mit einer Dame zusammenzuarbeiten. Die hatte dann irgendwann im Laufe der Jahre die Position als Head of Engineering oder Vice President of Engineering in einer Tech-First-Firma, ich glaub, entweder Travis CI oder Circle CI, irgendwo so in dem Bereich. Und das Thema Diversity war auch einer ihrer Herzensthemen, und sie hat es dann geschafft, das Engineering-Team primär mit unterrepräsentierten Gruppen zu befüllen. Ich glaub, primär waren's dann wirklich Frauen im Endeffekt. Und das hat dazu geführt, dass mehr und mehr Frauen primär zu dieser Firma wollten, weil dort schon sehr viele Frauen im Engineering-Team waren. Also, es war weit über 50 Prozent, ja?",
            "start": 2418660,
            "end": 2463947,
            "confidence": 0.836918918918919,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist denn weit?",
            "start": 2465688,
            "end": 2467429,
            "confidence": 0.6025,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "55? Die genauen Zahlen habe ich jetzt nicht, aber es waren auf jeden Fall über 50 Prozent. Und da wollten dann immer mehr und mehr Frauen hin. Und das kann ich ja auch verstehen. Meine Frage hier ist, ist das dann noch divers?",
            "start": 2467439,
            "end": 2481997,
            "confidence": 0.8132325581395348,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Natürlich nicht. Also wenn du ein Team nur mit Frauen hast, dann ist das sicher nicht divers. Und viele HR-Teams werden das auch wissen, weil die haben meistens das umgekehrte Problem.",
            "start": 2482037,
            "end": 2491743,
            "confidence": 0.7772580645161292,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "HR steht für Human Resources, das bedeutet die Personalabteilung.",
            "start": 2492524,
            "end": 2495407,
            "confidence": 0.5955555555555556,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, da ist es meistens so, dass du seltener Männer anfindest und das ist natürlich ein Problem. Grundsätzlich ist natürlich auch die Frage, wenn da jetzt ein Mann reinkommt, hat er die gleichen Nachteile in dem Team wie wenn eine Frau in ein Team reinkommt, wo nur Männer sind. Weil oft sind Frauen einfach strukturell diskriminiert und Männer nicht. Und darum kann man das eine mit dem anderen auch nicht vergleichen, ob die wirklich die gleichen Chancen oder die gleichen Probleme haben. Je nachdem, in welche Richtung die Inbalance geht. Aber grundsätzlich glaube ich, dass das natürlich auch ein Problem ist. Wenn du nur Frauen in dem Team hast, bist du auch nicht diverse. Ganz klar. Und das sollte meiner Meinung nach auch nicht das Ziel sein, nur Frauen zu haben. Aber ehrlich gesagt, wenn du ein Dev-Team hast mit nur Frauen, also ich bin mir gar nicht sicher, ob das in der Realität überhaupt möglich ist. Also du hast wirklich so eine 100%-Quote oder so, dass du nur Frauen einstellst. Also ich würde das jetzt als absoluter Einzelfall sehen. Und ich glaube, es gibt sehr wenige Firmen oder Teams, die wirklich dieses Problem haben, dass sie zu viele Frauen hätten. Ich glaube, man kann sich dann mit diesem Problem beschäftigen, wenn wir mal so weit sind, aber derzeit ist es halt so, dass in 99,9 Prozent der Fällen das eher so ist, dass es keine Frauen oder wenig Frauen in Dev-Teams gibt.",
            "start": 2495447,
            "end": 2569563,
            "confidence": 0.8240041152263381,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie stehst du denn zu Tech-Events, die nur für Frauen sind? Also sagen wir mal Meet-Ups oder da gibt es ja auch solche Sachen.",
            "start": 2570324,
            "end": 2577672,
            "confidence": 0.6221666666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das ist natürlich nicht so leicht zu beantworten. Auf der einen Seite sind wir da wieder in der Gleichberechtigung, also Gleichstellung. Wenn du natürlich eine Benachteiligung hattest, so lange Zeit, dann macht es auch Sinn, um das auszugleichen, dass du da eben Frauen bevorzugst oder vielleicht so nur Events machst, die für Frauen sind, speziell zur Frauenförderung. Aber sobald es natürlich in den produktiven Betrieb geht, meiner Meinung nach, sollte das möglichst divers wieder sein. Aber jetzt in der Recruiting-Phase, in der Ausbildungsphase, wenn du da speziell, um diese Chancengleichheit wiederherzustellen, Frauen speziell förderst und die vielleicht auch abholen kannst und da kommt jetzt ein Bereich, wo ich als Mann einfach weniger sagen kann. Aber ganz allgemein, man fühlt sich ja in Gruppen, in gleichgesinnten Gruppen und vielleicht auch bei uns jetzt in der Männergruppe teilweise wohler und ist vielleicht auch einfacher über gewisse Sachen zu sprechen. Wenn man auf einer ähnlichen Wellenlänge, auf einem ähnlichen Background wieder ist, muss ja gar nicht das Geschlecht sein. Und so sehe ich das halt dann bei Frauen vielleicht auch, dass es einfach Einfacher ist, wenn du unter Frauen bist, dass du über gewisse Themen einfach sprichst oder einen einfacheren Zugang findest. Aber eben, ich glaube, das ist ganz natürlich, wenn du in einem Team bist, wo Leute auf der gleichen Wellenlänge sind, dann tut man sich natürlich viel einfacher, mit denen über irgendwelche Sachen zu sprechen oder einen Kontakt aufzubauen. Und wie gesagt, Geschlecht ist da nur ein Punkt davon. Also ich sehe kein Problem damit. solange es im Endeffekt dann eben nur da ist, um etwas auszugleichen und eine Chancengleichheit herzustellen. Und dann macht es natürlich schon Sinn. Und wenn ich jetzt zum Beispiel mich zurückerinnere, ich habe mal diese Women in Tech Initiative gestartet in Trivago, da fragst du natürlich auch die Frauen. Das heißt nicht, dass Männer nicht willkommen sind, aber du besprichst das natürlich mit den Frauen. Du bist ja Frauen fördern und mehr Frauen in die Dev-Teams bekommen zum Beispiel, dann besprichst du natürlich das auch mit den Frauen und bindest da nicht noch hunderte Männer mit ein, ist ja auch klar.",
            "start": 2578212,
            "end": 2698954,
            "confidence": 0.8141376404494385,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du hattest vorhin das Wort Quote erwähnt und ich meine, und Diversity-Quoten kommen ja oft irgendwie in den News vor, entweder in der Politik oder das Quote in den Chefetagen sein müssen und allem drum und dran. Wie ist deine Meinung dazu?",
            "start": 2698974,
            "end": 2713886,
            "confidence": 0.7685000000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich war lange eigentlich gegen Quoten, muss ich ganz ehrlich sagen, aber mittlerweile, meine Erfahrung war einfach, dass wenn du etwas ändern willst, dass es einfach schwierig ist ohne Quote. Natürlich kannst du sagen, bitte probiert es, wir haben das Ziel, aber es ist nicht so schlimm, wenn das Ziel ja nicht erfüllt wird, so in der Richtung, was auch bei Zielen ist, bei Gewissen. Und mit einer Quote kannst du da halt einfach viel härter agieren. Und wenn du das in einer großen Firma zum Beispiel einfach durchsetzen willst, dann bist du mit einer Quote wahrscheinlich wesentlich schneller unterwegs. Und das ist halt so ähnlich wie bei der Marktwirtschaft, da gibt es auch gewisse Regeln. Und klar würde der Markt alles selber regeln, aber er bräuchte halt 300 Jahre und ein paar Leute am Weg würden kribbieren. Und so ähnlich sehe ich das halt mit der Quote. Wenn du was schneller erreichen willst und das schneller verändern willst, dann ist eine Quote einfach ein sehr gutes Mittel.",
            "start": 2713946,
            "end": 2758910,
            "confidence": 0.7609107142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also das, was ich so lese, das größte Gegenargument, was immer angebracht wird, ist okay, Facharbeiter, Qualifikation und allem drum und dran.",
            "start": 2759110,
            "end": 2767695,
            "confidence": 0.8137727272727274,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das wird ja oft auch verwechselt, dass die Quote eben mit einer Hürdensenkung im Sinne von Qualifikation gesehen wird, dass dann Leute genommen werden, die weniger Qualifikation haben. Aber das eine schließt das andere nicht aus, wenn ich eine Quote habe, dass ich trotzdem nach Qualität suche. Also ich kann auch eine Quote haben und trotzdem mein Qualitätslevel hochhalten. Natürlich ist es schwieriger jetzt in einem Dev-Team eine Frau zu bekommen mit guter Qualität, Dev-Qualität, weil es natürlich ganz allgemein weniger Frauen gibt, ist ganz klar. Aber da muss ich mich halt auch dementsprechend kümmern und das pushen. Es ist auch nicht einfach einen guten Kafka-Experten oder Experten hinzubekommen. Auch da werde ich länger brauchen und länger suchen müssen, aber ich werde trotzdem die Qualität hochhalten. Und dasselbe kann ich bei der Quote ja auch erreichen.",
            "start": 2767735,
            "end": 2810372,
            "confidence": 0.8068175182481756,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ja, das macht alles Sinn. Aber worüber ich grad ein bisschen spreche, ist zum Beispiel eine erzwungene Quote. Das bedeutet, wenn jetzt mal eine Quote irgendwie von der Politik von außen gesetzt wird, ja, das bedeutet, wenn du den Zwang hast, dann kommst du ja wirklich unter ... in Bedulien, würd ich mal sagen. Weil du musst halt diese Quote erfüllen, Du sagst ja schon zu Recht, weil einfach weniger Personen aus diesen unterrepräsentierten Gruppen auf dem Markt verfügbar sind. Das ist ja Fakt, hattest du gesagt. Dann ist es natürlich schwieriger, die richtige Person mit den richtigen Skills zu finden. Wenn jetzt aber die ganze Sache irgendwie entforst wird, sei es irgendwie vom Aufsichtsrat oder sei es von der Politik, dann stelle ich mir halt schon die Frage, okay, sind das hochgesteckte Visionen oder sind das realistische Ziele?",
            "start": 2810632,
            "end": 2858494,
            "confidence": 0.809585714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wenn du die Politik mit reinnimmst noch in das Ganze und wirklich so von harten 50-50-Quoten sprichst, nehmen wir mal an, es kommt da irgendeine Frau rein, die den Qualitätskriterien nicht entspricht. Nehmen wir das einfach mal so an, ob das stimmt oder nicht. Wenn du auf die andere Seite schaust, wie viele Männer gibt es denn, die die Qualitätskriterien eigentlich gar nicht erfüllt haben und nur drin sitzen, weil sie irgendein Netzwerk oder sonst was haben. Es gibt es in der Politik viel, sei es auf männlicher oder weiblicher Seite, aber wenn man betrachtet, dass die Frauen so lange diskriminiert wurden oder immer noch diskriminiert werden, Wenn da mal irgendwo eine Frau reinrutscht, dann passiert halt dasselbe, dann sind wir endlich bei der Gleichstellung, dann passiert eben dasselbe auf der Seite wie auf männlicher Seite.",
            "start": 2859154,
            "end": 2903671,
            "confidence": 0.8388905109489047,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also du sagst also, dass auch männliche Idioten befordert werden.",
            "start": 2903711,
            "end": 2907272,
            "confidence": 0.8192999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, mehr als man eigentlich will, ja.",
            "start": 2907979,
            "end": 2910440,
            "confidence": 0.452,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja gut, das ist natürlich ein Killer-Argument.",
            "start": 2910500,
            "end": 2913120,
            "confidence": 0.36385714285714293,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also dieses PETA-Prinzip, das gibt es, glaube ich, halt auch auf allen Seiten. Vor allem, wenn man dann eben die Gleichstellung erreicht, dann sollte es ja auch auf beiden Seiten, also es sollte grundsätzlich nie geben, aber dann ist es wenigstens fair auf weiblicher und auf männlicher Seite.",
            "start": 2913140,
            "end": 2927083,
            "confidence": 0.8125416666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Für die Leute, die nicht wissen, was das PETA-Prinzip ist, das PETA-Prinzip besagt eigentlich, in einer Hierarchie neigt jeder Beschäftigte dazu, bis zu seiner Stufe der Unfähigkeit aufzusteigen. Prinzipiell kann man sagen, okay, weil du jetzt gerade einen sehr guten Job machst, wirst du befördert und durch die Beförderung machst du dann einen anderen Job. Nur weil du in dem vorherigen Job einen guten Job gemacht hast, heißt das nicht, dass du in dem beförderten Job einen guten Job machst. Und das, wenn das natürlich zum Extrem propagiert wird, dann kann das natürlich dazu führen, dass man eine sehr unfähige Person im Chefsessel sitzen hat und nur weil diese Person ein unglaublich guter Kafka-Experte ist. Ein Thema, was wir noch gar nicht besprochen haben, ist inklusive Sprache. Das ist, glaub ich, auch einfach ...",
            "start": 2927143,
            "end": 2968743,
            "confidence": 0.7913432835820897,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ein Feindbild Nummer eins bei vielen, würd ich fast sagen.",
            "start": 2968753,
            "end": 2971194,
            "confidence": 0.7298,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber das ist so aus Firmensicht, glaub ich, so die erste Aktion, die die meisten machen. Die kontrollieren die Job-Ads und alle drüben dran und ist die genutzte Wortwahl dort inklusiv. Hab ich so das Gefühl, das ist so die Low-Hanging-Fruit von den meisten Leuten, die sich mit dem Thema am Anfang beschäftigen.",
            "start": 2971994,
            "end": 2988177,
            "confidence": 0.7998333333333331,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wahrscheinlich auch die, die ganz viel Reibung bringt in den Firmen und in den Teams. Ihr habt eine Geschichte, die ich mal vor ein paar Jahren erlebt habe, wo eine Mitarbeiterin was Gutes tun wollte und in die Firma Süßigkeiten mitgebracht hatte und dann auf Slack in einem Channel gepostet hat, sie hat Negerküsse mit und es kann sich doch jeder welche holen. Und es war ein sehr internationales Team, auch mit People of Color im Team, und das ist nicht so gut angekommen. Und sie hat das natürlich nicht böse gemeint, ganz klar, aber man muss sich natürlich überlegen, dass das bei anderen Personen, die jetzt nicht vielleicht weiße Deutsche sind, schon was auslösen kann, weil die ganz anders betroffen sind. Und genau darum geht es bei inklusiver Sprache, dass man sich mehr überlegt, was denn die Sprache für andere bedeutet. Und dazu muss man natürlich die gewisse Empathie aufbringen und sich überlegen, was ist wie verletzlich. Person of Color zum Beispiel, die haben natürlich einen ganz anderen Zugang und die erleben das ganz anders, diesen Rassismus und diese Diskriminierung, diese regelmäßige. Und wenn dann sowas in einem öffentlichen Slack-Channel passiert, dann reagiert man da halt vielleicht auch ganz anders darauf, als eben wir in einem männlich-weißen Team reagieren würden wahrscheinlich.",
            "start": 2988573,
            "end": 3066451,
            "confidence": 0.8320422535211266,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe gerade mal nachgeschlagen, bereits Ende der 70er Jahre wurde der Begriff Nigerkuss als rassistisch identifiziert. Ich bin 1987 geboren und zu meiner darbeligen Schulzeit wurde dieses Lebensmittel auch schon so genannt. Das zeigt mir halt schon, dass die Veränderung der Sprache halt schon eine ganze Menge Zeit braucht, oder? Oder sagst du, heutzutage geht das alles viel schneller?",
            "start": 3066971,
            "end": 3088633,
            "confidence": 0.8150833333333337,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es braucht auf jeden Fall Zeit, aber es braucht halt teilweise auch sehr lange. Und das verstehe ich dann halt weniger, weil für mich persönlich, wenn ich da irgendein Wort ändere oder mich dementsprechend anpasse, ist für mich das so eine Kleinigkeit. Und wenn ich damit weiß, dass ich andere Personen weniger damit verletze, dann ist das für mich ja kein Problem, wenn ich da irgendwo mal ein Wort umstelle oder ein Wort weniger verwende. Und eigentlich ist es meiner Meinung nach nicht so schwierig. Wenn man dann aber doch wieder sieht, wie viel Jugendliche auch zum Beispiel behindert oder schwul als Schimpfwort verwenden im alltäglichen Gebrauch, dann wundert mir das eigentlich doch, wie wenig weit wir eigentlich sind.",
            "start": 3089113,
            "end": 3129514,
            "confidence": 0.8225294117647062,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dass das ganze Thema enorme Reibung erzeugt, haben wir, glaube ich, auch im technischen Bereich gesehen, als MySQL das Wording von Master und Slave in Leader und Follower umbenannt hat.",
            "start": 3129554,
            "end": 3139683,
            "confidence": 0.8540333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wobei MySQL so spät war, dass es glaube ich da eh keine Diskussion mehr gegeben hat. Da GitHub mit der Umbenennung von Masterbranch in Mainbranch, da war glaube ich noch viel mehr Diskussion eigentlich, ob man das macht, ob das wichtig ist.",
            "start": 3140163,
            "end": 3152714,
            "confidence": 0.8026666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber bei Redis, Redis war glaube ich vor MySQL auch da. in diesem thema und da gab es auf jeden fall eine ganze menge diskussion mit den argumenten hey da geht es doch um die technische sache und nicht um unterrepräsentierte gruppen und co das war so das meiste argument was von von technikern aufgebracht wurde dass sie dass sie das rein objektiv sehen und wie die sache meint Aber da gibt es halt.",
            "start": 3152774,
            "end": 3175794,
            "confidence": 0.8044864864864866,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Immer eine große Diskussion und wer schreit jetzt, ehrlich gesagt, noch nach dem Master-Branch oder Meme-Branch? Es ist schon so intus und es ist wirklich eine kleine Änderung und ich denke mir immer, wenn das die Welt besser macht und das Zusammenleben besser macht, dann ist mir das doch egal, wenn ich da irgendein Wort nicht mehr verwende und jetzt ein anderes Wort und statt behinderter Mensch, Mensch mit Behinderung sage, um einfach den Fokus zu ändern von der Behinderung auf den Mensch. Und Sprache ist lebendig und sehen wir ja auch ständig, dass sich Sprache ändert. Und wenn sich das in die richtige, gute Richtung ändert, ist das für mich umso besser. Und da mache ich mir ehrlich gesagt wenig Gedanken darüber und verwende meine Zeit lieber für wichtige Dinge, als das jetzt zu diskutieren oder hunderttausendmal zu hinterfragen oder dagegen anzuarbeiten. Wenn das im Team besseres Teamgefühl macht, bessere Teamculture und das Zusammenleben verbessert, dann ist mir das nur recht. Und für mich ist es eine kleine Änderung.",
            "start": 3175814,
            "end": 3231385,
            "confidence": 0.818394117647059,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das Wichtige ist zu verstehen, dass jeder seinen fairen Teil dazu beitragen kann und dass das jetzt nicht von einer Person oder von der Personalabteilung getrieben werden kann, sondern dass das etwas ist, was jeden etwas angeht. Und ich denke, so einen kulturellen Wechsel für viele braucht halt Zeit bzw. man muss, weil es ist ja eine Gedankenumstellung. Aber ja, du hast recht. Okay, wir sind dem Ende angekommen und haben manche Themen einfach gar nicht besprochen. Mir fallen im Bereich Diversity noch sowas ein wie Code of Conduct. Pronomen wurden zwar mal erwähnt, haben wir aber gar nicht besprochen.",
            "start": 3231425,
            "end": 3266185,
            "confidence": 0.7850882352941179,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch ein schwieriges Thema für sehr viele Leute.",
            "start": 3266245,
            "end": 3268027,
            "confidence": 0.5087499999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir sind gar nicht so stark auf das Gendern eingegangen in der Aussprache, wo wir sehr wahrscheinlich auch hier im Podcast noch Verbesserungspotenzial haben.",
            "start": 3268627,
            "end": 3276852,
            "confidence": 0.8611666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Luft nach oben gibt's immer.",
            "start": 3276872,
            "end": 3278273,
            "confidence": 0.791,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zeigt aber schon die Komplexität des ganzen Themas. Zum Abschluss. Was ist dein Nummer-eins-Tipp für Software-Engineering-Teams oder Teamleiterinnen und Teamleiter, was sie machen können, wo sie ein bisschen an dem Thema rütteln können und das in die richtige Richtung bewegen können? Was würdest du sagen ist dein Nummer-eins-Tipp?",
            "start": 3278313,
            "end": 3297745,
            "confidence": 0.8023541666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also grundsätzlich mal wirklich dahinter stehen und das nicht nur machen, weil es halt gerade in ist, sondern wirklich überlegen, warum macht man das und was bringt es einem. Und wenn es dann ernst gemeint wird, dann findet man auch Wege, das zu verbessern. Und meiner Meinung nach der erste Schritt ist einfach immer mit unterrepräsentierten Gruppen im Team, wenn es die schon gibt oder eben Frauen zum Beispiel, wenn man nach Wenn man den weiblichen Anteil erhöhen will, dass man einfach mit diesen Personen spricht und mit denen gemeinsam überlegt, wie können wir zum Beispiel die Diversität im Team verbessern, wie können wir neue Mitarbeiterinnen bekommen, dass man einfach mal da gemeinsam brainstormt mit den jeweiligen Gruppen. aber da dann auch Arbeit reinsteckt und das nicht irgendwie ablehnt, dass man sagt, okay, ihr seid die zwei Frauen, ihr müsst euch jetzt darum kümmern, dass wir irgendwie mehr Frauen bekommen oder ihr seid die Aushängeschilder nach außen. Also das muss schon gemeinsam passieren und die Leute müssen natürlich auch Lust dazu haben, aber üblicherweise kann man da sehr gute Diskussionen führen und Brainstorming Sessions und dann findet man schon Möglichkeiten, wie man in die richtige Richtung dann gehen kann, wenn man das wirklich will.",
            "start": 3298305,
            "end": 3360921,
            "confidence": 0.8408578431372549,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war doch ein gutes Abschlusswort. Wir hoffen, wir konnten euch das Thema Diversity ein bisschen näher bringen. Mein Respekt vor dem Thema ist immer noch sehr hoch. Es hat sich auch durch diese Diskussion nicht geändert.",
            "start": 3361201,
            "end": 3371424,
            "confidence": 0.7325135135135136,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also Shitstorms welcome. Ich fang die gern ab, kein Problem.",
            "start": 3371444,
            "end": 3374865,
            "confidence": 0.7832,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und ob zwei weiße alte Cis-Männer darüber wirklich gut reden können, muss sich auch nach dieser Episode zeigen.",
            "start": 3374905,
            "end": 3380286,
            "confidence": 0.8443333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich denke, vielleicht sind wir nicht die Besten, die über dieses Thema sprechen können. Aber meiner Meinung nach können wir über dieses Thema sprechen. Und das ist das Beste, was wir aktuell hinbekommen. ohne Gäste. Sobald wir mal wirklich Gäste mit reinnehmen sollten, können wir dann mit vielleicht einer Spezialistin darüber sprechen und da wirklich noch tiefere Einsichten bringen. Aber mit unseren aktuellen Möglichkeiten ist das, was wir machen können und ich glaube, da kann man auch sehr viel erreichen und wir sollten alle, glaube ich, mehr über diese Themen sprechen und eben weniger Angst haben, wie du sagst, dass man da einen Shitstorm gerät, sondern einfach darüber diskutieren. Kommunikation hilft im Allgemeinen sehr viel weiter.",
            "start": 3380506,
            "end": 3419078,
            "confidence": 0.8241120689655168,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Soviel dazu, wir wünschen euch einen schönen Tag und freuen uns natürlich wie immer auf Feedback über Twitter at EMG Kiosk und via E-Mail an stetisch at engineeringkiosk.dev und falls ihr uns noch nicht auf den Standard Podcast Plattformen folgt wie Apple Music, Google Podcast oder Spotify, drückt doch mal auf den Folgebutton, das würde uns sehr helfen und lasst uns auch mal eine Bewertung da. Vielen Dank.",
            "start": 3419678,
            "end": 3442819,
            "confidence": 0.7671470588235293,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Danke auch dann vom Algorithmus dafür. Ciao. Tschüss.",
            "start": 3443139,
            "end": 3446022,
            "confidence": 0.467125,
            "channel": null,
            "speaker": "B"
        }
    ],
    "confidence": 0.8094240296469657,
    "audio_duration": 3450.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}