{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/13d40fbb-2d7c-46d7-baba-25514ecd6dc6/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "621hyl3qji-8746-4594-876d-1ca11963eff1",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Hast du gewusst, dass Netflix ausschließlich Senior Engineers hat? Zumindest bis vor ein paar Monaten. Denn auch jetzt haben sie sich dem Staff-Level geöffnet. So wie viele andere Tech-Firmen auch. Sogar in Deutschland. Aber was ist eine Staff-Engineering-Stelle? Wo ist der Unterschied zum Senior und wie hat denn die ganze Programmierwelt früher ohne den Staff-Level überleben können? Ist das Ganze vielleicht nur eine Marketing-Erfindung? All das klären wir in dieser Episode vom Engineering Kiosk. Und nebenbei auch noch, was ein Hofrad oder eine Kommerzialrätin ist. Also ab geht's in die Welt der Titel. Andi, ihr habt dich ja schon in viele österreichische Dinge eingeführt, kürzlich gerade in die österreichische Politik, wo man sich ja so Chat-Messages schickt wie, du bist die Hure der Reichen oder so ähnliche Dinge. Heute will ich dich mal einführen in die österreichische Titellandschaft. Und da hätte ich gleich ein paar Fragen.",
      "start": 4107,
      "end": 60838,
      "confidence": 0.793054794520548,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bist du bereit? Immer.",
      "start": 60858,
      "end": 62318,
      "confidence": 0.608,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist ein Post-Oberadjunkte? Das ist ein offizieller österreichischer Titel.",
      "start": 62378,
      "end": 67040,
      "confidence": 0.7605000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Darf ich Kontextfragen stellen?",
      "start": 67060,
      "end": 68160,
      "confidence": 0.71175,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "In Österreich stellt auch niemand die Frage, wenn du sagst, ich bin der Herr Post-Oberadjunkte.",
      "start": 68780,
      "end": 73265,
      "confidence": 0.6724,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist die Post bei euch noch verstaatlicht?",
      "start": 73325,
      "end": 74906,
      "confidence": 0.5781428571428572,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, es kommt aus der Zeit.",
      "start": 74926,
      "end": 76327,
      "confidence": 0.7200000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist das noch ein aktueller Job?",
      "start": 76367,
      "end": 78890,
      "confidence": 0.7931666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Keine Ahnung, ob man das noch wirklich werden kann, aber grundsätzlich steht das einfach für jemanden, der Beamter bei der Post ist. Dann bekommt man diesen Titel nach einer gewissen Zeit.",
      "start": 78910,
      "end": 87618,
      "confidence": 0.8080645161290321,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hatte mir schon irgendwie sowas gedacht, dass das mit der Verstaatlichung oder mit der staatlichen Post zu tun hat, aber ich dachte jetzt nicht an irgendwie jeder Beamter kriegt den Titel, sondern halt irgendwie, weiß ich nicht, ich stell mir grad so ein Postlager vor und da sitzt oben jemand auf so einem Hochstand und der schaut, dass jeder die Post ordentlich einordnet oder ähnliches, ja sowas hätte ich gedacht, der kriegt den Sondertitel.",
      "start": 88018,
      "end": 107905,
      "confidence": 0.7488133333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielleicht hat es damals nicht jeder bekommen, das kann schon sein, aber so Sachen wie Hofrat zum Beispiel oder Kommerzialrat, das ist immer noch eine Sache, da schreiben sich viele Leute vor ihren Namen und das ist auch ein Ding, was üblich ist.",
      "start": 108365,
      "end": 120241,
      "confidence": 0.8515116279069768,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist Hofrat und Kommerzialrat dasselbe?",
      "start": 120281,
      "end": 122624,
      "confidence": 0.8538,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, es sind zwei unterschiedliche Titel. Kommerzialrat bekommt man, wenn man länger in der Wirtschaftskammer irgendwie oder in der Wirtschaft tätig ist und die Wirtschaftskammer verleiht ist dann glaube ich irgendwie.",
      "start": 122744,
      "end": 133095,
      "confidence": 0.7626451612903226,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ein Hofrat hat irgendwas mit einem Schloss zu tun, weil die haben auch einen Innenhof oder?",
      "start": 133135,
      "end": 137496,
      "confidence": 0.801470588235294,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also es wird vom Bundespräsidenten verliehen und für Verdienste im kulturellen Leben, in der Wirtschaft oder im Sport.",
      "start": 137536,
      "end": 144457,
      "confidence": 0.8261666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist das nicht so, dass euer letzter Bundespräsident jetzt irgendwie persönlicher Assistent von Peter Thiel ist oder so?",
      "start": 144477,
      "end": 149639,
      "confidence": 0.7791666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber der hatte keinen einzigen Titel. Weil der hat, glaube ich, irgendwie sein Studium abgebrochen, der gute Herr Kurz. Aber ich hätte noch eine Frage als letztes. Was ist ein HSDIR-IR-DIPL-BET-OSR?",
      "start": 149679,
      "end": 162485,
      "confidence": 0.72178125,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also DIPL für Diplom, glaube ich, obwohl habt ihr überhaupt ein Diplom. HSDIR Hochschuldirektor.",
      "start": 162525,
      "end": 168330,
      "confidence": 0.7078571428571427,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, sehr gut, sehr gut.",
      "start": 168711,
      "end": 169832,
      "confidence": 0.6342000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hochschuldirektor Diplom. Was war das noch?",
      "start": 170468,
      "end": 173130,
      "confidence": 0.7273333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "I.R.",
      "start": 173190,
      "end": 175131,
      "confidence": 0.822,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Im Rektoriat.",
      "start": 175171,
      "end": 176712,
      "confidence": 0.954,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ist ein Hochschuldirektor im Ruhestand und diplomatischer Pädagoge Oberschulrat. Genau Oberschulrat. Das sind diese Dinge, was die Lehrer bekommen. Aber das ist jetzt keine extrem crazy Auswahl. Bei uns sind Titel wirklich gang und gäbe und das steht auch am Türschild Hofrat oder so. Das ist ganz üblich.",
      "start": 176752,
      "end": 195863,
      "confidence": 0.8357551020408165,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ein Oberschulrat haben wir auch in Deutschland.",
      "start": 195903,
      "end": 198104,
      "confidence": 0.79225,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenigstens etwas.",
      "start": 198124,
      "end": 198825,
      "confidence": 0.8514999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, Titel, Titel, Titel. Worum geht es heute? Heute geht es auch um Titel. Wieder speziell um Jobtitel. Und zwar haben wir in Episode 40 bereits schon mal über sowas gesprochen. Und zwar haben wir da speziell darüber gesprochen, wie man denn zum Senior Developer, Senior Engineer, Senior Developerin wird. Heute gehen wir einen Schritt weiter, denn die Industrie entwickelt sich ein bisschen weiter. Und mehr und mehr schwappt ein Karrierepfad über dem Senior Engineer rüber nach Europa. In Amerika schon gang und gäbe. Deswegen wollen wir heute mal ein bisschen Licht ins Dunkle bringen und erklären mal ein bisschen, wie der Karrierepfad eines Individual Contributors nach dem Titel Senior aussieht. Und zwar fängt man da in der Regel an, die ganze Sache Staff Engineer, Staff Plus, Principle und so weiter zu nennen.",
      "start": 199745,
      "end": 246515,
      "confidence": 0.8195488721804515,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "In der Vorbereitung für die Episode, wie ich mir so ein bisschen die ganzen Definitionen durchgelesen habe, habe ich mir ganz oft gedacht, wo ist denn jetzt wirklich der Unterschied zum Senior? Weil das, was ich bisher immer so als Senior im Kopf gehabt habe und was wir auch teilweise in der letzten Episode über Seniors besprochen haben, habe ich in dem Staff-Level jetzt wiedergefunden. Und dann war für mich wirklich die Frage, wo ist denn jetzt wirklich der Unterschied zum Senior? Weil das, was ich bisher immer so als Senior im Kopf gehabt habe und was wir auch teilweise in der letzten Episode über Seniors besprochen haben, habe ich in dem Staff-Level jetzt wiedergefunden. Und dann war für mich wirklich die Frage, wo ist denn jetzt eigentlich der Unterschied und warum braucht man das dann überhaupt?",
      "start": 247117,
      "end": 288417,
      "confidence": 0.8220875912408759,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, das geht nicht nur dir so, ich glaube, das geht einer ganzen Menge Leuten so. Und zwar sind wir hier in Europa, speziell in Deutschland, eigentlich mit den Begriffen Junior-Engineer, Mid-Level-Engineer und Senior-Engineer vertraut. Und wenn man sich die aktuellen Job-Ads anschaut, dann sieht man auch, alle Leute suchen irgendwie nur noch Senior-Engineers. Nun ist es aber so, dass das Modell des Staff Engineers oder Staff Plus...",
      "start": 348957,
      "end": 371191,
      "confidence": 0.7930000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist denn schon wieder Staff Plus?",
      "start": 371331,
      "end": 373072,
      "confidence": 0.5222857142857144,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist es so wie LGBT Plus? Nee, ist es nicht. Bei LGBT Plus heißt ja das Plus noch für weitere Formen. Bei Staff Plus ist es eigentlich das Level eines Staff Engineers und alles da drüber. Weil es ist nicht so, dass über dem Senior Level noch nur ein Level introduced wurde, also eingeführt wurde, sondern mehrere Level. Kommen wir jetzt gleich zu.",
      "start": 373132,
      "end": 394817,
      "confidence": 0.8423650793650792,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber warum hat man dann das Plus und erwähnt nicht die anderen Levels? Warum gibt es dieses Plus?",
      "start": 394857,
      "end": 399178,
      "confidence": 0.7403684210526316,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also über dem Senior und Staff Level gibt es noch mehrere Levels und der Unterschied zwischen einem Senior und dem Staff ist ein recht großer, wohingegen der Unterschied zwischen Staff Level und darüber, Senior, Staff, Principal, Distinguished, Fellow und so weiter, Der wird dann immer kleiner bzw. immer granularer. Also da sind die Unterschiede jetzt nicht mehr so riesig wie zwischen einem Senior Engineer und einem Staff Engineer. Man muss natürlich aber auch mal sagen, Disclaimer, wenn es um diese Titel geht, die sind nicht industrieweit definiert. Jede Firma setzt andere Erwartungen an einen Junior-, Middle- oder Senior-Engineer, an einen Staff-, Senior-Staff-Principal und so weiter. Das bedeutet, nur weil man jetzt Staff-Engineer bei Google ist, heißt das nicht, dass das genau das gleiche ist wie ein Staff-Engineer bei Dropbox oder bei Trivago oder bei Check24.",
      "start": 399218,
      "end": 454985,
      "confidence": 0.8290518518518518,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, aber der Unterschied zwischen Senior und Staff ist relativ groß, aber da gehen wir dann eh gleich noch darauf ein. Jetzt nochmal zurück zu meiner Frage, warum ist denn das Ganze entstanden? Warum sprießt das jetzt irgendwie aus dem Boden und warum gibt's jetzt plötzlich Staff? Weil bisher hat's ja eigentlich nur Senior gegeben, jeder war glücklich mit diesem Senior und jetzt kommt plötzlich Staff, Senior Staff, Principal, whatever.",
      "start": 456197,
      "end": 478503,
      "confidence": 0.8074714285714291,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja genau, fangen wir mal vorne an. Also die normalen Joblevels sind eigentlich Junior-Engineer, das sind so die Einsteiger, die kommen gerade entweder aus der Uni oder aus der Ausbildung oder Quereinsteiger. Dann die Mid-Level, nach ein paar Jahren Erfahrung, wenn man dann schon irgendwie die ersten paar Projekte mitgemacht hat und dann Senior. Das ist so die drei Level, die der europäische und deutsche Markt immer kennt.",
      "start": 478643,
      "end": 497946,
      "confidence": 0.7602941176470589,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man ja dazusagen muss, dass Mid-Level eigentlich auch erst kürzlich so entstanden ist. Früher hat's ja eigentlich auch nur so Junior, Senior gegeben. Und dieses Mid-Level ist irgendwo dazugekommen in den letzten Jahren.",
      "start": 498446,
      "end": 509255,
      "confidence": 0.7309411764705881,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, hat sich aber mehr so eingeschlichen. Ich hab das Gefühl, mit den neuen Leveln, also das bedeutet Senior, Staff, Senior, Staff, Principal oder Distinguished und dann in manchen Firmen sogar Fellow, die kommen schon mit so einer Art Big Bang und schleichen sich nicht so ein wie den Mid-Level-Ingenieur. Naja, auf jeden Fall, die Level von Staff und Senior-Staff und allem drum und dran wurden prinzipiell eingeführt, weil die Leute, die das Senior-Level erreicht haben, die waren eigentlich am Ende der Karriereleiter. Und danach hieß es...",
      "start": 509715,
      "end": 541314,
      "confidence": 0.8146436781609196,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Werde Manager.",
      "start": 541354,
      "end": 542734,
      "confidence": 0.668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Werde Manager. Du wirst jetzt Engineering-Manager. Und so wird's sehr wahrscheinlich auch vielen von euch gehen. Viele von euch sind sehr wahrscheinlich, die schon ein bisschen länger im Beruf sind, genau diesen Weg gegangen. Sie waren Software-Entwicklerinnen, Sagen okay, wie geht's denn jetzt weiter? Ich bin jetzt Senior, hm, meine Karriereleiter ist irgendwie zu Ende, ich muss jetzt Manager werden. Und dann haben wir alle festgestellt, uh, das ist ja ein ganz anderer Job. Das ist ja gar nicht mehr entwickeln. Und da die IT in den letzten paar Jahren immer wichtiger wurde, immer größer wurde, immer mehr Leute in den Markt geströmt sind, wurde natürlich auch der Bedarf größer einer weiteren Karriereleiter. Also wie steigt man also nach Senior Engineer, Senior Entwickler auf? Da wurden dann, man kann auch böse sagen, künstlich ein paar Level draufgesetzt, wie gesagt Senior, Senior Staff und so weiter, um einfach einen Karrierepfad zu unterbreiten und diesen Menschen natürlich auch irgendwie die Weiterentwicklung zu ermöglichen. Es ist aber nicht so, als wurde da oben einfach nur etwas draufgesetzt und man entwickelt sich mit betriebszugehörigkeit in jahren einfach nur klettert man die leite hoch es ist schon so dass mit diesen levels eine ganz andere art von anforderungen.",
      "start": 542754,
      "end": 607328,
      "confidence": 0.7876551724137932,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ankommen das heißt in der in der vergangenheit waren also durchaus senior leute auf dem staff level aber das hat es halt nicht gegeben und daher waren es einfach seniors die haben aber dann die tätigkeiten von staff mit erledigt oder es kann auch immer noch so sein in.",
      "start": 607368,
      "end": 620614,
      "confidence": 0.8142448979591838,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielen firmen Kann so sein, muss aber nicht, weil da müssen wir mal ganz kurz gucken, wie sieht denn eine IT-Abteilung, eine Entwicklungsabteilung aus Firmensicht aus. Im guten alten deutschen Mittelstand ist nämlich die IT und auch die Entwicklungsabteilung ein ordentliches Cost-Center. Das bedeutet, die kriegen irgendwelche Anforderungen und treiben in der Regel nicht die Innovation von dem Unternehmen. hat sich natürlich in den letzten Jahrzehnten ein bisschen geändert, wo die IT kein Cost-Center ist, sondern wo die IT wirklich ein Innovationstreiber ist, wo die IT der Kern des Produktes für die Firma ist und nicht die Maschine und CNC-Fräse in der Halle. Und wenn wir uns eine solche Firma mal vorstellen, dann kommen da ganz andere Anforderungen auf einen zu, als nur Schreibt mal bitte diesen Code und macht mal dieses Feature. Auf einmal kommt es dann nämlich hin zu Mentoring, zu Alignment über Business Abteilungen, auch ordentlich Kommunikation oder vielleicht einfach mal ordentlich mit dem Manager arbeiten, um eine Entwicklungs- und Softwareentwicklungsstrategie aufzubauen. Jetzt ist meine Frage, in deinem klassischen ursprünglichen Verständnis von einem Senior Engineer, würdest du sagen, das sind alles Attribute, die ein Senior Engineer immer abgedeckt hat?",
      "start": 620654,
      "end": 690372,
      "confidence": 0.8109218749999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "In meinem alten Verständnis, wo es nur Senior gegeben hat, war das eigentlich der große Unterschied zu einem Junior zum Beispiel. Ein Senior, der einfach auch nach außen geht, das Ganze auf einer anderen Ebene sieht und auch das Team weiterbringt. Aber du hast natürlich schon recht, ich glaube ganz allgemein, dass die IT-Teams jetzt viel erwachsener werden in letzter Zeit und vielleicht auch aus ihrem Pizza-essenden Nerd-Image da im Keller irgendwie rauskommen und eben, wie du richtig sagst, zu einem starken Team werden, die auch Innovation liefern.",
      "start": 690912,
      "end": 720672,
      "confidence": 0.8062500000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Man muss ja auch ganz einfach sagen, dass die IT und die Systeme, die wir alle betreuen, ja umweltenkomplexer geworden sind. Wo man früher eine einfache Webseite hatte und dann war man Internet-first, mit PHP, vielleicht auch WordPress, Hast du heute irgendwie ein komplexes Content-Management-System sofort angebunden als ERP-System. Hinten noch ein E-Commerce-Shop, der ist an die komplette Warenwirtschaft mit allem drum und dran. Und dann kriegt der Vertriebs- oder der Ausnehmensmitarbeiter noch eine Nachricht auf seinem iPad und dann wird das alles aus dem CMS mit Cross-Publishing gesüngt und was weiß der Geier nicht, was da noch hinter steckt. Und ich rede noch gar nicht von Microservices und Co. Und meine Frage ist eigentlich, wer schaut denn da mit dem Wissen der Fachdomäne denn mal drauf? Ist das denn immer nur der Senior? Weiß ich jetzt nicht, weil viele Seniors haben auch einfach nur das Interesse, einfach nur dort zu sitzen und schönen, sauberen, testbaren Code zu schreiben, was auch völlig in Ordnung ist. Nur das ist halt unter anderem einer der Unterschiede.",
      "start": 720692,
      "end": 778791,
      "confidence": 0.8216839080459775,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und ist das Ganze, wenn es jetzt von Amerika so rüberschwappt, war Amerika da einfach viel früher dran? Haben die eine andere Kultur? Übernehmen wir jetzt einfach ihre Kultur oder sind die einfach früher draufgekommen, dass es irgendwie stärkere IT braucht oder auch Entwicklung produktgetriebener, dass das Ganze wichtiger ist, das Digitale in Firmen?",
      "start": 779563,
      "end": 799072,
      "confidence": 0.8417037037037034,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also die Antwort ist ja und nein. Es gibt sehr viele amerikanische Firmen, die hatten von Anfang an sehr viele Level. Google, Microsoft, Uber und so weiter und so fort. Und ja, man muss auch sagen, diese ganze Innovationskraft kommt sehr wahrscheinlich sehr viel aus dem Silicon Valley. Es gibt aber auch andere Beispiele, wie zum Beispiel Netflix. Netflix hatte bis vor kurzem immer nur ein Level und zwar Senior Engineer, weil die wollten immer die Besten von den Besten hirnen und deren Credo war immer, one level across all of engineering.",
      "start": 799412,
      "end": 824924,
      "confidence": 0.8176739130434784,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also die haben nur Seniors in der gesamten Firma.",
      "start": 825324,
      "end": 828126,
      "confidence": 0.8623333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dort wurde jeder gleichgestellt, die hatten nur Seniors.",
      "start": 828166,
      "end": 831709,
      "confidence": 0.8416249999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das war so ähnlich wie bei uns bei Trivago damals. Bei Trivago hatten wir auch keine Titel, da war jeder nichts.",
      "start": 831749,
      "end": 836932,
      "confidence": 0.8704285714285716,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist eigentlich vergleichbar. Jetzt ist es aber so, Anfang des Jahres hat Netflix das Ganze geändert. Und jetzt kann man sich die Frage stellen, okay, warum sollte ein Unternehmen, neue Level einführen, was in den letzten 25 Jahren ohne sie ausgekommen ist und auf fast 2.000 Software-Developer angewachsen ist. Warum brauchen die jetzt Junior-, Middle-Level- oder Staff- oder Principal? Und ja, ihr habt richtig gehört. Netflix ist 25 Jahre alt. Netflix wurde 1997 gegründet, damals noch mit DVD-Verleih. Der weise Wolfgang erinnert sich. Und soviel ich weiß, waren die der größte Konkurrenz vom amerikanischen Geschäft Blockbuster. Das war so das amerikanische Penedat, vorher das deutsche Videoland. Also ich bin auch immer früher noch zum Videoland gegangen. Und Achtung, die hatten nicht nur Videos, sondern irgendwann auch DVDs und Playstation 1 oder Playstation 2 Spiele. Ich bin immer ausgeliehen. Wahnsinn. Ich durfte aber nie in den Raum für 18 Jahre, weil da war ich noch keine 18.",
      "start": 836972,
      "end": 889034,
      "confidence": 0.7729358974358976,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der Unterschied ist eben, ich wollte gerade sagen, dieser 18 Jahre Raum von Porn, den gibt es bei Netflix nicht, interessanterweise, aber ist ein anderes Thema. Okay, kommen wir zurück zu Seniors.",
      "start": 889044,
      "end": 897750,
      "confidence": 0.68721875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Frage ist, warum haben sie es gemacht? Und zwar hatten sie eigentlich drei Herausforderungen. Eine Herausforderung war, sie konnten neuen Software-Engineers keinen Karrierepfad bieten, weil sie konnten kaum Leute von Stanford und Co einstellen, weil die halt sofort natürlich ins Senior-Level eingestiegen sind. Und wenn man jetzt aber Leute ein bisschen selbst ausbilden möchte und so weiter, dann fängt man halt in der Regel damit an, Juniors einzustellen. Die zweite Herausforderung war, Netflix attraktiv zu machen für andere Top-Talente von anderen Silicon Valley Firmen. Jetzt stell dir mal vor, du bist irgendwie Principal oder Staff Engineer bei Google. Warum solltest du denn jetzt nach Netflix wechseln? Klar, gehaltstechnisch schon. Vielleicht ist das ein Unterschied. Vielleicht kriegst du bei Netflix mehr Geld. Auf deinem Lebenslauf sieht dies aber aus wie ein Downleveling, weil Karrierepfade, das müsst ihr euch bitte auch in Erinnerung rufen, gehen nicht immer nur in eine Richtung, es geht auch in die andere Richtung. Das bedeutet, ihr seid jetzt Senior Staff bei einer Firma, wechselt den Job und die Anforderungen an einen Senior Staff sind höher bei der neuen Firma, dann kann es sein, dass ihr in der neuen Firma nur noch Staff Engineer seid oder vielleicht sogar nur noch Senior Engineer. Sowas nennt man Downleveling. Für ziemlich viele Leute sieht sowas auf dem Lebenslauf ziemlich doof aus, wenn man sich das aber einmal ganz kurz durchdenkt. Ich hatte am Anfang gesagt, die Anforderungen an die Joblevel sind nicht gleich. Es gibt keine Industrienorm. Deswegen ist das in der Regel auch nichts Schlimmes.",
      "start": 898011,
      "end": 986185,
      "confidence": 0.8062929687499999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber das heißt auch Netflix hat sich da von außen sehr stark treiben lassen vom Markt und ist einfach gezwungen worden eigentlich da umzusteigen.",
      "start": 986245,
      "end": 992570,
      "confidence": 0.8524999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, und da kommen wir nämlich direkt zum dritten Punkt. Der Haupttreiber der ganzen Sache waren Kosten, weil das Problem war einfach, wenn du jemanden neu eingestellt hast, musstest du ihn sofort auf Senior-Level bezahlen. Natürlich gab es Unterschiede, ja. Es gibt Leute, die sind Koryphäen in ihrem Bereich, die werden dann sehr wahrscheinlich ihre 400.000, 500.000 verdienen. Und wenn ich da jetzt ankomme, dann werde ich keine 400.000, 500.000 verdienen. Dennoch würde ich sofort mehr verdienen als, wenn wir Junior Levels hätten.",
      "start": 992943,
      "end": 1023468,
      "confidence": 0.7922771084337348,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt, sie wollten auch einfach billige Arbeitskräfte sich holen, direkt von der Uni zum Beispiel und die selber auch ausbilden. Das hat natürlich auch einen großen Einfluss auf die Diversity, wenn wir da wieder sind, weil wenn du natürlich nur Seniors hast und irgendwelche alten Leute in deinem Team, dann fehlt dir dann natürlich der ganze Unterbau, der da von unten nachkommt, auch frische Ideen vielleicht hat, junge Ideen, das fehlt dann natürlich auch alles.",
      "start": 1023508,
      "end": 1045014,
      "confidence": 0.8031973684210525,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du sagst das jetzt so böse, billige Arbeitskräfte von der Uni. Es ist halt nun mal so... Ja.",
      "start": 1045345,
      "end": 1049807,
      "confidence": 0.7745,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hast gerade mit den Kosten angefangen.",
      "start": 1049847,
      "end": 1051388,
      "confidence": 0.7662857142857141,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe das Wort billig oder günstig nicht in den Mund genommen. Es ist doch nun mal so, dass...",
      "start": 1051408,
      "end": 1056591,
      "confidence": 0.7950000000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dann sagen wir kosteneffizient.",
      "start": 1056611,
      "end": 1058952,
      "confidence": 0.85375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kosteneffizient, da würde ich mich drauf einlassen. Es ist ja nun mal so, dass ein Junior-Engineer einfach nicht denselben Output hat oder Outcome wie ein Senior-Engineer. Beide aber mindestens gleich zu bezahlen, ist dann ein bisschen ungleich, würde ich mal so sagen.",
      "start": 1058972,
      "end": 1073900,
      "confidence": 0.7961904761904761,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber kommen wir mal jetzt wirklich zu den konkreten Unterschieden. Wenn du jetzt sagst Staff plus zu Senior, wo ist denn da jetzt der große Cut, der Unterschied zwischen diesen zwei Levels? Warum hat man Staff eingeführt? Was will man da abgrenzen?",
      "start": 1074120,
      "end": 1089666,
      "confidence": 0.8497380952380951,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hatte vorhin schon gesagt, der Unterschied zwischen Senior- und Staff-Level ist schon enorm. Bis zum Senior-Level, sagt man so in der Industrie, ist es relativ leicht. Mit relativ leicht meine ich, man fängt an, Code zu schreiben, man fängt an, ein paar Tickets zu schreiben, man ist involviert in größeren Projekten, in komplexeren Projekten, man löst komplexere Probleme, debuggt und so weiter. ohne große Hürden relativ schnell bis zum Senior aufsteigen bei, ich nenne es mal gute Craftmanship. Das bedeutet, wenn ich mein Handwerk, meine Programmierung, mit allem drum und dran, Debugging, Monitoring und Co., Debugging, Monitoring, Softwarearchitektur, Testing und was nicht noch alles dazugehört, Teamwork, dann ist es nur eine Frage der Zeit und eine Frage der Erfahrung, bis ich das Senior-Level erreiche. Um die Hürde zum Staff-Engineer zu überbrücken, da kommt dann die ganze die ganze welle was alles unter dem thema leadership unter anderem schwimmt damit so bei das.",
      "start": 1090166,
      "end": 1152361,
      "confidence": 0.8315620915032681,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Heißt bis zum senior bleibt man eigentlich in seinem eigenen metier dem eigenen handwerk dem coden und ab staff plus verlässt man diese welt und tritt in andere bereiche ein wo man dann auch dementsprechend lernen muss leistung zeigen muss aber das ist was neues und nicht mehr das klassische programmieren die welt verlassen würde ich.",
      "start": 1152381,
      "end": 1172649,
      "confidence": 0.8766785714285714,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nicht sagen es wird bestimmt immer noch phasen geben wo man auch noch mal mit seinem handwerk wirklich eingreifen muss und programmieren muss und das ist ja auch gewollt es ist nur so dass du ganz andere anforderungen hast und natürlich auch viel mehr mit reingezogen wirst In meinem mentalen modell ist ein staff engineer der technische kompanion vom engineering manager engineering manager wenn diese person technisch ist das super verstehe mich nicht falsch doch es ist nun mal so dass eine engineering manager eine engineering managerin dass diese person auch unglaublich viel Teamführung, People-Verantwortung hat und so weiter und so fort. Das bedeutet, ein Engineering-Manager oder eine Engineering-Managerin kann unter Umständen, je nach Komplexität des Projektes und Co., gar nicht mehr die fachliche Expertise an den Tag legen, um das Projekt richtig zu steuern. Und in meinem mentalen Modell ist zum Beispiel unter anderem ein Staff-Engineer dafür da, teilweise die technische Leadership sogar zu geben. Und ich sag mal so, der 1-zu-1-Kompanion vom vom Management zu sein, um das ganze Thema auch domänetechnisch zu leiten. Das muss nicht in jeder Firma so sein, in manchen Firmen ist es aber so aufgebaut. Joblevel sind auch sehr stark an die Kompensation verbunden. Das bedeutet, wie viel Gehalt kriegst du? Kriegst du Firmenanteile? Wenn ja, wie viele? Und so weiter und so fort. Und in der Regel ist das so, dass Staff Engineers auf demselben Kompensationslevel sind wie Engineering Manager.",
      "start": 1172669,
      "end": 1256977,
      "confidence": 0.8118403361344537,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, versuchen wir mal ein bisschen konkreter zu werden. Wo würdest du denn jetzt konkret die größten Unterschiede sehen zwischen diesem Senior-Bereich und dem Staff-Plus-Bereich?",
      "start": 1257257,
      "end": 1268347,
      "confidence": 0.8297599999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich könnte hier mein eigenes Modell erfinden und die größten Unterschiede irgendwie selbst definieren. Doch ich habe mal ein Video gesehen von einer Dame namens Tanja Raley, die hat ein Buch geschrieben bei O'Reilly. Das ist jetzt kein Witz, die Dame heißt wirklich so grandios. Und ihr Metallus-Modell finde ich eigentlich sehr schön. Und zwar definiert sie eigentlich drei Bereiche, in dem sich Staff Engineers von Senior Engineers unterscheiden. Das eine ist Big Picture, da geht es um Prioritäten, die Bedürfnisse des Businesses und so Fragen, wo sind wir eigentlich nächstes Jahr oder beziehungsweise wo sollten wir nächstes Jahr sein. Dann geht es um die Execution. Ja, das machen auch Senior Engineers, aber da geht es natürlich nicht nur um die technischen Skills, sondern auch um die menschlichen Skills. Teamzusammenhalt, Kommunikation, Leadership. Und im dritten Bereich, da geht es um Leveling Up, da geht es um Mentoring, das Team vorwärts bringen und Leuten halt einfach auch was beibringen. Das kann man alles natürlich nicht ohne eine gute Basis schaffen, der sogenannten Foundation. Das bedeutet, man braucht halt schon das technische Wissen, um einzuschätzen können, macht das jetzt Sinn, macht das jetzt keinen Sinn.",
      "start": 1268367,
      "end": 1335328,
      "confidence": 0.8233989637305706,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt, man braucht für diese drei Bereiche schon ein technisches Grundverständnis, auch dieses ganze Wissen, was man sich da angesammelt hat. Also das kann jetzt demnach niemand machen, der keinen technischen Background hat und das Ganze versteht, sondern nur der im Prinzip davor auch Senior war oder die Senior war und dann übergeht eine Ebene höher, um das dann auch wirklich zu nutzen, was man sich davor angeeignet hat in den Jahren davor.",
      "start": 1336148,
      "end": 1362462,
      "confidence": 0.8266756756756755,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe noch nie jemanden gesehen, der ein Level übersprungen hat. Das bedeutet, der direkt von Mittel-Level auf Staff-Engineer gegangen ist. Und Quereinsteiger auf Staff einzustellen ist auch vielleicht ein bisschen schwierig, weil denen halt die Grundlage, diese jahrelange Erfahrung... Also ich meine, du bist ja auch nicht Senior mit zwei Jahren Berufserfahrung.",
      "start": 1362782,
      "end": 1377940,
      "confidence": 0.7663584905660378,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und man muss auch in dem Bereich tätig sein oder? Also ich kann jetzt nicht als Psychologe plötzlich Staff Engineer oder sowas werden. Also es ist schon soweit die Technik noch nötig in dem Job.",
      "start": 1378120,
      "end": 1389051,
      "confidence": 0.8128571428571428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also als Psychologe verstehst du sehr wahrscheinlich schon einen guten Teil von dem was ein Staff Engineer verstehen sollte in Bezug auf Teamzusammenhalt, Teamdynamiken, Mentoring und Co. Die fehlt aber ganz einfach das komplette Verständnis, was braucht das Business eigentlich, wie sieht eine IT- oder Entwicklungsstrategie aus und was sind eigentlich die technischen Skills. Also die hat ja ein Psychologe ja jetzt nicht im Bereich Softwareentwicklung.",
      "start": 1389111,
      "end": 1413621,
      "confidence": 0.7565151515151517,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt hat ja so ein Staff-Engineer üblicherweise keine Personalverantwortung. Also im Gegensatz zu einem klassischen Manager oder Engineering-Manager, die ja üblicherweise Personalverantwortung haben und dann auch wirklich in der Hierarchie darüber sind, haben ja die Staff-Engineers meistens keine Personalverantwortung. Wie können die denn jetzt mit dem Team überhaupt zusammenarbeiten, weil die können dem Team jetzt in dem Sinne nichts befehlen oder durch die Hierarchie anleiten oder leiten.",
      "start": 1414013,
      "end": 1442790,
      "confidence": 0.8521940298507465,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist richtig. Personalführung haben Staff Engineers in der Regel nicht beziehungsweise keine Personalverantwortung. Und da kann ich dir mal eine ganz kurze Story erzählen, wie ich zu dem Mysterium, wovon wir jetzt sprechen, gekommen bin. Und zwar, bei Trivago hatte ich eine Leadership-Position, und irgendwann bin ich von dieser Leadership, also ich war Abteilungsleiter, konnte man das jetzt in dem Sinne nennen. Und irgendwann nach einem Jahr hab ich gedacht, hey, ich bin so weit weg von den technischen Details, ich lieb die aber zu sehr. Da hab ich mit meinem damaligen Vorgesetzten gesprochen, und dann gab's die Möglichkeit, dass ich wieder Individual Contributor werde, also zurück an den Code. Und dann haben wir eine Rolle für mich gesucht, weil ich halt auch ziemlich viel Teammanagement-Erfahrung hatte und Co.",
      "start": 1442810,
      "end": 1483400,
      "confidence": 0.7953538461538462,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und keiner wollte dich, oder?",
      "start": 1483440,
      "end": 1484920,
      "confidence": 0.737,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin schon gut untergekommen und dann auch als Individual Contributor wieder ohne Personalführung. Aber durch meine vorherige Erfahrung wurden mir halt ein paar Aufgaben gegeben, die schon, ja, ich würde fast sagen, einem Staff-Engineer gleich kommen würden. Da ging es dann um Cross-Team-Projekte und auch ein paar Initiativen in der Firma weitertreiben, die zur Engineering-Kultur ein bisschen was beisteuern. Und da kam er zu mir und sagt Andi du musst jetzt leading by influence ausführen not by authority.",
      "start": 1484940,
      "end": 1515078,
      "confidence": 0.7967341772151901,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du dir wieder nicht ausgekannt weil du dein ganzes Leben nur Befehle gegeben hast den ganzen Teammitgliedern und jetzt kommt er plötzlich an du sollst Befehle geben ohne Autorität zu haben.",
      "start": 1515098,
      "end": 1524048,
      "confidence": 0.7439374999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich war ja noch nie so einer gesagt hast du machst das du machst das du machst das sondern, Natürlich in meinen vorherigen rollen war ich engineering manager wenn ich gesagt habe okay dann lass uns das doch mal tun dann hatte mein lass uns das doch mal tun natürlich ein anderes gewicht weil ich der vorgesetzte war, aber jetzt war es halt nicht so ich hatte keine personalführung mehr und ich sollte leading by influence durchführen und das ist einer dieser mysterien, bei engineering und jeder muss dann irgendwie herausfinden okay wie leite ich denn leute einfach nur bei influence und ich rede jetzt hier nicht von influencer auf instagram obwohl es natürlich schon so ein bisschen ähnlich ist generell geht es halt darum Andere Leute von etwas zu überzeugen, ohne ihnen direkte Befehle zu geben. Und das bedeutet natürlich auch, man muss über Themen sprechen, bis die Leute natürlich den Sinn in diesem Thema verstehen, den Kontext haben, die Gründe verstehen, warum wir das denn machen und warum das Ganze denn wichtig ist. Oder auch, warum das Ganze nicht nur fürs Team oder für die Applikationen, sondern auch für die Firma wichtig ist. Man könnte es schon irgendwie so ein bisschen Marketing nennen und so weiter ich darüber spreche, denke ich mir, Leading by Influence ist vielleicht der lokale Instagram-Influencer in der Firma. Ein bisschen böse ausgedrückt, aber eigentlich kann man das so nennen. Mit dem großen Unterschied, dass Influencer auf Instagram wenig zuhören, was man natürlich als Dev-Engineer dann umso mehr machen sollte, weil es ist natürlich auch wichtig zu verstehen, wo sind denn die technischen Probleme. Welche Probleme sieht denn die Person, die man gerade versucht zu überzeugen? Warum ist denn ein Projekt verzögert? Oder welche Needs hat denn eigentlich ein Team? Wer braucht Coaching, Mentoring, mehr Wissen? Oder fehlt vielleicht nicht einfach generell Domänenverständnis von der Applikation?",
      "start": 1524088,
      "end": 1626188,
      "confidence": 0.8078557692307691,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, also ich sehe schon, du hast es wieder geschafft, ein Job-Profil absolut unattraktiv zu machen, weil du das jetzt nicht mehr Staff-Engineer nennst, sondern nur mehr Marketing-Engineer. Der macht sowieso nur Marketing. Aber trifft wahrscheinlich durchaus zu. Der andere Punkt, den du erwähnt hast, ist dieses große Ganze zu verstehen, dieses berühmte Bigger Picture. Was bedeutet denn das? Und wir haben ja letztes Mal in der Senior-Episode auch eigentlich erwähnt, der Senior soll das Big Picture im Auge haben und verstehen, wie das Team arbeitet, wo man gerade steht, wo man hin will und diese ganzen Dinge. Also, was macht jetzt der Staff-Engineer oder Staff-Level ganz allgemein, wenn es um das Bigger Picture geht?",
      "start": 1626573,
      "end": 1663938,
      "confidence": 0.7690347826086956,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Im Rahmen von Big Picture geht es natürlich erstmal primär um Priorisierung. Da geht es nicht nur darum, Code zu schreiben, beziehungsweise anderen zu helfen, Code zu schreiben, sondern auch sich die Frage zu stellen, schreibe ich denn hier gerade den richtigen Code für das wichtigste Problem oder löst das Team denn gerade das wichtigste Problem, was nicht nur die Applikation und das Team weiterbringt, sondern auch die ganze Firma.",
      "start": 1663978,
      "end": 1684468,
      "confidence": 0.8288714285714285,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wie findet man jetzt heraus, was das wichtigste Problem für die Firma ist? Also woher weiß das der Staff?",
      "start": 1684718,
      "end": 1690882,
      "confidence": 0.8019999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da kommt ja gerade das Verständnis von Business Need zu Trage. Womit verdient die Firma Geld? Was ist die größte Herausforderung gerade im Markt? Und was ist wirklich der Haupttreiber für die Firma oder das Hauptproblem? Das heißt natürlich auch Netzwerk stecken zu den Produktmanagern und so weiter und so fort. und nicht nur als Techie in seiner Ecke zu sitzen und sagt, oh ja gut, wenn wir jetzt noch zwei Millisekunden rausholen, dann sind wir zwar alle glücklich, verdienen aber keinen Euro mehr, sondern Big Picture Business Verständnis bedeutet auch, sich mit den richtigen Leuten auszutauschen. Seid ihr in einer Firma angestellt, die Vertriebsvertriebler hat, Außenvertriebler? Sprecht mit denen. Was sind die Probleme wirklich vorne an der Front? Habt ihr Produktmanager und Produktmanagerinnen, Data Scientists, Data Analysten? Quatsch mit denen über die letzten Findings in den Daten. Versucht euch mehrere Inputparameter zu holen, um ein besseres Verständnis von der Firma und von den Needs der Kunden oder euren Partnern zu bekommen.",
      "start": 1690902,
      "end": 1746965,
      "confidence": 0.8435802469135799,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das Ganze klingt für mich schon auch ganz nach Team Lead, was ganz oft Team Leads übernehmen, die eben schauen, wird in die richtige Richtung gearbeitet, arbeitet das Team an den wichtigsten Problemen, auch diese Schnittstelle zu Business herstellen, zum C-Level und auch eben den Business Case besser verstehen und nicht nur auf der technischen Seite operieren, aber auch eben das Team in einer gewissen Weise koordinieren. Ich habe das auch ganz interessant gefunden, was die Tanya Rayleigh da in ihrem Buch schreibt, dass man zum Beispiel auch beachten muss, wer denn was im Team übernimmt. Sie hat da so ein Modell aufgestellt, dass man da fünf Punkte beachten muss. Einerseits die Energie einer Person, den Wachstum, Skills, Growth einer Person, also die Weiterbildung, Social Capital in der Firma, wie wichtig ist dieses Projekt, wird die Person dann besser angesehen, Credibility auch, Und eben Quality of Life, also die ganze private Komponente. Und man muss dann Tasks und Projekte so auswählen, dass das eben im Team für die richtige Person passt. Man kann es nicht immer alles erfüllen, dass alle fünf Punkte perfekt sind, dass man keinen Stress hat, dass die Energie möglichst drauf geht. Trotzdem, dass das aber ein ganz wichtiges Projekt ist. Das sind natürlich Sachen, die selten miteinander einhergehen, weil wenn ihr ganz ein wichtiges Projekt vom C-Level habt, dann wird es stressig werden und dann wird da die Energie eher nach unten gehen. Aber man muss halt versuchen über Dauer diese fünf Punkte abzuwägen und möglichst gut die Projekte auch zuteilen. Und meiner Meinung nach hat das früher ganz oft der Team Lead gemacht, Aber das ist auch ganz klar Staff plus Aufgabe, obwohl man keine Personalverantwortung hat.",
      "start": 1747902,
      "end": 1844327,
      "confidence": 0.8267482269503547,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt ja auch nicht, dass der Team das nicht mehr machen kann oder muss. Es bedeutet halt nur, dass man jetzt auch einen Kompanion hat, der in Zeiten, wo es notwendig ist, da einfach nur unterstützt auch. Im zweiten Punkt des mentalen Modells geht es um Execution. Da muss man halt ganz einfach sagen, die Projekte, wo Staff Engineers involviert sind, sind halt wirklich komplexer. Meistens nicht technisch, sondern eher, dass der Scope größer ist, mehrere Teams involviert, mehrere Firmen vielleicht sogar. Oder das Problem ist vielleicht noch gar nicht so kristallklar, dass man da jetzt wirklich 300 Tickets draus erstellen kann und dem Team einfach hinschmeißen kann.",
      "start": 1844367,
      "end": 1880538,
      "confidence": 0.803321100917431,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Tanya Raley beschreibt das ganz nett, dass eigentlich die ganzen beschissenen Projekte die Stars bekommen, weil das sind die, wo alter Code mit dabei ist, die wirklich schwer zu verstehen sind, die nicht klar sind. Also alles das, was man im Junio nie geben würde, der irgendwie from scratch von der grünen Wiese ganz nett wegstarten kann, sondern halt die wirklich schwierigen Projekte, die sind für die Staff-Levels dann eher geeignet oder Dafür bezahlt man die Leute ja auch und darum brauchen sie auch diese Erfahrung, damit sie die halt wirklich reinnehmen können und dann dieses Projekt auf ein Level bringen oder aufspalten können, dass sie es eben auch dann Juniors weiter im Detail bearbeiten können.",
      "start": 1880897,
      "end": 1915202,
      "confidence": 0.7940940170940175,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wo der Junior- und Mid-Level-Engineer oft sagt, boah ne, ich möchte mit dem Code nicht arbeiten, der ist so Legacy, der hat gar nicht die neuesten Standards drin, sagt dann der Staff-Engineer.",
      "start": 1915402,
      "end": 1923288,
      "confidence": 0.6560625000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, gut.",
      "start": 1923968,
      "end": 1924748,
      "confidence": 0.6685,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Legacy verdient halt das Geld, wa?",
      "start": 1924848,
      "end": 1926629,
      "confidence": 0.6566666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist ja dein Lieblingsthema. Du hast ja auch immer auf Legacy gestürzt und hast immer hinten nach aufgeräumt. Andi war ja die Aufräummaschine bei Trivago.",
      "start": 1926649,
      "end": 1935451,
      "confidence": 0.7902962962962962,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Tage in einem anderen Podcast im Super-Duper-Developer-Club vom Nils, Grüße gehen raus, habe ich gehört, dass moderner Code in der Regel nur maximal drei Jahre hält, weil sich dann die Requirements wieder ändern oder wieder ein neues Framework um die Ecke kommt und dann eh alles umgeschrieben wird. Da hab ich mir so gedacht, hey, da bin ich doch mit meinem Mantra, Legacy verdient dat Geld und schneller Hack ist eh besser, doch viel besser dran, oder? Ich muss mir gar nicht so die Mühe geben, um superklar testbaren Test-Driven-Development- und-what-not-Code zu schreiben. Und Clean-Code und was weiß ich, was.",
      "start": 1935491,
      "end": 1968623,
      "confidence": 0.7986237623762377,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es hier alles gibt.",
      "start": 1968723,
      "end": 1969483,
      "confidence": 0.56375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ganz im Ernst, ein guter Hack hält ja eh maximal drei Jahre. Sondern wird ja eh alles neu geschrieben. Also, Legacy verdient dat Geld.",
      "start": 1969503,
      "end": 1976546,
      "confidence": 0.73975,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich würde eher bezweifeln, dass das maximal drei Jahre sind. Also ich glaube, ich habe schon Hacks gesehen, die wesentlich länger irgendwo gelaufen sind als drei Jahre.",
      "start": 1976986,
      "end": 1984429,
      "confidence": 0.7728888888888888,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielleicht ist das aber auch gerade der Unterschied. Vielleicht, wenn man sagt, okay, ich schreibe jetzt enorm guten Code, man ist wirklich stolz, dann hält das drei Jahre, weil sich die Requirements ändern. Und wenn man sagt, ganz im Ernst, der hält ja eh nur drei Jahre, implementiert er die dreckigsten Hacks, dann überlebt er eh zehn Jahre. Vielleicht ist das halt immer so eine Sache.",
      "start": 1984450,
      "end": 2002818,
      "confidence": 0.777030303030303,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das kann natürlich gut sein, ja. Okay, kommen wir zum dritten Punkt von diesem mentalen Modell, dieses Leveling up. Was ist da die Aufgabe vom Staff Level oder Engineer?",
      "start": 2003478,
      "end": 2014745,
      "confidence": 0.7856206896551725,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In vielen Filmen wird das auch ein bisschen gleichgesetzt mit dem vom Engineering Manager. Da geht es aber wirklich darum, die Engineering Kultur nach vorne zu treiben, erfahren zu sein, wie man eigentlich mit Konflikten umgeht, Probleme löst, interpersonelle Konflikte natürlich auch. Und vielleicht nicht in schwierigen Situationen auf, oh, das Team da drüben hat immer alles scheiße gemacht, zu zeigen, sondern einfach zu sagen, hey Jungs und Mädels, wir sitzen alle irgendwie im selben Boot, schön, dass das andere Team es da verkackt hat, hilft uns aber hier gar nicht weiter. Was können wir denn jetzt tun, um aus der Situation rauszukommen? Also, es geht nicht darum, andere zu blamen, es geht darum, objektiv zu bleiben, lösungsorientiert zu arbeiten, und nicht in so einem Tratsch und Klatsch wie bei der Bunte zu fallen.",
      "start": 2014785,
      "end": 2057427,
      "confidence": 0.8127388059701489,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber das ist ja jetzt nicht unbedingt, dass ich dann Leveling abbetreibe, oder? Das ist ja, ich bin ja dann nur nett.",
      "start": 2057865,
      "end": 2062491,
      "confidence": 0.751909090909091,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, nett und freundlich kann man natürlich auch sein, aber primär ist man natürlich ein Role Model in der Hinsicht, ja. Man arbeitet dann oft mit Leuten zusammen, die dann Junior, Mid-Level oder Senior sind und die schauen dann natürlich zu einem auf. Man muss aber auch sagen, nett sein kostet nicht so viel Energie, wie wirklich objektiv lösungsorientiert zu arbeiten und dem Team helfen, aus Situationen wieder rauszukommen. Es hat natürlich auch sehr viel mit Zuhören zu tun, zu verstehen, wie sehen die Teammitglieder denn die Probleme, warum ist das Projekt denn verzögert oder welche Needs hat das Team, wer braucht Coaching, wer braucht Mentoring, wer braucht ein Upskill, Das klingt jetzt alles so einfach, wenn wir darüber sprechen, es kostet aber enorm viel Energie und meines Erachtens nach macht das den Riesenunterschied zwischen erfahrenen Staff Engineers, die sich immer wieder auf diesen Track zurückziehen und versuchen das ganze Team nach vorne zu bringen und nicht in dieses Tratsch und Klatsch wie in der Bunte zu fallen gegenüber Leuten, die zu diesem Level aufsteigen wollen.",
      "start": 2062511,
      "end": 2124286,
      "confidence": 0.8249886363636361,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, das ist auch ganz wichtig, dass man sich das immer wieder in Erinnerung ruft, dass man da ein Role Model ist. Und ich kenne es auch aus dem ganzen Engineering Manager Bereich. Du sitzt am Abend mit einem Bier zusammen und fangst dann über irgendwen ranten an oder so. Das geht einfach nicht. Du musst auch am Abend bei einem Bier das Role Model sein. Du musst da klar sein, auch in einer größeren Runde, du darfst da nicht mit ranten. Ich glaube, das ist ganz, ganz wichtig. Und das macht am Ende die, Kultur aus. Und man kann jetzt sagen, okay, ich will gar kein Role Model sein, aber dann ist halt vielleicht die Position auch das Falsche. Also wenn man in so einer Position ist, dann ist man ein Role Model und alle schauen auf und auch egal wann, am Abend bei einem Bier, muss man, wie du richtig sagst, einfach möglichst neutral bleiben und das halt nüchtern sehen, subjektiv, falsch, objektiv, muss man das objektiv sehen natürlich und darf da auf keinen Fall in irgendeinen Rant-Mode verfallen. Das ist meiner Meinung nach eines der wichtigsten Punkte, wenn es wirklich um Role Model geht.",
      "start": 2124771,
      "end": 2179281,
      "confidence": 0.7874141414141413,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das ganze ist natürlich umso schwieriger, je mehr die Firma ein Familienleben lebt. Oft sieht man ja, we are all family und allem drum und dran. Oder wenn man wirklich starke Freundschaften im Job aufbaut und so weiter, dann fällt das natürlich unglaublich schwierig. Punkt ist, das ist aber der große Unterschied.",
      "start": 2179641,
      "end": 2198997,
      "confidence": 0.8604528301886794,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und ich möchte auch gar nicht sagen, dass man dann keine Fehler oder sowas machen kann. Das passiert jedem, aber da muss man halt auch dazu stehen. Also Role Model heißt nicht, man darf keine Fehler machen. Ich kann mich da zurückerinnern, das war ein Erlebnis, was ich nie vergessen werde. Das war noch zu Uni-Zeiten, wo ich mit einem Kollegen aus einem anderen Institut zusammengearbeitet habe. Und der hat einen Fehler gemacht. Und wir haben das besprochen in einer Vorlesung. Und er hat gemeint, wir geben den Fehler nicht zu. Die Studenten dürfen nicht sehen, dass wir Fehler machen. Ihr habt das gar nicht verstanden, was er meint zuerst. Warum kann man keine Fehler zugeben? Aber der war so auf diesem Trip, man darf keine Fehler zugeben. Und die Studenten müssen glauben, wir sind gut als Lehrende, die machen keine Fehler. Und ich glaube, das geht einfach komplett in die falsche Richtung. Also auch Fehler zugeben, ist komplett in Ordnung, auch wenn man ein Role Model ist, weil genau das macht dann am Ende die gute Team Culture und die Culture in der Company aus, wenn man mit Fehlern offen umgeht, aber natürlich eben nicht rantet oder in dieses Muster eben von Ranting verfeilt.",
      "start": 2199297,
      "end": 2260951,
      "confidence": 0.814107317073171,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Man merkt schon, die Rolle des Devs ist weit mehr als Coden, Coden, Coden. Gegebenenfalls ist sie auch nicht für alle. In der Industrie sagt man eigentlich, dass jeder das Senior-Level anstreben sollte und bei vielen Firmen ist es auch völlig in Ordnung, wenn man 30, 35 Jahre auf dem Senior-Level bleibt. Ab dem Senior-Level gibt es in der Regel keine große Erwartung mehr, dass man an das Staff-Level herankommt. Wenn man sich aber dafür entscheidet, dann kommt natürlich ein ganzer Haufen neue Anforderungen mit und ein paar haben wir davon erwähnt.",
      "start": 2261132,
      "end": 2292568,
      "confidence": 0.8131739130434781,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt, wenn man sich diese Bereiche so anschaut, und ich habe es ja schon erwähnt, viel erinnert mich da auch an einen Team Lead und an einen Engineering Manager. Wo siehst du denn jetzt die großen Unterschiede zu einem Engineering Manager, also zwischen Staff und Engineering Manager, der oder die dann auch Personalverantwortung hat? Wo siehst du da die großen Unterschiede?",
      "start": 2292890,
      "end": 2311320,
      "confidence": 0.7242295081967213,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also wenn wir von Personalverantwortung reden, reden wir in der Regel natürlich von disziplinarischer Verantwortung. Und dazu zählt natürlich sowas wie Performancemanagement, aber auch die nicht so freundlichen Sachen wie Abmahnung und Entlassungen, Gehälter, Headcountplanning, das bedeutet, wie viele Leute plane ich über das nächste Jahr einzustellen oder halt auch nicht. Recruiting, das bedeutet entscheiden, wen man einstellt oder auch nicht. Aber natürlich auch Strategien entwickeln, team reviews und mit seinem vorgesetzten und mit seinen direkten peers auch darüber zu sprechen was die abteilung denn erreichen möchte und wobei.",
      "start": 2311500,
      "end": 2345842,
      "confidence": 0.8058426966292133,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man natürlich schon sagen muss dass die staff engineers da normalerweise immer in irgendeiner form mit eingebunden sind oder auch andere leute im team ganz allgemeines team also klar bei beim hiring oder recruiting entscheidet der Engineering-Manager wahrscheinlich, wer am Ende eingestellt wird, der oder die hat das letzte Wort. Aber das Team ist natürlich in Interviews dabei und kann sich da auch einbringen. Und ich glaube, auch bei Staff-Level ist man dann schon so weit, dass man auch sich nicht nur einbringt, wenn man gefragt wird, sondern dass man dann halt auch pusht und wirklich auch den Engineering-Manager pusht und vielleicht Sachen vorschlägt oder wirklich aktiv probiert mitzuwirken in dem Bereich vom Engineering-Manager oder wenn es irgendwo Probleme gibt, da auch wirklich Druck aufzubauen, wenn der Engineering Manager dafür verantwortlich ist oder andere Business Stakeholder oder wer auch immer in der Firma, dass man da so aktiv auch nach außen geht, auch wenn das vielleicht nicht direkt der eigene Einflussbereich ist, den man hat und die Aufgabe ist, aber die Kommunikation mit den anderen und Themen weiterzubringen, ist definitiv die Aufgabe von einem Staff Engineer.",
      "start": 2345882,
      "end": 2407366,
      "confidence": 0.8260591397849459,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hatte am Anfang gesagt, Disclaimer, die Definition von diesen Leveln, da gibt es keinen Industriestandard. Und das ist auch sehr schön zu sehen, zum Beispiel bei zwei Leveling Guides, einmal von CircleCI, einer Continuous Integration Firma, und einmal bei Dropbox. Dort haben wir zum Beispiel unterschiedliche Verständnisse von dem Scope eines Dev-Engineers. Wo CircleCI sagt, okay, dein Scope, dein Bereich, in dem der Dev-Engineer eigentlich den Influence hat, ist innerhalb eines Teams, und er ist der Senior Dev-Engineer, dort ist die Erwartung gesteckt, dass der Scope über mehrere Teams hinweg sein soll.",
      "start": 2407386,
      "end": 2443773,
      "confidence": 0.7740645161290324,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man dazu sagen muss, das sind technische Teams gemeint. Also der Staff Engineer bei CircleCI hat schon Kommunikation nach außen, muss mit dem Business zusammenarbeiten, mit den Stakeholders, das schon, aber nicht direkt dann mit anderen technischen Teams, dass das über technische Teams hinweg dann irgendwelche Projekte oder ähnliche sind. Das wäre dann der Senior Staff bei CircleCI. Hingegen bei Dropbox zum Beispiel ist das anders.",
      "start": 2443793,
      "end": 2468793,
      "confidence": 0.7961492537313437,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bei Dropbox wird einfach ganz klar gesagt, okay, der Staff Engineer, der hat direkt die Anforderungen, seinen Scope, zum Beispiel Leading by Influence über mehrere Teams hinweg.",
      "start": 2469333,
      "end": 2479237,
      "confidence": 0.7253333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also da sieht man schon, dass sich das durchaus unterscheidet und wer sich die Dokumente mal anschaut unten in den Shownotes, für alle HörerInnen übrigens, die das nicht wissen, was Shownotes sind, ihr könnt da normalerweise unten etwas aufmachen, weil wir haben das Feedback bekommen, manche wissen nicht mal, was Shownotes sind. Also diese Beschreibung, die geht unten dann noch weiter und da findet ihr ganz viele Links, also bitte da auch immer mal reinschauen. Und wenn man sich diese zwei ansieht, dann ist das alles super genau definiert. Also das sind wirklich Vorzeigeguides natürlich, die das auf ganz vielen Ebenen ganz spezifisch dokumentieren und da fast wie eine Richtlinie das aufbauen. Aber man muss auch sagen, das macht nicht jede Firma so. Ganz klar, es machen auch ganz große Tech-Firmen nicht so. Ich habe gerade gestern noch mit einer Kollegin gesprochen in einer sehr, sehr großen Tech-Firma mit tausenden Mitarbeitern. Die haben gar keine Spezifikation zum Beispiel von sowas, obwohl sie es darf haben. Also auch da ist es nicht in jeder Firma so, also nicht abschrecken lassen von diesen extremen Guides und genauen Definitionen, es muss nicht immer so sein. Aber was man durchaus bei diesen Definitionen sieht, das ist eben vor allem in den anderen Bereichen, wie die wir erwähnt haben, diese Bigger Picture Execution Leveling Up, da sind sie eigentlich auf der gleichen Seite, die zwei Guides, weil die beide dort den Schwerpunkt von Staff sehen. Natürlich ist der Scope leicht anders definiert oder andere Schwerpunkte, aber im Großen und Ganzen diese drei Bereiche Leveling Up, Execution und Bigger Picture, da sind sie sich auf jeden Fall einig.",
      "start": 2480118,
      "end": 2567076,
      "confidence": 0.8304889705882351,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn ihr euch in diesem Podcast bisher wiedergefunden habt und sagt, hey, eigentlich mache ich doch genau das, was ihr beschrieben habt, aber ich heiße jetzt gar nicht Staff Engineer. Vielleicht gibt es in eurer Firma sowas gar nicht, vielleicht gibt es auch gar keinen Leveling Guide oder was sind die Anforderungen? Quatscht auf jeden Fall mit eurem Vorgesetzten und fragt sie oder ihn, was sind eigentlich die Erwartungen, die an euch gesteckt werden? Was ist mein Job? Was soll ich machen? Was würde in meinem Jobprofil stehen? Und schreibt das mal bitte auf, weil auch wenn ihr Titel habt in der Firma und kein Leveling Guide, dann wird es relativ schwierig, wenn ihr gar nicht so wisst, ob ihr den aktuellen Erwartungen gerecht werdet. Wie soll das dann eigentlich bei den nächsten Performance Reviews sehen? Oder ihr denkt, ihr lauft in die richtige Richtung, macht einen Drupal-Job und deine Vorgesetztin sagt, hör mal, irgendwie erfüllst du die Erwartungen nicht. Nächste Frage wäre dann, was für Erwartungen? Werdet euch da mal im Klaren. Und vielleicht ist das auch mal ein Gespräch, was ihr Anfang des neuen Jahres mit eurer Vorgesetzten anfangen solltet. Die Zeit ist ungefähr so die beste Zeit, das mal zu starten, weil dann kann man nämlich das ganze neue Jahr planen. Der Vorgesetzte kann natürlich dann so Sachen einfließen lassen wie, hey, Wie kann ich dich eigentlich weiterentwickeln?",
      "start": 2567096,
      "end": 2634319,
      "confidence": 0.782116883116883,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sollte sogar, würde ich sogar sagen. Das ist ein ganz wichtiges Element, weil dein Vorgesetzter oder deine Vorgesetzte sollte sich ja auch um das Leveling-up von dir kümmern. Aber ganz wichtig, versuch das immer schriftlich zu machen, weil dann kann man das einfach auch zum Review wieder der anderen Person geben, kann ein paar Mal Ping-Pong machen und das gemeinsam erstellen. Und wahrscheinlich haben die Firmen wie CircleCI und Dropbox genauso angefangen, und haben das dann einfach immer weiterentwickelt. Und das hilft dann vielleicht dem ganzen Team oder auch anderen Personen in der Firma auf jeden Fall weiter.",
      "start": 2634339,
      "end": 2667121,
      "confidence": 0.7995000000000004,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und der Wolfgang hat das nur mal ganz kurz im Sebensatz erwähnt. Verschriftlichen. Ich meine das wirklich ernst. Das ist mein Pro-Tipp für euch. Das habe ich nämlich auch gemacht. Und zwar habe ich meinen Vorgesetzten mal vor ein paar Jahren gefragt, was sind eigentlich die Erwartungen, die an mich gesteckt wurden. Dann habe ich das aufgeschrieben und nach dem Meeting kurz zu ihm gesendet. Hey, ist das so richtig? Habe ich das so richtig verstanden? Nach einem halben Jahr oder nach vier Monaten habe ich das wieder in dem WannaOne rausgeholt. Hör mal, pass mal auf, das haben wir vor vier Monaten verschriftlicht. Erfülle ich die Erwartungen? Ist das noch der Fall? Und dann kam die Antwort, wieder kann ich mich gar nicht daran erinnern. Also es ist gar nicht unüblich, dass Vorgesetze, weil die so viel zu tun haben, sich an euer Gespräch gar nicht mehr erinnern konnten. Der Punkt ist aber, ihr habt es ja aufgeschrieben. Ja, ihr habt was verschriftlicht. Ich will nicht sagen, ihr müsst euch alle selbst beschützen, doch ab und zu ist das ganz hilfreich, wenn man etwas Schriftliches hat, worauf man sich beziehen kann, worauf ihr euch geeinigt habt. Am besten sogar noch irgendwie ein Shared-Dokument oder eine E-Mail verschriftlicht, weil die Leute, die in höheren Positionen, die haben einfach sehr viel um die Ohren und so könnt ihr euch auf euer Agreement zurückziehen.",
      "start": 2667161,
      "end": 2729259,
      "confidence": 0.7551379310344827,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und man glaubt gar nicht, wie oft man aneinander vorbeiredet. Und schriftlich ist teilweise einfach schwarz auf weiß.",
      "start": 2729419,
      "end": 2734601,
      "confidence": 0.6711111111111111,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und deswegen ist es so wichtig, ihr schreibt das auf, schmeißt das nochmal kurz rüber mit der Frage, haben wir hier das gleiche Verständnis? Weil wenn ihr das nur aufschreibt und die andere Person hat es noch nie gesehen, ist es auch schwierig. Und ganz im Ernst, euer Vorgesetzter und Vorgesetztin wird euch irgendwann auch dafür mal danken.",
      "start": 2735001,
      "end": 2749787,
      "confidence": 0.7644655172413792,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Klar, du nimmst ihnen ja ihre Arbeit ab. Hoffentlich. Okay, Andi, jetzt hätte ich noch abschließend eine Frage, die wir jetzt eigentlich gar nicht besprochen haben. Wie findest du denn das Ganze mit den Titeln? Wir hatten ja bei Trivago gar keine Titel zum Beispiel. Jetzt gibt es Extrembeispiele wie Dropbox CircleCI, die das super genau definiert haben auf Strich und Punkt. Wieso siehst du die ganze Titelgeschichte? Wir in Österreich probieren ja langsam den Postoberadjunkten und den Oberbereiter loszuwerden. Wie siehst du die ganze Titelgeschichte?",
      "start": 2749827,
      "end": 2779686,
      "confidence": 0.7640232558139535,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Am Anfang habe ich gedacht, brauchen wir nicht. Mit den Jahren habe ich meine Meinung geändert. Ich denke, Titel haben eine Relevanz und zwar primär aus drei Punkten. Die erste Geschichte ist, es ist schon so eine Art Dankbarkeit für deine Arbeit und für deine Erfahrung, weil es zeichnet auch, wenn ich eine Promotion kriege, eine Beförderung, weil es ist ja eigentlich eine Beförderung in der Hinsicht. Man geht ja vom Junior zum Mittellevelingenieur und so weiter und irgendwann vielleicht zum Staffingenieur. Es ist halt schon eine Anerkennung für deine Arbeit. Die zweite Geschichte ist, In vielen modernen Firmen deine Vergütung, dein Gehalt, dein Boni, dein Equity, also die Anteile an der Firma, ist auch daran gebunden. Beispiel, die Tage bei der Vorbereitung auf diesem Podcast gelesen, in einer Firma haben Senior Engineers einen Boni-Anteil von ihrem Gehalt von 10%. Staff Engineers in derselben Firma einen Anteil von 20%. Du merkst schon, umso mehr prozentual von deinem Gehalt der Boni ist, umso mehr kommt es natürlich auf deine Zielerreichung, auf deine Performance an. Und der dritte, und das ist so fast der Kicker gewesen, warum ich eigentlich meine Meinung ein bisschen geändert habe, ist Titel können für unterrepräsentierte Gruppen wirklich hilfreich sein, in der Hierarchie, in der Organisation zu navigieren. Denn wenn man einen Staff Engineer im Meeting sitzen hat, dann ist es ganz einfach so, diese Person hat den Titel nicht ohne Grund. Und speziell für unterrepräsentierte Gruppen kann das natürlich ein leichterer Start sein, als jetzt für weiße, alte, privilegierte CIS-Männer zum Beispiel.",
      "start": 2779926,
      "end": 2868337,
      "confidence": 0.7951882352941179,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wer sich mehr für alte weiße Zismänner interessiert, also wir zwei und unsere Meinung, dem empfehlen wir die Episode 50, wo wir über Diversity gesprochen haben.",
      "start": 2868705,
      "end": 2876999,
      "confidence": 0.8186923076923077,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was war deine Meinung über Titel? Denkst du immer noch, die sind sinnfrei oder hattest du die jemals oder hast du auch deine Meinung geändert?",
      "start": 2877039,
      "end": 2883269,
      "confidence": 0.7731599999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich war eigentlich immer ein großer Gegner von Titeln, aber ich habe einfach gemerkt, dass es nicht ohne funktioniert, weil die Leute einfach ständig danach gefragt haben. Viele Leute brauchen diese Struktur, wollen diese Anerkennung. Und wir beide hatten dieses Beispiel in Trivago, wo es gar keine Titel gab. Und da kamen einfach ständig diese Requests. Und wenn man die ganze restliche Welt und vor allem der Arbeitsmarkt mit so Titeln reinpresst, wird es einfach extrem schwierig. Mittlerweile sehe ich die positiven Seiten davon, bin immer noch kein extrem großer Fan, aber ich glaube, man braucht es in irgendeiner gewissen Form, innerhalb der Firma zumindest. Es gibt keinen Industriestandard, ganz klar, aber man sollte sich wenigstens in der Firma einig sein, wie man das macht. In kleineren Firmen geht es sicher auch ohne Titel, aber ich glaube, umso größer und umso professioneller und umso mehr Spezialisten du an Bord hast und umso mehr du recruten musst, ist es ein großes Thema und dann wird es einfach irgendwann schwierig ohne Titel.",
      "start": 2884228,
      "end": 2941380,
      "confidence": 0.8287764705882349,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich merke halt, dass die ganze Sache im deutschen Bereich gerade so Einzuge erhält. Natürlich primär bei den tech-driven companies, wo die IT kein Cost-Center, sondern ein Innovationstreiber ist. Ich bin mal gespannt, wann dies flächendeckend auch beim guten deutschen Mittelstand ankommt.",
      "start": 2941840,
      "end": 2959103,
      "confidence": 0.8334523809523812,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie war das beim Manfred vom Mittelstand? Oder wie heißt dieser Spruch?",
      "start": 2959143,
      "end": 2962024,
      "confidence": 0.6457499999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Beim Mittelstand Manfred, ja.",
      "start": 2962044,
      "end": 2964444,
      "confidence": 0.77275,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Beim Mittelstand Manfred.",
      "start": 2964464,
      "end": 2965764,
      "confidence": 0.7596666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Tage auch einen schönen Begriff gehört, Industrie-Johnny. Hat mich auch sehr zum Grinsen gebracht. Nun gut, das war's.",
      "start": 2965824,
      "end": 2972201,
      "confidence": 0.7626842105263157,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und ganz neu in dieser Episode gibt's mal jetzt einen neuen Feedback-Channel. Und zwar sind wir jetzt auf Mastodon, ingkiosk at podcasts.social. Wir freuen uns da natürlich auf viele Followers und wir werden, um ehrlich zu sein, keine Ahnung, ob wir einen Poll machen können auf Mastodon. Finden wir noch raus. Und sonst auf Twitter gibt's einen Poll, ob ihr Titel in der Firma habt oder nicht. Wir sind sehr gespannt, wie denn so die Rückmeldung aus dem deutschsprachigen Raum so aussieht. Und sonst gilt wie immer, bitte Sterne vergeben, Likes, Herzchen, was ihr auch immer in eurer Podcast-App habt und gerne weiterempfehlen.",
      "start": 2972241,
      "end": 3008679,
      "confidence": 0.8225339805825245,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Tschüss, bis zum nächsten Mal. Tschau.",
      "start": 3009019,
      "end": 3010360,
      "confidence": 0.19516666666666668,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.8016456818181795,
  "audio_duration": 2954,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}