{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/dcd03165-daad-42bd-90d6-0524fe595693/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "621lyn73n0-3173-4d3c-a7d9-de32c0b17a98",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Liest du eigentlich Bücher in der Arbeitszeit? Wie sieht das ganz allgemein aus? Wird deine Weiterbildung bezahlt oder übernimmst du das selbst? Und damit sind wir schon ganz tief im Thema dieser neuen Episode des Engineering Kiosks. Super, dass du dabei bist, denn bei uns geht es heute um die Weiterbildung. Wobei, um die Weiterbildung geht es eigentlich immer in einem Podcast. Also starten wir hinein in das Metathema Weiterbildung. Von neuen Trends wie dem Paid Newsletter, ob der sein Geld wert ist, bis hin zu Friedrich Schillers Meinung zu Zertifizierungen. Wir besprechen aber auch die schmutzigen Seiten der Weiterbildung, wie damit Geld verdient wird, wie Weiterbildungen im Bewerbungsprozess helfen können, aber auch zum Knockout-Kriterium werden können und was es sonst noch so für Weiterbildungsangebote gibt. Vom Massive Open Online Course bis hin zum klassischen Buch. Und ja, das gibt es immer noch. Aber sprechen wir nicht länger über alte analoge Technologien, sondern machen direkt weiter auf unserem hochmodernen Fortbildungskanal, dem Podcast.",
            "start": 4745,
            "end": 58505,
            "confidence": 0.8258209876543209,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Guckst du eigentlich Fernsehen oder Filme oder Serien oder sowas Wolfgang?",
            "start": 64433,
            "end": 68517,
            "confidence": 0.6496363636363637,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Prima im Kino.",
            "start": 68557,
            "end": 69998,
            "confidence": 0.7823333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gehst du ins Kino oder bist du einer so dieser Bösüchte?",
            "start": 70038,
            "end": 73181,
            "confidence": 0.6894545454545454,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich schleich mir nicht ins Kino rein, natürlich geh ich ins Kino.",
            "start": 73221,
            "end": 76444,
            "confidence": 0.6044999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was kostet da inzwischen so ein Ticket?",
            "start": 76484,
            "end": 78285,
            "confidence": 0.5812857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich schau ja grundsätzlich nur Art House Movies und üblicherweise sind die billiger, aber ich war letztes mal schockiert, gut der Film war überlänge aber der hat 11 Euro gekostet, das war schon ein Schock fast, aber ich glaub so in Cineplex und Co zahlt man noch mehr oder?",
            "start": 78325,
            "end": 90116,
            "confidence": 0.7421020408163264,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe jetzt von einem Kumpel gehört, der hat sich den neuen Avatar im Kino angeguckt. Der hat Überlänge und ist irgendwie dann noch in 3D oder in 5D oder ähnliches. Und da hat er glaube ich schon für das Ticket so 18 bis 20 Euro gezahlt. Für eine Person.",
            "start": 90376,
            "end": 104856,
            "confidence": 0.77428,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wenn man sich jetzt überlegt, dass man die gleiche Zeit an Belustigung und zusätzlich noch Wissen mitnehmen kann, wenn man einfach eine Episode von uns hört, die auch kostenlos ist, dann ist das, also dieses Verhältnis ist ja grandios.",
            "start": 105617,
            "end": 117227,
            "confidence": 0.79295,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe aber nochmal einen Spartipp für dich, weil du bist ja auch so ein kleiner Sparfuchs. Und zwar gibt es so ein paar Videos auf YouTube, die ziehen sich eine Warnweste an und dann so eine lange Haushaltsleiter und laufen dann einfach auf den Kinoticketverkäufer zu. Und testen einfach ob sie mit einer leiter irgendwo reinkommen und das testen sie im kino und das testen sie beim theater und so weiter und so fort. Was meinst du denn wie hoch die erfolgschance von diesen leuten ist wenn die einfach mit einer leiter unterm arm irgendwo reingehen.",
            "start": 117247,
            "end": 145347,
            "confidence": 0.7552680412371133,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist meine Lieblingsgeschichte von einem Kollegen, der beim Mediamarkt gearbeitet hat, ist zugegebenermaßen schon einige Jahre her, aber der hat erzählt, dass extrem viel Weißware geklaut wird, sowas wie Waschmaschinen und so Zeug, weil die Leute einfach reingehen, sich so eine Waschmaschine holen, mit so einem Sackwagen rausrollen, oben liegt einfach eine Rechnung oben auf und die rollen einfach raus und es hat nie jemand was gesagt. mittlerweile weiß das vermutlich medienmarkt aber früher war das scheinbar wirklich eine klassische aktion umso größer umso besser weil da fragt niemand.",
            "start": 146127,
            "end": 178248,
            "confidence": 0.8367333333333337,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber warum habe ich die initiale frage gestellt ob du serien guckst und zwar gibt so ein evergreen in deutschland zumindest ein bisschen auf comedy steht und der ist stromberg kennst du die serie stromberg.",
            "start": 178268,
            "end": 189920,
            "confidence": 0.7593999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein, kenne ich nicht. Also vom Namen kenne ich sie natürlich. Ist das nicht im Prinzip einfach nur die deutsche Variante von Office?",
            "start": 190704,
            "end": 195967,
            "confidence": 0.6246956521739131,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Erklär doch mal mal ganz kurz für unsere Hörerinnen und Hörer, was The Office ist, für die Leute, die es nicht kennen.",
            "start": 196007,
            "end": 201731,
            "confidence": 0.6515454545454545,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist einfach eine Serie, die den Office-Alltag wiedergibt. Alle Schrecklichkeiten, die so im Großrahmen-Office und ganz allgemein im Office passieren, ist, glaube ich, original UK und mittlerweile das, was man so auf Netflix schauen kann, ist, glaube ich, die US-Variante von dem Ganzen.",
            "start": 201771,
            "end": 217820,
            "confidence": 0.7538863636363634,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auf jeden fall stromberg der ist immer recht bekannt geworden für seine doch sehr rabiaten sprüche ja also da ist nämlich das ganz klassische office leben ich glaube die sind auch in einem amt oder irgendwie sowas also schon schon ein bisschen bisschen strammer unterwegs und der spruch um den es eigentlich geht heißt wenn ich mit der zeit geht geht mit der zeit.",
            "start": 218180,
            "end": 239476,
            "confidence": 0.7998281249999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hat aber, glaube ich, nicht der Stromberg erfunden. Ist, glaube ich, ein ziemlich, ziemlich alter Spruch. Hat wahrscheinlich irgendwie keiner Aristoteles oder sowas erfunden. Wer also zufällig weiß, woher der Spruch kommt, bitte melden.",
            "start": 240377,
            "end": 251323,
            "confidence": 0.6828823529411765,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe mal gegoogelt extra für diese Episode und Friedrich Schiller hat ihn wohl gesagt. Poet, Arzt, Dramatiker.",
            "start": 251343,
            "end": 258305,
            "confidence": 0.7421111111111112,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "War später dann als Aristoteles, okay.",
            "start": 258346,
            "end": 260548,
            "confidence": 0.8608333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber wie relevant ist dieser Spruch im heutigen IT-Zeitalter, beim heutigen Fachkräftemangel, in der heutigen Situation mit Corona und Co.? ?",
            "start": 260588,
            "end": 269022,
            "confidence": 0.8818095238095237,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist wahrscheinlich die Frage, ob du das von Arbeitnehmer- oder Arbeitgebersicht siehst, weil wenn jetzt der Arbeitskräftemangel so groß ist, dass eh jede beliebige Person einen Job findet, ob mit oder ohne Weiterbildung, ist das wahrscheinlich gar nicht so relevant. Auf Arbeitgeberseite wird das natürlich wesentlich relevanter. Also ich glaube, die Zeiten haben sich auch gewandelt und es ist mittlerweile viel wichtiger als Arbeitgeber in diesen Bereich zu investieren, als Arbeitnehmer von sich aus zu zeigen, wie man sich weiterbildet. Wobei ja meine Lieblingsfrage früher immer, also ich würde sie jetzt immer noch stellen, aber meine Lieblingsfrage beim Recruiting war immer, woher beziehst du dein Wissen? Das war die erste Frage. Also wie bildest du dich weiter? Und die zweite Frage war dann immer konkret, was war das Coolste, was du in den letzten 40 Tagen gelernt hast oder erfahren hast? Egal in was für einem Bereich, auch außerhalb der IT. Und es ist schon interessant, was da für Antworten kommen sind.",
            "start": 269032,
            "end": 322724,
            "confidence": 0.7911349693251538,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist denn die perfekte Antwort, die du auf diese Frage hören möchtest? Wo würdest du 100 Punkte von geben?",
            "start": 322784,
            "end": 329768,
            "confidence": 0.7997500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich war immer ganz glücklich, wenn jemand gesagt hat, Twitter ist meine Quelle, weil ich persönlich natürlich auch ganz viel von Twitter nehme. Da fühlt man sich dann persönlich immer geschätzt. Aber im Prinzip ist es komplett egal. Es geht nur darum zu sehen, ist da überhaupt Motivation da, sich weiterzubilden? Hat man Interesse an neuen Technologien? Ja oder nein? Und ich hatte mal eine Antwort bekommen, die habe ich immer noch im Kopf. Die hat sich so eingebrannt. Der hat irgendwie so gemeint, Ja, ich bilde mich halt dann fort, wenn mir mein Chef sagt, dass wir eine neue Technologie einsetzen und dann liese ich meistens das manuell durch oder so. Und das habe ich so letztes Mal gemacht, wie wir da Java Enterprise eingesetzt haben, da habe ich dann halt probiert, das zu verstehen, damals vor ein paar Jahren. Das war so die die antwort weil mir dann gedacht habe wie kann man nur so wenig interesse an neuen technologien haben also das war fast fast ein ko kriterium für mich in diesem recruiting gespräch.",
            "start": 329808,
            "end": 386089,
            "confidence": 0.8154802259887006,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja auf der anderen seite es gibt sehr sehr viele leute die auch einfach den job machen um die miete zu zahlen und nicht jeder muss 100 prozent passionate dafür sein was man acht stunden am tag tut ich find's schade aber ich find's auch okay.",
            "start": 386129,
            "end": 397721,
            "confidence": 0.772391304347826,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, kommt immer drauf an, wen du natürlich suchst. Also damals für diese Position war es definitiv ein No-Go, so eine Antwort.",
            "start": 398409,
            "end": 404475,
            "confidence": 0.7403636363636363,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und der Wolfgang hat schon das Thema angerissen. In der heutigen Episode geht es nämlich um das Thema Weiterbildung oder wie man mit der Zeit geht, damit man nicht mit der Zeit geht.",
            "start": 404695,
            "end": 415607,
            "confidence": 0.8500909090909093,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wir wollen einfach mal besprechen, was es denn für Möglichkeiten so gibt, um sich fortzubilden. Wer das Ganze denn bezahlt heutzutage? Bezahlt es der Arbeitgeber oder bezahlt es die Arbeitnehmerin, Arbeitnehmer? Und macht das Ganze Sinn? Und wie viel Sinn macht es unserer Erfahrung nach?",
            "start": 415647,
            "end": 432981,
            "confidence": 0.8184347826086957,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich meine, wenn ich mir heutzutage aktuelle Tagespreise von Cobol oder Fortran-Entwickler ansehe, könnte man ja auch sagen, Fortbildung und Weiterbildung macht keinen Sinn mehr, weil irgendwann wird vielleicht auch Java IE so relevant, dass man da ohne Probleme von leben kann ohne sich weiterzubilden oder?",
            "start": 433021,
            "end": 451355,
            "confidence": 0.8729347826086958,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ich habe gerade neulich gelernt, dass es auch irgendwie eine neue Plattform gibt, die auf Kobold basiert, aber ganz neue Aspekte mit reinbringt. Also auch da gibt es News, gar keine Frage.",
            "start": 451395,
            "end": 460497,
            "confidence": 0.7781818181818184,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, natürlich wenn wir an Weiterbildung denken, kommen so die Standardantworten, Konferenzen.",
            "start": 461237,
            "end": 467619,
            "confidence": 0.8327500000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und bevor wir zu den Standards kommen, Andi, meine Frage, Was haltest du denn von Paid Newslettern, weil die sind ja derzeit gerade überall im Munde und ihr könnt jetzt irgendwo wahrscheinlich zehn verschiedene Newsletter abonnieren, jeweils 20 Dollar im Monat zahlen. Wie siehst du denn das ganze mit den Newslettern, die da herumschwimmen? Hast du einen?",
            "start": 467639,
            "end": 488114,
            "confidence": 0.7950877192982457,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Lassen wir das Wort Paid mal erstmal weg, sprechen wir erstmal direkt über Newsletter. Also ja, ich habe, ich glaube, fünf oder sechs Newsletter abonniert, weil irgendwie seit geraumer Zeit, ich würde mal sagen so seit zwei, drei Jahren, gibt es mehr und mehr so Weekly-Newsletter. DevOps Weekly, JavaScript Weekly, Engineering Management Weekly und so weiter und so fort.",
            "start": 488514,
            "end": 507864,
            "confidence": 0.7537288135593224,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, weil genau du JavaScript Weekly abonniert hast.",
            "start": 507884,
            "end": 510525,
            "confidence": 0.577375,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also richtig, habe ich nicht abonniert, gibt es trotzdem, ja. Wie dem auch sei, deren Intervall ist halt so, die schicken einmal pro Woche eigentlich eine Linkliste raus. Also irgendwie ein Headline von einem interessanten Blogpost, der irgendwie die ganze Woche durch die JavaScript-Community durchgeflattert ist. Und dann so zwei, drei Sätze unten drunter. Und dann kriegt man halt einmal pro Woche so eine, ich sag mal, eine kuratierte Liste von guten Artikeln zu deinem Themenbereich, den du halt abonniert hast.",
            "start": 511106,
            "end": 536675,
            "confidence": 0.7548765432098766,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man muss ja dazu sagen, dass sich das eigentlich stark ähnelt zu einem Twitter zum Beispiel, nur dass du halt nicht die Nachrichten drüber hast, was der gerade für Pizza gegessen hat, was sein Hund so zwischendrin gemacht hat, sondern du bekommst halt nur die Links raus von einer Person, die aber kuriert, dir die besten Links sendet. Das ist also das Ziel. Auch wenn du einer Person auf Twitter folgst, wirst du ja einen gewissen Outcome haben und ein Wissen, das du daraus saugst. Und Newsletter, würde ich sagen, ist Twitter minus sinnlosen Stuff wie Hunde und Pizza-Fotos.",
            "start": 537455,
            "end": 569437,
            "confidence": 0.7947575757575759,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, ob das dann immer die besten Links sind, weiß ich jetzt auch nicht. Sie sind ja halt schon stark opinionate.",
            "start": 569477,
            "end": 575018,
            "confidence": 0.7422380952380953,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber du vertraust immer einer Person. Das ist ja die Idee dahinter. Das heißt, du kennst diese Person in irgendeiner Form oder hast die Erfahrung, dass das guter Content ist und dann bekommst du die korradierte Liste. Das ist ja so wie mit unserer kuratierten Tech-Podcast-Liste. Man will ja eben nicht alle Podcasts haben, die da so rumschwirren, sondern in gewisser Weise nur die Tech-Podcasts, die gewissen Qualitätsstandards erfüllen. Also ich habe diese Kuratierung, die macht es meiner Meinung nach aus. Newsletter ist dann nur ein Medium, um das Ganze zu übertragen.",
            "start": 575038,
            "end": 604922,
            "confidence": 0.811565217391304,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja ich glaube man muss da ein bisschen lockerer werden ja also man muss so ein bisschen sein sein vier auf missing out sein fomo so ein bisschen ablegen weil wenn man jetzt sich einmal die woche von so einer kuratierten linkliste bespielen lässt bedeutet das natürlich auch dass man links und rechts abgeben falls ein paar informationen liegen lässt aber das ist für meines erachtens nach, nur so eine art opportunitätskosten weil man könnte sich natürlich auch jeden tag auf twitter hängen und dann den ganzen tag sein tweet stream runter scrollen aber wie du schon sagt dass da kriegt man halt sehr viel neues noch mit rein und und was die leute mit ihren hunden machen was ist der geil nicht alles und so bin ich halt eher okay, Früher habe ich immer sehr sehr viel Google RSS Reader gelesen, der wurde dann irgendwann eingestellt und dann habe ich mich irgendwie nie wieder mit einem anderen RSS Feed Reader vertraut gemacht und irgendwie ist auch, habe ich so das Gefühl, das Zeitalter des Bloggings so ein bisschen abgewandelt. Das bedeutet, wo ich früher zwei, drei, vier einzelne Blogs gefolgt bin, Ist es jetzt so, dass das großbreite Internet irgendwie meine Quelle ist?",
            "start": 605242,
            "end": 663151,
            "confidence": 0.7901666666666665,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, also wir sind jetzt wieder zurück in den 90ern, damals wo ich meine erste Einwahlleitung so bekommen habe, da wieder auch Newsletter abonniert und so Newsnetzeiten. Aber jetzt sind wir angekommen bei den Paid Newslettern. Also zahlst du auch für diese Dinger? Weil kostenlose Informationen bekommen haben wir ja gelernt, hat uns das Internet ja trainiert. Wie sieht es aus mit kostenpflichtigen? Zahlst du für den Content?",
            "start": 663211,
            "end": 687687,
            "confidence": 0.8252352941176471,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe einen Newsletter für den ich glaube ich 120 oder 150 Dollar im Jahr zahle. Ja und ich muss zugeben. Welcher ist das? Das ist The Pragmatic Engineer von von Gergely Orosch.",
            "start": 688267,
            "end": 700792,
            "confidence": 0.7216060606060605,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gergely habe ich gelernt von dem Ungar. Spricht man den aus?",
            "start": 700812,
            "end": 704153,
            "confidence": 0.7889999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wieder was gelernt. War auf jeden Fall mal ein Engineering Manager bei Uber, der für die Mobile App und da im Payment Bereich gearbeitet hat. Der hat sich irgendwann mehr oder weniger selbstständig gemacht, hat ein paar Bücher geschrieben über Mobile Development at Scale und wie man eine Bewerbung zusammentackert als Software-Ingenieur und so weiter und so fort. Also dieser Mensch hat schon einen guten Lebenslauf und er weiß schon, wovon er redet, hat ein sehr großes Netzwerk und hat auch schon in größeren Firmen gearbeitet und er macht einen Paid Newsletter in der Software-Entwicklungsindustrie, wo er wirklich das komplette Feld covert von, wie macht man eine ordentliche Migration, wie arbeitet man gut mit Produktmanagern zusammen. wie sehen nämlich die Compensations und Salary Tiers in verschiedenen Firmen in Europa oder weltweit aus und so weiter und so fort. Also er covert jetzt nicht nur die knallharten Tech-Themen, wie zum Beispiel, welche Real-Life-Herausforderungen große Firmen haben und welche theoretischen Algorithmen die da angewandt haben, sondern halt auch all das drumherum. Ich könnte fast sagen, und da lehne ich mich mal weit aus dem Fenster, Er ist so die die gute inspirationsquelle vielleicht auch für unseren podcast weil wir halt auch ab und zu mal links und rechts schauen und nicht nur diese knallharten wie entwickle ich. Algorithmus a.",
            "start": 704193,
            "end": 772115,
            "confidence": 0.7893917050691241,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und es ist diese 150 euro wert im jahr das sind ungefähr vier bücher würde ich mal sagen oder drei bis vier bücher irgendwas in der gegend.",
            "start": 772155,
            "end": 781240,
            "confidence": 0.7370740740740741,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die qualität ist schon. sehr sehr hoch.",
            "start": 781260,
            "end": 784262,
            "confidence": 0.6701428571428572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das beantwortet nicht meine Frage. Jetzt komm, rück raus. Ist es das Geld wert?",
            "start": 784823,
            "end": 788685,
            "confidence": 0.7842857142857141,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich denke das Geld ist es wert.",
            "start": 789105,
            "end": 791086,
            "confidence": 0.729125,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also du wirst den weiter beziehen?",
            "start": 791146,
            "end": 792827,
            "confidence": 0.525,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist schon mein zweites Jahr, in dem ich das abonniert habe, ja.",
            "start": 792868,
            "end": 795809,
            "confidence": 0.5496923076923077,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, ihr habt keine paid newsletter, aber ich kann es nachvollziehen, dass gute Information wirklich einen Wert hat und vor allem die richtige Information.",
            "start": 795849,
            "end": 804975,
            "confidence": 0.7794583333333335,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man muss jetzt aber auch mal ganz kurz sagen, der ist inzwischen auf Substack und Substack ist die Ich würde fast sagen inzwischen die Newsletter Plattform für Paid Newsletter, da ist er der Paid Newsletter mit den meisten Usern, die dafür zahlen.",
            "start": 805015,
            "end": 819524,
            "confidence": 0.7923095238095238,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Er hat ja auch mal geschrieben, dass er irgendwie viermal so viel verdient wie davor bei Uber und das ist dann schon eine ziemliche Menge, wenn man das als Content Creator verdient. Also das ist sicherlich schwierig, wenn man sich in die andere Seite versetzt. Ich glaube, damit richtig ein Gehalt zu bekommen, ist, glaube ich, echt schwierig, das zu machen. Also da gibt es wirklich nur vereinzelte Personen, die das schaffen. Das ist so ähnlich wie von einem Buch oder vom Bücherschreiben leben. Das schaffen auch nur ganz wenige Leute. Da haben wir übrigens eine eigene Episode dazu. Verlinken wir natürlich in den Shownotes zum Bücherschreiben.",
            "start": 819584,
            "end": 850881,
            "confidence": 0.8007196261682243,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du meinst, wie du gefailt bist, um vom Bücherschreiben zu lesen?",
            "start": 850921,
            "end": 853823,
            "confidence": 0.7911818181818181,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zu leben meinst du.",
            "start": 854964,
            "end": 856005,
            "confidence": 0.44999999999999996,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Zu leben, tut mir leid, nicht zu lesen.",
            "start": 856025,
            "end": 857726,
            "confidence": 0.611875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zu lesen habe ich schon geschafft, aber zu leben kann ich noch von Büchern noch nicht.",
            "start": 857766,
            "end": 863572,
            "confidence": 0.5708749999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es gibt aber auch andere Paid Newsletter wie zum Beispiel von Benedict Evans, ich glaube der ist Startup Analyst oder Financial Startup Analyst in der Tech Branche oder ähnliches.",
            "start": 863612,
            "end": 872641,
            "confidence": 0.7914137931034483,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sowas in der Richtung, ja. Aber ich würde sagen, das ist jetzt natürlich weniger technisch und sehr businesslastig, aber auch der hat einen free Newsletter und einen paid Newsletter. Vielleicht auch noch zur Information, der Pragmatic Engineer hat natürlich auch Teile immer wieder, die er kostenlos veröffentlicht und versendet, also er hat auch eine free Version davon, aber wenn man alle Artikel lesen will, dann braucht man eben die paid Variante. Kann man sagen, dass die Newsletter die neuen Zertifizierungen sind? Früher hat man da irgendwie 200, 300 Euro gezahlt für irgendeine Zertifizierung und jetzt bin ich aber neu und hip und lese nur mehr meine Newsletter und ich schreibe in meinen CV rein, ich lese den Pragmatic Engineer anstatt, ich habe Zertifizierung für BHB, was ist denn aktuelle Version, 8 oder so?",
            "start": 873462,
            "end": 919523,
            "confidence": 0.7806691729323307,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, ich glaube du vergleichst einfach Äpfel mit Möhren.",
            "start": 919663,
            "end": 923185,
            "confidence": 0.7384444444444446,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber wenn ich dir jetzt ein CV sende, würdest du das besser finden? Da steht drinnen, ich habe den Pragmatic Engineer abonniert und lese den oder ich habe eine PHP 8 Zertifizierung. Was würde mehr Eindruck schinden bei dir?",
            "start": 923645,
            "end": 938830,
            "confidence": 0.7786250000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich fände beides positiv. Für mich ist nicht relevant, was da steht. Für mich ist relevant, woher es kommt, beziehungsweise ob die Person es freiwillig macht. Weil Zertifizierungen werden ja auch oft vom Arbeitgeber bezahlt. Und speziell in manchen Bereichen werden die sogar als Kriterium angesehen. So nach dem Motto, okay, du musst, wenn du was anfängst, diese Zertifizierungen machen. Und dann ist es ja einfach 100 Prozent Arbeitszeit. Also das ist so ein bisschen, ab und zu werden Zertifizierung benötigt, um den Job ausführen zu können.",
            "start": 939570,
            "end": 967897,
            "confidence": 0.8127241379310343,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du eine Zertifizierung.",
            "start": 968377,
            "end": 970099,
            "confidence": 0.50075,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe eine Zertifizierung ich habe damals 2012 oder sowas eine Zertifizierung für php 5 gemacht 53 oder sowas oder was war das von send damals noch ja.",
            "start": 970119,
            "end": 981210,
            "confidence": 0.8120714285714284,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da wo die Klassen eingeführt worden sind oder war das pp4 ja sowas um den dreh. Und hat dir das dein Arbeitgeber damals bezahlt oder wolltest du da kleine Andi, ich mache jetzt die Zertifizierung im BHP 5 Cent war das damals noch oder?",
            "start": 981230,
            "end": 994339,
            "confidence": 0.7670681818181816,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war damals noch Cent.",
            "start": 994359,
            "end": 996001,
            "confidence": 0.8428000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die haben angefangen glaube ich mit den BHP Zertifizierungen damals.",
            "start": 996021,
            "end": 999423,
            "confidence": 0.7242,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, ich habe es angestoßen, ich habe mich um die Informationseinholung gekümmert und habe dann vorgestreckt und dann die Rechnung eingereicht von, ich glaube die Prüfung hat damals 200 Euro oder so gekostet.",
            "start": 999463,
            "end": 1010189,
            "confidence": 0.8060909090909091,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "War sie schwer?",
            "start": 1010230,
            "end": 1010670,
            "confidence": 0.8093333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe sie beim ersten Mal bestanden, aber ohne vorher Lernen hätte ich sie so nicht geschafft.",
            "start": 1011110,
            "end": 1018392,
            "confidence": 0.8262941176470585,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und war es das Geld wert, so im Nachhinein gesehen? Hat es dir irgendwann mal was gebracht? Weiß man natürlich nicht jetzt auf CVs, aber so irgendwie konkret? Oder würdest du es wieder machen grundsätzlich?",
            "start": 1018432,
            "end": 1029516,
            "confidence": 0.7740857142857145,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, ich würde so aus freien Stücken keine Zertifizierung mehr für Programmiersprachen machen.",
            "start": 1029816,
            "end": 1037018,
            "confidence": 0.8909285714285712,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Warum?",
            "start": 1037538,
            "end": 1037998,
            "confidence": 0.861,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde Zertifizierungen machen, des Spaßes halber, um meinem Wissen gegenzutesten.",
            "start": 1038038,
            "end": 1043681,
            "confidence": 0.8447272727272727,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und warum würdest du jetzt keine mehr in der Software-Ecke machen?",
            "start": 1043701,
            "end": 1046622,
            "confidence": 0.6560000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ne, in der Software-Ecke schon, ja. Also im Cloud-Bereich, Linux-Bereich und Co. würde ich das schon machen.",
            "start": 1047281,
            "end": 1051504,
            "confidence": 0.6265882352941176,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Keine Programmiersprache?",
            "start": 1051524,
            "end": 1052505,
            "confidence": 0.737,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, weil ich denke, dass Programmiersprachen sich im heutigen Zeitalter viel zu schnell weiterentwickeln, als dass die Zertifizierung noch relevant wäre. Wenn ich jetzt eine LPI, eine Linux-Zertifizierung machen würde, das Networking und Co., also ich gehe mal stark davon aus, klar gibt es dann immer wieder neue Sachen, eWPF und Co., aber die, ich würde mal sagen, 70, 80 Prozent des Netzwerkkontents bei Linux-Zertifizierung oder System D oder Ähnliches bleibt relevant. Und deswegen würde ich die dann halt des Lernens wegen machen.",
            "start": 1053307,
            "end": 1082783,
            "confidence": 0.7841325301204818,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie stellst du denn als Hiring-Manager fest, ob eine Zertifizierung gut ist und Sinn macht? Weil wenn da jetzt irgendwie steht Java-Zertifizierung, wie stellst du denn das fest, ob das Sinn macht?",
            "start": 1083503,
            "end": 1096317,
            "confidence": 0.7420625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Super gute Frage. Das ist so mein Killer-Learning von Zertifizierung. Deswegen habe ich immer so ein ganz großes Fragezeichen bei Zertifizierungen. Prinzipiell ist es bei Zertifizierungen so, jeder kann eine Zertifizierung ausstellen. Ich könnte also dir Wolfgang eine Zertifizierung als zertifizierter Podcast Host ausstellen und sie wäre gültig. Oder das Engineering Kiosk. könnte Zertifizierung an unsere Hörerinnen und Hörer ausstellen. Zurück zu deiner Frage, was macht dann also eine Zertifizierung relevant? Eigentlich nur der Aussteller der Zertifizierung selbst. Beispiel, wenn du jetzt mir eine Zertifizierung über Java ausstellst, dann wird die mit hoher Wahrscheinlichkeit toll auf meinem Lebenslauf aussehen, aber sie hat halt null Relevanz, weil keiner weiß, wie gut sich Wolfgang Gassler mit Java auskennt. Wird diese jedoch von Oracle ausgestellt, Ist das äußerliche Ansehen dieses Zertifikats deutlich höher, weil jeder denkt, oh Oracle, die machen ja Java, die schreiben ja Java, die entwickeln ja Java, also muss das höher sein. Ein Garant für Qualität des Contents der Prüfung ist es jedoch nicht. Das bedeutet eigentlich nur der Zertifikatsaussteller, der Name und sehr wahrscheinlich dann auch die Relation zu dem geprüften Produkt, möchte ich mal sagen. Sei es Oracle MySQL, sei es Google für irgendeine Cloud-Geschichte oder Amazon oder Azure oder VMware für ESXi oder was weiß ich nicht.",
            "start": 1096357,
            "end": 1182446,
            "confidence": 0.8384476190476191,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oder der ECDL.",
            "start": 1182486,
            "end": 1183447,
            "confidence": 0.8776666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Der was?",
            "start": 1184347,
            "end": 1185188,
            "confidence": 0.935,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der EZTL, dieser Computerführerschein. Hast du den nie in CVs drin stehen gehabt? Das hat mir immer nur ein Lächeln abgeluchst, aber das war schon fast immer ein Red Flag, wenn jemand einen EZTL-Führerschein auflistet. Das ist, glaube ich, dieser europäische Computerführerschein.",
            "start": 1185228,
            "end": 1200667,
            "confidence": 0.7465714285714286,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, kenn ich leider nicht, tut mir leid.",
            "start": 1200867,
            "end": 1203249,
            "confidence": 0.3105,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ihr habt ganz interessanterweise jetzt mal gehört, im Coaching-Bereich gibt es ja auch keine offizielle Ausbildung oder sowas in der Richtung und jeder kann sich Coach schimpfen. Und eine Empfehlung, was ich mal gehört habe, ist einfach zu checken, was derjenige für ein Coach-Siegel, Coach-Ausbildung hat und einfach nach zu schauen, wie lange dauert denn diese Coach-Ausbildung und anhand der Länge kann man dann ein bisschen einschätzen, wie viel die Person dann irgendwie Wissen hat im Coaching, im ganzen Psychologie-Bereich, der vielleicht da auch mitspielt. Keine Ahnung, ob man das jetzt wirklich auf IT umlegen kann, aber man kann sich zumindest ansehen, was hinter so einem Gütesiegel steckt, wenn man das schon unbedingt will, wobei ich sehe das auch eigentlich immer so im europäischen Raum sind eigentlich andere Kriterien viel wichtiger. Im amerikanischen Raum ist das was anderes, da wird ja sehr stark auf diese Zertifizierungen gesetzt, aber im europäischen Raum habe ich da jetzt eigentlich bisher, bis auf manche Branchen natürlich, wo das vielleicht ganz stark gelebt wird, eigentlich weniger gesehen in dem Bereich.",
            "start": 1203309,
            "end": 1258034,
            "confidence": 0.8034034090909091,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, du redest ja halt jetzt schon so ein bisschen mit einem negativen Touch über Zertifizierung. Meines Erachtens nach ist es nicht alles schwarz und weiß, denn Zertifizierungen selbst haben auch schon einen Vorteil, sofern der Content denn auch einigermaßen relevant ist. Die ist schon die Prüfung des eigenen Wissens und je nach herausgeber und content sagt das auch schon etwas über das verständnis der jeweiligen technologie aus nehmen wir mal so diese klassischen cloud zertifizierung wie von amazon oder ähnliches da gibt es ja ein richtiges zertifizierungspfad wo du erst mit associate oder ähnliches startest und dann dich später sogar wie in so einem baum in fachrichtung entwickelts fachrichtung netzwerk fachrichtung container oder ähnliches also bei sowas da werden die zertifizierung schon um so weiter durch den pfad nach oben gehst schon schwieriger also das sagt dann schon noch.",
            "start": 1258354,
            "end": 1311413,
            "confidence": 0.7994285714285708,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was aus ja ich sehe das halt so ähnlich wie mit keine ahnung universitäts titeln die sagen natürlich schon was gewisses aus aber sind natürlich auch immer irgendwo limitiert und begrenzt aber du kannst natürlich eine gewisse gewisse aussage treffen anhand dieser.",
            "start": 1311513,
            "end": 1327465,
            "confidence": 0.8032380952380952,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Titel Also bei dem abgefragten Content, auch das, was du so kritisierst, ich denke, da kommt es immer ganz drauf an, wie wird das denn später eingesetzt? Während der Zertifizierung selbst ist es natürlich so, dass fast schon das ganze Spektrum abgefragt wird. Das bedeutet also auch Themenbereiche, die man für sich gegebenenfalls im täglichen Doing so gar nicht braucht. Zum Beispiel bei einer PHP-Zertifizierung damals hatte ich super viele Fragen im Bereich Sockets und Streams und so weiter.",
            "start": 1327485,
            "end": 1352831,
            "confidence": 0.8076582278481013,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber das hast du ja in dem Studium genauso. Du lernst in dem Studium auch ganz viele Sachen, die du vielleicht gar nicht brauchen kannst. Trotzdem schauen natürlich Leute, wenn du da einen Mastertitel stehen hast oder einen Doktortitel, glauben die immer, dass du sehr wissend bist. Also ich glaube, wie gesagt, du kannst schon gewisse Aussagen treffen. Aber ich würde nicht zu viel auf diese Sachen setzen, ist meine Meinung. Wir haben übrigens zu dem ganzen Universitätsthema, ob das sinnvoll ist, ein Informatikstudium zu machen oder die Ausbildung, haben wir eine eigene Episode gemacht, Episode 30, wer sich dafür näher interessiert. Aber ganz allgemein würde ich sagen, es schadet natürlich nicht der Zertifizierungen, aber ob sie es geldwert sind, würde ich ganz stark bezweifeln. Also ich kenne auch wenig Leute, die irgendwie gesagt haben, ich habe extrem viel gelernt im Rahmen dieser Zertifizierungen.",
            "start": 1353691,
            "end": 1397797,
            "confidence": 0.7942430555555557,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn man uns jetzt so zuhört, dann könnte man denken, Zertifizierungen sind sinnlos, man sollte sie nicht machen. Das ist nicht der Fall. Es gibt Bereiche, da sind Zertifizierungen wirklich sinnvoll und die können dich dann auch weiterbringen. Speziell in der Jobsuche, in den Bewerbungen, machen sie hier und da schon mal was aus. Besonders wenn man jetzt irgendwie einen Spezialisten für Amazon sucht und ihr seid dann jetzt die Zertifizierungsleiter von Amazon hochgeklettert, dann würde ich schon sagen, ihr qualifiziert euch eher als jemand, der gar kein Amazon-Knowledge im Lebenslauf vorweisen kann. Zumindest bis zum ersten Interview, bis zur ersten Einladung. Dann gibt es natürlich noch den ganzen Consulting- und Agenturbereich. Besonders im Consulting- und Agenturbereich ist es oft so, wenn man zum Beispiel Behörden als Auftraggeber hat, dann ist meist ein Requirement für die ganzen Projekte, dass mindestens fünf Personen, die im Projekt mitarbeiten, eine Zertifizierung in diesem Bereich haben müssen. Also da kann sowas natürlich dann auch von Vorteil sein.",
            "start": 1398097,
            "end": 1456864,
            "confidence": 0.8486932515337419,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber da geht es dann wirklich um ISO-Zertifizierungen und solche Sachen. Da geht es nicht mehr um BHP-5-Zertifizierung.",
            "start": 1456924,
            "end": 1461747,
            "confidence": 0.7841111111111111,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, da geht es teilweise auch um mindestens dieses Netzwerkexperten-Zertifizierung auf Amazon oder sowas. Gibt es auch. Habe ich auch schon gesehen. Ich sehe, dass man das ganze Spektrum als Zertifizierungscontent abfeiern muss, so als Vorteil und als Nachteil. Als Vorteil ist, man sieht einfach mal links und rechts die Möglichkeiten. Als Nachteil, man muss es lernen, obwohl man es eigentlich gar nicht braucht. Und ab und zu geht es ja sogar so weit, dass man Antworten anklicken muss, damit man Punkte für diese Frage kriegt, obwohl man weiß, die Antwort würde man so in der Praxis gar nicht machen. Also die Antworten sind dann nicht falsch, aber sie würde man so in der Praxis einfach nicht umsetzen. Hatte ich dann hier auch schon hier und da mal. Und ob die Zertifizierungen jetzt immer eine Geldverschwendung sind, schwierige Frage. Ich denke, Zertifizierung, die ganze Masche drumherum, ist eine Gelddruckmaschine. Aber das sind dann meist nicht die Zertifizierungen selber, beziehungsweise nicht die Prüfungen, weil die Prüfungen werden in der Regel immer so bei vielen Anwendern irgendwie so 100 bis 400 Euro kosten. Dann würde ich sagen, okay, das ist noch ein überschaubarer Betrag. Womit aber richtig, richtig, richtig Asche verdient wird, ist der ganze Kram davor. Man verkauft Workshops und Zertifizierungskurse und die gehen dann mal ganz, ganz schnell in die vierstellige Zahl, 1.000 bis 5.000 Euro. Was natürlich dann ganz oft auch durch ein klassisches Buch abgefeiert werden kann oder durch einen Udemy-Kurs oder ähnliches.",
            "start": 1462067,
            "end": 1542296,
            "confidence": 0.8020204081632659,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weil du gerade Udemy, die sagst, die ganze Online-Universitätsgeschichte oder MOOCs, M-O-O-C, die Mass Open Online Courses, wie man sie auch nennt, sind ja auch ziemlich steil gegangen, liest man auch immerhin mehr CVs, dass Leute wirklich sagen, ihr habt diesen Stanford-Kurs online gemacht oder Udacity-Kurs. Wie stehst du zu dem Ganzen?",
            "start": 1542316,
            "end": 1564162,
            "confidence": 0.7686730769230767,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Positiv und negativ, ich denke da auf diesen ganzen Plattformen ist viel Müll, aber ich glaube auch da ist sehr sehr viel wertvoller Content, weil speziell umso größer die Plattformen, nehmen wir mal Udemy oder Coursera, die haben natürlich exklusive Partnerschaften unter anderem mit Stanford, mit Harvard, mit Google, wo Google dann exklusiv auch hochqualitativen Content für zum Beispiel eine Cloud-Zertifizierung für Google Cloud Plattform auch published. Und sie empfehlen das auch als Vorbereitung für solche Zertifizierungen. Also es kommt da immer ganz drauf an, wer bietet den Kurs an und so weiter. Also eigentlich ähnlich wie bei der Zertifizierung. Wer gibt das heraus und was für einen Qualitätsanspruch haben die Kursautoren? Weil ich habe nämlich auch schon mal einen Kurs bei Coursera, glaube ich, gemacht über Flutter. Den habe ich mir selbst gekauft, war dann irgendwie im Sale, habe ich 20 Dollar für gezahlt. Und jetzt kriege ich immer noch E-Mails von dem Kursautor. Und dieser Kursautor, der macht irgendwie alles. Der macht irgendwie Flutter, also Mobile-Entwicklung mit Dart. Dann macht er irgendwie jedes JavaScript-Framework. Und dann macht er alles mit CSS noch. Und dann macht er jetzt auch noch Git. Also, verstehst du, dem sein Scope ist halt so dermaßen groß. Und irgendwann muss ich dann sagen, das verliert so ein bisschen an meiner Glaubwürdigkeit, dass ich ihn als Experte für irgendwas ansehe, umso mehr man da macht. Weil es ist natürlich auch ein gutes Business für manche Content-Creator.",
            "start": 1564862,
            "end": 1641515,
            "confidence": 0.8095933609958504,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das sehe ich jetzt wieder anders, weil an der Uni unterrichten auch irgendwelche Datenbankspezialisten Einführung in die Informatik eins oder irgendwie C-Programmierung oder sonst irgendwas Allgemeines, was überhaupt nicht ihr Spezialbereich ist oder gibt oder sonst irgendwas. Also ich glaube, das ist ja durchaus ein breites Feld. Und wenn deine Spezialität ist, wie du Content gut aufbereitest und wie du Sachen vermitteln kannst, dann kannst du das auch sicher in mehr Programmiersprachen machen. Also warum solltest du dich da begrenzen, weil die Schwierigkeit ist ja nicht, das letzte Skalierungsdetail von dieser Sprache oder so zu vermitteln, sondern meistens Basics. Und da ist eigentlich der Wert, dass du das gut vermitteln kannst und solche Kurse aufbauen kannst und weniger die wirklich hardcore technischen Details, die du für irgendeinen Senior-Entwickler brauchst, der da seit zehn Jahren Rust programmiert, falls es zehn Jahre Rust überhaupt schon gibt.",
            "start": 1642304,
            "end": 1695045,
            "confidence": 0.7922551724137935,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ah ja und nein, aber ich hab ja auch nicht gesagt, dass an der Uni alles Richtiges läuft. Also von daher, sind wir da vielleicht auf einer Ebene.",
            "start": 1695625,
            "end": 1703268,
            "confidence": 0.6595000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei du mich da jetzt persönlich angreifst, weil ich habe auch schon Einführungskurse gemacht, obwohl das nicht mein Spezialbereich war. Aber egal. Was ich noch hinweisen möchte, weil auch ganz viele Leute immer bei den mit zu bezahlten kostenpflichtigen Kursen kommen. Es gibt auch ganz viele Plattformen, die das kostenlos zur Verfügung stellen, auch Unis selber. Es gibt ganz viele Stanford-Kurse online, die wirklich super gut sind und viel abdecken, die man kostenlos machen kann. Nur wenn man dann am Schluss einen Schein will, eine Prüfung, dann muss man meistens zahlen oder muss sich sogar inskribieren. Aber man bekommt den ganzen Content oder einen Großteil dieses Contents for free. Auch edX ist meines Wissens komplett kostenlos. Ich habe gerade heute zufällig gesehen, Hasso Plattner Institut hat auch Online-Kurs. Also es gibt wirklich viele Quellen, wenn man da ein bisschen sucht und es gibt wirklich guten Content, der kostenlos auch ist, neben den ganzen YouTube-Videos natürlich. Aber es muss nicht immer kostenpflichtig sein. Also da gleich mal vorweg, wenn man ein bisschen sucht, findet man auch wirklich sehr guten Content. kostenlos ist, wo man dann nicht immer mit dem Lead diskutieren muss, ob man jetzt diese 20 Euro pro Monat noch irgendwie investieren darf. Aber da kommen wir eh später noch dazu.",
            "start": 1703308,
            "end": 1773457,
            "confidence": 0.8032890995260663,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber kommen wir nun mal zu dem Elefanten im Raum, den jeder kennt, Konferenzen. Wolfgang, jetzt kommen wir aus einer zwei Jahre Pandemie, wo fast jede Konferenz abgesagt wurde. Bei wie vielen Remote-Konferenzen warst du ein Teilnehmer?",
            "start": 1774062,
            "end": 1786093,
            "confidence": 0.809783783783784,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich war wahrscheinlich öfters ein registrierter Teilnehmer, aber ein teilnehmender Teilnehmer war ich dann wesentlich seltener. Ich schätze mal zwei, dreimal oder so.",
            "start": 1786133,
            "end": 1794761,
            "confidence": 0.6668260869565218,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Woran lag es?",
            "start": 1794781,
            "end": 1795261,
            "confidence": 0.5096666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich ziehe ja den größten Wert aus Konferenzen immer aus dem ganzen Networking und aus dem Abschalten, dass man irgendwo anders ist und dass man sich wirklich mal mit anderen Themen befassen kann. Und dieses Mindset schaffe ich einfach nicht online. Und da lenken zu viele Sachen ab. Man kann einen anderen Tab öffnen, man kann E-Mail beantworten, man ist in der aktuellen Arbeit drin. Und das war immer mein größtes Problem mit Online-Konferenzen und auch dieses Networking. Haben zwar manche Konferenzen wirklich probiert, möglichst einfach zu gestalten, auch so mit virtuellen Charakteren, wo du irgendwie rumlaufen kannst in der virtuellen Welt und zwischen Tischen und solche Dinge. Aber es hat nie bei mir denselben Mehrwert gebracht als eine echte Konferenz. Und darum war ich dann eigentlich immer ziemlich vorsichtig mit Konferenzen, die nur online stattfinden, weil im Endeffekt kann ich mir das YouTube-Video auch mal irgendwie später durchklicken und anschauen, wenn es wirklich nur das wäre.",
            "start": 1796322,
            "end": 1853473,
            "confidence": 0.8226012658227848,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also mir geht es genauso. Auch wenn ich versuche, mich darauf zu konzentrieren, zu Hause ist es immer einfacher, noch was anderes nebenbei zu machen. Und das ist für mich genau das gleiche, als wenn das jetzt zum Beispiel Remote Meetup ist. Gab's ja auch in der Corona-Pandemie ganz viel. Man hat sich abends irgendwie nochmal vom Computer gesetzt, obwohl ich schon acht Stunden davor saß, hab mich trotzdem irgendwo eingeloggt. Und auch das, was du gerade gesagt hast, da kann ich mir den Talk später auf YouTube nochmal durchklicken. Ganz im Ernst, ich mach's ja doch nicht. Ja, also dann läuft der zwar da auf einem Bildschirm, Aber ich fokussiere mich da drauf nicht. Was ich mal gehört habe, ist, dass manche Leute wirklich dann mit den ganzen Smart-TVs auf YouTube sich ins Wohnzimmer setzen und dann so ein Talk anmachen. Habe ich auch mal versucht. Funktioniert für mich irgendwie auch nicht. Ich weiß nicht. Also entweder muss der Speaker halt unglaublich gut sein und dann wirklich die Audienz wirklich in einen Bann ziehen. Aber so auf der Couch sitzen, ich weiß nicht, da vielleicht erwarte ich dann auch ein bisschen was anderes, dass ich dann den Kopf ein bisschen mehr ausschalten kann oder so.",
            "start": 1853513,
            "end": 1907356,
            "confidence": 0.7666019417475726,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt um die Online-Konferenz ein bisschen zu verteidigen, dasselbe passiert aber auch bei Konferenzen selbst. Ich sitze da im Publikum, das ist irgendwie ein fader Vortrag oder ein schlechter Presenter und dann trifft die genauso ab und denke über Sachen nach oder im schlimmsten Fall sogar spiele irgendwas am Handy. Also nicht spielen im Sinne von Gaming, sondern lies irgendwas durch oder beantworte Messages. Also das Handy, ich probiere das Handy da auch immer möglichst rauszuhalten bei Konferenzen. Weil wenn ich dann abdrifte in so einem Vortrag, dann habe ich wenigstens doch eine halbe Stunde oder 20 Minuten Zeit, um über andere Dinge nachzudenken, vielleicht im Vortrag davor oder irgendwelche anderen Sachen, die ich connecte, weil ich in einem anderen Konferenzmindset bin. Und das habe ich dann wahrscheinlich im Wohnzimmer vor meinem Fernseher eher nicht, weil da kann ich halt einfach eben schnell aufs Handy schauen oder irgendwo kurz rausgehen, einen Kaffee holen und dann bin ich schon wieder draußen. Also da gibt es viel mehr Ablenkungsmöglichkeiten, vermute ich mal zumindest. Also ich habe es noch nie probiert, aber ich persönlich schätze es immer einfach irgendwo anders zu sein, wenn man da ungestört ist und wirklich sich darauf fokussieren muss. Auch mit so Offsite-Meetings, die sind einfach ganz anders, als wenn man sich im Office trifft. weil man einfach ungestört ist und einfach mal über andere Sachen nachdenken kann.",
            "start": 1907705,
            "end": 1984104,
            "confidence": 0.7899912663755456,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin auch der Meinung, dass das Rauskommen aus der gewohnten Umgebung einer der Key-Punkte ist, der Key-Sachen, die ich wirklich am positivsten finde. Was man dann natürlich nebenbei noch hat, ist dann auf der einen Seite, wenn ziemlich viele Leute in einer Stadt sind, dass sich oft Events davor und nach der Konferenz bilden, entweder andere Konferenzen oder man kann Leute auf Twitter anschreiben, hey, habt ihr Lust mal auf einen Kaffee oder abends auf ein Bier oder vielleicht geht man sogar zusammen essen.",
            "start": 1984305,
            "end": 2009015,
            "confidence": 0.8117647058823529,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also das, was wir dann bei der FOSDEM auch gemeinsam machen mit unserer Hörerschaft, oder? Dass wir gemeinsam essen oder was trinken gehen. Vierter, fünfter Februar, wer noch Lust hat übrigens, einfach auf engineeringkiosk.dev slash FOSDEM 2023 gehen. Dort kann man sich dementsprechend anmelden oder einfach in den Shownotes ist der Link auch verfügbar.",
            "start": 2009315,
            "end": 2030210,
            "confidence": 0.8563148148148146,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So ergeben sich auf jeden Fall immer mal wieder neue Connections. Und die nutze ich auch. Also ich tweete Leute vor Konferenzen immer an. Hey, bist du zufällig auf dieser und dieser Konferenz? Hey, ja, super. Ich würde dir gerne einen Kaffee ausgeben. Oder hast du Lust auch so ein Bier zu trinken oder ähnliches?",
            "start": 2030430,
            "end": 2045315,
            "confidence": 0.6935636363636364,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, es ist super. Also wir haben jetzt bisher erwähnt, das Tollste an Konferenzen ist, dass man nachdenken kann, dass man woanders ist, dass man irgendwelche Events rundherum macht, dass man Leute trifft. Inhalt ist komplett egal, oder? Bei einer Konferenz oder wie seht es?",
            "start": 2045895,
            "end": 2059860,
            "confidence": 0.7871111111111111,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja ich glaube da kommt es immer ganz noch an, was für eine Konferenz man ist. Also ich denke schon, dass es ziemlich viele Vorträge gibt, die mit dem Titel mehr versprechen als sie wirklich im Content abliefern und dann ist man natürlich enttäuscht und dann bezieht man eine Konferenz irgendwie auf alle Konferenzen und dann geht man da gar nicht mehr hin. habe ich auch schon kennengelernt. Meines Erachtens nach kehrt man da zu viel über einen Kamm und generalisiert das, denn es gibt auch sehr, sehr viele richtig gute Konferenzen und bei guten Vorträgen kann man auch den Inhalt des Vortrages nehmen. um einfach mal seinen eigenen technischen Stand zu validieren. Ja, also sind wir noch relevant? Beschäftigen wir uns mit der richtigen Technologie? Ist das die richtige Vorgehensweise? Und was haben andere Leute bereits mit dem Einsatz aus den Learnings gezogen? Und kann ich dadurch vielleicht einen eigenen Vorteil für das aktuell laufende Projekt sehen? Also das mache ich immer, immer wenn ich mir so eine Migration irgendwie ansehe, wo Leute zum Beispiel Datenbanktechnologien in Produktion gewechselt haben. Irgendwie weiß ich nicht, von MySQL auf Postgre. Dann ist es ja immer so, dass du heutzutage im Internet kein Wartungsfenster mehr schalten kannst und dann da hinten einen Damm ziehen kannst und einen Import und dann geht es einfach weiter, sondern dass du irgendwie so eine Migration on the fly machen musst. Und dann geht es halt schon wirklich um die Strategien, wie machst du das on the fly, irgendwie zweifache Writes, Reads, blablabla. Da gibt es natürlich schon bewährte Patterns, aber sowas schaue ich mir dann immer zum Beispiel gerne an, um einfach zu checken, okay, ist die Variante, die ich jetzt gewählt habe in meinem letzten Migrationsprojekt immer noch state of the art oder geht das vielleicht auch schneller? Und das ist natürlich dann immer recht schön, was du ganz bei guten Vorträgen heraussehen kannst. Und deswegen denke ich, dass man schlechten Vorträge halt nicht auf, nicht generalisieren sollte und da gar nicht mit zu Konferenzen gehen sollte.",
            "start": 2060639,
            "end": 2154943,
            "confidence": 0.7885497076023389,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt muss ich da wieder zurückkommen zum sozialen Aspekt. Diese Dinge kann man natürlich bei den ganzen sozialen Meetings auch mitbekommen, weil man einfach ins Gespräch kommt und dann vielleicht mal Fragen stellen kann. Wie macht ihr das? Wie habt ihr diese Migration gelöst? Also auch da kann man abseits der Vorträge extrem viel mitnehmen, wenn man einfach kommuniziert. Aber das muss man natürlich auch lernen in einer gewissen Weise und vielleicht auch aktiv betreiben. Ist auch nicht die Sache von jedermann, jeder Frau, würde ich sagen. Ich bin da auch nicht der Beste, muss ich zugeben, aber da kann man extrem viel rausziehen, wenn man da probiert, einfach Connections zu nutzen, neue Connections zu machen, Leute kennenlernen. Also das sollte man die Konferenzen auch wirklich aktiv nutzen. Hast du eigentlich irgendwelche Lieblingskonferenzen, wo du immer hingehst, abgesehen von der FOSDEM, wo wir ja immer alle jedes Jahr hingehen im Februar? zusammen mit 7.000 anderen Open Source Entwicklern oder Open Source Fans.",
            "start": 2155535,
            "end": 2210081,
            "confidence": 0.8211481481481481,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Die FOSDEM ist wirklich eine der Konferenzen, wo ich fast jedes Jahr hingehe und sonst unterscheiden sich die Konferenzen immer. Es gibt ein paar, die ich sehr, sehr gut finde. Es gibt ein paar, die waren früher sehr gut, haben ein bisschen ihren Flair verloren. Es gibt ein paar, die waren früher sehr gut und gibt es gar nicht mehr. Da bin ich ein großer Fan zum Beispiel von Barcamps und Unkonferenzen. Die sind alle ein bisschen unorganisierter.",
            "start": 2210101,
            "end": 2230533,
            "confidence": 0.7312435897435898,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber der Hype ist irgendwie vorbei von denen, oder? Mir kommt vor, es werden irgendwie wieder weniger Barcamps und Unkonferenzen. Oder ist das nur wegen Corona jetzt? Aber irgendwie hat der Trend so ein bisschen abgenommen, ist mir vorkommen, und es gibt wieder eher klassische Konferenzen. Oder ist das nur meine persönliche Bubble?",
            "start": 2230573,
            "end": 2245558,
            "confidence": 0.7191509433962264,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, das ist deine persönliche Bubble. Ich denke, es gibt immer noch sehr, sehr viele Barcamps und Unkonferenzen, aber die haben natürlich nicht das gleiche Marketing wie die großen Konferenzen.",
            "start": 2245978,
            "end": 2253801,
            "confidence": 0.7477741935483871,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie eine ews reinvent zum beispiel.",
            "start": 2254606,
            "end": 2257487,
            "confidence": 0.6655,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Zum beispiel wie eine ews reinvent aber da könnte man argumentieren das ist ja eher schon eine sales konferenz als eine technik konferenz aber dennoch.",
            "start": 2257527,
            "end": 2265548,
            "confidence": 0.7614800000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und trotzdem muss man 2000 euro zahlen damit man sich die sales vorträge anhören darf.",
            "start": 2265588,
            "end": 2270069,
            "confidence": 0.7914666666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder du hast einfach ein millionen commitment bei amazon dann kriegst du auch ein paar tickets als firma umsonst von daher genau so läuft bei google auch ja also schaut.",
            "start": 2270109,
            "end": 2277091,
            "confidence": 0.697,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber auch nur limitierte.",
            "start": 2277131,
            "end": 2278411,
            "confidence": 0.89875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Och ja aber schon so 10 15 kriegt man da auch schon so ist das das ist kein problem.",
            "start": 2278591,
            "end": 2282272,
            "confidence": 0.6410526315789472,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du warst ja auf der AWS ReInvention ein paar mal, ich noch nie. Ihr habt zumindest von Leuten gehört, dass es schon auch gute Vorträge dort gibt. Was war dein Eindruck so? Jetzt abgesehen von dem ganzen Las Vegas Casinos, wo du den ganzen Tag abgehängt bist, also wenn du auch mal bei Vorträgen warst.",
            "start": 2282880,
            "end": 2298269,
            "confidence": 0.8016363636363639,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde jedem empfehlen, mal, der die Möglichkeit hat, auf die AWS ReInvent nach Las Vegas zu fliegen, hinzufahren nicht wegen las vegas sondern weil die konferenz auch sehr sehr gut ist die planung ist unglaublich die das technische level ist teilweise sehr sehr hoch da gibt es nämlich so tracks die sind so experten tracks und solche geschichten und man hat auf direkten zugriff dann wirklich auf engineers die ec2 oder dynamo db entwickeln also ist schon eine sehr sehr sehr gute konferenz gibt es natürlich auch ziemlich viel sales drumherum und blabli blub Und dasselbe ist auch gültig für die Google I.O. oder hier für die GCP-Konferenz von Google. Ich war noch nicht auf der Azure, aber kann ich wirklich empfehlen auf diese Mega-Events. Muss ich zugeben, ist nicht für jeden was, weil da laufen halt weit mehr als 8000 Leute rum. Ist aber auf jeden Fall mal eine Erfahrung wert.",
            "start": 2298289,
            "end": 2345573,
            "confidence": 0.8233790849673206,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich war mal auf der Google Cloud Next. Das ist die kleine Schwester von der Google IEO in London und war sehr enttäuscht, muss ich ehrlich zugeben. Die Talks waren nicht gut. Es war eigentlich eine reine Sales-Veranstaltung, mehr oder weniger. Also war ich damals sehr enttäuscht. Vielleicht ist sie schon besser geworden, aber kann ich eigentlich nicht empfehlen, das Ganze. Also man muss es, glaube ich, wirklich ausprobieren. Und das kann sich auch von einem Jahr auf das andere ändern, dass mal eine Konferenz ein schlechtes Jahr hat oder schlechtere Speaker. Ich glaube, man darf sich da nicht beirren lassen. Und man kann ja trotzdem eben das ganze Netzwerken und die ganzen zusätzlichen Kanäle nützen von der Konferenz. Das funktioniert immer, auch wenn mal der eine oder andere Talk nicht so gut sein sollte. Aber gibt es deiner Meinung nach auch irgendwie Gründe, dass man sagt, man sollte eigentlich nicht auf Konferenzen fahren? Oder ist Konferenz immer ein guter Punkt?",
            "start": 2345613,
            "end": 2396746,
            "confidence": 0.8020496894409943,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist auf jeden Fall mal ein Evergreen.",
            "start": 2396846,
            "end": 2398307,
            "confidence": 0.36262500000000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich sehe jetzt auch keine besonderen Nachteile, außer die finanziellen vielleicht, aber da kommen wir später nochmal drauf zu sprechen.",
            "start": 2398867,
            "end": 2404890,
            "confidence": 0.7204761904761904,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube man sollte ein bisschen selektiv sein, wohin man fährt, weil es gibt einfach sehr sehr viele Konferenzen, weil sehr sehr viele Organisatoren das natürlich als Gelddruckmaschine sehen, deswegen sollte man ein bisschen selektiv sein, zu welchen Konferenzen fährt man, welchen Value würde man denn da mitnehmen und Ist die Talk-Richtung jetzt genau schon das Thema, wo ich Experte drin bin, oder möchte ich mich dahin entwickeln? Weil, wenn man bereits Experte in JavaScript ist, dann weiß ich jetzt nicht, ob man zu den JavaScript Days fahren sollte und hofft, dass man auch noch sehr viel Neues lernt. Sondern eher dann vielleicht zu einer Konferenz, wo man sich hinentwickeln möchte. Beispiel, wenn man jetzt zum Beispiel als Engineering Manager einsteigen möchte oder als Individual Contributor auf das Dev-Level aufsteigen möchte, da kann man zum Beispiel die Lead Dev Konferenz in London wählen oder in Berlin oder die Lead Dev Engineering Konferenz. Das sind dann eher Konferenzen, wo man unglaublich vielen neuen Input kriegt, weil man sich ja dann zu dem nächsten Level, sag ich mal, entwickeln möchte, anstatt in dem Bereich, wo du bereits Experte bist.",
            "start": 2405230,
            "end": 2462790,
            "confidence": 0.7819946524064176,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie stehst du zum kleinen Bruder von Konferenzen, den Meetups? Du bist sowieso gebiased als Organisator von dem fast das größte deutsche Meetup, das seit Monaten oder seit Jahren nicht mehr stattgefunden hat, dem Webdeveloper Düsseldorf. Können wir noch immer reinreiben an die? In die Wunde, ein bisschen Salz. Aber was hältst du allgemein von Meetups?",
            "start": 2462810,
            "end": 2484750,
            "confidence": 0.7336785714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Meetups finde ich wichtig. Ist nicht zu vergleichen mit Konferenzen. Ist ein ganz anderer Style. Ich würde ihn auch nicht als kleine Bruder von Konferenzen bezeichnen.",
            "start": 2484790,
            "end": 2492153,
            "confidence": 0.8043846153846153,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist in der Regel... Kleine Schwester?",
            "start": 2492193,
            "end": 2495755,
            "confidence": 0.8351666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch das nicht. Ist in der Regel deutlich günstiger, wenn nicht sogar gratis. Ist natürlich lokal und auch wenig Commitment.",
            "start": 2495795,
            "end": 2502798,
            "confidence": 0.80435,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gratis aber nicht umsonst, ist ganz wichtig.",
            "start": 2503618,
            "end": 2506400,
            "confidence": 0.8612857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Richtig, aber es ist halt auch ein kleines Investment, man fährt halt abends mal eine Stunde irgendwo hin. Was man aber zugutehalten muss, ist, dass auf vielen Meetups Konferenztalks, die dann später auf diesen sehr teuren, bezahlbaren Konferenzen gehalten werden, geübt werden. Also sehr sehr oft war zum Beispiel das Web Engineering Düsseldorf Meetup, die plattform wo gute speaker ihren talk gehalten haben um ihn zu validieren also die qualität ist da in der regel nicht schlechter ganz und gar nicht.",
            "start": 2506420,
            "end": 2533917,
            "confidence": 0.7901604938271604,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich bin eigentlich auch ein sehr großer fan von meetups kleines zeitinvestment ist relativ kurz ganz oft gibt's gratis essen. Und gratis Getränke. Man trifft sehr coole Leute, kann nachfragen. Man braucht das nicht abklären mit der Chefin, dass man irgendwie die Zeit bekommt. Man kann einfach am Abend vorbeischauen, kann das selbst entscheiden. Ich bin auch ein bisschen im Meetup müde geworden in letzter Zeit, vielleicht auch durch Corona, aber eigentlich finde ich das eine super Möglichkeit, die total niederschwellig ist und wo man einfach mal hinschauen kann. Leute treffen kann. Auch wie ich da sehr viel unterwegs war, herumgereist bin, habe ich mal probiert, einfach englische Meetups zu finden, in Polen zum Beispiel oder anderen Ländern. Und das ist wirklich ein cooler, netter Einstieg, kann man einfach vorbeigehen und ein bisschen networking und den einen oder anderen interessanten Vortrag eben sich reinziehen.",
            "start": 2534417,
            "end": 2583335,
            "confidence": 0.7992137931034482,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber bitte werdet jetzt nicht zu Leuten, die nur auf Meetups gehen, um sich abends Abendessen zu schnorren. Also sowas hatten wir auch schon sehr viel bei unseren Meetups. Die kommen dahin, essen und hauen wieder ab. Finde ich immer nicht so toll.",
            "start": 2584095,
            "end": 2595699,
            "confidence": 0.7990232558139533,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es gibt ja nichts besseres als Pizza und dann noch Wissen. Beides kostenlos. Ist eigentlich das Beste, was man haben kann.",
            "start": 2595719,
            "end": 2601621,
            "confidence": 0.7122380952380952,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist ja was anderes, wenn du wirklich für den Content dahingehst.",
            "start": 2602150,
            "end": 2604311,
            "confidence": 0.3205,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ich weiß nicht, ob die Firmen noch so viel Geld haben für Essen. Aber wie gesagt, war schon länger kein Meetup mehr. Ich werde mal wieder zu Meetups gehen. Ist leider auch ganz allgemein bemerkbar, dass ganz viele Meetups nicht mehr stattfinden. Also Corona hat da, glaube ich, extrem viel gekillt. Ich hoffe, dass das bald sich erholt und wieder auflebt. Aber wenn man mal von dem ganzen sozialen aspekten weg geht und den konferenzen und meetups wo man leute trifft und zum ganzen klassiker zurückkehrt wo man nicht mal mit leuten sprechen muss sehr angenehm bücher lesen liest du noch bücher.",
            "start": 2604371,
            "end": 2638157,
            "confidence": 0.8293883495145628,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich lese bücher ich habe heute mehr das hobby bücher zu kaufen anstatt sie zu lesen aber.",
            "start": 2638197,
            "end": 2644283,
            "confidence": 0.7991764705882354,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die adorn danken dir.",
            "start": 2644303,
            "end": 2645244,
            "confidence": 0.69125,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nachdem ich hier mal wieder mein Büro aufgeräumt habe, habe ich mir fest vorgenommen, ich muss mal wieder Bücher lesen und da ich nicht so einer bin, der sich hinsetzt, am Abend sieben Stunden liest, habe ich mir gedacht, okay, setze dir jetzt einfach mal einen regelmäßigen Termin in den Kalender, zwei bis dreimal die Woche während meiner Arbeitszeit, 20 bis 30 Minuten habe ich geblockt und da setze ich mich dann ins Wohnzimmer oder in einem Meetingraum, je nachdem wo ich gerade bin und fang an zu lesen.",
            "start": 2645628,
            "end": 2670024,
            "confidence": 0.783359550561798,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da sind wir schon bei einem super Thema. Du blockst dir da Zeit in deiner Arbeitszeit. Wie siehst du denn das von der Arbeitgeberseite? Müssen Firmen Weiterbildung fördern, bezahlen, dir Zeit zur Verfügung stellen, wenn du jetzt deine eigene Firma hättest und es dein Budget ist, dein Geld?",
            "start": 2670064,
            "end": 2687876,
            "confidence": 0.8139791666666669,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Tun die erstmal gar nichts, aber ich finde folgende Story schön. Und zwar, da geht der Manager zu seinem Chef und sagt, die Isabel hat einen Workshop angefragt für 6.000 Euro, den würde ich ihr gern bezahlen. Da sagt der Chef, aber was ist, wenn wir das jetzt bezahlen und sie kündigt danach sofort. Dann sagt der Manager, ja aber was ist, wenn wir ihr es nicht bezahlen und sie bleibt.",
            "start": 2688376,
            "end": 2705785,
            "confidence": 0.8150845070422538,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist eine sehr gute Story.",
            "start": 2706225,
            "end": 2707386,
            "confidence": 0.5192,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und eigentlich ist es ja genau das, wie auch schon Schiller damals sagte, wenn nicht mit der Zeit geht, geht mit der Zeit. Die Frage ist, wer ist heutzutage der Innovationstreiber? In der Regel ist es die IT, Corona hat es ja auch gezeigt. Und wenn man die Leute nicht weiterbildet und nicht am Ball bleibt, dann frage ich mich, was wird aus der Firma oder ist der finanzielle Aufwand für die Firma wirklich nicht wert, um seine Leute und ihre Leute weiterzubilden. Deswegen denke ich mir schon, ja, es ist ein wichtiger Teil, der dazugehört. Und deswegen blocke ich mir auch Zeit während meiner Arbeitszeit. Weil die Bücher, die ich lese, sind ja keine Harry-Potter-Bücher, es sind schon themenrelevante Fachbücher. Wie jetzt zum Beispiel gerade lese ich Measure What Matters, was eigentlich so das Buch über Objective und Key Results ist. Also eine Art von Quartals- und Jahresplanung.",
            "start": 2707446,
            "end": 2749896,
            "confidence": 0.8317315436241607,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mir hat mal ein Freund erzählt, auch schon ein paar Jahre her, der hat, glaube ich, bei einer Bank angefangen, wenn mich nicht alles täuscht. Der hat dann ein Buch in die Hand gedrückt bekommen, 500 Seiten, war wirklich gebunden, das war dieses Onboarding-Buch. Und dann hat man ihm gesagt, ja, er soll das mal lesen als Onboarding, aber bitte auch nicht in der Arbeitszeit, sondern am Abend in der Freizeit. Das gehört dazu zum Job. Also du glaubst, diese Zeiten sind vorbei.",
            "start": 2750496,
            "end": 2774349,
            "confidence": 0.7950843373493978,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hoffe, sie sind vorbei.",
            "start": 2774369,
            "end": 2775270,
            "confidence": 0.632,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich habe gerade kürzlich dieses Vote Upskilling entdeckt. Hast du das schon mal gehört?",
            "start": 2775930,
            "end": 2780434,
            "confidence": 0.5501333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja.",
            "start": 2780734,
            "end": 2781074,
            "confidence": 0.708,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und zwar habe ich dann auch mal geschaut auf Google Trends, wie das Ganze performt und man sieht da einen extremen starken Anstieg ab so 2019 und mittlerweile geht es wirklich hoch. Also von so 10 Prozent oder was es auch immer für eine Einheit ist bei Google Trends, so von 10 auf 100 innerhalb von ein paar Jahren. Also da sieht man schon den Stellenwert, den Upskilling einnimmt, also dieses Weiterbilden von deinem, wenn man so ganz altbacken sagt, Humankapital im HR-Wesen. Aber es wird einfach immer wichtiger heutzutage, dass man die Leute behält in der Firma und weiterbildet. Und da kannst du dir die ganzen großen Consulting-Firmen und Gartner und alle durchlesen, Da steht auch drinnen, wie wichtig Upskilling mittlerweile ist, weil früher hat man gesagt, es ist so schwierig, die Leute zu bekommen. Mittlerweile ist eigentlich das Schwierigste, die Leute zu behalten. Vor allem, wenn die dann Company-Hopping anfangen und nach vier Jahren immer die Firma wechseln. Und es wird immer wichtiger, deine Mannschaft zu halten, weiterzubilden und die Weiterbildung als richtiges Investment zu sehen, dass du dein Team weiterbringst. Also ich glaube, das ist extrem wichtig. Wenn ich mir überlege, was es teilweise für eine Diskussion war früher, um irgendwo einen Kurs um 20 Dollar zu bekommen für irgendeine Mitarbeiterin, ich hoffe, die Zeiten sind vorbei. Und es gibt ja mittlerweile auch viele Angebote, Online-Learning-Plattformen, wo es so Business-Tarife gibt für das ganze Team, Pluralsight zum Beispiel, oder O'Reilly hat sowas, auch einen Online-Learning-Bereich, wo man dann Zugriff auf alle Bücher hat und auf Videos. Also da gibt es mittlerweile extrem viele Möglichkeiten. Und ich glaube, heutzutage ist es eigentlich schon fast Standard, ein Budget dafür zu haben und da wirklich auch vielseitiges Angebot zu machen und nicht früher so mit, ja, ja, wir machen einmal im Jahr einen Workshop und dann halten wir unsere Leute schon, indem wir da irgendwann mal einen Workshop oder so machen, einmal im Jahr. Also ich glaube, es ist wesentlich komplexer geworden heutzutage.",
            "start": 2781114,
            "end": 2892251,
            "confidence": 0.814951951951952,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Umso größer die Firma, desto mehr packt die Personalabteilung natürlich auch da rein oder hat da irgendwie was am Start. Oft ist es bei vielen Firmen auch so, dass es sogenannte Konferenzbudgets gibt. Keine Ahnung, jede Mitarbeiterin und jeder Mitarbeiter darf irgendwie 2000 Euro pro Jahr auf eine Konferenz verballern. Und was ich aber auch gemerkt habe, ist, dass viele Firmen das anbieten, die Mitarbeiterinnen und Mitarbeiter es aber gar nicht so wirklich nutzen. Und am Ende des Jahres ist man so Oktober, oh wir haben ja noch das Learning Budget, das haben wir noch gar nicht genutzt und dann geht der große Run los. Und da finde ich wurde so ein Kardinalsfehler bereits begangen, weil ich denke es ist halt auch Arbeitgeberaufgabe die Mitarbeiterinnen und Mitarbeiter wirklich zu motivieren und vielleicht auch aktive Vorschläge zu machen wie man sich weiterbilden kann. In den letzten paar Minuten haben wir natürlich ein paar Möglichkeiten genannt von Konferenzen, wo die Person dann wirklich irgendwo hinfährt. Klar, dann ist die Person gegebenenfalls ein paar Tage nicht da. Und ja, vielleicht sind das natürlich auch die realen Kosten, wenn die Person nicht am Produkt arbeitet. Es gibt aber natürlich auch andere Sachen, wie zum Beispiel bezahlte Newsletter-Zertifizierungen. Videokurse oder vielleicht einfach nur Bücher und wo man jetzt einfach mal zwei, drei Meetings pro Woche sich einstellt, um dann mal eine halbe Stunde zu lesen. Das ist ja auch wertvolle Weiterbildung, die bei weitem ja keine vierstellige Summe kostet.",
            "start": 2892271,
            "end": 2966063,
            "confidence": 0.8214180327868851,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was mir da immer wichtig war, ist, dass man natürlich das Angebot macht an das Team, dass man da ein Budget hat oder dass man da auch zur Verfügung steht, wenn es Anforderungen gibt an so Weiterbildungsmöglichkeiten. Aber dass der Impuls am Ende dann vom Teammitglied kommt. Also dass jemand sich wirklich entscheidet, okay ich möchte den Kurs XY machen auf dieser Plattform, kannst du mir das bitte zahlen, lieber Arbeitgeber. Also dieser Weg ist glaube ich der bessere, als dass man einfach als Firma zehn Accounts irgendwo kauft und die nach außen wirft in die ganzen Teams. Das ist auch meine Erfahrung, dass das dann eher selten angenommen wird. Also da kann man, glaube ich, auch Einsparungen machen, indem man einfach sinnvoll agiert. Natürlich, wenn man ein Riesenkonzern ist, macht das vielleicht Sinn, dass man die eine oder andere Lizenz schon standardmäßig im Petto hat, aber gerade in kleineren Firmen, ich glaube, kommunizieren, dass man diese Angebote hat, aber dann müssen die Leute selbst entscheiden, was sie wirklich machen wollen und wirklich auch immer besprechen mit dem Lied, was Sinn macht.",
            "start": 2966123,
            "end": 3023715,
            "confidence": 0.8087252747252742,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was es auch noch gibt, was gar nicht so viele Leute auf dem Schirm haben, zumindest für deutsche Arbeitnehmer, ist der sogenannte Bildungsurlaub. Der Bildungsurlaub ist eine besondere Form vom Urlaub, der zu beruflichen oder politischen Weiterbildung dient.",
            "start": 3024084,
            "end": 3037329,
            "confidence": 0.8571578947368423,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist das wirklich ein kurzer Urlaub oder ist es dann wirklich so ein halbes Jahr oder so? Weil in Österreich gibt es Bildungskarenz, nennt sich das, wo man wirklich so ein halbes Jahr oder Jahr oder sogar teilweise noch länger wirklich dann aussteigen kann, 100 Prozent.",
            "start": 3037389,
            "end": 3049454,
            "confidence": 0.7886521739130434,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee die ganze Sache ist wirklich ein kurzer Urlaub wenn man so möchte in vielen Bundesländern ist der auf fünf Tage pro Jahr oder zehn Tage über zwei Jahre limitiert und der kommt auf seinen normalen Urlaubstage obendrauf. Es ist aber auch so dass nicht alles als Bildungsurlaub angerechnet werden kann. Also so viele ich weiß, muss da wirklich was Vorzeigbares später rauskommen, also wirklich eine Zertifizierung oder ähnliches. Und der Besuch zu einer klassischen Webkonferenz zum Beispiel kann meines Erachtens nach nicht als Bildungsurlaub beantragt werden bzw. eingereicht werden. Also da gibt es auf jeden Fall ein paar Hürden, die man da nehmen muss. Aber zum Beispiel, wenn man jetzt, glaube ich, ins Linux-Hotel nach Essen fährt, das ist so ein Hotel, da gibt es halt so ziemlich viele Workshops und Trainings zu Linux und so weiter. Ich glaube, das kann man dann zum Beispiel als Bildungsurlaub einrechnen.",
            "start": 3049774,
            "end": 3100291,
            "confidence": 0.826946308724832,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und da hat jede Tür dann irgendwie eine Pfad oder so. Da wohne ich dann im Zimmer, Run Proc Room 5 oder wie läuft das im Linux Hotel?",
            "start": 3100657,
            "end": 3109504,
            "confidence": 0.715857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Weiß ich nicht, wäre aber geil. Wenn ihr dazu Fragen habt, fragt mal bitte eure Personalabteilung, die wissen das 100 Prozent.",
            "start": 3109544,
            "end": 3115409,
            "confidence": 0.7768095238095237,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was das Linux Hotel macht?",
            "start": 3115449,
            "end": 3117791,
            "confidence": 0.8065999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wann man Bildungsurlaub einreichen kann.",
            "start": 3117831,
            "end": 3119432,
            "confidence": 0.8782,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber weil du gerade von Arbeitszeit redest, wie siehst du das, wenn ich jetzt zu einer Konferenz anreise, zum Beispiel am Sonntag, ist das dann Arbeitszeit?",
            "start": 3120305,
            "end": 3128610,
            "confidence": 0.7564230769230771,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Willst du erst mal eine Meinung oder die rechtlichen Aspekte davon?",
            "start": 3128650,
            "end": 3131832,
            "confidence": 0.6147272727272728,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Deine Meinung.",
            "start": 3131872,
            "end": 3132812,
            "confidence": 0.8674999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin da, glaube ich, sehr flux und die Gewerkschaft wird mir, glaube ich, irgendwie mit brennenden Fackeln hinterherrennen. Ich sage, nee, das ist keine Arbeitszeit, aber ich nehme da auch alles nicht so ernst. Und wenn du jetzt wirklich jemanden fragen würdest, der was mit Arbeitsrecht zu tun hat, Und da passiert ein Unfall, ich glaube schon, dass das dann unter Arbeitszeit fallen würde. Aber ich habe die Tage einen schönen Artikel gelesen, kann man die Weihnachtsfeier abends als Arbeitszeit oder Überstunden anrechnen? Das geht so ungefähr, finde ich, so in die gleiche Schiene.",
            "start": 3132832,
            "end": 3161117,
            "confidence": 0.7811473684210529,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, dann verschärfen wir das Beispiel noch. Wir reisen am Montag an zu einer Konferenz. Und wir reisen in dem Team zu viert an, alle aus der gleichen Firma. Und die Devise ist immer, wir arbeiten im Zug, da können wir arbeiten. Das ist sechs Stunden Anreise, kommen aus Österreich zum Beispiel nach, keine Ahnung, Düsseldorf. Okay, das sind acht Stunden, glaube ich. Nehmen wir mal die acht Stunden, kann man gut arbeiten. Eine Person kann aber im Zug nicht arbeiten, der wird immer schlecht. Das heißt, die drei arbeiten dann in der Arbeitszeit, die andere Person kann nicht. Es fehlen alle vier, aber dann Arbeitszeit oder nicht? Oder wie würdest du das als Teamlead regeln?",
            "start": 3161157,
            "end": 3197633,
            "confidence": 0.768008620689655,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich würde sagen, Arbeitszeit fertig. Meine Frage ist immer, mein Killer-Argument, was wäre, wenn die Person krank wäre? Wo ist der Unterschied?",
            "start": 3197673,
            "end": 3204895,
            "confidence": 0.6562173913043479,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, da kommt ja noch der Aspekt dazu, dass es von den anderen drei dann wahrscheinlich irgendwie als unfair angesehen wird, weil die arbeiten und die vierte Person arbeitet dann nicht. Aber du könntest es in gewisser Weise mit einem Krankheitstag vergleichen. Ist ja auch ein körperliches Problem. Man wird krank, wenn man arbeitet im Zug.",
            "start": 3205595,
            "end": 3223925,
            "confidence": 0.8002857142857144,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Deswegen, also.",
            "start": 3224866,
            "end": 3226347,
            "confidence": 0.607,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber das ist so der Alltag eines Leads, was man so an Probleme antrifft und die man dann als Lead auch lösen muss. Gar nicht so einfach.",
            "start": 3226407,
            "end": 3235275,
            "confidence": 0.8292222222222224,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube, da muss man dann immer gucken, okay, in welcher Firma ist man unterwegs, wie handhabt die Firma das, ist sie ein bisschen lockerer unterwegs, nimmt die alles sehr, sehr genau, hat ja ab und zu auch steuerliche Vorteile oder Nachteile für die Firma. je nachdem weil auch feature entwicklung kann man ja in produktfirmen steuerlich auf der bilanz gelten machen und so weiter und so fort also da hängt natürlich ganz viel hinten dran noch aber ja du hast recht das sind teilweise so fragen da muss man sich mit beschäftigen und dann.",
            "start": 3235315,
            "end": 3262831,
            "confidence": 0.7879270833333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ganz allgemein sehe ich das eigentlich auch so als Geben und Nehmen an. Und ich glaube, wenn man dann zu einer Konferenzfahrt eine Woche irgendwo in einem coolen Hotel ist und das ja auch will und Spaß daran hat, dann würde ich persönlich jetzt zum Beispiel nicht am Sonntag irgendwie Stunden schreiben wollen oder so. reiß rein meine persönliche Meinung, dass ich das irgendwie komisch finden würde, weil das ist irgendwie so ein Miteinander und ich persönlich würde es nicht machen, aber wie du richtig sagst, gibt wahrscheinlich viele andere Leute, die das anders sehen, ganz klar.",
            "start": 3263031,
            "end": 3291842,
            "confidence": 0.7901938775510208,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich kann diese Leute auch verstehen, ja, also ich verstehe auch, wenn man die Arbeit und das Arbeitsrelevante und das Private 100 Prozent trennt, ich habe da Verständnis für, doch das ist halt nicht mein Style, von daher, vielleicht bin ich einfach nur faul, kann auch sein.",
            "start": 3291983,
            "end": 3305225,
            "confidence": 0.7272340425531915,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn wir jetzt mal den altmodischen Fall noch annehmen, dass es gar kein Budget gibt für Konferenzen und da überhaupt nichts irgendwie vorgesehen ist in der Firma, wie würdest du denn das jetzt anlegen, wenn du als Mitarbeiter Andy in deinem Team bei der Agentur gerne zu einer Konferenz fahren würdest?",
            "start": 3305665,
            "end": 3321232,
            "confidence": 0.8451960784313727,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das klingt jetzt einfacher gesagt als getan, was ich so rate, aber ich denke, einfach den Vorgesetzten, die Vorgesetzten einfach ansprechen, darlegen, dass man auf diese Konferenz möchte. Vielleicht noch ein Grund, warum. Sollte natürlich eine Konferenz sein, die arbeitsrelevant ist. Also wenn ich jetzt im Frontend-Bereich bin und jetzt auf eine Konferenz über CPU-Architekturen gehe, weiß ich nicht, wie arbeitsrelevant das wirklich ist.",
            "start": 3321532,
            "end": 3343785,
            "confidence": 0.854859375,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wobei du da auch immer strenger bist als ich, ich finde das ganz allgemein bildend auch gar nicht so schlecht und vielleicht als perk unter umständen auch ganz gut, aber kann man natürlich.",
            "start": 3344105,
            "end": 3353436,
            "confidence": 0.8186060606060604,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment Moment Moment da gehst du ja andere aspekte an ja das eine ist ja wirklich ich sag mal so der weiterbildungsaspekt ja und die leute natürlich motiviert bei der stange halten und dass man natürlich nach der konferenz, gegebenenfalls neue eindrücke dann auch ins produkt einfließen lässt und das andere du hast ja das wort schon genannt perk das ist ja schon so eine art belohnung dann für gute performance oder ähnliches ja wo man dann zum beispiel sagen kann zum beispiel zum beispiel was schon mal so war ist wenn jemand über eine gewisse zeit lang ziemlich gut performt hat, dann kann man da auch eine Mitfahrt zur AWS ReInvent finanzieren. Da hat man ein bisschen drumherum, man fliegt nach Amerika, Las Vegas, ist alles ein bisschen besonderer, als wenn man jetzt zur Frontline-Konferenz nach Berlin fährt, wo man mit bei Berlin, wo man sehr wahrscheinlich schon mit der weiterführenden Schule einmal das Brandenburger Tor besichtigt hat oder ähnliches. Es ist natürlich dann schon ein bisschen was anderes und da ist dann schon der Trip nach Las Vegas mehr Perk, mehr Belohnung als der Trip nach Berlin.",
            "start": 3353476,
            "end": 3409237,
            "confidence": 0.8148518518518517,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das kann auch nur jemand aus Duisburg sagen, dass Berlin so schlecht ist.",
            "start": 3410838,
            "end": 3415521,
            "confidence": 0.7443076923076923,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Habe ich jetzt so nicht gesagt, das war deine Interpretation. Aber das sind ja zwei verschiedene Aspekte. Der Punkt ist aber, einfach mal die Vorgesetzte und Vorgesetzten ansprechen und einfach mal die Antwort abwarten. Denn wenn man gar keine Ahnung hat, wie der Entscheidungsträger reagiert, da kann man sich da hinstellen, zehn Stunden lang Monolog reden, warum man da hin möchte und so weiter und so fort. Vielleicht ist es auch einfach gar nicht Not, wenn nicht, vielleicht hat die Vorgesetzte einfach nur darauf gewartet, dass du mit einem Vorschlag mal um die Ecke kommst.",
            "start": 3415541,
            "end": 3444002,
            "confidence": 0.8108736842105263,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und man kann ja einfach mal nachfragen, wie sieht denn das bei uns aus? Haben wir da ein Budget? Könnten wir das machen? Vielleicht eine kleine Metatür ins Haus fallen, dass man sagt, okay, ich möchte auf diese Konferenz, die dauert zwei Wochen, ist in Las Vegas und kostet dann im Gesamten 15.000 Euro. Man kann ja auch mal langsam starten, mal nachfragen, wie das so ist und vielleicht auch mit einer kleineren Konferenz anfangen. Es gibt ja auch im Umkreis nochmal ganz coole Dinge. Oder wenn es wirklich an den Kosten liegt von der Konferenz selbst, die FOSDEM bietet sich da an als kostenlose Konferenz, 4. oder 5. Februar, um es nochmal zu erwähnen. Und uns treffen wir am besten noch. Aber man muss ja auch dazu sagen, dass die höchsten Kosten eigentlich für den Arbeitgeber dadurch entstehen, dass man gar nicht da ist und dass man nicht arbeitet und weniger diese 500 Euro, 1.000 Euro, 2.000 Euro Konferenzgebühren. Also die Kosten liegen ja woanders, wobei man auch dazu sagen muss, ist halt auch wieder ein Investment, weil die Leute motiviert sind, sich weiterbilden und als Arbeitgeber muss mir das eigentlich schon das ganze wert sein.",
            "start": 3444022,
            "end": 3501647,
            "confidence": 0.7880152284263957,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Konferenzen ist das mit hoher Wahrscheinlichkeit das größte Zeitinvestment vom Arbeitgeber, auch das größte finanzielle Investment. Aber vielleicht auch mal eine Zertifizierung, ist deutlich günstiger. Oder einfach nur ein spannendes Buch. Da sind die Kosten in der Regel deutlich geringer.",
            "start": 3502047,
            "end": 3514791,
            "confidence": 0.7826500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oder man hört einfach Podcasts, die sind kostenlos, auch informativ. Und am besten, wenn sie informativ waren, dann bitte auf diese Sterne klicken, Thumbs up, Glocke, whatever. Auf alles, was ihr irgendwie klicken könnt in eurer App am liebsten.",
            "start": 3514851,
            "end": 3528856,
            "confidence": 0.7868461538461539,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sollen wir den Engineering-Kiosk jetzt als Paid-Podcast machen, oder?",
            "start": 3529156,
            "end": 3532738,
            "confidence": 0.6772222222222223,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Solange er uns noch Spaß macht, bleibt er schon kostenlos. Und vielleicht finden wir den einen oder anderen Werbepartner wieder. Auch wenn der meistens nur einen kleinen Teil deckt.",
            "start": 3532758,
            "end": 3540641,
            "confidence": 0.8037586206896551,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war es mal wieder von uns. Wir hoffen, wir haben euch ein paar neue Eindrücke und Inspirationen für eure Weiterbildung gegeben. Es gibt nicht nur Konferenzen, sondern auch Zertifizierungen, bezahlte Newsletter, Online-Kurse oder von mir aus auch Bücher und Meetups. Testet einfach mal ein bisschen rum und es geht oft nicht darum, ein großes Zeitinvestment jetzt auf einmal zu machen, sondern sich kontinuierlich irgendwie weiterzubilden. Und wenn man das zwei bis dreimal die Woche in einer halben Stunde macht, ihr werdet beeindruckt sein, was man da über das ganze Jahr geschafft bekommt und wie viele neue Eindrücke man einfach bekommt. Denkt immer dran, ihr tut das alles nicht immer für euren Arbeitgeber, sondern in der Regel für euch.",
            "start": 3540661,
            "end": 3579255,
            "confidence": 0.8157310924369748,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weil das Wissen behält man, auch wenn man den Arbeitgeber wechselt.",
            "start": 3579295,
            "end": 3582597,
            "confidence": 0.8306363636363637,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ihr müsst in der Regel den Antrieb machen, wenn ihr was erreichen wollt. Deswegen einfach mal mit dem Vorgesetzten, mit der Vorgesetzten drüber sprechen, paar Ideen einholen, vielleicht mal den Rahmen der Möglichkeiten abchecken. Dann könnt ihr immer noch zurückkommen, ein bisschen drüber nachdenken und dann einfach mal mit ein paar Vorschlägen im nächsten One-on-One anbringen.",
            "start": 3582657,
            "end": 3598806,
            "confidence": 0.7414642857142856,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wenn ihr einen coolen Tipp habt, wo man am besten sein Wissen beziehen kann, irgendwas, was wir noch nicht erwähnt haben, wie immer auf Twitter, ING Kiosk oder auch direkt an uns städtisch at engineeringkiosk.dev. Und damit eine schöne und vor allem lehrreiche Woche. Tschö, ciao.",
            "start": 3599482,
            "end": 3616423,
            "confidence": 0.8013829787234041,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7918416981471517,
    "audio_duration": 3621.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}