{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/bf8cce4e-1429-46dc-af38-50386761964a/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "621ybr9v7m-1b1c-4a24-a4cf-a88e3f659d4f",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Hi, Knorke, dass du wieder dabei bist, bei einer neuen Episode vom Engineering-Kiosk. Heute geht es um das Thema Leadership. Jetzt denkst du dir bestimmt, ach nö, wieder nur was für Führungskräfte. Falsch. Leadership ist nicht nur für Leute mit Personalverantwortung, sondern auch für Senior und Staff Engineers und alle, die es mal werden wollen. Ach was erzähl ich denn da. Prinzipiell geht es einfach jedem was an, der in einem Team arbeitet. Wir sprechen über Servant Leadership, die dienende Führung. Was ist das? Wieso ist es gerade groß im Kommen? Was haben die Millennials Generation und Gen Z damit zu tun? Wann ist der Leadership-Stil unangebracht? Und warum hat die Frage, warum mache ich das Ganze hier eigentlich, so einen großen Stellenwert? All das und noch viel mehr. Los geht's!",
            "start": 388,
            "end": 42058,
            "confidence": 0.7891603053435112,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Andi, wie immer am Anfang habe ich eine Frage an dich. Und uns haben ja unsere HörerInnen schon öfters gesagt, wir sollen weniger Englisch reden. Aber ich als Österreicher habe einfach so ein Problem mit dem Begriff Führer. Darum verwende ich lieber dieses Wort Leadership. Außerdem ist es ja viel cooler. Heutzutage verwendet man immer Leadership. Und meine Frage wäre, wann in deinem Leben hast du zum ersten Mal Leadership gezeigt?",
            "start": 46679,
            "end": 70585,
            "confidence": 0.7756760563380284,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich bin jetzt leider nicht in der Lage, eine Story aus dem Kindergarten heraus zu zaubern, aber an der Uni. Und zwar folgendermaßen, ich hab ja Wirtschaftsinformatik studiert und das neben dem Beruf.",
            "start": 70945,
            "end": 80050,
            "confidence": 0.8198235294117646,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hab gedacht, du hast nur Bachelor gemacht, nicht studiert. Okay, anderes Thema. Weiter. In deiner Story, ja?",
            "start": 80350,
            "end": 86254,
            "confidence": 0.41372222222222227,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und manche Themen waren ja schon ein bisschen tricky, so Statistik 1, Statistik 2 und solche Geschichten. Und ich bin halt immer so ein Typ, ich versuche immer, wenn ich lerne, es wirklich zu verstehen und nicht auswendig zu lernen, weil dann bin ich auch wirklich in der Lage, das zu behalten und irgendwie relevante Themen damit zu connecten. Deswegen lerne ich halt sehr viel, lese mir das durch und stelle immer andere Fragen, die da irgendwie mit im Zusammenhang sind. Zum Beispiel, wenn ich jetzt in Wahrscheinlichkeitsrechnungen vertieft bin, stelle ich unter anderem die Frage, okay, wir haben ein altes Ehepaar, das schaut seit 20 Jahren jeden Sonntag Tatort zusammen. Wie hoch ist die Wahrscheinlichkeit, dass der Mann am Sonntagabend Tatort schaut, wenn die Frau mal nicht da ist? Das sind so solche Matheaufgaben, die du dann teilweise in der Uni auch kriegst.",
            "start": 86294,
            "end": 131996,
            "confidence": 0.7998749999999996,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich hoffe, dass diese Antwort gut wird, weil die ist schon so lange und du haltest mir immer vor, dass ich die ganze Zeit blabber. Also jetzt bin ich gespannt, da muss jetzt eine gute Story kommen mit so einer langen Einleitung.",
            "start": 132036,
            "end": 141721,
            "confidence": 0.7539534883720931,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Punkt ist ganz einfach, ich hab dann einfach eine Lerngruppe gebildet und dann haben wir uns immer mitten in der Nacht in der Unibibliothek, in der Düsseldorfer Unibibliothek getroffen und irgendwann hab ich gesagt, so Jungs, da bin ich aufgestanden und hab mir halt 25 Fragen aus der Nase gezogen, die ich den anderen an den Kopf geschmissen hab. Wenn du aber in der Lage wärst, diese Fragen zu beantworten, dann hast du das Thema verstanden. Und das hat mir natürlich auch zum Selbstzweck so ein bisschen geholfen, das ganze Thema zu verstehen. Und ich denke, das war so ein Teil, wo ich Leadership bewiesen hab.",
            "start": 142265,
            "end": 169680,
            "confidence": 0.7189252336448599,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber eigentlich hast du ja mit der Gründung dieser Lerngruppe schon Leadership gezeigt, oder?",
            "start": 169975,
            "end": 173877,
            "confidence": 0.711142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, prinzipiell schon, aber ich meine, ich mache ja kein Crocodile Management. Also ich tauche ja nicht auf, reiße meine Klappe auf und tauche dann wieder runter.",
            "start": 173917,
            "end": 182842,
            "confidence": 0.7649999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du willst jetzt keine Antwort von mir dazu haben, oder?",
            "start": 183043,
            "end": 186344,
            "confidence": 0.7123999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Gründung der Gruppe wäre ja eigentlich nur auftauchen, Klappe aufreißen und wieder abtauchen, aber ich bin ja da, um zu bleiben.",
            "start": 186385,
            "end": 191948,
            "confidence": 0.7119545454545455,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber kann ja auch schon Leadership sein, bitte. Also das ist ja auch gewisserweise Leadership.",
            "start": 191968,
            "end": 195870,
            "confidence": 0.486625,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ich bin ja da, um zu bleiben, deswegen hab ich die ganze Gruppe natürlich auch kontinuierlich weitergetrieben und hab dadurch natürlich das Studium mit ganz vielen meinen Kommilitonen in normaler Zeit ganz gut abgeschlossen.",
            "start": 196168,
            "end": 206975,
            "confidence": 0.8252285714285718,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Der Grund für meine Frage war eigentlich, um zu zeigen, dass Leadership eigentlich alle betrifft. Und wenn wir jetzt das Thema Leadership haben, nicht, dass die Hälfte unserer Hörerschaft einfach abschaltet, weil man denkt, das betrifft ja eh nur die, die in offiziellen Leadership-Positionen sind, Chefs sind, irgendwie ein Team leiten. Sondern Leadership betrifft alle, wirklich jede und jeden, vor allem die, die in Teams arbeiten, egal in welcher Position. Weil wenn man in Teams arbeitet, hat man auch immer Leute, die zum Beispiel frisch ins Team reinkommen, denen man helfen muss, denen man vielleicht irgendwelche Abläufe, Technologien beibringt. Auch da zeigt man Leadership. Man kann irgendwas vorleben im Team, ohne dass man in einer Leadership-Position ist. Man kann kommunizieren mit anderen Teammitgliedern, man kann Leute zusammenbringen, man kann andere Leute loben, man kann einfach ein Code-Review machen. All das ist Leadership und gehört zu diesem ganzen Themenkomplex dazu. Aber heute wollen wir uns einem ganz speziellen Leadership-Style widmen und zwar dem Servant-Leadership, was das Ganze natürlich ist, aber auch wo vielleicht irgendwelche kritischen Punkte sind und vor allem, warum der so hip ist und derzeit in aller Munde ist, sogar in Andis.",
            "start": 207575,
            "end": 275401,
            "confidence": 0.8432797927461133,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also sagst du mir, um das ganze Thema Leadership kommt eigentlich keiner drum rum, auch wenn ich das gar nicht will. Ist das richtig?",
            "start": 276061,
            "end": 281302,
            "confidence": 0.7560416666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Korrekt. Darum alle dranbleiben.",
            "start": 281342,
            "end": 283663,
            "confidence": 0.7312500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, gut. Du hattest jetzt auch schon den einen spezifischen Style erwähnt, Servant Leadership. Da frage ich mich immer, wenn du schon so tief reinspringst, was gibt's denn noch? Welche Leadership-Styles kennst du, beziehungsweise welche Leadership-Styles kennst du denn so, beziehungsweise hast du schon mal in der Praxis gesehen?",
            "start": 283743,
            "end": 300027,
            "confidence": 0.7802244897959183,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, mit Leadership-Styles ist es so wie mit JavaScript-Frameworks. Die sprießen da aus dem Boden wie, wie heißt das, Pilze bei euch? Bei uns sagt man Schwammeln. Sagt man Schwammeln bei euch eigentlich auch?",
            "start": 300743,
            "end": 311356,
            "confidence": 0.7808529411764705,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab einen Schwamm und der ist eine Spüle und damit mach ich mein Geschirr sauber.",
            "start": 311396,
            "end": 314219,
            "confidence": 0.7412500000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, Pilze für dich, Andi. Und da gibt's wirklich nach der Reihe kommen da in jedem Buch irgendwie neue Führungsstile raus. Und es gibt da jetzt kein Das-Führungsstil-Modell schlechthin. Also es gibt da transaktionale Führungsstile, demokratische, autokratische, laissez-faire. Also da gibt's wirklich zahlreiche Führungsstile. Aber was man schon so beobachten kann, sind so ein paar grundlegende Richtungen. Und wenn man so grundlegende Richtungen betrachtet, dann gibt es natürlich die autoritären Führungsstile. Das sind so die altmodischen Führungsstile, die man sich so vorstellt, wie früher so umgegangen worden ist. Da gibt es einen Chef, meistens männlich, und der ist autoritär unterwegs und der entscheidet einfach alles. Heute würde man vielleicht Micro-Management dazu sagen, aber der entscheidet alles. Es geht alles über seinen Tisch. Das ist so der autoritäre Führungsstil. Dem gegengesetzt ist der Laissez-faire, das hat man vielleicht auch schon öfters gehört in der Erziehung. Das ist genau das Gegenteil. Man übergibt irgendeinen Task einer Mitarbeiterin und wie das erledigt wird, ist komplett egal. Komplette Freiheit. Mach was du willst, solange du mich in Ruhe lässt, wenn man irgendwie einen Task delegiert. Und dann gibt es natürlich so Bereiche, die dazwischen sind, kooperativer Führungsstil, wo man irgendwas gemeinsam macht, gemeinsam Lösungen findet und eben auch den dienenden Führungsstil oder Servant auf Englisch, der dann auch so in die kooperative Richtung geht, aber auch gewisse Formen von laissez-faire drin hat und der so heutzutage eigentlich der neue heiße Scheiß ist, so in dem New Work Bereich, würde ich mal sagen.",
            "start": 315258,
            "end": 408081,
            "confidence": 0.8365403225806457,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hattest du das ja schon gesagt, dass Servant Leadership und Lassie Fair schon relativ nah beieinander sind bzw. sogar vielleicht einige Elemente teilen. Da frage ich mich, wenn wir doch Lassie Fair haben, warum brauchen wir dann noch einen neuen Leadership Style? Also ich meine, ist das Alter bei den neuen Schläuchen oder ist das jetzt wirklich was grundlegendes anderes oder wo sind da die Unterschiede?",
            "start": 408401,
            "end": 430123,
            "confidence": 0.8084029850746268,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, der größte Unterschied meiner Meinung nach ist einfach, dass dieser Robert Greenleaf, der damals dieses Buch zu Servant Leadership geschrieben hat, sich einfach gedacht hat, wir brauchen da was Neues und wir wollen da vielleicht was genauer definieren. Weil man muss ja dazu sagen, diese anderen Führungsstile, die sind alle nicht so hundertprozentig definiert. Das ist ja keine Programmiersprache, wo man in den Docs irgendwie nachlesen kann, was bedeutet das jetzt eigentlich genau. Der Servant Leadership Style ist vielleicht am besten definiert, weil da gibt es dieses Buch dazu. Aber laissez-faire ist ja die laissez-faire Erziehung, laissez-faire Führungsstil. Da gibt es jetzt kein Handbuch, was ist denn laissez-faire. Laissez-faire heißt ja nur laufen lassen, auf gut Deutsch. Und wie das dann konkret umgesetzt wird, ist nochmal was anderes. Aber der Servant Leadership Style, der ist einfach genauer definiert, was sind die Schwerpunkte vom Servant Leadership Modell und worauf achtet man, wenn man ein Servant Leader ist oder sich dazu entscheidet, einer zu sein.",
            "start": 430765,
            "end": 482678,
            "confidence": 0.7945365853658538,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, im Lassie-Fair-Stil, soweit ich das verstehe, da überträgt die Führungskraft halt die Aufgaben auf die auf die Mitarbeiter und Mitarbeiterinnen. Der Vorgesetzte macht aber dabei klare Zielvorgaben, also schafft ihr so einen Rahmen und definiert auch die Ziele, die am Ende der ganzen Thematik auch erreicht werden sollen.",
            "start": 483067,
            "end": 498041,
            "confidence": 0.8026734693877552,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber das hast du bei einem Servant Leadership genauso, weil da wirst du ja auch die großen Ziele irgendwie setzen, wo wollen wir hin als Firma und was wollen wir erreichen.",
            "start": 498261,
            "end": 507590,
            "confidence": 0.7411250000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ja, schon klar. Nur bedeutet das dann, dass Servant Leadership, ich sag mal so, laissez-faire auf Crack ist? Also so das Next Level?",
            "start": 508165,
            "end": 517011,
            "confidence": 0.7352916666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, manche behaupten ja, dass laissez-faire so Zero Leadership ist. Das liest man auch immer wieder in der Literatur. Also dass es Null Leadership ist. Ich vergib irgendwas, lass die Leute machen und misch mich dann auf keinen Fall mehr ein. Und Servant Leadership geht aber dann natürlich schon in diese Richtung, dass man sehr wohl noch sich einmischt und in Verbindung ist mit den Leuten und denen auch hilft. Und das richtige Umfeld garantiert, dass die Leute da möglichst gut drin arbeiten können. Und das ist beim Laissez-faire weniger der Fall, beziehungsweise weniger definiert, muss man sagen.",
            "start": 517052,
            "end": 547370,
            "confidence": 0.8572142857142856,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, bei der Zero-Leadership-Definition gehe ich persönlich nicht mit. Und vielleicht ist das auch mein Glück, dass die ganzen Führungsstile da einfach schlecht oder gar nicht definiert sind. Weil ich habe nämlich dann auch das Recht, diese Leadership-Stile so auszulegen, wie ich möchte, wenn man so möchte. Wie ich möchte, wenn man so möchte. Wie oft möchte, kann ich eigentlich in einem Satz sagen.",
            "start": 547590,
            "end": 565595,
            "confidence": 0.8271562499999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, das möchte ich nicht wissen.",
            "start": 566175,
            "end": 568956,
            "confidence": 0.7955000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der war flacher. Bei dem Zero Leadership gehe ich halt einfach aus dem Grund nicht mit, weil meines Erachtens nach das nicht der Fall ist. Nur weil ich viele Aufgaben und Entscheidungen an die Teammitglieder übergebe, heißt das ja nicht, dass ich weiterhin nicht accountable bin und verantwortlich gehalten werden kann. Ja, das kommt für mich bei Zero Leadership so ein bisschen mit, so I don't give a fuck. Aber das ist ja meines Erachtens nach nicht der Fall, sondern du gibst halt schon a fuck. Also du willst halt schon wissen, was abgeht und allem drum und dran. Doch du stellst ja fähige Leute ein, nicht um denen zu sagen, was sie tun sollen, sondern dass die dir eigentlich sagen, was zu tun ist. Und du bist ja immer noch verantwortlich dafür. Und das verbinde ich dann eher mit Laissez-faire und nicht mit diesem Zero Leadership.",
            "start": 568996,
            "end": 613355,
            "confidence": 0.8126054421768709,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja klar, also es ist je nachdem, wie du das siehst. Das sehe ich auch genau so. Am Ende musst du ja das ganze Ding leben und da werden wahrscheinlich auch immer verschiedene Leadership-Styles mit einfließen. Ist ja auch ganz klar. Also das sind ja immer nur Modelle, an die man sich vielleicht halten kann oder wo man halt auch erkennt, welche Schwerpunkte gesetzt werden. Aber gehen wir mal in die Servant-Leadership-Definition rein, weil die sind ja eigentlich relativ genau definiert zumindestens, was Schwerpunkte sind im Leadership-Modell.",
            "start": 614140,
            "end": 640560,
            "confidence": 0.777528735632184,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wenn ich mir jetzt die Definition von Servant Leadership wirklich aus dem Buche herausnehme von Robert Greenleaf, dann besteht die eigentlich aus zehn Themenbereichen. Aus Zuhören, Empathie, Wohlbefinden, Bewusstsein, Überzeugungskraft, visionäres Denken, Weitblick, Verantwortungsbewusstsein, Fokus auf die personelle Entwicklung und Gemeinschaft. Und wenn ich mir das jetzt einfach mal so durch den Kopf gehen lasse, klingt das alles irgendwie, als würde das gerade direkt alles aus dem Kloster kommen. und alles in meiner privaten Freizeit bei meiner Yoga-Stunde durch meine Yoga-App auf die Ohren geballert bekomme. Deswegen kann man sich halt schon die Frage stellen, was hat diese ganze Thematik im Arbeitskontext zu tun?",
            "start": 641035,
            "end": 683743,
            "confidence": 0.8420761904761905,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Böse Zungen würden vielleicht behaupten, das kommt an irgendwelche Yoga-Kurse sehr nahe hin oder an irgendwelche spirituellen Dinge, was ja Leadership in irgendeiner Form immer irgendwo ist. Autoritäre Leadership-Modell hat die Kirche auch lange genug gelebt. Spirituell sehe ich da gar nicht so weit entfernt. Aber für mich, wenn man diese zehn Punkte eigentlich so betrachtet, dann kristallisieren sich für mich da eigentlich zwei Punkte sehr stark heraus, dass man sich einfach viel mehr auf das Team konzentriert, auf die MitarbeiterInnen, auf dein Wohlbefinden, dass das Team einfach gut funktioniert, dass die Gemeinschaft funktioniert im Team, Und auf der anderen Seite mehr die strategische Entwicklung, dass man Weitblick hat. Was kommt auf einen zu? Wo will man hin? Und dass man das auch dem Team vermittelt. Also das sind so für mich die zwei großen Schwerpunkte Team und Weitblick. Und wenn man das vereint, kommt man eigentlich sehr schnell in das Servant Leadership Modell rein.",
            "start": 683783,
            "end": 740276,
            "confidence": 0.8377225806451615,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So wie du dein team aspekt beschrieben hast heißt das irgendwie für mich beziehungsweise kann ich so verstehen dass ich best buddy mit jedem sein muss dass ich zu jedem bierchen mitgehen muss abends und so weiter und so fort ist das der fall.",
            "start": 740596,
            "end": 752454,
            "confidence": 0.8201136363636365,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja du fällst jetzt schon mit der tür ins haus mit dem mit dem. sehr kritischen Blickwinkel würde ich mal sagen, wo auch viele eben sagen, gerade mit New Work und mit den goldenen Käfigen bei Google und bei den großen Tech-Companies, wo man alles bekommt, aber dafür halt auch sein Leben opfert. Und das wird halt oft gleichgesetzt mit dem Leadership-Modell, weil es in ähnlichen Industrien vielleicht auch passiert regelmäßig, Aber meiner Meinung nach definiert das Leadership-Modell an sich nicht, dass du jetzt Bier trinken gehen musst und Best Buddy sein musst mit jedem, sondern dass du als Servant, also als Diener, deinem Team dienst und dem zur Verfügung stehst und alles machst, dass das Team gut funktioniert. Was das dann schlussendlich ist, ist natürlich in diesen Bereichen teilweise definiert oder so eine Richtung vorgegeben, aber du musst meiner Meinung nach nicht der Best Buddy sein. Es ist immer noch ein Firmenumfeld, auch wenn das gerne vermischt wird. Das muss man schon auch dazu sagen. gar nicht so leicht ist, vielleicht auch auseinanderzuhalten, weil umso besser dein Team funktioniert, umso familiärer das Ganze wird, umso besser funktioniert dein Team vielleicht dann. Und dann kippt man halt sehr schnell eben in diese Falle, dass man dann aus diesem Berufsleben rauskippt und alles plötzlich sich vermischt in einem Konglomerat, das sich Arbeit nennt, aber das dann irgendwie Privatleben ist, Best Buddies und wo dann halt auch viele Probleme entstehen. Aber bei Definition meiner Meinung nach ist das jetzt noch nicht zwingendermaßen der Fall.",
            "start": 752474,
            "end": 833703,
            "confidence": 0.8109325396825395,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und bei dem Thema Weitblick, was du erwähnt hast, heißt das jetzt, ich muss die nächsten zwei Jahre komplett durchgeplant haben? Oder was ist mit Weitblick gemeint?",
            "start": 834083,
            "end": 841980,
            "confidence": 0.856037037037037,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, ganz im Gegenteil. Also der Weitblick sagt ja, du probierst zu antizipieren, was kommt natürlich, um jetzt dein Team zu schützen, um zukünftige Ereignisse zu antizipieren. Deine Erfahrung hilft dir da ja auch vielleicht, dass du einfach weißt, okay, wenn wir jetzt irgendwas machen oder uns in irgendein Wespennest setzen als Team, dann kommt da vielleicht auch einiges auf uns zu, auf politischer Seite oder so innerhalb der Firma, all diese Dinge. Einfach, dass man sich so um das Team kümmert, auch das Team schützt. Aber auch auf der anderen Seite eben dieser Weitblick, dass man sagt, wo will man denn hin in den nächsten Jahren? Also wirklich so entfernte Ziele setzt und das Team entscheidet dann natürlich selbst. Es geht dann wieder mehr in laissez-faire. Wie kommt man denn zu diesem Ziel? Aber man erklärt, warum man zu diesem Ziel will, was dieses Ziel sein soll. Diese Vision, wir haben ja da auch schon eine eigene Episode gemacht zu Visionen und Missionen, dass man die im Vorfeld definiert. Wie man dann aber dorthin kommt, ist dann eben eine gemeinschaftliche Arbeit im Team.",
            "start": 842930,
            "end": 899922,
            "confidence": 0.8326756756756758,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ich mir die zehn Punkte gerade so ansehe, dann sind für mich zwei andere Punkte die Highlights. Du hast ja gerade die Gemeinschaft, das Team und den Weitblick als Highlight rausgeholt. Für mich ist es eher die Überzeugungskraft und das Verantwortungsbewusstsein. Mit überzeugungskraft verbinde ich immer folgendes thema damit warum machen wir den ganzen scheiß hier eigentlich also für wen beziehungsweise welchen sinn hat das ja und da geht es jetzt nicht darum autoritär zu sein und dass der chef da steht du du du du machst das jetzt weil es gemacht werden muss, Sondern wirklich ich verbinde das mal ein bisschen mit so Storytelling, dass man sich hinsetzt und den Mitarbeiterinnen und Mitarbeitern einfach in Ruhe erklärt, warum ist das sinnvoll, warum ist das gerade für uns eine Priorität und welchen Benefit hat das, wenn wir das vervollständigt haben. Einfach nur, einfach nur in Anführungszeichen, weil das ist alles andere als einfach, aber die Menschen überzeugen damit sie halt den Sinn dahinter sehen. Und es ist ja schon eine Weisungsbefugnis, muss man ja schon sagen. Dennoch, sofern die Personen verstehen, warum wir das machen, man sagt immer so, das ist why, start with why, warum machen wir das, dann hat man vielleicht auch eine Chance, die damit wirklich zu motivieren bzw. zu inspirieren. Und natürlich dann, wenn sie mit intrinsischer Motivation dahinterstehen und wirklich auch wissen, was für einen Impact die Arbeit hat, dann wird sie vielleicht sogar innovativer, dann wird sie vielleicht sogar einfach besser, vielleicht auch einfach schneller gelöst, anstatt so, Jetzt muss ich die scheiße schon machen und dass ich das so als als it's a frog anfühlt so als scheißarbeit ja also das ist für mich so relativ groß dabei.",
            "start": 900582,
            "end": 995070,
            "confidence": 0.7862307692307695,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und da ist ja glaube ich auch der große unterschied zum boss sein und zum leader sein und was du vielleicht auch bei deiner lerngruppe während du studiert hast gemacht hast dass du einfach die leute überzeugt hast warum das sinn macht du hattest da ja hierarchisch keine, disziplinare Möglichkeit irgendwie jemanden zu bestrafen oder jemanden zu zwingen, sondern du hast einfach die Leute überzeugt, warum eure Lerngruppe Sinn macht und warum die anderen jetzt irgendwelche Fragen sich ausdenken sollen, weil alle was davon haben, weil man besser lernen kann, was es auch immer ist, aber du hast die Leute überzeugt. Und wenn man das natürlich im Firmenkontext auch schafft, dass man Leute überzeugt oder vielleicht auch sich selber überzeugen lässt. Es gehört ja auch dazu, wenn dann alle irgendwie dagegen sind oder gute Argumente vorbringen, dass man sich selber auch überzeugen lässt. Und wenn dann aber alle an einem Strang ziehen, dann sollte das Ganze natürlich auch besser funktionieren im Team, weil man eben gemeinsam, alle gemeinsam in die gleiche Richtung steuert auf ein Ziel, wo alle überzeugt sind, dass das Ziel auch Sinn macht.",
            "start": 995110,
            "end": 1053321,
            "confidence": 0.8389569892473121,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich meine, ein großer Gegenpunkt wäre natürlich folgendermaßen und zwar die klassische Definition von Arbeit. Jetzt kommen wir mal wieder zur Realität und nicht von diesem Friedi-Freude-Eier-Kuchen und wir sind hier auf dem Ponyhof, weil die klassische Realität von Arbeit ist natürlich Geld im Austausch von Zeit und Fähigkeit. Ich opfere meine Zeit, acht Stunden pro Tag, um meine Fähigkeit, Softwareentwicklung und kriege im Austausch da Geld. Und zusätzlich kann man sagen, ich werde angestellt, um den Traum von jemand anders zu verwirklichen, weil im Endeffekt setze ich ja irgendwas um, was gegebenenfalls nicht mein Traum ist.",
            "start": 1053741,
            "end": 1084558,
            "confidence": 0.8016804123711341,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber es kann ja auch dein Traum sein.",
            "start": 1085239,
            "end": 1086561,
            "confidence": 0.5995555555555555,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Und deswegen möchte ich ja sagen, warum ist Überzeugungskraft bzw. dieses Why für mich so wichtig. Ich verbringe ein Drittel des Tages auf der Arbeit, acht Stunden, und ich möchte diese Zeit natürlich nicht verschwenden. Ich möchte diese Zeit mit dazu verbringen, wo ich motiviert zu bin, wo ich vielleicht ein bisschen passionate zu bin. Und ich habe das gerade so provokativ gesagt, ich setze den Traum von jemandem anders um. Und das meine ich auch recht realistisch, aber wenn der Traum für mich auch Sinn macht bzw. wenn ich das verstehe, was der Traum ist und mich dazu connecten kann, dann ist das vielleicht auch Ja, ein bisschen Passion. Und deswegen mache ich vielleicht meinen Job ein bisschen lieber und stehe nicht mit einer Flappe morgens auf und denke mir, boah, wieder zur Arbeit. Deswegen ist für mich die Überzeugungskraft und das Why dahinter sehr, sehr wichtig, weil auch dann ich weiß, was ich für einen Impact habe.",
            "start": 1086581,
            "end": 1129249,
            "confidence": 0.7569000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es muss ja auch nicht so deinem Traum werden, aber du musst zumindest den Sinn erkennen und es gibt ja nichts Schlimmeres. Ich habe auch mal in einem Team was umgesetzt, wo das Team absolut nicht überzeugt war und das ist eigentlich schon zum Scheitern verurteilt. Also das war so ein C-Level-Project, niemand hat daran geglaubt. Ich glaube sogar, wenn das Sinn gemacht hätte oder vielleicht hätte es Sinn gemacht, aber es hat niemand daran geglaubt. Es hat eigentlich scheitern müssen, würde ich fast sagen, weil man kann niemanden dazu zwingen, gute, kreative Arbeit zu machen an irgendeinem Projekt, woran niemand glaubt.",
            "start": 1130034,
            "end": 1165093,
            "confidence": 0.8256078431372548,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, aber da kommt ja dein Job als Engineering Manager auch zu Tage. Servantly dahin oder her. Der Punkt ist ganz einfach nur, du bist mit deinem Team an dieser Stelle auch um Top-Down-Decisions umzusetzen. Natürlich kannst du als Engineering Manager oder als Engineering Managerin nach oben hin challengen und allem drum und dran. Am Ende des Tages, wenn du nicht erfolgreich warst, ist trotzdem die Aufgabe Disagree and Commit, weil das ist dein Job. Du bist Angestellter in der Hinsicht. Da muss man natürlich dann ein bisschen gucken, wie man das mit dem Servant Leadership Style hinkriegt und allem drum und dran. Aber das ist für mich dann auch so ein Punkt von Transparenz. Und vielleicht auch so ein bisschen Verantwortungsbewusstsein. Oder vielleicht einfach nur Bewusstsein. Weil, dass du immer alles schön happy hast, sind wir mal ehrlich, funktioniert halt auch nicht.",
            "start": 1165613,
            "end": 1214490,
            "confidence": 0.8109020979020978,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, dieses Why, was du erwähnt hast, man muss immer erklären, warum man etwas macht. Im schlimmsten Fall ist das Warum natürlich vielleicht auch, weil der CEO das einfach wünscht. Und wir werden das jetzt einfach durchtesten müssen, um zu zeigen, ob es funktioniert oder nicht funktioniert.",
            "start": 1215311,
            "end": 1229797,
            "confidence": 0.8138936170212766,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber ist das nicht auch Teil des Research?",
            "start": 1229997,
            "end": 1231458,
            "confidence": 0.6792222222222223,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube, dass das eben keine sinnvolle Herangehensweise ist und ich glaube, man sollte es auf jeden Fall verhindern, dass sowas passiert. Und ich war damals zumindest von dem Projekt auch überzeugt, muss ich dazu sagen, und ich habe das probiert auch weiterzugeben. Und vielleicht habe ich ein paar im Team überzeugt, aber im Endeffekt konnte ich einfach nicht alle überzeugen, muss man ganz klar sagen. Da war zu viel Gegendruck da. War eine schwierige Situation, aber ich glaube, wir haben auch alle gemeinsam daraus viel gelernt aus dem Projekt. Aber es funktioniert meiner Meinung nach nicht immer. Das ist halt ein Ziel, was man hat, aber ich glaube, man kann es nicht für jedes beliebige Projekt einsetzen. Es funktioniert nicht immer zu 100 Prozent.",
            "start": 1232098,
            "end": 1270571,
            "confidence": 0.784912698412698,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber Überzeugungskraft, inspirierend sein, Visionen voranbringen und so weiter ist ja auch eine maßgebliche Eigenschaft von einem Servant Leader. Jetzt erzählst du mir gerade, du hast es damals nicht geschafft und jetzt mal eine Frage, die mich wirklich interessiert. Wenn du jetzt nochmal genau die gleiche Situation hättest, was würdest du jetzt anders machen? Würdest du dir mehr Zeit nehmen, zum Beispiel fürs Nachdenken, fürs Storytelling? Oder würdest du es gar nicht erst versuchen und sagen, hör mal, ich krieg da jetzt so die Aufgabe, die müssen wir jetzt exekuten? Oder, also was wäre jetzt deine Herangehensweise? Oder würdest du immer noch den Weg gehen, alle zu überzeugen und wirklich mit auf die Seite zu ziehen?",
            "start": 1270591,
            "end": 1300944,
            "confidence": 0.7467413793103449,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also mein präferierter Weg wird immer sein, dass ich probiere, die Leute zu überzeugen, vor allem, wenn ich persönlich daran glaube. Ich glaube, damals in diesem Fall war so eine 50-50-Teilung von, lass es uns mal probieren, wir schauen einfach, ob es funktioniert. Die andere Hälfte war so, ja, wir müssen es einfach machen, lass es uns probieren. Also es war dann, es hat dann jede und jeder im Team verstanden, dass wir es machen müssen in irgendeiner Form. Es waren unterschiedliche Motivationen vorhanden und ich glaube, so im Nachhinein gesehen, da müsste man natürlich jetzt im Background verstehen und wie das alles zustande gekommen ist, das geht jetzt zu sehr ins Detail, aber ich würde es wahrscheinlich wieder genau gleich machen. Probieren zu überzeugen und zumindest noch so weit zu kommen, dass alle in die gleiche Richtung gehen, ohne komplett negativ eingestellt zu sein. Ich glaube, das war das Beste, was man damals herausgeholt hat. Ich glaube, das Schlimmste ist immer, wenn man Leute überhaupt nicht überzeugen kann und die so negativ eingestellt sind, dass sie das Projekt dopedieren. Und ich glaube, das muss man auf jeden Fall verhindern. Das Beste ist natürlich, alle ziehen Vollgas an einem Strang. Aber das ist nicht immer möglich. Aber wenn man es wenigstens schafft, zu verhindern, dass nicht negativ Energie vorhanden ist, hilft das auch schon.",
            "start": 1301544,
            "end": 1371630,
            "confidence": 0.8019642857142854,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der zweite Punkt, der für mich heraussteht, ist Verantwortungsbewusstsein. Weil das finde ich auch in der Persönlichkeit von Menschen sehr sehr wichtig. Und mit Verantwortungsbewusstsein meine ich eigentlich Verantwortung tragen, Verantwortung akzeptieren, aber auch Fehler zu akzeptieren.",
            "start": 1371670,
            "end": 1386198,
            "confidence": 0.8801351351351353,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auf welcher Seite meinst du das jetzt? Auf der Teamseite Verantwortung übernehmen oder auf der Leaderseite Verantwortung übernehmen?",
            "start": 1386218,
            "end": 1392802,
            "confidence": 0.7607222222222223,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Beides. Meines Erachtens nach beides, weil wenn ich dem Team diene, stecken wir alle drin. Und meines Erachtens nach Ich würde niemals einen Fehler von einem Teammitglied nach außen tragen und dann sagen, das Teammitglied war das, das war der Fehler von ihm oder ihr. Da würde ich immer den Blame nehmen, weil ich bin dafür verantwortlich, ich als Engineering Manager. Doch innerhalb des Teams, innerhalb des Safe Spaces, innerhalb des geschlossenen Raumes, Erwarte halt ich schon, dass wenn ein Teammitglied einen Fehler gemacht hat oder ein Problem sieht oder ein Problem gemacht hat, dass man sagt, oh, I fucked up.",
            "start": 1392822,
            "end": 1425122,
            "confidence": 0.8397029702970297,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und was hat das dann für Folgen?",
            "start": 1425782,
            "end": 1427343,
            "confidence": 0.7382857142857144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gar keine. Also das ist der wertvollste Mitarbeiter für mich, weil diese Person wird diesen Fehler nie wieder machen. Also das war vielleicht sogar das teuerste Learning, aber vielleicht auch die beste Education. Wenn man jetzt zum Beispiel, ich weiß nicht, die Produktion, Datenbank, Droptable, irgendwas gemacht hat, das wird nie wieder passieren. Was ich aber davon erwarte, ist, dass man sagt, hey, hör mal du, ich hab Blödsinn gemacht, wir kriegen was hin. Aber ich feuer ja deswegen keinen.",
            "start": 1427363,
            "end": 1450983,
            "confidence": 0.7385999999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also die die schönen hochgeschworene fehlerkultur.",
            "start": 1451343,
            "end": 1454584,
            "confidence": 0.7203333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn man das so nennt dann ja ich denke halt einfach nur man sollte wissen mit welcher verantwortung man unterwegs ist wenn ich jetzt in dem sensiblen bereich unterwegs bin dann muss mir bewusst sein was ich hier tue und wenn ich dann fehler gemacht habe dann muss man auch dazu stehen und sagen okay anstatt sie unter den tisch zu kehren.",
            "start": 1454604,
            "end": 1470090,
            "confidence": 0.834016129032258,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Mir hilft ja auch immer die andere Seite zu sehen, wie man etwas nicht macht. Und ich habe ja auch ganz viel gelernt von Leuten, die Sachen gemacht haben, wo ich mir dann selber gedacht habe, so will ich es nicht machen. Und ich glaube, die Gegenseite ist einfach, kennt vielleicht jeder, gibt ja auch so Chefs oder Chefinnen, die Fehler immer aufs Team schieben und wenn es irgendwie einen guten Erfolg gibt, dann sich den Erfolg nehmen und sich feiern lassen, dass sie den Erfolg als Lead gemacht haben und das Team womöglich nicht mal auf ihnen. Also das ist die Gegenseite dazu, so wie es meiner Meinung nach nicht sein sollte.",
            "start": 1470530,
            "end": 1499502,
            "confidence": 0.7894778761061948,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das ist ja auch ein ganz großer Teil von Servant Leadership. Praise die Leute, wo Praise hingehört. Der Punkt ist ganz einfach nur, und ich glaube, das wird auch sehr groß mit Laissez-faire geteilt, man selbst als Führungsposition ist ja nur erfolgreich, wenn das Team erfolgreich ist. Alleine selbst macht man dann nicht die harte Arbeit. Also man macht ja nicht das klassische Doing. Das bedeutet, ohne deine Teammitglieder bist du eigentlich gar nichts. Dann hast du noch niemals einen Job. Das muss man sich halt mal bewusst werden. Du bist ja da, um das Wachstum von einer Gruppe von Leuten sicherzustellen, in Kombination natürlich mit dem Anspruch von der Firma, mit einem gewissen Outcome, mit einer, sei es irgendwie Projekte abschließen, Software entwickeln oder was weiß der Geier nicht. Der Punkt ist ganz einfach, nur du kannst ja niemals den Output von fünf Leuten leisten. Es gibt doch diese 10x Developer, von.",
            "start": 1499891,
            "end": 1547420,
            "confidence": 0.7835844155844156,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Denen jeder redet in der theorie zumindest.",
            "start": 1547440,
            "end": 1550301,
            "confidence": 0.6769999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja es funktioniert halt einfach nicht punkt aus ende umso erfolgreicher deine teammitglieder sind und auch so elemente wie gemeinschaft wie du gerade schon gesagt hattest, gemeinschaftliches arbeitsklima und alles was dazugehört umso besser all das zusammen läuft umso erfolgreicher bist du weil das team ja eigentlich, dich zieht, ja? Und bezüglich des Verantwortungsbewusstseins ist das, glaub ich, dann halt ... Deswegen ist das für mich so wichtig, dass du innerhalb des Teams diese Probleme halt auch ansprichst, offen und ehrlich sagst, hey, ich hab Blödsinn gemacht, und dann erwarte ich aber auch von allen anderen Teammitgliedern, dass die an einem Strang ziehen, um das Problem dann zu lösen. Draußenhin krieg ich den Blame, ja? Das bedeutet also, mein Chef, der kann mich dann gerne anschreien, der wird aber niemals das Team anschreien. Weil der, mein Chef ... Ich hoffe.",
            "start": 1550321,
            "end": 1590619,
            "confidence": 0.7636999999999995,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dein Chef schreit nicht.",
            "start": 1590639,
            "end": 1591760,
            "confidence": 0.7347499999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das ist jetzt nur ein Beispiel.",
            "start": 1592080,
            "end": 1594602,
            "confidence": 0.5337142857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber es schreien immer noch erstaunlich viele Chefs.",
            "start": 1594642,
            "end": 1597905,
            "confidence": 0.725375,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Punkt ist ganz einfach. Sofern möglich, wird mein Chef niemals den Namen der Person erfahren, wer das Problem verursacht hat, weil es interessiert ja gar nicht, weil es war ja das Team. Es ist aber schön zu sehen, dass du zwei ganz andere Bereiche als Highlight von Server Leadership siehst als ich.",
            "start": 1597925,
            "end": 1614700,
            "confidence": 0.7978867924528301,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich bin mir gar nicht sicher, ob sie so Unterschied machen, weil es geht auch wieder in die Richtung auf, was sind die Ziele und was macht das Team, aber vielleicht ein paar andere Schwerpunkte. Du gehst halt mehr in die Überzeugungskraft und die Verantwortung übernehmen. Aber was natürlich meiner Meinung nach auch extrem wichtig ist, ist der ganze Bereich, wie schaffe ich es, dass das Team vorwärtskommt. Das heißt, dass man wirklich ein Umfeld schafft, wo das Team wachsen kann. Also dass man mit der Empathie ist ja auch ein Schwerpunkt und dem Zuhören, dass man da herausfindet, was braucht das Team, wo wir sich das Team hin entwickeln. Und wie kann ich als Engineering Manager dann diese Weiterentwicklung fördern? Die Weiterentwicklung ist ja auch ein Schwerpunkt von Servant Leadership. Also wie kann ich dieses Team weiterentwickeln und wie schaffe ich das, dass die Teammitglieder einfach wachsen in ihren Aufgaben und vielleicht sogar drüber hinaus wachsen und vielleicht dann irgendwann meinen Job übernehmen oder von einer großen anderen coolen Company übernommen werden? Für mich sind das alles eigentlich Komplimente, beziehungsweise habe ich mein Ziel erreicht, wenn die Leute in dem Team wachsen, größere Projekte übernehmen, besser werden, andere Tätigkeiten übernehmen und das Ganze ohne dabei auf der Strecke zu bleiben. Das heißt, auch das Wohlbefinden des Teams sicherstellen, dass es keine Burnouts gibt, dass sich die Leute gesund weiterentwickeln. Ich glaube, das ist wirklich ein ganz wichtiger Punkt, weil wenn die Gesundheit, das Wohlbefinden, das gesunde Arbeitsumfeld nicht garantiert ist im Team, dann wird mir das Team irgendwann zusammenbrechen. Und dann kann ich noch so viel Überzeugungskraft hineinstecken und Verantwortung geben und was weiß ich, was alles, aber wenn das Team einfach nicht mehr performt, zusammenbricht, dann kann ich auch keine Ziele erreichen. Also auch da die Gesundheit, Wohlbefinden ist, glaube ich, ein sehr wichtiger Punkt. Also man sieht schon, die zehn Punkte haben durchaus einen Sinn. Man kann die natürlich runterkürzen auf zwei, drei Schwerpunkte. Aber es hat schon Sinn, dass das zehn Punkte sind. Und man kann sich dann eben als Leader auch überlegen, okay, in den zehn Punkten, was kann ich jeweils machen, um da besser zu werden, um mein Team weiterzubringen. Und darum ist es auch gut, dass man das so runterbricht auf zehn Schwerpunkte.",
            "start": 1615457,
            "end": 1740893,
            "confidence": 0.8076692913385832,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir reden jetzt immer als servant leader, musst du, musst du, musst du, musst du, musst du. Also meines Erachtens nach kann man diese zehn Punkte gar nicht in hundertprozentiger Vollständigkeit konstant abdenken. Ich denke, jeder hat Schwächen und Stärken. Ich denke, die eine Person ist besser im Erklären des Kontextes, des Whys und so weiter, ist deswegen vielleicht in der Empathie nicht so stark oder im Zuhören und so weiter und so fort. Ein wichtiger Punkt für mich ist aber auch, wir sprechen jetzt immer nur, der Leader muss sich ums Team kümmern. Meines Erachtens nach sollte man aber auch sich selber in der Hinsicht nicht vergessen. Das bedeutet, es bringt jetzt auch nichts, wenn man konstant dem Team dient und schaut, dass jeder happy und jeder gesund und was weiß ich, nicht ist, aber man selbst kurz auf den Burnout kratzt. Für mich gehört nämlich dann als Servant Leader auch eine sehr, sehr hohe Awareness und Selbstbewusstsein dazu, so nach dem Motto, was sind meine Grenzen, was sind meine Stärken, was sind meine Schwächen. Und wo muss ich einfach nur ab und zu mal auf mich selbst achten. Und ich denke, das wird sehr, sehr oft in dieser ganzen Leadership-Diskussion, egal bei welchem Führungsstil, halt vergessen. Weil auch wenn der, ich sag mal, Kopf des Teams kaputt ist, dann wächst halt da in der Regel nicht so schnell wieder einer nach, der alles ohne Probleme übernehmen kann. Natürlich wachsen da Leute nach, so nach dem Motto, die wachsen in die Stelle. Aber der Punkt ist, man darf sich halt selber nicht vergessen und man darf sich halt selber nicht kaputt machen bei der ganzen Thematik.",
            "start": 1741280,
            "end": 1820228,
            "confidence": 0.8224693140794226,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also es heißt ja auch dienende Führung oder Leadership-Style und nicht aufopfernde. Also es darf man auch nicht vermischen.",
            "start": 1820765,
            "end": 1829260,
            "confidence": 0.8436842105263157,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich muss jetzt nicht kriechen, um zu dienen. Am Boden zerstört sein.",
            "start": 1829300,
            "end": 1833087,
            "confidence": 0.8526153846153846,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du übrigens gewusst, dass Minister von Dienen kommt? Ministrare oder so? Ich bin kein Lateiner, aber irgendwie so in der Richtung. Hast du schon mal Minister Griechen gesehen? Oder eine Ministerin? Die haben dieses Wort meistens auch noch nicht ganz verstanden, dem Volke Dienen. Aber egal, andere Sache. Aber jetzt haben wir schon irgendwie das so dargestellt, als sei das die Leadership-Methode Nummer eins und eigentlich gibt es nichts mehr anderes. Und das ist halt so ein aktueller Trend, der da extrem entsteht und man hört das immer mehr. Ich kann mich erinnern, wie ich Engineering Manager war das erste Mal. Irgendwann ist der Begriff mal aufgebobbt und plötzlich ist der innerhalb von kürzester Zeit aus allen Ecken irgendwie dahergekommen. Das war so vermutlich mal irgendwann 2017 oder so in der Richtung und dann war das plötzlich ein voller Trend und es geht jetzt noch immer härter rein und das ist so der Way to go. Warum ist das so? Ist es der Way to go? Was ist da deine Meinung dazu?",
            "start": 1834019,
            "end": 1889145,
            "confidence": 0.7775202312138729,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich finde das gerade ganz wichtig, weil du sagst, okay, das ist ja gerade so der neue heißer Scheiß und kommt irgendwie auf und im Vorgespräch sagtest du zu mir, als ich das gefragt habe, okay, sollen wir das auch reinbringen? Warum das denn jetzt so ein Trend ist? Da hast du gelacht und hast gesagt, ja, schon seit zehn Jahren. Und da musste ich halt grad auch so ein bisschen grinsen, weil in der Regel, ja, Veränderungen in der Industrie, sei es auch die Softwareindustrie, brauchen halt ein bisschen, ne? Aber das ist wirklich eine interessante Frage. Warum kommt das jetzt so auf? Warum ist das in aller Munde? Und zwar, den richtigen Grund kenn ich jetzt nicht, aber das ist eine Theorie, die auch von sehr vielen Leuten immer angebracht wird. Und zwar basiert's nämlich immer alles auf Menschen. Und zwar aktuell sind die Millennials, die stellen die Mehrheit der Arbeitskräfte.",
            "start": 1889465,
            "end": 1932630,
            "confidence": 0.7675129870129869,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was sind denn Millennials zur Definition? Also ich weiß es natürlich, ich bin ein Millennial, aber wie sind Millennials definiert? Diese Jahreszahlen fallen mir immer aus dem Kopf.",
            "start": 1933530,
            "end": 1943975,
            "confidence": 0.7074999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du bist auf jeden Fall unverschämt, weil du mir einfach reinsprichst. Das ist eine Frechheit. Aber ja, Millennials. sind die leute beziehungsweise die generation bezeichnet die zwischen 1981 und 1998 geboren sind und das sind irgendwas so zwischen 20 und 25 prozent von deutschland gerade so man sagt so 16 millionen leute warum.",
            "start": 1944015,
            "end": 1963969,
            "confidence": 0.751452830188679,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Eigentlich 81 warum nicht 80 bin ich jetzt 80 wenn ich 80 geboren bin bin ich schon kein millennial mehr ich finde es immer komisch diese harten harten katz aber okay sei mal dahingestellt ich.",
            "start": 1963989,
            "end": 1974997,
            "confidence": 0.6863428571428573,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bin noch knapp drinnen plus minus ein jahr keine ahnung auf jeden fall sind das die leute die jetzt gerade zwischen 26 und 40 sind also eigentlich mitten im digitalen zeitalter aufgewachsen sind klar haben die noch kasetten und wie man mit dem bleistift dann die kasette wieder aufrollt und so mitgekriegt und videokassetten kennen die auch noch und dvds ausleihen und so weiter ja, Inklusive Backstreet Boys, Spice Girls und NSYNC. Aber die stellen jetzt gerade so die Masse der Arbeitswelt. So und jetzt kommen aber, jetzt kommt aber die Generation Z hoch. Die rückt jetzt immer weiter nach. Generation Z ist nämlich die Post Millennial Generation. Und das sind alle Leute, die zwischen 1997 und 2012 zur Welt gekommen sind.",
            "start": 1975017,
            "end": 2015681,
            "confidence": 0.7767622950819673,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist schon ziemlich jung, 97. Ich habe gerade ganz kürzlich mit einer Dame gesprochen, die strategische Personalentwicklung macht, und habe sie nach ihrem Alter gefragt. Das mache ich natürlich immer.",
            "start": 2019037,
            "end": 2030340,
            "confidence": 0.7289032258064516,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Charmant.",
            "start": 2030400,
            "end": 2031560,
            "confidence": 0.713,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Mit dem Hintergrund, ob sie Millennial oder Gen Z ist. Und ich glaube, sie hat gesagt, 96, wenn mich nicht alles täuscht. Und sie hat sofort darauf gebocht, dass sie nicht Gen Z ist, sondern dass sie auf jeden Fall Millennial ist, weil sie hat noch Nokias verwendet, wo sie Snake draufgespielt hat. Also scheinbar, das ist der große Unterschied zwischen Gen Z und Millennial, ob du Nokia gucken noch kennst, wo man Snake drauf gespielt hat.",
            "start": 2031600,
            "end": 2056271,
            "confidence": 0.7599480519480522,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also je nachdem, wo ihr googelt, findet man natürlich andere Jahreszahlen mit Millennials und Gen Z und so weiter. Der Punkt ist aber ganz einfach, dass die Gen Z so aufgewachsen ist, wo das Internet schon fast Standard war. Das bedeutet, die Kommunikation läuft größtenteils über das Internet. und somit verändert sich natürlich auch die art und weise wie diese generation diese altersgruppen miteinander in kontakt tritt und wie man sich informationen beschafft und das ist natürlich der punkt wo das reale leben immer mehr mit dem digitalen zusammenschmelzen.",
            "start": 2056311,
            "end": 2085331,
            "confidence": 0.8669999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube das erste iphone ist 97 rausgekommen wenn ihr das richtig im kopf habt oder?",
            "start": 2085650,
            "end": 2090953,
            "confidence": 0.4166875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja gut aber wenn jetzt jemand von der generation z 1997 geboren wurde kriegt er nicht mit der geburt hallo hier ist die iphone und hier ist ihr vertrag.",
            "start": 2090973,
            "end": 2096436,
            "confidence": 0.5397931034482759,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Achso sorry 2007. Aber ist auch okay, weil wenn man zehn ist und dort reinwächst, dann hat man quasi diese Smartphone-Generation schon mitbekommen als erste Form der Kommunikation, der digitalen Kommunikation und ist darum also wirklich immer mit diesem digitalen Medium aufgewachsen. Ich komme ja aus der Zeit, wo man noch per Telefonzelle kommuniziert hat teilweise.",
            "start": 2096496,
            "end": 2123121,
            "confidence": 0.8167321428571428,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja auf jeden fall ist das halt genau die generation wir zum beispiel auch greta thunberg habe ich gerade mal nachgeguckt wird 2003 geboren ja also friday for future und allem drum und dran und diese generation set die kommt halt die strömt halt jetzt nach und nach auf den arbeitsmarkt. Und was macht es eigentlich so wertvoll diese diese altersgruppe so als generation set zu definieren das sind diese neuen werte diese personengruppe eigentlich mitbringt. Sowas wie Gesundheit, Freiheit und ganz besonders Individualität. Natürlich neben Freundschaft, Familie, Gerechtigkeit, Diversity und Multikulturalität. Und wenn man sich die Begriffe jetzt mal mit unseren zehn Attributen von Servant Leadership gegenübersetzt, dann merkt man da schon einen sehr, sehr großen Overlap. Gesundheit gegenüber Wohlbefinden, wie wir es gerade im Servant Leadership genannt haben. Also gesundes Arbeitsumfeld, ganzheitlich geführte Teams. Freundschaft kann man vielleicht sogar in diese, in den Punkt von Gemeinschaft bilden. Das bedeutet One-on-ones, Team-Events, das Miteinander fördern, auch außerhalb der Arbeit. Ich hatte gerade dieses Bierchen am Abend erwähnt. Aber natürlich auch Individualität und Freiheit. Also wirklich zu sagen, okay, ich treffe die Entscheidung hier und ich treibe das Projekt nach vorne und ich bin der Mann und die Frau hier im Pfarrersitz. Aber natürlich auch dieses Fokus auf die personelle Entwicklung. Ich möchte mich weiterentwickeln. oder wir wollen uns weiterentwickeln. All das sind halt wirklich Punkte, da wo die Gen Z wirklich einen direkten Draht zum Style-Service-Leadership hat.",
            "start": 2123558,
            "end": 2211855,
            "confidence": 0.8101008403361344,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder auch das ganze Thema zur 4-Tages-Woche zum Beispiel, der jetzt ganz heiß diskutiert wird überall. Das würde ich sagen auch in Millenials zu Hause, weil das vielleicht eher dann kommt, wenn man auch ein bisschen älter wird. Aber das ist auf jeden Fall jetzt ganz klar in den zwei Generationen, klar drinnen und gerade andere Generationen haben da oft Probleme zu verstehen, woher das eigentlich kommt, warum jetzt Leute plötzlich nur vier Tage arbeiten wollen. Und ich habe gerade kürzlich einmal gelesen, dass früher die gleiche Diskussion war, wie alle Leute noch sechs Tage gearbeitet haben. Also früher war es ja ganz normal, sechs Tage zu arbeiten und wie dann die nächste Generation gekommen ist, die plötzlich fünf Tage Arbeit gefordert hat, haben alle Generationen davor gesagt, wir haben alle sechs Tage gearbeitet. Warum will jetzt jemand plötzlich fünf Tage arbeiten? leben die nicht mehr für ihre Arbeit. Und genau das passiert jetzt wieder mit der Viertageswoche. Und ich glaube, sogar diese Generation Z, die lebt noch viel mehr für die Arbeit, aber vielleicht in einer genau definierten Zeit, weil sie eben auch private Dinge auch priorisieren. Aber in der Zeit wollen sie wirklich alles geben, sinnvolle Sachen machen, die für sie sinnvoll sind und dementsprechend da auch Sachen weiterbringen, die halt einen Sinn haben. Und da ist dieses, warum man etwas macht, dann auch wieder viel, viel wichtiger.",
            "start": 2211895,
            "end": 2285247,
            "confidence": 0.8316304347826081,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wenn man jetzt ein bisschen auf social media unterwegs ist oder vielleicht mal auch mal irgendwie das ein oder andere buch liest zum thema servent leadership dann kommt man um eine person eigentlich gar nicht so drum rum und zwar ist das simon sinek.",
            "start": 2285547,
            "end": 2297020,
            "confidence": 0.7914888888888888,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ihr habt gehofft wir schaffen eine episode ohne ihn oder du bist so ein fanboy von simon sinek. Der musste kommen.",
            "start": 2297081,
            "end": 2303307,
            "confidence": 0.5773809523809523,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich schaue ihm gerne zu, weil ich denke, dass er viele Bereiche besonders im Kontext geben, in klarer Kommunikation und so weiter, dass er da sehr, sehr gut ist. Auf jeden Fall, er ist halt so einer dieser, wie soll man sagen, Gesichter dieser ganzen Bewegung, weil er schreibt natürlich auch Bücher um das Thema. Seine Buchtitel laufen eigentlich schon genau in dieses Servant-Leadership-Thema rein. Ein Buchtitel ist Start with Why, ein anderer ist Leaders Eat Last, also Führungsleute essen als Letztes. Wolfgang ist ja nicht so ein riesen Fan von ihm. Ich finde halt, er kann jede Message relativ gut klar rüberbringen, deswegen schaue ich da gerne die Videos. Und wir verlinken auch mal einen 10- oder 12-minütigen langen TED-Talk von ihm in den Shownotes. Da geht es nämlich genau um dieses Konzept Start with Why und warum ist dieses Why, was mache ich hier eigentlich denn so wichtig und wie kommt man dazu. So jetzt haben wir schon wieder, ok wo kommt das jetzt her, beziehungsweise wo kommt das ganze Movement her. Aber jetzt kommen wir mal zu den harten Fakten. Vorteile haben wir schon relativ viel genannt. Wachstum der einzelnen Personen, Verantwortung übernehmen, tolle Arbeitsatmosphäre, ebenfalls eine bessere Arbeitsmoral. Teamzugehörigkeit und vielleicht hat die Teamzugehörigkeit sogar irgendwie sowas noch mit Retention, also wie lange arbeitet jemand bei einem Unternehmen. Alles tolle Vorteile. Was sind denn die Nachteile? Was ist denn der Scheiß an der ganzen Sache? Also wo kommt die Kritik aus dem Internet her?",
            "start": 2303347,
            "end": 2387903,
            "confidence": 0.8022096774193553,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das klassische Argument, was man immer hört, ist, dass Servant Leadership doch nicht für jeder Mann, jede Frau ist, weil es gibt Leute, die wollen keine Verantwortung, die wollen da am Fließband stehen und die wollen die langweilige Arbeit machen. Ich habe einen Kollegen, der ist Entwickler, der sagt auch immer, ich mache das für mein Geld und alles andere ist mir egal.",
            "start": 2388619,
            "end": 2408380,
            "confidence": 0.8324761904761906,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und ich finde das auch total in Ordnung ich habe gerade die Definition von Arbeit genannt Geld gleich der Auswasch von Zeit und Fähigkeit und ich finde das auch völlig in Ordnung wenn jemand sagt pass mal auf ich gehe zur Arbeit um die Miete zu zahlen. Nicht jeder muss die volle Passion da reinheben und allem drum und dran finde ich auch okay.",
            "start": 2408720,
            "end": 2425274,
            "confidence": 0.7648437499999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Übrigens als großer Verfechter von bedingungslosen Grundeinkommen muss ich da natürlich dazu sagen, man braucht zuerst das Geld, damit man überhaupt Arbeit leisten kann. Also man braucht zuerst das Geld und dann kommt die Arbeit. Weil sonst könnte man gar nicht arbeiten ohne das Geld. Das Geld, was man am Ende des Monats bekommt, das investiert man ja wieder für das nächste Monat, dann die Arbeit im nächsten Monat. Aber es ist wieder ein anderes Thema.",
            "start": 2426174,
            "end": 2446915,
            "confidence": 0.7947763157894739,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber was ich mich gerade frage, warum wird das jetzt hier als Nachteil dargestellt? Also nicht das bedingungslose Grundeinkommen, sondern dass jemand einfach nur seine Arbeit macht, um die Miete zu zahlen und Essen auf den Tisch zu bringen.",
            "start": 2446935,
            "end": 2455392,
            "confidence": 0.6432820512820513,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, die Frage, die sich mir stellt, ist, gibt es diese Leute wirklich oder haben die vielleicht bisher nur den falschen Leadership-Style erfahren oder arbeiten in der falschen Firma oder etwas, das ihnen zu wenig gibt? Haben die wirklich keine Motivation in keinem Bereich? Und die andere Frage, die sich mir immer stellt, auch wenn jemand so jetzt seinen Arbeitsplatz sieht, heißt es, man kann keinen Servant Leadership anwenden. Das eine und das andere schließen sich meiner Meinung nach nicht aus.",
            "start": 2455972,
            "end": 2483657,
            "confidence": 0.8308765432098767,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, also erstmal anwenden kannst du ja erstmal alles. Die Frage ist, wird das von deinen Teammitgliedern aufgenommen? Also ich meine, Servant Leadership bedeutet ja nicht, dass du die Persönlichkeit von jedem Teammitglied ändern musst, dass jeder voll mit Herzblut dabei ist. Also ob du diesen Leadership-Style annimmst oder nicht, obliegt ja immer noch dir als Teammitglied. Es ist auf jeden Fall so, dass meines Erachtens nach der Großteil von Servant Leadership immer vorteilhaft ist. Viel zuhören. Ich kenne keinen einzigen Nachteil. Es sei denn, da sitzt jemand, der will einfach nur direkte Anweisungen, so nach dem Motto, du machst jetzt das und wir gehen jetzt nach links und nicht nach rechts.",
            "start": 2483977,
            "end": 2518953,
            "confidence": 0.8052767857142855,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber auch dann frage ich mich, ob ich da in einem Team nicht jemanden finde, der das in irgendeiner Form bewerkstelligen kann. Jemand anderen, der dann vielleicht ein bisschen mehr Verantwortung übernimmt. Und im Team gleicht sich das dann glaube ich durchaus aus, weil das Team ja immer als Team auftritt und gemeinsam Dinge voranbringt. Und wenn da einer eher lieber einfach Task für Task abarbeitet, Ich glaube, ist das ja auch vollkommen in Ordnung und ist im Team-Gefüge dann durchaus möglich. Und der kann ja auch wachsen. Also ich kenne wenige Leute, die so ein Mindset haben, aber trotzdem nie wachsen. Und die haben sich auch weiterentwickelt und haben sich scheinbar weiterentwickeln wollen. Also ich sehe da nicht grundsätzlich irgendwie ein Problem da drin.",
            "start": 2519593,
            "end": 2557535,
            "confidence": 0.7739199999999997,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ne ne seh ich auch nicht, worauf du achten musst ist, dass du eine Balance hast. Du kannst jetzt nicht hier so eine komplette Disbalance an den Tag stellen und sagen, okay, der übernimmt nur das und der übernimmt nur das, weil dann hast du nämlich auch grad zwatzen Gap, wenn die eine Person mal nicht da ist oder die andere Person da ist. Oder du läufst sogar die Gefahr, dass du so eine Art Hero Culture aufbaust, dass der eine halt immer sehr viel Verantwortung übernimmt und dann die großen Projekte macht und immer so das Gesicht vom aus von top team nach außen ist und die anderen halt so ein bisschen runter gedrückt werden ja also da muss man halt schon ganz viele andere aspekte im blick behalten.",
            "start": 2558015,
            "end": 2592447,
            "confidence": 0.7694461538461537,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da sind wir halt wieder beim thema diversity aber das ist eher wie man das team zusammensetzt wenn jetzt lauter andy sind so ein team habt die wie hast du gesagt krokodil management oder krok.",
            "start": 2592467,
            "end": 2601339,
            "confidence": 0.7072857142857144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Crocodile Management, auftauchen, Klappe aufreißen, abtauchen.",
            "start": 2602420,
            "end": 2605464,
            "confidence": 0.7576666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, die immer das Maul aufreißen und nie was machen und auf die Straße bringen, dann hast du immer ein Problem, egal was du für ein Leadership-Style im Team anwendest.",
            "start": 2605504,
            "end": 2612573,
            "confidence": 0.7119,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es gibt aber auch noch Helikopter-Management.",
            "start": 2612633,
            "end": 2614716,
            "confidence": 0.8976666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist das sowas wie die Helikopter-Eltern?",
            "start": 2614756,
            "end": 2616838,
            "confidence": 0.5525000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, nee, das ist ein bisschen anders. Hinfliegen, Staub auf Wirbeln, wegfliegen.",
            "start": 2616879,
            "end": 2620363,
            "confidence": 0.7201666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist so die C-Level-Einstellung dann meistens. Im Meeting zu spät kommen, 30 Minuten, dann alles über den Haufen werfen, was besprochen worden ist, schlecht reden und dann wieder frühzeitig aussteigen aus dem Meeting. Soll es auch geben.",
            "start": 2620883,
            "end": 2634394,
            "confidence": 0.8172105263157896,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ein Nachteil, den ich auch mal selbst festgestellt habe, und der ist jetzt nicht nur im Servant Leadership, sondern auch im Lassie-Fair-Style vorhanden, ist Verantwortung abgeben. Für viele Leute ist es einfach nicht leicht, eine Aufgabe abzugeben. Vielleicht weil die super spannend ist und man will die vielleicht eigentlich selbst machen. Oder weil man schon genau weiß, wie man diese Aufgabe lösen würde. Aber dann gibt man diese Aufgabe ab und dann kommt eine Lösung zurück. Und die funktioniert auch und die ist auch perfekt. Nur sie wurde nicht so gelöst, wie du es. lösen würde. Und das habe ich sehr sehr oft gesehen bei Leuten, die gerade vom Individual Contributor zum Engineering Manager aufgestiegen sind. Kommt ein sehr spannender Task rein, die wissen noch genau wie er geht, würden den genauso machen und können einfach die Verantwortung sehr sehr schwer abgeben. Und das hindert natürlich voll und ganz die Weiterentwicklung des Teams und allem drum und dran.",
            "start": 2634435,
            "end": 2681741,
            "confidence": 0.798373417721519,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, das Problem ist ja auch, dass man mit anderen Lösungen plötzlich leben muss, weil wenn man irgendwas delegiert, dann bekommt man meistens eine Lösung, die anders ist. Die muss nicht schlechter sein, die muss nicht besser sein, die ist anders. Und alleine das ist schon immer eine Schwierigkeit, eine andere Lösung zu akzeptieren. Ich hatte mal einen Kollegen an der Uni, wir waren in einem Projekt gemeinsam, der hat den Code, den wir zwei beigesteuert haben, also die zwei anderen Leute im Team, Den hat er quasi immer gereviewt, hat er es genannt, aber von uns ist keine Zeile mehr übrig geblieben. Der hat einfach den gesamten Code rewritet. Vielleicht war es eine bessere Lösung, wahrscheinlich war es sogar eine bessere Lösung, aber vor allem war es halt eine andere Lösung und das war extrem schwierig für ihn, zumindest damals. das zu akzeptieren und der hat halt dementsprechend einfach einen Rewrite durchgeführt und dann zwischendrin war hin und wieder noch eine Zeile erkennbar von unserem Code. Und ich glaube, das ist extrem schwierig und das geht mir ja selber auch immer so, dass wenn man was abgibt, dass man auch damit leben muss, dass nicht das zurückkommt, vor allem wenn man eben so einen Leadership-Style hat, wie den Servant-Leadership-Style, dass man eben nicht autoritär oder im Micro-Management jedes einzelne Detail selbst klärt oder definiert, dass man dann einfach eine Lösung zurückkriegt, die anders ist. Man kann ja Feedback geben, man kann die ja weiterentwickeln. Das ist ja gut so in dem Code Review zum Beispiel. Aber man wird damit leben müssen, dass auch mal was anderes zurückkommt, auch super Ideen zurückkommen. Und das ist ja, glaube ich, die Stärke dann davon, dass du wirklich Sachen zurückbekommst, die eigentlich die besseren Lösungen sind. Sogar wenn sie anders sind und du im ersten Moment denkst, eine schreckliche Lösung. So hätte ich das nie gemacht und am Ende kommt man aber drauf, das ist die wesentlich bessere Lösung, die performantere Lösung, die saubere Lösung, besser wartbar oder war einfach die schnellere Lösung vielleicht als das, was man selber gemacht hätte oder es war einfach eine andere Lösung und die Person hat extrem viel dabei gelernt. Also da sind extrem viele Vorteile darin, aber es muss man lernen und das ist sehr, sehr schwierig und braucht Zeit und hat bei mir persönlich auch viel Zeit gebraucht.",
            "start": 2682933,
            "end": 2799609,
            "confidence": 0.818761421319797,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn man uns jetzt so zuhört, kann man vielleicht auch denken, okay, dieser Leadership-Style scheint irgendwie geschnitten Brot zu sein. Ja, also das muss ich jetzt machen. Was würdest du denn sagen, für wen ist denn dieser Style eigentlich nichts? Für welche Team-Konstellation? Für welches Umfeld? Wo würdest du sagen, okay, völlig falsch, hier Servant Leadership anzuwenden? Also wo passt es einfach nicht? Also ich denke so zum Beispiel, würdest du das zum Beispiel bei der Feuerwehr einsetzen? Also ich kann mir so vorstellen, ich werde zum Brand gerufen, der Doppelhaushälfte brennt. So und jetzt trinken wir erstmal ein Bier, damit wir erstmal schön Teamfeeling haben. Würdest du es also bei der Feuerwehr einsetzen?",
            "start": 2799869,
            "end": 2838541,
            "confidence": 0.7388947368421054,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder man diskutiert dann mal zehn Minuten lang in der Gruppe und macht ein Voting, wie man denn jetzt löscht am besten.",
            "start": 2838581,
            "end": 2843603,
            "confidence": 0.7204545454545453,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Demokratisch, sollen wir jetzt mit wasser löschen oder sollen wir den feuerlöscher rausholen mit diesem schaum oder staub oder was da drin ist.",
            "start": 2845243,
            "end": 2852446,
            "confidence": 0.7455652173913043,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Pulver heißt es nicht staub, mit staub löscht man weniger, staub brennt sogar sehr gut, ist auf dachböden sehr gefährlich übrigens, wenn der staub durchzündet.",
            "start": 2852786,
            "end": 2862030,
            "confidence": 0.7264400000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wieder was gelernt, nicht softwareengineering aber putzen euren dachboden.",
            "start": 2862050,
            "end": 2865832,
            "confidence": 0.6832222222222223,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, spinnweben am dachboden sind ganz gefährlich. Auf jeden Fall bei der Feuerwehr habe ich mir auch immer sehr lange gedacht, ist sowas überhaupt möglich? Ich komme ja von einer sehr kleinen freiwilligen Feuerwehr und wir haben da ein sehr gutes Zusammenleben und Teamkultur und es sind sehr viele akademische Leute darin, also es ist eine sehr spezielle Feuerwehr würde ich mal sagen. Und ich hatte mir immer überlegt, wir leben das eigentlich sehr gut, würde ich mal sagen, diese Art von Leadership-Style. Aber ist denn das wirklich möglich? Ist das auch bei anderen Militär zum Beispiel ein gutes Beispiel, ist das da überhaupt möglich? Und dann ist mir später mal ein Buch untergekommen, das sich nennt Turn the Ship Around. Wirklich sehr gutes Buch, wenn es um Leadership geht. Und der Autor ist ein Kapitän von einem Atom-U-Boot von der Navy. und hat im Prinzip so einen Laissez-faire oder Servant-Leadership-Style, wie man es auch immer nennt, eigentlich angewandt und hat es durchgesetzt bei der Navy, auf seinem Atom-U-Boot. Und hat es wirklich geschafft, dass das funktioniert. Er hat zum Beispiel so Sachen angewandt, wie dass Leute nicht fragen, was soll ich machen? Wir sehen jetzt da irgendwie ein fremdes U-Boot, was sollen wir machen? Sondern wir sehen ein fremdes U-Boot, ich würde vorschlagen, wir bleiben mal stehen oder keine Ahnung, was man so macht bei der Navy. Das heißt sofort einen Vorschlag dazugibt und der Captain sagt dann nur mal ja, gut oder perfekter Vorschlag, mach. Also der hat die Kultur komplett umgedreht, dass Leute von sich aus motiviert sind und schon Sachen vorschlagen und hat dadurch zum Beispiel die komplette Kultur umgedreht. Und ich würde mal sagen, wenn das bei der Navy funktioniert auf einem Atom-U-Boot, dann funktioniert das auch bei der Feuerwehr oder bei anderen Gruppierungen, wo man vielleicht glaubt, es muss hierarchisch sein. Natürlich, wenn es jetzt im Kriegsfall ist, wie man auch bei der Feuerwehr oft sagt, wenn es brennt, da muss dann natürlich eine Hierarchie da sein und da wird nicht lange diskutiert und da gibt es dann eine Hierarchie und man kann vielleicht noch mal sagen, hey Moment, wäre nicht vielleicht Lösung X besser, statt dem Wasser jetzt Schaum zu verwenden, das passiert in der Realität auch, Aber da wird natürlich nicht zehn Minuten lang rumdiskutiert, das muss schon auch klar sein. Aber alles rund um den Einsatz, und das nimmt ja viel viel mehr Zeit in Anspruch, da kann man dann diesen Servant Leadership durch und durch ausleben. Und auch im Firmenumfeld hat man ja so Incidents. Wir haben das ja in unserer Episode, verlinken wir gern, wo wir über Feuerwehr und Incident Ähnlichkeiten gesprochen haben. Da hat man ja auch immer diese Friedensfälle und Kriegsfälle, wenn ein Inzident ist, muss schnell reagiert werden, da muss man vielleicht starrere Hierarchien dann einhalten oder Ketten, die man befolgt oder Checklisten, aber die arbeitet man davor gemeinschaftlich aus und dann kann man sie natürlich auch im Einsatzfall besser befolgen und einfach hierarchisch sozusagen durchgehen oder das, was man vorbereitet hat. Also auch in diesen Bereichen ist meiner Meinung nach das durchaus möglich ich sehe jetzt keinen Bereich wo das irgendwie absolut unmöglich ist ich weiß nicht ob du dir irgendwas vorstellen könntest wo man sowas nicht umsetzen kann.",
            "start": 2866032,
            "end": 3047371,
            "confidence": 0.8075441176470589,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube umsetzen kann man das überall ich bin mir nur nicht sicher ob das überall sinnvoll ist ich denke da jetzt an so ein klassisches an so klassischen incident ja, in einem Incident-Kommando oder in einem Großschadensereignis, wie du es immer schön nennst. Natürlich kann man es da umsetzen, aber die Frage ist, ist das andere nicht effizienter? Ist ein Top-Down-Kommando von einem Incident-Commander nicht einfach deutlich effizienter in der Hinsicht? Weil da, sorry, aber in so einem Großschadensereignis geht's halt jetzt leider einmal nicht um das Wohlbefinden deiner einzelnen Teammitglieder. Ja, schon, natürlich auch, die sollen natürlich nicht verletzt werden. Aber die Priorität ist eigentlich dann, den Schaden kleinzuhalten.",
            "start": 3048071,
            "end": 3082709,
            "confidence": 0.7693153153153157,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das machst du dir ja im Vorfeld als Servant Leader aus und klar, dann schaltest du in diesen War-Modus und dort gelten dann andere Regeln. Aber das ist ja nur eine sehr kurze Zeit, wo es dann wirklich um Schnelligkeit geht, wo man eben nicht diskutiert, solche Sachen macht. Aber 90 Prozent der Zeit hast du ja nicht diesen Kriegsfall oder diesen Einsatzfall oder Inzident oder wie du es auch immer nennen willst. Sondern da hast du das normale Arbeitsumfeld und natürlich sprichst du nicht während einem Einsatz irgendwelche Varianten durch und machst ein Voting und ein demokratisches Voting, wie du jetzt löscht. Aber das heißt ja nicht, dass es deswegen dann nicht mehr Servant Leadership ist.",
            "start": 3083389,
            "end": 3122486,
            "confidence": 0.7930423728813559,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie ich schon sagte, ich glaube man kann das überall anwenden und integrieren. Doch ich bin mir nicht sicher, ob das alles immer so die beste Lösung ist, weil ich kann mir auch vorstellen, dass in manchen Situationen, wie zum Beispiel im Großstaatsereignis, ein autoritärer Führungsstil nicht vielleicht auch einfach mehr gewünscht ist. Also die Fähigkeit, natürlich auch sein Team zu verstehen, was jetzt gerade auch für sie das Beste ist oder was sie vielleicht sich sogar gerade wünschen, ist ja auch eine Kunst. Von daher, verstehe mich nicht falsch, ich bin ein großer Fan von Laissez-faire und Servant Leadership. Und ich bin bei weitem nicht autoritär, aber manchmal kann es auch einfach sein, okay Jungs, soll ich einfach bestimmen? Okay Team, soll ich einfach bestimmen? Oder kann ich einfach einfach ja sein, damit wir einfach jetzt mal hier Meta machen?",
            "start": 3122526,
            "end": 3166222,
            "confidence": 0.8146453900709223,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, und ich glaube, dass das vielleicht sogar der Unterschied zu Laissez-Faire auch ist, dass man eben da noch diesen Kontakt hat und reagiert, je nach Situation, nach Kontext, wo schnelle Entscheidungen braucht, wo man Zeit hat, über Sachen zu diskutieren und wo dann auch alle gemeinsam einverstanden sind, dass man in einem Krisenfall, in einem Fall, wo man schnell reagieren muss, dass das auch okay ist, dass wir einen CEO haben, der in dem Fall reagiert. Das ist ja auch vollkommen okay. Also ich glaube, dass das schon das Servant-Leadership-Modell in sich erlaubt, dass man das macht, auch wenn es oft so gesehen wird, dass das so laissez-faire ist und wir dürfen gar nichts mehr machen und ich muss alle mit Seidenhandschuhe anfassen und ich darf niemandem mehr sagen, was denn eine bessere Lösung ist oder ein Feedback geben. Ich glaube, es ist sogar sehr wichtig, Feedback zu geben, weil sonst hat man eigentlich diesen Wachstum, diese Entwicklung der Leute im Team gar nicht und das ist aber ein Fokus von Servant Leadership, den Wachstum, die Weiterentwicklung des Teams und dazu gehört Feedback und auch kritisches Feedback, weil wie soll man sich sonst weiterentwickeln.",
            "start": 3167022,
            "end": 3229603,
            "confidence": 0.828538461538462,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gegebenenfalls kommt es auch auf das Team selbst an. Wie erfahren ist das Team mit der Arbeit miteinander? Ich glaube, wenn du ein relativ neues Team hast, in Chaos-Situationen, nenne ich es mal, in Schadenssituationen, Servant Leadership anzuwenden, ist da vielleicht auch schwierig. Ich glaube, das Team muss sich schon sehr gut kennen und allem drumherum, sich vertrauen, vielleicht schon die Storming-Phase durchlebt haben, die vier Phasen oder fünf Phasen der Teamentwicklung. Hatten wir auch schon mal eine Episode darüber gemacht, verlinken wir auch in den Shownotes. Deswegen, also ich bin mir sicher, du kannst es überall implementieren. Ich bin mir nicht sicher, ob das in jeder Teamkonstellation wirklich so Sinn macht. Für Software-Engineering-Teams denke ich schon, dass über mittel- bis langfristig das ein sehr, sehr guter Weg ist, um die Leute wachsend zu sehen, eine Career-Progression nach vorne zu treiben und die Retention nach oben zu treiben. Es ist jetzt aber auch so, dass wir das mit sehr einfachen Worten alles beschreiben. In der Praxis ist es halt schon sehr, sehr harte Arbeit. Es bedarf Zeit. Es bedarf sehr viel Zeit, um einfach dich als Führungskraft hinzusetzen, nachzudenken und einfach mal zu beobachten. Und das ist in einem Office-Environment natürlich deutlich einfacher als in einem Remote-Environment. Aber da geht so die Hauptarbeit rein, meines Erachtens nach. Also falls ihr in diese Richtung mit eurem Team mal gehen wollt, setzt die Erwartungen ein bisschen runter. Erwartet nicht einen großen Change innerhalb von zwei Wochen. Das wird bei weitem nicht passieren. Sehr wahrscheinlich auch nicht in zwei Monaten. Sondern die ganze Sache braucht einfach ungemein viel Zeit. Und ihr werdet auch verschiedene Sachen ausprobieren müssen. Und irgendwann werdet ihr denken, okay, das könnte funktionieren. Weil, wenn ihr heute eine Aktion tätigt, als Führungskraft sieht man sie in der Regel im direkten Team so nach, würde ich sagen, zwei bis drei Monaten. Das bedeutet, all euer Impact basierend auf euren Aktionen ist halt delayed, wenn man so möchte.",
            "start": 3230063,
            "end": 3331732,
            "confidence": 0.7821226993865033,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also dieses Pull-Request-Deploy und wir sehen den 20% Improvement auf der Geschwindigkeit oder so, das gibt es halt leider im Leadership-Bereich nicht. Die 20% Improvement sieht man dann halt womöglich nach zwei Jahren oder so, wenn man einen Change durchführt unter Umständen. Das ist das Problem ganz allgemein, dass man keine Instant Gratification hat im Leadership-Bereich. Aber was du jetzt auch angesprochen hast, zuerst mit dem Feedback und dass man vielleicht unterschiedliche Formen finden muss, auch wie man Rückmeldungen gibt und dass es vielleicht unterschiedliche Szenarien gibt und auch die Weiterentwicklung, das wird nicht ganz so klar definiert. Da gibt es ja auch andere Modelle, Radical Candor zum Beispiel. Aber ich glaube, das ist schon fast eine eigene Episode wert, wie man denn gutes Feedback gibt und wie man da das richtige Environment schafft, damit Leute sich wirklich gut weiterentwickeln. Also ich würde vorschlagen, das lagern wir mal aus in eine andere Episode. Und falls ihr noch Vorschläge habt, was wir covern sollten, was wir jetzt vielleicht vergessen haben oder eure Meinung zu Leadership Topics oder auch zum Servant Leadership Modell, lasst uns das bitte gerne wissen bei E-Mail, bei Twitter, bei WhatsApp. Steht alles in den Show Notes, wie immer.",
            "start": 3332146,
            "end": 3399347,
            "confidence": 0.7944405940594065,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wenn ihr jetzt noch uns zuhört, freuen wir uns natürlich umso mehr. Vielleicht haben wir natürlich auch euer Interesse ein bisschen an dem Leadership-Style geweckt. In den Show Notes habt ihr ein paar interessante Links, die euch in den Leadership-Style ein bisschen einführen, aber auch ein bisschen Kritik dagegen setzen, weil es ist ja, wir sind halt nicht immer auf dem Ponyhof und es gibt sehr wahrscheinlich nicht die einzig wahre Antwort auf den richtigen Leadership-Style. Wenn ihr es mal ausprobieren wollt, nehmt euch ein bisschen Zeit, ist auf jeden Fall eine Journey.",
            "start": 3399667,
            "end": 3424389,
            "confidence": 0.7283723404255318,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und dann hätten wir noch eine kleine Bitte. Ihr könnt die Shownotes öffnen. Das ist dieser Text unten dran, unterhalb von der Beschreibung. Und dort findet ihr einen Daumen hoch und einen Daumen runter, wo ihr unsere Episode bewerten könnt. Einfach nur, war es eine gute Episode oder war es eine Episode, die so mehr war. Ein Klick ist ganz schnell und gibt uns einfach ein bisschen Gefühl dafür, was ihr denn so von den Episoden hält.",
            "start": 3424609,
            "end": 3451410,
            "confidence": 0.8114675324675326,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das war es von uns, bis nächste Woche und Tschüss.",
            "start": 3452131,
            "end": 3454679,
            "confidence": 0.6859999999999999,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7951240245261981,
    "audio_duration": 3462.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}