{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/c9b7f67b-5521-4cb1-ba03-274ba6cf6939/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "621r0eue7w-eb8e-4191-9722-baa0a2633f8e",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Weil ihr habt das auch oft miterlebt, wenn Leute dann mit ihrem Laptop gegenüber sitzen und du hast das Gefühl, denen gehst du einfach am Arsch vorbei. Das ist das Schlimmste, was es gibt.",
      "start": 208,
      "end": 8010,
      "confidence": 0.7496470588235296,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dein Vorgesetzter ignoriert jedes Feedback im One-on-One? Darf man beim 1on1 eigentlich Bier trinken? Wie erreicht man als Managerin das richtige Mindset für 1on1? Wer sich jetzt fragt, was eigentlich 1on1 sind und warum diese ein mächtiges Tool darstellen, sollte jetzt einmal auf Pause drücken und in unsere Episode aus dem März letzten Jahres reinhören. Dort geben wir einen guten Einstieg in das Thema. Danach gibt es in dieser Episode mehr Tiefe, denn wir beantworten Fragen aus der Community zu konkreten Problemstellungen rund ums 1on1 und wie man diese Challenges begegnen kann. Viel Spaß! Wolfgang, bei mir auf der Arbeit hat sich jemand einen neuen Drucker gekauft.",
      "start": 12672,
      "end": 53728,
      "confidence": 0.7843831775700933,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Moment, es gibt Leute, die kaufen sich noch Drucker?",
      "start": 53768,
      "end": 56150,
      "confidence": 0.7973333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In manchen Ländern ist das leider noch so, dass man ohne Papier halt nicht vorwärtskommt.",
      "start": 56190,
      "end": 61574,
      "confidence": 0.8921333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, das ist nicht vom Land abhängig, sondern eher von der Person.",
      "start": 61634,
      "end": 66278,
      "confidence": 0.643076923076923,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auf jeden Fall, diese Person ist auch Linux-User. Und die Person hat den Drucker gekauft, eingeschlöpselt, WLAN kurz an den Drucker konfiguriert, eingeschaltet und jetzt kommt's. Der Linux-Laptop hat den Drucker automatisch gefunden, er hat auf Print gedrückt und die Seite kam sofort raus. Jetzt meine Frage, ist 2023 das Jahr des Linux-Desktops?",
      "start": 66338,
      "end": 88329,
      "confidence": 0.8546226415094339,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es geht schon seit Jahren, Andi. Das ist nur, weil du deine Linux-Zeit irgendwie aus den 90ern oder so im Kopf hast. Es geht schon seit Ewigkeiten so. Ich hatte gerade selber kürzlich diese Erfahrung. Hat alles perfekt funktioniert. Und wie du ja weißt, bei unseren Aufnahmen, Sound funktioniert fast immer besser auf Linux als auf Mac.",
      "start": 89089,
      "end": 106637,
      "confidence": 0.7979824561403509,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du möchtest mir also sagen, 2023 kriegt Linux auch die Audio-Driver hin?",
      "start": 106657,
      "end": 111919,
      "confidence": 0.7134166666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Audio ist ein Traum. Schon seit Ewigkeiten auf Linux.",
      "start": 112019,
      "end": 115041,
      "confidence": 0.7912222222222222,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, und warum ist dieses Thema relevant für unsere heutige Episode? Relativ einfach.",
      "start": 115761,
      "end": 122326,
      "confidence": 0.8578461538461539,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt kommt der Überleitungskönig. Jetzt bin ich gespannt.",
      "start": 122366,
      "end": 125488,
      "confidence": 0.6736249999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie lange kennst du schon den Spruch? Das Jahr 2020, 2021, 2022 ist endlich das Jahr des Linux-Desktops. Wie oft hast du schon gehört?",
      "start": 125528,
      "end": 134835,
      "confidence": 0.741875,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, für mich ist jedes Jahr das Linux-Jahr, weil ich verwende seit jeher fast Linux. Zumindest seit den 2000ern.",
      "start": 135175,
      "end": 142261,
      "confidence": 0.7713684210526316,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In dieser Frage geht es eigentlich nicht um dich, sondern um das Betriebssystem Linux und um den Aufstieg gegen den Kampf des proprietären Microsofts.",
      "start": 142301,
      "end": 150488,
      "confidence": 0.8203333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also vielleicht als Funfact am Rande, ich habe einen Mittelständler als Kunde, der verwendet OpenOffice als Standard-Tool in der gesamten Firma. Also es wird besser, es geht in die richtige Richtung. Jetzt neulich hat die EU die ganze Cloud verboten, vielleicht wird jetzt NextCloud auch überall im öffentlichen Bereich und in Schulen eingesetzt. Ich sehe es in die richtige Richtung gehen. Ich glaube, es ist wirklich dieses Jahr soweit.",
      "start": 150848,
      "end": 174140,
      "confidence": 0.8269420289855073,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Komm mal aus seiner Bubble raus und sprich mal mit der Stadt München. Ich glaub, die sind von Microsoft weg, auf Open Office und so weiter umgestellt, und ich glaub, die sind inzwischen wieder bei Microsoft.",
      "start": 174420,
      "end": 183246,
      "confidence": 0.7878611111111111,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die waren einfach eine Spur zu früh, du wirst sehen. Jetzt ist es so weit.",
      "start": 183266,
      "end": 189070,
      "confidence": 0.6831333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "2023 sollte die Stadt München vielleicht noch mal das gleiche Projekt angehen. Aber warum stell ich die Frage, ist relativ einfach, weil das ein wiederkehrendes Problem ist. Und was ist noch ein wiederkehrendes Problem? Herausforderung in One-on-Ones. Denn ... Vor ca. einem Jahr haben wir in Episode 10 über das One-on-One-Meeting gesprochen und wir haben etliche Themen gecovert, wie z.B. die Begriffsdefinition und ob das ein Sure-Fix ist, ob das eine Zeitverschwendung ist oder einfach ein unnütziges Gespräch. Wir haben Tipps geteilt, wie man eine sichere Atmosphäre und Vertrauen schafft. Wir haben erklärt, warum man One-on-ones machen sollte. Wir haben ein paar Ideen gegeben, was man als individueller Contributor, also als Mitarbeiter, für Fragen stellen kann, wie man das One-on-one sinnvoll für sich gestalten kann und so weiter und so fort. Und im letzten Jahr haben wir immer und immer wieder, man könnte fast sagen jeden Monat, Fragen von Hörerinnen und Hörern bekommen, bezüglich spezifische Fälle in deren One-on-ones und wie wir damit umgehen würden.",
      "start": 189080,
      "end": 246888,
      "confidence": 0.8157333333333335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wir haben natürlich jetzt auch unsere ganz neue Community genutzt und haben mal gefragt, okay, was sind eure Fragen zu 101s? Und haben da wirklich super Fragen bekommen. By the way, Community-Link ist natürlich auch in den Shownotes, wie ihr da reinkommt. Und diese Fragen wollen wir heute auch mal besprechen. Und wir sehen das weniger eigentlich so als wir bekommen eine Frage und sind dann die Götter, die die beantworten können, sondern wir sehen das eigentlich eher als Peer-Coaching, was sehr klassisch ist in Firmen und es kann auch wirklich jeder in der Firma selbst machen. Es braucht nicht immer irgendwelche komischen Podcast-Hosts aus Österreich und Duisburg, die dann irgendwie gescheit vor sich hin schwadronieren, sondern man kann einfach Kollegen Peers auf gleiche Ebene fragen und Cases, Szenarien durchgehen und gemeinsam besprechen. Und genau das wollen wir auch in dieser Episode machen.",
      "start": 247508,
      "end": 298087,
      "confidence": 0.8415555555555554,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also eigentlich ist diese Episode so eine Art und Weise von asynchronem Peer-Coaching. Und asynchron, weil die Personen, die die ganzen Fragen gestellt haben, haben natürlich jetzt irgendwie keine Chance, hier mit in den Podcast einzusteigen und ihre Meinung dazu zu sagen. In der Vergangenheit haben Wolfgang und ich Erfahrungen mit synchronem Peer-Coaching gemacht. Was wir eigentlich gemacht haben ist, wir haben uns mit anderen Engineering-Managern in der gleichen Firma so alle zwei bis drei Wochen immer für eine Stunde getroffen in einem Meeting-Raum, in einem geschützten Raum. und haben Fälle besprochen, ähnliche Fälle, wie wir sie heute in dieser Episode besprechen.",
      "start": 298107,
      "end": 333455,
      "confidence": 0.8392549019607843,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Mit geschützten Raum meinst du jetzt nicht einen geschützten Raum, der abhörsicher ist, sondern geschützter Raum, dass wir uns einen geschützten Raum gegeben haben, dass wir das vertraulich behandeln.",
      "start": 333475,
      "end": 343110,
      "confidence": 0.8540344827586206,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, also ja und nein. Es war halt auch nicht in der Küche, sondern es war schon in einem geschlossenen Meetingraum, der vielleicht nicht höherdurchlässige Glasscheiben als Wände hat. Aber Sinn und Zweck dieses Peercoaching war eigentlich, jemand bringt einen Fall, mit dem er nicht unbedingt weiß, wie er oder sie umzugehen hat. Und wie Wolfgang schon sagte, es wurde nicht erwartet, dass die anderen dann die Lösung haben, sondern einfach nur ein bisschen Input geben, ein paar Ideen auf den Tisch legen, wie man damit umgehen könnte, beziehungsweise wie man Fortschritt mit diesem Fall machen kann. Und Fortschritt kann wirklich sein in alle Richtungen. Auf jeden Fall neuen Input sammeln, weil jeder Fall ist einzigartig und bei der Masse an Fällen gibt es gar keine richtige Antwort. Also es gibt nicht wie bei der Programmierung oder bei der klassischen Mathematik 2 plus 2 ist nicht 5.",
      "start": 343590,
      "end": 394145,
      "confidence": 0.8430000000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt hast du dir noch mal gerettet, dass du die Mathematik erwähnt hast, weil es gibt nur eine richtige Antwort bei der Programmierung, da wäre ich jetzt gleich drauf gesprungen natürlich. Aber du hast natürlich vollkommen recht, es gibt nicht die eine Lösung und das sind wir eigentlich im technischen Bereich gewöhnt und da gehen wir auch auf andere Entwickler zum Beispiel hin und fragen, Was denkst du zu dieser technischen Lösung? Würdest du es auch so machen? Hast du andere Ideen? Also in dem Bereich machen wir das schon. Wenn es aber dann um so Dinge geht wie One-on-ones, Manager-Dinge, wo es um sehr sensible Informationen auch geht, da traut man sich oft nicht. Und ich glaube aber, dass die Herangehensweise, einfach andere zu fragen, genau wie im technischen Umfeld auch, die wesentlich bessere ist, weil man halt einfach mit zwei Köpfen weiterkommt als mit einem Kopf üblicherweise.",
      "start": 394155,
      "end": 437483,
      "confidence": 0.8152214765100669,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Starten wir mal mit unserem heutigen Peer-Coaching. Wolfgang, welche Frage hast du uns denn mitgebracht, die wir hier besprechen sollen? Welcher Fall? Starten wir mal mit etwas Leichtem, vielleicht nicht mit sowas super kritischem.",
      "start": 437832,
      "end": 449029,
      "confidence": 0.7135588235294118,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also die Frage ist weniger ein konkreter Fall, aber Dirk hat uns gefragt, wie denn unsere Rituale, Formen aussehen, wie wir so 101 durchführen und vor allem, wo wir die durchführen, also was für Orte wir wählen, um 101 durchzuführen. Wir haben das in der damaligen Episode 10 schon ein bisschen angerissen, aber was ist denn dein Lieblingsort, Andi? Dirk hat, glaube ich, erwähnt, er geht gern durch den Wald spazieren für 101.",
      "start": 449327,
      "end": 473698,
      "confidence": 0.8134109589041094,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist natürlich ein bisschen schwierig in der neuen und in der alten Welt. In der alten Welt habe ich zum Beispiel in einem Büro gearbeitet, was am Düsseldorfer Medienhafen war oder direkt am schönen Rhein. Da ist es natürlich schon so eine super Sache, dass man einfach ein 101 bei einem sonnigen Wetter draußen als Spaziergang macht und dann sind wir oft zum Dönerschiff gelaufen. Das Dönerschiff ist ein kleines Schiff, was in einem kleinen Hafen am Rhein liegt, und die verkaufen da Döner, und dann haben wir da Mittag gegessen. Also, das ist natürlich schon eine ganz andere Atmosphäre für ein 101 und fand ich auch super mal zum Auflockern. Der Nachteil war immer, dass es relativ doof ist, da Notes oder Protokoll zu führen. Also, dass man, worüber man gesprochen hat, dass man das nicht wirklich aufschreiben konnte, weil du willst ja halt nicht auch die ganze Zeit am Handy hacken und dann einfach die ganzen Notizen aufschreiben. Das ist immer so der Nachteil.",
      "start": 473708,
      "end": 521452,
      "confidence": 0.7948922155688624,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gehirn wie ein Goldfisch.",
      "start": 522751,
      "end": 524173,
      "confidence": 0.7235,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eher zu viele Informationen und ich bin Fan davon, sie irgendwo abzulegen, um später zu erinnern, wo ich sie finden kann versus alles zu behalten, von daher.",
      "start": 524212,
      "end": 532337,
      "confidence": 0.8072962962962962,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, man muss halt schnell im Nachhinein dann ein Gedächtnisprotokoll verfassen, das ist meiner Meinung nach schon möglich. Ich habe das auch öfters gemacht, wobei das macht man auch nicht immer und oft sind es dann andere Gespräche, die man da führt, einfach durch die Bewegung, durch durch die andere Umgebung nicht in dem Raum irgendwie eingepfercht zu sein. Meistens waren es auch weniger kritische Themen, hat sich dann aber ganz gut entwickelt und irgendwie hatte da auch weniger dann den Need, alles genau detailliert aufzuschreiben und ganz harte Gespräche, wenn man irgendwie Probleme hatte, die habe ich dann auch meistens jetzt nicht im Freien geführt, sondern dann schon in einem Raum, um einfach da auch vielleicht ein offizielles Setting mehr zu haben. Und wenn wir gerade bei offiziellen Settings sind, was ich auch ganz oft gemacht habe und was aber sehr sehr kritisch ist und gefährlich, meiner Meinung nach, sind auch so Bier-101s. Das heißt, während man ein Bier trinkt, am Abend zum Beispiel, bei Trivago war das ja ganz klassisch, da ist man am Abend oft zusammengesessen bei einem Bier, dann hat sich da oft so ein 101 ergeben. Das war kein geschedultes 101, aber irgendwie hatte das dann schlussendlich eine Form von einem 101. Und warum sage ich da gefährlich? Also auf der einen Seite ist es sehr gut, wenn man einfach mal frei über irgendwas sprechen kann bei einem Bier. Aber man muss halt aufpassen erstens, dass das nicht geplant ist, kein offizielles Meeting. Das würde ich also nie bei einem Bier machen und das würde ich auch niemandem empfehlen. Das sollte schon irgendwie einen offiziellen Charakter haben. Aber man bekommt halt auch Dinge mit, die man sonst vielleicht nicht mitbekommt, weil die Leute einfach relaxter sind am Abend und vielleicht ehrlich mal ihre Meinung sagen. Das kann sehr hilfreich sein, aber auch da ist dann wieder die Schwierigkeit, man muss sich im Klaren sein, dass man Engineering Manager ist und immer noch in der Rolle da sitzt und man vielleicht auch ein Bier getrunken hat oder zwei Bier und das muss man einfach dann unter Kontrolle haben. Darum ist es eben so schwierig, auf dieser Gratwanderung nicht in die eine oder andere Seite zu fallen. Und darum ist es einerseits sehr wertvoll, so Bier 101 am Abend vielleicht, oder über Dinge zu sprechen, aber man muss halt auch sehr, sehr, sehr aufpassen. Wie siehst du das Ganze? Hast du so Gespräche geführt?",
      "start": 532637,
      "end": 662682,
      "confidence": 0.8189631449631449,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja habe ich in der Vergangenheit, hier und da mache ich sie auch noch, aber die große Herausforderung ist dabei natürlich die professionelle Distanz zu halten, weil du als Engineering Manager kannst das vielleicht noch oder beziehungsweise bist dir bewusst darüber. Die große Herausforderung ist, du kannst die Erwartungshaltung deines Gegenübers nicht steuern. wenn die Person sagt, oh, we are getting friends now, wir sind hier alles Familie, dann ist die professionelle Distanz gegebenenfalls nur von einer Seite und die andere Seite erwartet dann vielleicht was ganz anderes als Freundschaft und ähnliches. Also da muss man dann schon relativ klar werden, wo die Grenzen sind. Und wenn man dazu nicht in der Lage ist, diese klar zu kommunizieren, dann denke ich, Beer 101 sollte man von Anfang an lassen, weil sie dann eher ins Schlechte abdriften.",
      "start": 663062,
      "end": 709683,
      "confidence": 0.8083088235294112,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wie gesagt, ich glaube offiziell sowas Bier 101 zu nennen ist an sich schon schlecht und das geht so in die Saunaclub Mentalität, wo man sich dann irgendwas in der Sauna ausmacht. Also wenn das zufällig passiert, wenn man mal auch ein Gespräch über die Firma führt beim Bier, ist das okay oder über gewisse Dinge. Aber ich würde es eben nicht empfehlen, wirklich konkret zu sagen, okay wir machen unser 101 heute bei einem Bier oder so. Das würde ich auf keinen Fall machen.",
      "start": 710283,
      "end": 733578,
      "confidence": 0.764546511627907,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja gut solche sachen ergeben sich dann hier und da mal aber eine frage hätte ich an dich und zwar hattest du auch gesagt wenn ich das richtig verstanden habe diese location wo du das 101 machst schon so ein bisschen das thema auch so ein bisschen beeinflusst also so habe ich das zumindest verstanden würdest du zum beispiel bei einem bier 101 oder bei einem spaziergang am rhein oder im wald würdest du da kritische themen ansprechen die die andere person betreffen, so was wie Performance, so was wie vielleicht sogar eine Art negatives Feedback oder etwas negatives Verhalten, was du beobachtet hast oder ähnliches, oder sprichst du da nur die netten Dinge an?",
      "start": 733798,
      "end": 766955,
      "confidence": 0.7465043478260874,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist genau das, was ich zuerst gemeint habe mit, man muss wissen, welche Themen man dort anspricht und wo sich das Gespräch dann auch hin entwickelt. Ich würde zum Beispiel jetzt nie ein klassisches Review, 360 Review oder sowas bei einem Spaziergang besprechen, weil da braucht man glaube ich einfach Unterlagen, das sollte in einem ruhigen Setting, in einem Meetingraum stattfinden, wo man eben auch Notes machen kann, wo man genau sich gegenüber sitzt, wo man das Verhalten auch sieht von dem Gegenüber. Und wenn ich jetzt am Rhein spazieren gehe, dann kann ich schon mal kritischere Fragen stellen oder vielleicht auch probieren, so wirklich tiefer zu gehen. Was ist denn wirklich deine Meinung zu einem gewissen Thema? Vielleicht auch kritisch. Aber wenn es um wirklich harte Themen geht, würde ich einfach einen klassischen Meetingraum auf jeden Fall empfehlen, weil es hat dann einfach was Offizielleres und da ist das Setting dann einfach besser geeignet für so kritische Themen, meiner Meinung nach.",
      "start": 766995,
      "end": 818559,
      "confidence": 0.8173353658536587,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber kann das nicht auch schon so ein bisschen Angst schüren beim Gegenüber? Oh, heute kommt kein 101 am Rhein und am Wald. Das könnte zu 50 Prozent ein kritisches Thema sein.",
      "start": 818599,
      "end": 828407,
      "confidence": 0.7488750000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, wenn man natürlich sonst immer an den Rhein geht, ist es durchaus ein Punkt, aber es regnet ja auch hin und wieder. Also ich hatte nie das Problem, dass man da eigentlich zu oft im Freien war oder ständig im Freien war. Meiner Meinung nach hätte ich das sogar öfters machen können, war aber einfach durch den Zeitdruck und Meetings, die aneinander gelegen sind, teilweise auch einfach logistisch schwierig.",
      "start": 828427,
      "end": 848480,
      "confidence": 0.8046000000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich meine, du hast schon recht, wenn es wirklich um Performance Reviews geht, wo man wirklich Unterlagen braucht, dann ist es natürlich schon super, wenn man konzentriert irgendwo zusammensitzt. Das ist schon richtig. Auf der anderen Seite muss ich zugeben, ich habe auch schon bei so Walking One-on-One, nenne ich sie einfach mal, unabhängig, ob sie jetzt am Rhein oder am Wald sind, können auch durch die Stadt sein. dass man da schon mal kritische Fragen anspricht oder vielleicht Feedback gibt. Man muss das natürlich unabhängig von der Location relativ objektiv machen und nicht persönlich angreifbar, dass die Person dann relativ in so eine Abwehrhaltung fällt. Aber ich finde speziell beim Laufen ist das eine gute Sache, weil man dann vielleicht auch mal in einer anderen Umgebung ist.",
      "start": 848955,
      "end": 887657,
      "confidence": 0.8157519379844962,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was auf jeden Fall wichtig ist, meiner Meinung nach, ist, dass das immer in einem geschützten Raum stattfindet und wenn man da in der Öffentlichkeit irgendwo rumspaziert, dann ist das halt unter Umständen auch nicht so geschützt. Also klar habe ich hoffentlich eine gute Vertrauensbasis mit dieser Person, aber dort gehen halt vielleicht am Rhein auch andere Leute spazieren oder damals am Trivago Campus am Dach war eine Laufstrecke, da waren natürlich auch andere MitarbeiterInnen unterwegs oder auch wenn Wenn du in der Firma arbeitest mit tausenden Mitarbeitern und in der Umgebung mal spazieren gehst, dann wirst du ganz viele von diesen Leuten auch treffen. Und dann kannst du natürlich nicht über irgendwelche kritischen Themen sprechen, weil das hört einfach die Umgebung unter Umständen. Oder die Leute trauen sich nicht, weil man ständig irgendwelchen Leuten über den Weg läuft, die einen kennen. Also da muss man einfach in den geschützten Raum immer zur Verfügung stellen, einerseits auf der Vertrauensbasis, dass alles vertraulich behandelt wird, aber natürlich auch rein physikalisch, dass man in einem geschützten Raum ist. Wenn man einsam durch einen Wald geht, ist es okay, aber am Rhein mit tausenden Leuten kann es ein Problem sein.",
      "start": 888177,
      "end": 947601,
      "confidence": 0.8136700507614215,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, alle Leute, die öfters Bahn fahren, fangen jetzt ganz stark an zu lachen. Also wie viel ich schon bei Bahnfahrten über aktuelle Entscheidungen in irgendwelchen Vorständen von großen DAX-Konzernen gelernt habe. Es ist immer wieder spaßig, solchen Leuten laut beim Telefonieren zuzuhören.",
      "start": 947907,
      "end": 964485,
      "confidence": 0.8451818181818184,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also wenn man Insider-Trading machen will, setzt man sich am besten in die Bahn, oder?",
      "start": 964865,
      "end": 968550,
      "confidence": 0.7426666666666668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, hundertprozentig, hundertprozentig. Aber ich meine, das gilt ja immer so. Das bedeutet, seid euch bewusst, über was ihr sprecht, welche Daten ihr in der Öffentlichkeit kommuniziert, sei es an eurem Bildschirm, sei es in One-on-One, sei es in Telefonaten. Es gibt immer jemanden, der links und rechts mithört.",
      "start": 968570,
      "end": 982448,
      "confidence": 0.752326530612245,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie machst du das eigentlich, Andi, jetzt in der neuen Welt, wenn du remote bist? Hast du da auch irgendwelche speziellen Formen, Orte? Oder gehst du durch den Park spazieren mit einem Handy in der Hand? Ich hatte mal kürzlich einen 101 mit jemandem, der einfach durch den Park spaziert, währenddessen remote. Und ja, wir waren einfach per Handy verbunden. Hat eigentlich auch ganz gut funktioniert.",
      "start": 982968,
      "end": 1004575,
      "confidence": 0.7937272727272727,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, in der neuen Welt ist das natürlich alles ein bisschen schwieriger. Die Kunst ist hier, glaube ich, nicht, das Setup mal zu wechseln, weil das Setup ist für beide irgendwie gleich. Nämlich, Minimum man hört sich, im Optimalfall sieht man sich auch noch. Da geht's, glaube ich, eher auf jeden Einzelnen, wo die Person sich gerade befindet, dass man selbst mal ein bisschen die Umgebung wechselt. Also, ich bin jetzt natürlich sehr oft in meinem Büro, das bedeutet, meine Umgebung ist dann in der Hinsicht immer gleich. Bei schönem Wetter gehe ich mal mit dem Hund raus oder ähnliches oder in den Garten und mache das One-on-One von da. Aber du hast es schon angesprochen, dann ist man unterwegs, man muss sich auf andere Sachen konzentrieren, man muss sich um seine Umgebung konzentrieren. Wenn ich mit dem Hund draußen bin, muss ich mich auch auf meinen Hund konzentrieren und das finde ich immer ein bisschen schwierig. Da muss man ganz genau aufpassen, dass man beim One-on-One trotzdem 100% fokussiert ist auf das Gespräch. Weil es kann nämlich sehr sehr schnell negativ angesehen werden von der anderen Person, dass man selbst, weil man draußen ist, spazieren geht, gar nicht auf das Gespräch fokussiert ist, weil man halt auf seine Umgebung achten muss. Und das finde ich schon irgendwie disrespektvoll. Also das ist schon, das finde ich wirklich wirklich schwierig, weil das One-on-One ist ein Gespräch zwischen zwei Personen, wo es eigentlich in der Regel um den Individual Contributor geht. Und wenn dann der Manager draußen spazieren geht und sich mehr auf seine Umgebung orientiert oder auf seine Kinder oder auf seinen Hund oder auf was weiß ich nicht, dann fühle ich mich nicht wirklich ernst genommen. Dann denke ich mir, hey, das ist hier mein Gespräch und ich will jetzt hier richtige Antworten. Ich möchte ein gutes Gespräch haben, weil das Ganze soll mich als Individual Contributor weiterbringen. Und die Person sieht das als auch nur eins dieser regulären Meetings. Dann stelle ich mir schon die Frage, ob das hier nicht gerade verschwendete Zeit ist. oder ob wir das 101 nicht einfach verschieben sollten?",
      "start": 1004835,
      "end": 1108806,
      "confidence": 0.8043700564971752,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man das natürlich früher auch hatte, natürlich weniger, weil man selten Kinder oder vielleicht einen Hund dabei hatte, wobei Hunde waren im Office ja doch hin und wieder irgendwo unterwegs. Wenn man dann mit einem Hund spazieren geht und 101 gleichzeitig macht, Wie gesagt, das müssen halt alle einverstanden sein, man muss echt im Klaren sein, wo die Priorität liegt. Aber vielleicht macht es natürlich das Remote-Setup nochmal schwieriger. Und das sollte meiner Meinung nach technisch halt funktionieren, wenn man dann ständig irgendwelche Bandbreitenprobleme hat. Aber gut, die kann man daheim auch haben am Schreibtisch, also die gibt es eh immer.",
      "start": 1108846,
      "end": 1140330,
      "confidence": 0.768607843137255,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ich aber wirklich, wirklich ernst meine, falls ihr uns gerade zuhört und ihr findet euch da wieder, dass euer Manager oft draußen spazieren geht oder generell nicht oft bei der Sache ist oder auch gern im Slack schaut oder E-Mails checkt und so weiter, sprecht das an. Ich finde das wichtig, anders ändert sich das nicht. Wie kann man sowas ansprechen? Hey, kann ich dir mal ganz kurz Feedback geben? Ich habe das Gefühl, du bist gar nicht so wirklich bei mir beim gespräch und das erweckt bei mir den anschein dass dieses gespräch nicht für dich wichtig ist wie wie stehst du dazu das ist einfach eine offene frage und du du drückst dein gefühl aus was niemand sagen kann oh das ist nicht so weil so fühlst du ja, Und so kann man das ganz langsam ansprechen, weil ich finde, das ist wirklich, wirklich wichtig. Und das setzt dann auch eine Erwartungshaltung beim Gesprächspartner, dass dieses Gespräch von dir ernst genommen wird und dass du erwartest, dass das von der anderen Seite ebenfalls ernst genommen wird. Weil ansonsten ist das einfach meines Erachtens nach nur ein weggeworfenes 30-Minuten-Gespräch, was wir beide sinnvoller nutzen können.",
      "start": 1140610,
      "end": 1201768,
      "confidence": 0.8269137055837563,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also das ist, glaube ich, ein super Punkt, weil ihr habt das auch oft miterlebt, wenn Leute dann mit ihrem Laptop gegenüber sitzen und du hast das Gefühl, denen gehst du einfach am Arsch vorbei. Das ist das Schlimmste, was es gibt. Oder vielleicht noch extremer, er hatte einen Kollegen, das war noch zur Uni-Zeit, der hatte einen 101 und das Gegenüber ist einfach eingeschlafen. Das ist dann, glaube ich, wirklich die Hardcore-Sache schlechthin.",
      "start": 1202248,
      "end": 1222289,
      "confidence": 0.710810810810811,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Heutzutage hat einfach keiner mehr Zeit. Punkt aufs Ende. Und wenn ihr solche One-on-Ones habt, dann denke ich, es ist besser, diese One-on-Ones komplett zu canceln, anstatt euch durch jede Woche oder alle zwei Wochen nur die halbe Stunde zu quälen. Oder ihr habt den Mut, sprecht das einmal an. Ja, das mag vielleicht wie ein Schlagwort von Halt sein, aber der Punkt ist, wenn ihr Value aus einem One-on-One wollt, dann müssen beide da sein. Und dann müssen beide sich aufs Gespräch fokussieren.",
      "start": 1222529,
      "end": 1250357,
      "confidence": 0.8312619047619046,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei, ich muss schon sagen, es ist dann ziemlich hart, wenn du da drin sitzt und dein Manager ständig auf den Laptop schaut, dass du dem das ins Gesicht sagst. Ist echt schwierig, muss man schon auch sagen. Ich find's einfach extrem respektlos, wenn das Manager machen, aber ich hab's leider auch miterleben müssen. Und vielleicht kann man ja irgendwas anmerken oder wie du eben sagst, einfach mal sagen, wie man das empfindet, das ist vielleicht immer das Beste.",
      "start": 1250677,
      "end": 1274667,
      "confidence": 0.8023164556962027,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Den Manager direkt darauf anzusprechen, ist 25-mal besser, als zum manager vom manager zu gehen und das zu petzen so gibt man dem gegenüber wenigstens die chance was zu verbessern ja natürlich ist es hart verstehe ich aber was ist die alternative du kannst auch jedes 101 absagen mit oh ich habe nichts zu besprechen oh ich habe nichts zu besprechen löst nicht das problem du willst ja dass sich etwas zum guten ändert Ja, ich glaube.",
      "start": 1275028,
      "end": 1299373,
      "confidence": 0.7976883116883119,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist auch etwas, was man einfach lernen muss, dass man direktes Feedback gibt, auch nach oben. Und es ist extrem schwierig, aber auch sehr wirksam und sehr, sehr mächtig. Aber wenn wir jetzt gerade bei Kritik nach oben sind, da haben wir eine sehr interessante Frage bekommen. Wir sagen jetzt auch keinen Namen. Und zwar, was soll man denn machen, wenn die konstruktive Kritik vom Vorgesetzten nicht ernst genommen wird? Das heißt, man gibt konstruktive Kritik, Feedback, sagt, wie es besser wäre, wo die Probleme liegen, und man wird aber nur abgespeist. Man bekommt vielleicht ein Ja, das werden wir verbessern, aber es passiert dann nichts oder es wird nur kurz besser und der Manager verfällt dann aber wieder nach ein, zwei, drei Wochen wieder ins alte Muster. Und um das Ganze auch noch konkreter zu machen, anhand eines Beispiels, das glaube ich auch sehr oft in ganz vielen Firmen auftritt, ist, wenn der Manager zum Beispiel an ganz vielen Baustellen tätig ist. Das heißt, der ist überall ein bisschen involviert, vielleicht micromanage da auch in die eine oder andere Sache hinein. Und man will dem Manager eigentlich sagen, hey, du musst dich auf deine Hauptmanager-Tätigkeit fokussieren und nicht überall ein bisschen machen und dich überall einmischen und dann extrem viel Chaos verursachen. Und man will das jetzt dem Manager mitteilen, dieses Feedback geben, so dass er es am besten akzeptiert. Wie willst du es machen?",
      "start": 1299413,
      "end": 1382100,
      "confidence": 0.8404219409282694,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich finde die Frage schon sehr schwierig. Der Grund ist ganz einfach, was du jetzt gerade sagst ist, ich als IC sehe, dass der Manager einen falschen Job macht. Das bedeutet, du weißt es eigentlich besser als dein Manager und allein das ist schon schwierig und gegebenenfalls sogar schon eine falsche Annahme. Weil die Person über dir, die ist ja irgendwie da in diese Stelle gekommen. Also eigentlich hört sich das so an, als weißt du besser, wie man den Job über dir macht, als er oder sie.",
      "start": 1382120,
      "end": 1410174,
      "confidence": 0.845159090909091,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was mich als Manager dann automatisch in die Abwehrhaltung bringt, weil du dir was anmaßt, wo du vielleicht den Überblick gar nicht haben kannst. Vielleicht hast du ihn auch, vielleicht ist es auch vollkommen richtig. Aber ich als Manager würde sofort in eine Abwehrposition gehen oder mir denken, warum sagt mir jetzt der aus dem Team, wie ich es besser machen soll.",
      "start": 1410234,
      "end": 1429261,
      "confidence": 0.7982741935483874,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, du bist halt mehr oder weniger angegriffen und ich stelle mal eine herausfordernde Gegenfrage. Weißt du, welche Erwartungshaltung an deinen Vorgesetzten von ihrer Vorgesetzten gestellt wurden? Und solange du das nicht weißt, kannst du nicht sagen, du erfüllst die Erwartungen oder nicht. Und das ist eine ganz schwierige Situation. Das, was du jetzt gerade möchtest, Als Individual Contributor, als Engineering Manager zu deinem Abteilungsleiter oder Abteilungsleiterin ist ja eigentlich, dass diese Person sich gegebenenfalls mehr den Themen widmet, die du als wichtig ansiehst. Das ist, was ich so ein bisschen daraus höre.",
      "start": 1429663,
      "end": 1466448,
      "confidence": 0.8404193548387098,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, das ist auch der Punkt, die Erwartungshaltung, die du angesprochen hast, weil als Manager hast du zwei Erwartungshaltungen abzudecken. Einerseits von deinem Manager, von deiner Managerin, die über dir ist, und natürlich von deinem Team. Und ich glaube, darauf muss man aufbauen, wenn man jetzt als IC in dem 101 dem Manager mitteilen will, hey, du arbeitest an zu vielen Baustellen. Weil da geht es um die Erwartungshaltung für mich als Teammitglied. Und ich als Teammitglied fahre normalerweise am besten, wenn ich genau auf diese Erwartungshaltung eingehe und sage, okay, du als Manager, für mich als Teammitglied erfüllst die Erwartungen, wenn XYZ. Und XYZ ist wirklich das, was mich im Alltag betrifft. Das heißt, wo liegt für mich als Individual Contributor das Problem, wenn du an 18 Baustellen arbeitest? Und da sage ich dann nicht, weil du in dem anderen Projekt auch noch mitmischst, weil das ist ja nicht mein Problem, was du eigentlich machst. Sondern ich sage, für mich ist es ein Problem, wenn du nicht verfügbar bist, weil du an Projekt XY auch noch mitarbeitest oder deine Zeit verbringst. Aber für mich als Person oder für uns als Team, aber noch besser für mich als Person, wäre es wichtiger, wenn du in der letzten Woche da gewesen wärst bei dem Task XY, wo ich ein Problem hatte, da hätte ich deine Hilfe gebraucht, dich als technischer Ansprechpartner, damit unser Team besser funktioniert, damit ich nicht geblockt gewesen wäre. Und wenn der Manager dann schlau ist, dann versteht er, okay, er verbringt zu wenig Zeit mit dem Team. Und am Ende, dass er vielleicht zu wenig Zeit hat, weil er in zu vielen Projekten drinnen ist. Aber es ist viel einfacher als Manager, dieses Feedback aufzunehmen, wenn man nur hört, eine Person hat ein Problem. Man muss einer Person helfen im Team, weil das ist die Aufgabe des Managers. Wenn man vorgeworfen bekommt, was man nicht alles falsch macht an x verschiedenen Baustellen, wo man vielleicht gar nicht den Überblick hat, dann geht man in eine Abwehrhaltung. Und sonst kann man das, glaube ich, wesentlich besser aufnehmen, dass man sagt, okay, ich muss versuchen, dieser Person mehr zu helfen, mehr da zu sein, mehr Zeit zu verbringen und da einen Schwerpunkt draufzulegen.",
      "start": 1467150,
      "end": 1592135,
      "confidence": 0.8326506666666661,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du sprichst da genau über einen meiner favorisierten Kommunikationstricks. Immer wenn du sagst, du, du, du, du, du, dann schmeißt du den Ball über die Wand und machst jemandem Vorwürfe. Finde ich immer schwierig, weil du bestimmst irgendwie nicht, wie diese Vorwürfe gegenüber angenommen werden. Negativ, positiv, dankend. Ja, da gehen wir mal auf das Kommunikationsmodell vier Seiten einer Nachricht zurück. Könnt ihr mal googeln, falls ihr das gerade nicht im Kopf habt. Punkt ist aber, alles das, was du sagst, du bestimmst nicht, wie dieser Satz angenommen wird. Was du aber immer, immer, immer machen kannst, ist, wenn du in die Kommunikation auf dich fokussierst, hey, wenn du das machst, fühle ich so und so und das hat die Auswirkung A, B, C. dann kann niemand sagen, ist nicht so. Weil der Clou ist ja, du beziehst das ja komplett auf dich, und niemand kann sagen, wie du dich dabei fühlst. Und das ist so eine Art Kommunikationstrick, was ich gerne anwende. Um auf dein Beispiel zurückzukommen, kann man sagen, hey, ich hab letzte Woche dieses Thema angesprochen. Ich hab so das Gefühl, ich könnte da ein bisschen mehr Support gebrauchen oder ein bisschen Management Sponsorship. Was hilfreich wäre, wenn du zum Beispiel mal mit in dieses Meeting kommst und noch mal die Erwartungshaltung an dieses Projekt nochmal erklärst für alle. Das sind in der Regel so konkrete Aufgaben und wirklich Wünsche, die du dann an deine Managerinnen und deinen Manager ansprichst. Und da kann man dann eigentlich gar nichts sagen. Und natürlich adressiert das nicht 100 Prozent deiner Erwartungshaltung, dass deine Vorgesetze auf zu vielen Baustellen rumtouren. Aber da ist die Frage, solltest du das genau lösen? Denn, also ist das wirklich dein Problem? Was ich so ein bisschen raushöre ist, was so mir ein bisschen unklar ist bei dieser Anmutung ist, warum ist das denn ein Problem für mich, dass meine Vorgesetzte auf zu vielen Baustellen rumhängt? Und das führt mich zu der Frage, sind die Erwartungshaltungen, die an mich gestellt wurden, eigentlich für mich klar? Denn wenn ich meine Erwartungshaltung nicht erfüllen kann auf Basis der Arbeit meiner Vorgesetzten, dann muss ich in diese Konversation gehen. Da muss ich sagen, vor drei Monaten wurde die Erwartungshaltung an mich gesteckt. den Rewrite unserer Payment-Plattform neu zu gestalten. Ich fühle mich in der Ausführung dessen geblockt, wegen Thema ABC. Was mir helfen würde, die ganze Sache weiterzutreiben, wäre DEF. Und so, dann kann man natürlich die Antwort kriegen, hey, ich hab da gerade echt keine Zeit für. Dann kann man aber direkt sagen, okay, dann kann ich meinen Erwartungen hier nicht gerecht werden.",
      "start": 1592415,
      "end": 1735336,
      "confidence": 0.8076482758620687,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist übrigens auch eine ganz gute Frage, die man auf Managerseite in 101 stellen kann, wie zufrieden denn das Teammitglied ist mit der Zeit, die man mit dem Team verbringt, wie involviert man ist, wie technisch involviert man ist. Also gerade bei größeren Teams, wo man vielleicht auch nicht tagtäglich mit den Leuten zusammenarbeitet, ist es glaube ich eine wichtige Healthmetric, die man immer wieder mal abfragen sollte mit den Leuten. ist man genug da, mischt man sich genug ein, zu wenig ein, je nach Person ist es unterschiedlich, wie seniorig die Person ist, kommen da auch andere Rückmeldungen. Aber diesen Punkt immer wieder mal abzufragen und abzuchecken und auch mitzutracken, kann sehr, sehr hilfreich sein als Manager, um da den richtigen Mittelweg für jede Person zu finden.",
      "start": 1735776,
      "end": 1782473,
      "confidence": 0.8390077519379848,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin immer ein Freund davon, solche Fragen ein bisschen konkreter zu formulieren, weil solche high-level generellen Fragen, die kannst du sehr erfahrenen Leuten stellen, die kannst du Leuten stellen, die sehr redefreudig in One-on-One sind, aber nicht Leuten, die sehr geschlossen sind, die du dir wirklich zum Öffnen bringen musst. Eine konkretere Version dieser Frage wäre eigentlich, auf welchem Thema sollte ich mehr Zeit verbringen und auf welchem Thema sollte ich weniger Zeit widmen? Also wirklich konkret nach Themenbereiche fragen und nicht, verbringe ich genug Zeit mit dem Team? Das ist eine schwierige Frage, weil da wüsste ich gar nicht, aus welchem Aspekt denn. Ja, du warst letzte Woche beim Team-Event nicht da. Oder, ach ja, du kommst immer zu spät zum Stand-up oder ähnliches. Sondern wirklich, was ist denn das Thema, wo ich weniger Zeit verbringen sollte? Das ist nämlich eigentlich eine Frage auch so, in welchem Thema würde das Team denn mehr Flexibilität wünschen? Und das kann dich natürlich zu dem Gedanken bringen, micromanage ich das Projekt jetzt gerade hier oder ähnliches.",
      "start": 1782513,
      "end": 1836402,
      "confidence": 0.7741485714285714,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn wir jetzt aber so lange über die Kommunikation schon gesprochen haben, wir haben auch eine andere Frage bekommen von Christian, die interessiert hätte, wie wir die 101s aufbauen, ob das mehr formalisiert ist oder so ganz klassisch freischnauzig gehandhabt wird von beiden Seiten. Wie legst du deine 101s so an?",
      "start": 1836989,
      "end": 1853881,
      "confidence": 0.8575294117647061,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich gehe nie in 101s, ohne zu wissen, was ich besprechen werde. Das bedeutet, ich habe immer eine Baseline an Vorbereitung.",
      "start": 1853921,
      "end": 1860325,
      "confidence": 0.8181428571428571,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Egal auf welcher Seite du sitzt.",
      "start": 1860365,
      "end": 1861626,
      "confidence": 0.7583333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich habe zum Beispiel einen Weekly Reminder zwei Tage vorher für das One-on-One mit meinem Vorgesetzten. Der Reminder sagt, Themen fürs nächste One-on-One niederschreiben. Dann schreibe ich die in unser gemeinsames One-on-One-Dokument und schicke sie kurz per Slack. Hey, ich habe gerade diese zwei Themenpunkte fürs nächste One-on-One aufgeschrieben, über die würde ich gern reden. Und ich bringe da alles auf den Tisch, von Erwartungshaltung an mich bis über meinen aktuellen Workload, dass ich ganz klar sage, in der letzten Woche kamen fünf Themen auf. Das ist mein aktueller Workload. Ich kann die nicht alle handeln. Welche Themen nimmst du raus? Oder ich würde dich bitten, jemand anders für dieses Thema zu suchen und so weiter. Und so pushe ich aktiv Themen weg von mir, auch um ein bisschen mich zu schützen. Thema Burnout, Thema Work-Life-Balance, aber auch natürlich, um meinen Erwartungshaltungen gerecht zu werden. Oder ich stelle Fragen, siehst, wie mein Manager die Interaktion zwischen mir und meinen direkten Peers sieht. Das bedeutet, sind wir ein Team oder sind wir eine Gruppe? Und diese Frage zwischen den Zeilen sagt eigentlich, solltest du nicht gegebenenfalls ein bisschen mehr für unser Teambuilding tun? Also solche Themen bringe ich da auf. Oder, hey, wie sieht denn unsere Headcount-Planung für das nächste Jahr aus? Mit was können wir rechnen? Oder ich frage, welche Themen hast du auf deinem Tisch, die ich dir abnehmen kann, damit du mehr Zeit für die strategischen Themen hast? Wie zum Beispiel einen Leveling-Guide oder ähnliches. Also ich hole mir halt schon immer immer Fragen raus, aber ich habe auch immer ein, zwei Fragen, die ich mit meinen Direct Reports anspreche. Und die Vorbereitung ist bei mir nicht immer eine Stunde für ein One-on-One, ganz so gar nicht. In der Praxis sieht das so aus, so 10 Minuten, Viertelstunde vorher schaue ich mir die vorherigen One-on-One-Notes an, von dem letzten One-on-One. Sprich, gucke mir, welche Action-Points wir definiert hatten. Das sind immer gute Themen für ein Follow-up. Und ich spreche immer wieder an, Wie sieht denn die persönliche Entwicklung von dieser Person aus? Wie ist der aktuelle Workload? Fühle mal ein bisschen vor, ob die Person Ambitionen hat für eine Beförderung. Das bedeutet von Mid-Level-Engineer auf Senior, Senior to Staff und so weiter. Dann arbeiten wir zum Beispiel an einem Skill-Mapping. Okay, du bist aktuell Senior-Engineer. Du hast Ambitionen auf eine Promotion, auf einen Staff-Level-Engineer. Wie siehst du denn deine Skills im Bereich Public Speaking? Wenn das jetzt ein Attribut ist, was für Staff-Engineers relevant ist. Und dann sprechen wir darüber. entwickeln wir zusammen Entwicklungspläne, etc., etc. Und sowas macht man nicht immer eine halbe Stunde. Das ist ein Thema, was du über etliche One-on-One ziehen kannst. Der Punkt ist aber, ich gehe in jedes One-on-One rein, frage, was sind die wichtigen Themen, die du gerne mit mir besprechen würdest, und wenn dann nichts kommt, dann packe ich immer meine zwei, drei Fragen aus, mit denen ich dann das One-on-One starte.",
      "start": 1862041,
      "end": 2024055,
      "confidence": 0.7957667342799191,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich glaube, die Vorbereitung ist nicht zu unterschätzen, aber im Idealfall merkt man im 101 gar nicht, dass da vielleicht viel Vorbereitung dahinter steckt, weil sich das einfach sehr natürlich anfühlt und weniger eben formalisiert, dass man sagt, da Punkt 1 im 101 ist immer dieser, dann kommt Punkt 2, dann kommt Punkt 3. Wir arbeiten jetzt irgendwie eine harte Liste. Ab, auch wenn es im Hintergrund vielleicht so ist und man das in den Notes so drin hat, es soll trotzdem meiner Meinung nach zumindestens immer wie ein freies Meeting wirken und es soll auch immer Freischnauze meiner Meinung nach erlaubt sein. Das heißt, man kann auch mal eben sich über Sachen beschweren, einfach Sachen reinbringen. unstrukturiert. Man kann ja dann darüber reden. Das ist ja dann die Aufgabe auch als Manager, das mehr zu strukturieren, das Ganze in eine Form zu gießen, wenn da irgendeine Beschwerde kommt, wenn es Probleme gibt, dass man eben darüber spricht, dass das schon möglich ist und nicht irgendwie einen Charakter von einem Performance Review hat, was vielleicht genau formalisiert aufgebaut ist. Also diese Freiheit sollte dahinter sein, auch wenn das Trotzdem heißt man, man bereitet sich vor auf beiden Seiten, aber das Gespräch an sich sollte meiner Meinung nach so natürlich wie möglich sein, als wie wenn man eben rein spazieren geht und einfach mal über die aktuelle Situation so plaudert.",
      "start": 2024642,
      "end": 2098965,
      "confidence": 0.8180260869565219,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Meines Erachtens nach sollte jede Person, die Leute professionell leitet, eine Art interne Agenda haben, wie diese Person sich weiterentwickeln sollte. Und diese interne Agenda kann auch mit der Person selbst entwickelt werden. Wenn dies nicht gegeben ist, dann kann ich verstehen, dass es schwierig wird, 101 sinnvoll zu gestalten und kontinuierlich ans Laufen zu bringen. Weil dann hat man nämlich einfach keinen roten Faden. Es ist natürlich die hohe Kunst, die Vorbereitung nicht durchscheinen zu lassen, ganz klar. Und was ich auch schon oft erlebt habe, ist, dass Leute immer gehetzt in One-on-Ones kommen. Oh, ich hab den ganzen Tag Back-to-back-Meetings, sorry, dass ich zu spät bin. Und dann sich gar keinen Plan zurechtgelegt haben, wie der Inhalt des One-on-Ones eigentlich aussehen soll. Und das zeigt mir, das ist wieder respektlos. Das zeigt mir, die Person ist nicht in der Lage, ihre Zeit ordentlich zu managen. Und das zeigt mir dann auch als Individual Contributor, wenn die Person noch nicht mal in der Lage ist, zehn Minuten über einen One-on-One nachzudenken, Wie soll die Person, also wie soll mein Manager in der Lage sein, über meine Weiterentwicklung mal eine Stunde nachzudenken? Wenn dies der Fall ist, geht mal zwei, drei Schritte zurück und fragt euch wirklich, müsst ihr in allen Meetings wirklich da sein? Strukturiert euren Kalender um, macht euch Zeit. 30 bis 35, wenn nicht sogar mehr Prozent, der zeit eines engineering managers ist geht fürs nachdenken drauf und nicht fürs nicht für die einbindung irgendwelche operations oder projektmanagement oder ähnliches weil ihr müsst einen plan haben was ihr mit euren leuten macht wie ihr die weiterentwickelt wie ihr das team zum team sein bringt und das erfordert nachdenken und wenn ihr das habt wenn ihr da kontinuierlich drüber nachdenkt dann habt ihr automatisch die nächsten steps für euer one on one und für die vorbereitung dann dauert die vorbereitung auch zehn minuten oder ähnliches also das ist dann keine stunde weil ihr könnt die teammitglieder mit einbinden und wie du schon.",
      "start": 2099005,
      "end": 2212091,
      "confidence": 0.8153203592814372,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gesagt hast weiterentwicklung ist das stichwort also wirklich 101 sind auf augenhöhe zu führen weil uns hat eine person in der community auch geschrieben die hat fünf jahre lang in der firma gearbeitet wo die ones wo die 101 daraus bestanden sind, dass der Manager vorgelesen hat, was alles schief gelaufen ist und was die Person falsch gemacht hat in der letzten Woche, was dann bis zu Schweißausbrüchen geführt hat, kurz vor den 101 jede Woche. Also das ist natürlich genau so, wie es nicht laufen soll. Die Zeit soll man investieren in die Weiterentwicklung der Leute und in die Weiterentwicklung des Teams, nur so als Randbemerkung. Aber die Weiterentwicklung kann natürlich auch sehr schwierig sein und herausfordernd sein. Und da haben wir nicht nur eine Frage bekommen, sondern die Frage kommt eigentlich von ganz vielen Seiten ganz oft. Was mache ich denn als Manager oder Managerin, wenn sich das Teammitglied nicht öffnet, also nicht über die wichtigen Dinge spricht oder vielleicht auch immer ausweicht und gern dann über die technischen täglichen dinge spricht was gerade vorangegangen ist also sowie ein update meeting am ende dann das ganze sieht und sich irgendwie nicht öffnet dass man eben über die eigentlichen knackpunkte mal sprechen kann was hast du dafür techniken andy als alter 101 fuchs.",
      "start": 2212131,
      "end": 2287153,
      "confidence": 0.844495327102804,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, ich glaube schon, dass man am Anfang die eigentlichen Knackpunkte mal aus dem Weg räumen sollte, weil das, was gerade brennt, wenn das kontinuierlich weiter brennt, dann macht es keinen Sinn, durch das Feuer zu gehen, hinter dir brennt's, vor dir brennt's. Also ich denke schon, dass man die aktuellen Knackpunkte schon mal lösen sollte. Und wenn die aktuellen Knackpunkte der Workload sind, technische Schulden, eine rote CI-Pipeline oder ähnliches, dann kann man halt auch schon mal für eine gewisse Zeit das One-on-One um solche Themen drehen lassen. Wenn man aber nach drei, vier One-on-Ones auf den Baustellen keinen Fortschritt macht, dann sollte man nicht überlegen, okay, wie kriegt man diese Dinge gelöst? Weil ich vergleiche das immer so mit so einem dreckigen Schreibtisch. Wenn du einen kompletten dreckigen Schreibtisch hast und ein Sauberkeitsfanatiker bist, wie willst du konzentriert arbeiten, wenn dein Schreibtisch einfach komplett dreckig ist und vollgestellt ist? Ja, löst erst mal das Hauptproblem, dass dein Schreibtisch aufgeräumt ist. Und dann kannst du nämlich über mittel- bis langfristige Weiterentwicklung sprechen. Aber wenn dein Direct Report direkt ins Meeting kommt, sagst du, boah, jetzt hab ich den ganzen Tag wieder hier mit den Unit-Tests rumgeballert. Und die CI-Pipeline, die führt die Tests ganz anders aus als ich lokal. Ja, dann ist das leider so, dann muss man leider erst die operativen Dinge, für die die Warneminds eigentlich nicht gedacht sind, wegräumen, aus dem Weg räumen und die Personen halt enablen, die zu lösen.",
      "start": 2288073,
      "end": 2365890,
      "confidence": 0.8044571428571426,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber nehmen wir mal an, operativ stimmt alles. Es gibt ja auch diese Personen, die dann einfach sofort trotzdem darauf springen. oder vielleicht sogar unterbewusst absichtlich machen. Ich hatte mal so eine Person, die hat mir immer ganz interessante Fragen gestellt, technische. Ich habe gerade dieses technische Problem, wie könnte ich dieses Problem lösen? Und das war so ein interessantes Problem, dass ich sehr oft sofort drauf gesprungen bin, weil es so super interessant war. Und ich spreche auch gerne über technische Themen und ich habe mich dann selber immer wieder erinnern müssen, hey Moment, Es geht nicht jetzt darum, dieses technische Problem zu lösen, dieses interessante Problem, sondern es geht darum, über andere Dinge zu sprechen. Also wie schafft man es, da den Wechsel, den Fokus auf die anderen Dinge zu lenken?",
      "start": 2365930,
      "end": 2407793,
      "confidence": 0.8332857142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn jemand immer mit solchen operativen Themen ankommt, dann würde ich erstmal verbal auf den Tisch hauen, nennen wir es mal, und nochmal den Scope und die Erwartungshaltung und den Sinn eines One-on-Ones erklären. dass man natürlich hier und da mal wieder über operative Dinge sprechen kann, aber dass der Hauptfokus zur Entwicklung des Individual Contributors oder des Managers, je nachdem, wie es halt gerade in der Konstellation ist, Hauptfokus ist nicht über das technische Problem, was wir gerade in dem Projekt lösen, zu sprechen, sondern wirklich um die Weiterentwicklung, um die Ziele der Person. Und wenn man Das mag befremdlich für viele Leute sein, über sowas zu sprechen, aber ich würde da, wenn man gar nicht von den operativen Themen wegkommt, einfach einen Hard Cut machen und einfach das klarstellen. Inklusive Erwartungshaltung. Das ist dein Meeting. Ich erwarte auch eine gewisse Vorbereitung von dir über Themen, die du mit mir besprechen möchtest. Und sowas kann es sein wie zum Beispiel, was war im letzten Monat die größte Challenge für dich im Team? Einfach, das ist eine recht offene Frage, ist aber eine Frage, die jeden betrifft, weil jeder hat irgendeine Challenge im Team. Und da kann man gucken, ja, hm, ich bin mit diesem Task nicht wirklich weitergekommen. Okay, warum denn nicht? Ja, ich hatte da eine Diskussion mit Tim, und wir waren unterschiedlicher Meinung, wie wir diesen Unit-Test erstreifen. Warum wart ihr denn unterschiedlicher Meinung? Also, eigentlich mit dieser klassischen Technik von Five Ways kontinuierlich runtergehen, was denn daran challenging war. Und dann kann man weitergehen. Okay, was war denn daran challenging? Ja, er wollte einfach nicht meine Meinung akzeptieren. Warst du dir denn 100% sicher, dass deine Meinung die bessere Meinung ist? Und so weiter und so fort. Du merkst schon, das geht halt langsam weg von den Unit-Tests, sondern hin zu Akzeptanz von anderen Meinungen und der professionellen Führung von Gesprächen bei Disagreement im Team. Wenn man dann denkt, man ist ganz unten an diesen, nachdem man 5- bis 6-mal warum gefragt hat, Dann stellt man sich die Frage, okay, was würdest du denn nächstes Mal besser machen? Oder was würdest du in derselben Situation nächstes Mal anders machen? Und so weiter und so fort. Also, mit solchen Fragen kann man nach und nach das Thema ein bisschen lenken, weg von, es geht um den Unit-Test, hin zu, wie kommuniziert eigentlich mein Teammitglied? Und da komm ich wieder auf das Thema, wovon ich die ganze Zeit rede. Macht euch ein paar Gedanken, wie ihr eine Person entwickeln wollt. Und entwickeln kann in beide Richtungen gehen. Das bedeutet auf der einen Seite, upskilling, gute Attribute noch weiter zu verbessern. Oder nicht so positive Beobachtungen, die ihr zum Beispiel im Teamverhalten bei der Person gemacht habt, auszumerzen über Zeit. Und dort eine Art und Weise ein Mindshift zu erzeugen. Wenn ihr so einen Plan habt, dann könnt ihr Stück für Stück über mehrere One-on-Ones die Kommunikation mehr in diese Richtung lenken.",
      "start": 2407833,
      "end": 2573579,
      "confidence": 0.8040182555780934,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich glaub ganz allgemein, muss man sich einfach die richtigen Fragen überlegen, weil mit den Fragen kann man Leute in die richtige Richtung lenken und da spreche ich jetzt von beiden Seiten, weil es gibt auch diesen Fall, dass Manager unter Umständen nur über operative Sachen sprechen und ein Update wollen zu Projekten und auch da kann man einfach mit den richtigen Fragen als Individual Contributor, wenn man dann fragt, okay, was glaubst denn du, wo ich mich weiterentwickeln soll, wohin soll es denn gehen, Was ist denn deine Meinung zu mir in diesem Bereich, zu diesen Skills und so weiter. Da kann man das Gespräch auch wieder auf diese Ebene lenken, aber auch als Manager kann man einfach die Lenkung übernehmen. Und es gibt auch ganz gute Einstiegsfragen im Internet. Wir verlinken da auch gerne eine Liste mit 101 Fragen. Da kann man sich immer wieder neue Fragen raussuchen für ein 101. Im Vorhinein einfach wieder mal ein, zwei neue Fragen rauspicken. Meine Lieblingsfrage war auch immer, wie ist denn aktuell dein Happiness-Score, einfach auf 0 bis 10. Ich habe das dann auch immer in den Notes eingetragen, in das gemeinsame Sheet. Dann kann man einfach auch sagen, okay, dein aktueller Happiness-Score ist 6, letzte Woche war er 8. Warum ist er denn jetzt 2 Punkte niedriger? Und so kann man auch schon relativ schnell üblicherweise in so Dinge einsteigen, ohne dass dann Leute sofort auf die Technik springen. Kann natürlich auch passieren und es gibt hartnäckige Fälle und da muss man halt wirklich hart wieder zurückrudern und sagen, okay, für das technische Problem machen wir vielleicht ein eigenes Meeting, das lagern wir aus, da holen wir auch vielleicht noch ein, zwei andere im Team dazu. Aber jetzt geht es eben darum, die anderen Dinge zu besprechen, die dich auf dem Happiness-Core zum Beispiel auf 6 bringen von 8. Und da gibt es ganz viele Arten von Fragen, so Skalierungsfragen von 0 bis 10, die sind eigentlich sehr gut für sowas immer geeignet, um auch vielleicht so ein bisschen den Fortschritt zu tracken oder Veränderung zu tracken. Hast du eine Lieblingsfrage?",
      "start": 2573599,
      "end": 2684614,
      "confidence": 0.8081501416430596,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe nicht nur eine Lieblingsfrage, ich habe ein paar Lieblingsfragen, besonders wenn man in der Situation ist, wo sehr viel über Operatives gesprochen wird. und man den Sinn und Zweck der One-on-ones ein bisschen ändern möchte, dass man einfach mal sagt, hey, pass mal auf, ich würde gern über die nächste Zeit ein bisschen den Sinn und Zweck und den Inhalt dieser One-on-ones Gespräche ändern. Mehr hin zur persönlichen Entwicklung, mehr weg vom Operativen. Und um so eine kleine Bestandsaufnahme zu machen, würde ich gern mal ein paar Sachen mit dir durchgehen. Wie zum Beispiel, weißt du, was von dir auf der Arbeit erwartet wird? Oder, Was sind deine Erwartungshaltungen gegenüber mir als Reporting Line? Oder hast du ein klares Ziel, welches du folgst? Oder wenn ich dir gerne ein Lob aussprechen möchte, ist das okay, wenn ich das in der Öffentlichkeit, also in Stand-Ups oder in Slack tue? Oder soll ich das in privaten Konversationen tun? Hast du das Gefühl, du lernst genug hier in der Firma, damit du dich weiter selbst entwickeln kannst? Hast du das Gefühl, du lernst hier bei der Arbeit genug, dass du eine Weiterentwicklung und Wachstum spürst? Hast du einen klaren Karrierepfad für dich? Das bedeutet, wo siehst du dich in 1, 3, 5 Jahren? Denkst du, wir arbeiten an spannenden Projekten und wie würdest du diese auf einer Skala von 0 bis 10 bewerten? Oder wenn es eine Sache gibt, die du hier im Team oder in der Firma ändern würdest, was wäre es? Oder hast du eigentlich alle Materialien und das ganze Equipment, was du eigentlich für deine Arbeit brauchst? Und vielleicht im Generellen, hast du eigentlich die Möglichkeit, das Beste jeden Tag hier zu geben? Oder blockt dich irgendwas? Das sind halt so Fragen, wenn man den Sinn und Zweck des Wondermans einmal drehen möchte und die Erwartungshaltung gesetzt hat, mit dem man so eine Art Bestandsaufnahme machen kann. Natürlich musst du dann auf Basis dieser Fragen schon ein paar antworten haben aber was man machen kann ist die fragen stellen erstmal alle aufnehmen und dann hat man in der regel so viel futter für die nächsten 101 aber auch sehr viel arbeit wieder auf seinem tisch um das weiter zu verfolgen klare ziele für die person zu definieren wenn die projekte nicht spannend sind herausfinden wie ist die motivation der mitarbeiterin des mitarbeiters was ist spannend für die person kann man die themen vielleicht ein bisschen drehen kann man vielleicht eine arbeitsallokation ein bisschen abändern Und so weiter und so fort. Also da kann man so tief reingehen in ganz viele Fragen. Aber die Bestandsaufnahme einfach mal in 30 und 45 Minuten zu machen, ist eine tolle Sache. Und dann kann man über die zukünftigen One-on-ones entweder die Erwartungshaltung ändern, Probleme lösen, tiefer reingehen. Man hat natürlich sehr viel Arbeit auf seinem eigenen Tisch, aber das ist Personalentwicklung.",
      "start": 2684654,
      "end": 2836741,
      "confidence": 0.8023966597077243,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Diese Fragen eignen sich auch ganz gut, um Probleme besser zu analysieren, wenn es zum Beispiel irgendwo Performance-Probleme gibt oder Leute irgendwie langsamer sind, dass man einfach mal außenrum fragt, genau eben, wie die Person aktuell den Teamablauf sieht, wie sie sich selbst einschätzt gegenüber anderen, wie sie andere einschätzt. Einfach mal um so ein paar Dinge rundherum abzuklopfen, gibt es irgendwo Blocker, um einfach rauszufinden, wo sind denn die Probleme von der Person, die vielleicht dann auch auf die Performance Auswirkungen haben. damit man da eben nicht direkt sofort frontal in so ein Problem reinsteigt, sondern einfach mal probiert auch rundherum alles abzuklopfen, um das ganze Problem im Team oder von einer Person besser einschätzen zu können.",
      "start": 2837381,
      "end": 2876910,
      "confidence": 0.844491525423729,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Fragen, die ich gerade alle vorgelesen habe, die können wir auch unten in den Shownotes mal verlinken. Aber seid euch bewusst, wenn ihr diese Frage stellt, da kann sehr viel Arbeit auf euch zukommen. Aber es gibt euch halt sehr viel Content für die nächsten One-on-Ones, um dann zum Beispiel die Erwartungshaltung gegenüber euch als Lead ein bisschen zu korrigieren. Oder ihr fragt euch selbst, kann ich diesen Erwartungen eigentlich gerecht werden? Und gegebenenfalls gibt das euch ja auch wieder Inhalt für One-on-Ones mit eurem Vorgesetzten, ob das gerechtfertigte Erwartungshaltungen sind etc. Also ihr merkt schon, es geht schon sehr viel in diesen Art-Meta-Bereich und ich komme nochmal darauf zurück, als Engineering-Manager solltet ihr eigentlich so 30, 35, wenn nicht sogar mehr Prozent eurer Zeit mit Nachdenken verbringen. Und dieses Nachdenken sollte eigentlich genau über solche Art von Fragen passieren, denn Nur das bringt euch in die Lage, wo ihr nicht nur als Operative denkt, sondern eigentlich an den Zeithorizont von nächsten drei, sechs, neun, zwölf Monaten. Weil das ist der Zeithorizont, in dem ihr operieren solltet. Ihr solltet in der Regel nicht in dem Zeithorizont heute operieren, sondern eher, was kommt als nächstes? Und wo sehe ich mein Team, meine Abteilung, mein Produkt am Ende des Jahres? Ich fühle mich schon wie einer dieser Coaches auf Instagram, aber ich hoffe, das kommt nicht so negativ rüber. Komm in meinen Club, komm ins Team.",
      "start": 2876950,
      "end": 2963287,
      "confidence": 0.7869234042553184,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Solange du da kein Pyramidensystem aufbaust für irgendwelche Kurse oder ähnliche Dinge, ist alles okay.",
      "start": 2963307,
      "end": 2969489,
      "confidence": 0.8091333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der Podcast bleibt frei.",
      "start": 2969529,
      "end": 2971169,
      "confidence": 0.83075,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt haben wir schon einige Themen abgefrühstückt, also wie die ganze Form der 101 aussieht, an was für einem Ort, welche Rituale wir machen, ob wir das formalisiert machen, mehr freie Schnauze. Aber auch was es für Problemfälle gibt, also in die eine Richtung, wenn die ICs mit ihrem Manager zu kämpfen haben, wenn der das Feedback nicht annimmt oder die Kritik nicht sinnvoll annimmt oder auch in die andere Richtung als Manager, wenn man die ICs in den 101s in die richtige Richtung lenken will. Das sind so die üblichen Challenges, die man so hat in 101s. Einerseits die Planung, die Struktur und dann eben auch die kleinen Challenges, wie man die andere Person in die richtige Richtung lenkt, egal von welcher Seite aus. Aber ihr habt gerade auch kürzlich mit einem Lied gesprochen, der 101 jetzt einführt, bei ihm im Team. Und er hat mich noch gefragt, ob ich irgendwie so einen Pro-Tipp habe, wenn er jetzt an die Einführung der 101 denkt, was er so zu beachten hat. Andi, hast du da einen abschließenden Pro-Tipp für ihn?",
      "start": 2971189,
      "end": 3029704,
      "confidence": 0.8136000000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Macht nicht alles zu eurem Problem, nur weil es in einem One-on-One aufgebracht wird. Ich denke, nicht jedes Problem, was genannt wird, sollte auch gelöst werden, denn ab und zu ist es auch völlig okay, zu sagen, hey, ich sehe das nicht als Problem, und dass man dann ein bisschen mehr Kontext gibt, warum man das nicht als Problem sieht. Gegebenenfalls ist die Erwartungshaltung des ICs ein bisschen anders.",
      "start": 3030084,
      "end": 3053080,
      "confidence": 0.8265072463768118,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder auch der Wissensstand einfach ein anderer, weil die Person hat meistens weniger Einblick.",
      "start": 3053100,
      "end": 3057983,
      "confidence": 0.8538571428571428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Euer Job ist nicht, jede Person im Team glücklich zu machen. Ich hatte mal einen guten Peer, der mir den sehr wertvollen Ratschlag gegeben hat. Don't be nice, be fair. Ihr seid nicht dafür da, um, oh mein Job ist hier das Beste, was ich je hatte, sondern euer Job ist es, ein Team zu führen, was die Ziele des Businesses supportet. Und da kann man auch ab und zu mal sagen, ich sehe das nicht als Problem und ich denke nicht, dass wir das lösen sollten. Dann sollte man natürlich eine Begründung parat haben oder jedenfalls mehr Kontext geben. Oder halt einfach durch die 5 Whys oder mehr ein bisschen das unterliegende Problem der Person herausfinden. Ich sage nicht, dass man sofort dagegen reden sollte, sondern ich denke, dass ab und zu auch mal ein Disagree and Commit hilfreich sein kann. Deswegen macht nicht alles zu eurem Problem, nur weil es aufgebracht wird, sondern ihr müsst nicht jedes Problem lösen. Das ist so mein Tipp. Was ist dein Tipp?",
      "start": 3058403,
      "end": 3113818,
      "confidence": 0.824323529411765,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Geht witzigerweise in eine sehr ähnliche Richtung. Ich probiere auch Probleme einfach nicht zu lösen. Und zwar hast du das gerade gesagt, man muss nicht jedes Problem lösen. Und ich glaube, das ist ganz wichtig. In One-on-Ones werden einem ganz oft Probleme herangetragen. Ich habe ein Problem im Team. Ich habe ein persönliches Problem mit dem Tim, nachdem du den schon erwähnt hast. Der arme Tim bekommt halt alles ab. Dann springt man ganz gerne als Manager auf und sagt, ja, ich spreche mit dem und ich kläre das für dich. Und das ist, glaube ich, genau das Falsche. Man sollte nicht die Probleme von den Teammitgliedern lösen, sondern man sollte sie enablen, dass sie ihre Probleme selbst lösen. Und ich würde dann dieser Person sagen, hast du das im Team schon mal in dem Vier-Augen-Gespräch gesagt? Also vielleicht den Kontext natürlich auch erläutern, aber dann, hast du mit ihm schon mal darüber gesprochen? Und wenn nicht, sprich mal mit ihm. Was hat er gesagt? Und dann bespricht mir im nächsten 101, okay, hast du mit ihm gesprochen? Was war der Outcome? Habt ihr euch geeinigt? Was war das Problem? Weil wenn Leute miteinander sprechen, löst sich das Problem meistens von selbst. Wenn ihr das aber für euch übernehmt, müsst ihr das Problem lösen. Und seid gebunden, müsst viel Zeit investieren. Der bessere Weg ist natürlich einfach, die Leute dazu zu pushen, das selbst zu machen, vielleicht auch selbst andere Leute zu kontaktieren, das selbst in die Hand zu nehmen. Und dann können die das nächste Mal auch wieder selber machen. Und das zählt nicht nur zur Weiterentwicklung, zum Enabling, sondern auch zur Zeitoptimierung für euch selbst als Manager. Und erst im schlimmsten Fall kann man die dann mal in den Raum stecken, wenn sich die wirklich nicht einigen. Dann muss man da vielleicht einschreiten. Aber sonst die Leute weiterentwickeln, dass sie ihre Probleme selbst lösen können und man selbst nicht automatisch immer der Problemlöser ist. Oder der Problemlöser ist man schon, aber man löst das Problem nicht selbstständig, sondern delegiert die Problemlösung.",
      "start": 3113838,
      "end": 3220920,
      "confidence": 0.8269008746355694,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und habt bitte nicht die Erwartung an euch selber, dass falls ihr jetzt vorhabt eure Struktur der One-on-ones zu ändern, dass alles innerhalb zwei Wochen passiert. Das braucht Zeit, auch bis eure Gesprächspartner sich ein bisschen öffnen, bis die Gesprächspartner ein bisschen verstehen, okay, die Struktur hat sich jetzt geändert und da auch mitmachen. Also das kann gut mal drei bis sechs Monate dauern.",
      "start": 3221262,
      "end": 3241451,
      "confidence": 0.7974218749999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und auch immer offen kommunizieren mit den Leuten und fragen, was sie davon halten und können wir das mal ausprobieren. Also nicht einfach überstülpen und alles vordefinieren, sondern immer auf Augenhöhe. Gemeinsam ist ja auch ein Meeting für beide Seiten. Gemeinsam dieses Meeting vorantreiben.",
      "start": 3242051,
      "end": 3258479,
      "confidence": 0.8773863636363636,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie ihr seht, 101 sind schon kein einfaches Thema. Da gibt es ja wahrscheinlich auch ganz viele andere Leute, die sind ganz anderer Meinung. Deswegen findet euren eigenen Style.",
      "start": 3258519,
      "end": 3267266,
      "confidence": 0.767241379310345,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder noch viel besser, wenn ihr anderer Meinung seid, kommt zu uns in die Community und erklärt uns, was der bessere Style ist und was man besser machen kann.",
      "start": 3267306,
      "end": 3276001,
      "confidence": 0.8510344827586207,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie sich Tim verhalten sollte.",
      "start": 3276041,
      "end": 3277283,
      "confidence": 0.9083333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der arme Tim, ja.",
      "start": 3278095,
      "end": 3280115,
      "confidence": 0.519,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Soviel von uns. Ich hoffe, ihr konntet mit der einen oder anderen Sache etwas anfangen. Nehmt euch ein bisschen Zeit zum Nachdenken, was ihr vorhabt, wie eure Strategie ist, was euer Pfad ist. Als IC oder als Engineering Manager, das sollte von beiden Seiten kommen. Das bedeutet auch, wenn ihr Software Engineer seid, was habt ihr eigentlich so vor? Wollt ihr das größere Rad drehen? Setzt euch auch mal eine Viertelstunde, eine halbe Stunde irgendwo hin und denkt drüber nach, was ihr denn wirklich so bewirken könnt. Eure Vorgesetzte und euer Vorgesetzter, die werden mit hoher Wahrscheinlichkeit glücklich darüber sein, falls ihr mal mit einem guten Vorschlag ankommt, was ihr eigentlich im Team verbessern wolltet. Und so kriegt man relativ schnell Buy-In. Also nehmt mal den Mut zusammen und pusht mal nach vorne. Wir wünschen euch dabei viel Erfolg und bis zur nächsten Woche. Bis bald. Ciao.",
      "start": 3280156,
      "end": 3326157,
      "confidence": 0.7688163265306125,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.8104292048477694,
  "audio_duration": 3331.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
