{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/72077b46-0d24-471e-ad80-e620f297fb07/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "624aqg4gof-b417-4ae1-8b5d-f62bbb8fdc0c",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "So, an alle euch Jäger und Sammler da draußen. Sammeln alleine ist nicht genug. Neben dem Sammeln muss man nämlich auch verarbeiten, organisieren, durchsehen und erledigen. Denn nur so wird man produktiv und bekommt den Kopf frei. Und damit willkommen zu einer neuen Episode des Engineering Kiosk, in der wir über stressfreie Produktivität sprechen und wie man diese mit einem einfachen System erreichen kann. Und nachdem wir produktiv sind, legen wir auch gleich direkt los. Anni, du bist doch Apple-User, oder?",
      "start": 3237,
      "end": 35454,
      "confidence": 0.8579382716049382,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin Apple-User, richtig.",
      "start": 35494,
      "end": 36774,
      "confidence": 0.7430000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dann erklär mir mal was in dieser Apple-Welt. Wir haben auf Apple mehr Downloads bei unseren Podcasts oder Listens in den letzten Episoden gehabt als auf Spotify. Trotzdem haben wir auf Apple nur 13 Bewertungen und auf Spotify 60 5-Sterne-Bewertungen. Erklär mir mal, warum ihr, Apple-User, keine Bewertungen macht und einfach uns, Podcaster, so im Stich lässt. Wahrscheinlich relativiert sich das jetzt gleich alles, weil in Zukunft haben wir jetzt keine Apple-Hörer mehr, weil ich alle Hörer in der Netz auf Apple gleich beleidigt habe. Aber Andi, erklär mir das mal. Hast du schon mal eine Episode, einen Podcast irgendwo bewertet?",
      "start": 36794,
      "end": 73781,
      "confidence": 0.780108910891089,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nee, aber ich kann ja... Ah, siehst.",
      "start": 73821,
      "end": 75782,
      "confidence": 0.7424285714285714,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du, da haben wir das Problem. Eindeutig, Apple-User. Apple-User machen keine Bewertungen. Die sind sich zu gut, um Bewertungen zu machen. Wir armen Linux-User müssen das alles übernehmen.",
      "start": 75802,
      "end": 85506,
      "confidence": 0.7932500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist hier, der Grund ist kulturelle Völkerverständigung. Mal kurz aus dem Bauch heraus. Welches Land ist das reichere? Deutschland oder Österreich? So pro Kopf jetzt, weil bevölkerungstechnisch sind wir uns da einig, oder?",
      "start": 85866,
      "end": 97734,
      "confidence": 0.8310294117647057,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, also wenn es ums Niveau geht, sind sicher wir reicher.",
      "start": 97774,
      "end": 100376,
      "confidence": 0.772909090909091,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nee, nee, finanziell.",
      "start": 100416,
      "end": 101517,
      "confidence": 0.6663333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Geld ist doch nicht alles im Leben.",
      "start": 101537,
      "end": 103438,
      "confidence": 0.8832857142857141,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In diesem Kontext schon. Der Wolfgang hält gerade ein Bild in die Kamera. Niveau wird nur von unten als Arroganz empfunden. Also pass mal auf, meine These ist einfach, und ich habe das jetzt nicht verifiziert oder gegoogelt, meine These ist einfach, dass Deutschland mehr Geld als Österreich hat, also die Bevölkerung, also die Bürger. Deswegen in Deutschland mehr Apple-Geräte unterwegs sind. Und weißt du eigentlich, wie man in Deutschland lobt?",
      "start": 103478,
      "end": 128442,
      "confidence": 0.8372676056338031,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das bin ja von dir gewöhnt, wenn man nichts hört, das ist Lob genug.",
      "start": 128942,
      "end": 132290,
      "confidence": 0.7950666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn man nicht meckert, dann ist das Lob, genau. So sind wir Deutschen. Auf deine Frage zu beantworten, bedeutet dies... Die 13 Apple-Bewertungen kommen aus Österreich, weil der Rest einfach sagt, jopp.",
      "start": 132330,
      "end": 144400,
      "confidence": 0.8284687500000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du bist wirklich gut. Ich habe zwar alle Apple-Leute beleidigt, aber du hast jetzt wieder ganz Deutschland beleidigt. Du bist wirklich Spitzenreiter darin.",
      "start": 144440,
      "end": 152082,
      "confidence": 0.7030869565217392,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist Kultur. Das ist ja keine Beleidigung. Du brauchst ja jetzt gar nicht irgendwie ein Konterargument ausdenken. Du kannst es einfach so hinnehmen.",
      "start": 152102,
      "end": 158844,
      "confidence": 0.6651250000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich leite jetzt einfach gekonnt, ohne Überleitung über zu unserem heutigen Thema Produktivität. Wobei, da sind wir wieder in Österreich, oder? Österreich ist sicher produktiver als Deutschland.",
      "start": 158864,
      "end": 167567,
      "confidence": 0.7718928571428572,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In welcher Metrik?",
      "start": 167627,
      "end": 168247,
      "confidence": 0.5926666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir explodieren sicher mehr als ihr. Wobei, da bin ich mir auch nicht sicher.",
      "start": 168730,
      "end": 171715,
      "confidence": 0.626,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, wir brauchen einfach mehr als ihr.",
      "start": 171996,
      "end": 175722,
      "confidence": 0.7381428571428571,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, dann würdet ihr ja mehr importieren. Aber das macht ihr wahrscheinlich auch.",
      "start": 175763,
      "end": 178207,
      "confidence": 0.520846153846154,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Egal.",
      "start": 178247,
      "end": 179048,
      "confidence": 0.799,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kommen wir zurück zur Produktivität.",
      "start": 179068,
      "end": 181052,
      "confidence": 0.6656,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe die Tage eine Nachricht von einem Freund bekommen, und zwar sagte der, hey benutzt du eigentlich noch Remember the Milk? Ich brauche da so ein Tool, aber in der Vergangenheit war ich noch nie lange mit einem Tool zufrieden. Da habe ich gesagt, ja, ich benutze das noch, ohne das würde ich gar nichts mehr geschissen bekommen, egal wo, ob privat oder auf der Arbeit, das nimmt mir einfach so dermaßen viel ab. hab ich gefragt okay wie kommst du zu der frage was treibt dich in die richtung sagt er ja genau das ich bekomme einfach nix mehr beschissen ich brauche da dringend eine lösung vielleicht willst du ja im engineering kiosk mal darüber sprechen und dann fing er sofort an ja ich hatte mal eine frage ob man in diesem tool das und das einstellen kann und eine aufgabe deadline hat blabli blub Und ihr müsst wissen, als Kontext, der Freund ist Software-Ingenieur. Und das Klassische dabei hier ist, er hat ein Problem und er sucht sofort das Tool, was ihm alles löst. Also so diese klassische, okay, ich muss da jetzt eine Software für haben, gibt es da dieses Feature-Set. Und wir kommen dem Wunsch des Kollegen einfach mal nach und machen heute jetzt einfach mal eine Folge wirklich über Produktivität, ein Deep Dive.",
      "start": 181838,
      "end": 243666,
      "confidence": 0.7329634703196347,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei weniger über Tools. Also Tools ist schon ein Thema, aber das können wir schon mal vorweg nehmen. Tools lösen keine Probleme. Das wissen wir aus anderen Bereichen auch. Das Tool ist halt nur ein Werkzeug. Und nur weil ich ein teures Werkzeug kauf, bin ich kein guter Handwerker. Oder wenn man da die Tiroler Variante nimmt. Ich hab das immer so cool gefunden, wenn man irgendwie so am Berg dann so Leute sieht mit so 8.000 Euro Rädern, die sich dann irgendwie, wenn sie K.O. oben ankommen und umfallen, dann sich noch eine Zigarette anzünden. Gemütlich. Nachdem sie da ihre Körpermasse nach oben geschleppt haben. Das macht halt noch keinen guten Mountainbiker aus, nur weil man ein teures Fahrrad hat.",
      "start": 244186,
      "end": 281724,
      "confidence": 0.7981900826446277,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Fährst du als Österreicher eigentlich mit dem Hollandrad hoch?",
      "start": 281764,
      "end": 284186,
      "confidence": 0.5628888888888888,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ein Freund von mir ist einmal bei so einem Spaßwettrennen mit so einem alten Stadtrad auf so einer Mountainbike Strecke über 1000 Höhenmeter mitgefahren. Gibt es durchaus bei uns solche Leute.",
      "start": 284246,
      "end": 295552,
      "confidence": 0.7930967741935483,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, das ist der beste Beweis, dass wirklich Tools jetzt nicht euer Produktivitätsproblem lösen. Mir tut es ja selbst als Software-Ingenieur weh zu sagen, dass das Tool nicht all meine Probleme löst, weil auch ich stürze mich erstmal in die Feature-Comparison. Oh, welches Tool nehme ich denn und wen nehme ich denn? Oder Framework und welches ist denn noch in drei Jahren relevant und allem drumherum. Deswegen klassisch Ingenieur-mäßig, Tool-fokussiert, das machen wir nicht. Offen gesprochen war das auch nicht die einzige Nachricht, die wir in letzter Zeit bekommen haben. Wir nehmen natürlich auch sehr viele Themenwünsche entgegen und da kam immer und immer wieder die Frage hoch, wie organisiert ihr euch eigentlich? Wie kriegt ihr das alles gemanagt? Wie bekommt ihr eigentlich neben euren Berufen diesen Podcast so regelmäßig hin? Und die Antwort ist ganz einfach, hört weiter und dann wisst ihr es.",
      "start": 295592,
      "end": 338024,
      "confidence": 0.7482206896551724,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man muss ja dazu sagen, der Andi ist ja so der Spezialist in Produktivität, aber trotzdem liest du gerade wieder das Getting Things Stunt Buch und ja nicht zum ersten Mal.",
      "start": 338944,
      "end": 348590,
      "confidence": 0.7374375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das ist korrekt, aber ich vergleiche das so. Hast du schon mal Harry Potter oder Herr der Ringe oder sowas gelesen?",
      "start": 349360,
      "end": 352944,
      "confidence": 0.6426818181818182,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, natürlich.",
      "start": 353544,
      "end": 354345,
      "confidence": 0.796,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kannst du dich an jede Konversation zwischen Harry und Hermine erinnern?",
      "start": 354365,
      "end": 357828,
      "confidence": 0.6631818181818181,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Natürlich, über Elefantengehirn, was denkst du?",
      "start": 357868,
      "end": 360751,
      "confidence": 0.7090000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und genau das ist es. Ich lese das Buch ja wieder, also jetzt glaube ich das zweite oder dritte Mal in einer Distanz von acht Jahren oder so, und ich entdecke immer wieder kleine neue Dinge.",
      "start": 360791,
      "end": 371842,
      "confidence": 0.8125277777777778,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wenn du das jetzt so Revue passieren lässt, du hast ja auch andere Bücher gelesen in der ganzen Produktivitätsecke und kennst ja auch ganz viele andere Methoden. Warum immer wieder dieses Buch? Also warum kommst du immer wieder zu Getting Things Done zurück?",
      "start": 372482,
      "end": 385069,
      "confidence": 0.7653636363636366,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist ja nicht so, als lese ich Bücher, die in direkter Konkurrenz zu Getting Things Done stehen. Ich lese ja Bücher über Methoden, über Ansätze, die ich ja in diesen ganzen Prozess mit einspielen lassen kann. Also nehmen wir mal als Beispiel Getting Things Done Selbst ist ja eine Selbstmanagement-Methode. Und dann hast du zum Beispiel sowas wie die Pomodoro-Technik. Die Pomodoro-Technik sagt ja, okay, reservier dir einen Block Zeit, 15, 20, 25 Minuten, schalt alles aus und arbeite 15, 20, 25 Minuten einfach durch und mach danach eine Pause. Das eine schließt ja das andere nicht aus. Ich kann ja die Pomodoro-Technik trotzdem anwenden. Oder die Eisenhauer-Matrix. Ist etwas urgent oder muss etwas schnell gemacht werden oder ähnliches.",
      "start": 385109,
      "end": 427017,
      "confidence": 0.7875416666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber bist du noch der Meinung, dass das die Methode schlechthin ist? Irgendwie diese zentrale Methode, die man auf jeden Fall wissen muss? Oder warum liest du Getting Things Done nochmal?",
      "start": 427717,
      "end": 437804,
      "confidence": 0.774258064516129,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das Buch hat den Untertitel Stress-Free Productivity. Oder The Art of Stress-Free Productivity. Und ich glaube, das trifft es ganz genau. Ich glaube nicht, dass es so die Allerweltsmethode, aber ich denke, die Grundidee der Methode ist Gold wert. Alles aus seinem Kopf rauszuhaben und die mentale Kapazität frei zu haben, um wichtigere Dinge zu tun, wie zum Beispiel die Erledigung der Aufgabe. Zum Beispiel, wie viele Apps hast du jetzt gerade auf deinem Handy?",
      "start": 438099,
      "end": 466472,
      "confidence": 0.8315199999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Zu viele.",
      "start": 466512,
      "end": 466852,
      "confidence": 0.7175,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ist die Hauptaufgabe oder das Hauptziel von vielen dieser Apps, aus App-Sicht?",
      "start": 467312,
      "end": 472653,
      "confidence": 0.8589230769230769,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meine Zeit zu stellen?",
      "start": 472673,
      "end": 474193,
      "confidence": 0.899,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, die competen einfach um deine Aufmerksamkeit, du sollst da sehr viel Zeit verbringen und so weiter. Und das ist ja jetzt nicht nur dein Handy, das ist ja auch dein Laptop, das ist ja auch jede Webseite. Das ist ja auch dann die Arbeit, Freunde, Kunden und so weiter und so fort. Und wenn ich konstant drüber nachdenken müsste, was ich alles immer zu tun habe und alles in meinem Kopf behalte, dann denke ich, dass die Methode Getting Things Done mir schon sehr hilft, stressfreier zu leben, weil ich einfach ganz einfach sicher sein kann, ich vergesse nichts, ich habe es mir aufgeschrieben, ich weiß wo es aufgeschrieben wurde und es hilft mir halt in der komplexen Welt jetzt gerade wirklich effizienteres und ich würde fast sagen belastungsfreieres zu arbeiten.",
      "start": 474233,
      "end": 511386,
      "confidence": 0.8157424242424245,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, also dann bist du ja der Master von dieser Art Getting Things Done und hast gerade das Buch gelesen, dann kannst du jetzt ja uns ganz frisch erklären, in Worten von David Allen, was eigentlich Getting Things Done ist und was diese Kunst des Zeitmanagements ausmacht und wie man dann so ein Master wird wie du. Hat man jetzt übrigens diese Ironie-Tags verstanden? Okay, du darfst trotzdem anfangen. Schieß mal los.",
      "start": 512196,
      "end": 539563,
      "confidence": 0.7857500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da gibt's jetzt das Problem, wenn ich jetzt einfach antworten würde, würde ich ja sagen, okay, der Wolfgang hat recht und ich seh mich selbst als Master. Das Problem ist, umso länger man das macht, umso mehr weiß man ...",
      "start": 539583,
      "end": 548759,
      "confidence": 0.8279499999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was man nicht weiß.",
      "start": 548769,
      "end": 549870,
      "confidence": 0.76525,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was man nicht weiß, was für Fehler man aufbaut, man sieht, oh, andere haben diese Fehler bereits behoben. Und wie schlecht man eigentlich ist. Aber das Problem ist, irgendwo muss halt einer mal ganz oben stehen. Das wird mit hoher Wahrscheinlichkeit David Allen sein. David Allen ist der Gründer, Erfinder oder zumindest der Mensch, der draußen in der Welt mit der Gettings-Exams-Methode Geld verdient. Sagen wir es mal so.",
      "start": 549910,
      "end": 569614,
      "confidence": 0.7868260869565219,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ja in der letzten Episode schon, wo Uncle Bob, der diese Clean-Code-Weisheiten predigt, dann in den eigenen Projekten gar nicht so viel verfolgt. Also nur weil man viel Ahnung hat über ein Thema, heißt das ja nur noch, dass man selber gut darin ist. Ich vergleiche das immer mit Trainern. Da sagt man ja auch immer, Fußballtrainer können selbst schlecht Fußball spielen. Und jetzt bin ich gerade von mir selber überrascht, dass ich mit einem Fußballvergleich komme, aber egal. Also dann nehmen wir mal an, du bist kein Master, aber du hast gerade das Buch gelesen und kannst es trotzdem perfekt zusammenfassen. Also was ist Getting Things Done?",
      "start": 570535,
      "end": 600551,
      "confidence": 0.7441100917431193,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also wenn ihr jetzt alle erwartet, da kommt jetzt eine super komplexe Methode. Nee, es ist wie alles im Leben. Was super effektiv ist, ist oft einfach. Und das Schwierige ist es, die ganze Sache einfach aufsehen zu lassen. Also Key der Methode sind eigentlich ganz simple To-Do-Listen. Alle anstehenden Tätigkeiten, wirklich alles, wird in einem vertrauenswürdigen Verwaltungssystem erfasst. Das kann ein Stück Papier sein und einfach eine Bullet Point Liste, das kann ein Markdown File sein auf dem Computer, das kann irgendein Dokument sein in irgendeinem Cloud Dienst oder eine spezifizierte App dafür, was weiß ich nicht, Google Keep, Wunderlist, gibt's das nicht? Ne, Wunderlist wurde gekauft von Microsoft. Aber so, remember the milk, things. Oder von mir ist auch eure Notes App. Ist völlig egal. Es geht ja wirklich darum, den Kopf frei zu haben für Wichtigeres. Nämlich für die Erledigung der Aufgabe. Und nicht immer nur zu denken, oh ich muss noch das, oh ich muss noch das. Sondern du schreibst einfach alles auf. Dann schaut man die ganze Sache durch. Schedule die ein und macht die. Natürlich gibt es dann ein paar Nuancen. Und da gehen wir gleich in den einzelnen Schritten drauf ein. Denn die ganze Thematik besteht eigentlich aus 5 einzelnen Schritten. Sammeln, Verarbeiten, Organisieren, Durchsehen und Erledigen. Das klingt jetzt alles wieder super, super komplex. Aber im Grunde genommen ist es das. Schreibt einfach alles auf, schaut es durch, macht es. Und jetzt sagt jeder, an die willst du mich eigentlich verarschen. Nein, will ich nicht. Aber meine Frage ist, habt ihr so eine Liste jetzt schon? Macht ihr das denn wirklich stringent und überall? Und habt ihr wirklich alles aufgeschrieben? Und da werden die meisten Leute sagen, ne, brauche ich nicht. Und dann heißt es wieder, fuck, das habe ich vergessen.",
      "start": 600871,
      "end": 694243,
      "confidence": 0.7586321070234117,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, das klingt ja jetzt alles sehr einfach mal grundsätzlich. Ich sammle das und mache das am Ende. Aber gehen wir mal tiefer rein. Das ist ja ein ganzes Buch. Das macht ja durchaus paar Tipps und hoffentlich beschreibt es noch tiefer. Also wenn man mal in den Sammelpunkt reingeht. Was heißt sammeln? Okay, ich kriege jetzt eine Aufgabe, ich muss was aufschreiben. Das macht ja wahrscheinlich jeder, damit das nicht vergisst.",
      "start": 694817,
      "end": 715424,
      "confidence": 0.7514166666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also nehmen wir mal an, du willst mit dieser Methode jetzt einfach mal starten und hast das vorher nicht gemacht. Was der im Buch sagt ist, und lustigerweise habe ich das wirklich auch vor einem Monat gemacht, Er sagt immer, okay, pass mal auf, räum erstmal auf. In dem Raum, in dem du jetzt gerade sitzt, räum den kompletten Raum auf und alles, was du in der Hand hast, entscheidest du, liegt das da richtig, brauche ich das noch, kann das weggeschmissen werden oder muss damit irgendwas gemacht werden. Und dann schaffst du die erstmal so ein bisschen zen-mäßig, ja, so nach dem Motto, mach erstmal deinen Schreibtisch frei.",
      "start": 715704,
      "end": 747275,
      "confidence": 0.7735688073394495,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wir sprechen da eben jetzt nicht von Aufgaben, sondern wirklich Zeug, was rumliegt.",
      "start": 747745,
      "end": 751327,
      "confidence": 0.7432857142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Zeug, was rumliegt. Zeug, was auf deinem Schreibtisch rumliegt. Also ich sitze jetzt hier an einem Schreibtisch, spreche mit dir in einem Mikrofon und habe zum Beispiel links von mir eine Broschüre über ein neues Garagentor. Und Achtung, ich bin kein Garagentor-Verkäufer. Das bedeutet, das ist nicht mein Job. Mit hoher Wahrscheinlichkeit habe ich überlegt, oh, ich will mir ein neues Garagentor kaufen. Und jetzt ist die Frage, was mache ich mit dieser Broschüre? Eigentlich wäre jetzt die Aufgabe, okay, ich muss damit was tun. Oder ich sag, nein, ich kaufe kein Garagentor und deswegen schmeiß ich die Broschüre weg. Punkt ist, räum erstmal hier deine Umgebung auf und pack alles, das was du tun musst, auf einen Haufen. Er sagt auch in dem Buch, es kann auch ein bisschen ausarten, zum Beispiel hab ich dann mal eine ganze Wohnung aufgeräumt, ja, also bin in jedes Zimmer, hab jeden Schrank aufgemacht und so weiter und so fort. Du glaubst gar nicht, wie viel dann bei eBay Kleinanzeigen gelandet ist. Und er sagt auch, das ist doch völlig okay. Mach das einfach, räum erstmal alles auf.",
      "start": 751347,
      "end": 802964,
      "confidence": 0.7789189189189186,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da macht man sich ja dann noch mehr Arbeit am Ende. Ich will ja eigentlich die Arbeit organisieren und mehr Zeit rausbekommen.",
      "start": 802984,
      "end": 808848,
      "confidence": 0.8029090909090908,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie sagte Dirk aus unserer Community? Du musst erstmal Zeit investieren, um später mehr Zeit zu haben. Da ist halt wirklich das Credo, werd mal langsamer, um später schneller zu sein. So, dann hast du irgendwo einen Haufen, auf dem Boden, auf dem Schreibtisch oder was weiß ich nicht, der wird halt größer, ja? Entweder mit Zetteln oder was weiß ich gar nicht. Und dann bedacht der auch, okay, wenn du jetzt im Schrank bist oder so, und du hast etwas, was du dir jetzt nicht auf den Haufen legen kannst, schreib einfach ein Post-it und pack das Post-it auf den Haufen, ja? Keine Ahnung, Rudergerät wegräumen oder so. Auf jeden Fall räum erstmal auf. Alles was erledigt werden muss auf einen Stapel, diesen Stapel nennen wir Inbox. Und danach, jetzt sitzen wir hier in einem sauberen Raum, alles gut, geht es ans Eingemachte, da geht es an deine Gedanken. Danach denkst du an alle losen Enden. Was hast du begonnen, was ein loses Ende ist, was noch nicht vollständig ist?",
      "start": 809220,
      "end": 856098,
      "confidence": 0.7662163742690055,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da kann ich jetzt nur sagen alles hat ein Ende nur die Wurst hat zwei. Aber was für losen Enden meinst du da?",
      "start": 856338,
      "end": 862042,
      "confidence": 0.6651304347826086,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja alles so was ihr noch erledigen müsst, was habt ihr angefangen, was habt ihr noch vor, Ideen, Projekte, Aufgaben. Oh ich möchte noch diesen Pull Request in dieser Open Source Library fertig machen. Oh ich muss noch die Beete aus meinem Garten. reinigen, oh ich muss jetzt noch die Sommerreifen vom Auto wechseln.",
      "start": 862062,
      "end": 880296,
      "confidence": 0.8095740740740738,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also lose Enden im Sinne von es ist noch nicht erledigt, ich will noch was machen, alles was noch nicht abgeschlossen ist.",
      "start": 880316,
      "end": 886841,
      "confidence": 0.841909090909091,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja oder vielleicht sogar was ihr noch anfangen wollt. Also ich möchte dieses Jahr zum Beispiel Hühnerstall bauen. Das wäre für mich dann jetzt ein Projekt, das ist ein loses Ende in meinem Kopf, ich habe den Hühnerstall ja noch nicht gebaut und deswegen schreibe ich das auch auf einen Zettel und packe das auf die Inbox.",
      "start": 887242,
      "end": 900712,
      "confidence": 0.715,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das hättest du jetzt bis Ostern eigentlich schon schaffen können.",
      "start": 900792,
      "end": 903214,
      "confidence": 0.5821,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Habe ich aber nicht.",
      "start": 903254,
      "end": 903875,
      "confidence": 0.565,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, nächstes Ostern.",
      "start": 904735,
      "end": 906056,
      "confidence": 0.5086666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wirklich alles. Und das kann am Anfang ein bisschen dauern, denn im Buch wird von ein paar Stunden bis hin zu zwei Tagen darüber gesprochen. Weil es ist ja logisch, du setzt dich jetzt nicht hier so hin und sagst, oh, jetzt denke ich mal über alles, was ich noch zu tun habe und dir fällt alles ein. Sondern du gehst mal auf einen Spaziergang, oh fuck, das muss ich noch tun. Also wirklich alles aus deinem Kopf raus in diese Inbox. Und das Lustige ist, im Buch hat er so eine gute Liste, die nennt sich Incompletion Trigger List. Und die Incompletion Trigger List, das ist kein Witz, ist eine Liste von 200, 300, 400 Wörtern, wie zum Beispiel Konferenzen, Artikel, Chef oder deine Frau, Job Description, Versicherung, Kinder, Schulden, Urlaub, Hund, Computer, Software, Internet. So nach dem Motto, du liest hier diese Liste durch und denkst dir so, ah, ich muss noch meine Software-as-a-Service-SARS-Description für Grammarly canceln, weil ich hab ja jetzt Chat-GPT. Und wirklich diese Incompletion-Trigger-List kann dir wirklich helfen, an alle losen Enden irgendwie zu denken.",
      "start": 906076,
      "end": 970589,
      "confidence": 0.765655555555556,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Können wir auch gerne verlinken, da gibt's online direkt bei David Allen auch die Liste, die man verwenden kann, um da ein paar Trigger sich reinzuholen.",
      "start": 971210,
      "end": 979232,
      "confidence": 0.782,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So, das klingt jetzt alles nach super viel Arbeit, ist es auch, aber wenn ihr irgendwas verändern wollt, müsst ihr halt damit starten. So, jetzt hab ich diese Inbox.",
      "start": 979533,
      "end": 985594,
      "confidence": 0.6582413793103448,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, jetzt hab ich diese Inbox. Diesen Riesenhaufen. Und jetzt wird mir schlecht und ich fall um, weil ich sehe, was ich noch alles machen muss. Vor allem, was ich nicht erreicht habe in meinem Leben. Da sind jetzt ganz viele Post-its, ich will toll, ich will berühmt werden, ich will reich werden und ich muss heute noch den Garten verschönern. Wo fange ich jetzt an? Das ist ja eine Horrorvorstellung. Riesenhaufen No-To-Do-Lists.",
      "start": 986075,
      "end": 1009890,
      "confidence": 0.7914657534246577,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich verstehe, dass das eine Horrorvorstellung ist und ich verstehe, dass einem die Angst macht. Aber wo ist der Unterschied, dass du ein Problem, was du so oder so hast, jetzt sichtbar gemacht hast?",
      "start": 1009930,
      "end": 1018457,
      "confidence": 0.8153235294117643,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, wir sehen es wenigstens sonst nicht.",
      "start": 1018617,
      "end": 1020477,
      "confidence": 0.44185714285714284,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, also bist du okay damit, einfach Probleme zu verstecken, nicht zu sehen, anstatt sie anzufangen? Weil dann muss ich dir sagen, wenn du so denkst, dann lass es direkt bleiben, weil dann wird es auch mit einer Produktivitätsmethode einfach nicht besser. Du wirst halt nur besser, die ganzes Zeug anzupacken und abzuarbeiten. Wenn du es denn abarbeiten möchtest, das ist ja der erste Punkt, ja?",
      "start": 1020537,
      "end": 1041002,
      "confidence": 0.7775151515151513,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, wir Österreicher sind da allgemein ganz gut drin, Sachen nicht zu sehen und einfach mal so im Eck liegen lassen, weil wir waren ja auch nur Opfer.",
      "start": 1041102,
      "end": 1047944,
      "confidence": 0.7938214285714287,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Darauf werde ich als Deutscher nicht eingehen. Nee, aber es ist halt wirklich so. Ich verstehe, dass das ein Riesenhaufen sein kann. Das kann ein Riesenhaufen auf eurem Büroboden gerade sein, auf dem Schreibtisch. Das kann ein 30 Seiten langes Google-Doc-Dokument sein. Und das macht einem erst mal Angst. Das verstehe ich. Aber im Endeffekt sind das alle Sachen, die ihr angehäuft habt. Aus eurer Wohnung, aus eurem Garten, Garage, Kopf. Und ihr habt die zusammengetragen. Das bedeutet, ihr habt die eh irgendwann vor. Also das Problem ist ja da. Das sind ja keine Sachen, die ich dir auf deinen Tisch gelegt habe.",
      "start": 1048905,
      "end": 1078673,
      "confidence": 0.7860291262135922,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, aber gehen wir mal in die Problemlösung. Was mache ich dann als nächstes? Riesenhaufen, was kommt als nächstes?",
      "start": 1078993,
      "end": 1084776,
      "confidence": 0.7854210526315789,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast jetzt diese Inbox und die muss jetzt verarbeitet werden. Eigentlich hast du jetzt alle Aufgaben an einem Ort und dieser Ort ist nicht euer Kopf. Das ist das Key-Element. Alle Aufgaben in der Inbox werden jetzt gesichtet und dann wird entschieden, was damit gemacht wird. Und das bedeutet, sich klar zu werden, worum handelt es sich. Muss, will ich etwas bezüglich der Aufgabe unternehmen? Wenn ich da einfach nichts unternehmen möchte, was ja eine aktive Entscheidung ist, direkt wegschmeißen. Dann gibt es mehr als eine Aktion, die ich machen muss, um diese Aufgabe zu erfüllen. Beispiel, wenn ich jetzt meinen Garten verschönern möchte, ich möchte die Beete säubern. Ja, der Sommer steht vor der Tür, mein Beet sieht aus wie Kacke. Dann muss ich mir erstmal, hab ich das ganze Werkzeug, ok, Schaufeln rauslegen und so weiter und so fort. Dann hab ich einen Eimer, wo ich das ganze Gras reinpacken muss. Dann das Gras entsorgen, will ich vielleicht mein Beet noch mit Rindenmulch belegen und so weiter und so fort. Das sind erstmal drei, vier, fünf Aktionen. Wenn also mehr Aktionen notwendig sind, um diese Aufgabe zu erledigen, ja, dann leg mal ein Projekt an. Kommen wir gleich noch zu. Dann, was ist die nächste Aktion? Also, was ist der nächste Schritt, den ich hier machen kann? Und ist der nächste Schritt, kann der in unter zwei Minuten erlegt werden? Oder in unter fünf Minuten? Wenn ja, mach den direkt. Schieb den gar nicht weiter auf irgendeinen Haufen. Weil da kommen wir jetzt in den Zyklus von, die Zeit zur Verwaltung der Aufgabe nimmt mehr Zeit ein, als die Bearbeitung der Aufgabe. Also, zwei, fünf Minuten ist so ein guter Schwellenwert. Oder auch, kann jemand anders die Aufgabe erledigen? Ist jemand anders besser geeignet, diese Aufgabe zu erledigen? Oder kann ich dich vielleicht outsourcen? Wenn ja, delegieren, und dann machst du dir irgendwo einen Reminder, und irgendwo ist dann auf eine Warten-auf-Liste. Du merkst schon, du schiebst die Aufgaben von der Inbox zu den Sammelkasten in kontextbasierte Listen.",
      "start": 1085156,
      "end": 1186980,
      "confidence": 0.8008152492668623,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wenn du dir jetzt weiterdelegierst zum Beispiel, das braucht ja auch wieder Zeit. Machst du dir dann einen weiteren Task oder ein Post-it oder was auch immer, dass du irgendwas delegieren musst?",
      "start": 1187020,
      "end": 1196963,
      "confidence": 0.7605454545454545,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nee, das Delegieren selber, wenn man jetzt davon ausgeht, das kostet unter fünf Minuten, dann mache ich das Delegieren sofort und setze mir auf meine Wartenaufliste, hey, Aufgabe X an Y delegiert. Ich frage mal in einer Woche nach.",
      "start": 1197783,
      "end": 1211048,
      "confidence": 0.834923076923077,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wenn das Delegieren über fünf Minuten dauert, oft ist das ja in irgendeinem Gespräch oder man kann ja nicht einfach sagen, hey, mach du.",
      "start": 1211068,
      "end": 1217510,
      "confidence": 0.6688400000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dann mache ich mir dann eine Aufgabe, dass ich mit dieser Person sprechen möchte. Beispiel, wenn ich jemanden anrufe, dann ist es ja meist so, man hat noch ein bisschen irgendwie ein Gespräch drumrum und so weiter, wie du sagtest, dann sage ich okay.",
      "start": 1217530,
      "end": 1226994,
      "confidence": 0.7191590909090908,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eben, es ist ja nicht jeder so untertan, wie ich, der einfach nur so Tasks empfängt, wenn ich dann wieder so, Andi hat dir eine neue Aufgabe zugewiesen, bam, der wird nicht mal telefoniert mit mir.",
      "start": 1227014,
      "end": 1237020,
      "confidence": 0.8001944444444444,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dann mache ich mir eine neue Aufgabe, okay, ich muss mit Wolfgang sprechen, genau. Ja und die letzte Aufgabe ist, kann ich die Aufgabe nur an einem bestimmten Ort machen? Dann würdest du den Kontext erfassen, beziehungsweise die nach hinten schieben.",
      "start": 1237060,
      "end": 1247785,
      "confidence": 0.7827317073170733,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist der Kontext?",
      "start": 1247805,
      "end": 1249346,
      "confidence": 0.6075,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der Kontext ist zum Beispiel, die Beete reinigen kann ich einfach nur in meinem Garten machen. Und wenn ich jetzt auf Geschäftsreise bin, dann kann ich diese Aufgabe natürlich nicht erledigen. Weil in dem Hotel, in dem Land oder in der Stadt, in der Geschäftsreise, habe ich meinen Garten zufällig nicht dabei.",
      "start": 1249486,
      "end": 1262270,
      "confidence": 0.8286346153846154,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bist du nicht in deinen Gedanken immer in deinem Garten?",
      "start": 1262650,
      "end": 1265991,
      "confidence": 0.5802,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das bin ich, aber meine Gedanken machen mein Beet leider nicht sauber. Auf jeden Fall stellt ihr euch halt diese Frage. Es ist einfach ein Entscheidungsbaum. Möchte ich Wassbeet dieser Aufgabe unternehmen? Ist mehr als eine Aktion notwendig? Kann diese Aufgabe in unter zwei beziehungsweise fünf Minuten erledigt werden? Kann jemand anders diese Aufgabe erledigen? Und kann ich diese Aufgabe nur in einem bestimmten Ort machen? Jetzt gibt es beim Verarbeiten ein paar Regeln. Arbeite den Eingangskorb immer von oben ab, von mir aus auch von unten, Hauptsache die Richtung, also springt nicht immer hin und her.",
      "start": 1266131,
      "end": 1296500,
      "confidence": 0.8076326530612249,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der Eingangskorb ist die Inbox, ist das die deutsche Übersetzung? Hast du das Buch in Deutsch übrigens oder in Englisch?",
      "start": 1296520,
      "end": 1301223,
      "confidence": 0.7017,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ne ich hab's in Englisch. Eingangskorb, Inbox.",
      "start": 1301243,
      "end": 1303784,
      "confidence": 0.4677142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist dasselbe, aber da halt dieser Haufen oder?",
      "start": 1303824,
      "end": 1306906,
      "confidence": 0.8218749999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja ganz genau. Verarbeite immer nur ein Element. Und das mag vielen Leuten jetzt bekannt vorkommen, aus dem Kanban-Prinzip. Limit your work in progress. Weil, Achtung, neueste Studien haben gezeigt, Menschen sind scheiße im Multitasking.",
      "start": 1307126,
      "end": 1323455,
      "confidence": 0.8344571428571431,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, den musst du mir mal schicken.",
      "start": 1323515,
      "end": 1325516,
      "confidence": 0.318,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also arbeite wirklich nur ein Element ab. Das bedeutet, nimm dir nicht drei Zettel und stell dir diese Fragen bei allen drei Zettel, weil du denkst, es ist effektiver. Ich nehme es mal vorweg, es ist nicht effektiv. Und jetzt das Wichtigste, weil da bin ich auch super drin im Prokrastinieren. Lege ein Element, was du aus der Inbox geholt hast, nie zurück. Fass es einfach nie zweimal an, weil ich glaube, das ist so eine einfache Regel. Wie oft sehe ich, ich habe eine E-Mail, öffne die, lese die kurz durch und sagt ah das mache ich später und klicke wieder auf unread. Wie oft machst du das?",
      "start": 1325556,
      "end": 1356208,
      "confidence": 0.7623486238532109,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Naja bei mir ist das im System drin, nachdem ich ja Zero Inbox verwende und dann brauche ich das gar nicht unread setzen. Bei mir ist das ja automatisch in der Inbox drin. Ich kann dem trickreich ausweichen, dem Problem. Was das Problem nicht besser macht.",
      "start": 1356268,
      "end": 1369916,
      "confidence": 0.7368695652173914,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, du verschiebst es einfach. Naja, auf jeden Fall, wie gesagt, fass halt eine Sache in deiner Inbox nicht zweimal an.",
      "start": 1369936,
      "end": 1377103,
      "confidence": 0.7097142857142855,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man natürlich schon dazu sagen muss, man kann den Task natürlich schon öfters anfassen, weil es kann ja auch was komplexeres sein, aber dann erstellt man im Prinzip neue Tasks zu dem gleichen Thema, wenn man es ganz genau nimmt.",
      "start": 1377344,
      "end": 1387495,
      "confidence": 0.8187073170731707,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, und jetzt kommen wir genau zu der nächsten Regel. Falls eine Handlung notwendig ist, formuliere diese Handlung actionable. Also wirklich ... Weil dich jetzt der Freud verliere diese ... Ja, verliere diese Handlung. Formuliere diese Tätigkeit wirklich actionable, dass du es dir selbst einfach machst. Was ist die nächste Aufgabe? Beispiel, ich möchte mir einen neuen Sessel zum Lesen bestellen, dann schreibe ich da nicht Lese-Sessel hin, sondern suche auf Amazon Lese-Sessel oder ähnliches. Ja, also wirklich mach es dir einfach.",
      "start": 1387815,
      "end": 1419057,
      "confidence": 0.7626707317073168,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder lese den Review-Artikel zu Lese-Sessel, was wirklich der nächste Schritt ist, um das Ganze zu erledigen. Und was ich da immer mache, ist, ich probiere es halt möglichst klein zu formulieren und möglichst so, dass ich nicht abgeschreckt bin, dass es nicht groß klingt. Nach einer großen Arbeit, wo ich schon, wenn ich das irgendwie sehe, mir denke, um Gottes Willen, das mache ich sicher nicht jetzt. Das braucht viel Zeit. Das ist was, was ich absolut ungern mache, sondern ich probiere mir selber das zu verkaufen. Probiere mich da ein bisschen selbst auszutricksen, indem ich das möglichst positiv immer alles formuliere und eben auch möglichst klein in kleinen Häppchen und so geht dann halt auch etwas weiter.",
      "start": 1419098,
      "end": 1459828,
      "confidence": 0.8032100840336132,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ich verstehe das vollkommen, wenn ihr sagt, was eine Kinderkacke. Wenn da steht Lesesessel, weiß ich doch, was zu tun ist. Das mag sein. Es geht aber hier darum, die mentale Hürde niedrig zu halten, sodass ihr einfach nur ins Arbeiten kommt.",
      "start": 1460606,
      "end": 1475252,
      "confidence": 0.854581395348837,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist auch gar nicht nur die Hürde, sondern es ist auch, wenn du eine Liste vor dir hast und du gehst eine Liste durch mit zehn Items und überlegst dir bei jedem Punkt, soll ich den jetzt machen? Oder du überlegst dir im Allgemeinen, was mache ich als nächstes? Und du musst bei jedem Punkt kurz überlegen, was ist da eigentlich der nächste Schritt? Dann hast du da zehnmal eigentlich einen Load und einen Gedankengang, der natürlich wieder Zeit kostet. Wenn da wirklich schon genau der Task formuliert steht, ist es viel, viel schneller, als wenn du im Kopf, auch wenn es nur kurz dauert, aber du musst es dann wirklich zehnmal durchgehen, was ist der nächste Schritt? Was wollte ich da noch machen? Lese-Sessel, was ist da das Problem? Was ist da der nächste Schritt? Und das machst du dann vielleicht mehrmals am Tag, wenn du durch die Liste durchgehst. Und da geht extrem viel Zeit und wirklich Brainpower verloren, wenn du das jedes Mal wieder machst und dir das durchdenkst. Und das ist dasselbe, wie wenn man ganz viele Sachen im Kopf hat und ständig an diese Dinge denkt, obwohl man jetzt gar keine Zeit hat, weil man das eben nicht auf eine Liste geschrieben hat. Dann überlegt man ständig die ganzen Tasks durch. Was muss ich noch machen? Und was ist noch auf meiner Liste? Und was sind die nächsten Schritte? Und das mache ich dann halt womöglich 100 Mal am Tag. Und wenn ihr das schön aufgeschrieben habt, dann geht das super schnell. Und ihr entscheidet nur, okay, das mache ich jetzt.",
      "start": 1475292,
      "end": 1545873,
      "confidence": 0.8075018726591753,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ihr müsst euch immer vor Augen halten. Wir reden hier nicht über eine Aufgabe, über zwei Aufgaben. Wir reden hier über 100, 200, 300. 400 Aufgaben, die ihr gleichzeitig handhabt. Deswegen ist die Inbox am Anfang auch so dermaßen groß. Und das erschreckt einen. Aber das ist der Load, mit dem ihr zu tun habt. Falls bei der Aufgabe keine Handlung erforderlich ist, dann archivier das einfach irgendwie für Referenzmaterial, schreib es halt irgendwo auf und leg es zu den Akten. Wirf die Aufgabe direkt in den Müll oder entscheide aktiv, dass du sie jetzt gerade nicht machst und kennzeichne sie als vielleicht oder als irgendwann. So nach dem Motto. Meinen Hühnerstall, den postpone ich seit drei Jahren glaube ich gerade, weil es ist halt gerade nicht das wichtigste, obwohl ich jetzt gerne eigene Eier zu Ostern hätte. Bei der ganzen Entscheidung kann die Eisenhower-Matrix sehr hilfreich sein. Mag bestimmt vielen bereits ein Begriff sein, aber die Eisenhower-Matrix, kurz erklärt, ist ein Koordinatensystem mit vier Quadranten. Auf der x-Achse haben wir dringend und nicht dringend, auf der y-Achse haben wir wichtig und nicht wichtig. Jede Aufgabe, die wichtig und dringend ist, wird sofort erledigt. Jede Aufgabe, die wichtig und nicht dringend ist, wird auch später verschoben. Jede Aufgabe, die nicht wichtig und dringend ist, kann delegiert werden. Und jede Aufgabe, die nicht wichtig und nicht dringend ist, wo gehört die hin? Die gehört in den Papierkorb. Ihr merkt schon.",
      "start": 1546073,
      "end": 1628795,
      "confidence": 0.8283556485355652,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder auf deine Maybe-List, was ja eigentlich fast so ein Papierkorb ist. Viele sind ja gegen diese Maybe-Listen. Ich finde sie trotzdem ganz praktisch und ich mache das auch gerne so, wenn ich fünfmal irgendwas postpone, dann kann ich es immer noch löschen und wegschmeißen. Aber vielleicht will ich es ja auch dann irgendwann mal machen. Also ich finde das schon okay, so Maybe-Listen. Und hin und wieder hat man ja auch so irgendwie keine Lust auf irgendwas und dann kann man auf so Maybe-Listen unter Umständen auch was ganz Nettes finden, was man dann macht und vielleicht auch Spaß dran hat.",
      "start": 1628835,
      "end": 1656880,
      "confidence": 0.7085196078431373,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Generell haltet euch vor Augen, die wichtigste Frage für jeden Task in eurer Inbox ist, was ist die nächste Aktion, die mich weiterbringt, um diese Aufgabe abschließen zu können. Und das Lustige ist, es ist genauso wie beim Incident Management. Beim Incident Management, ihr habt ein Outage in eurer Infrastruktur oder ähnliches, die Kernfrage ist da zu jedem Zeitpunkt. Was muss getan werden, damit das System wieder auf der Baseline ist, also wieder funktionsfähig, sodass die Blutung vom Inzident gestoppt ist? Und das ist genau dieselbe Aufgabe. Und das ist genau dieselbe Frage. Was ist die nächste Aktion, die mich hier weiterbringt?",
      "start": 1657080,
      "end": 1694665,
      "confidence": 0.8221274509803923,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "So, jetzt hast du ganz schlau allen Menschen erklärt, was eine To-Do-List ist, dass man da Zeug draufschreibt und das dann macht. Danke, Andi. Dafür haben wir jetzt ziemlich lang gebraucht. Aber du hattest ja noch irgendwie andere Punkte. Das waren ja fünf Punkte oder so. Jetzt haben wir To-Do's abgehakt. Hast du gemerkt, abgehakt?",
      "start": 1695465,
      "end": 1711662,
      "confidence": 0.7246181818181817,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich fand's halt einfach nur nicht lustig. Tut mir leid.",
      "start": 1711902,
      "end": 1714124,
      "confidence": 0.43481818181818177,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich schreibe was auf, ich mache das dann.",
      "start": 1717327,
      "end": 1719469,
      "confidence": 0.8555000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bäm.",
      "start": 1719509,
      "end": 1719789,
      "confidence": 0.688,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Is this getting things done?",
      "start": 1719829,
      "end": 1721090,
      "confidence": 0.5624,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe ja am Anfang gesagt, das ist ja jetzt nicht neu geschnitten Brot. Aber der Punkt ist einfach nur, wie viele Leute machen es wirklich. Schritt drei wäre eigentlich die Organisation von deinen ganzen Aufgaben. Also du hast jetzt ganz viele Aufgaben und da wird jetzt mal ein Kontext zugeordnet. Beziehungsweise du packst die jetzt auf ein paar Listen. Packst einfach dahin, wohin es soll.",
      "start": 1721130,
      "end": 1740407,
      "confidence": 0.7202272727272728,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was heißt Listen? Warum habe ich jetzt mehr Listen? Ich habe gedacht, ich habe einen großen Stapel, eine Inbox.",
      "start": 1740447,
      "end": 1744831,
      "confidence": 0.5316842105263158,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, Ziel ist es, nämlich deine Inbox leer zu kriegen und die Inbox ist so, wie gesagt, der Eingang. Du stellst ja auch nicht einfach nur alles in Flur, wenn du in die Wohnung reinkommst, sondern irgendwann packst du mal was ins Wohnzimmer, mal in die Küche und so weiter und so fort. Dahin, wohin es hingehört. Und das gleiche machst du einfach mit deinen Aufgaben. Du bist völlig frei in der Wahl oder der Stellung der Listen und die Listen können auch so im Kontext sein, kann ich das nur in einem Ort machen. Also Beispiel, ich habe eine Liste für den Engineering-Kiosk. Jede Aufgabe, die zu diesem Podcast hier gehört, packe ich auf die Engineering-Kiosk-Liste.",
      "start": 1745195,
      "end": 1773825,
      "confidence": 0.7353162393162392,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die leider mit mir geteilt ist und jeden Tag in der Früh poppen irgendwelche komischen Tasks hoch, die ich dann erledigen muss.",
      "start": 1774325,
      "end": 1780946,
      "confidence": 0.779909090909091,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe eine eigene Liste für meine Open-Source-Projekte, beziehungsweise für andere Open-Source-Projekte. Wenn ich irgendwo sehe, hey, cool, ich wollte da mal damit rumspielen oder ich wollte da mal einen Pull-Request machen, um zum Beispiel die Dokumentation zu verbessern, dann schreibe ich mir das als Aufgabe in die Open-Source-Liste. Und ich als Kontext für mich selber weiß, alles, was mit Open-Source ist, ist jetzt nicht mission critical für mich. Ich habe aber auch eine Liste, kaufen, verliehen und wird noch geliefert. Das hört sich jetzt relativ doof an, aber alles das, was ich mir irgendwann mal kaufen möchte, habe ich auf die Kaufenliste geschrieben. Zum Beispiel würde ich gerne mal eine Japan-Säge haben.",
      "start": 1780966,
      "end": 1815685,
      "confidence": 0.799522123893805,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und da brauchst du aber davor noch die Reise nach Japan.",
      "start": 1815705,
      "end": 1818088,
      "confidence": 0.753,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nee, aber ich brauche sie halt jetzt gerade nicht, ja? Also für mein nächstes Holzprojekt. Oder alles das, was ich verleihe, schreibe ich, okay, ich habe das und das an Freund X verliehen. Wie viel Zeug hast du verliehen? Und du hast keine Ahnung mehr, wo es ist.",
      "start": 1818965,
      "end": 1832678,
      "confidence": 0.7819375000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt, du hast auch ein komplettes Verleihsystem in deinem... Getting-Things-Done-Modell eingebaut.",
      "start": 1832718,
      "end": 1838962,
      "confidence": 0.7940833333333331,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe sozusagen in meinem Getting-Things-Done diverse Business-Modelle obsolet gemacht, weil es gibt nämlich Verleih-Apps. Ich habe aber auch noch eine Wird-noch-geliefert-Liste. Das bedeutet, wenn ich mal ein Möbelstück bestelle oder sowas, du kennst das ja, das braucht, wie lange braucht ein neues Sofa? Sechs Wochen, acht Wochen, zehn Wochen. Dann schreibe ich das da einfach hin, einfach nur so, dass ich das nicht wieder vergesse. Und dann stelle ich mir das in zehn Wochen als Reminder. Und wenn in zehn Wochen dann, hey, wo ist eigentlich meine Couch? Müsste die nicht langsam mal da sein?",
      "start": 1838982,
      "end": 1862750,
      "confidence": 0.7664583333333335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt aber, wenn du den Haufen betrachtest, diese Inbox, du machst alles, was unter zwei oder fünf Minuten ist und alles andere sortierst du dann in diesen Listen ein. Das heißt, ich bearbeite nichts direkt aus der Inbox aus, es ist super schnell, sondern dann schlussendlich bearbeite ich das aus meinen Listen raus. Das heißt, ich muss es zuerst einsortieren und organisieren.",
      "start": 1863650,
      "end": 1883111,
      "confidence": 0.8245714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, im ersten Schritt ist das natürlich super viel Arbeit, weil du musst halt durch die komplette Inbox rein. Später hast du dann einmal die Inbox leer und alles ist irgendwie einsortiert in deinen Listen.",
      "start": 1883371,
      "end": 1891376,
      "confidence": 0.6967714285714288,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber es kommt ja auch neues Zeug in der Inbox ständig rein, oder? Es ist wie ein klassischer Briefkasten, Postempfangsding, keine Ahnung, wie man da früher dazu gesagt hat, halt so in so einer Sortierbox, die man früher in den Offices immer gesehen hat. Da kommt halt oben einfach alles rein, was neu in irgendeiner Form reinkommt, eben die Inbox.",
      "start": 1891396,
      "end": 1910307,
      "confidence": 0.7650655737704916,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das ist korrekt. Aber sie gibt dir auch ein bisschen mentale Freiheit. Also ich habe auch eine Liste, die nennt sich Arbeit. Und in dieser Liste packe ich alles, was mit meinem professionellen Job zu tun hat. Und wenn ich Feierabend habe, gucke ich einfach nicht auf diese Liste, weil ich habe Feierabend. Also sie gibt dir halt auch ein bisschen mentale Freiheit. Aber ja.",
      "start": 1910714,
      "end": 1926909,
      "confidence": 0.7040303030303029,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber ist das eine Arbeits-Inbox oder ist das deine Arbeitsliste, wo du dann aktive Tasks drinnen hast?",
      "start": 1927109,
      "end": 1932874,
      "confidence": 0.7607647058823529,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist meine Arbeitsliste. Das ist nicht meine Arbeits-Inbox.",
      "start": 1932894,
      "end": 1934816,
      "confidence": 0.5153333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, David Allen empfiehlt ja eine Inbox für alles. Machst du das auch mit einer Inbox? Oder hast du dann eben eine Arbeits-Inbox, eine private Inbox?",
      "start": 1935165,
      "end": 1943790,
      "confidence": 0.7312592592592592,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe eine Inbox, aber verschiedene Listen dann, wo die Inbox-Items reingepackt werden. David Allen erklärt aber auch, warum er das macht. Und zwar ist er selbstständig. Und was heißt selbstständig? Man ist selbst und ständig.",
      "start": 1943810,
      "end": 1956377,
      "confidence": 0.8115833333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kenne ich irgendwoher.",
      "start": 1956397,
      "end": 1957358,
      "confidence": 0.49533333333333335,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Deswegen sagt er, okay, mein privates Leben und meine Arbeit verschmilzen so ein bisschen. Und deswegen hat er alles in einem System und vermischt das auch, weil für ihn das mehr oder weniger dasselbe ist. Aber für Angestellte sehe ich das ein bisschen anders.",
      "start": 1957398,
      "end": 1972386,
      "confidence": 0.8350681818181817,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wobei man natürlich sagen muss, je nachdem, was man für einen Job hat, aber die Grenzen sind natürlich fließend. Und ganz oft ist es halt auch so, du bekommst, wenn du arbeitest, auch private Dinge mit rein. Du bekommst eine WhatsApp-Message. Auch umgekehrt, heutzutage vielleicht, wenn du flexibel bist, dann bekommst du eine Slack-Message am Abend rein. Also es verschwimmt irgendwie immer mehr, meiner Meinung nach. Und darum, macht es natürlich Sinn, einfach eine Inbox zu haben, um möglichst schnell Dinge einzusortieren. Bearbeiten kann man sie ja dann später, aber dass man sie zumindest einsortiert und nicht vergisst, das ist ja eigentlich das Wichtigste.",
      "start": 1972406,
      "end": 2004193,
      "confidence": 0.7997307692307692,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich meine, dass das verschwimmt, ich stimme dir zu, kann natürlich auch gefährlich werden, speziell im Remote-Setup. Deswegen empfiehlt ja auch jeder, okay, hab einen dedizierten Raum dafür, den du einfach hinter dir zumachen kannst, sodass du privates Leben hast. Punkt ist, hab halt verschiedene Listen, wo du die Items von deiner Inbox einsortierst, sodass sie einen Kontext haben. Und diese Listen kannst du ja sogar, manche Apps können da sogar noch sagen, okay, du hast einen geografischen Standpunkt, dass wenn ich zu Hause bin, kann ich zum Beispiel alles im Garten machen oder ähnliches. Vielleicht hast du so eine fancy App, das ist drin oder draußen oder was weiß ich.",
      "start": 2004430,
      "end": 2035251,
      "confidence": 0.7045585585585588,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielleicht noch als Kontext, weil du jetzt App ganz oft erwähnt hast, das Originalbuch ist ja wie alt?",
      "start": 2035271,
      "end": 2042257,
      "confidence": 0.8186111111111111,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aus den 90ern oder so oder aus den 80ern sogar. Es ist schon relativ alt auf jeden Fall. Es gab mal einen Refresher 2015, aber der redet auch nicht von Apps oder sowas. Der sagt, okay, völlig egal, ob du eine Clutter hast oder so ein kleines Notizbuch oder eine Word-Datei oder so, hab halt ein System, welches du vertraust. Und Achtung, ein System und nicht ein paar Post-its da drüben und dann im Wohnzimmer und in der Küche an der Pinnwand, ein System.",
      "start": 2042277,
      "end": 2070063,
      "confidence": 0.737642857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber was ich da eben spannend finde, ist, dass man eben keine App braucht. Man kann das, wenn man will zumindestens, auch ganz klar mit Post-its mit einem Notizblock, was es auch immer ist, machen. Und auch da sieht man schon wieder, was wir eingangs ja erwähnt haben, dass Tools nicht das Wichtige sind. Die Tools kann man dann natürlich finden, weil man sich ein System zurechtgelegt hat, aber wichtig ist, dass man am Anfang ein sinnvolles System hat und nicht mit dem Tool anfängt. Das ist, glaube ich, ganz wichtig. Sich ein System zurechtlegt, Ein Tool kann dabei helfen, natürlich, aber man braucht das System, man braucht seinen eigenen Flow, mit dem man zufrieden ist, der funktioniert und den man auch lebt, weil nur eine App in irgendeinem Subfolder zu haben, die man nie öffnet, da hilft dir die App halt natürlich auch wenig. Und alle Dinge, die wir jetzt besprochen haben, die kann man auch ganz klassisch physikalisch mit Zettelpost-its, mit einem Notizblock realisieren.",
      "start": 2070103,
      "end": 2121107,
      "confidence": 0.8086385542168674,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der nächste Schritt wäre eigentlich das kontinuierliche Durchsehen, die sogenannte Review. Wenn man das das allererste Mal macht, kann man Schritt 4 skippen, meines Erachtens nach, weil du hast ja gerade eben alles aus deiner Inbox in die verschiedenen Listen gepackt, aber wenn man das jetzt irgendwie schon mal einen Monat macht oder sowas, dann macht es schon Sinn, die Aufgaben in den Listen mal durchzuschauen. Hat man manche Aufgaben vielleicht schon erledigt, markiere die als fertig. Sind die Aufgaben noch relevant? Ja, okay, super, bleib dabei. Nein, schmeiß sie weg. Ist der nächste Schritt wirklich definiert? Die Empfehlung aus dem Buch ist oft, dass man das so einmal in der Woche macht. Ist auch gut so als Wochenrückblick, so was habe ich alles geschafft. Ich selbst mache es nicht so regelmäßig einmal die Woche. Ich mache es, wenn mir gerade danach ist, alle zwei Wochen, alle drei Wochen oder wenn ich irgendwo am Bahnhof stehe und gerade noch eine Viertelstunde, 20 Minuten hab, dann scroll ich da durch und mach ein Review und mach das alles dann immer, wenn ich ein bisschen Zeit hab. Aber buchtechnisch dann immer einmal die Woche.",
      "start": 2121407,
      "end": 2176402,
      "confidence": 0.7929739583333338,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich habe ja wirklich Review-Tasks in meinem System, die wiederkehrend sind und die einfach aufpoppen. Alle drei Wochen zum Beispiel geh mal durch alle deine Ideen durch. Ich hab so eine Ideenliste, so für neue Produkte oder solche Dinge. Ich hab ganz viele Ideen, Wie viel.",
      "start": 2176802,
      "end": 2190690,
      "confidence": 0.729255319148936,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Fluktuation ist auf dieser Liste?",
      "start": 2190730,
      "end": 2191930,
      "confidence": 0.6586000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, da kommt viel dazu und das meiste bleibt auch oben, aber hin und wieder geht er einfach durch, vor allem, wenn ich dann Zeit habe und mir denke, eigentlich könnt ihr wieder mal ein neues Projekt machen, ein neues Side-Project, irgend sowas. Das ist die Ideenliste und da gibt es einfach ein Task, mach mal ein Review auf deinen Ideen, was so ansteht. Selber auf der Projektebene, mach ein Review von deinen Projekten. Zoomen mal raus, eine Ebene höher. Sind alle Projekte noch auf Track? Gibt's irgendwas, was man ändern muss? Gibt's Tasks, die irgendwo untergegangen sind bei Projekten? Priorisierung nochmal überlegen. Und da habe ich wirklich Tasks, die eingeplant sind und die mich immer wieder daran erinnern, diese Reviews auch durchzuführen.",
      "start": 2191970,
      "end": 2229780,
      "confidence": 0.7902276422764232,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ne, das mache ich nicht. Wie gesagt, ich mache es immer, wenn ich ein bisschen Zeit habe oder wenn ich meinen Garten im Kaffee morgens trinke oder sowas und setze mich dann dahin im Sonnenschein, dann mache ich sowas. Also das reicht für mich auch. Also es kann auch ab und zu sein, dass ich mehrmals pro Woche das mache. Je nachdem, wie ich gerade Zeit habe. Aber wie gesagt. Das durchsehende Review brauchst du nicht, wenn du gerade damit gestartet hast, weil du hast das ja gerade eben getan. Sondern das ist, wenn das System schon läuft.",
      "start": 2230058,
      "end": 2253734,
      "confidence": 0.6901020408163265,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und meiner Meinung nach ist das eines der wichtigsten Punkte, weil das vergisst man ganz gerne. Und so ein Review macht eigentlich ein System erst stark. Und das ist ja bei Scrum mit Retros dasselbe. Du brauchst diesen Zyklus, wo du einfach betrachtest, wie haben die Dinge funktioniert, was musst du besser machen, dieses rauszoomen. Und das ist meiner Meinung nach super wichtig bei jedem System und gerade bei so einem Task-System, wo du dann vielleicht so in dem Hamsterrad drin bist, in dem tagtäglichen, wo du einfach nur Tasks reinbekommst, abarbeitest, reinbekommst, abarbeitest, dass du einfach dir mal Zeit nimmst und einen Schritt zurück machst und wirklich rauszoomst und dann außerhalb von dem Hamsterrad auf deine Arbeit blickst, auf dein Leben, wenn wir so auf eine Meter-Ebene gehen wollen, was es auch immer ist, auf welche Flughöhe, wie es David Allen nennt, und dann dir halt wirklich konkret überlegst, was sind denn wichtige Dinge, die du wieder dann in Tasks anlegst, Listen, was es auch immer ist. Aber dieses rauszoomen ist meiner Meinung nach super, super wichtig und das vergisst man gerne, vor allem, wenn man in dem Tagesgeschäft drinnen ist, in der Arbeit, im Team, ständig kommen neue Dinge rein und da ist es ganz schwierig, sich die Zeit mal zu reservieren. Und das ist ja auch, was du am Anfang erwähnt hast, man muss sich die Zeit mal nehmen, auch um so ein System einzuführen. Und ich glaube, man muss sich die Zeit auch nehmen, um das regelmäßig zu reviewen, die eigenen Tasks, die eigenen Ideen, Ziele, was es auch immer sind.",
      "start": 2253774,
      "end": 2338101,
      "confidence": 0.8272679245283018,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Mein Vergleich ist einfach, Software kann rosten und dieses System kann ebenfalls rosten. Du brauchst halt regelmäßige Pflege, fertig aus. Jedes Software braucht Maintainance, jedes System braucht Maintenance, deswegen relativ einfach.",
      "start": 2338341,
      "end": 2350133,
      "confidence": 0.7829032258064518,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wenn du rauszoomst, dann kannst du dir nämlich auch überlegen, funktioniert dein System, funktioniert dein Zeitmanagement-System, was du da machst, dein tagtägliches System, Flows, die du dir überlegt hast, funktionieren die? Hast du genug Zeit? Geht irgendwo Zeit verloren? Wo geht die Zeit verloren? Was musst du ändern? Also wieder im Scrum-Sinne so ein Review von dem eigentlichen Prozess. Also den darf man natürlich auch nicht vergessen, weil das System, wie du sagst, rostet mit der Zeit, man rostet selbst. Man vergisst vielleicht Dinge, so wie du das Buch dann auch liest, immer wieder mal, um einfach dir wieder in Erinnerung zu rufen, was du denn vielleicht ändern könntest, was du verbessern könntest, dass man auch da wieder einen Review-Zyklus drinnen hat. Der ist, glaube ich, auch ganz wichtig.",
      "start": 2350380,
      "end": 2392573,
      "confidence": 0.8070461538461535,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, da bin ich jetzt nicht so der Fan von. Ich bin ein Fan davon, drüber nachzudenken, was tue ich hier eigentlich. Aber jetzt in einer strukturierten Analyse, wie verbringe ich meine Zeit, wo geht meine Zeit verloren, das bedarf ja im Umkehrschluss schon so einer Art Timetracking. Also das mache ich jetzt zum Beispiel nicht. Weil es gibt nämlich Aufgaben, die mache ich gerne, wo ich meine Freizeit nicht verbringen möchte. Da spielt dann die Zeitdauer eigentlich gar keine Rolle. Dann gibt es Sachen, die müssen gemacht werden. Da spielt dann ebenfalls die Zeit gar nicht so eine große Rolle, Weil sie gemacht werden müssen. Deswegen, so weit geh ich dann nicht. Da bin ich dann nicht so der Punkt. Weil die Menschen neigen dazu, eine Aufgabe so viel Zeit zu allokieren, wie Zeit dafür vorgegeben ist. Das nennt man das Parkinson'sche Gesetz. Wenn ich eine Aufgabe eine Stunde gebe, dann brauch ich eine Stunde. Wenn ich drei Stunden gebe, dann brauch ich drei Stunden. Deswegen bin ich kein Fan von, ich muss analysieren, wo meine Zeit draufgeht.",
      "start": 2392932,
      "end": 2448440,
      "confidence": 0.7612793296089388,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Naja, das Problem ist natürlich, wenn du einfach zu wenig Zeit hast, weil dieses ganze System ermöglicht dir zwar Zeitmanagement, aber es gibt dir keine Zeit automatisch. Und wenn du natürlich zu wenig Zeit hast, dann musst du dir auch überlegen, wo geht denn meine Zeit verloren? Und dann geht es natürlich in die Richtung Time-Tracking und so weiter mit rein, damit man das analysieren kann. Aber das ist natürlich ein anderes Problem. Aber mir geht es ja darum, dass man mal rauszoomt und sich überlegt, ist alles noch auf Track? Wenn ich kein Problem habe mit der Zeit und ich zufrieden bin, ist das ja vollkommen okay. Aber wenn ich natürlich sehe, okay, ich habe immer zu viele Tasks auf meiner Liste, in meinem Getting-Things-Done-Modell kann ich ja trotzdem zu viele Tasks haben und meine Listen ständig voll sein und ich habe das Gefühl, ich bringe nichts weiter, weil es immer nur mehr wird und nicht weniger. Und dann muss ich mir eben überlegen, okay, habe ich die richtige Priorisierung? Wo geht meine Zeit verloren? Was ist mir persönlich wichtig? Und dann muss ich den Schritt heraus aus dem System mal machen und auf einer Meta-Ebene drauf blicken.",
      "start": 2448846,
      "end": 2506549,
      "confidence": 0.8109246231155783,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da weiß ich jetzt auch nicht, ne, ob man das jetzt alles so strukturiert machen muss. Also ich denke mir auf der einen Seite, wenn ich nichts geschissen bekomme, weil dann habe ich entweder zu viele verschiedene Projekte, ja, und dann ist sehr wahrscheinlich auch ohne Zeitanalyse recht gut möglich. Ich droppe einfach irgendein Projekt, weil ich da keine Zeit mehr für habe. Oder man macht einfach mal so ab, wie es in Bezug auf, ich mache einfach in meinem iPhone an, okay, wie habe ich diese Woche meine Zeit in Apps verbracht? Und wenn da steht, ich habe zehn Stunden letzte Woche in Instagram verbracht und ich bin jetzt kein Influencer oder Social Media Manager, gegebenenfalls sollte man dann vielleicht mal einen Schritt machen und die App installieren oder Netflix.",
      "start": 2507209,
      "end": 2546031,
      "confidence": 0.7643435114503816,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber was hast du gerade gemacht? Indem du drauf geblickt hast, wo deine Zeit verloren geht auf deinem Handy, hast du genau diese Analyse gemacht. Wo geht denn meine Zeit verloren?",
      "start": 2546071,
      "end": 2555217,
      "confidence": 0.8147096774193547,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist richtig. Was ich anspreche, ist das, was du ja machst, ist wirklich Zeit tracken. Wie viel verbringe ich jetzt beim Podcast, damit Editing? Wie viel verbringe ich jetzt da und da? Ja klar, wenn du Agentur Mensch bist, dann bist du das vielleicht gewohnt, weil du Zeit auf den Kunden buchen musst, aber das meinte ich eigentlich. Also, dass man es nicht... Wir Engineers tendieren immer dazu, alles sehr strukturiert zu machen und alles mitzutracken und so weiter. Da weiß ich nicht, ob das nicht die mentale Kapazität wirklich echt konsumiert, ja, dass das nicht so viel ist, aber ich muss alles mittracken.",
      "start": 2555257,
      "end": 2585229,
      "confidence": 0.7675333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube gar nicht, dass man es mittracken muss. Ich glaube, du solltest es machen, wenn du ein Problem hast mit deiner Zeit als Lösung. Dass du mal sagst, okay, ich track mal mit, wo meine Zeit verloren geht. Man kann ja auch so ein Journal machen. Gibt es ja Vorlagen auch dafür, wo man einfach so ganz grob jeden Tag aufschreibt, wie viele Stunden man ungefähr in welchen Bereichen Zeit investiert. Also über den gesamten Tag hinweg auch private Dinge. um einfach mal so ein Gefühl zu bekommen, wenn man das ein, zwei Wochen macht, wo geht denn meine Zeit verloren? Wenn man ein Problem hat, wenn du kein Problem hast und zufrieden bist, dann brauchst du ja auch kein Time-Tracking oder brauchst auch gar nicht tiefer reinblicken. Aber wenn du ein Zeitproblem hast und ganz viele haben ein Problem, weil sie in ihrem Hamsterrad drinnen sind, weil da nur alles auf sie einprasselt und da musst du dir einfach mal die Zeit reservieren, nach außen zu gehen und da tiefer reinblicken. Aber das ist natürlich kein Argument für ständiges Time-Tracking. Kann natürlich jeder machen, wenn man es will. Aber es ist natürlich auch ein Mehraufwand, muss man ganz klar sagen. Aber wenn man ein Problem hat, kann man definitiv da in die Tiefe gehen und drum. Ist es mir zumindest immer wichtig, da mal einen Schritt nach außen zu machen und einfach so einen Check zu machen, ist noch alles in Ordnung? Oder muss ich eben Time-Tracking machen, weil ich zu wenig Zeit habe, muss ich was am System ändern, weil das System nicht gut für mich funktioniert? Bin ich noch zufrieden? Einfach so ein Meter-Check, ist alles noch in Ordnung? Und wenn nicht, ändere was.",
      "start": 2585929,
      "end": 2664741,
      "confidence": 0.8106527777777776,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jut, kommen wir mal zum letzten Schritt der ganzen Sache. Also der erste Schritt war, okay, pack alles in deine Inbox. Der zweite Schritt, verarbeite deine Inbox und definiere die nächste Aktion. Schritt drei war, organisiere deine Inbox. Das bedeutet, kategorisiere deine Aufgaben in einzelnen Listen. Schritt vier war, das Durchsehen, das Review. Wie gesagt, fängst du gerade mit der Methode an, brauchst du ein Review nicht, aber so einmal in der Woche, einmal im Monat oder wann auch immer ist das mal ganz sinnvoll. Und bisher haben wir ja eigentlich noch nichts gemacht von diesen ganzen Aufgaben. Und das ist nämlich der magische Schritt 5. Auch das beste System stoppt dich nicht davor, den Scheiß einfach anzupacken. Also Schritt 5 ist das Erledigen, das eigentliche Abarbeiten der definierten nächsten Schritte. Und wie Wolfgang auch schon im Vorhinein sagte, definier die Schritte einfach wirklich actionable, dass du nicht drüber nachdenken musst, was ist denn jetzt der nächste Schritt, sondern tu es einfach. Und die Länge der Aufgabe sollte dich auch nicht überwältigen. Jetzt muss ich wieder ein 4-Stunden-Investment machen. Dann ist die Aufgabe zu groß. Generell kann man sagen, es gibt drei Arten von Arbeiten. Geplante Arbeit, ungeplante Arbeit und das sogenannte definieren von Arbeit. welches der Getting Things Done Prozess insbesondere jetzt hier unterstützt. Ziel ist es natürlich, mehr geplante Arbeit zu haben als ungeplante Arbeit. Über Zeit wird am Anfang euch nicht gelingen und die Sinnhaftigkeit des Systems kommt dann zu tragen, wenn der Großteil der Zeit mit geplanter Arbeit verbracht wird. Wenn das gegeben ist, herzlichen Glückwunsch, ihr befolgt Getting Things Done.",
      "start": 2665182,
      "end": 2751453,
      "confidence": 0.7915886792452828,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Zur ungeplanten Arbeit muss man auch dazu sagen, dass das sehr oft auch ein Systemproblem ist, dass man die ungeplante Arbeit überhaupt erlaubt. Ist natürlich jetzt leichter gesagt als getan, wenn da der Chef um die Ecke kommt oder die Chefin und dir irgendwas hinwirft, das brauche ich eine Stunde, dann wird es natürlich schwierig. Aber der Klassiker ist ja auch, dass ich auf jede WhatsApp-Message antworte, auf jede Slack-Message antworte, dass so viel ständig reinkommt an ungeplanter Arbeit, dass ich keine geplante Arbeit machen kann. Und da muss man einfach sehr strikt werden in seinem System, in seinem Flow, dass man sagt, okay, ich probiere, die ungeplante Arbeit zu verringern, indem ich geplante Arbeit daraus mache. Und ich kann ja mein System dazu verwenden, Dinge, die reinkommen, die vielleicht sogar störend sind, ein Anruf oder sonstige Dinge, dass ich mir die auf die Liste setze, aber eben nicht sofort bearbeite als ungeplante Arbeit, wenn es irgendwie möglich ist. Oder ich mache natürlich sogar die klassische Variante, nehme keine Telefonate an, ich schalte meine Slack-Notifications aus für eine gewisse Zeit, setze meinen Kopfhörer auf am Arbeitsplatz, wo ich vielleicht sogar die Regel habe, wenn Leute Kopfhörer aufhaben, dann wollen sie nicht gestört werden, damit ich in meinem Flow drin bin, mal geplante Arbeit machen kann und dann habe ich wieder einen Zeitslot für ungeplante Arbeit zum Beispiel.",
      "start": 2752033,
      "end": 2831023,
      "confidence": 0.8278986784140966,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hier ist eine Sache, die ich wirklich nicht verstehe und hilf mir bitte, diese zu verstehen. Ich will sie verstehen, aber ich verstehe sie einfach nicht. Wenn ich Meetings habe und ich arbeite voll remote, dann höre ich ab und zu während des Meetings, wie der Laptop diese klassische Slack-Notification-Sound abspielt, weil jemand eine Message geschrieben hat. Warum zur Hölle hat man diese Sounds an? Ich verstehe es nicht. Slack ist das neue E-Mail. Wenn jemand was von mir möchte, soll er mich anrufen. Und wenn die Firma mir das Mittel eines Firmenhandys nicht zur Verfügung stellt, trotzdem will, dass ich fokussiert arbeite, dann bestimme ich, wann ich in Slack reinschaue.",
      "start": 2831692,
      "end": 2866708,
      "confidence": 0.7962162162162161,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und warum hast du jetzt bei unserer Aufnahme dreimal auf dein Handy geschaut?",
      "start": 2866748,
      "end": 2870030,
      "confidence": 0.7793846153846153,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weil ich ein fokus problem habe ja und geddings dann hilft mich hilft mir zu fokussieren aber ich weiß es ja.",
      "start": 2870887,
      "end": 2876532,
      "confidence": 0.8063809523809524,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nur ich verstehe nicht aber vibriert dann vibriert dein handy nein damit es richtig ausspricht nein und es macht auch keine geräusche nein und warum blickst du dann auf dein handy wenn da eine neue.",
      "start": 2876552,
      "end": 2887102,
      "confidence": 0.7857142857142856,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Message kommt meine attention span ist so groß dass sie glaube ich gerade in tiktok videos passt das weiß ich aber ich bin Und ich hab Probleme damit, also ich bin ja meinem Problem bewusst.",
      "start": 2887122,
      "end": 2897988,
      "confidence": 0.8045714285714288,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber hast du das Handy dann nach oben hin, mit Display nach oben liegen, dass du siehst, wenn Messages kommen?",
      "start": 2898028,
      "end": 2904709,
      "confidence": 0.7595,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Seit zwei Sekunden nicht mehr. Aber ja, das hast du mir die Tage gesagt, irgendwie vor ein paar Wochen, und ich muss zugeben, in letzter Zeit lass ich öfter mein Handy wirklich in anderen Räumen liegen. Und es hilft mir einfach sehr. Aber bei meinem Computer bin ich recht stringent. Das bedeutet, Notification Center hab ich hier gar nicht, alles aus und so weiter.",
      "start": 2904729,
      "end": 2924513,
      "confidence": 0.8272968749999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir haben ja auch in dem Zuge kurz in unserer Community gefragt, ob es irgendwelche Tipps gibt bezüglich Produktivität und was auch sofort als Standardantwort gekommen ist, Wolfram Dirk zum Beispiel, diese Notifications abschalten. Also diese ständigen Störungen und ich bin ja einer der wenigen, der auch das Handy immer komplett auf lautlos hat, also wenn du sagst, ruft mich an, wenn es was Wichtiges gibt, das funktioniert bei mir auch nicht. Die einzige App, die das overrult, ist der Feuerwehralarm, der reinkommt. Das ist der einzige, der laut sein darf. Alles andere ist lautlos und ich habe es auch immer verkehrt liegen, also ich sehe da auch nichts. Wobei man dazu sagen muss, mein Computer ist voller Notifications. wobei die auch sehr gut ausblenden kann im Großen und Ganzen. Und ich habe einen Shortcut, wo ich Notifications systemweit ein- und ausschalten kann. Das heißt, wenn ich in den Fokusmodus komme oder meinen Screen teile, auch übrigens sehr praktisch, dann kann man das super schnell mit einem Screenshot abschalten und man bekommt keine Notifications mehr. Das ist sicher eine der wichtigsten und effizientesten Methoden, von ungeplanter Arbeit fern zu bleiben. Und wenn ich dann mit meiner geplanten Arbeit fertig bin, den Task abgeschlossen habe, kann ich mal die Notifications wieder einschalten, kurz checken, ist irgendwo was reingekommen und kann das dementsprechend dann bearbeiten, vielleicht wieder auf meine Listen setzen, wenn es Follow-Ups gibt und sonst bin ich einfach komplett in meinem Flow und kann arbeiten.",
      "start": 2925834,
      "end": 3010094,
      "confidence": 0.8257836734693875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, das ist der Nummer eins Tipp. Schaltet eure Notifications aus. Ein paar andere Tipps hatten wir auch schon erwähnt. Dauert eine Tätigkeit weniger als zwei Minuten oder fünf Minuten, macht sie direkt. Pflegt eure Systeme regelmäßig, genauso wie Software. Ich zum Beispiel packe da wirklich alles rein. Also ich habe zum Beispiel ein eigenes Haus und an einem eigenen Haus gibt es routinemäßige Arbeiten, wie zum Beispiel die Heizung muss gewartet werden oder die Wasserentkalkungsanlage einmal im Jahr oder einen Wasserfilter wechseln. Diese Sachen habe ich im Getting Things Done System. Jedes Jahr poppt das einmal auf zu einer fixen Zeit und dann rufe ich den Heizungskollegen an. Hey, kannst du meine Heizung mal bitte warten? Also macht euch das Leben einfach einfacher.",
      "start": 3010432,
      "end": 3050904,
      "confidence": 0.8036399999999997,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber was du jetzt natürlich erwähnt hast, mit Erinnerungen bedeutet natürlich auch, dass du eine Software verwendest, die Erinnerungen zum Beispiel unterstützt. Also bei sowas kann natürlich eine Software, eine App unterstützen, ganz klar, weil Erinnerungen in einem Notizblock sind einfach schwieriger, kann man zwar auch realisieren, natürlich mit so Erinnerungsseiten oder einem Kalender oder sowas, Es funktioniert schon auch, aber es ist natürlich wesentlich einfacher über eine Software, über eine App, die vielleicht noch synchronisiert und die App kann natürlich das eigene System unterstützen als Werkzeug, aber wirklich nur als Werkzeug, weil wenn das System, der Flow nicht funktioniert, der Workflow für einen selbst, dann hilft dir die beste App.",
      "start": 3051267,
      "end": 3091267,
      "confidence": 0.8160630630630632,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nichts.",
      "start": 3091727,
      "end": 3092348,
      "confidence": 0.697,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber es macht das Leben einfach leichter. Erinnerungen, Synchronisierungen in die Cloud, dass man keine Daten verliert, dass man die Daten ständig an jedem Punkt zur Verfügung hat, solche Dinge. Das macht natürlich eine App wesentlich leichter.",
      "start": 3092388,
      "end": 3105920,
      "confidence": 0.8213783783783782,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das, was Wolfgang und ich auch schon am eigenen Leib erlebt haben, gebt euch Zeit, dass das System funktioniert. Ihr werdet nicht damit starten und dann sagen, wow, das mache ich jetzt mein ganzes Leben lang, sondern ihr schafft euch eigentlich eine neue Gewohnheit drauf. Und man sagt ja immer, 30, 60, 90 Tage braucht es, bis eine neue Gewohnheit sitzt. Gebt euch wirklich Zeit. Ihr müsst es machen, sonst wird es einfach nichts und der Sinn und Zweck wird erst nach einer gewissen Zeit sichtbar.",
      "start": 3106313,
      "end": 3129550,
      "confidence": 0.7440344827586206,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und es sollte auch ein lebendiges System sein. Man muss dieses System ständig reviewen, ändern und es gibt halt äußerliche Einflussfaktoren, die Firma, das Team, die Partner, ihnen, solche Dinge, die einfach auch diese Workflows und Systeme beeinflussen. Und wenn man zum Beispiel einen Firmenwechsel hat, hat man vielleicht wieder andere Systeme oder vielleicht einen anderen Job oder man ändert seine Arbeitsweise. Also es gibt viele Dinge, die darauf Einfluss haben und man darf das nicht als starres System sehen, sondern wirklich als lebendiges System, was man ständig verbessert, erweitert und was man auch dementsprechend weiterentwickeln kann. Und man kann, glaube ich, auch die äußeren Einflüsse beeinflussen. klingt jetzt komisch, aber gerade wenn es um ein Team geht, um die Firmen, um die Familie, man kann ja auch da probieren, die anderen mit einzubeziehen, denen auch zu erklären, zum Beispiel Slack ist nicht synchron, Slack ist asynchron, man muss das auch so verwenden, im Team, in der Firma. Also auch da kann man Einfluss nehmen. Man kann erklären, warum man manche Dinge nicht macht. Man kann auch mal lernen, Nein zu sagen. Wenn man das richtig kommuniziert, ist glaube ich auch ganz wichtig. Man kann sich überlegen, was sind Dinge, die ich nicht mehr machen will vielleicht, die eher delegiere. Also es ist alles ein lebendiges System. Ich kann das beeinflussen und ich sollte es auch beeinflussen. Und ich kann eben auch probieren, meine Umgebung anzupassen und nicht nur mich selber und mein System an die Umgebung.",
      "start": 3129910,
      "end": 3212431,
      "confidence": 0.8491740890688259,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist natürlich immer leichter gesagt als getan. Also ich für meinen Teil habe zum Beispiel seelischen Frieden gefunden. Ich sage den Leuten das einmal.",
      "start": 3212871,
      "end": 3221174,
      "confidence": 0.83625,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt bin ich gespannt. Das ist der Zen Master Art von Getting Things Done spricht über den Lebensfrieden.",
      "start": 3221194,
      "end": 3228416,
      "confidence": 0.7371666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nicht Lebensfrieden, seelischen Frieden.",
      "start": 3228456,
      "end": 3230277,
      "confidence": 0.8494999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ah, seelischen Frieden, sorry. Aber ist ja auch Lebensfrieden quasi.",
      "start": 3230317,
      "end": 3233098,
      "confidence": 0.6660999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, der Punkt ist ganz einfach. Ja, sag doch mal nein oder entscheide, was du nicht tust und so weiter. Das ist immer leichter gesagt als getan. Das ist super hart. Und man kann ja auch seine Umgebung verändern. Du kannst den Leuten das sagen. Einmal, zweimal. Aber ich bin so ein Typ, ich... I care too much, sag ich immer. Deswegen, du musst dich auch damit abfinden, ab einem gewissen Punkt, du kannst nicht die Welt rennen. Das bedeutet, wenn die Leute immer nur im Slack Hi schreiben, und dann auf eine Antwort warten, bevor sie mit ihrer Frage um die Ecke kommen, dann kannst du denen auch nicht mehr helfen. Also, du kannst denen sagen, hey, pass mal auf, ich verwende Slack asynchron und so weiter und so fort, aber wenn ich es zweimal getan habe, dann werde ich es kein drittes Mal tun, dann müssen die Leute halt einfach damit leben. Weil du kannst andere Leute nicht kontinuierlich beeinflussen und sagen, wie die sich zu verhalten haben. Wenn sie das so machen wollen, wollen sie, dann wissen sie aber, also du setzt ja Erwartungen.",
      "start": 3233198,
      "end": 3283342,
      "confidence": 0.7120213903743309,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber du kannst dir natürlich auch erziehen mit dem, dass du eben trotzdem später antwortest oder auf high gar nicht antwortest. Das habe ich auch oft gemacht. Ich habe auf high einfach gar nicht geantwortet oder direkt darauf geschrieben, was ist dein Problem? Also, was willst du von mir?",
      "start": 3284320,
      "end": 3299351,
      "confidence": 0.7557199999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hört sich an wie Türsteher. Was ist dein Problem? Klatsch.",
      "start": 3299371,
      "end": 3302253,
      "confidence": 0.6452727272727272,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es hat meistens ganz gut funktioniert und man gewöhnt sich ja auch dann an andere Leute, wie die arbeiten. Also bei dir zum Beispiel, ich bin ja auch gewöhnt, wenn du mir irgendwie sagst, du machst etwas, dann kann ich mir ziemlich sicher sein, dass das auf deiner Liste landet und irgendwann erledigt wird. Und bei dir frage ich zum Beispiel eigentlich nie nach. Bei anderen Leuten weiß ich, da muss ich einfach jeden zweiten Tag nachfragen, die haben keine Liste, die schreiben sich nichts auf. Und da frage ich dann natürlich auch öfters nach, schreibe das vielleicht auch auf meine Liste, frage nach drei Tagen wieder nach. Und bei dir mache ich das nicht. Also die Leute passen sich, glaube ich, schon auch an das Gegenüber immer. Und man kann sehr wohl Leute erziehen, ist vielleicht ein hartes Wort, aber dass sich die einfach an einen selbst anpassen.",
      "start": 3303674,
      "end": 3347293,
      "confidence": 0.8141610738255036,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eine Story. Seitdem ich das Getting Things Done mache, und das ist schon ein paar Jahre, habe ich meinen ehemaligen Chef ein bisschen dazu erzogen. Und zwar hatte mein ehemaliger Chef immer so eine Tendenz dazu, Entscheidungen, die ich zu ihm geworfen habe, wo ich halt eine Entscheidung brauchte, zu verschieben. Frag mich nächste Woche nochmal. Frag mich in zwei Wochen nochmal. Weil er war es gewohnt, dass die Leute dann nicht mehr mit der Frage kommen, weil sie es dann vergessen. Ich habe es mir dann aufgeschrieben. Nächste Woche bin ich zu. Hör mal, wir haben letzte Woche darüber gesprochen. Du wolltest mir noch eine Entscheidung geben. Ja, frage mich nächste Woche nochmal. Irgendwann nach zwei, drei, vier, fünf Wochen hat er verstanden, Scheiße, der merkt sich das. Und dann hat er angefangen, die Entscheidung einfach sofort zu treffen. Über Zeit wurde ich, wie du schon gerade sagtest, zuverlässiger wahrgenommen. Du schmeißt ihm was hin, entweder sagt er, ich mache es nicht oder ja, ich mache es und dann schreibt er sich das auf und macht es dann irgendwann. Und ich bin fest davon überzeugt, dass diese Wahrnehmung, dass ich zuverlässig bin und dass ich nichts mehr vergesse, weil das ist es ja. Getting Things Done, schreib's auf. Ich vergesse es ja nicht mehr, dass das der Grundbaustein war, dass ich in größere Projekte involviert wurde und auch, dass dieses Verhalten ein essentieller Bestandteil war, dass ich eine Gehaltserhöhung bekommen habe. Da bin ich fest davon überzeugt, weil das ist eine Art von Grundorganisation, die sehr vielen Leuten fehlt, Besonders auf höherem Level Staff, Staff Plus Engineer und so weiter, die einfach da ist, weil du einfach zu viele große Projekte hast und zu viel Kram hast und dann einfach als zuverlässig wahrgenommen zu werden. Und jetzt sagst du, oh, ich bin aber zuverlässig. Ja, kann sein, dass du zuverlässig bist, aber wenn du nicht so wahrgenommen wirst, hilft das alles nichts, weil die Wahrnehmung ist das, was zählt. Da hat dieses doch so simple System mir enorm geholfen in der Vergangenheit und auch heute noch.",
      "start": 3347873,
      "end": 3448810,
      "confidence": 0.7515216138328529,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist ja ein schönes Ende. Also der Zen Master empfiehlt getting things done. Das heißt, man bekommt mehr Gehalt, bekommt Gehaltserhöhungen, wird als verlässlich wahrgenommen und findet noch den Lebensfrieden, Seelenfrieden und hat ein glücklicheres Leben. Also wenn das jetzt keine Werbung, bekommst du nicht von David Allen irgendwas gezahlt dafür?",
      "start": 3449210,
      "end": 3469940,
      "confidence": 0.7887692307692308,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nee, ich kenn den gar nicht, aber was mir in der Vorbereitung für diesen Podcast aufgefallen ist, für wie alt schätzt du den?",
      "start": 3469960,
      "end": 3476623,
      "confidence": 0.6874782608695652,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich habe den schon mal auf einem YouTube-Video gesehen, also ich vermute, der ist mittlerweile 60 oder so.",
      "start": 3477357,
      "end": 3482423,
      "confidence": 0.742421052631579,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der ist von 1945, der ist 78. Ich sage ja, das Buch ist alt. Und ich meine, die Methode, die wir besprochen haben, die ist jetzt auch nicht Rocket Science, aber Kanban ist auch keine Rocket Science und ich kenne ganz, ganz wenige Teams, die Kanban wirklich gut und effektiv einsetzen, obwohl die Methode Kanban sehr simpel ist und wenig Regeln hat. Dennoch sehe ich einfach super viele Leute, die an solchen simplen Methoden scheitern, aus verschiedensten Gründen. Meine Herangehensweise ist immer, probiert es aus, gebt euch Zeit, seht wirklich den Sinn darin und wenn ihr den Sinn darin seht und es hilft euch, dann macht ihr das automatisch. Und es ist auch nicht so, als stehen andere Produktivitätsmethoden in Konflikt mit der ganzen Thematik. Wir hatten die Eisenhower-Matrix angesprochen, die Pomodoro-Timer. Es gibt auch die ALT-Methode. Da geht es darum, wie man Aufgaben und Tätigkeiten kategorisiert oder die Länge schätzt und so weiter. Dann gibt es die ABC-Methode, A-Aufgaben sind super wichtig, B-Aufgaben mittelwichtig und so weiter. Dann gibt es die 10-10-10-Methode, was sind die Konsequenzen meiner Entscheidungen in 10 Minuten, in 10 Monaten, in 10 Jahren. Das sind aber alles Methoden zur Klassifizierung von einzelnen Aufgaben und Getting Things Done ist halt eher so das Selbstmanagement-Prinzip oben drüber, meines Erachtens nach.",
      "start": 3482463,
      "end": 3555207,
      "confidence": 0.7817511737089202,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, es gibt ganz viele Systeme und man muss sich am Ende diese Dinge rauspicken, die sinnvoll sind. Es gibt ja auch nicht das eine Scrum oder die eine agile Methode, ist eine Herangehensweise und man probiert sich dann ein System zu bauen, was für einen selbst funktioniert. Und dann sucht man am Ende ein Tool dafür, das einen auch dabei unterstützt für sein eigen definiertes System. Und dann hat man, glaube ich, ein gutes Management System gefunden. Wenn man guten Workflow und ein gutes Tool gefunden hat, gemeinsam macht es dann ein gutes System.",
      "start": 3555995,
      "end": 3587270,
      "confidence": 0.8183541666666669,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und weil wir gerade so ein bisschen über Produktivität gesprochen haben, und damit ihr so ein bisschen in den Flow kommt, haben wir eine kleine Aufgabe für euch. Geht mal bitte ganz kurz in die Podcast-App eurer Wahl, Spotify, Apple oder ähnliches, und lasst uns doch mal eine tolle Bewertung da. Braucht keine zwei Minuten, damit würdet ihr...",
      "start": 3587554,
      "end": 3602827,
      "confidence": 0.7818965517241379,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kann man also sofort machen nach Getting Things Done. Soll man sogar fortmachen.",
      "start": 3602847,
      "end": 3607250,
      "confidence": 0.6828461538461538,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und damit würdet ihr uns einen super Gefallen tun. Lasst uns mal eine Bewertung da.",
      "start": 3607290,
      "end": 3612435,
      "confidence": 0.8105333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vor allem die Apple-User bitte, dass wir mal über diese 13 Bewertungen auf Apple kommen.",
      "start": 3613095,
      "end": 3618218,
      "confidence": 0.829,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wenn ihr ein bisschen über Produktivität quatschen wollt, wie wir uns organisieren oder uns einfach Feedback zu dieser Episode geben wollt, kommt doch einfach in unsere Community. Inzwischen haben wir eine Discord-Community, wo schon gut was los ist. Da könnt ihr natürlich auch Fragen stellen.",
      "start": 3618278,
      "end": 3631646,
      "confidence": 0.7825434782608692,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Themen vorschlagen oder uns erklären, was wir für ein Bullshit gesprochen haben in der jeweiligen Episode.",
      "start": 3631666,
      "end": 3637370,
      "confidence": 0.7270625000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Link zur Discord-Community findet ihr in den Shownotes. Wir freuen euch.",
      "start": 3637410,
      "end": 3640692,
      "confidence": 0.6873636363636364,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir freuen euch. Das ist super, Andi. Wir freuen euch. Wir freuen euch, uns begrüßen zu dürfen.",
      "start": 3641998,
      "end": 3648283,
      "confidence": 0.751764705882353,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir freuen uns, euch begrüßen zu dürfen. Ich bin jetzt auch schon durch. Bis nächste Woche. Tschüss. Ciao.",
      "start": 3648323,
      "end": 3654187,
      "confidence": 0.7593888888888888,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.7806580672626654,
  "audio_duration": 3660.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
