{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/b3ae8251-d641-4dcc-a45e-73dc88c91c3c/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "624cei98lw-9ac1-4282-be5f-75be241fc409",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Warum kommen beim Duschen die besten Gedanken? Und man ist einfach drin. Und es ist so, wie wenn Kinder irgendwie mit Lego spielen, die sind da einfach bis zum Gehtnichtmehr drin, kommen irgendwann raus, sagen, ich hab Hunger. Wenn man versuchen würde, diesen Flow-Zustand mithilfe von Substanzen zu erreichen, dann würde man sterben.",
      "start": 2053,
      "end": 18201,
      "confidence": 0.8354528301886793,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wann war es das letzte Mal, als du so tief in deiner Arbeit versunken bist, dass du vergessen hast zu essen und zu trinken und nichts mehr um dich herum wahrgenommen hast? Du warst hochkonzentriert und superproduktiv. Du kanntest jeden nächsten Schritt. Dann warst du wahrscheinlich im Tunnel, in der Zone, im Flow. Der Zustand, nach dem viele Knowledgeworker streben. Und genau das ist unser heutiges Thema. Und dazu haben wir unseren ersten Gast im Podcast eingeladen. Kirill von ShiftSpace. Wir sprechen darüber, was der Flow-Zustand ist und wie er sich anfühlt, wie der Flow-Zyklus aussieht und ob dieser trainiert werden kann und versuchen zu verstehen, was mit dem Gehirn und deinem Körper bei einer solch hohen Konzentration passiert. Und los geht's!",
      "start": 20782,
      "end": 61341,
      "confidence": 0.8329180327868851,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Andi, du glaubst gar nicht, wie glücklich ich bin.",
      "start": 65647,
      "end": 68451,
      "confidence": 0.8097777777777779,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ist der Schnee endlich geschmolzen in den Bergen?",
      "start": 68491,
      "end": 70053,
      "confidence": 0.655,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Na, dann wäre ich ja unglücklich. Aber ich bin so glücklich, weil ich heute ganz wenig von dir hören muss. Weil wir haben heute eine absolute Weltpremiere. Und zwar haben wir heute unseren ersten Gast im Engineering Kiosk, der hoffentlich mehr redet als du, Andi.",
      "start": 70433,
      "end": 84651,
      "confidence": 0.8240444444444446,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das gilt zu beweisen. Aber in der Tat, normalerweise hören die Hörerinnen und Hörer uns immer nur zu zweit zu. Nämlich diesem komischen Akzent aus, wer ist das? Niederösterreich? Oberösterreich? Wo ist denn eigentlich Innsbruck?",
      "start": 85392,
      "end": 97487,
      "confidence": 0.790485714285714,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, ich gehe jetzt gar nicht drauf ein. Also mir wundert es ja, dass du irgendwelche Bundesländer kennst, die nicht Tirol sind. Also da gebe ich dir schon einen Pluspunkt.",
      "start": 98137,
      "end": 105158,
      "confidence": 0.5492,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Okay, heute ist eine dritte Stimme am Start. Wer ist die dritte Stimme?",
      "start": 105218,
      "end": 109659,
      "confidence": 0.8590769230769232,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die dritte Stimme ist von Kirill. Ich freue mich sehr, heute mit euch zu sein.",
      "start": 109679,
      "end": 115200,
      "confidence": 0.8143333333333335,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie fühlt man sich eigentlich so in einer Weltpremiere, in einem Podcast, der, ich glaube, von der ganzen Engineering Community in Deutschland gehört wird?",
      "start": 115240,
      "end": 122982,
      "confidence": 0.8158333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sehr krass auf jeden Fall, ich bin sehr aufgeregt und ich war jetzt vor ein paar Wochen das erste Mal bei der Berlinale, bei so einer Premiere.",
      "start": 123988,
      "end": 130495,
      "confidence": 0.7765555555555557,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und die haben vom Engineering Kiosk erzählt.",
      "start": 130535,
      "end": 132617,
      "confidence": 0.7777142857142857,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Und die haben gesagt, das nächste Ding für nächstes Jahr, Engineering Kiosk und jetzt bin ich hier und deswegen fühlt sich sehr spannend an und ich freue mich auch sehr.",
      "start": 132657,
      "end": 140305,
      "confidence": 0.7888333333333335,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, sehr cool, dass du auf jeden Fall dabei bist. Und um gleich mal die Vorstellung zu vollenden. Also Kirill Sivi ist Co-Founder vom großen ShiftSpace, aber da kommen wir später noch drauf zu sprechen. Und du bist zertifizierter Peak-Performance-Coach im Rahmen vom Flow Genome Project.",
      "start": 140625,
      "end": 158078,
      "confidence": 0.8184565217391304,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das ist richtig. Guter Aussprache, guter Atem.",
      "start": 158118,
      "end": 160960,
      "confidence": 0.7382857142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist noch besser als mein Doktor, eindeutig.",
      "start": 160980,
      "end": 163542,
      "confidence": 0.804375,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, das stimmt. Das stimmt. Das ist auf jeden Fall eine wirre Bezeichnung.",
      "start": 165863,
      "end": 169987,
      "confidence": 0.7533076923076923,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ist das Flow Genome Project in einem Satz?",
      "start": 170247,
      "end": 172809,
      "confidence": 0.717,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das Flow Genome Project ist eine Organisation, die versucht, den Flow-Zustand vielen Leuten zu ermöglichen und zu zeigen, was der Flow-Zustand überhaupt ist und wie man den erreichen kann.",
      "start": 172829,
      "end": 185505,
      "confidence": 0.8705517241379311,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist schon ein gutes Stichwort, dieser Flow-Zustand, weil wir haben uns natürlich überlegt in unserer Community, wir fragen mal so nach, ob es vielleicht ein paar Fragen gibt zu dem ganzen Thema und ihr habt mal gefragt, wer denn so Biohacking betreibt und was glaubst du, wie viele Antworten wir bekommen haben?",
      "start": 186025,
      "end": 199831,
      "confidence": 0.7250943396226415,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Wie viele Leute habt ihr angefragt?",
      "start": 200772,
      "end": 202093,
      "confidence": 0.4535,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Alle in unserer Community.",
      "start": 202133,
      "end": 203194,
      "confidence": 0.735,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Alle in der Community, boah. Ich glaube, schon viele. Also so bestimmt so, ja, oder?",
      "start": 203234,
      "end": 208979,
      "confidence": 0.6334666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir haben genau keine Antwort bekommen.",
      "start": 208999,
      "end": 210880,
      "confidence": 0.8636666666666666,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Keine?",
      "start": 210900,
      "end": 211000,
      "confidence": 0.109,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also, ich bin mir jetzt nicht ganz sicher. Entweder hat sich niemand getraut, über dieses Thema zu sprechen, oder es macht wirklich niemand, oder es kennt sich niemand aus. Und darum ist es natürlich ideal, dass wir heute darüber sprechen, über das Biohacking und vor allem den Flow-Zustand. Und ich persönlich kenne den Flow-Zustand ja nur von Entwicklern, wenn sie immer davon sprechen, ich bin im Flow oder nicht im Flow. Ist das überhaupt dieser Flow, von dem wir heute sprechen wollen? Oder ist das eigentlich was ganz anderes, wenn so Entwickler sagen, ich bin nicht im Flow, weil mich Slack ständig stört?",
      "start": 212121,
      "end": 245455,
      "confidence": 0.8277087378640774,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das ist auf jeden Fall der Flow von dem wir sprechen aber der Flow ist nicht einfach so ein Zustand der binär ist in dem man drin ist oder nicht drin ist.",
      "start": 246516,
      "end": 255409,
      "confidence": 0.8221875000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber kommen wir nochmal ganz, ihr fangt schon sofort mit dem Flow Thema an ich bin doch irgendwie ganz am Anfang bei diesem Biohacking Kram. Was ist denn für euch, also jetzt die Frage geht an beide, an Wolfgang und Kirill, Biohacking? Weil ich hab mal ein bisschen gegoogelt und das erste Suchergebnis, was ich hatte, da war irgendein Typ, der hat irgendeinen NFC-Chip in seinen Handrücken implementiert, damit er mit seiner Hand beim Bäcker zahlen kann. Ist das auch Biohacking?",
      "start": 255869,
      "end": 281305,
      "confidence": 0.7891481481481484,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das kann man auch zu Biohacking zählen, ist natürlich aber eine sehr extreme Form von Biohacking.",
      "start": 281345,
      "end": 286426,
      "confidence": 0.8276874999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber was ist denn das klassische Biohacking? Weniger Koffein trinken und mehr, weiß ich nicht, Karottentee?",
      "start": 286726,
      "end": 294934,
      "confidence": 0.81075,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich würd sagen, ja. Also, wenn ich hier zu den Otto-Normal-Biohacker-Personen mir mal holen würde, ich denke, ja, es ist irgendjemand, der einfach sagt, ey, ich hab superviel zu tun, ich bin superbusy und ich möchte produktiver werden. Ich möchte mich besser fokussieren können, ich möchte besser schlafen können. Und dann fängt man an zu sagen, Wie optimiere ich jetzt meinen koffein meine koffein aufnahme was kann ich sportliches betätigen was mich weiterbringt gibt es irgendwelche anderen substanzen legale substanzen. die ich nehmen kann und gibt es noch irgendwelche Technologien oder Hacks oder irgendwelche Gadgets, die mir dabei helfen können, mehr zu erreichen. Das ist, glaube ich, so der normale Biohacker und in dem Rahmen bewegt sich das. Also es sind eher so, wie werde ich produktiver, wie werde ich schneller, wie werde ich besser, aber ja, mit kleinen Mitteln. Jetzt nicht, dass man sagt, okay, ich möchte meinen Körper verändern und Chips einpflanzen.",
      "start": 294994,
      "end": 344232,
      "confidence": 0.8237272727272728,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie steht da der Flow dazu? Also wo bewegt sich dann der Flow in dem ganzen Bereich?",
      "start": 344412,
      "end": 349577,
      "confidence": 0.8118888888888889,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Vielleicht können wir mal anfangen so zu definieren was flow ist weil flow ist es gibt sehr viele synonyme mit den menschen den flow zustand beschreiben also viele sagen es ist der tunnel oder wenn leute sagen ich bin gerade in der zone viele leute die zum beispiel marathon laufen oder einfach läufer sind kennen das klassische runners high wie man sich fühlt nachdem man gelaufen ist dass man einfach. da ist und präsent ist und es ist ein sehr, sehr schwer fassbarer Zustand, weil also normalerweise ist es so, wenn du Glück hast, kommst du in den Flow, er taucht sporadisch auf und dann verschwindet er wieder. Und das ist sehr problematisch, denn wenn man nicht diese Fähigkeit hat, den Flow dauerhaft zu erreichen, dann kann man halt diese guten Sachen, die durch den Flow kommen, überhaupt nicht erzielen.",
      "start": 349897,
      "end": 391066,
      "confidence": 0.8291928571428571,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie lange dauert denn so ein Flow? Hat der irgendwie eine Zeitspanne oder kann der auch acht Stunden dauern oder ist das dann eigentlich kein flow mehr ja.",
      "start": 391086,
      "end": 400850,
      "confidence": 0.7349285714285713,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Er kann es es gibt zwei arten von flow es gibt einmal den mikro flow das sind so diese kleinen momente in dem man im flow ist sagen wir mal so ein paar stunden ich bin gerade am coden und ich bin gut im flow drin und dann bin ich wieder raus das kann von einer stunde bis vielleicht vier stunden andauern vielleicht manchmal sechs oder acht je nachdem wenn man mit koffein oder anderen sachen nochmal aufputscht, aber nicht mehr, weil der Körper verbraucht sehr viele Botenstoffe in dem Prozess, deswegen ist es eine Ressource, die relativ knapp ist.",
      "start": 400890,
      "end": 430522,
      "confidence": 0.8246200000000004,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin ja schon froh, wenn ich eine Stunde im Flow bin und jetzt erklärst du mir, dass vier Stunden Microflows sind.",
      "start": 430542,
      "end": 435845,
      "confidence": 0.7360909090909092,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Und der Macroflow, das heißt, dann geht das mehr so in die Richtung, wie kann ich mein Leben so ausrichten, dass sich alles irgendwie flowiger anfühlt, dass ich das mache, was ich wirklich machen möchte, Sachen, die mir Spaß machen, dass ich irgendwie Freunde und Hobbys h.co und wenn das in Einstimmung ist, das wäre so der Makroflow. Das ist dann kein Zustand mehr, sondern das ist eine Ebene, aus der man lebt. Und das wäre der Makroflow. Aber vielleicht sprechen wir dann nochmal ganz am Ende darüber.",
      "start": 435885,
      "end": 461545,
      "confidence": 0.8412045454545457,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wo, bei welchen Aktivitäten kann ich denn in den Flow kommen? Weil wenn sich das jetzt gerade so anhört, dann, Kann ich auch beim Fernseh gucken in Flo kommen oder beim aufräumen oder ist die Tätigkeit in der der Flo erscheinen kann? Wie nennt man das? Erscheint er? Du hast es gerade Runners High genannt, also beim Sport anscheinend.",
      "start": 461585,
      "end": 483717,
      "confidence": 0.7739999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf jeden Fall beim Sport ist es ein typischer Weg und ich glaube, es ist halt keine einfache Antwort, wenn wir jetzt einfach darauf eingehen. Ich glaube, es ist wichtig, dass wir so ein bisschen über den Flow-Zyklus reden und einfach gucken, was ist denn überhaupt der Flow und wie setzt er sich zusammen.",
      "start": 484417,
      "end": 499740,
      "confidence": 0.8278703703703705,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, dann starten wir mal in diesen Flow-Zyklus rein.",
      "start": 500184,
      "end": 503105,
      "confidence": 0.6044444444444445,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also vielleicht noch mal ganz kurz so, was ist Flow? Wenn man sich das ein bisschen wissenschaftlicher anschauen möchte, dann ist Flow, der Fachbegriff dafür, ist ein NOC. Auf Englisch heißt das Non-Ordinary State of Consciousness, also quasi ein nicht alltäglicher Bewusstseinszustand. Und das ist dann, der reiht sich an in Sachen wie Meditation oder Träumen, quasi ein ... sehr funktionaler Zustand, der entweder zufällig oder bewusst eintreten kann. Und wenn wir in diesem Flow-Zustand sind, dann erleben wir, dass das Leben und unsere Arbeit auf eine ganz, ganz andere Art und Weise. Und hier ist wichtig zu verstehen, wie sich Flow anfühlt. Und da gibt es das Akronym, das heißt STER, S-T-E-R auf Englisch, Selflessness, Timelessness, Effortlessness und Information Richness. Das heißt Selbstlosigkeit, Zeitlosigkeit, Anstrengungslosigkeit und Informationsreichtum.",
      "start": 503145,
      "end": 559977,
      "confidence": 0.8658203125000004,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das klingt so nach einem Glückszustand eigentlich.",
      "start": 560417,
      "end": 563539,
      "confidence": 0.7724285714285715,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau. Unter anderem, es ist definitiv ein Zustand, der ganz, ganz anders ist, was du sonst normalerweise erlebst. Und der stellt sich so zusammen, dass In der Selbstlosigkeit, das Problem heutzutage ist ja, dass wir immer im Kopf leben, wir sind sehr hyperaufmerksam und hyperaktiv und diese Erfahrung von Selbstlosigkeit ist eine gewisse Entlastung für unser Gehirn, wo das Nervensystem mal tatsächlich so ein Gefühl von Ruhe und irgendwie Erneuerung erfahren kann. so ein bisschen wie man ein computer neu starten würde das ist so ein gefühl oder ein ein status der dem flow ausmacht das zweite ist diese zeitlosigkeit die eintritt dieses gefühl im moment versunken zu sein und ich glaube alle leute die vom flow sprechen, mein intuitiver mit dieses gefühl so ich weiß gar nicht ob ich jetzt eine stunde drin war oder drei stunden drin war und man ist einfach drin und das ist so wie wenn kinder irgendwie mit lego spielen die sind da einfach, bis zum geht nicht mehr drin kommen irgendwann raus sagen ich habe hunger und machen einfach weiter und genauso dieses gefühl von es gibt keinen anderen ort an den ich jetzt lieber sein würde als hier bei meiner arbeit das ist auch ein wichtiger punkt was den flow ausmacht und die letzten zwei noch mal schnell um das ganze abzurunden das andere ist die anstrengungslosigkeit also effortlessness alles funktioniert Einfach die ganzen Boten und Belohnstoffe wie Dopamin, Endorphine und so kommen in den Körper rein und sorgen einfach für ein krasses Gefühl von Zufriedenheit, Befriedigung und einfach glücklich sein. Und das letzte ist dieses Reichtum und Reichtum bezieht sich auf die Information, denn unser Gehirn ist im Flow in der Lage verschiedene Verbindungen herzustellen, zu denen wir normalerweise überhaupt nicht in der Lage sind zu kommen. Wir haben Zugang einfach zu viel mehr Daten, wir können Muster besser erkennen, Querverbindungen herstellen, dieses laterale Denken. Und all diese Sachen zusammen ergeben den Flow-State. Und ja, wie du ja schon gesagt hast, das klingt so ein bisschen magisch, irgendwie so ein bisschen WuWu, aber es gibt tatsächlich eine solide wissenschaftliche Erklärung dafür, und die heißt Transiente Hypofrontalität. Und das bedeutet im Deutschen einfach, Transient bedeutet vorübergehend, Hypo ist der Gegensatz zu Hyper, also bedeutet verlangsamen oder abschalten und Frontalität bezieht sich auf den präfrontalen Cortex des Gehirns. Und das heißt, der präfrontale Cortex des Gehirns wird für eine Weile abgeschaltet und deswegen kannst du diese Gefühle von Selbstlosigkeit, Zeitlosigkeit, Anstrengungslosigkeit und diesem Informationsreichtum erleben.",
      "start": 563579,
      "end": 713227,
      "confidence": 0.8333543689320392,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wie passt das denn zusammen, wenn ich doch in diesem Flow-Status bin, dann bin ich doch unglaublich produktiv. Ich kenn meinen nächsten Schritt, werd nicht unterbrochen, bla bla bla. Und du sagtest jetzt aber grade, da wird was abgeschaltet und da wird was verlangsamt. Mhm. Wie passt das denn zusammen, dass ich etwas verlangsame und dann deutlich produktiver bin? Also schalte ich alles ab, was ich grade nicht brauche für den Task und werde dann ... mein ganzes Gehirn auf diesen Task fokussieren?",
      "start": 714187,
      "end": 741303,
      "confidence": 0.828297619047619,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, da kommen wir schon genau in den Flow-Zyklus. Ist eine sehr, sehr gute Frage. Was passiert ist, man muss verstehen, dass Flow nicht binär ist. Es ist nicht einfach ein Zustand, wo du sagst, ich bin nicht drin, ich komm in den Flow, alles ist hyperaktiviert. Flow ist ein Zyklus, der vier Stufen hat. Und der besteht aus vier Phasen. Und die erste Phase ist die sogenannte Struggle-Phase oder die Konfliktphase. Und die fühlt sich sehr, sehr unflowig an. Und was du gerade gesagt hast, also wir wissen, dass der präfrontale Cortex im Flow ausgeschaltet ist, diese vorübergehende Hypofrontalität. Aber im Struggle ist er unglaublich aktiv. Denn im Struggle ist das Gehirn im sogenannten Beta-Zustand. Und diese Beta-Wellen sind Zeichen von ängstlichen und unruhigen Zuständen. Und das ist schlecht. Es ist schlecht, wenn es zu viel davon ist. Normalerweise Beta ermöglicht dir einfach jetzt so unsere Diskussion zu haben, unseren Podcast hier aufzunehmen, Code zu schreiben. Aber bis zum gewissen Punkt, wenn der präfrontale Cortex nur noch aus Denken besteht und du immer in dieser Beta bist und ständig erregt und gestresst bist, dann werden Cortisole und andere Sachen im Gehirn ausgeschüttet und du kommst halt in so einen Status, wo du immer gestresst bist und du kannst gar nicht in den Flow kommen. Und dann, was passieren muss in den anderen Phasen, Der präfrontale Cortex wird eher deaktiviert. Du lässt deinen Körper einfach machen. Du bist mehr in deinem Körper drin. Du blockst nicht den Flow und dann kommt man in den Flow-State. Und diese erste Phase von Struggle ist ein notwendiges Übel. Du musst durch diese Phase gehen, um in den Flow zu kommen. Es braucht einfach eine Zeit, weil wenn du, sagen wir mal, an einem neuen Problem arbeitest, gerade du willst irgendwas coden, du musst in deinen Arbeitsspeicher Informationen reintun, mit denen du überhaupt arbeiten kannst. Und Flow kann nur dann passieren, wenn du sagst, okay, mein Arbeitsspeicher ist jetzt so voll, ich checke überhaupt nicht, was ich hier machen soll, ich habe keinen Plan. Das ist dann ein Zeichen zu sagen so, okay, du hast genug Informationen jetzt angereichert bei dir im Kopf und jetzt musst du einen Schritt zurück machen, das mal wirken lassen, deaktivieren, um dann später in den Flow zu kommen. Die erste Welle, die ankommt, ist sehr stressig. Man ist sehr gestresst, das Gehirn ist auf 100 und dann muss runtergefahren werden, um in den Flow zu kommen.",
      "start": 742103,
      "end": 881539,
      "confidence": 0.8180759803921569,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und kann ich das dann irgendwie steuern? Also damit vielleicht diese Phase auch möglichst kurz ist? Also wie komme ich in die nächste Phase überhaupt hinein und habe ich da selbst Kontrolle oder muss ich da irgendwie überlastet sein, um in die nächste Stufe überhaupt zu kommen?",
      "start": 881579,
      "end": 895994,
      "confidence": 0.8032340425531915,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Es es gibt verschiedene hex die man machen kann also man man es gibt leider kein geheimnis wie man diese phase überspringen muss es du musst es einfach akzeptieren dass du dich richtig abmühen musst in diese phase um in dem flow zu kommen und das man machen kann ist je besser man in der seine arbeit wird also je besser man daran wird störfaktoren, wegzuautomatisieren, sich besser zu fokussieren, mal sein Handy wegzulegen. Also je schneller man sich da einfach durchquält, desto schneller kommst du auch in den Flow.",
      "start": 896274,
      "end": 928609,
      "confidence": 0.8232111111111112,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt die Notifications auf Slack, das sind jetzt keine Informationen, die mir helfen, um schneller durch die Phase zu kommen, sondern die stören eher dabei. Also das ist nicht diese Überladung, die ich haben will.",
      "start": 928649,
      "end": 939018,
      "confidence": 0.8323333333333331,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau, also bevor du etwas erledigen kannst, musst du eine Umgebung schaffen, in der Flow überhaupt stattfinden kann und in dem Flow passieren kann. Und genauer gesagt, brauchst du die Fähigkeit, dich zu konzentrieren und Kontextwechsel zu vermeiden. Weil es dauert einfach eine Weile, bis alles in deinem Kopf so eingestellt ist, dass du produktiv werden kannst. Und du musst viele kleine Informationen, wie gesagt, schon den Arbeitsspeicher laden, um mit dem Problem zu arbeiten. Und wenn du da mittendrin unterbrochen wirst, dann musst du ja wieder von vorne anfangen. Weißt du, das ist immer dieses, Okay, ich versuche mich da mal reinzudenken. Ein Kollege ruft mich an, eine Nachricht kommt rein. Puff, wo bin ich? Was habe ich gemacht? Fuck, ich bin wieder aus dem Flow. Deswegen ist das allererste, was man tun muss, um diese Phase zu hacken, man braucht 90 bis 120 Minuten ununterbrochene Zeit. Und dieser Punkt ist einfach nicht verhandelbar. Es gibt Studien, ich glaube, das war das Georgia Institute of Technology, das eine Studie gemacht hat und besagt hat, dass Softwareentwickler im Durchschnitt 10 bis 15 Minuten brauchen, um die Arbeit nach einer Unterbrechung wieder aufzunehmen. wenn sie es überhaupt schaffen, da wieder reinzukommen. Und die Kosten einer Unterbrechung sind einfach viel zu hoch. Wenn wir jetzt natürlich von zu Hause arbeiten, dank an Corona und New Work und Co., ist es leichter umzusetzen. Aber wenn du natürlich Kinder hast, wenn du noch im Büro bist, ist das sauschwer, sich auch mal wirklich 90 Minuten Fokuszeit zu gönnen.",
      "start": 939738,
      "end": 1014257,
      "confidence": 0.7937874015748025,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und 90 Minuten an demselben dann zu arbeiten wahrscheinlich, oder? Also es hilft mir halt nichts, an ganz vielen Dingen gleichzeitig zu arbeiten und Kontextswitches zu haben in diesen 90 Minuten, sondern es muss fokussiert am gleichen Thema sein.",
      "start": 1014683,
      "end": 1028194,
      "confidence": 0.8167948717948714,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau. Das zweite Wichtige ist eigentlich, du brauchst ein klares Ziel. Du musst immer einen Plan haben. Wenn du jetzt sagst, okay, ich möchte guten Code schreiben und ich möchte produktiv sein, dann macht es auch Sinn, irgendwie einen Plan zu haben, mal ein gutes Design zu schreiben, mal irgendwie überhaupt ein Ziel zu haben, was will ich machen. Etwas was man anpeilen kann und was man als Leitfaden verwenden kann, um auf Kurs zu bleiben, weil genau was du sagst Wolfgang, man muss an dem Thread bleiben, man muss an dieser einen Idee bleiben.",
      "start": 1028233,
      "end": 1052392,
      "confidence": 0.7786105263157893,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In der Vorbereitung zu diesem Thema hab ich gelesen, dass dieser ganze Status von Flo untersucht wurde. Und ... beziehungsweise, dass der halt entwickelt wurde und dass das beobachtet wurde. Aber primär bei Chirurgen und Extremsportlern. Und dass es erst seit relativ kurzer Zeit diese Flo-Theorien auch für rein geistige Aktivitäten in Anspruch genommen wird. Würdest du sagen, eine Hirntransplantation ist ein ganz klares Ziel für den Chirurgen?",
      "start": 1052997,
      "end": 1081418,
      "confidence": 0.8283823529411763,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee also du hast recht mit der sache ich glaube der das allererste mal wo der flow zustand beschrieben wurde das kommt eigentlich aus so nah tot erfahrungen ich glaube william james war die erste person die darüber gesprochen hat er war irgendwo in den bergen, Wandern und es kam ein starker Winter auf und er hat irgendwie sein Hut, sein Hut ist weggeflogen und er wollte danach greifen und ist einfach in die Tiefe gestürzt. Er hat überlebt zum Glück und hat dann berichtet und gesagt okay in diesem Moment wo ich gestürzt bin von dieser Klippe, hatte ich so eine krasse geistige Klarheit wie ich das noch nie hatte. Die Zeit, war fast vollkommen still, ich hatte genug Zeit, um zu schauen, was geht eigentlich ab, was soll mein nächster Schritt sein, und so all die ganzen Sachen. Und dann hat er einfach einmal angefangen zu gucken, okay, haben andere Leute das auch? Und dann hat er das bei anderen Leuten, die Nahtoderfahrungen hatten, erlebt, und dann hat sich das weiter und weiter ausgeweitet. Und natürlich, wenn's um Extremsportler geht, die spielen ja natürlich so oder leben an der Grenze von Leben zu Tod durch ihre verschiedenen Stunts und Co. Und deswegen waren das auch so die Personen, die dann gesagt haben so, ey, yo, Flow-Zustand ist real und ist cool und wie kommt man dahin? Und dann wurde da ganz viel Geld und Interesse mit reingesteckt und diese Techniken wurden so ein bisschen entschlüsselt und dann viel verfügbarer gemacht auch für uns Normalsterbliche. Weil das Coole ist, Jeder kann den Flow Zustand erreichen wirklich das Flow ist wirklich komplett 100% Open Source. Jeder hat Zugang dazu, jeder kann das auf sein Device und sein Meetsuit zum Laufen bringen und man muss halt nur verstehen, wie sieht denn der Source-Code eigentlich aus und das ist, über was wir heute reden, das ist dieser Flow-Cycle.",
      "start": 1083313,
      "end": 1183108,
      "confidence": 0.8183734177215188,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber jetzt sind wir immer noch im ersten Schritt, also dieses Überladen, diese 90 Minuten, Fokus. Wie kommen wir jetzt in den zweiten Schritt und was ist der zweite Step eigentlich?",
      "start": 1183849,
      "end": 1193854,
      "confidence": 0.7829032258064514,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau, also nach dem ersten Schritt, wo wir sagen, ununterbrochene zeit wir haben klares ziel wir versuchen reibung weg zu automatisieren brauche ich noch einen zweiten screen benutze ich irgendwie nur meine tastatur um keine kontakt switch zu haben jade jade, Das ist Nummer eins und bevor wir in den zweiten Schritt springen, gibt es eine wichtige Regel und das ist die goldene Regel des Flows, weil das ist eigentlich allentscheidend für den Flow-State. Das größte Problem, was wir haben, wenn es um Flow geht, ist die Prokrastination und die goldene Regel des Flows ist die Challenge-Skill-Ratio, also auf Deutsch die Herausforderung Fähigkeitsgleichung. Und die besagt, dass wenn die Herausforderung meine Fähigkeiten zu sehr übersteigt, also Herausforderungen auf der Y-Achse und meine Fähigkeiten auf der X-Achse, Wenn die Herausforderungen für meine Fähigkeiten zu gering sind und dann werde ich einfach Däumchen drehen, mir ist langweilig, habe überhaupt kein Interesse für die Arbeit, weil das ist so einfach und ich bin so überqualifiziert, da komme ich nicht in den Flow. Und andersrum, wenn ich jetzt vielleicht ein Newbie bin und ich kriege das komplexeste Problem ever und ich habe überhaupt keine Skills dafür, dann habe ich nur noch Stress und kann eigentlich auch nicht in den Flow kommen. Und Flow liegt genau in dieser Mitte zwischen Langweile und angst und die idee hinter dem gleichgewicht ist zwischen herausforderung und fähigkeit dass die herausforderung etwas größer sein sollte es gibt so eine zahl die ist aber so ein bisschen aus der luft gegriffen dass man sagt wenn die herausforderung die du angehst vier prozent höher ist als als das was du kannst als deine fähigkeit dann bist du im flow.",
      "start": 1193894,
      "end": 1288724,
      "confidence": 0.8171510791366899,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das erinnert mich sehr an Radical Candor. Keine Ahnung, ob du das zufällig kennst, das Buch, aber wo es eben auch darum geht, dass man eben immer in gewisser Weise ein bisschen gefordert sein muss, damit man überhaupt sinnvoll arbeiten kann.",
      "start": 1289044,
      "end": 1301369,
      "confidence": 0.7983170731707314,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau, genau. Und es gibt halt so diese zwei Archetypen, wenn es um Flow geht. Einmal würde ich die jetzt so als Typ A bezeichnen, das ist eine Person, die immer ständig aufs Gaspedal tritt. Und das Problem ist so, nee, du gibst nicht 4%, sondern du gibst 20% mehr, 50% oder 200% mehr Gas und du schießt routinemäßig über das Ziel hinaus. Und du wirst aus dem Flow-Kanal einfach gekickt. Und wenn du so eine Person bist, dann ist das Allerwichtigste, dir nicht diese ehrgeizigen Ziele zu setzen, aber eher kleinere und überschaubare Aufgaben zu setzen. Und wenn du eher der andere Typ bist, also sagen wir mal Typ B, dann bist du eher vielleicht jemand, der so ein bisschen tiefgründiger denkt und nicht so sehr in diese Intensität stürzt, dann ist das Problem eher, dass du nicht genug tust. Ja, vielleicht bist du bei Null oder sogar bei negativen 4 Prozent und um in den Flow zu kommen, musst du deine Leistung ein bisschen steigern und aus der Komfortzone noch mehr rauskommen. Aber genau, um in den Flow reinzukommen, muss man immer so ein bisschen mehr machen, als man eigentlich sich zutraut.",
      "start": 1301409,
      "end": 1356072,
      "confidence": 0.7925876288659796,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie finde jetzt diese vier Prozent, das klingt ja für einen Informatiker immer super praktisch, da ist eine Prozentanzahl, das heißt, das kann ich super berechnen in irgendeiner Formel.",
      "start": 1356541,
      "end": 1365245,
      "confidence": 0.7366333333333334,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nee, auf gar keinen Fall, auf gar keinen Fall. Also nicht, dass ich wüsste, vier Prozent soll einfach verdeutlichen, es soll nicht zu krass sein, Ein bisschen und das ist eine Zahl die in der Studie mal gefallen ist, ich glaube da haben die mit BMX Fahrern gearbeitet und haben das irgendwie ausgerechnet, dass es vier Prozent sind, aber die Zahl an sich ist egal. Wichtig ist einfach zu wissen, du musst ein bisschen mehr geben als du denkst, dass du geben kannst.",
      "start": 1365505,
      "end": 1388179,
      "confidence": 0.7673734939759038,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt gibt es aber auch noch verschiedene Arten von Menschen. Also ich meine, du hast ja wahrscheinlich auch schon verschiedene Arten von Menschen in deinem Leben getroffen. Manche Leute, die sagen, gib mir einfach jede Aufgabe, ich mach das schon. Ja, so nach dem Motto, ich bin eh der Klügste und ich mach das jetzt alles. Und dann gibt's die Leute, uh, hab ich noch nie gemacht, trau ich mir nicht zu. Also wirklich so nach dem Motto, die machen nur das, was sie gelernt haben und was sie sich dann gegebenenfalls wirklich zutrauen. Und jetzt ist nämlich genau das Problem, dass du sagst, okay, die Aufgabe muss vier Prozent schwieriger sein. Also man muss immer, ich sag mal, ein bisschen aus seiner Komfortzone herausgehen. Wie passt das auf den Menschentyp, der sagt, meine Komfortzone verlass ich nicht gerne, ich trau mir das jetzt hier grad nicht zu?",
      "start": 1388219,
      "end": 1429618,
      "confidence": 0.7773445945945948,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau so, dass es sehr kleine Schritte sind. Und dass man die Komfortzone, dass man Experimente fährt, dass selbst wenn man versagt in dieser Aufgabe, dass es dann nicht das Ende der Welt ist. Also diese Schritte so klein zu gestalten, dass die wirklich ungefähr ... sagen wir mal vier prozent härter sind und ich meine wenn wenn eine person sagt ich bin überhaupt nicht bereit sogar zwei oder drei prozent mehr von zu geben als ich kann gut dann ist es dann muss man herausfinden warum das bei der person der fall ist und das hat mit verschiedenen aspekten dann zu tun warum die person so geblockt ist aber die müsste man dann erst mal angehen bevor die person dann wirklich in den flow kommen könnte weil das ist ein blocker für flow wenn man nicht bereit ist ein bisschen mehr zu machen als man.",
      "start": 1429658,
      "end": 1469960,
      "confidence": 0.8290547945205483,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hat ja auch dann extrem viel mit Motivation zu tun und das ist ja dann auch nochmal ein anderes Thema, um die Motivation wirklich zu finden, dass man eben auch Gas gibt und eben nicht nur das Nötigste macht und die 50 Prozent gibt, sondern dass man halt auch Spaß hat und dann vielleicht ja auch mehr. mehr erreichen will und dadurch dann auch mit diesen vier prozent irgendwie in berührung.",
      "start": 1470298,
      "end": 1490208,
      "confidence": 0.8005555555555554,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Kommt ja da kommt definitiv definitiv na jeder mensch wird ja anders motiviert es gibt verschiedene motivatoren und das dann zu finden um eine person dazu zu sagen so hey versuchen wir ein bisschen mehr das das ist der richtige weg.",
      "start": 1490228,
      "end": 1501395,
      "confidence": 0.7491219512195122,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich probiere es mal wieder zurück zu kommen zu den vier steps ist der zweite step jetzt schon der flow.",
      "start": 1501695,
      "end": 1506040,
      "confidence": 0.7668571428571428,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "State oder kommt da noch noch nicht es kommt noch was davor und zwar ist es die release phase man man macht also einen kleinen schritt zurück also das was andi gesagt hat so ist man jetzt immer auf 100 oder warum muss man jetzt abschalten. Und also nehmen wir mal an, du arbeitest in einem großen Projekt auf der Arbeit. Du musst ein großes Infrastrukturproblem lösen, super komplex, super viel bewegliche Teile, Abhängigkeiten, jada, jada. Und du merkst irgendwann so, du bist kurz davor aufzugeben, weil du einfach keinen Fortschritt machst und alles, was du bis jetzt versucht hast, scheitert einfach nur. Und du hast jetzt zwei Möglichkeiten. Du kannst jetzt entweder weiter auf den Bildschirm starren, mehr Kaffee trinken, deine Termine absagen, Freundinnen anrufen, hey, ich komme heute nicht nach Hause. und gibst dem einfach nochmal mehr Druck. Nummer eins. Oder du gibst einfach auf, du klappst dem Laptop zu und gehst irgendwie mit deinen Kollegen Kicker spielen, gehst mal kurz spazieren. Wofür würdet ihr euch instinktiv jetzt entscheiden?",
      "start": 1506060,
      "end": 1558858,
      "confidence": 0.7712280701754383,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich würde wahrscheinlich die entspannende Variante wählen.",
      "start": 1559118,
      "end": 1562879,
      "confidence": 0.7071428571428572,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Warum?",
      "start": 1562919,
      "end": 1563600,
      "confidence": 0.959,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt so instinktiv einfach so, warum würdest du das machen?",
      "start": 1563640,
      "end": 1566701,
      "confidence": 0.6937999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, um dann später entspannen, also um zu entspannen, um entspannt zu sein, um dann später mal in den Flow-State wiederzukommen.",
      "start": 1566741,
      "end": 1573364,
      "confidence": 0.8468571428571428,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Andi, was ist mit dir?",
      "start": 1573584,
      "end": 1574364,
      "confidence": 0.34400000000000003,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das kommt immer ganz drauf an. Das ist Andis Lieblingsantwort, nur nicht festlegen. Nein, nein, nein. Ich gebe euch die Antwort, gar kein Problem. Der klassische Software-Ingenieur, der sagt, wenn es nicht klappt, dann lässt man das Skript einfach nochmal laufen und nochmal laufen und nochmal laufen. Jeder weiß, das wird nicht funktionieren, macht es trotzdem. Was ist eigentlich die effektivste Variante? Einfach mal einen Spaziergang machen oder eine Runde Sport machen oder Schlafen und dann einfach wieder zurückzugehen. Das weiß auch jeder, doch es macht einfach niemand. Was ist die effektivste Methode zum D-Wagen? Einfach eine Pause machen. Aber nein, wir führen das weiter und hämmern da auch rum. Also, instinktiv härter, härter, härter, bis ich wieder merke, scheiße, ich sollte einfach spazieren gehen.",
      "start": 1574735,
      "end": 1618733,
      "confidence": 0.762484126984127,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja ja du du du fasst das dilemma zusammen also die weise entscheidung wäre es aufzugeben und dann somit kommen wir dann in diese phase des loslassens wie wir gesagt haben in der in der ersten phase ist der prefrontale cortex sehr aktiv und wenn wir in diese entspannungsphase eintreten dann lenken wir uns buchstäblich von dem problem ab, und hören auf, über Aufgaben nachzudenken. Und wenn das passiert, kommt es zu einer Aussetzung oder beziehungsweise zu einer Freisetzung von einem Botenstoff namens Nitrous Oxide und der spült Stresshormone aus dem System weg. Also das Cortisol und das Adrenalin, das sich während der Struggle-Phase angesammelt hat, wird ausgeschüttet und das ist dann wiederum, was dich in den Flow bringt. Wir werden ruhiger, unsere Gehirnwellen verlangsamen sich, man schaltet von diesen Beta zu einem eher kaskadierenden Alpha-Takt und wir werden entspannter, bewusster und wacher. Das ist so der Grund dann, warum man in den Flow kommt.",
      "start": 1618993,
      "end": 1676621,
      "confidence": 0.8550645161290319,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Heißt es auf gut Deutsch, dass ich nach meinen 90 Minuten hartem Kampf mit dem Programm am besten einen Kaffee trinken gehe, um dann mal zu entspannen?",
      "start": 1676661,
      "end": 1685710,
      "confidence": 0.8282222222222221,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, es reicht nicht einfach aus, einfach mit dem aufzuhören, was man gerade tut, um die Phase optimal zu nutzen. Und es gibt, und Andi kennt diese Methode schon, aber das ist so, dass das, was ich jedem sage, wenn mich jemand fragt, so okay, was kann ich in dieser Phase machen, und zwar ist es die MacGyver-Methode. Und ich weiß nicht, hast du das noch auf dem Schirm?",
      "start": 1686575,
      "end": 1708380,
      "confidence": 0.8089855072463771,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hab's jetzt gerade nicht mehr auf dem Schirm. Also für alle Hörerinnen und Hörer, der Kirill und ich haben eine kleine Vergangenheit, weil wir kennen uns nämlich, weil diese ganze Sache, die der Kirill gerade erzählt, die hat er in diversen menschlichen Experimenten früher mal bei Trivago gemacht. Und zwar hat er bei Trivago mal eine Art Flow Lab gemacht. Da ging es nämlich, bitte hau mich jetzt nicht, wenn ich es falsch zusammenfasse, da ging es eigentlich genau darum, du hast eine Gruppe von Leuten, mit denen machen wir ein paar Experimente in der Hoffnung, dass man denen beibringen kann, wie sie diesen Flow-Status in irgendeiner Art und Weise trainieren können. War das richtig?",
      "start": 1708420,
      "end": 1745348,
      "confidence": 0.7984913793103445,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was meine Erinnerung daran ist, ist, dass der Kirill einfach immer Leute in irgendein Wasser gelegt hat und dann waren sie entspannt und konnten mehr Code ausspucken. Das war so meine Erinnerung daran.",
      "start": 1745988,
      "end": 1759192,
      "confidence": 0.8477878787878788,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Tatsächlich, das war der Floating Tank, unser Sensory Deprivation Chamber.",
      "start": 1759232,
      "end": 1763373,
      "confidence": 0.8051,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also diese ganze Flowlab-Geschichte bei Trivago war völlig insane. Also am Anfang war das ne ziemlich coole Sache und das wurde dann immer ein bisschen esoterischer bis zu irgendeinem Flowtank, wo dann Salzwasser drin war. Das war so ein riesengroßes Ei, da war warmes Wasser drin, Salzwasser und da war so viel Salz drin, dass du wirklich gefloated bist. Und dann, also das war, ich weiß nicht, das war ganz komisch, fast, dass man zusammenkirche.",
      "start": 1764514,
      "end": 1790292,
      "confidence": 0.710293333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also Andi, wenn das schon esoterisch ist für dich, das ist ja eine sehr alte, schon fast eigentlich bewiesene Technik, oder? Meines Wissens.",
      "start": 1790332,
      "end": 1797821,
      "confidence": 0.8429565217391304,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Auf jeden Fall, das wurde glaube ich damals entwickelt um den Effekt von verschiedenen Drogen oder sogar LSD glaube ich nochmal zu messen. Was passiert genau, du bist in diesem Space Egg, du floatest im Wasser was ungefähr Körpertemperatur hat, also sagen wir mal so 37 Grad und es ist komplett dunkel dort, du hörst nichts und nach einer Weile, nach 10 Minuten durch das warme Wasser verlierst du auch das Gefühl vom Körper. Und das heißt, du bist in dieser Dunkelheit nur mit deinem Denken und du bist da so drin und denkst dir so, wow, das ist ja krass. Und das ist halt ein Zustand, in dem man viel machen kann. Man kann dort meditieren, man erreicht da, man kann so tief in die Meditations kommen, nur in diesen 45 Minuten, wenn, also da müsste ich in einer traditionellen Meditation vielleicht 5 Jahre üben oder 10 Jahre üben, um da reinzukommen. Und das war nämlich so der Hack wo wir gesagt haben so wie können wir Leute dahin bringen auf den schnellsten Weg und die krasseste Idee war ja lass doch mal so ein Floating Tank kaufen und das habe ich dann kurzerhand einfach mal gemacht und dann habe ich da zum Beispiel auch Andi mit reingesteckt.",
      "start": 1798655,
      "end": 1854992,
      "confidence": 0.7915598086124399,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und entspricht es jetzt diesem zweiten Schritt wenn ich mich da reinlege in diesen Floating Tank?",
      "start": 1855452,
      "end": 1859735,
      "confidence": 0.733625,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Der Floating Tank entspricht dem vierten Schritt, da greifst du schon ein bisschen voraus.",
      "start": 1860255,
      "end": 1864697,
      "confidence": 0.7410714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir waren bei der MacGyver-Methode.",
      "start": 1864718,
      "end": 1866378,
      "confidence": 0.8573999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau.",
      "start": 1866418,
      "end": 1866799,
      "confidence": 0.904,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich weiß leider nicht mehr, was die MacGyver-Methode war.",
      "start": 1866819,
      "end": 1868940,
      "confidence": 0.8573333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber danke dir noch mal für den Exkurs. Flowlife war eine echt schöne Zeit. Die MacGyver-Methode, also, ich hoffe, dass jeder weiß, wer MacGyver ist und schon mal die Serie gesehen hat. Ich würde das so irgendwie zusammenfassen als so ... Sie handelt von gewaltfreien Problemlösungen, weil MacGyver benutzt ja keine Waffen. Sondern er kämpft gegen die Bösewichte mit der Kraft des Gehirns.",
      "start": 1869180,
      "end": 1891992,
      "confidence": 0.7918571428571429,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, und mit Kugelschreibern und Gaffer-Tape entschärft er immer Bomben.",
      "start": 1892032,
      "end": 1894913,
      "confidence": 0.6013,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, genau. Und die Methode heißt nämlich so, jetzt fragt ihr euch so, what the fuck, warum heißt die Methode so? Weil Lee Slotoff, der Schöpfer von MacGyver, hat sich diese Methode ausgedacht. Weil er hat diese Methode genutzt um halt diese Serien zu schreiben und halt alles den den Skript zu schreiben den er für MacGyver nutzt und deswegen heißt es die MacGyver Methode hat jetzt also nur indirekt was mit MacGyver zu tun.",
      "start": 1894953,
      "end": 1916110,
      "confidence": 0.8100400000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich wollte schon immer MacGyver im Podcast haben ideal eigentlich auch wenn den niemand mehr kennt wahrscheinlich ich glaube wir sind schon alle zu alt eigentlich.",
      "start": 1916150,
      "end": 1923377,
      "confidence": 0.7753333333333333,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das könnte sein aber MacGyver fand ich echt eine coole Serie sollten sich Leute auf jeden Fall mal angucken.",
      "start": 1923637,
      "end": 1928542,
      "confidence": 0.6598947368421054,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aus den 80ern, glaube ich, oder?",
      "start": 1928946,
      "end": 1930807,
      "confidence": 0.7385,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ende 80er, schätzen wir mal.",
      "start": 1930847,
      "end": 1932228,
      "confidence": 0.6103999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kurzer Zwischenruf, aber Bud Spencer und Terrence Hill, da sind wir uns noch alle einig, die kennt ihr auch noch, ne?",
      "start": 1932248,
      "end": 1937712,
      "confidence": 0.6740476190476191,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Natürlich, natürlich. Zwei Fäuste für ein Hallelujah. Das sind die ganzen Klassiker, auf jeden Fall.",
      "start": 1937752,
      "end": 1942675,
      "confidence": 0.6341999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, was war denn jetzt die MacGyver-Methode? Irgendwas ohne Waffen.",
      "start": 1943275,
      "end": 1946337,
      "confidence": 0.6204000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, einfach ohne Waffen. Also, die Methode ist auch wieder, Drumroll, ein vierstufiger Prozess. Irgendwie zieht sich das.",
      "start": 1946377,
      "end": 1952841,
      "confidence": 0.7233333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist rekursiv. Jetzt steigen wir in den neuen stufigen Prozess ein. Aber schieß los.",
      "start": 1953141,
      "end": 1959648,
      "confidence": 0.5695333333333333,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also, Schritt 1. Schreib auf, was die ideelle Lösung ist für das Problem, an dem du gerade arbeitest. Wie würde eine Lösung aussehen und versuch das so genau wie möglich zu beschreiben. Wichtig, mit der Hand schreiben. Es gibt nämlich eine direkte Verbindung zwischen der Handschrift und dem Gehirn, die wir hier uns zu Nutze machen wollen. Und auch wenn du überhaupt nicht weißt, wie die Lösung ist und das noch sehr vage ist, versuchst du wirklich nochmal zu sagen, so hey, genau so sollte die Lösung aussehen, das sollte es können. Einfach nur, dass du diesen Primer hast, so worauf möchte ich hinaufarbeiten. Dann gehst du rein durch diese struggle phase du schreibst es auf versuchst ein bisschen was zu machen und dann gehst du für je nachdem wie gut du bist eins bis vier stunden vom problem weg wenn man komplett anfänger ist und das noch nicht gemacht hat halber tag ist immer gut und wenn man diese übung zum ersten mal lernt ist es. Am besten sogar auch noch eher ein Nap zu machen oder über Nacht zu schlafen, bevor man zum Problem zurückkehrt, weil das Problem braucht ein bisschen, das Gehirn braucht ein bisschen Zeit, um das Problem zu lösen. Also, und da ist es jetzt ganz wichtig, was machen wir da, um das zu nutzen, also bei diesem Weg vom Problem. Auch Lee Slotow hat Research gemacht und hat gesagt, okay, du musst irgendetwas machen, es soll dich anregen, die Aktivität, aber es soll dich auch wieder nicht überfordern. Da sind wir wieder beim, golden rule of flow mit dem vier prozent und er hat rausgefunden dass modell flugzeuge bauen das beste ist was du tun kannst und der grund warum das so ist weil das erscheint auf den ersten blick so ein bisschen seltsam so die aktivität aber wenn man genauer hinsieht ergibt das echt viel sinn weil es es wird die feinmotorik gefördert du du baust irgendwas na du du baust ein kleines flugzeug da ist ganz kleine teile die feinmotorik wird engagiert und du wirst weder geistig noch körperlich zu sehr angestrengt. Und man kann, also wenn man sagt, okay, ich bin jetzt nicht so der Dino oder Flugzeugbauer, kannst du auch Gartenarbeit machen, zu Hause putzen, längeren Spaziergang machen, der halt weder körperlich noch geistig zu anstrengend ist. Und mein persönlicher Favorit, und ich glaube, das könnte vielleicht einer von euch sein, ist das Duschen. Weil ich glaube, die meisten kennen ja das Subreddit ShowerThoughts, wenn man so ein bisschen darüber nachdenkt. Also eigentlich ist das der krasseste ShowerThought. Warum kommen beim Duschen die besten Gedanken? Und das liegt daran, dass diese Kombination aus fließendem Wasser auf dem Rücken, auf unserem Körper, das Einseifen, Massieren, uns in einen Zustand von so völliger Versenkung versetzt. Weg von diesem erregierten präfrontalen Kortex und dem Stress, in den Körper rein, in einen ganz, ganz entspannten Zustand. Und wenn wir das schaffen, unseren Körper da hinzukommen, dann kommen diese Gedanken auf und du lässt dein Gehirn einfach mal machen. Und dann kommen diese ganzen Shower Thoughts und dann denkt man sich ganz, ganz komische Sachen aus.",
      "start": 1959708,
      "end": 2118565,
      "confidence": 0.8182015355086371,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Mein Professor an der Uni hat immer gemeint, Time-Tracking ist bei Wissenschaftlern nicht möglich, weil die eigentliche Wissenschaft passiert immer unter der Dusche und die besten Ideen kommen.",
      "start": 2118929,
      "end": 2127384,
      "confidence": 0.865035714285714,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Unter der Dusche und er will kein.",
      "start": 2127404,
      "end": 2128887,
      "confidence": 0.5938571428571429,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Time-Tracking daher für Wissenschaftler.",
      "start": 2128907,
      "end": 2130891,
      "confidence": 0.605,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Unterstützt sich zu 100 Prozent. Genau so ist das. Nochmal, um das zu qualifizieren, Andy. Ich glaube, besonders wenn wir vom Rechner sitzen, alle Aktivitäten, wo es darum geht, am Rechner zu sitzen, spielen, Netflix gucken, funktioniert leider nicht, weil das Problem da ist, bei Bildschirm ist einfach die hohe Flimmerrate und der Bildwechsel. Weil wenn man im Entspannungsmodus ist und möchten, dass das Gehirn weg vom Alphazustand weggeht, aber das Bild wechselt die ganze Zeit, dann wird die Wachsamkeitsreaktion unseres Gehirns immer ausgelöst und du schaltest immer in diesen Beta-Stresszustand. Und du kommst überhaupt nicht zur Ruhe, deswegen kein Netflix, kein Gaming und nichts auf dem Screen, das ist noch sehr, sehr wichtig zu erwähnen.",
      "start": 2131348,
      "end": 2166434,
      "confidence": 0.7907327586206895,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dass ich bei Gartenarbeit entspannen kann, okay, das verstehe ich, aber beim Flugzeuge, Papierflugzeuge bauen?",
      "start": 2166474,
      "end": 2171378,
      "confidence": 0.7704000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder Modellflugzeug bauen, ne? Guck mal, du bist ja, du faltest ja Sachen einfach mit deinen Händen, es geht um die Feinmotorik, das ist so eine Art Meditation, aber jetzt nicht so eine Meditation, wo du sagst, ich achte auf meinen Atem, sondern ich mach noch was dazu, ne? Für Leute, die vielleicht nicht still sitzen können.",
      "start": 2171458,
      "end": 2185028,
      "confidence": 0.7124035087719299,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was ist dann der dritte Schritt der MacGyver-Methode?",
      "start": 2186015,
      "end": 2189100,
      "confidence": 0.8822222222222221,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nachdem man das gemacht hat, kommt man einfach wieder zurück, setzt sich hin und arbeitet weiter an der Aufgabe. Also sobald diese Tätigkeit fertig ist, kann man sich wieder dem Problem zuwenden. Wie gesagt, wenn man Anfänger ist, mindestens einen halben Tag warten oder mal eine Runde schlafen gehen und dann normalerweise, wenn du wieder zur nächsten Arbeitssitzung zurückkehrst, fängt an, die Lösung der Aufgaben nach etwa fünf Minuten zu kommen einfach. Dann fangen wir an, in diesem Flow-Zustand zu kommen und die Lösung kommt von selbst und du musst nicht viel machen.",
      "start": 2189140,
      "end": 2218120,
      "confidence": 0.8570752688172041,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ist die MacGyver-Methode jetzt gleichzusetzen mit den vier Schritten, um in den Flow zu kommen? Sind das eigentlich dieselben Schritte da?",
      "start": 2218499,
      "end": 2227006,
      "confidence": 0.8302272727272726,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nicht ganz, mehr oder weniger, aber in der zweiten Stufe ist das aber ein wichtiges Tool, wie man zur Entspannung kommt. abschalten kann, also dieses Modellflugzeug bauen, das ist genau was du brauchst, um abzuschalten, damit du dann im nächsten Schritt in den Flow kommst. Der Flow Cycle hat dann noch einen vierten Schritt, das ist die Recovery und das ist hier zum Beispiel bei dem Modell nicht der Fall, aber wie du merkst, folgt alles so diesem Ziel, so hey, es ist nicht binär, du musst irgendwas machen, was so ein bisschen schwerer ist, als du sonst machst und das sind so die universellen Regeln, die sich durch viele Sachen durchziehen.",
      "start": 2227026,
      "end": 2259528,
      "confidence": 0.8330982142857142,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also beim flow cycle der dritte step ist dann im flow sein und der vierte step ist dann wieder rauskommen oder das entspannen. Gibt es beim entspannen auch irgendwas zu beachten.",
      "start": 2260228,
      "end": 2271615,
      "confidence": 0.8186774193548387,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Vielleicht nochmal vorher wenn wir den cycle schritt für schritt nochmal betonen nicht in der dritten phase das ist halt die flow phase und das ist halt wo, Selbstlosigkeit, Zeitlosigkeit, Mülllosigkeit, Informationsreichtum mit all den Vorteilen reinkommt. Hier produziert der Körper super viel Wohlfühlhormon, Dopamin, Serotonin, Endorphine, Kreativität, Motivation, Konzentrationsfähigkeit, das alles geht durch die Decke, also all diese buzzwords, die bei Flow immer genannt werden. Interessant anzumerken, hier ist tatsächlich, es ist die einzige Zeit, in der unser Gehirn all diese Neurochemikalien gleichzeitig ausschütten kann. Wenn man versuchen würde, diesen Flow-Zustand mithilfe von Substanzen zu erreichen, dann würde man sterben. Das versteht sich natürlich von selbst so. Nicht versuchen, durch irgendwelche Substanzen in den Flow-State zu kommen. Und das ist eigentlich auch der Grund, warum Flow als der erstrebenswerteste und süchtig machendste Zustand bezeichnet wird, den ein Mensch erleben kann und deswegen schwören halt so viele Leute im Extremsport da drauf, weil das ergibt einfach einen sehr krassen Kick.",
      "start": 2271635,
      "end": 2329778,
      "confidence": 0.8111937500000005,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber heißt das nicht auch gleichzeitig, dass dieser Flow-Zustand unglaublich anstrengend für den Körper ist?",
      "start": 2331433,
      "end": 2338295,
      "confidence": 0.7919999999999997,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Definitiv. Und deshalb kommen wir hier genau in die letzte Phase und das ist die Recovery. Genau wie du sagst, Andi, nachdem der Flow-Zustand abklingt, hast du einen Großteil deiner Neurochemie verbraucht und eine Menge Energie aufgewendet. Du hast so viele Informationen ausgesetzt als im normalen Zustand, was natürlich cool ist, aber es ist sehr, sehr anstrengend. Und es gibt im Flow diese eingebaute Erholungsphase. In der Regel hast du halt noch sehr viel Serotonin im Körper, sodass es eine sehr ruhige und sehr friedliche Phase ist. Der wichtigste Teil der Erholungsphase findet im Schlaf statt, im Tiefschlaf, im sogenannten Deltaschlaf. Weil da werden auch unsere Erinnerungen gefestigt und Informationen integriert und im Schlaf covert das Gehirn dann am meisten. Deswegen, wie du sagst, super anstrengend. Deswegen kann man nicht immer im Flow-Zustand sein, auch nicht über eine super lange Zeit. Und die Erholung ist super, super wichtig. Genau auch, weil sie oft übersprungen wird.",
      "start": 2338315,
      "end": 2396793,
      "confidence": 0.8516064516129034,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wenn du jetzt am Anfang von Microflows gesprochen hast, von den ein bis vier Stunden, ist dann das die maximale Dauer für so einen sinnvollen Flow? Oder kann man über vier Stunden auch so in dem Flow sein, realistischerweise? Oder brauche ich irgendwann diese Entspannung, um wieder fit zu werden?",
      "start": 2397414,
      "end": 2414903,
      "confidence": 0.8533725490196079,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Du brauchst auf jeden Fall die Entspannung am Ende, wenn du irgendwann wieder in den Flow-Zustand kommen möchtest. Es ist sehr schwer zu sagen, wie lang man im Flow-Zustand sein kann, weil das ist sehr abhängig von der persönlichen Neurochemie, vom Körper. Es gibt sehr, sehr viele Faktoren. Ich persönlich kann sagen, ich glaube, mein längster Flow-Zustand, wo ich wirklich im Flow war, war ungefähr vier bis fünf Stunden. Aber ich hatte auch irgendwie kleinere Flow-Momente, die nur 45 Minuten, halbe Stunde oder so gedauert haben, wo ich aber dann wirklich im Flow war. Mehr habe ich leider nicht geschafft, ich kenne aber von anderen Leuten, die sagen, hey, ich bin irgendwie für sieben Stunden im Flow, aber schwierig.",
      "start": 2415303,
      "end": 2449626,
      "confidence": 0.8040672268907565,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das würde aber auch dieser ganzen Theorie eigentlich entsprechen, dass man nicht zehn, voll acht Stunden durcharbeiten kann.",
      "start": 2450226,
      "end": 2456235,
      "confidence": 0.8786111111111111,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Hundertprozentige Zustimmung auf jeden Fall dafür, ja.",
      "start": 2456335,
      "end": 2458338,
      "confidence": 0.7025714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt, wenn ich mir überlege, okay, ich habe jetzt eine, wie heißt die erste Phase nochmal? Die Struggling Phase. Wenn ich da 90 Minuten habe, dann die Entspannung und dann nochmal vier Stunden drauflegen kann, dann bin ich irgendwo bei sechs Stunden oder so und dann brauche ich eigentlich wieder die Erholung und dann wäre eigentlich das so der Sweet Spot an sinnvoller Arbeitszeit, wenn man das von der Seite zumindest betrachtet.",
      "start": 2458670,
      "end": 2482356,
      "confidence": 0.7806438356164382,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "100 prozent weil wir alle wisst zeit ist nicht gleich produktivität und nur weil ich irgendwie acht stunden an irgendwas dazu heißt es nicht dass ich gute arbeit mache und wenn wir jetzt sagen wir mal wir nehmen flow jetzt so beim wort und den ganzen claims wenn man sagt so ja im flow hat man 500 prozentige steigerung der produktivität. Dann reicht es auch, wenn ich da nur ein paar Stunden produktiv bin, dass das gleicht das alles wieder aus. Was man aber machen kann, aber da braucht man ein bisschen mehr Erfahrung, man kann ja den Tag so gestalten, dass wenn man ein bisschen runterschalten möchte, dass man vielleicht sagt, Ich mache jetzt irgendwie ein kleines One-on-One irgendwo draußen mit irgendjemand oder weißt du, geh raus und mach da irgendwie ein Call. Also, dass man versucht, die Art der Arbeit, die man macht, also die Arbeit besteht ja nicht nur zum Beispiel aus Coden, sondern man muss irgendwie mit Leuten kommunizieren und so, dass man sich versucht, das so zu legen, dass es so ungefähr dem Flow entsprechen würde. Dann kann man das vielleicht ein bisschen hacken, aber an sich braucht der Flow die Zeit und den Raum, um sich zu entfalten.",
      "start": 2482366,
      "end": 2544103,
      "confidence": 0.8018578431372548,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir sprechen jetzt die ganze zeit darüber und ich muss ich habe mich gerade selbst noch mal gefragt weil hier und da war ich auch schon mal im flow ja durch die ganze programmierkarriere aber ich muss zugeben ich kann jetzt gerade nicht mehr sagen, wann ich festgestellt habe dass ich im flow war während ich in den flow reingegangen bin während ich im flow drin war wenn ich mir bewusst werde dass ich im flow bin bin ich ja nicht mehr im flow weil dann, habe ich ja mich von dieser Konzentration gelöst. Also eigentlich wird einem doch erst, nachdem der Flow abgeschlossen war, bewusst, oh fuck, ich war jetzt gerade hier im Flow, oder?",
      "start": 2544723,
      "end": 2580432,
      "confidence": 0.7904827586206895,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Erst wenn du da rausgekickt wirst, dann checkst du das, oh mein Gott, ich war im Flow. Das ist richtig.",
      "start": 2580472,
      "end": 2584813,
      "confidence": 0.5891500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und jetzt sagtest du gerade, okay, für Leute, die ganz viel Erfahrung haben, das hört sich jetzt so an, dass das jetzt für Leute, die das öfter machen, ein Zustand ist, die schnipsen und so, so, tschüss Schatz, ich geh jetzt in den Flow, ich geh jetzt in die Matrix und sind dann weg. Kann man die ganze Sache jetzt irgendwie trainieren? Oder ist das Zufall? Oder wie komm ich jetzt in meine eigene Nachricht?",
      "start": 2585446,
      "end": 2610429,
      "confidence": 0.7711200000000005,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der Grund, warum ich sage, Leute mit Erfahrung, und was ich damit meine, ist, dass man schneller durch den Flowcycle geht. Und besonders in zwei Phasen, einmal, du gehst schneller durch die Strugglephase, du gibst nicht auf, du prokrastinierst nicht, sondern gehst durch diese Phase. Und du erholst dich tiefer und schenkst der ganzen Erholungsphase eine große Bedeutung. Und wenn du in den beiden Punkten besser wirst das ist eigentlich nur das einzige was wir besprechen sollten wenn du in diesen zwei phasen besser wirst und das meine ich mit erfahrung wenn du halt weißt so okay ich habe einen guten plan. Ich hab ein gutes Time Management, ich kann mir die 90 Minuten blocken. So diese ganzen Frictions, wenn ich die wegautomatisieren kann, dann kommst du schneller in den Flow und das macht die Erfahrung aus. Wenn ich jetzt noch nie irgendwie in meinem Leben produktiv war, ich weiß nicht, was eine To-do-Liste ist, also solche ganz banalen Sachen, ich kann mir keine zwei Stunden freinehmen, dann wird es sehr schwer, in den Flow zu kommen.",
      "start": 2610449,
      "end": 2662409,
      "confidence": 0.7979548022598875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also sagst du, dass eine gewisse Grundorganisation schon wirklich, wirklich da sein muss? Also wirklich man, ich sag mal, ist nur ganz, ganz robotisch, man muss sein Leben schon komplett im Griff haben.",
      "start": 2662749,
      "end": 2673472,
      "confidence": 0.7051212121212121,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist jetzt sehr weit ausgeholt, wenn wir sagen sein ganzes Leben im Griff haben, aber zumindest musst du produktive Arbeit auf die Reihe kriegen. Das ist schon wichtig, weil sonst ist es wirklich rein zufällig, wenn irgendwie mal alle Sterne in der richtigen Konstellation sind, dass du da mal ein Flow-Erfahrung hast. Aber bei uns geht es ja darum, wie kann ich das nachhaltig in unseren Alltag integrieren. Und da ist es super wichtig, hey, ich brauche so gewisse Basics einfach, damit ich nicht prokrastiniere, damit ich einfach durch diese schwere Phase gehen kann.",
      "start": 2673992,
      "end": 2699292,
      "confidence": 0.8069368421052632,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Meine Erfahrung ist ja sehr oft, dass gerade in der Entwickler-Szene, Entwickler, und ich gender das jetzt absichtlich nicht, oft ein Problem mit so esoterischem Zeug haben. Und das hört man ja auch sehr oft irgendwie, das ist alles nur esoterisch und warum sollte ich mich selbst optimieren und das ist alles Bullshit und es funktioniert so auch irgendwie. habe ich auch schon sehr oft gehört. Und ihr habt mir immer die Frage gestellt, warum sind eigentlich Entwickler so drauf, obwohl die ihr ganzes Leben tagtäglich irgendeinen Code optimieren und eigentlich eine sehr analytische Herangehensweise haben, wenn es dann aber um den eigenen Ablauf geht und die eigene Arbeit und so auf einem auf einer Meta-Ebene, dann blocken sie sehr gerne gegen so Zeug, was sie esoterisch nennen. Hast du da eine Idee, warum? Und hast du vielleicht auch eine Argumentation, warum das trotzdem Sinn machen würde, sich das genauer anzuschauen und vielleicht da eben Optimierung zu machen, wenn man das unbedingt Optimierung überhaupt nennen will?",
      "start": 2701314,
      "end": 2759922,
      "confidence": 0.8221385542168672,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das ist ja nochmal ein Genau, ich denke, das ist halt so ein Konstrukt, wenn man sagt, okay, es ist Optimierung, das ist irgendwie so negativ konnotiert mittlerweile, weil dann alle denken so, oh, ich implantier mir irgendeinen Chip. Darum geht's gar nicht. Ich stimme dir zu, ich weiß nicht von dem, was wir jetzt erzählt haben, was da jetzt so sehr WuWu ist. Es ist halt ein relativ klarer Prozess. Wir wissen, warum er so funktioniert. Wir wissen, welche Neurochemikalien da im Spiel sind. Und eigentlich ist das ziemlich einfach. deswegen ist es eigentlich keine ausrede der das problem ist nicht nur auf entwickler seite sondern einfach dass wir menschen sind und menschen mögen nichts was mit veränderung zu tun hat wir sind sehr komfortabel wir lieben unsere routinen wir sind wir sind wir werden nur von routin getrieben jeden tag und wenn es dann darum geht zu sagen okay ich muss jetzt meine routine hier, ändern dann sagen wir das und dann überlegst du dir jegliche ausreden wo du sagst ich möchte das nicht machen weil es ist hokus pokus weil das ist zu schwer weil das ist blöd weil das ist nicht wissenschaftlich ist nicht analytisch und der ursprung davon kann aus verschiedenen gründen sein es kann sein weil die personen so ist oder so erzogen wurde oder irgendwas passiert ist, oder ja die leute müssen einfach mal was ausprobieren und und das mal erleben einfach mal eine chance geben zu sagen so hey was könnte schon passieren wenn ich das einmal mache einen kleinen test aber ja passiert leider oft und das ist nicht nur beim flow so ich glaube jeder weiß auch wir müssen uns gesund ernähren, machen super viele nicht viele wissen wir müssen sport machen das machen auch viele nicht viele wissen wir sollen nicht rauchen machen aber leute trotzdem und das ist einfach so ein viel viel größeres thema was die so menschliche entwicklung angeht und wie wir mit gewohnheiten umgehen meiner meinung nach.",
      "start": 2759962,
      "end": 2863059,
      "confidence": 0.8058704819277103,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie kommt man denn da am einfachsten hinein in das ganze. Also betrachte ich da meinen eigenen Ablauf einfach mal und mach mir den bewusst oder was hast du da für einen Tipp, wie kann ich losstarten, wenn ich mir jetzt noch nie Gedanken darüber gemacht habe?",
      "start": 2863100,
      "end": 2877965,
      "confidence": 0.8113617021276596,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also ich denke, den Flowzyklus durchzugehen, also zu sagen, okay, ich arbeite jetzt in einem Problem, ich blog mir die neunzig bis hundertzwanzig minuten mein handy ist weg und ich habe mir jetzt eine atmosphäre geschaffen wo ich mich konzentrieren kann geht dadurch versucht da dran zu bleiben wenn man an punkt ist wo man sagt boah mein gehirn, qualmt ich komme nicht mehr weiter geht man raus geht putzen baut ein modellflugzeug, malt, macht irgendwas, schläft, macht ein Nap, kommt wieder zurück und versucht da in den Flow zu kommen und an der Sache zu arbeiten und danach sich zu entspannen, spazieren zu gehen, Sauna zu gehen, zu schlafen, Wim Hof Breathing, was auch immer zu machen und dann bist du wieder bereit dafür. Also einfach anhand von diesem Zyklus da reinzukommen, das wäre so mein bester Tipp.",
      "start": 2878025,
      "end": 2923628,
      "confidence": 0.8282086330935252,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Andi wird schon ganz kribbelig, weil er jetzt Wim Hof gehört hat, von dem schwärmt er mir ständig irgendwas vor.",
      "start": 2923668,
      "end": 2927869,
      "confidence": 0.6634499999999999,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja ich also wenn ich wenn ich hier so zuhöre dann stelle ich mir gerade die frage ob instagram und social media mir grad was positives für meine für meinen flowzyklus irgendwie ganze zeit zeigt weil die ganzen erfolgreichen leute die stehen alle um fünf Uhr morgens auf nehmen erstmal ein eisbad machen sich dann karotten smoothie und so weiter und jetzt höre ich dich hier und du erzählst mir eigentlich genau das gleiche du sagst macht.",
      "start": 2928489,
      "end": 2953107,
      "confidence": 0.7343506493506494,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist das also Moment, wo war jetzt da der Smoothie und das eiskalte Bad? Das ist nirgends vorgekommen bisher.",
      "start": 2953127,
      "end": 2959617,
      "confidence": 0.69945,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Naja, du sagst halt, okay, gesunde Ernährung. So ein Karotten-Smoothie kann ja halt jetzt nicht so verkehrt sein. Nee, meine Frage ist eigentlich, okay, du sagst jetzt grad eigentlich, dass Schlaf eine wichtige Geschichte ist, Ernährung und Sport. Also eigentlich erzählst du nix Neues. Und ist das wirklich ein relevanter, effektiver Anteil, dass du dann wirklich acht Stunden schläfst mit einer guten REM-Phase, dir gegebenenfalls nicht die ganze Zeit Burger King und McDonald's reinfährst, Und vielleicht auch mal 10.000 Schritte am Tag läufst.",
      "start": 2961039,
      "end": 2989822,
      "confidence": 0.7159759036144578,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du lebst in deinem Körper und du hast eine gewisse Energiebatterie und eine physikalische Energie, die du zur Verfügung hast. Je größer diese ist, desto größer und desto mehr kannst du machen. Wenn du überhaupt nicht schläfst, wenn du dich immer schlapp fühlst, wenn du nur Kacke isst, fühlst du dich einfach schlecht. Und es ist super schwer, sich einfach gut zu fühlen und zu sagen so, ey, ich möchte jetzt an einem komplexen Problem arbeiten. Weil man einfach Kopfschmerzen hat, Rückenschmerzen hat, was auch immer hat. Deswegen ist, glaube ich, so diese Grund-Maintenance vom Körper einfach mega wichtig. Und das ist für, egal was man im Leben macht, ist es, man möchte ja versuchen, so viel Energie wie möglich zu haben. Und das passiert halt durch körperliche Betätigung, durch irgendwie besseres Essen, durch Schlaf. Das sind so die größten Hebel, die man machen kann. Und die haben Einfluss auf alles, was du eigentlich machst in deinem Alltag.",
      "start": 2989942,
      "end": 3036818,
      "confidence": 0.7920126582278482,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das hat ja dann auch Einfluss auf diesen übergeordneten Makroflow, wie du es genannt hast.",
      "start": 3037118,
      "end": 3042839,
      "confidence": 0.8138749999999999,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau.",
      "start": 3042879,
      "end": 3043380,
      "confidence": 0.886,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann ich den sonst auch irgendwie beeinflussen? Also da gibt es ja wahrscheinlich keine Cycles oder sonst irgendwas, sondern da geht es mehr um so eine, klingt für mich wie so eine allgemeine Happiness, Zufriedenheit.",
      "start": 3043420,
      "end": 3054262,
      "confidence": 0.7945714285714286,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau. Und das ist quasi so jetzt mal auf was ich eigentlich jetzt mache. Das ist was, womit sich mein Startup Shiftspace beschäftigt quasi.",
      "start": 3054282,
      "end": 3063544,
      "confidence": 0.782375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wunderbare Überleitung. Sehr schön. Dann brauche ich dieses gar nicht mehr fragen. Also, wie hebt ihr das Ganze auf das Next Level bei Shift Space?",
      "start": 3063584,
      "end": 3070627,
      "confidence": 0.66824,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also, dieser, ich nenne das den Macroflow, würde ich jetzt auch als kausalen Flow nennen. Und hier geht es darum, den Zustand an die Aufgabe anzupassen. Im Englischen nennt sich das Matching State to Task. Also, je nachdem, welche Aufgabe gerade mir vorliegt, jetzt in meinem ganzen Leben, keine Ahnung, ich muss einen Marathon laufen, Ich muss irgendwas coden, ich muss vor Leuten sprechen, egal was passiert im Alltag, möchte ich versuchen, meinen Zustand und meine Fähigkeiten an dieser Aufgabe anzupassen. Und hier geht es eigentlich nur darum zu sagen, du brauchst Flexibilität und Fluidität, wie du an das Leben rangehst und was du machst, weil du kannst nicht die ganze Zeit nur aufgeregt sein, richtig produktiv sein und nie abschalten können dass das das funktioniert einfach nicht das leben besteht einfach wieder nicht aus diesen phasen wo man immer nur durch ballern muss manchmal muss man auch ein bisschen sich entspannen und wenn du das nicht kannst dann kommt es zu problemen und diese reibung und du kannst nicht in diesen kausalen macro flow kommen und was wir dann gesehen haben und das ist so ein bisschen die überleitung mit dem flow lab bei trivago und wir zu shift space gekommen sind, Wir haben verschiedene, wir haben zwei Studien auch gemacht dazu und haben gesehen, dass es bei Leuten sehr gut funktioniert, aber wir haben mit den Leuten gesprochen und viele haben uns irgendwie gesagt, ich finde das ja cool, das ist alles richtig gut, aber irgendwie kann ich das trotzdem nicht machen. Irgendwas hält mich zurück oder da gibt's das und das gibt's dies und es gab immer diese Ausreden und wir haben gesagt so ey, warum ist das denn eigentlich so? Und dann sind wir ein bisschen weitergegangen und sind dann halt wirklich auf diesen Kausal-Makro-Flow gekommen und haben gesehen, so okay, diese Taktiken zu lernen, wie man im Alltag produktiver wird, ist super wichtig. Man braucht das auf jeden Fall. Aber es ist einfach auch nicht alles. Es ist nicht alles, was man braucht und es ist nicht alles, was es im Leben gibt. Das ist so ein bisschen, was wir horizontale Entwicklung nennen. dieses erlernen von fähigkeiten das erweitern des wissens in einem bestimmten bereich und was wir dann gesehen haben ist dieses ok nehmt die erlernung diesen skills gibt es auch noch diesen vertikalen bereich also quasi das wachstum und und die entwicklung. von einer Person in Bezug auf die Denkweise, auf die Fähigkeiten und auf die Kompetenzen. Hier geht es darum, habe ich überhaupt eine Selbstreflexion? Habe ich ein Verständnis für mein eigenes Handel? Kann ich diese komplexen Herausforderungen navigieren? Kann ich darauf reagieren? Und das ist halt nochmal ein ganz, ganz anderer Bereich, in den wir dann gekommen sind und den wir jetzt so versuchen, auch etwas zugänglicher zu machen und zu entmystifizieren.",
      "start": 3070948,
      "end": 3227020,
      "confidence": 0.8227579617834405,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was macht ihr jetzt mit mit ShiftSpace? Also was konkret ist ja doch eine Firma. Was macht ihr konkret?",
      "start": 3227380,
      "end": 3233562,
      "confidence": 0.8154999999999999,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, ShiftSpace ist ein Startup. Wir sind ein B2B-Unternehmen und wir haben eine Coaching- und Selbstentwicklungsplattform, in dem sich Menschen in Unternehmen weiter fortbilden können, weiterentwickeln können und diese persönliche Weiterentwicklung erleben können auf eine Art und Weise, die aber sehr praxisorientiert ist und sehr greifbar und sehr darauf bezogen ist, wie handle ich an das in meinem Alltag. Also quasi Personal Development im B2B-Kontext, damit man es schafft, komplexere Probleme zu lösen, sich besser anzupassen, effektiver mit anderen Menschen zusammenzuarbeiten und auch empathischer einfach im Umgang mit Menschen zu werden. Wir nennen das ganze Mindset for the new way of working. So ein bisschen dieses Post-Corona-Flexibles, wie man damit umgehen kann.",
      "start": 3233822,
      "end": 3283796,
      "confidence": 0.8348303571428568,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber mit wem arbeitet ihr dann zusammen in der Firma? Arbeitet ihr dann mit dem Management zusammen und probiert, denen irgendwie einzutrichtern, wie sie das richtig machen sollten im Idealfall? Oder arbeitet natürlich im positiven Sinne zusammen? Oder geht es dann wirklich auf die einzelne Person bis ganz nach unten durch?",
      "start": 3283836,
      "end": 3300071,
      "confidence": 0.8265686274509801,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau es geht es geht auf die einzelnen personen runter es wir fokussieren uns auf knowledge worker also alle leute die irgendwie eher mit dem kopf arbeiten anstatt jetzt mit dem körper und wir bieten das für für alle an also für jede etage sei das jetzt die führungsetage aber auch für die leute die, einfach nur arbeiten und keine Führungsverantwortung haben oder nicht im C-Level sind, weil im Endeffekt muss jeder Mensch sich da weiterentwickeln und ein großes Problem von Coaching ist dieser, es ist sehr elitär, nicht viele können sich das leisten, es ist meistens immer nur für die Führungsetage reserviert und wir versuchen das so ein bisschen zu demokratisieren und mehr Menschen zur Verfügung zu stellen.",
      "start": 3300311,
      "end": 3336788,
      "confidence": 0.8224789915966388,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber arbeitet ihr dann wirklich auf der oder arbeite ich dann als Mitarbeiter mit einer Person zusammen oder ist das eine App oder wie schaut es dann im Alltag wirklich aus?",
      "start": 3337068,
      "end": 3346700,
      "confidence": 0.7666451612903229,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Es ist eine Kombination aus drei Sachen. Es ist einmal unsere App, die wir selber entwickelt haben. wo es darum geht, wirklich diesen Habit-Change voranzutreiben. Dann gibt es dort in der App individuelles Coaching. Wir haben menschliche Coaches, die dir Feedback geben und wir haben ein gruppenbasiertes Training. Also wir nehmen immer eine Gruppe von Menschen, irgendwie von 15 bis 35 Leuten und machen mit denen zwischendurch auch zum Beispiel Zoom-Sessions und begleiten die über zwölf Wochen. Und das Ganze zusammen ist unsere Plattform, also eine App, individuelles Coaching und ein kohortenbasiertes Training.",
      "start": 3346760,
      "end": 3377770,
      "confidence": 0.8208602150537636,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir haben gerade heute zufällig in der Community eine Diskussion gehabt, wo eine Person aus unserer Community erzählt hat, er hatte versucht, die Notifications am Handy abzuschalten und das war in der Firma gar nicht gewünscht, weil es einfach Voraussetzung ist, du sollst erreichbar sein. Jetzt war für mich das sofort ein Zeichen eigentlich, okay, die Firma hat es noch nicht ganz verstanden. Wie ist denn deine Sicht auf diese Dinge, wie offen sind denn Firmen heutzutage sowas wirklich einzusetzen? Merkst du da, dass da schon viel Energie drin ist, dass man sich in diese Richtung entwickelt oder sind es eher noch einzelne Firmen, die auf so einen Zug überhaupt aufspringen?",
      "start": 3377930,
      "end": 3413975,
      "confidence": 0.8422432432432433,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, also ich muss sagen, es hat sich sehr krass verbessert in der Hinsicht.",
      "start": 3414335,
      "end": 3418977,
      "confidence": 0.8637857142857142,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Durch euch natürlich.",
      "start": 3418997,
      "end": 3419777,
      "confidence": 0.5800000000000001,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Natürlich unbedingt durch uns, aber eigentlich noch mehr einfach durch Corona und einfach durch unsere Welt und wie wir uns organisieren. Mittlerweile sind die Unternehmen viel, viel offener dafür und verstehen jetzt, warum es wichtig ist. Also das ist eine gute Entwicklung, die ich beobachte. Es gibt immer mehr Unternehmen, auch was mich immer wundert, traditionellere Unternehmen, wo man das überhaupt nicht denken würde, die sehr offen sind und da auch mehr so in diese Vorreiterrolle gehen. Und es gibt auch viele progressive Unternehmen und Startups, besonders auch im Tech-Bereich. die dann sagen nee nee auf gar keinen fall und die klammern sich halt wirklich noch so an dieses alte paradigma aber all in all kann man sagen dass es auf jeden fall in die richtige richtung geht und dass es viel einfacher wird diese themen anzusprechen und das auch salonfähiger zu machen im unternehmen ich.",
      "start": 3421738,
      "end": 3466418,
      "confidence": 0.8341369863013698,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Stelle mir generell die frage wir sprechen hier gerade über eine hochkonzentrierte phase flow dies und das und dann wenn ich jetzt aber in die büros gucke dann haben wir überall ein open space und da ist alles auf kollaboration ausgelegt und besonders für uns knowledge worker Softwareentwickler und Softwareentwicklerinnen, die meisten sagen, ich kann mich im Open Space gar nicht konzentrieren. Ich frage mich gerade nach und nach, wie das alles zusammenpasst. Weil in dem Büro, es geht halt irgendwie die Entwicklung in die entgegengesetzte Richtung und nicht zur Konzentration, nicht hin zum Flow, nicht zum 10x-Developer und Fünf-Stunden-Flow und dies und das.",
      "start": 3466438,
      "end": 3502181,
      "confidence": 0.7963269230769227,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf jeden Fall. Ich weiß nicht, ob du dich dran erinnern kannst, Andi, als zu der zeit bei trivago hatte ich haben wir schilder gedruckt wo irgendwie stand so hey i'm flowing right now die man sich so auf irgendwie ein monitor hängen könnte weil genau das war das problem du bist in einem open office, leute kommen dir ständig an die seite wollen was von dir haben und du brauchst halt diese 90 bis 120 minuten wo du mal nix machen kannst und ja was was man, datum kann man wirklich noch im office arbeiten muss oder möchte man muss es öffentlich machen, Man muss darüber sprechen, man muss irgendwie sagen so, hey, sprich mit deinem Team, sprich mit deinem PO, deinem CEO, Lead, wen auch immer. Der Person, die ständig deine Aufmerksamkeit beansprucht und sagt, hey, ich brauche diese Zeit, um die Arbeit zu machen, die du auch von mir erwartest. Ich brauche einfach diese Fokuszeit und versuche alles dafür zu tun, was notwendig ist. Irgendwie in den Fokusraum zu gehen, irgendwie ein Schild aufzustellen, Headphones, was auch immer. Am besten, ja, und funktioniert das natürlich jetzt im Home Office, Sagen wir mal, wenn man alleine ist und wenn man sagen kann, okay, ich bin nur über Slack oder was auch immer erreichbar, du machst einfach Slack aus und kannst coden. Natürlich, du hast vielleicht noch eine Familie, du hast Partnerinnen, wen auch immer, da muss man natürlich auch absprechen, aber zu Hause funktioniert das am besten. Und ich muss ehrlich sagen, seitdem ich im Homeoffice bin, hatte ich viel mehr Flow-Erfahrung als jemals im Office in den Jahren vorher. Also da habe ich auf jeden Fall auch einen Change bei mir zum Positiven nochmal gemerkt.",
      "start": 3502221,
      "end": 3585373,
      "confidence": 0.7903333333333331,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber du musst dich halt schon hart disziplinieren ich sehe gerade auch wir haben jetzt hier im Podcast Video Call du hast an deiner einen Hand so ein Tracking Ring wenn ich das richtig gesehen habe.",
      "start": 3585693,
      "end": 3594962,
      "confidence": 0.7804444444444444,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja ist ein Aura Ring genau.",
      "start": 3595002,
      "end": 3596883,
      "confidence": 0.37200000000000005,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau und ich habe mir auch gerade die Frage gestellt ob diese ganzen Gadgets wie eine Apple Watch die dann auch dein Schlaf misst und jetzt hier dein Ring, weiß nicht alles was der da misst, ob das alles schon wirklich für das Training, für dein Flowzustand genutzt werden kann, weil eigentlich geben dir diese Gadgets ja schon ne ganze Menge Daten, aber auf der anderen Seite sagst du auch okay, du musst dann jetzt alles hier einmal ausschalten und am besten weglegen, Ja.",
      "start": 3596923,
      "end": 3622347,
      "confidence": 0.775869047619048,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das Gute an einem Ring, zum Beispiel an dem Oura Ring im Vergleich zu einer Apple Watch, hier ist kein Display. Also hier gibt's gar nix, er vibriert nicht, da passiert einfach nix, der ist einfach da und du vergisst ihn. Wenn du irgendwas hast an deinem Körper, anderes Gadget oder dein Handy, wo es Push-Notifications gibt und Sonstiges, das muss einfach weg. Und ja, die Daten kann man benutzen von solchen Trackern, ein bisschen indirekt, da würde ich sagen, das ist dann eher für diese Erholungsphase. Einfach nur, um zu verstehen, was tut denn dein Körper gut. Tut's meinem Körper gut, wenn ich jetzt, keine Ahnung, zehn Kilometer laufe, oder ist es zu viel, beeinsprucht das mein Körper zu sehr? Also ich nutze die Tools einfach zur besseren Einschätzung meines Körpers, um meinen Körper besser zu verstehen, wie es mir gerade geht, und das gibt mir einfach dieses Real-Time-Feedback. Sagt mir vielleicht, wenn ich ein bisschen zu gestresst bin vielleicht, oder eine Krankheit hab, die mir ankommen ist, das kann man auch anhand den Daten sehen, sodass ich sage, okay, heute mal Abend irgendwie mal zu Hause bleiben, ein bisschen entspannen, anstatt auszugehen und was zu trinken. Dafür kann man das nutzen quasi, einfach um so allgemeiner sich besser zu fühlen aber jetzt um wirklich in den flow zu kommen gibt es nicht viele tracker oder devices 1 ist das heißt hart made das miss deine herzraten variabilität und das kann man als feedback punkt nehmen um zu gucken ob man im flow ist oder nicht aber das das lenkt extrem ab am anfang und ich würde es erstmal keinen empfehlen deswegen eher gadgets aus.",
      "start": 3622527,
      "end": 3704514,
      "confidence": 0.7961702898550727,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, es ist halt auch so wie mit allem, es kann halt ein Werkzeug sein, was helfen kann, aber du musst mal grundsätzlich die Idee verstehen und den Approach und auch den Zyklus und vielleicht mal durchleben und dann als nächstes Schritt vielleicht dann wirklich mit den Tools arbeiten.",
      "start": 3704774,
      "end": 3718541,
      "confidence": 0.8103000000000002,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau.",
      "start": 3718581,
      "end": 3719281,
      "confidence": 0.539,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich stelle mir gerade die Frage, das ist ja ein Suchtzustand eigentlich. Also ich habe gelesen, das ist ein positiver Suchtzustand. Gefüllt von Hochmotivation und Leidenschaft. So steht das, glaub ich, sogar im Wikipedia-Artikel. Und Heroin ist das ja auch, ne? Also, ich mein ... Kann mich das nicht irgendwie auch so ... Also, gibt's da irgendwie Studien zu, dass mich das auch in die Depression stürzt, weil ich's nicht mehr schaff, wieder in diesen Flowzustand zu kommen? Ich kann mir schon vorstellen, dass, wenn ich dann einmal diesen Hochzustand habe, dass ich den wiederhaben möchte.",
      "start": 3719321,
      "end": 3752128,
      "confidence": 0.7220625000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Körperlich tatsächlich gibt es keinen Suchtzustand dazu, man hat Studien gemacht, aber es gibt noch eine andere Sucht und das ist einfach die Sucht von diesen ganzen Insights und dieser krassen Produktivität, die man im Flowstate bekommt. Also wenn man da wirklich drin ist und Sachen fließen und du hast diese ganzen Aha-Momente und so, willst du immer diese Insights bekommen. Du denkst immer so, oh mein Gott, das war jetzt so krass, ich möchte das nochmal. Und es gibt eine gewisse Suchtgefahr, dass du sagst, ich möchte immer wieder da rein. Es ist jetzt keine körperliche Sucht, aber es ist trotzdem diese Sucht zu wissen, so, okay, ich könnte ja noch eigentlich so viel mehr und ich bin eigentlich so produktiv und gerade bin ich das gar nicht. Und das kann passieren. Also es passiert jetzt nicht oft, es passiert meistens, also es passiert viel bei Extremsportlern. Deswegen nennt man die so Adrenalin-Junkies und Co., wenn man da reinkommt. Aber das Gute beim Flow ist, Flow ist ein State, der vom Körper produziert wird. Das heißt, er ist sehr nachhaltig und der Körper weiß, wie man das ausbalanciert. Wie schon vorher gesagt, wenn du das versuchst mit Substanzen zu machen, den Flow-Zustand zu erreichen, würdest du einfach überdosieren. Das ist kein Zustand, den man nachhaltig bewirken kann mit externen Substanzen. Und weil der Körper das halt so gut regulieren kann, macht es auch nicht süchtig. Und Heroin ist halt noch was ganz anderes, würde ich nicht empfehlen.",
      "start": 3754209,
      "end": 3828366,
      "confidence": 0.8031693548387095,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und der Frohzustand ist wirklich völlig unabhängig von der Zeit, also es spielt keine Rolle, ob ich eine Eule oder eine Lerche bin, also morgens oder abends produktiv, hab mit der Phase, es ist eher so der Zustand, wie ist mein Leben organisiert, hab ich Kinder, die morgens zur Kita müssen oder was weiß der Geile nicht, oder?",
      "start": 3829157,
      "end": 3845685,
      "confidence": 0.8165172413793101,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also micro und macro flow wieder, was für, ob du eine Eule bist oder irgendwie früh aufstehst, ist per se erstmal egal, Es gibt ja aber ein indiz wann du deine beste zeit machst also wenn ich morgens aufstehen sage okay das ist die zeit wo ich am fokussiertesten bin, dann versuch dort in dem flow zu kommen weil du bist schon eh natürlich fokussiert und du hast nicht diese progressionation deswegen kommst du schneller durch, wenn du sagst ich bin eher jemand der abends da rein geht dann versuch doch mal eine flow session am abend zu machen weil wenn du wenn du da, schon von natur aus mehr fokussiert bis ist es immer der beste weg weil wenn du sagst ich bin kein morgen mensch ich hasse es morgen aufzustehen da versuchst im flow zu kommen, kriegst du es wird extrem schwer weil du musst dagegen ankämpfen überhaupt präsent zu sein, also deswegen ist es egal das gibt ja einfach nur die vorliebe und flow kann genau flow kann sein du bist im im micro flow du bist hat eine gute coding session bis gerade mit dem auto durch zwei grüne wellen gefahren was auch immer ich bin im flow, Bis zu Makro so, hey, ich mag eigentlich meinen Job total. Ich mach genau das, was ich machen möchte. Ich verbringe meine Zeit genau so, wie ich es machen möchte. Ob ich jetzt code oder im Garten arbeite oder auf dem Feld arbeite. Die Balance ist gut. Das wären so die Makro-Marker für den Flow.",
      "start": 3845745,
      "end": 3915813,
      "confidence": 0.7808949416342416,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jut, dann würde ich sagen, ich verabschiede mich jetzt und cancel mal meine Meetings morgen, damit ich so die erste 90 Minuten Zeit habe für die Struggle-Phase, danach mache ich zwei Stunden, drei Stunden Gartenarbeit und dann sollte das laufen, oder?",
      "start": 3916213,
      "end": 3927601,
      "confidence": 0.7562682926829267,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das klingt auf jeden Fall gut, sag Bescheid, berichte mal bei der nächsten Episode, wie es gelaufen ist.",
      "start": 3927621,
      "end": 3932764,
      "confidence": 0.8161666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder ob du den Job noch hast.",
      "start": 3932804,
      "end": 3933865,
      "confidence": 0.604,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Wir haben doch gerade gehört, Zeit ist kein Anker für Produktivität. Und wenn ich das jetzt hier so alles richtig mitgenommen habe, unterstützt die Flow-Theorie eigentlich auch die vier-Tage-Woche. Zumindest ist hier die sechs-Stunden-Arbeit. Von daher müsste ich den Job auch alles noch haben.",
      "start": 3935762,
      "end": 3951787,
      "confidence": 0.7351363636363637,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kirill, wenn sich jetzt irgendwer noch da tiefer damit beschäftigen will, hast du da noch eine Webseite vielleicht, wo man mehr Informationen bekommt oder auch ein Buch, was du empfehlen würdest zu lesen? Ich meine ShiftSpace natürlich, das verlinken wir sowieso. Ich hoffe mal ihr habt auf der Webseite auch irgendwelche Infos. Aber abseits von der Webseite gibt es irgendwo mehr Informationen?",
      "start": 3952047,
      "end": 3972282,
      "confidence": 0.7804032258064516,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, auf jeden Fall. Zwei Experten in dem Feld, den ich allen ans Herz legen würde, wären einmal Jamie Wheal und Steven Kotler. Das sind die beiden Herrschaften, die das ganze Flow-Thema wirklich so mainstream gemacht haben. Und das ist einmal das Flow Research Collective und das Flow Genome Project. Also die Webseiten sollte man sich auf jeden Fall anhören. Meine Reise mit dem Flow hat angefangen mit einem Buch, was von Steven Kotler und Jamie Wheal geschrieben wurde und das heißt Stealing Fire. Also wenn Leute Interesse haben, einfach mal wirklich einen Überblick zu bekommen, was ist Flow nochmal tiefer, wie hängt das alles zusammen, würde ich das Buch empfehlen als Lektüre.",
      "start": 3972302,
      "end": 4009468,
      "confidence": 0.8416725663716815,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, verlinken wir natürlich alles in den Show Notes, da ist nochmal alles aufgelistet. Vielen, vielen Dank für deinen Einblick. Es war extrem lehrreich. Ich kann jetzt endlich mir mehr unter diesem Flow vorstellen, auf jeden Fall. Und ich werde auch probieren, den Flow-Cycle mal zu beobachten, ob ich den irgendwo bei mir finden kann. Das ist auf jeden Fall eine einfache Übung und ich hoffe, ich bekomme da auf jeden Fall mehr Insights.",
      "start": 4009769,
      "end": 4035285,
      "confidence": 0.759,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Vielen lieben dank ich hab super viel gelernt ich hab mich teilweise total dumm gefühlt weil du so viel über irgendwelche gehirn sachen erzählt hast psychologie und allem drum und dran und frontaler cortex und so weiter ich muss jetzt zwischenzeitlich google wofür der eigentlich in der regel gebraucht wird wenn du sagst während des flow status abgeschaltet.",
      "start": 4035926,
      "end": 4052744,
      "confidence": 0.7559137931034481,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Moment hast du nie pinkie in der brain. gesehen, wo sie das Gehirn erklären, Andi.",
      "start": 4052785,
      "end": 4057369,
      "confidence": 0.6372,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nee, die Folge habe ich anscheinend gerade verpasst. So vielleicht.",
      "start": 4057409,
      "end": 4061612,
      "confidence": 0.7199,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ganz, ganz wichtige Folge natürlich.",
      "start": 4061652,
      "end": 4063233,
      "confidence": 0.7365999999999999,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also super interessant und ich wusste auch gar nicht, dass es, ich sag mal jetzt, womit du dich jetzt professionell beschäftigst, das Next Level vom Flow überhaupt noch gibt. Und ich bin halt noch so am Anfang, okay, wie komme ich jetzt eigentlich in diesen Flow rein? Ich habe gedacht, okay, das ist die Königsklasse, aber nee, danke für das Erleuchten, würde ich sagen.",
      "start": 4063273,
      "end": 4079885,
      "confidence": 0.749671875,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und Kirill, großes Lob, dass du jedes englische Wort auf Anhieb ins Deutsche übersetzen kannst. Wir strugglen da wirklich in jeder Episode mit diesen dummen englischen Wörtern und du schaffst es wirklich auf Anhieb. Vielleicht hast du dich auch sehr gut vorbereitet. Keine Ahnung. Auf jeden Fall perfekte Übersetzung von jedem englischen Term. Sag ich schon wieder.",
      "start": 4080065,
      "end": 4098448,
      "confidence": 0.8111052631578947,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also erstmal vielen Dank an euch beide. Hat super viel Spaß gemacht hier. Und auch eine große Ehre, der erste Gast zu sein. Und zweitens, das war meine größte Angst, weil ich eigentlich so viel denglische. Ich hatte mich mal wirklich hingesetzt und hab mal so gegoogelt und übersetzt, was wären die Wörter denn auf Deutsch. Und ich hatte sogar so eine kleine Liste hier am Start. Weil alle Leute mir sagen, ja, du bist ja nur am Denglischen. Deswegen war es mir wichtig. Und danke, dass es geklappt hat.",
      "start": 4098948,
      "end": 4124448,
      "confidence": 0.8067555555555554,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auf jeden Fall. Ja, vielen Dank und wir hoffen auch, dass wir von der Community ein bisschen Feedback bekommen. Vielleicht schaffen wir es auch, Kirill zu überreden, dass er zu uns in die Community kommt oder wir leiten ihm die Fragen weiter, wenn ihr irgendwelche Fragen habt. Aber wäre natürlich super, wenn wir ein bisschen Feedback bekommen und auch, falls ihr irgendwelche Fragen habt. Und falls ihr eine größere Firma habt und das Next Level erreichen wollt, ShiftSpace, wisst ihr jetzt die Firma, die euch dabei weiterhilft.",
      "start": 4126006,
      "end": 4152591,
      "confidence": 0.78232183908046,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Danke, Wolfgang. Danke, Andi.",
      "start": 4152631,
      "end": 4154912,
      "confidence": 0.51,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Danke, Geryl. Und ansonsten wünschen wir euch viel Spaß beim, was sagt man jetzt, flowen oder?",
      "start": 4155252,
      "end": 4161358,
      "confidence": 0.7926875,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, beim fließen. Auf Deutsch klingt es halt nicht so cool. Deswegen würde ich sagen, denglisch erlaubt, beim flowen.",
      "start": 4161398,
      "end": 4168406,
      "confidence": 0.7918421052631581,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Viel Spaß. Tschüss.",
      "start": 4168446,
      "end": 4169987,
      "confidence": 0.40399999999999997,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gutes Fließen. Ciao. Tschüss.",
      "start": 4170006,
      "end": 4171709,
      "confidence": 0.59625,
      "channel": null,
      "speaker": "C"
    }
  ],
  "confidence": 0.800774632637281,
  "audio_duration": 4178.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
