{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/5085aa37-257d-4787-8fea-f583b2678c6d/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62slk4lxde-c2c4-4eea-808a-dcaf32771459",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Das.",
      "start": 430,
      "end": 570,
      "confidence": 0.289,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "War Sir Tim Berners-Lee, Erfinder des World Wide Webs und Turing-Preisgewinner.",
      "start": 3632,
      "end": 6874,
      "confidence": 0.3047272727272728,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und damit willkommen zu einer neuen Episode des Engineering Kiosks, in der wir tief in den größten Wissensspeicher der Welt eintauchen, dem World Wide Web. Wir besprechen, wie der Erfinder Tim Berners-Lee sich das Web vorgestellt hat, was heute von seinen Plänen noch immer nicht umgesetzt ist, was Tim Berners-Lee bei einem Redesign jetzt anders machen würde und was er von Web3 oder Facebook hält. Wir gehen aber auch auf neue Web-Technologien ein, mit denen wir alle tagtäglich in Berührung kommen, die aber trotzdem eigenartigerweise von vielen als tot geglaubt werden. Auch von Andi. Und das werde ich mal widerlegen. Von Semantic Web über Linked Open Data bzw. Knowledge Graphs bis hin zu Connection to Large Language Models. Los geht's mit dem Blick auf das World Wide Web, was es ist und was es in Zukunft sein kann.",
      "start": 27533,
      "end": 79317,
      "confidence": 0.840876811594203,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Liebe Hörerinnen und Hörer, immer wenn ich mit dem Wolfgang eine neue Episode aufnehme, dann treffen wir uns in einer Video- und Audiokonferenz auf der Plattform zencaster.com Moment.",
      "start": 79357,
      "end": 89861,
      "confidence": 0.8037857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Machst du jetzt schon Werbung für unsere Plattform?",
      "start": 89881,
      "end": 92262,
      "confidence": 0.599,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nö, ich teile nur Hintergrundinformationen. Und das Faszinierende für mich ist immer, dann sehe ich natürlich auch immer den Raum, wo der Wolfgang drin sitzt. Und die Anzahl der Räume, die ich durch diese Videokonferenz schon gesehen habe, kann ich nicht mehr an zwei Händen abzählen. Dieser Mensch reißt immer noch so viel rum, obwohl ich dachte, Österreich ist so klein. Aber heute nimmst du woher auf? Weil den Raum kenne ich noch nicht, in dem du sitzt. Ich sehe nur im Hintergrund eine sehr alte Holzleiter, die in Deutschland so gar nicht mehr zugelassen wäre, glaube ich.",
      "start": 92885,
      "end": 127830,
      "confidence": 0.8546530612244897,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das verrät eigentlich schon sehr viel über die Location. Und zwar bin ich im altmodischsten Teil von Österreich. Die meisten in Deutschland kennen Österreich sowieso nur als Wien und für viele Deutsche ist ja Österreich in Wien. Aber ich bin in der Tat in Wien, im sehr altmodischen Wien.",
      "start": 127870,
      "end": 144645,
      "confidence": 0.8249795918367349,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir hatten es ja schon öfter erwähnt, dass du deine akademische Laufbahn, ich sag mal sehr nett, etwas in die Länge gezogen hast. Und ich weiß nicht, ob dich das ein bisschen langsamer gemacht hat, aber du bist zu spät. Du bist circa zweieinhalb Monate zu spät, Wolfgang. Der Wiener Opernball, dein Aufstieg in die Oberschicht, war bereits am 16. Februar dieses Jahres.",
      "start": 144665,
      "end": 163793,
      "confidence": 0.8084920634920639,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das heißt ja nicht, dass ich nicht dort war, aber ich würde sowieso nie, glaube ich, zum Opernball gehen. Aber jetzt gerade aktuell, zufällig, hat zwar nichts mit meinem Besuch zu tun, aber es läuft gerade jetzt in diesem Moment, wo wir aufnehmen, der Vienna City Marathon ab, wo irgendwie, keine Ahnung, 40.000 Leute oder so mitlaufen. Also man muss ja sagen Wien hat viel zu bieten nicht nur so kulturell sondern sogar lauftechnisch.",
      "start": 164233,
      "end": 186457,
      "confidence": 0.7936756756756755,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja und ich hoffe doch mal auch kulinarisch oder was ist die Süßigkeit in Wien da wo man sagt okay da kommt man nicht drum rum.",
      "start": 186898,
      "end": 194664,
      "confidence": 0.8193846153846154,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt muss ich mich natürlich outen weil eigentlich der Wiener Kaiserschmarrn die Variante wie der Kaiserschmarrn im Osten gemacht wird schmeckt mir eigentlich besser als die Variante im Westen bei uns in Tirol. Aber natürlich mit Rosinen, das ist sowieso klar. Also nur, dass das mal gleich vorweg ist.",
      "start": 194684,
      "end": 209194,
      "confidence": 0.807857142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich wollte gerade fragen, ist leider beides mit Rosinen, oder?",
      "start": 209234,
      "end": 211995,
      "confidence": 0.7762,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Natürlich.",
      "start": 212035,
      "end": 213155,
      "confidence": 0.897,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, aber heute kommt das Land Österreich sehr wenig vor.",
      "start": 213195,
      "end": 216617,
      "confidence": 0.8534,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wir machen auch ein altmodisches Thema immerhin.",
      "start": 216657,
      "end": 218878,
      "confidence": 0.807625,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich finde das Thema gar nicht altmodisch. Ich finde das moderner denn je offensprochen.",
      "start": 218918,
      "end": 224280,
      "confidence": 0.8697142857142858,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wir blicken ein bisschen in die Vergangenheit wenigstens.",
      "start": 224320,
      "end": 227961,
      "confidence": 0.8654444444444446,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Heute sprechen wir aber so ein bisschen mehr über euer Nachbarland, oder? Die schöne Schweiz.",
      "start": 227981,
      "end": 231823,
      "confidence": 0.7553333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Im weitesten Sinne, sie kommt zumindestens vor, ja. Und zwar gehen wir weiter in unserer Serie oder beziehungsweise wir starten jetzt mal erst richtig mit unserer Serie von Turing Award Gewinnern und wir besprechen heute den Tim Berners-Lee oder Sir Tim Berners-Lee eigentlich. der Erfinder des World Wide Webs. Und wir besprechen natürlich nicht nur die Erfindung, sondern auch, was daraus geworden ist, woran der gute Kerl gerade so forscht oder dran ist und wie sich das Ganze so entwickelt hat und was aktuelle Themen natürlich in dem Bereich sind. Und da kommen wir auch wieder zurück, was der Andi gemeint hat, dass es eigentlich noch top aktuell ist, das ganze Thema.",
      "start": 232614,
      "end": 268406,
      "confidence": 0.8562857142857141,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast ja gerade auf dieses Sir so bestanden. Ich habe gerade mal versucht nachzuvollziehen, welchen Art von adeligen Titel dieser Mensch eigentlich hat.",
      "start": 268926,
      "end": 277308,
      "confidence": 0.7029166666666664,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Weißt du das? Ja gar keine, der hat das einfach verliehen bekommen von der Queen oder für seine Leistungen in seinem Gebiet als wichtige Person. Sean Connery hat auch den Sir verliehen bekommen, der hat auch nichts geleistet außer, dass er James Bond gespielt hat.",
      "start": 277348,
      "end": 289935,
      "confidence": 0.7350000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja auch nichts geleistet, also ich würde mich jetzt mal aus dem Fenster lehnen und sage Tim Berners-Lee hat schon was für die Menschheit geleistet.",
      "start": 289975,
      "end": 296602,
      "confidence": 0.7669199999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay vielleicht hat Bernice Lee und Sean Connery mehr geleistet als wir. Okay, dem geben wir mal recht. Aber wann man so diesen Sir-Titel bekommt, keine Ahnung so genau, ob da wirklich was ordentliches, sinnvolles dahintersteckt.",
      "start": 296882,
      "end": 309568,
      "confidence": 0.7521944444444446,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber fangen wir mit dem Grund an, warum Tim Bernice Lee heute in unserer Touring Award Episode unterwegs ist. Wann hat Tim Bernice Lee den Touring Award verliehen müssen?",
      "start": 309608,
      "end": 320472,
      "confidence": 0.7599310344827586,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich vermute mal, die meisten kennen Tim Berners-Lee, man hört den Namen ja doch irgendwie als Erfinder des World Wide Webs und er hat 1989 angefangen mit seinem Projekt, das dann schlussendlich zum World Wide Web geworden ist. Also gleichzeitig mit dem Mauerfall, würde jetzt nicht sagen, dass es ungefähr ein ähnliches Event ist, aber er hat auf jeden Fall sehr viel bewegt mit seiner Erfindung und auch wenn es gerade um Offenheit geht und Knowledge Sharing, was man da wieder durchaus mit dem Mauernfall vergleichen könnte im weitesten Sinne. Aber gewürdigt ist das Ganze dann erst mit dem Turing Award 2016 geworden, also 27 Jahre später.",
      "start": 320932,
      "end": 360108,
      "confidence": 0.8214672897196259,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hattest jetzt den Mauernfall erwähnt, 1989 war das dann rum. Ich meine mich in meiner akademischen Laufbahn, in meiner kurzen akademischen Laufbahn darin zu erinnern und auch in meiner Informatikerausbildung, dass es noch sowas wie das ARPANET gab und dass nämlich viele Leute sagen, okay, das war eigentlich der Vorgänger des Internets beziehungsweise des World Wide Webs.",
      "start": 360128,
      "end": 377976,
      "confidence": 0.718793103448276,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist eben wichtig hervorzustreichen, dass es da ums World Wide Web geht, um das klassische WWW, wie wir es kennen, die Webseiten, die Links, die Linkstrukturen, HTTP, alles da herum, weil das Internet hat es natürlich schon viel, viel früher gegeben. Also dieses ARPANET hat es so in den späten 60er Jahren eigentlich gegeben, hat so gestartet in Amerika, ist dann so langsam übergeschwappt nach Europa und Tim Berners-Lee war damals eben in der Schweiz am CERN als Physiker angestellt bzw. Programmierer. Und da ist gerade das Internet so rübergeschwappt. Also das DCBIP-Protokoll hat es schon gegeben, E-Mail hat es gegeben, die Newsgroups und so weiter hat es gegeben, aber es hat eben noch nicht diese klassischen Webseiten, wie wir sie heute kennen und das www gegeben. Und das geht wirklich dann auf ihn zurück. Und er hat es im Rahmen seiner Arbeit bei CERN als Side Project, als privates, kleines Spaßprojekt, was toleriert wurde von seinem Boss, eigentlich gestartet. Also es war nicht seine Hauptaufgabe oder seine Aufgabe als Programmierer das Internet oder das WWW zu entwerfen, sondern er war einfach als Physiker-slash-Programmierer eingestellt im Rahmen vom CERN-Projekt.",
      "start": 378256,
      "end": 448122,
      "confidence": 0.839952879581152,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ich glaube, das ist auch eine wichtige Unterscheidung, die man sich bewusst werden muss. Tim Berners-Lee hat nicht TCP, IP, E-Mail oder Newsgroups erfunden, sondern der Vorgänger des Internets, so wie du es beschrieben hast, ARPANET. Ich weiß nicht ganz, ob man das damals schon Internet genannt hat oder einfach nur ein Computernetzwerk, damit man bei der US Air Force einfach ein paar Nachrichten hin und her schießen konnte in einer Forschergruppe.",
      "start": 448442,
      "end": 467975,
      "confidence": 0.786602739726027,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, man muss schon sagen, also es war sehr limitiert, was es damals an Knoten oder Computer gegeben hat weltweit. Also es war schon rein wissenschaftlich und sogar, wenn man sich überlegt, okay, 68 war dieses Arpanet, was halt primär für Militär und dann wissenschaftliche Zwecke genutzt wurde, dass es da eigentlich 20 Jahre gebraucht hat, bis dann überhaupt Tim Berners-Lee darauf aufsetzen hat können. Also damals war die Geschwindigkeit schon wesentlich langsamer, wie sich Dinge entwickelt haben.",
      "start": 468355,
      "end": 493077,
      "confidence": 0.8499487179487182,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, aber dann lass uns doch mal in dieses Thema www.worldwideweb einsteigen. Was ist die Motivation dahinter? Warum ... Also, es ist ja nicht so, als ist man beim Zerren gelangweilt. Die haben immer noch den Large Hydron Collider seit 100 Jahren und schießen da irgendwelche Partikel und machen schwarze Löcher. Also, ich kann mir schon vorstellen, dass diese Menschen da sehr viel zu tun haben, beziehungsweise da keine Langeweile aufkommt. Warum setzt man sich also jetzt dahin und kommt auf die Idee, hm, irgendwie ist das ARPANET nicht so geil, ich brauch mal was Neues.",
      "start": 493870,
      "end": 521381,
      "confidence": 0.7832604166666665,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich bin mir nicht sicher, ob er wirklich unzufrieden war und sich ein neues Thema gesucht hat, aber es hat grundsätzlich Hypertext zu der damaligen Zeit schon gegeben. Also Hypertext war eigentlich nichts anderes, als man Dokumente hat und Links zwischen den Dokumenten. Das war damals Hypertext, ist relativ früh auch erfunden worden, auch so in den späten 60er Jahren.",
      "start": 521934,
      "end": 543021,
      "confidence": 0.7955737704918034,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sind das die klassischen Links, das A-Tag?",
      "start": 543061,
      "end": 545201,
      "confidence": 0.8081428571428572,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das kam dann wirklich später von Tim Berners-Lee, aber davor hat es Systeme gegeben, die auf CD-ROM gelaufen sind, auf großen Mainframes, Computern, wo man Dokumente miteinander verlinkt hat. Es gibt auch die Hypertext-Konferenz im wissenschaftlichen Bereich, die ist zum Beispiel sehr, sehr alt. Und da hat Tim Berners-Lee zum Beispiel auch seine Idee damals eingereicht und ist abgelehnt worden. Also das ist so die Grundkonferenz hinter den Hypertext-Systemen. Und früher war so ein Hypertext-System natürlich nur lokal. Das heißt, es ist auf einer CD-ROM gelaufen, auf irgendeinem Speichermedium in irgendeiner Form. Du hast da deine Sammlung an Dokumenten gehabt und hast zwischen den Dokumenten dann Links gehabt und hast hin- und herspringen können. Also diese Idee gab es damals schon. Und was jetzt Tim Berners-Lee gemacht hat, ist, der hat sich überlegt, okay, jedes Mal, wenn ich jetzt irgendwie so ein Dokument suchen muss im Rahmen von CERN, die hatten extrem viele Dokumente, hatten ganz viele Systeme, weil die auch ihren Leuten sehr viele Freiheiten gegeben hatten, also Mainframes, PCs, diverseste Computer, und Systeme. Und immer, wenn du ein Dokument gesucht hast, da hat es zwar ein Verzeichnis gegeben, wo findest du dieses Dokument. Das war einfach gut dokumentiert bei denen. Aber du hast dich jedes Mal neu einlernen müssen. Du hast einen Account gebraucht für einen Mainframe, für den jeweiligen PC, für das jeweilige System, wo das Dokument gespeichert war. Hast dich wieder zurechtfinden müssen, wie funktioniert das dort. Hast vielleicht sogar lernen müssen. Das war ja nicht so user-friendly, wie es heute ist, so Systeme. Und es war extrem aufwendig, Informationen zu finden. Und seine Idee war dann, okay, kann man nicht dieses Hypertext-System mit den Links so auf eine Ebene heben, dass man einfach weltweit Links verfolgen kann und Wissen miteinander verknüpfen kann, Webseiten, Dokumente miteinander verknüpfen kann. Das war die Grundidee. Also er hat einfach ein System genommen, was es schon gegeben hat, die Hyperlinks oder Hypertext, und hat es auf eine höhere Ebene gehoben, dass das international verfügbar ist und eben nicht mehr auf das System an sich gebunden ist. Also es ist wirklich systemunabhängig, egal ob auf einem Mainframe, auf einem PC, auf einem Apple, auf einem Nextcomputer zur Verfügung steht. Und das war eigentlich die große Idee dahinter.",
      "start": 545221,
      "end": 674398,
      "confidence": 0.8122015915119366,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dafür muss man jetzt natürlich auch noch wissen, warum hat das damals eigentlich Relevanz gehabt mit diesem International und so weiter. Und zwar, die Labore vom CERN waren damals, ich weiß jetzt gar nicht, ob das heute auch noch so ist, aber damals war ein Teil der Laboratorien im französischen Gebiet und ein Teil im Schweizer Gebiet. Und diese verschiedenen Labore hatten unterschiedliche Netzwerkinfrastrukturen. Das, was du gerade gesagt hast mit CD-ROMs und Disketten und von mir ist auch noch Lochkarten. Alles, was es halt so gab, wurde halt dann wirklich nochmal So, wir haben auch einen neuen Podcast-Host hier. Also das, was du gesagt hast mit International, das war dann also wirklich ein Problem für ihn, weil er musste halt über Ländergrenzen hinweg, er musste halt über verschiedene Netzwerke, Infrastrukturen, Informationen finden. Also eigentlich kann man sagen, er hat sein eigenes Problem gelöst, oder?",
      "start": 674598,
      "end": 728065,
      "confidence": 0.805744827586207,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Seines und von vielen anderen, glaube ich, im Tern. Also die hatten natürlich alle das Problem, plus die ganze Kommunikation zwischen Ländern, wirklich Amerika als Hauptpunkt natürlich. Es hat zwar E-Mail gegeben, aber das war es dann im Großen und Ganzen. Also so irgendwie, dass man Wissen zur Verfügung stellt, offen, frei zugänglich, dezentralisiert vor allem, das war einfach nicht möglich.",
      "start": 728506,
      "end": 751384,
      "confidence": 0.8493442622950819,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber weißt du, du redest die ganze Zeit von Hypertext und Links und so weiter und ich bin ja, also damals, als Tim Berners-Lee die ganze Sache vorgeschlagen hat, war ich zwei Jahre alt. Ich kann mir heute nicht vorstellen, wie ein Hypertext, eine Hypertext-Verknüpfung aussehen könnte. Und du redest ja immer von Hypertext-System. Ist das eine Software, ist das ein Hardware-Stück, was ist das?",
      "start": 751764,
      "end": 771487,
      "confidence": 0.7424615384615383,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du kannst dir das eigentlich wie das Internet heute vorstellen mit den Webseiten, nur ist es halt in irgendeinem lokalen System gelaufen. Das hat so ähnlich ausgeschaut, die Links waren unterstrichen, sowas hat es schon gegeben in Fleece-Text, aber es war halt ein geschlossenes System, ein Programm, das du gestartet hast und darin, innerhalb von diesen Seiten oder dieser Datenbank, wenn du es so nennen willst, so wie ein kleines Wikipedia auf einer CD, auf einem Speichermedium, da hast du dann hin- und herspringen können. aber halt immer nur lokal auf deinem System. Und Tim Berners-Lee hat es dann dementsprechend erweitert, dass ein Link einfach jedes beliebige Dokument weltweit theoretisch zumindest ansprechen kann. Und das war eigentlich seine Pitch, die er auch seinem Chef gegeben hat, dass er eben Dokumente weltweit verlinken will und dass man wie so in einem lokalen System einfach auf den Link klickt, aber dann plötzlich auf einer Webseite in Amerika ist.",
      "start": 771822,
      "end": 826385,
      "confidence": 0.8254935897435897,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hier redest du jetzt von der URI, von der URL, von dem Unique oder Universal Resource Identifier oder Universal Resource Location, richtig?",
      "start": 826703,
      "end": 836166,
      "confidence": 0.7937272727272727,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau. Das war eigentlich die Idee, dass du einen Link, einen Identifier hast, der ein Dokument, ein Wissensstück in irgendeiner Form identifiziert. Das ist natürlich erst später aufgekommen, dass man das dann URL genannt hat und dass man das genau spezifiziert hat und mit HTTP und so weiter. Das ist natürlich dann erst mit der Zeit gekommen. Initial war die Idee natürlich einfach, man hat ein dezentrales System und ein dezentrales System kann man nur so verwalten, dass man irgendwie globale, unique Identifier hat. weil du keine zentrale Autorität haben kannst, die irgendwie IDs zum Beispiel vergibt, die du einfach hochzählst. Und darum hat man da mit dem URL-System so ein dezentrales Adresssystem eigentlich geschaffen. Und das hat sich natürlich später dann erweitert mit den unterschiedlichen Protokollen, diesem Schemeteil davor und so weiter. Also das ist dementsprechend dann noch erweitert worden später.",
      "start": 836206,
      "end": 886866,
      "confidence": 0.8474647887323944,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wo wir gerade dabei sind, kommt mir eine Frage in den Sinn. Was ist eigentlich der Unterschied zwischen URI und URL? Klar, das eine ist ein Identifier und das andere ist eine Location. Aber gibt es da einen technischen Unterschied? Gibt es da in der Repräsentation einen Unterschied? Oder sind das einfach zwei verschiedene Begriffe für dasselbe?",
      "start": 887246,
      "end": 905022,
      "confidence": 0.7793333333333335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da gibt es immer sehr viel Streitereien um diesen ganzen Bereich, was wirklich was ist. Mein Verständnis ist so, dass URL ein Subteil ist von URI. Das heißt, jede URL ist auch eine URI, aber URLs verwendet man primär für Webseiten.",
      "start": 905644,
      "end": 921298,
      "confidence": 0.8677317073170733,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielen Dank, Dr. Wolfgang Gerstler.",
      "start": 921799,
      "end": 922980,
      "confidence": 0.3842,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nächste Frage bitte.",
      "start": 923667,
      "end": 924588,
      "confidence": 0.6269999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, aber mit einer URL beziehungsweise einer URI kommt man ja jetzt nicht allein weit. Also der hat ja jetzt eine universelle Möglichkeit, Dokumente und Ressourcen zu identifizieren. Aber das hat jetzt das Link-Problem gelöst, beziehungsweise das Hypertext-Link-Problem. Aber das ist ja nicht das heutige Internet, das ist ja nicht das heutige World Wide Web.",
      "start": 924648,
      "end": 944145,
      "confidence": 0.7852727272727275,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, so bis es dazu gekommen ist, hat es natürlich viel Zeit gebraucht. Heutzutage würde man wahrscheinlich Lean dazu sagen. Er hat jetzt einfach seinen Boss gepitcht mit dem internationalen Links. Der war scheinbar sehr offen und hat irgendwie gemeint, ja, extrem vage, aber ganz interessant, so in der Richtung. und er soll das mal so als side project machen oder er darf das machen und der hat ihm dann so ein next computer gekauft also der vorgänger von apple damals war ja steve jobs bei next der hat den computer dann entworfen bei next wie er da bei apple rausgeflogen ist bevor er dann wieder eingetreten ist Und er hat sich so einen Next Computer gekauft. Das war natürlich extrem cool damals. Und er hatte dann natürlich einen Grund, da einfach damit herumzuspielen. Das ist auch ganz interessant, dass eben der erste Knoten des World Wide Web so ein Next Computer war, den er unterm Schreibtisch stehen hatte. Und damals diese Webseite, diese info.zern.ch, was ja die erste Webseite an sich war im Internet, gehostet hat. Und er hat einfach auf diesem Computer mal dieses ganze Ding programmiert. hat so einen Browser programmiert, hat den ganzen Standard programmiert, so HTML. War damals einfach so eine Ansammlung von ein paar ersten Tags, so eine Überschrift und kann halt einen Text machen und die kann natürlich Links dazwischen machen. Hat also die ganze Idee mal so runterprogrammiert, hat scheinbar so ungefähr zwei Monate gebraucht für das Ganze und hat es dann einfach mal so veröffentlicht. Verlinken wir auch gerne die Webseite, die gibt's noch heute unter info.ch. die die ganze Idee erklärt und einfach mal über das DCB-IP-Protokoll nach außen gibt.",
      "start": 944882,
      "end": 1037509,
      "confidence": 0.7975607142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also was hat der denn da wirklich im Detail programmiert? Du sagst grad, okay, der hat dann die erste Webseite programmiert und ich hab jetzt grad so ein paar Probleme, mir das vorzustellen. Also hat der einen Webserver programmiert oder hat er den ersten HTML-Standard entworfen und dafür einen Parser geschrieben? Oder hat der den ersten Webbrowser geschrieben? Also ich bin mir nicht sicher, ob ich mir das wirklich vorstellen kann, was der da jetzt zwei Monate lang gemacht hat.",
      "start": 1037549,
      "end": 1062739,
      "confidence": 0.7047624999999996,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Im Prinzip hat er den ganzen Stack programmiert, den du brauchst, um eine Webseite auszuliefern. Er hat grundsätzlich mal den Standard geschrieben für die Webseite an sich, also HTML, Hypertext Markup Language, um so eine Webseite zu definieren mit den Links. Dann hat er HTTP, also Hypertext Transport Protocol, was dann auf Layer 7 arbeitet vom ISO-OSI-Modell. DCB und so weiter hat es schon gegeben, die Layer darunter, aber 6 und 7 war dann in seinem Bereich. Hat also dementsprechend das HTTP-Protokoll entwickelt, einen Webserver dazu, damit das ausgeliefert werden kann. Und dass du das Ganze anschauen kannst, hat er natürlich auch den ersten Browser, den es gegeben hat, programmiert. Hat damals geheißen, der erste Browser, World Wide Web. Sehr kreativ.",
      "start": 1062779,
      "end": 1108567,
      "confidence": 0.8235371900826444,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also kannst du eigentlich sagen, Tim Berners-Lee war ein pragmatischer Indie-Hacker der frühen 90er. Ein pragmatischer, ideologischer Indie-Hacker mit einem Side-Project. Weil er hatte ja keine Kommerzialisierungsabsichten, sondern, so wie ich das am Anfang verstanden hab, hat er eher für was Offenes gekämpft, sodass jeder Zugang zu Informationen hat und dass das alles leichter ist. Also eher schon im ideologischen Open-Source-Bereich.",
      "start": 1108627,
      "end": 1131279,
      "confidence": 0.8282131147540984,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Natürlich, er ist von der wissenschaftlichen Seite gekommen, da ist das glaube ich sowieso wesentlich tiefer drin. In der DNA würde ich mal sagen, also er hatte wirklich ein Open Space für Knowledge Sharing geschaffen, ein dezentrales System, was niemand besitzt, was offen ist, was frei ist, dass man wirklich Wissen zur Verfügung stellt und jeder darauf zugreifen kann. Also das war ganz wichtig und dafür kämpft er auch heute noch, aber dazu kommen wir eben noch später. Und dann hat er, glaube ich, einfach als Side-Project halt irgendwie sich überlegt, okay, wie kann er was am schnellsten publishen, würde man heute sagen, oder mal an den Start bringen. Ich glaube, es war nicht so strukturiert. Er hatte halt einfach nur eine gewisse Zeit und hat einfach mal gestartet mit dem Ganzen. Muss man ihm aber auch zugute halten, er hat es fertiggestellt. Also er hat was online gebracht, was natürlich auch wichtig gewesen ist, dass man halt irgendwas hat und nicht den Standard ewig lang diskutiert. Das kam dann alles später mit den ganzen Standards. Er hatte natürlich jetzt keinen klassischen Standard entwickelt, der irgendwie aufwendig definiert war und bis ins kleinste Detail definiert war. Er wollte einfach möglichst einfach so ein Hypertext, ein globales Hypertext-System an den Start bringen.",
      "start": 1131637,
      "end": 1195530,
      "confidence": 0.8022511848341234,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also der hat eigentlich schön dreckig den heutigen Stack runtergehackt. Ist das richtig? Also das, was ich immer predige, hat zu einer solchen Revolution geführt. Und Clean Code hat er damals vergessen und nicht angewandt.",
      "start": 1196070,
      "end": 1208482,
      "confidence": 0.7617142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da bin ich mir jetzt nicht so ganz sicher, weil um auf deine Frage auch zurückzukommen, was denn für Programmiersprache verwendet wurde, er hat damals Objective-C verwendet. Das war die erste Version von Objective-C und Objective-C auch damals in dem Next-Dunst-Kreis entwickelt. war ja sehr an Smalltalk angepasst und Smalltalk ist ja so die Vorzeigeobjektorientierung. Das heißt, vielleicht war das sogar ein sehr schöner Code, weil mit Smalltalk ist man fast gezwungen, einen schönen Code zu schreiben. Objective-C kann ich jetzt schwer einschätzen, vor allem das damalige, und ob er einen schönen Code geschrieben hat, also vielleicht hat er auch Clean Code geschrieben und hat trotzdem die Welt revolutioniert, sogar mit einem Clean Code.",
      "start": 1209158,
      "end": 1246876,
      "confidence": 0.7738070175438593,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Noch mal ein kurzer Exkurs zu Objective-C. Ja, wer für heutige Mac-Plattformen entwickelt, wird mit hoher Wahrscheinlichkeit um Objective-C beziehungsweise jetzt Swift nicht mehr drum herum kommen. Es ist aber so, dass Objective-C schon sehr lange existiert und zwar ist es im Jahr 1984 rausgekommen. Also es ist keine neue Sprache, die nur auf MacOS läuft oder ähnliches, sondern schon ein bisschen was älter, wie der Sir Tim Berners-Lee natürlich jetzt hier auch beweist. Du hattest aber gerade noch erwähnt, dass er als Teil des Stacks den ersten Browser entwickelt hat, der sich World Wide Web nannte. Und da habe ich eine kurze Story. Irgendwie bin ich über einen sehr interessanten Podcast gestolpert, der heißt Kampf der Unternehmen. Und eigentlich geht es in diesem Kampf der Unternehmen dann immer nur so um so Storys so Aldi vs. Lidl, Red Bull vs. Monster, also dem Energy Drink und so weiter und so fort. Und das ist eher so ein Geschichtenerzähl-Podcast, aber mehr oder weniger auf wahren Begebenheiten. Und was sie auch haben, ist fünf oder sechs Episoden zum Thema Internetmächte beziehungsweise Browser. Und das ist ganz interessant, weil in deren Recherchen war World Wide Web jetzt als Browser, kommt da gar nicht wirklich drin vor, weil die starten eher ganz, ganz früher, also auch so um die 90er, Anfang der 90er, mit dem Browser Mosaik. von Marc Andreessen, heute bekannt als relativ großer Venture-Capital-Geber, Risiko-Capital-Geber, glaube ich. Und die erzählen halt die ganze Story, wie wurde Mosaik entwickelt, nämlich auch, es war nämlich auch ein Zeitprojekt an einer Universität. Also ich glaube, da schließt sich schon wieder der Kreis, dass diese ganze Internetgeschichte sehr viel aus dem wissenschaftlichen Bereich kommt. Dann wurde Mosaik als erster Browser sehr populär. Das war so die Zeit, wo es 50 Webseiten gab. Also, du merkst schon, relativ nah, zeitlich gesehen, an der Idee von Tim Berners-Lee, also, es baut natürlich auf die Idee von Tim Berners-Lee auf, aber 50 Webseiten. Ich weiß nicht, wie viele Webseiten haben wir heute? Ich glaub, ein paar mehr. Aber damals so 50 Webseiten. Und deren Vision war eigentlich, das Internet beziehungsweise Webseiten zugänglicher zu machen, einfacher zugänglicher zu machen. Da haben sie halt Mosaik entwickelt als Universitätsprojekt. Das wurde dann sehr, sehr, sehr erfolgreich und Marc Andreessen wollte das dann in eine eigene Firma überführen und dann so ein bisschen lizenzieren, hat dann nicht geklappt. Dann hat die Universität gesagt, hör mal, pass mal auf, du hast die ganze Sache jetzt hier als Forschungsprojekt gemacht und deswegen gehört der Universität, das Intellectual Property und der Source Code. Dann haben die gesagt, hey, das ist jetzt aber irgendwie nicht ganz so geil, das ist nicht die Vision, die ich habe. Ich verlasse jetzt die Universität und als mehr oder weniger kleiner Racheakt Wurde dann die Firma Netscape gegründet, die dann eine Reimplementierung vom Mosaikbrowser gemacht hat, der dann zehnmal schneller war als der ursprüngliche Mosaikbrowser. Und das wurde dann lizenziert und dann ist dieser ganze Krieg Internet Explorer versus Netscape ausgebrochen. Also kann ich nur mal ans Herz legen, sehr interessanter Podcast, wäre so ein bisschen über, ja, nennt man das Internetgeschichte? Weiß ich nicht. Aber sehr interessant, wie sich das alles so entwickelt hat, wie da Bill Gates mit reinspielt, wie Bill Gates am Anfang das Internet bzw. die Browser-Geschichte verschlafen hat, wie das mit Browser-Lizenzierung aussieht, Mosaic, Netscape, Internet Explorer usw. Verlinken wir natürlich auch in den Show Notes.",
      "start": 1247196,
      "end": 1438677,
      "confidence": 0.7933257443082312,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Diese Zeit hat natürlich Tim Berners-Lee auch immer ganz klar in seinen ganzen historischen Rückblicken natürlich erwähnt. Es gibt auch zum Beispiel diese Lecture, also diese Vorlesung, die man im Rahmen von dem Turing Award halten muss, wirklich muss, vertraglich, um auch das Preisgeld und so weiter zu bekommen, muss man eine Vorlesung halten, wo man so in die Vergangenheit natürlich zurückblickt. Und Tim Berners-Lee hat es auch beschrieben, dass er natürlich am Anfang großen Erfolg gehabt hatte, exponentiellen Wachstum mit dem Internet, es sind Seiten dazugekommen, es hat alles gut funktioniert. Also es war so eine richtig gute Zeit, bis dann 1994 so ein kritischer Moment aufgetreten ist, wo eben diese ganzen Kämpfe angefangen haben. Und er hat gemeint, da war für ihn dann auch klar, dass er da in irgendeiner Form einwirken muss, um seine Idee des offenen Internets zu verteidigen, weil da halt dann wirklich die große Macht Microsoft dazugekommen ist, viel Druck ausgeübt hat und der ganze Browser-Kampf und so weiter gekommen ist. Also da war für ihn dann wichtig, okay, er muss jetzt weg von diesem wissenschaftlichen Bereich. Ich mache einfach nur den Standard hin zu, wie kann ich darauf einwirken, dass das Ganze in die richtige Richtung weitergeht, also dass das alles offen bleibt.",
      "start": 1439373,
      "end": 1512990,
      "confidence": 0.8208666666666662,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, nur nochmal um klarzustellen, der große Kampf, der kritische Moment, da ging es einfach ganz brutal um Geld, oder?",
      "start": 1513510,
      "end": 1519614,
      "confidence": 0.7963,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Natürlich. Wenn es einen großen Kampf gibt, geht es immer um Geld. Und Geld kannst du halt vor allem machen, wenn du was geschlossener machst, dass Leute dir was zahlen müssen. Und das geht halt genau gegen das System des Internets, was er damals, oder des World Wide Webs, um es richtig zu sagen, was er damals erfunden hat und was er natürlich auch dementsprechend verfolgt.",
      "start": 1519654,
      "end": 1539245,
      "confidence": 0.7898787878787878,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was man aber auch ganz kurz sagen musste, zu dieser Zeit war vielen Leuten noch gar nicht bewusst, wie man mit dem Internet eigentlich Geld verdienen konnte. Weil speziell in dieser Browser-Story, die ich gerade erzählt habe, wird sehr oft erwähnt, dass am Anfang die Grundidee war, die Browser-Software selbst, also Mosaic und Netscape, selbst zu lizenzieren. Also du musstest dann irgendwie 50 oder 100 US-Dollar zahlen, um den Browser herunterzuladen. Da haben sie sich dann gegen entschieden, den viralen effekt haben wollten dass wenn der browser frei ist und sich jeder den runterladen kann dass man dann die ganze sache monetarisiert also zu diesem zeitpunkt war noch gar nicht wirklich klar wie man mit dieser sache internet eigentlich geld verdienen konnte da ging es wirklich nur um ganz brutale marktmacht und ich bin.",
      "start": 1539385,
      "end": 1587816,
      "confidence": 0.8697611940298505,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der größte hier Einfach um Market Share zu bekommen und das hat man natürlich dann auch mit eigenen Standards probiert, eigene Features dazu entwickeln und da hat eigentlich Tim Berners-Lee durch die Gründung vom W3C Konsortium, das auch 1994 dann gegründet wurde, probiert dagegen zu arbeiten. Das ist einfach eine unabhängige zentrale Institution gibt, die sich um diese ganzen Standards kümmert, die den HTML-Standard entwickelt, XHTML, was dann später dazu gekommen ist, oder auch heute XML, ADF, AUR, CSS, SVG, die WCAG, wenn es um Zugänglichkeit geht, Barrierefreiheit. Also diese ganzen Dinge kommen dann alle von der W3C, von diesem Konsortium, wo so glaube ich 50 bis 100 Leute arbeiten aktuell und natürlich mittlerweile noch sehr viele Firmen involviert sind, aber das geht alles zurück auf Tim Berners-Lee, der diese W3C ins Leben gerufen hat, damit eben die Firmen zusammenarbeiten, dass es irgendeine unabhängige Institution gibt und nicht alle Firmen nur gegeneinander arbeiten, um sich irgendwie ein Market Share zu sichern.",
      "start": 1587836,
      "end": 1648905,
      "confidence": 0.8270310559006212,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Immer wenn ich das W3C höre, denke ich mir, die Grundidee ist super. In der heutigen, schnell lebligen, lebligen, in der schnell verwandelten Welt ist das aber alles so eine Jaja, hab ich auch das Gefühl, das W3C ist mit einem Krückstock unterwegs, weil meine Frage ist eigentlich, hat das W3C heute noch in der Entwicklung eine essentielle Relevanz, weil ja, die machen dann später den Standard, schon klar, aber und die schreiben den dann auch nieder irgendwo. Super. Aber erstens, bis der Standard da ist, dauert das ja ewig. Zweitens, ich habe so das Gefühl, die großen Browser, Chrome, Edge, spielt Firefox eigentlich noch eine Rolle? Keine Ahnung. Aber dass die eher den Takt vorgeben, die sagen, hey, das wäre cool, dann implementieren sie das schon mal mit Early Support. Dann kommt das W3C irgendwann um die Ecke, standardisiert das und dann haben sie vielleicht nochmal, dann benennen sie irgendwie das Tag um oder ein Attribut von dem Tag nennen sie um und dann endet das Chrome einfach auch, aber die Funktionalität ist ja schon da. Also ich habe das Gefühl, Das W3C standardisiert eigentlich das, was die großen Browserhersteller eigentlich pushen.",
      "start": 1649465,
      "end": 1710683,
      "confidence": 0.788041450777202,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und ist das schlecht?",
      "start": 1710723,
      "end": 1711904,
      "confidence": 0.5932499999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sehr gute Frage. Ich denk mir immer, wenn ich so ein Konsortium hab, vielleicht bin ich da auch ein bisschen altmodisch und wasserfallmodelltechnisch unterwegs, dass man sagt, okay, man standardisiert erst und dann implementiert ist, aber auf der anderen Seite scheint ja die Implementierung nicht so teuer zu sein, dass man halt drei-, viermal drüber iterieren kann. Auf der dritten Seite muss ich jetzt auch sagen, okay, Wenn man einfach was rausschießt, damit experimentiert und erstmal schaut, wird das überhaupt von den Internetnutzern, von den Webseitenherstellern und so weiter und so fort benutzt, dann ist das auch in irgendeiner Art Produktvalidierung. Keine Ahnung.",
      "start": 1711944,
      "end": 1744231,
      "confidence": 0.816796116504854,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also ich glaube, dass mittlerweile natürlich die Firmen extrem viel Einfluss auf diese ganzen Konsortien und Gremien haben, genauso wie Cisco eigentlich einfach definiert, was so am Netzwerk-Stack unterwegs ist. Vielleicht heutzutage weniger als früher und weniger die IEEE, die es eigentlich machen sollte, gleich wie mit der W3C. Die sind vielleicht getrieben durch die Firmen. Mittlerweile würde ich sagen, ist es besser geworden, da die Firmen wirklich mehr reingehen in die Konsortien und dort auch diskutieren, das als Plattform nutzen, weil die natürlich auch alle Interesse haben, dass ihre Features mit reinkommen. Wie weit es ein früchtetragendes System ist, Da habe ich zu wenig Einblick, dass ich das sagen könnte. Es wäre natürlich interessant, mal wirklich von Leuten zu hören, die da drinnen arbeiten. Aber ich habe zumindest das Gefühl, es gibt so einen gewissen Ausgleich zwischen den ganzen Firmen, die so ein W3C-Konsortium zum Beispiel anbieten kann oder bilden kann. Und wenn der Standard später rauskommt erst, sehe da weniger das Problem, weil irgendwann gibt es halt diesen Standard und ist ja gut, wenn mehrere Seiten experimentieren. Anders wäre es, glaube ich, auch gar nicht mehr möglich, dass man in seinem Elfenbeintum dann einen Standard entwickelt, der dann schlussendlich implementiert wird. Es ist, glaube ich, gar nicht mehr möglich und jeder, der so Standardentwicklungen kennt, weiß, dass es einfach Zeit braucht. Auch wenn man zum Beispiel im Firmenumfeld, irgendwie im kleineren Umfeld, so einen Code-Style-Guide entwickelt. Das braucht einfach ewig, bis da alle zufrieden sind, bis da alle angehört wurden und so weiter. Und das Ganze ist ja dann nochmal ein paar Levels komplexer eigentlich, wenn da dann wirklich Firmen dabei sind und solche Standards entwickelt werden. Aber grundsätzlich, glaube ich, ist es wichtig, dass es so eine unabhängige Stelle gibt.",
      "start": 1745512,
      "end": 1843617,
      "confidence": 0.8241467576791814,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also jetzt, wo wir gerade so ein bisschen darüber reden, ist das natürlich schon eine harte Sache eigentlich, ne? Klar, wir sind jetzt ein paar Jährchen weiter, 30, 33 Jahre weiter. Wenn ich mir vorstelle, vor 33 Jahren hat sich jemand hingesetzt, hat HTML, spezifiziert möchte ich nicht sagen, ich würde sagen erfunden, sich darüber Gedanken gemacht, hat das Protokoll HTTP entwickelt, hat die URL mehr oder weniger erfunden, um weltweit Ressourcen zu verlinken, und hat sogar noch ein System, ein Software entwickelt, um die anderen drei Elemente wirklich zu verknüpfen. Das ist schon eine harte Sache, weil ich denke mir, wie viele Leute wären da heutzutage in der Lage zu, das Ganze in zwei Monaten zu machen. Da frage ich mich, würde man das heute nicht vielleicht anders komplett over-engineeren. Also wurde zum Beispiel mal Tim Berners-Lee die Frage gestellt, wenn er die ganze Sache nochmal neu machen würde, Was der jetzt ändern würde? Also würde er zum Beispiel mit Test Driven Development First starten oder mit Extreme Programming oder mit Python? Oder würde der sagen, hey, pass mal, auf HTML hätte ich nicht mehr so erfunden, weil...",
      "start": 1843997,
      "end": 1904320,
      "confidence": 0.7913439153439156,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es wäre ja auch interessant, mal den Source Code zu sehen, den er damals entwickelt hat. Wäre sicher ganz cool. Ich vermute einfach, die Systeme waren auch einfacher damals.",
      "start": 1904360,
      "end": 1912845,
      "confidence": 0.7597586206896552,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, es gab ja kein Google und kein Stackoverflow, ne? Also das bedeutet, der muss ja schon irgendwie ein Buch da links oder rechts liegen gehabt haben. Also das ist, glaube ich, schon eine harte Nummer.",
      "start": 1913264,
      "end": 1921372,
      "confidence": 0.6737777777777778,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber es war jetzt zum Beispiel rein textbasiert. Also da waren noch keine großen, ich glaube, es waren noch keine Grafiken zum Beispiel dabei. haben die Computer damals ja noch gar nicht anzeigen können. Also das ganze System war schon auch ein bisschen einfacher. Das heißt, du hast vielleicht auch weniger beachten müssen und hast vielleicht leichter was an den Start bringen können. Dafür wird heute wieder viel abstrahiert. Also ich glaube, es ist schwer zu vergleichen. Was aber interessant ist, weil ihm wurde mal die Frage gestellt in einem Talk, ob er was von der Architektur ändern würde heutzutage. Und er hat gemeint, das, was er auf jeden Fall als großes Problem sieht und was er anders machen würde, ist das ganze DNS-System mit den zentralen Nameservern, weil das halt wirklich kein dezentrales System ist, sondern ein sehr schwaches System, was leicht angreifbar ist und dadurch halt auch viele Probleme macht. Also das würde er heutzutage viel dezentraler gestalten. Er hat auch bekrittelt, dass das sehr kommerziell geführt wird. Einfach möglichst viele Domains, jetzt Top-Level-Domains hinzugefügt werden, nur um Geld zu verdienen. Und der, der am meisten bezahlt, bekommt die Domain und die ganzen Geschichten, die dahinter liegen. Also das würde er auf jeden Fall komplett anders lösen, hat er gemeint heutzutage. Beziehungsweise er hoffte auch, dass das vielleicht noch mal irgendwann verbessert wird, das ganze DNS-System. Sonst ist er eigentlich sehr zufrieden mit dem ganzen Stack.",
      "start": 1921412,
      "end": 1997372,
      "confidence": 0.8111386554621847,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Siehst du das für realistisch, dass das System DNS noch mal irgendwann wirklich weltweit ersetzt wird mit was anderem?",
      "start": 1997412,
      "end": 2003013,
      "confidence": 0.7984210526315788,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, vielleicht weniger ersetzt, aber es kann ja durchaus verbessert werden in die eine oder andere Richtung.",
      "start": 2003113,
      "end": 2007674,
      "confidence": 0.8059411764705882,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Abwarten, was die Zeit bringt. Vielleicht kommt ja irgendwann mal irgendeine AI auf die Idee, DNS besser zu machen. Aber bei der Vorbereitung zu dieser Episode habe ich ein bisschen rumgelesen und da ist mir ein Satz in Erinnerung geblieben. Und zwar stand da, dass bis heute nicht alle Ursprungsideen von Tim Berners-Lee fürs Internet umgesetzt wurden. Also dass das immer noch nicht, ich sag mal, vollständig implementiert wurde. Und was wurde damit gemeint? Was fehlt jetzt gerade noch? Was wurde nicht implementiert, beziehungsweise kam nicht so durch wie geplant?",
      "start": 2007694,
      "end": 2038826,
      "confidence": 0.8029666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also was Tim Berners-Lee ursprünglich ja auch sich gedacht hat, ist, dass man wirklich gemeinsam an Wissen, an Webseiten, an Dokumenten arbeitet. Also das, was man heute von Wikipedia kennt, war schon ganz ursprünglich in seiner Idee mit dabei und jeder der Rest Protokolle implementiert. Kennt ihr, dass es neben dem GET auch ein POST gibt, ein PUT und diese Dinge. Und die kommen ganz ursprünglich von Tim Berners-Lee, der sich damals schon gedacht hat, okay, wenn ich ein Dokument habe, da steht was Interessantes drin und ich will das erweitern oder ich will was ausbessern, dann ändere ich dieses Dokument bei mir lokal und lege es dann wieder zurück auf den Webserver mit einem Postput, was es auch immer ist und dann ist das Dokument geändert. Also das war ganz ursprünglich in seinem Standard bzw. in seiner Idee mit dabei und das wurde eigentlich nie so gelebt. Heutzutage im REST Interfaces wird es wieder gelebt und es geht auf ihn zurück, aber dass man so direkt das Wissen einfach gemeinsam ändert. Das gibt es in Wikipedia und OpenStreetMaps und in Wikidata, aber im klassischen HTTP, im Webseitenumfeld gibt es das zum Beispiel natürlich nicht.",
      "start": 2039546,
      "end": 2108636,
      "confidence": 0.8403897435897436,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wo man ja sagen muss, es ist auch fraglich, ob der REST-Standard beziehungsweise das originale REST-Paper oder ich glaube, das war sogar eine Doktorarbeit von jemandem, wirklich so implementiert wird, wie es damals gedacht wurde, mit Discoverability und immer mit den nächsten, also dass eine REST-API immer selbst entdeckbar ist, ohne die richtigen Endpoints, dass man nur einen Entrypoint braucht. Also eigentlich halt wirklich schon so wie Tim Berners-Lee sich das gedacht hat, mit Links und allem drum und dran, alles vernetzt.",
      "start": 2109356,
      "end": 2139528,
      "confidence": 0.8141829268292682,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man muss natürlich dazu sagen, und ich habe das gerade kürzlich irgendwo anders in einem anderen Kontext gehört, dass diese ganzen Technologien, sprich vom World Wide Web, aber teilweise auch diese BIP, alle anderen Dinge aus dem wissenschaftlichen Umfeld kommen und immer so designed wurden, als würde es nur gute Menschen geben. dass man den anderen vertraut und dass es keine Bad Guys gibt im gesamten System. Und dass darum diese ganzen Protokolle eher schlecht abgesichert sind und leicht beeinflussbar sind. Auch mit DCP kannst du ja, wenn du böse bist, teilweise Bandbreiten ausnützen und die anderen Streams nach unten drücken. Also da gibt es ja auch Mechanismen. All diese Protokolle basieren eigentlich auf einer guten Welt. Und das ist natürlich oft ein Problem. Und auch, dass man einfach jeder das austauschen kann, ein Dokument und was ändern kann, hat natürlich auch dieses Problem, sobald es irgendwie böse Kräfte gibt, die natürlich das für sich in irgendeiner Form verwenden wollen. Und auch jetzt im Internet mit den ganzen Geldmachereien, die ihr halt auch so als großes Problem seht und auch Hate Speech und das ganze Social Media, was natürlich gegen sein Konzept des offenen Netzes eigentlich geht.",
      "start": 2139918,
      "end": 2207260,
      "confidence": 0.8262335025380708,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So ein Misuse von zum Beispiel dem TCP-IP-Protokoll habe ich auch schon mehrmals in meiner beruflichen Laufbahn erlebt, weil so kam ich auch mehr und mehr in diesen Site-Reliability-Engineering-Bereich, dass man einfach TCP-Connections, also dass Attacker bei Webseiten einfach eine Anfrage stellen, die TCP-Connection dann aber einfach offen lassen und somit die offenen Ressourcen auf irgendwelchen Loadbalancern, Reverse-Proxien und so weiter einfach blocken und somit keiner mehr auf die Webseite kann. Also da muss ich dir zugeben, das Protokoll selbst gibt da nicht so viel Schutzmechanismen vor und jetzt wo du sagst, dass die ganze Sache mit gutem Hintergrund entwickelt wurde, ist es auf jeden Fall interessant zu wissen und wie man jetzt Protokolle wirklich mal so sieht, weil ich glaube das erklärt eine ganze Menge. Jetzt gibt es ja in diesem ganzen Ökosystem von Internet und Discoverability und Verlinkung alle fünf Jahre diesen Push nach dem sogenannten Semantik-Web, dass man mehr und mehr Daten strukturell konsumierbar macht, also mehr Maschinen lesbar. Hat Tim Berners-Lee damit auch was zu tun oder kam die Idee von wem anders? Weil ich meine, eigentlich geht es ja voll in seine Kerbe, so mit alles offen und jeder hat Zugriff und so weiter. Also theoretisch müsste das doch eigentlich der nächste Step sein, auf den wir irgendwie seit 20 Jahren schon warten, weil ich glaube zu meiner Uni-Zeit war das auch schon ein großes Thema.",
      "start": 2207640,
      "end": 2284824,
      "confidence": 0.7875930735930737,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also du hast es ja schon ganz gut rausgearbeitet. Ihm ist ja sehr wichtig, dass man allgemeines Wissen zur Verfügung stellt, dass man Zugriff auf Wissen hat. Das war die Grundidee, dass alles dezentralisiert ist, dass alles offen ist, dass das über Netzneutralität alles verfügbar ist. Und er hat zum Beispiel auch 2009 gerade noch Er erwähnt die World Wide Web Foundation, also nicht das Konsortium, sondern die Foundation, mit seiner Frau gegründet, in der er zum Beispiel pusht, dass Menschen mehr Zugriff auf Wissen haben, auf das Internet, auf das World Wide Web, wie er begonnen hat. Also in den Anfangszeiten waren das so 20 Prozent. Also 20 Prozent der Menschheit hat Zugriff auf das World Wide Web gehabt. Wie viel ist es heutzutage? Was glaubst du?",
      "start": 2285563,
      "end": 2326317,
      "confidence": 0.8002421875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es gibt immer noch ein paar Länder, die relativ weit hinten sind. Aber weltweit 70, 75.",
      "start": 2326717,
      "end": 2333603,
      "confidence": 0.6984375000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ganz gut geschätzt sind es 60. Also aktuell sind es 60 Prozent. Das ist eigentlich weniger als ich mir persönlich erwartet habe, weil es heißt, dass immer noch 40 Prozent keinen Zugriff auf World Wide Web haben, trotz Handys, die ja eigentlich jetzt weltweit schon sehr verbreitet sind, muss man dazu sagen. Also er war immer auf der Schiene, freies Wissen und Wissen zu verknüpfen. Und das Semantic Web oder Open Linked Data ist eigentlich, wie du sagst, der nächste Schritt und wurde auch von ihm vorgeschlagen 2006, dass man eben nicht nur Webseiten verlinkt, Dokumente, sondern auch Daten. Und da gibt es einen sehr bekannten TED-Talk von ihm von 2009, in dem er erklärt, wie wertvoll Daten sind und wenn wir es schaffen, Daten zu verknüpfen, dass wir eben sehr viel Informationen und Gewinn daraus ziehen können. Und damit du das auch verstehst, spiele ich dir jetzt mal Tim Berners-Lee vor.",
      "start": 2333613,
      "end": 2384290,
      "confidence": 0.7949802631578945,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Let's start with government data. Barack Obama said in a speech that American government data would be available on the Internet in accessible formats. And I hope that they will put it up as linked data. That's important. Why is it important? Not just for transparency. Yeah, transparency of government is important. But that data, this is the data from all the government departments. Think about how much of that data is about how life is lived in America. It's actually useful. It's got value. I can use it in my company. I could use it as a kid to do my homework. So we're talking about making the place, making the world run better by making this data available. In fact, if you're responsible, if you know about some data in government department, often you find that these People, they're very tempted to keep it, Hans calls it database hugging. You hug your database, you don't want to let it go until you've made a beautiful website for it. Well, I'd like to suggest that, yes, make a beautiful website. Who am I to say don't make a beautiful website? Make a beautiful website, but first, give us the unadulterated data. We want the data. We want unadulterated data, okay? We have to ask for raw data. Data, now. Und ich werde Sie bitten, das zu üben. Können Sie sagen, raw?",
      "start": 2385939,
      "end": 2461158,
      "confidence": 0.47353448275862076,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Raw.",
      "start": 2461198,
      "end": 2461919,
      "confidence": 0.554,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Können Sie sagen, data?",
      "start": 2461939,
      "end": 2462539,
      "confidence": 0.23025,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Data.",
      "start": 2462559,
      "end": 2462739,
      "confidence": 0.321,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Können Sie sagen, now?",
      "start": 2462779,
      "end": 2464320,
      "confidence": 0.3305,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Now.",
      "start": 2464340,
      "end": 2464981,
      "confidence": 0.321,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Right.",
      "start": 2465021,
      "end": 2465421,
      "confidence": 0.383,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Raw, data, now.",
      "start": 2465501,
      "end": 2465941,
      "confidence": 0.221,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Raw, data, now. Üben Sie das. Es ist wichtig, weil Sie keine Ahnung haben, wie viele Entschlüsse Leute mitbringen, um auf ihre Daten zu hängen und es nicht zu geben, obwohl Sie es als Steuerzahler bezahlt haben. Und es ist nicht nur Amerika, es ist überall auf der Welt, und es sind nicht nur Regierungen, natürlich sind es auch Unternehmen.",
      "start": 2465961,
      "end": 2484634,
      "confidence": 0.3792333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, Andi, also wie stellst du jetzt deine Daten in Zukunft zur Verfügung?",
      "start": 2486135,
      "end": 2489618,
      "confidence": 0.7619230769230769,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Raw Data. Now.",
      "start": 2489678,
      "end": 2491880,
      "confidence": 0.8533333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau. Hast du sehr schön gelernt. Perfekt. Und genau darum geht es eigentlich in Semantic Web und Linked Open Data, dass man eben die Daten wieder so zur Verfügung stellt, dass sie verlinkbar sind. und vom Computer im Idealfall lesbar sind. Also diese ganze Open-Data-Welt, die man auch so kennt, manche Städte und Länder probieren das ja, so mehr schlecht als recht, muss man auch dazu sagen, ihre Daten offen zur Verfügung zu stellen. Genau das ist die ganze Idee, dass man die dann verknüpfen kann, verbinden kann und neue Informationen gewinnen kann.",
      "start": 2491920,
      "end": 2522298,
      "confidence": 0.8453548387096776,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn ich mich recht erinnere, hast du da irgendwie deine Doktorarbeit rumgeschrieben, oder? Deine Doktorarbeit hatte irgendwas mit Knowledge-Graphen, Open-Data, Semantik-Web, Link-Daten oder ähnliches sowas zu tun. Ist das richtig?",
      "start": 2522318,
      "end": 2532363,
      "confidence": 0.7330333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, hast du gut recherchiert.",
      "start": 2532541,
      "end": 2535323,
      "confidence": 0.55,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie war nochmal der Titel deiner Doktorarbeit? Das ist ja oft sowas Hochgestockenes, was kein normaler Mensch versteht.",
      "start": 2535343,
      "end": 2540306,
      "confidence": 0.6594444444444444,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich hab extra den Titel so gewählt, dass du ihn auch verstehst. Möglichst kurz, ganz easy. Der Titel war The Snoopy Concept, Leveraging Recommendations for Knowledge Curation.",
      "start": 2540326,
      "end": 2551214,
      "confidence": 0.7130714285714285,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also hast du eigentlich die Arbeit von Tim Berners-Lee im weitesten Sinne weitergeführt, oder?",
      "start": 2551254,
      "end": 2556117,
      "confidence": 0.8126428571428572,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe eigentlich in einem Bereich die Doktorarbeit geschrieben, der dann später, ein paar Jahre später unter Wikidata eigentlich bekannt geworden ist, dass man also wirklich Informationen und Daten homogen abspeichert und zwar so, dass sie der Computer verstehen kann. Also dass man Manche kennen das vielleicht unter dem Begriff RDF oder Semantic Web, hat genauso darauf basiert, dass man alles in ganz simplen Facts abspeichert. Man kann sich das so vorstellen, wie wenn man einfach kurze deutsche Sätze bildet, dass man sagt, Person 1 hat Name Andy. Person 1 hat Alter. Wie alt bist du nochmal? Brauchen wir jetzt nicht rauspussanen, sonst bekommst du so viele Kontaktanfragen. Auf jeden Fall bricht man alles auf kurze Sätze hinunter und die kann der Computer gut verstehen, wenn du alles in der Form Subjekt, Eigenschaft, Objekt herunterbrichst und Alle deine Daten so speicherst, dann bekommst du am Ende im Prinzip, wenn du das als Graph darstellst, einen sehr großen Graph, weil jedes Objekt kann wieder auch eine Eigenschaft haben und so sind die miteinander verknüpft. Das hat Wikidata dann eigentlich später im Wikipedia-System abgebildet und das war eigentlich auch meine Doktorarbeit in dem Bereich.",
      "start": 2556528,
      "end": 2631598,
      "confidence": 0.8233958333333332,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber die Verbreitung von diesem Modell außerhalb von Wikidata ist jetzt im World Wide Web nicht wirklich groß. Also es ist jetzt nicht so, als dass die meisten Webseiten, Frameworks das wirklich nativ supporten, oder? Obwohl die das eigentlich ja könnten mit, nehmen wir mal Static Site Generators, du hast ja dieses Frontmeta, wo du Metadaten in Markdown schreibst und so. Eigentlich ist es ja das und dann theoretisch könnte man dadurch ja diese Daten oder beziehungsweise diese Datenrepräsentation, die du da jetzt gerade beschrieben hast, ja eigentlich relativ einfach umsetzen, oder?",
      "start": 2631858,
      "end": 2658484,
      "confidence": 0.7829021739130435,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also man glaubt immer, dass das so wenig verwendet wird und das Semantic Web tot ist, aber wenn man das Ganze ein bisschen umformt und zum Beispiel schema.org erwähnt, was vielleicht viele kennen, das hat Google initiiert und ist eigentlich so eine Ontologie beziehungsweise ein Schema, wie man Informationen und Daten zur Verfügung stellen kann und vor allem auch in Webseiten, dann sieht man, dass das extrem viele Webseiten machen und aktuell wird eigentlich geschätzt, dass ein Drittel aller Webpages solche Informationen drin haben. Die siehst du natürlich nie. Wenn du auf irgendeine Event-Page gehst, dann siehst du dort das Event präsentiert, das aber im HTML-Code auch zusätzlich die Information über schema.org Properties abgelegt ist und Google die zum Beispiel auch auslesen kann. Das siehst du ja direkt nicht, aber das existiert und ist weiter verbreitet als man denkt. Könnte natürlich noch wesentlich weiter verbreitet sein, aber es gibt es und es wird eigentlich immer mehr verwendet.",
      "start": 2658924,
      "end": 2712993,
      "confidence": 0.818006369426751,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Inwieweit ist die Grundidee beziehungsweise die Umsetzung des Ganzen heute überhaupt noch relevant, wenn wir so was haben wie Chat-GPT, GPT-3.5, GPT-4, Large-Language-Models und so weiter? Weil eigentlich heben die das ja auf eine andere Ebene. Weil die untersuchen ja mit Natural Language Processing, ich sag mal, Prosa-Texte und Co. Oder nicht nur Prosa-Texte, sondern vielleicht sogar auch Bilder, Bildererkennung und so weiter. Deswegen, dass die Daten ja gar nicht in einem semantischen Format vorliegen müssen.",
      "start": 2713233,
      "end": 2741848,
      "confidence": 0.8391842105263158,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also du kennst ja sicher auch die ganzen Queries, die es mit Chat-GPT gibt, dass du zum Beispiel sagst, okay, definiere mir einen CV über Andi Grunwald und er spuckt dann irgendwelche Daten aus, die zwar gut klingen, aber hinten und vorne nicht stimmen. Also dieses Halluzinieren, wie man das ja mittlerweile so nennt, bei den Language Models. Und das zeigt ja, dass diese Language Models zwar sehr gut die Sprache beherrschen, aber ein extremes Problem haben, wenn es um Informationen geht. Das heißt, du brauchst diese strukturierten Daten oder semi-strukturierte Daten, wie man sie auch oft nennt, die aber computerlesbar sind, um logische Zusammenhänge zu bilden und dir dann wirklich richtige Informationen zu liefern. Also im Idealfall verknüpfst du die zwei Welten, das kommt in Zukunft sicher früher oder später, und dann kann dir eben sowas wie ChatGPT auch die wirklich richtige Information ausgeben und nicht nur eine, die gut klingt und vielleicht wahr sein könnte. Und das ist der große Unterschied. Und darum brauchst du eigentlich diese strukturierte Information, die ist extrem wichtig. Der Knowledge Graph, den du bei Google kennst, wenn dir da rechts zum Beispiel in dieser Box was angezeigt wird, der basiert ja genau auf diesem großen Open Link Data Graph, der auch erweitert wird von Google, der, wo aber Wikipedia dabei ist, wo Wikidata dabei ist, Open Street Maps, andere Datenquellen. Es gibt sehr, sehr viele Datenquellen. Können wir auch ein cooles Bild verlinken. wo man sieht, wie diese Welt an Datasets miteinander verknüpft ist. Das Herzstück ist meistens Dbpedia oder Wikidata mittlerweile, also weil dort die allgemeinen Informationen drinnen sind, wo am ehesten Verknüpfungen mit der äußeren Welt stattfinden. Also wenn du jetzt irgendwelche Zusatzinformationen in deinem Dataset über Städte hast, dann verlinkst du am Ende immer die Daten mit den Städten in Wikipedia, Wikidata, damit du, wenn du in Wikidata reingehst, auf eine Stadt gehst, Duisburg, findest du alle Datensätze, die in irgendeiner Form irgendwas über Duisburg zum Beispiel beschreiben und dann kannst du weiterspringen in dieser riesigen Cloud. Und im Hintergrund, wenn du Google Suche anwirft und dir da so eine Information auf der rechten Seite in dieser Box angezeigt wird, über Schauspieler zum Beispiel, über deine Stadt, dann ist es genau diese Information aus dieser großen Linked-Open-Data-Wolke, die dir da angezeigt wird. Also das gibt's, das wird verwendet und es ist viel in Verwendung, aber unter der Haube und sehr unsichtbar für die meisten Leute. Und darum glaubt man vielleicht heutzutage, das Ganze ist tot.",
      "start": 2742963,
      "end": 2887938,
      "confidence": 0.8292144578313254,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ja eine falsche Annahme ist, weil es ist ja sehr viel in Verwendung, wie du sagst. Da steht halt nicht Semantik drüber, sondern es wird halt einfach nur für den Menschen nutzbar präsentiert, was ja eigentlich super ist in der Hinsicht.",
      "start": 2888678,
      "end": 2900641,
      "confidence": 0.7728333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, ja. Und die Grundidee ist natürlich auch da wieder in der Open Linked Data Cloud. Alles hat eine URI, also ein Unique Identifier. Duisburg hat zum Beispiel einen Unique Identifier Duisburg in Wikipedia. Und damit kann ich dann eben wieder solche Links herstellen, die global gültig sind. Und ich komme einen Schritt weiter in dieser Idee, mein Wissen global verfügbar zu machen und vor allem verlinkbar zu machen. Und der Computer versteht halt diese Links und kann es dann auch viel schneller auswerten.",
      "start": 2901021,
      "end": 2929819,
      "confidence": 0.8105238095238095,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eigentlich schon hart, was ein Mensch mit einem Side-Project nach 30 Jahren für einen Effekt haben kann.",
      "start": 2929839,
      "end": 2935966,
      "confidence": 0.7964117647058824,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man muss natürlich schon dazu sagen, dass da ganz viele andere Leute auch mit dabei waren, aber er hat natürlich den Grundstein gelegt und man muss auch dazu sagen, er kämpft heute noch für diese ganze offene Welt, den ganzen Standard, die Standards, die dahinter liegen, W3C und er ist schon überall noch mit dabei und er wurde natürlich auch viel eingeladen. Und ist natürlich auch so eine, darf man kühler Figur sagen, oder ist das zu negativ, eine Leitfigur geworden von dem ganzen Movement. Und kämpft natürlich auch dafür und kämpft auch im Hintergrund mit der EU und auf solcher Ebene natürlich genau für dieses freie Internet, Netzneutralität.",
      "start": 2936647,
      "end": 2972940,
      "confidence": 0.8432844036697251,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also man muss ja auch sagen, Timberlake Lee ist jetzt schon im fortgeschrittenen Alter, aber noch nicht so super alt. Er ist jetzt gerade 68 Jahre, wenn ich das richtig gerechnet habe. Aber kommen wir mal genau zu dem Punkt, was macht er denn aktuell jetzt, also ich glaube er ist nicht mehr beim CERN oder?",
      "start": 2972961,
      "end": 2987244,
      "confidence": 0.6758392857142855,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Er ist mittlerweile Professor am MIT, aber ich würde sagen die meiste Zeit reist er irgendwie durch die Welt, macht Vorträge, probiert politischen Druck auszuüben, ist natürlich irgendwo noch überall involviert in den ganzen Konsortien und so weiter, natürlich auf einer höheren Ebene. probiert es zusammenzuhalten und probiert mit seinen Foundations und ihm selbst einfach da dementsprechend politischen Druck auszuüben. Ich glaube, das ist eigentlich das, was er noch am meisten macht aktuell.",
      "start": 2987304,
      "end": 3016371,
      "confidence": 0.851301369863014,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wenn ich ihn mit seiner Grundidee, alles offen, alles Raw Data und so weiter, wenn ich darüber ein bisschen nachdenke und mir ansehe, was jetzt gerade so in der Welt passiert, Facebook versucht das Metaverse zu entwickeln, Elon Musk übernimmt Twitter und versucht dann sogar, Irgendwelche Medien da zu beschneiden, das müsste dem ja schon richtig gegen den Strich gehen, oder?",
      "start": 3016391,
      "end": 3038272,
      "confidence": 0.8089677419354838,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich habe ihn einmal auf einer Konferenz auch gesehen, wo er einen Vortrag gehalten hat. Er ist ein bisschen ein chaotischer Mensch, muss man sagen. Ich finde es irgendwie schwer, ihm zuzuhören. Aber zumindest die Fragen danach sind immer ganz interessant. Und er äußert sich natürlich schon sehr negativ, dass das World Wide Web natürlich auch die ganzen Sachen wie Malware, Hate Speech, Fake News, auch Überwachung natürlich von Leuten in irgendeiner Form ermöglicht hat. Aber er sieht das Ganze auch eigentlich Nicht als irgendeine Sackgasse, sondern einfach als Motivation, das zu ändern, dagegen anzukämpfen, trotzdem die Netzneutralität aufrecht zu erhalten und vielleicht einfach ein anderes Modell auch zu entwickeln, was dann weniger Probleme damit hat. Das war eigentlich ganz interessant. Er hat gemeint, früher war das eigentlich nie ein Problem bei den Blockern, wenn irgendjemand Zum Beispiel, wenn irgendwer irgendein Hate Speech auf seinem Blog veröffentlicht hat, dann hat man diesen Blog halt einfach nicht besucht. Das war relativ easy. Dieser Content wurde nicht gepusht. Der wurde nur von Leuten maximal gepusht. Mittlerweile mit den Social Media hast du natürlich das Problem, dass da irgendein Algorithmus pusht, den du nicht beeinflussen kannst. Also er hat gemeint, wenn alle zurückgingen zu Blogs, würde das dann schon wieder wesentlich besser funktionieren. Aber er ist natürlich Realist und hat auch gemeint, man muss einfach mit neuen Ideen kommen und dem entgegenwirken. Und er wünscht sich auch, dass alle einfach mit Ideen daherkommen, was Online-Stellen, so wie er damals, ist natürlich großer Verfechter davon, dass man den Leuten Programmieren beibringt. Er hat es bei einem Vortrag mal so schön gesagt, get your girls to code und die werden dann die Welt revolutionieren. Also er ist schon auf der Schiene, dass man einfach dagegen ankämpfen muss und dementsprechend alles versuchen muss, um dann diese Probleme im Netz, im World Wide Web wieder zu beseitigen und dagegen anzukämpfen.",
      "start": 3039005,
      "end": 3147701,
      "confidence": 0.7988821656050965,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, in der Regel kann man ja schon sagen, okay, da hat sich irgendwer hingesetzt, hat diesen Algorithmus geschrieben, hat ihn veröffentlicht und hat damit die Welt revolutioniert. Nur es ging halt leider nicht mit derselben Ideologie, die er initial hatte, sondern gegebenenfalls in eine andere Richtung, oder?",
      "start": 3147741,
      "end": 3161167,
      "confidence": 0.7660208333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, er sieht das natürlich, das ganze Kommerzielle schon als ein großes Problem, vor allem wenn du nicht dafür zahlst. Also er ist eigentlich ein großer Unterstützer auch von Paid Models. Das heißt, dass du für deinen Facebook, für dein privates Facebook, Twitter, was auch immer, wirklich zahlst und dadurch aber eben in einer gewissen Form selbst bestimmen kannst, was damit passiert, dass du frei bist, dass du nicht von einem Algorithmus in irgendeiner Form beherrscht wirst, der deine wo eine Firma dahintersteckt, die die Daten weiterverkauft, wo dann die Interessen nicht aligned sind. Also er ist nicht komplett auf der Seite, so wie Richard Stallman, alles muss free sein, sondern er sagt schon, kommerzielle Interessen sind okay, aber du solltest zahlen für dein Service, das du verwendest. Du zahlst ja auch für deinen netzneutralen Internetzugang. Er sieht da schon eine Kombination aus paid Models und offenen, kostenlosen Models, vor allem wenn es um Wissen geht natürlich, was dann ja von anderer Seite vielleicht auch gefördert werden kann. Aber wenn du dein perfektes Social Media haben willst, für dich solltest du dafür zahlen und dann vielleicht auch entscheiden, welche Daten werden geshared, was wird verwendet. Und der hat da zum Beispiel auch selbst über das MIT so ein Projekt gelauncht, das nennt sich Solid Project. Soll so der nächste Schritt sein und ist jetzt auch wieder ein Standard, der es erlaubt, deine Daten von Apps, von Services, die du nutzt, dezentral abzuspeichern und dann auch genau darüber zu entscheiden, was passiert mit den Daten. Welche App kann auf deine Daten zugreifen, welche nicht, was wird geshared von deinem in deinen Storage, der nur bei dir lebt. Also er probiert ein System zu entwickeln, was gegen dieses zentrale Abspeichern deiner ganzen privaten Daten ankämpft und es eben bei dir wieder ablegt, so dass du das Ganze in der Hand hast. Ist aber ehrlich gesagt noch nicht sehr weit, noch nicht sehr weit verbreitet, aber diese Dinge brauchen natürlich auch. Es ist glaube ich eine gute Idee, aber es müssen einige darauf aufspringen, damit das natürlich irgendwann durchzündet. Und rein statistisch gesehen, dass er jetzt zum dritten Mal Erfolg hat, wenn man mal Openlink-Data als Erfolg wertet, ist die Frage, wird sich zeigen. Und ich finde die Idee natürlich cool, aber ehrlich gesagt, wenn man die Webseite angeschaut und das dann Ich war jetzt noch nicht so weit, dass ich gesagt hätte, okay, ich will mir da mal einen eigenen Server oder sowas aufsetzen, um meine Daten zu speichern. Also es fehlt noch vielleicht irgendwie die kritische Masse an Apps oder die Einfachheit, an so ein Storage-System dran zu kommen. Aber die Richtung ist auf jeden Fall das super Interessante.",
      "start": 3162142,
      "end": 3313075,
      "confidence": 0.8029531249999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hat er sich mal irgendwie zu Web 3.0 bzw. Blockchain geäußert? Weil eigentlich müsste das doch in die richtige Richtung für ihn gehen, oder? Ich meine, die Blockchain ist ja jetzt nicht von einer einzelnen Person geownt. Da hast du mehr oder weniger die Raw-Daten verfügbar bzw. werden da die Transaktionen dokumentiert. Also eigentlich, wenn man sich das so vom ... vom High Level ansieht, müsste das doch eigentlich genau in seine Richtung gehen, oder?",
      "start": 3313315,
      "end": 3340086,
      "confidence": 0.7915333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also grundsätzlich, was nochmal sicherstellen müsste, glaube ich, ist, dass er eigentlich 2006 das ganze Semantic Web als Web 3.0 definiert hat. Nach Web 2.0, wo ja das Mitmach-Web war, das Web 3.0 als Semantic Web. Das wurde aber nie in irgendeiner Form weiterverwendet von Leuten und dann ist diese ganze Blockchain-Thematik gekommen und plötzlich war das alles Web 3.0. Also ich vermute mal, das gefällt ihm nicht, obwohl er da glaube ich offiziell noch nichts dazu gesagt hat. Was ihm aber grundsätzlich nicht gefällt, ist mittlerweile ein Blockchain an sich, weil das auch sehr kommerzielles Problem ist, sehr teuer ist, zu langsam und er mittlerweile in der Meinung ist, dass man es einfach nicht braucht. Also das ist die Das ist ein falscher Weg der Dezentralisierung, seiner Meinung nach. Am Anfang war er da offener, meiner Meinung nach, aber mittlerweile durch diese ganze kommerzielle Geschichte, die da rundherum entstanden ist, ist er da einfach der Meinung, dass das gar nicht mehr nötig ist und man kann ja auch dezentrale Systeme bauen, ohne da jetzt irgendwie eine Blockchain zu haben. Also ich glaube, er sieht das eher als Nische und nicht als große Bewegung, die die Welt in irgendeiner Form revolutioniert.",
      "start": 3340126,
      "end": 3407255,
      "confidence": 0.7921990049751242,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und zum Abschluss der Folge eine wichtige Frage. Stell du dir vor, du wärst das Komitee vom Touring Award, würdest du Tim Berners-Lee den Touring Award heute noch verleihen und sagst du, er hat ihn zurecht bekommen? Oder würdest du sogar sagen, für die Leistungen, für das was Tim Berners-Lee, Sir Tim Berners-Lee auf die Straße gebracht hat, ist sogar noch der Touring Award zu wenig?",
      "start": 3407535,
      "end": 3431143,
      "confidence": 0.8369393939393938,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich kenne ehrlich gesagt gar nicht die offiziellen Kriterien vom Turing Award, falls es die überhaupt gibt oder ob das einfach nur das Komitee entscheidet. Können wir mal vielleicht auch recherchieren, bis zum nächsten Mal. Ich glaube auf jeden Fall, wenn man sein Lebenswerk sieht, dann hat das auf jeden Fall Relevanz und das World Wide Web und der Austausch von Wissen heutzutage auf der Welt basiert im Prinzip auf seinem Protokoll. Natürlich haben da extrem viele andere Leute auch mitgewirkt, aber er hat halt den Grundstein gelegt und er kämpft einfach mit seiner Brand noch für die Netzneutralität und für das offene Wissen, was zugänglich sein soll. Und meiner Meinung nach hat er dadurch alleine den Turing Award verdient, auch wenn das jetzt nicht der Verschlüsselungsalgorithmus, der harte mathematische Verschlüsselungsalgorithmus ist. Aber wenn man überlegt, wie es die Welt weitergebracht hat, dann hat er das meiner Meinung nach auf jeden Fall verdient. Und finde es sehr nett, dass du mir jetzt gleich zu dem einzigen Entscheider machst vom Turing Comedy.",
      "start": 3431983,
      "end": 3488378,
      "confidence": 0.8293099415204678,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe gerade mal ganz kurz nochmal nachgesehen und das World Wide Web selbst wurde 2010 sogar für den Friedensnobelpreis vorgeschlagen. Das geht so ein bisschen auf die Frage zurück, ist der Turing Award überhaupt genug oder ist das sogar noch zu tief gestapelt und wenn man sagt okay, Die Arbeiten um Tim Berners-Lee werden für den Friedensnobelpreis vorgeschlagen. Da würde ich schon sagen, okay, da steht der Turing Award vielleicht noch ein bisschen drunter.",
      "start": 3488398,
      "end": 3514404,
      "confidence": 0.7648666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Er hat natürlich, muss man auch dazu sagen, ganz viele andere Preise gewonnen. Also es gibt eine eigene Wikipedia-Seite, die nur eine Liste von Preisen und irgendwelchen Titeln ist, die Tim Berners-Lee bekommen hat. Also ist so lang, dass es nicht auf der Standard-Webseite drauf ist.",
      "start": 3514444,
      "end": 3529678,
      "confidence": 0.8546956521739131,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber zwei Sätze weiter nach dieser Friedensnobelpreisgeschichte steht auch folgendes, weil du hattest das vorhin erwähnt. Im Juli 2021 wurde ein NFT des Quellcodes des World Wide Web von Tim Berners-Lee für ungerechnet 5,4 Millionen US-Dollar über ein Aktionshaus verkauft. weil du hattest glaube ich auch gefragt gibt es den source code noch von dem originalen stack beziehungsweise vor dem originalen browser und ja die antwort scheint ja zu sein und da gibt es sogar ein nft also müssen wir mal raussuchen und wenn wir das gefunden haben verlinken was noch mal in den show notes zugegeben ich bin jetzt nicht der objective-c profi ich kann es ein bisschen lesen aber interessant wäre es glaube ich mal wirklich zu sehen Wichtig, er hat dieses.",
      "start": 3530538,
      "end": 3569952,
      "confidence": 0.7789596774193549,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Geld natürlich dann auch wieder in die Foundation gesteckt, um wieder das Internet weiterzutreiben. Also er hat sich nicht persönlich damit bereichert. Und wie gesagt, damals war er vielleicht auch noch überzeugter von der ganzen Blockchain-Geschichte, als wie er das heute ist.",
      "start": 3569972,
      "end": 3582597,
      "confidence": 0.7982857142857146,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir könnten noch wochenlang über die Person Sir Tim Berners-Lee weitersprechen. Ich habe auf jeden Fall einen sehr, sehr guten Eindruck über diese Person bekommen. In meinem Kopf ist gerade mehr Wow als vorher, weil ich frage mich, okay, was habe ich eigentlich in dieser Welt geleistet, wenn ich über solche Leute rede und höre. Also da fühlt man sich schon ein bisschen doof und ein bisschen Imposter-Syndrom. Aber nun gut, nicht jeder kann ein Held sein, würde ich sagen. Faszinierend.",
      "start": 3583617,
      "end": 3611486,
      "confidence": 0.8283950617283952,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und zum Abschluss vielleicht noch den Aufruf, den er immer gibt, wir sollten das Web re-dezentralisieren, also mehr dezentralisieren wieder, weil die Tendenz sehr in die Zentralisierung gegangen ist in den letzten Jahrzehnten. Also wenn wir ein Problem haben irgendwo, wenn wir ein Problem sehen, sollten wir am besten das selbst in die Hand nehmen und zur re-decentralisation beitragen und sonst wenigstens auf einer politischen Ebene, wo wir das machen können.",
      "start": 3611546,
      "end": 3638269,
      "confidence": 0.8731126760563377,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir hoffen, diese vielleicht auch etwas andere Art vom Engineering Kiosk hat euch gefallen. Lasst es uns auf jeden Fall mal wissen, entweder via Twitter at engkiosk oder via E-Mail stetisch at engineeringkiosk.dev. Alternativ könnt ihr auch noch durch sehr sehr gerne unsere Community joinen. Link wie immer in den Show Notes. Wir freuen uns auf jeden Fall mal zu hören, was ihr ihr über dieses Format, beziehungsweise auch über Tim Berners-Lee denkt. Und ob das jetzt wirklich eine Serie wird, ja oder nein, schauen wir mal. Wir haben auf jeden Fall ein paar Ideen, aber bisher waren wir noch nie so erfolgreich im Seriendurchsetzen. Wir sind sehr gut im Serienankündigen. Aber schauen wir mal, was es so gibt.",
      "start": 3638815,
      "end": 3680027,
      "confidence": 0.7710840336134451,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir versprechen ja nie, dass die Serien in Folge gepublished werden. Man kann ja viele Serien parallel machen.",
      "start": 3680067,
      "end": 3686589,
      "confidence": 0.8656666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Regelmäßig sagt auch einmal jährlich, ne?",
      "start": 3686649,
      "end": 3689210,
      "confidence": 0.8235,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau. Oder einmal alle zehn Jahre. Die großen Erfindungen von Tim Berners-Lee kommen auch regelmäßig, alle 20 Jahre.",
      "start": 3689250,
      "end": 3696441,
      "confidence": 0.8111666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Soviel dazu. Vielen Dank an alle, die bis hier durchgehalten haben und bis nächste Woche. Tschüss zusammen. Ciao.",
      "start": 3696461,
      "end": 3703693,
      "confidence": 0.7644444444444445,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.7963168243368585,
  "audio_duration": 3710.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
