{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/f3a4a1ba-d5b1-44b9-bab3-5dd91a59069b/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 2,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62s0siw4dr-21b9-462a-96b2-632bbb771d54",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Man muss auch mal sich ganz ehrlich eingestehen, ein gutes, effizientes Meeting zu leiten, ist einfach super hart.",
            "start": 2279,
            "end": 9462,
            "confidence": 0.8975000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und ich glaube ja auch mittlerweile, dass Leute schon absichtlich zu spät kommen, damit sie diese Stille am Anfang überbrücken.",
            "start": 10862,
            "end": 16664,
            "confidence": 0.8501,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das Thema Meetings ist ja so ein Hassthema für Knowledgeworker. Jeder kennt's. Das letzte Meeting hätte eine E-Mail sein können. Wir haben zu viele Meetings und kommen nicht zum Arbeiten. Oder diverse Meetings, die für einen selbst gar nicht relevant waren. Und trotzdem saß man bei der Stunde bei dem Gespräch dabei. Das Faszinierende daran, jeder von uns kennt diese paar Grundregeln, wie ein Meeting aufgebaut werden sollte, damit es in Anführungszeichen gut ist. Und weil jeder diese Grundregeln kennt, geht es bei dieser Episode nicht darum. Wir sprechen heute über das Absagen von Meetings, klären was No-Tag-Meetings sind, warum die Law of Two Feed gegebenenfalls die Lösung für eure langweiligen Meetings sein kann, wie Stand-Ups revolutioniert werden könnten und welche Probleme durch die kleinen Meetings an der Kaffeemaschine in einem Hybrid-Office-Setup entstehen könnten. Viel Spaß!",
            "start": 18425,
            "end": 68470,
            "confidence": 0.8447205882352942,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das heißt Kaffee-Maschine, aber trotzdem viel Spaß! Andi, warst du heute schon in unserer Community?",
            "start": 68510,
            "end": 77479,
            "confidence": 0.729,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich war in den Server-Einstellungen vom Discord-Server. Zählt das als ich war in der Community?",
            "start": 77519,
            "end": 81881,
            "confidence": 0.6858666666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Natürlich zählt es.",
            "start": 81921,
            "end": 83482,
            "confidence": 0.8783333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann ja.",
            "start": 83522,
            "end": 84422,
            "confidence": 0.757,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber hast du dann auch was gelesen oder nur die Server-Einstellungen gelesen?",
            "start": 84462,
            "end": 87803,
            "confidence": 0.7951666666666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Da ich ja kein Gamer bin, muss ich mich ein bisschen mit den Server-Einstellungen mal, wie soll man sagen, zurechtfinden und das hat schon enorm viel Zeit gefressen, deswegen habe ich leider keine Nachricht gelesen. Aber das hole ich ja alles nach, dank diesem Discord Server. Der hat ja nicht so eine 90 Tage Message Retention wie Slack im Free Modell. Deswegen kann ich das ja auch noch morgen tun.",
            "start": 87844,
            "end": 108074,
            "confidence": 0.7368285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, also ausreden, ausreden, ausreden, weil sonst hättest du nicht gesehen, dass aktuell gerade eine sehr spannende Diskussion stattfindet auf unserem Discord-Server in unserer Community und das Spannende ist, dass scheinbar die Community irgendwie gleichgeschalten ist mit unseren Ideen, weil derzeit läuft da gerade eine Diskussion auch zu Meetings ab und Meetings ist ja genau unser Thema heute. Und hättest du dich gut vorbereitet, hättest du natürlich jetzt den gesamten Input der Community auch gleich mitnehmen können.",
            "start": 108916,
            "end": 134430,
            "confidence": 0.7728051948051948,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Pass mal auf, wir machen diesen Podcast jetzt so zweit. Ja und zu zweit kann man sagen wir sind ein Team und die Definition Team heißt toll ein anderer macht es. Das bedeutet jeder hat hier spezifische Aufgaben und wir versuchen unseren Arbeitsauflauf weiterhin zu optimieren. So wie jede Firma gerade in der makroökonomischen Lage wird auch diese Firma, Engineering Kiosk, auf Effizienz getrimmt und somit hast du dich anscheinend sehr gut mit der Community auseinandergesetzt und ich hab mich um den ganzen anderen technischen Kram und allem drum und dran gekümmert.",
            "start": 134870,
            "end": 168851,
            "confidence": 0.7876847826086955,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also die Servereinstellungen wolltest du damit sagen. Also bist du mal der Techniker und ich mal der soziale Mensch. Ja, lass mal das mal so stehen, das passt eigentlich ganz gut. Auf jeden Fall hast du gerade gemerkt, dass ich mit unserer tollen Einleitung in das Thema auch gleichzeitig unsere Community erwähnt habe, weil es gibt ja immer noch Leute, die die Community nicht kennen und es joinen immer mehr Leute, die sagen, sie sind zwar seit einem Jahr dabei, aber sie haben noch nie was von der Community gehört. Daher jetzt die Community am Anfang der Episode in der Hoffnung, dass mehr Leute joinen und über unser Thema dann diskutieren können, auch im Nachgang.",
            "start": 168891,
            "end": 200635,
            "confidence": 0.7568521739130436,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gib uns doch mal einen kurzen Wrap-Up. Wo findet man die Community und warum sollte ich da joinen?",
            "start": 200855,
            "end": 206257,
            "confidence": 0.3954444444444445,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie immer Link in den Show Notes und warum ganz klar super interessante Leute inklusive mir, weil du hängst ja nur in den Server Settings rum und wir diskutieren über super interessante Themen.",
            "start": 206297,
            "end": 217001,
            "confidence": 0.8335454545454548,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kommt da jetzt auch nochmal ein richtiger Sales Pitch?",
            "start": 217207,
            "end": 220331,
            "confidence": 0.315,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also... Ja, ich weiß, du bist kein sozialer Mensch, aber interessante Leute, das ist für andere Leute durchaus interessant. Oder soll ich dir jetzt aufzählen, von welchen großen Firmen diese Leute sind? Würde dich das jetzt mehr reizen, dann zu joinen?",
            "start": 220431,
            "end": 232407,
            "confidence": 0.7933414634146342,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, ich denke auch, große Firmen kochen technisch auch nur mit Wasser. Ja, also zum Beispiel, ich denke knallhart, dass Facebook einfach nur mehr Wasserkocher hat als ich.",
            "start": 232907,
            "end": 240973,
            "confidence": 0.7980714285714284,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber damit du das rausbekommst, dass die auch mit Wasser kochen, kannst du die Community joinen, weil da sind auch Leute, die wirklich sehr viel Erfahrung haben, und die sagen dir dann, dass sie auch nur mit Wasser kochen.",
            "start": 241013,
            "end": 250459,
            "confidence": 0.7248749999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ah, dass die ganzen Communitymitglieder super viel Erfahrung haben, das bestreite ich gar nicht. Ich würde sagen, außer SpaceX machen sehr wenige Firmen Rocket Science im Softwarebereich, also von daher passt das schon. Nee, Spaß beiseite. Community ist natürlich für uns auf der.",
            "start": 250619,
            "end": 264834,
            "confidence": 0.6939302325581396,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Einen Seite... Moment, welcher Spaß? Wo war da jetzt Spaß? Das war alles mein purer Ernst.",
            "start": 264854,
            "end": 268516,
            "confidence": 0.6259374999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Community ist natürlich für uns auf der einen Seite ein bidirektionaler Kommunikationskanal zu euch. Das bedeutet, ihr könnt eure Stimme in unserem Podcast verwirklichen, Themenwünsche äußern etc. Aber auch wirklich ganz einfach knallharte Kritik an den Tag legen, wo wir einfach mal Blödsinn erzählt haben, weil auch wir sind nicht perfekt und ab und zu ist unser Wasserkocher auch etwas verkalkt. Weiterhin versuchen wir natürlich irgendwie auch neuen Input in dieser Community zu kriegen, aber auch vielleicht einfach mal sinnvolle Diskussionen zu führen, denn im Internet ist es ja natürlich relativ schwierig inzwischen ganz ordentliche Diskussionen zu führen. Also wo geht man in Hacker News? Da finden nur Diskussionen statt von Trendy Topics. Okay, Reddit, da wirst du ja eh immer nur verarscht und irgendwie der ganze Post wird voll Meme geklatscht. Dann gibt's vielleicht noch irgendwo ein kleines Forum, aber die sind ja auch irgendwie tot. Ich glaub beim IRC hängen immer noch ein paar Leute rum, aber da weiß man ja nicht welcher Server. Oder ist man jetzt immer noch auf Freenode? Gibt's Freenode noch?",
            "start": 269196,
            "end": 325280,
            "confidence": 0.8138876404494384,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gibt's bestimmt.",
            "start": 325300,
            "end": 326401,
            "confidence": 0.615,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also die Frage ist eigentlich, wo kann man sich eigentlich ordentlich zu technischen Themen mit sehr erfahrenen Leuten austauschen? Und da sehe ich die Engineering-Kiosk-Community ganz weit vorne.",
            "start": 327302,
            "end": 337412,
            "confidence": 0.8340357142857141,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was nicht heißt, dass jeder unbedingt erfahren sein muss. Also jede und jeder kann da gern joinen und über alles diskutieren, egal ob mit viel Erfahrung oder wenig Erfahrung.",
            "start": 337803,
            "end": 346448,
            "confidence": 0.8529655172413794,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber eigentlich trifft man sich ja auch in der Community, um ein Meeting abzuhalten, oder?",
            "start": 347108,
            "end": 351971,
            "confidence": 0.5588000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau. Wir hatten gerade kürzlich unser erstes Online-Meeting, wo man Personen dann wirklich mit Gesicht vor sich hatte. War wirklich sehr, sehr cool, die Leute auch mal zu sehen und nicht nur ihre Texte zu lesen. Das fehlt mir bei ChatGPT noch, dieses Gesicht.",
            "start": 351991,
            "end": 367530,
            "confidence": 0.8217727272727273,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie würdest du dir ChatGPT denn als Person vorstellen?",
            "start": 367550,
            "end": 371337,
            "confidence": 0.6464444444444444,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, diese Frage beantworte ich nicht. Die kann nur schief gehen.",
            "start": 371639,
            "end": 375083,
            "confidence": 0.8328333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber kommen wir mal zum heutigen Thema. Wir sprechen heute über ein super langweiliges Thema. Meetings. Warum ist das super langweilig? Weil jeder damit was zu tun hat. Keiner mag sie wirklich, aber es ist irgendwie so Teil des Jobs. Und jeder hat irgendwie so die Idee oder beziehungsweise so fünf Punkte, die bei Meetings falsch laufen. Jeder hat so die Idee, wie sie richtig laufen, aber keiner macht's. Das Lustige an Meetings, niemand kommt drum rum. Egal ob du Freelancer bist, Data Scientist, Software Engineer, Engineering Manager, CEO, Department Lead oder vielleicht einfach nur Vereinsvorstand im lokalen Kirchenverein. Da kommt wirklich niemand drum rum, denn all diese Aktivitäten, die macht man heutzutage ja nicht mehr allein, sondern nur noch im Team. Wie sagt man so schön? Möchtest du schnell gehen, gehe allein. Möchtest du weit gehen, gehe im Team. Was? Habe ich diese Floskel die Tage gelesen?",
            "start": 375123,
            "end": 423905,
            "confidence": 0.8187770270270271,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und wie machst du das jetzt so? Weil Server-Einstellungen bei Meetings gibt's ja keine.",
            "start": 424707,
            "end": 429078,
            "confidence": 0.7047857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du glaubst gar nicht, wie viel man als Google-Meet-Host so einstellen kann, das sag ich dir. Nee, im Ernst, für ordentliches Teamwork braucht man halt Alignment. Und in irgendeiner Art und Weise muss man sich da halt absprechen. Und wir leben in einer schnelllebigen Zeit. Das bedeutet, solche Entscheidungen kann man natürlich auch asynchron treffen. Jedoch werden die dann oft über Tage irgendwie gedraggt. Und somit wird immer ein Meeting einberufen.",
            "start": 429118,
            "end": 451726,
            "confidence": 0.7791830985915492,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber was ist denn jetzt das große Problem an Meetings? Und warum ist es so ein Hassthema bei ganz vielen EntwicklerInnen, dass Meetings immer so ein Problem darstellen?",
            "start": 452406,
            "end": 461152,
            "confidence": 0.8051071428571428,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich glaub, da gibt's verschiedene Hassthemen bzw. Hasskategorien, würd ich mal sagen. Auf der einen Seite sind viele Hörerinnen und Hörer, aber auch wir beide Knowledgeworker. Das bedeutet, wir brauchen oft lange Zeitblöcke, wo uns niemand unterbricht, sogenannte Fokuszeit. Softwareengineers besonders. Also, die müssen sich konzentrieren. Aber auch Produktmanager, wenn sie ein Konzept schreiben, Data Scientists, wenn die an irgendeinem Algorithmus schrauben oder, oder, oder. Man braucht halt einfach ... Zeit, wo man nicht unterbrochen wird. Und Meetings werden seltenst nur am Morgen oder nur am Abend geschedult, sondern einfach mitten im Tag. Dann ist es natürlich auch oft so, dass viele Meetings, nachdem man sie abgehalten hat, eigentlich so als sinnfrei deklariert werden. So nach dem Motto, ach, das hätte jetzt auch eine E-Mail sein können, oder aha, ich saß jetzt wieder eine dreiviertel Stunde hier vorm Videocall, habe kein Wort gesagt und habe auch nichts Neues mitgenommen. Und das ist dann so die Frage, okay, warum habe ich jetzt hier eine Dreiviertelstunde in Anführungszeichen verschwendet? Und es wird einfach diskutiert, um irgendwas, ohne irgendein Ergebnis zu haben. Also ich glaube, da gibt es halt ganz, ganz verschiedene und natürlich am Ende was ganz Persönliches. Die Meetingzeit passt mir natürlich nie in meinen Workflow. Immer falsch, immer zu meiner Lunchzeit, zu meiner Hundegehrunde, zu meinem Sportslot oder wo ich gerade im Flow bin.",
            "start": 461943,
            "end": 539043,
            "confidence": 0.7872533333333335,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was natürlich voraussetzt, dass du jetzt remote arbeitest, weil wenn du in der Firma bist, dann hast du keinen Hund und keine anderen Zeiten. Aber es konfliktet dann vielleicht mit anderen Punkten.",
            "start": 539533,
            "end": 549876,
            "confidence": 0.7953749999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du bist auch noch schön im alten Konzern, oder? In neuen, hippen Startups darf man erstmal seinen Hund mit ins Büro nehmen. Zweitens kann man da auch in solchen Telefonzellen, die Noise-Canceling haben, etc. in den Flow kommen. Wolfgang, ich weiß, Österreich mag ein bisschen hinten dran hängen, aber in Deutschland ist das halbe Silicon Valley schon angekommen.",
            "start": 549916,
            "end": 567962,
            "confidence": 0.790603448275862,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment, wenn es um Tela geht, sind wir in den Bergen wohl eindeutig Vorreiter.",
            "start": 568677,
            "end": 572542,
            "confidence": 0.8059285714285712,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn es um was geht?",
            "start": 572582,
            "end": 573464,
            "confidence": 0.6698000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Um Tela. Der Silicon Valley ist ja ein Tal.",
            "start": 573504,
            "end": 577008,
            "confidence": 0.7387777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Boah, war der flach.",
            "start": 577048,
            "end": 577749,
            "confidence": 0.60575,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und dir muss man den erklären auch noch. Aber ich hätte mal eine Frage, weil du ja wirklich, wenn ich das vergleiche, damals mit der Zeit im Office, wo wir beide miteinander gearbeitet haben, dann hast du jetzt gefühlt viel mehr Zeit. Du hast auch Zeit, solche Podcastaufnahmen zu machen. Früher, wo wir im Office waren, waren wir als Engineering Manager eigentlich beinahe durchgehend, vor allem, also wenn ich mich zurückerinnere, ich war acht Stunden durchgehend in Meetings eigentlich. Und ich kann mir erinnern, dass du nicht auch viel in Meetings warst. Hat sich das für dich geändert?",
            "start": 578462,
            "end": 609910,
            "confidence": 0.768387755102041,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, hat es in der Tat. Dennoch weiß ich nicht, ob es jetzt an dem Environment liegt, also ob ich remote oder im Office bin. Natürlich hat man im Office irgendwie so eine andere Art von Meetings. Da kann man sogar sagen, okay, lass mal eben zusammen Kaffee holen als Meeting beschreiben. Aber ich denke auch, das hat was mit Erfahrung zu tun, weil wir gegebenenfalls schon so viele Meetings haben, wissen wir jetzt genau, okay, bei welchem Meeting müsste ich denn dabei sein oder wir wissen schon im Vorhinein, ist das gut aufgebaut, ist das nicht gut aufgebaut, kann ich das absagen oder so weiter und so fort. Also dass man deutlich selektiver ist mit seiner Zeit, weil früher war das wirklich so, wo ich noch deutlich weniger Erfahrung hatte, da ging es so, oh, da hinten schreit wer, das muss ich lösen. Heute denke ich mir, nur weil du laut schreist, heißt das nicht, dass das jetzt mein Problem ist und Ich fokussiere mich einfach auf meine Agenda, beziehungsweise auf meine Strategie, beziehungsweise auf das, was ich gerade lösen möchte. Und ich denke, das alles spielt da zusammen, weswegen man heutzutage sagen kann, okay, ich habe nicht weniger Meetings, ich kriege sehr wahrscheinlich vielleicht sogar noch mehr Einladungen, doch was ich annehme und womit ich mich beschäftige, ist vielleicht ein anderer Fokus. Also vielleicht ist man einfach nur besser im Nein-Sagen geworden. Aber das ist mir wirklich aufgefallen, auch bei heutigen Meetings. Viele Meetings werden einberufen, weil es natürlich in Anführungszeichen einfacher ist, Leute zu fragen, lass mal ein Meeting machen, die wissen das. Ohne selbst vorher mal zu suchen oder aktiven Vorschlag auszuarbeiten oder oder oder. Findest du dich da selbst wieder oder würdest du sagen, ich weiß nicht, ich meine jetzt habe ich einen anderen Job, jetzt bin ich Freelancer, aber ich meine auch du hast ja Meetings mit Kunden.",
            "start": 609930,
            "end": 698593,
            "confidence": 0.7966082802547774,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also mein Gefühl ist schon, dass durch Corona eigentlich die Leute draufgekommen sind, dass es weniger Meetings benötigt und dass man viele Dinge auch asynchron abarbeiten kann. Also vor allem diese asynchrone Arbeitsweise, die hat sich etabliert. Und vor allem bei mir jetzt, wenn ich denke, früher an meine Kunden, wo ich selbstständig war, da hat man sich immer getroffen. Das war die einzige Möglichkeit. Und jetzt hast du plötzlich Online-Calls, viel wird in E-Mails ausgetauscht. Also auch so klassischere Unternehmen entwickeln sich weiter und es hat sich einfach jeder daran gewöhnt, dass Asynchron auch in irgendeiner Form funktionieren kann und es wird einfach viel mehr gelebt.",
            "start": 699277,
            "end": 734389,
            "confidence": 0.8186296296296297,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, aber Online-Calls sind ja keine asynchrone Kommunikation.",
            "start": 734449,
            "end": 736933,
            "confidence": 0.65225,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Natürlich, aber ich spreche jetzt nur von asynchroner Abarbeitung von gewissen Dingen. Also in E-Mails oder auf Slack oder Teams oder was es auch immer für eine Plattform ist. Wobei ich muss schon auch sagen, es gibt auch oft wieder dieses Problem, dass gewisse Dinge in E-Mails diskutiert werden und man könnte die viel viel schneller in einem Meeting abhandeln. Also ich habe gerade vor zwei Tagen wieder ein E-Mail bekommen von einem Entwickler, was wirklich sehr sehr lange war, mit vielen Details und Fragen und Argumentationen und eigentlich hätte das auch entweder ein E-Mail mit zwei Zeilen sein können oder ein kurzes Online-Meeting, aber nachdem er die E-Mail geschrieben hat, habe ich natürlich keine Chance zu sagen bei der ersten Frage, der ersten Anmerkung, ja ich bin deiner Meinung, machen wir das so. Also es hätte wirklich viel viel schneller sein können und Keine Ahnung, wie lange der gesessen ist an dieser E-Mail, um diese ganze Argumentation aufzubauen. Und fast Dokumentation in diesem E-Mail. Wirklich eine lange Argumentationskette. Und meine Antwort ist eigentlich nur ja. Und zwar hätte dieses Ja nach zwei Zeilen schon schreiben können. Also teilweise hat synchrone Kommunikation schon auch seine Vorteile. Also ganz asynchrone Kommunikation. Kommt wirklich auf den Fall immer drauf an. Aber ich glaube nicht alles ist automatisch asynchron besser und schneller.",
            "start": 737292,
            "end": 810913,
            "confidence": 0.8054520547945205,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das habe ich nicht gesagt. Ich habe nur gesagt, dass ich würde fast sagen, ein Großteil der Meetings besser vorbereitet sein können, gezielter ausgerichtet werden sein könnten, gecancelt werden könnten. Aber auch das besagt meines Erachtens nach, dass es auch sehr, sehr, sehr gute und wertvolle Meetings gibt.",
            "start": 811475,
            "end": 829049,
            "confidence": 0.8603541666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist denn für dich ein wertvolles Meeting? Wie würdest du denn das aufbauen?",
            "start": 829089,
            "end": 832152,
            "confidence": 0.7200714285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, meines Erachtens nach hat halt so ein Standard-Meeting oder ein gutes Meeting so ein paar Standardpunkte. Du hast eine Agenda, die wird vorherum gesendet. Die ganze Sache ist timebound, also so 30, 45, 60 Minuten. Jeder respektiert die Zeit der Teilnehmer, man fängt pünktlich an, man ist pünktlich da, man hört pünktlich auf. Jemand schreibt die Meeting-Notes mit, okay, was war der Diskussionsstrang, was war die finale Entscheidung. Es ist im Vorhinein bereits schon klar, welche Entscheidung getroffen werden muss, beziehungsweise welche Fragen beantwortet werden sollten. Es kommen klar definierte Action Points raus, wer was bis wann erledigt. Und ganz, ganz wichtig, man sollte vor Ort oder halt auch im Videocall da sein, also präsent sein und nicht am Handy, nicht am Laptop und so weiter. Ich glaube, das sind so die Standardregeln, die jeder von uns, der schon mal ein paar Meetings mitgemacht hat, kennt.",
            "start": 832652,
            "end": 882830,
            "confidence": 0.800931972789116,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und warum macht das niemand?",
            "start": 882870,
            "end": 884031,
            "confidence": 0.7790000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das ist gerade die Killerfrage und das verstehe ich einfach nicht. Auf der einen Seite verstehe ich nicht, was daran so schwer ist, auf der anderen Seite ertappe ich mich ja immer selbst.",
            "start": 884391,
            "end": 893497,
            "confidence": 0.8625882352941178,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das wäre jetzt gleich meine Frage gewesen, weil wie viel Prozent von deinen Meetings haben denn eine saubere Agenda?",
            "start": 893517,
            "end": 898080,
            "confidence": 0.6991578947368421,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Von meinen Meetings oder von den Meetings, bei denen ich teilnehme?",
            "start": 898100,
            "end": 900861,
            "confidence": 0.7275454545454544,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Beides.",
            "start": 900921,
            "end": 901522,
            "confidence": 0.703,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich versuche mich mehr und mehr und mehr an diese Punkte wirklich zu halten, aber ich ertappe mich immer wieder an diesen Standards. Also, wie viele meiner Meetings haben eine Agenda vorab? Da würde ich schon fast sagen 70 bis 75 Prozent. Das Meeting-Dokument ist bereits vorher verfügbar und da stehen auch schon die Agenda-Punkte drin und haben die Fragen, die geklärt werden müssen. Timebound. Ich entdecke mich immer und immer wieder, wie ich sage, okay, lass uns nochmal zwei, drei Minuten warten, bevor wir starten und dann kommen ja noch Leute, die trudeln dann so nach und nach ein.",
            "start": 901542,
            "end": 933049,
            "confidence": 0.8321999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich finde das vor allem online ist es extrem schrecklich, weil es immer so eine unheimliche Stille ist. Wenn es da nicht jemanden gibt, der die Flachwitze reinwirft, so wie du das immer gern machst, um irgendwie die Stille zu überbrücken, dann ist es wirklich schwierig, so durch die ersten Minuten zu kommen. Und ich glaube ja auch mittlerweile, dass Leute schon absichtlich zu spät kommen, damit sie diese Stille am Anfang überbrücken. Früher in klassischen On-Site-Meetings, Da hatte man irgendwie so eine andere Stimmung und das war nicht so schlimm am Anfang oder man hat noch irgendwas gecheckt online auf seinem Laptop. Also es war irgendwie eine andere Situation. Ich kann gar nicht genau beschreiben warum eigentlich, weil du hast ja die gleiche Situation, aber es ist irgendwie ein anderer Druck auf so ein Online-Meeting die ersten Minuten.",
            "start": 933730,
            "end": 978899,
            "confidence": 0.8274071428571429,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist halt auch ein bisschen weird, online über das Wetter zu sprechen, weil du weißt halt nicht, wo die andere Person ist, ja. Wenn du im selben Meetingraum sitzt, kannst du locker über das Wetter sprechen, weil draußen ist gerade ein Hagelsturm oder so. Also, du bist ja am gleichen Ort, ja. Ich kann ja sagen, oh, ich guck jetzt raus. Ich bin jetzt hier in Duisburg. Wow, heute ist ein bisschen bewölkt. Wie ist es denn bei dir in Innsbruck? Ja, also was ist das für eine Konversation, ich weiß ja nicht, dann kenne ich das Wetter in Innsbruck, aber es tangiert mich halt überhaupt nicht.",
            "start": 979299,
            "end": 1004244,
            "confidence": 0.662435185185185,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da sieht man wieder mal wie deutsch du bist, Wetter das einzige Smalltalk Thema, es gibt ja hunderttausend andere Themen und wenn man die Leute kennt, könnte man ja auch irgendwas fragen, wie schaut's bei dir aus bei XY oder wie geht's der Family, keine Ahnung, es gibt ja genug Möglichkeiten. Aber irgendwie für mich zumindest persönlich in einem Online-Meeting ist es ein anderer Druck und gefühlt irgendwie unangenehmer als in einem Offline-Meeting. Und vor allem, wenn du die Personen weniger kennst, ist es meiner Meinung nach in einem Meeting-Raum einfacher, was einzuwerfen und zu starten als in einem Online-Meeting-Raum. Aber es funktioniert natürlich auch. Du kannst genauso Fragen stellen und eine Einleitung machen.",
            "start": 1004264,
            "end": 1041854,
            "confidence": 0.7670614035087718,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich habe das Gefühl, in Online-Meetings muss man mehr extrovertiert sein, als wenn man im Meetingraum zusammensitzt. Ist aber nur so ein Bauchgefühl, kann ich jetzt gar nicht so begründen.",
            "start": 1042192,
            "end": 1050774,
            "confidence": 0.4504838709677419,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Habt ihr eigentlich irgendwie die Regel in der Company, dass man Meetings ohne Agenda-Notes ablehnen kann? Das ist ja so eine Policy, die man gern mal hört. In unserer Community hat ja auch jemand erwähnt, dass er als Lead das Ganze supported und den Leuten sagt, ohne Agenda könnt ihr jedes Meeting sofort ablehnen.",
            "start": 1050794,
            "end": 1068619,
            "confidence": 0.838722222222222,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Regel an sich haben wir nicht, also beziehungsweise die wurde mir nie so kommuniziert, aber ich gehe stark davon aus, dass wenn ich sie einfach durchsetzen würde und das begründen würde, dass das relativ schnell Akzeptanz finden würde. Dafür haben wir so ein paar andere Regeln und zwar auf der einen Seite hat die Firma mal ausgerufen, wir haben einen Meeting-Free-Wednesday. Also eigentlich hat niemand in der Firma am Mittwoch Meetings, was natürlich jetzt nicht ganz realistisch ist, weil besonders die Teams, die mit externen Stakeholdern wie Sales oder ähnliches arbeiten, Tja, da ist das bei denen ein bisschen anders, aber die einzelnen Teams, da ist das völlig okay, wenn man das wirklich durchsetzt. Und so haben wir das in unserem Team gemacht. Also den ganzen Mittwoch haben wir keine Meetings, noch nichtmals mehr das Stand-up. Das haben wir für den Mittwoch sogar auch gekehrt.",
            "start": 1069122,
            "end": 1112642,
            "confidence": 0.8113013698630133,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und das funktioniert bei euch soweit?",
            "start": 1112682,
            "end": 1114284,
            "confidence": 0.5036666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir haben es im Team eingeführt, also die Firma hat es eingeführt und dann ist es irgendwie ausgefaded in der Firma wieder, aber es ist immer noch da, wenn man so möchte. Und die einzelnen Teams setzen das dann um oder nicht. Und jetzt habe ich den ganzen Teammitgliedern sogar einen Ganztagesblocker reingesetzt. Und jetzt kommt es natürlich auf die Disziplin von jedem Einzelnen an, ob, wenn sie von jemandem anders ein Meeting für Mittwoch reingekriegt haben, ob sie es annehmen oder nicht. Und da kann ich dann nicht mehr helfen. Also da musst du dann auf jeden einzelnen ich sag mal vertrauen und pochen aber ich bin da zum beispiel ganz strikt am mittwoch nehme ich keine meetings an und das ist jetzt wirklich die zeit wo ich eine ganze menge code lese wo ich wirklich ich sag mal focus time habe so wie paul graham das sagte mit der makers und managers.",
            "start": 1114724,
            "end": 1160250,
            "confidence": 0.8163766233766232,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Schedule Kannst du das nochmal kurz erklären? Ist zwar schon so alt und haben wir schon öfters erwähnt, 2009, aber um was es da geht?",
            "start": 1160271,
            "end": 1167880,
            "confidence": 0.7348,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Paul Graham hat mal einen wundervollen Artikel rausgebracht, wo er wirklich den Konflikt eines Terminkalenders von einem Maker, also jemandem der etwas erstellt, wie zum Beispiel Softwareprogrammierer, und einem Manager darstellt. Und da geht es wirklich um dieses Problem, dass Maker lange Zeitbereiche von Fokuszeit benötigen und Manager eine unglaublich hohe Anzahl an Kontexts gewohnt sind. Und jetzt kommt nämlich genau dieser Konflikt. Jeder Maker arbeitet in irgendeiner Art und Weise mit einem Manager zusammen. Und oft werden diese beiden Konflikte gar nicht miteinander respektiert, wo es dann naturell zu Herausforderungen kommt. Wie zum Beispiel, warum ist etwas nicht fertig? Oh, ich hatte nie Zeit. Ich habe immer mit dir gemietet und so weiter und so fort.",
            "start": 1167920,
            "end": 1212033,
            "confidence": 0.8355982905982906,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir haben ja auch in der Sendung 68, wo wir mit Kirill über Flow gesprochen haben, gesehen, wie viele Stunden das eigentlich braucht, um so in den Flow zu kommen. Und dann kommt irgendein Manager und setzt dir da irgendwie einen Termin rein und killt deinen ganzen Flow. Und als Manager, ich kenne das selber von mir, wenn du 8 Stunden durchgehend Meetings hast, 30 Minuten Meetings, du hast natürlich Kontext-Switches alle paar Minuten fast schon. Und du bist es natürlich gewohnt, kannst in irgendeiner Form umgehen damit, ob das sinnvoll ist oder nicht, ist eine andere Frage. Aber man lernt irgendwie damit umzugehen, aber man schreibt auch keinen Code. Und wenn man selber Code schreibt, dann braucht man auch wieder diese Stunden, bis man mal im Flow ist. Und das muss man halt als Manager einfach respektieren.",
            "start": 1212053,
            "end": 1252685,
            "confidence": 0.7825942028985509,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir müssen ja auch ganz einfach akzeptieren, dass andere Jobs, andere Jobrollen ein anderes Level an Input benötigen. Software-Engineers brauchen natürlich auch sehr viel Input über Design-Entscheidungen, wie setzt man was um und so weiter und so fort. Aber dann hast du natürlich irgendwie Produkt-Manager oder Engineering-Manager, die brauchen dann hier und da mal eine schnelle Entscheidung oder eine schnelle Info wegen irgendeinem anderen Meeting oder, oder, oder. Und die sind natürlich dadurch dann verleitet, mal eben kurz das ganze Team zu interrupten. Hey, wer kann mir das denn mal ganz kurz liefern? Was natürlich dann problematisch für dieses Problemfeld des Makers-versus-Managers-Schedule ist. Aber kommen wir nochmal zurück zu diesen grundlegenden Punkten zu Meetings. Jeder kennt sie, nicht viele machen sie. Und ich glaube, das verleitet dann auch uns allen dazu, zu sagen, okay, die meisten Meetings sind Schwachsinn. Zum Beispiel Dasein bzw. Präsentsein. Ich habe das Gefühl, das ist im Remote-Setup sogar noch schlimmer geworden als im On-Site, im Office-Setup. Du sitzt im Raum und hörst wirklich aktiv zu und spielst nicht mit deinem Handy, checkst keine E-Mails am Laptop oder oder oder.",
            "start": 1252725,
            "end": 1318865,
            "confidence": 0.8172500000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sind unsere Podcast-Aufnahmen eigentlich auch Meetings?",
            "start": 1318905,
            "end": 1321948,
            "confidence": 0.8498333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe vorhin gesagt, dass ich mich immer wieder selbst dabei ertappe, doch ich verstehe es ja selbst nicht. Weil eigentlich ist das ja der größte Kardinalsfehler. Wir treffen uns jetzt hier zur Podcastaufnahme. Ich habe mein Handy jetzt hier irgendwo liegen und aus irgendwelchen Grund schweift mein Gehirn ab und ich nehme mein Handy und checke, ob ich eine WhatsApp- oder eine Signalnachricht habe. Was ja eigentlich völliger Schwachsinn ist, weil wir haben diesen Zeitblock reserviert, damit wir beide etwas zusammen erschaffen. Wir sprechen miteinander. Und das zeigt mir dann in diesem Moment, da wo ich das Handy in der Hand hatte, oh fuck, ich bin jetzt gar nicht präsent, ich bin jetzt gar nicht beim Wolfgang. Dann würde ich mich die nächste Frage stellen, okay, warum habe ich mir diesen Zeitblock überhaupt reserviert und warum gucke ich jetzt auf mein Handy? Was ist jetzt gerade so relevant, dass ich nicht bei diesem Gespräch bin? Ich habe keine Antwort dafür. Es könnte sein, dass das Gespräch nicht interessant genug ist oder mich nicht tangiert, aber das wäre ein bisschen schwierig zu sagen, weil wir treffen uns ja zu zweit. Hier sind ja keine drei Leute in dem Call aktuell. Es ist eine spannende Fragestellung für mich und ich kenne ja auch den psychologischen Effekt. Wenn wir uns zu zweit unterhalten und ich checke E-Mails nebenbei oder ich nehme mein Handy oder ähnliches, dann muss ich zugeben, kann ich mir schon sehr gut vorstellen, dass das für dich echt scheiße anfühlt.",
            "start": 1321988,
            "end": 1390566,
            "confidence": 0.7923346613545812,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber ich glaube, das ist auch auf zwei Punkte zurückzuführen, zumindest in Meetings, die du ja schon erwähnt hast. Man muss sich halt wirklich überlegen, in welches Meeting geht man wirklich rein. Und es gibt dieses Problem gerade von Managern und darüber, die nichts verpassen wollen. Und die gehen dann in Meetings, weil sie wissen, ich kann eh die halbe Zeit in meinem Chatfenster herumspielen. Und wenn was interessantes am Rande ist, dann bin ich ja im Raum, schnappe das mit auf und kann mich einmischen. Aber die restliche Zeit kann ich ja irgendwas anderes machen.",
            "start": 1391206,
            "end": 1422287,
            "confidence": 0.8352291666666662,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber warum bist du dann in diesen Meetingraum überhaupt gegangen?",
            "start": 1422608,
            "end": 1427010,
            "confidence": 0.517,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Eben, ich glaube, das ist dieses Problem von Micromanagen oder diese Angst, irgendwas zu verpassen. Weil wenn ich voll konzentriert in der Diskussion bin, dann schaue ich wahrscheinlich auch nicht auf mein Handy. Also ich glaube einfach, da muss man sich selber in die Nase fassen und auch wirklich strikter Meetings ablehnen und auch damit leben, wenn diese Personen dann was anderes entscheiden. Und ich glaube, das ist extrem schwierig, dass man auch dieses Vertrauen bekommt, weil es gibt ja auch nichts Schlimmeres. Ich habe gerade kürzlich wieder von einem Kollegen die Story gehört von einem Konzern, wo der CEO so ein Spezialist ist, der so 45 Minuten immer zu spät kommt in irgendwelchen Meetings. Und dann alles, was schon entschieden worden ist, als schlecht beurteilt, dann alles über den Haufen wirft. Und dann hast du natürlich das absolut deprimierte Team am Ende mit viel Chaos. Und es wird niemanden geben, der irgendwie sagt, okay, das Meeting war sinnvoll am Ende. Also da halte ich mich lieber raus als Manager, also aus den Meetings und versuche das im Vorfeld vielleicht in die richtige Richtung zu lenken und habe dann Vertrauen.",
            "start": 1427050,
            "end": 1487443,
            "confidence": 0.8108473684210523,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es erinnert mich irgendwie so an Crocodile Management. Auftauchen, Klapper aufreißen, abtauchen.",
            "start": 1487483,
            "end": 1491505,
            "confidence": 0.3761666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, das ist das Klassische. Und es ist natürlich auch gar nicht so leicht, weil ihr habt es gerade am Anfang, also jetzt in neuen Teams zum Beispiel, oft dieses Problem, als Manager solltest du ja dem Team den Vortritt lassen. Also die sollten sich einbringen, die sollten entscheiden und du hältst dich raus. Aber trotzdem bist du natürlich im Meeting anwesend. um vielleicht reinzuspringen oder am Ende noch deine Meinung mit reinzubringen, wenn es unbedingt nötig ist. Aber im Idealfall sitzt du ja im Meeting und sagst gar nichts. Und es war aber trotzdem wahrscheinlich sinnvoll, dass du am Anfang mit dabei warst. Und irgendwann baust du halt dieses Vertrauen auf, dass das Team es alleine kann und du absolut sinnlos bist und immer nur stumm drin sitzt oder am Schluss einmal irgendwas einwirfst und dann kannst du dich rausziehen. Und das schaut vielleicht von außen manchmal komisch aus, wenn du nur drin sitzt und nichts machst. Aber meiner Meinung nach hat es trotzdem Sinn.",
            "start": 1492123,
            "end": 1542408,
            "confidence": 0.7912650602409638,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bin ich, bin ich ganz anderer Meinung, weil du redest natürlich auch von einer sehr spezifischen Art von Meetings gerade. Du redest gerade von teaminternen Meetings, wo es um eine Designentscheidung geht oder ähnliches. Aber Meetings gibt es ja noch und nöcher in verschiedenen Arten und Formen mit Exzellenzstakeholder und über eine Produktstrategie. Ab und zu ist es einfach ganz gut, wenn der Engineering Manager zum Beispiel einfach nur was sagt und das Team damit zum Beispiel verteidigt gegenüber dem Produktmanager oder, oder, oder, ja? Also, Das, was du grad gesagt hast, kann man meines Erachtens nach nicht für die Meetings verallgemeinern.",
            "start": 1543248,
            "end": 1572471,
            "confidence": 0.7472156862745097,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gar nicht, aber du musst halt lernen, in welchen Meetings du reingehst und welche nicht und wo du dich rausziehst. Und das ist natürlich ein gewisser Prozess. Das ist ja auch oft so, dass du beim Titel vielleicht noch gar nicht genau sagen kannst, macht das Sinn oder nicht. Aber über die Zeit bekommt man ein gewisses Gefühl, von wem die Meetings sind, wer die Meetings aufsetzt, in was für einem Rahmen das stattfindet, wenn's wiederkehrende Meetings sind. Und da kann man sich halt dann irgendwann rausziehen oder jedes Mal wieder neu entscheiden. Aber man muss das natürlich auch machen, weil wenn man so einen Recurring-Termin einfach akzeptiert hat und nie darüber nachdenkt, nicht mal rauszoomt und sagt, okay, welche Meetings machen noch Sinn, dass man einfach die einmal im Monat oder jede Woche, am Beginn der Woche einmal durchgeht, was macht da Sinn, wo kann ich mich rausziehen aktiv, wo kann ich das ersetzen mit einem kurzen Pre-Meeting von fünf Minuten, um die eigene Meinung noch reinzubringen. Also da gibt es ja viele Möglichkeiten, die man nutzen kann, ohne dass man wirklich in das Meeting reingeht. Aber man muss einfach mal raussteppen und sich überlegen, bin ich noch on track und macht es überall Sinn in den Meetings, wo ich angemeldet bin, dass ich wirklich reingehe. Kann ich was beisteuern oder ist das Meeting für mich so wichtig, dass ich dort sein muss?",
            "start": 1572491,
            "end": 1642342,
            "confidence": 0.8048290598290602,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich finde unglaublich gefährlich, was du gerade gesagt hast. Du hast gesagt, du schaust sie an, wer das Meeting aufgesetzt hat und entscheidest dann, ob du hingehst oder nicht. Was du damit eigentlich implizit zwischen den Zeilen sagst, diese Person, du gibst der keine Chance, sich zu verbessern und die Standard-Meeting-Regeln anzuwenden mit Agenda und so weiter und so fort. Also, wir müssen ja mal davon ausgehen, dass Leute sich weiterentwickeln. Wir müssen davon ausgehen, du hast ein Recurring Meeting, jede Woche, nen Sync oder was, mit irgendwem, ist ja auch egal, und irgendwann stellst du fest, hör mal, pass mal auf, irgendwie bringt dieses Meeting nicht den richtigen Value. Irgendwie. Sitze ich hier eine Stunde oder 45 Minuten und kommt halt nicht voran. So, und dann entscheidest du, ah das Meeting ist wieder von der Anja oder vom Klaus. Da weiß ich schon, relativ unstrukturiert, haben wir keine Entscheidung, sach ich ab. Weil das ist das, was ich jetzt gerade hier von einer Argumentation gehört habe. Finde ich ein bisschen schwierig, weil du ja eigentlich dann unterstellst, dass diese Menschen das Problem, was du entdeckt hast, nicht entdeckt haben.",
            "start": 1642782,
            "end": 1701229,
            "confidence": 0.783994736842105,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist interessant, wie du Sachen interpretierst, weil du hast jetzt die negative Seite interpretiert. Ich habe das positiv gemeint, dass wenn gewisse Leute die Meetings im Griff haben, dass du gar nicht mehr reingehen musst. Oder wenn gewisse Leute ein Meeting aufsetzen, die POs sind, dass du da gar nicht mehr reingehen musst. Die haben das irgendwie im Griff, die brauchen dich nicht, das macht keinen Sinn. Oder es ist vielleicht eine gewisse Abteilung, die Meetings aufsetzt, wo du nichts beitragen kannst. Also es geht nicht um die Person, dass die ein Meeting schlecht macht und du gehst nicht hin, sondern eher die positive Seite. Wo kannst du dich rausziehen und wo kannst du vielleicht gar nichts contributen, weil der PO sowieso drin sitzt. Also es geht nicht um die Person an sich und um die Struktur von den Meetings, sondern eher um das Thema, was mit der Person verbunden ist. Oder dass die Person schon so weit ist, dass sie alles selber machen kann. Wenn es jetzt in dem Team ist und ein Junior zum Beispiel, irgendwann vertraust du der Person und dann ziehst du dich raus.",
            "start": 1701489,
            "end": 1758738,
            "confidence": 0.8050846560846561,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann war das jetzt gerade ein perfektes Beispiel für die vier Seiten einer Nachricht, Kommunikationstheorie und Co.",
            "start": 1758758,
            "end": 1762965,
            "confidence": 0.6415294117647059,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, es geht natürlich in die andere Richtung auch, kannst du das genau so interpretieren, ganz klar. Aber war in dem Fall nicht so gemeint, könnte aber natürlich auch passieren und ist gefährlich, da gebe ich dir vollkommen recht. Aber dazu kann man ja auch Feedback geben oder aktiv reingrätschen. Man kann ja auch sagen, hey, ich schreibe heute die Meeting-Notes. Oder ich schreibe mal mit und sende das einfach an alle danach, weil es davor nie Meeting-Notes gegeben hat. Man braucht ja nicht dem Organisator das immer in die Schuhe schieben. Einfach mal machen und rumschicken. Man kann ja mit gutem Beispiel verantworten.",
            "start": 1764129,
            "end": 1791896,
            "confidence": 0.7584903846153845,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du sagst das gerade so super einfach.",
            "start": 1791916,
            "end": 1793136,
            "confidence": 0.38757142857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, Meetingsnotes ist jetzt nicht so schwierig zu schreiben, oder?",
            "start": 1793816,
            "end": 1797160,
            "confidence": 0.7667999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ne, ne, ne, ne, ne, ne. Man kann ja auch Feedback geben. Offengesprochen. Pack dich jetzt mal wirklich hier selbst an, so nach dem Motto. Wie oft hast du Leuten Feedback gegeben, dass das Meeting echt nicht gut war und Co. Und wie oft haben die sich danach wirklich gedreht? Also du musst dazugeben, du brauchst schon sehr viel Mut und Selbstbewusstsein und allem drum und dran, um das wirklich zu tun. Obwohl du es natürlich eigentlich nur gut meinst. Aber es ist auch echt eine schwierige Situation.",
            "start": 1797200,
            "end": 1823942,
            "confidence": 0.7956136363636364,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also meinem eigenen Team, den Leuten in den Teams, habe ich immer Feedback gegeben. Vor allem positives Feedback ist auch ganz wichtig. Wenn mir ein Meeting gut gefallen hat, wenn es gut organisiert war. Aber auch, wenn ich irgendwelche Sachen gesehen habe, die man vielleicht besser machen kann. dann einfach vorschlagen. Ist natürlich im eigenen Team viel viel leichter, vor allem wenn du der Manager bist. Aber auch externen Leuten kannst du ja vorschlagen, hey beim nächsten Meeting könnten wir nicht das und das dazunehmen. Du brauchst nicht sagen, das war scheiße und das sollten wir anders machen. sondern du kannst dir sagen okay könnten wir einen anderen aspekt reinbringen könnten wir das nächste mal die struktur nehmen du musst ja nicht sagen dass die struktur schlecht war sondern einfach was vorschlagen und das ist meiner meinung nach schon möglich oder eben aktiv rein gehen und gewisse sachen selbst machen.",
            "start": 1823962,
            "end": 1869404,
            "confidence": 0.770493333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich bei Trivago angefangen habe so 2013, Wurde mir im ersten Jahr mehr und weniger eine Regel beigebracht. Und zwar hieß sie wie folgt. Du kannst jedes Meeting absagen, sofern du mit dem Ausgang bzw. mit den Entscheidungen leben kannst. Finde ich eine super Regel, weil es gibt nichts Schlimmeres. Du sagst ein Meeting ab und sagst, ah, der Outcome war aber blöd. Lass uns nochmal mieten.",
            "start": 1869564,
            "end": 1889628,
            "confidence": 0.7416617647058824,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, da sind wir wieder beim Krokodilmanagement.",
            "start": 1890149,
            "end": 1891811,
            "confidence": 0.7000000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oh ja, aber du kannst ja auch sagen, okay, ich war gerade verhindert, aber der Punkt ist ganz einfach. Sag halt, wenn du ein Meeting absagst, dann entscheidest du dich ja aktiv dafür. Und wenn du dann mit dem Outcome nicht leben kannst, dann hättest du besser teilnehmen können. Ich weiß nicht, ob die Regel immer noch gelebt wird, aber die fand ich immer wieder super. Die geht auch wirklich in die Richtung von Law of Two Feet. Und die Law of Two Feet besagt eigentlich, Wenn ich nichts zu dem Meeting kontributen kann oder nichts von dem Meeting lerne, gehe einfach raus. Klingt total komisch und klingt respektlos, aber ich finde, das ist einfach nur eine Regel, sofern sie denn offen kommuniziert wurde, die einfach Sinn macht.",
            "start": 1892210,
            "end": 1928757,
            "confidence": 0.7840078125000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie oft hast du das erlebt?",
            "start": 1928797,
            "end": 1929918,
            "confidence": 0.68,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dass jemand das gemacht hat? In meiner Karriere noch nicht so oft.",
            "start": 1929958,
            "end": 1933280,
            "confidence": 0.8612500000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Heißt nicht so oft nie, oder?",
            "start": 1933300,
            "end": 1935121,
            "confidence": 0.8220000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, nee, nee. In der neuen Firma habe ich das schon so zwei, drei Mal erlebt. Aber ich gebe auch zu, die Regel wurde in den vorherigen Firmen, in denen ich gearbeitet habe, noch nie so wirklich propagiert, beziehungsweise an die Menschen herangetragen.",
            "start": 1935241,
            "end": 1947587,
            "confidence": 0.6456046511627908,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also das ist, ich finde, das ist auch so eine Regel, die man gern propagiert, aber die extrem schwierig ist umzusetzen. Und da finde ich Feedback geben noch zehnmal leichter, als wirklich aus einem Meeting rauszugehen. Wenn es natürlich jetzt ein absolut technisches Meeting ist und man sagt, okay, ich glaube, ich kann da jetzt nicht mehr irgendwas dazu beitragen auf der technischen Seite oder wenn du von einem fremden Team bist und das besprochen wurde, dann ist es, glaube ich, einfacher rauszugehen. Aber jetzt in einem klassischen Meeting einfach zu sagen, das bringt mir nichts und rauszugehen, ist schon sehr, sehr schwierig. Und ich hatte den Fall einmal. Wir hatten ein Team-Meeting und haben interner besprochen, also wo es auch vor allem um mich als Manager gegangen ist, wo ich mich verbessern kann. Und dann ist eine Person aus dem Team einfach rausgegangen und hat gesagt, das bringt mir absolut nichts. Und er ist nicht einverstanden mit diesem Meeting und ist rausgegangen. Und die Person hört jetzt vielleicht auch zu. Und es war damals für mich eine extrem schräge Situation. Ich habe mich da fast persönlich angegriffen gefühlt natürlich. Aber im Endeffekt habe ich mir im Nachhinein auch überlegt, okay, wenn er das für nicht sinnvoll empfindet, ist das eigentlich das Sinnvollste, rauszugehen. Aber es war natürlich schon eine extrem eigenartige Stimmung, muss man auch dazu sagen, auch gegenüber den anderen und weil es um eine Teamsache auch gegangen ist. Also es ist nicht so leicht, das durchzusetzen und auch zu leben und einfach rauszugehen. Das ist mir sonst noch nie passiert, muss ich sagen.",
            "start": 1947627,
            "end": 2022761,
            "confidence": 0.7580714285714288,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, wenn das nicht offen kommuniziert wird, ist das wirklich, glaube ich, vielleicht einfach respektlos. Verstehe ich, ja. Aber ich glaube, das ist auch abhängig von der jeweiligen Kultur. Besonders wenn du in internationalen Firmen arbeitest, ist das, glaube ich, so eine andere.",
            "start": 2022958,
            "end": 2033115,
            "confidence": 0.7796136363636363,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Geschichte, weil... Du meinst, die Deutschen gehen einfach raus, denen ist das scheißegal? Oder was meinst du?",
            "start": 2033155,
            "end": 2037642,
            "confidence": 0.5588823529411764,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, ich denke einfach eher, dass viele Leute sagen dann, okay, dann ist es respektlos. Aber ich glaube, es ist eine andere Grundlage, wenn das wirklich in der Firma propagiert wird. Genauso wie, dass du Meetings einfach absagen kannst und sagst, okay, ich lebe einfach mit der Entscheidung. Genauso wie dieses Law of Two Feet. Wenn das offen kommuniziert wird, dann ist das eine ganz andere Baustelle, als wenn man das einfach so macht, weil man hat das mal auf Wikipedia gelesen. Das ist die erste Baustelle. Die zweite Baustelle, wo ist denn eigentlich der Unterschied, wenn ich einfach aus dem Meeting rausgehe, Versus, ich bin in dem Meeting da und mach die ganze Zeit was anderes und wenn ich angesprochen werde, dann sag ich, oh bitte, ich hab grad nicht aufgepasst, kannst du es nochmal wiederholen? Also wo ist der Unterschied?",
            "start": 2037938,
            "end": 2075641,
            "confidence": 0.7293239436619718,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber es wird irgendwie als unhöflich wahrgenommen. Und wie gesagt, es ist mir selber damals auch so gegangen. Ich habe auch diese Regel eigentlich immer gesagt, okay, wenn was sinnlos ist, geht raus oder cancel dein Meeting. Aber es ist einfach schwierig, das dann in der Realität zu machen. Vielleicht ist es eine Kultursache, aber wenn man jetzt schon sagt, die Deutschen sind immer so direkt und da ist es schon ein Kulturproblem.",
            "start": 2076280,
            "end": 2098308,
            "confidence": 0.8111780821917808,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, also oft weiß man ja auch gar nicht, okay, ich geh ins Meeting, hab gute Hoffnungen oder gute Assumptions und merke in dem Meeting, okay, irgendwie wird das hier nix, das geht in eine ganz andere Richtung oder wir sprechen gar nicht über die technischen Details oder oder oder, ja? Also, dass man während des Meetings, also während der Runtime sozusagen, feststellt, okay, ich bin hier nicht von Nutzen, ich kann jetzt einfach rausgehen. Das wird ja dann dein Argument in Bezug auf, oder man nimmt am Anfang nicht teil, obsolet machen. Also wo ist jetzt hier der Unterschied zwischen Law of Two Feet, ich gehe einfach raus, versus, oh, ich beschäftige mich einfach, ich sitze hier in diesem Meeting und beschäftige mich einfach mit ganz was anderem. Da finde ich diese Law of Two Feet einfach nur konsequenter.",
            "start": 2098848,
            "end": 2136909,
            "confidence": 0.7501785714285718,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, es ist vielleicht auch meiner Meinung nach ein bisschen unhöflich einfach aufzustehen. Vielleicht kann man das auch ein bisschen netter machen, dass man einfach sagt, okay, ist ein super Meeting, passt alles, aber ich kann einfach jetzt nichts mehr dazu beitragen und geht dann oder so irgendwie. Also, dass man das vielleicht auch irgendwie sinnvoll verpackt und auch das Feedback gibt, weil wenn du natürlich einfach gehst oder sagst, ich kann jetzt nichts mehr beitragen, Oder das in irgendeinem Ton wie dieses Meeting hilft mir jetzt nichts mehr und du gehst raus, dann ist es natürlich schon ein Schlag ins Gesicht. Also man muss das glaube ich entweder im Vorhinein sauber kommunizieren, es muss wahnsinnig etabliert sein in der Firma oder du musst es halt sinnvoll verpacken, dass du sagst okay sinnvolles Meeting, aber ich kann jetzt nichts mehr dazu beitragen, darum gehe ich.",
            "start": 2137485,
            "end": 2177727,
            "confidence": 0.773855172413793,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ein bisschen menschlich sollte man schon sein. Einfach rausgehen und dann ohne irgendwas zu sagen in Bezug auf, hey, ich mache jetzt hier die Law of Two Feet oder was weiß der Geil nicht. Also man muss den Leuten schon irgendwie kurz sagen, ich bin jetzt raus, ihr müsst nicht auf mich warten, ihr könnt einfach weitermachen. Weil besonders im Remote-Business, jemand hat vielleicht ein Internet-Connection-Issue oder der Browser stürzt ab oder oder oder. Also man muss den Leuten schon irgendwie sagen, hey, ich bin jetzt hier raus, macht einfach weiter, wartet nicht auf mich.",
            "start": 2178280,
            "end": 2207157,
            "confidence": 0.7376041666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, remote ist es noch einfacher, da kann man das schreiben. Aber es ist, glaube ich, das Grundproblem ist ja, wenn du rausgehst, dann gibst du ja den anderen das Gefühl, dass deren Meeting keinen Sinn macht. Und wenn die anderen gerade glauben, sie haben ein produktives Meeting und du bekommst da dann so ein Feedback, hey, das ist absolut scheiße und sinnlos, ich gehe raus, dann kann das natürlich auch sogar das Meeting in irgendeiner Form extrem stören. Also ich glaube, man muss das wirklich gut kommunizieren und auch klar sagen, was der Grund ist. Und wenn es darum geht, dass die Struktur schlecht war von dem Meeting oder das Meeting schlecht gemacht war, finde ich es eigentlich eher besser, wenn man dann im Nachhinein sinnvolles Feedback gibt und wirklich mit der Person redet.",
            "start": 2207317,
            "end": 2247352,
            "confidence": 0.779985185185185,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das sehe ich anders, weil das Meeting, die Struktur kann perfekt sein, nur das Thema kann vielleicht zwei oder drei deutlich sein.",
            "start": 2247472,
            "end": 2253176,
            "confidence": 0.48768181818181805,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ja, aber dann kann man das ja dementsprechend kommunizieren. Das meine ich ja damit, aber wenn es um die Struktur geht, würde ich nicht einfach rausgehen und sagen, das Meeting war schlecht strukturiert, sondern halt wirklich im Nachgang dann Feedback geben, anstatt das Feedback zu geben, indem man das Meeting verlässt, sondern wirklich im Nachgang sinnvoll.",
            "start": 2253276,
            "end": 2269627,
            "confidence": 0.8048947368421049,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, da gehe ich jetzt einfach mal. Ganz einfach von aus, dass wir hier keine Arschlöcher sind, sondern den Leuten einfach nur kurz Bescheid geben und kurz sagen, was Ambach ist. Also nach dem Motto, ich bin jetzt hier raus, das Thema, ich habe das falsch verstanden oder ähnliches.",
            "start": 2269727,
            "end": 2282753,
            "confidence": 0.6176530612244897,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, aber du kennst ja Kommunikation. Es kann ja sehr schnell in die falsche Richtung laufen, obwohl du persönlich gar nicht das Gefühl hättest oder das gut gemeint hast. Aber es natürlich bei der anderen Person ganz anders ankommt. Also man muss gerade bei so einem Ding, glaube ich, extrem feinfühlig sein und es sinnvoll machen.",
            "start": 2282773,
            "end": 2296720,
            "confidence": 0.7330714285714285,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, schon klar, aber was ist die Alternative? Die Alternative ist da, wo wir jetzt sind. Wir haben alle ganz viele Meetings, die einem nicht bringen, man sitzt da, verschwendet Zeit, blabliblub, und am Ende sagt man, ich hab zu viele Meetings. Also, irgendwas muss man ja tun. Bei Trivago gab's mal ne Zeit lang, da gab's so ne Art Testphase, obwohl Testphase möchte ich das gar nicht nennen, Experiment. Und zwar hieß das No-Tag-Meetings. Und da wurde ne ganze Zeit lang in super viele Meetings geschrieben, ob man jetzt hier den Laptop braucht oder nicht, weil das Grundproblem war, war das, was wir gerade schon beschrieben hatten, Leute waren irgendwie nicht präsent. Leute saßen am Laptop, haben E-Mails gecheckt und so weiter und so fort oder am Handy. Und dann wurde halt einfach eingeführt, okay, das hier ist ein No-Tag-Meeting, ihr braucht kein Handy und ihr braucht auch kein Laptop, lasst das bitte woanders, um dieses Dasein wirklich zu fördern.",
            "start": 2296780,
            "end": 2345580,
            "confidence": 0.7779813664596273,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, das ist auch ein ganz konkretes Problem, was ich heute immer noch habe, dass ich persönlich fast ein schlechtes Gefühl habe, aber auch das vielleicht bei anderen immer so wahrgenommen habe, wenn jemand am Laptop oder am Handy mitschreibt, dass man nie genau weiß, macht er jetzt nur Notes, surft er irgendwo im Internet, beantwortet er gerade eine E-Mail, Und das dann immer sehr schnell respektlos rüberkommt. Egal ob die Person vielleicht gerade was Sinnvolles googelt, kann ja auch zum Meeting sein oder Meeting-Notes schreibt oder eben was ganz was anderes macht. Darum ich persönlich gerade jetzt in Kundenmeetings und so weiter probiere eher auf der klassischen Block und Kulli Fraktion zu sitzen und in die Richtung zu gehen und das danach zu übertragen ist sogar ganz gut, weil dann kann man die eigenen Notes nochmal durchgehen. klarer strukturieren also die dokumentation wird wesentlich besser aber braucht natürlich viel viel mehr zeit und manchmal ist es auch einfach einfacher wenn man extrem viel bespricht dass es am laptop gemacht wird wie gehst.",
            "start": 2346300,
            "end": 2401118,
            "confidence": 0.8263160919540233,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du damit um also das was du gesagt hast setzt ja voraus dass du deine eigene handschrift lesen kannst ist bei mir es nicht immer gegeben, deswegen. Nee, wie geh ich damit um? Also auf der einen Seite assume ich immer nur Gutes von den Leuten und ich habe das selbst schon gemerkt, dass wenn ich der Meeting-Notes-Schreiber bin, dann muss ich mich einfach hart konzentrieren und muss wirklich zuhören. Da kann ich nicht mal eben zwischenzeitlich surfen, weil dann versaue ich meine Meeting-Notes, beziehungsweise dann seht ihr nicht vollständig oder oder oder. Also das, was du da beschreibst, ja, ich versteh, was du meinst, Und das.",
            "start": 2401158,
            "end": 2433196,
            "confidence": 0.7546074766355141,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Haben wir ja alle schon erlebt, wenn wir in einem One-on-One sitzen und das Gegenüber irgendwo am Laptop in einer anderen Sphäre ist. Wobei man auch dazusagen muss, man merkt es teilweise schon, ob die Leute beim Meeting dabei sind oder ob die wirklich was anderes machen, ohne dass man vielleicht genau sieht, was die jetzt machen. Auch bei Online-Meetings hat man ja oft so das Gefühl, ob jemand dabei ist oder nicht, auch wie schnell jemand reagiert und in der Diskussion ist. Also man kann das schon rausfinden, aber es ist halt nicht immer möglich. Und da bin ich so ein bisschen gespalten, in welche Richtung man gehen sollte, weil ganz klassisch Papier und Stift hat einfach Nachteile, aber auch Vorteile.",
            "start": 2433216,
            "end": 2469033,
            "confidence": 0.7980000000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bei One-on-ones ist ein gutes Thema, was du angesprochen hast, weil ich bin der Meinung, es ist unglaublich wichtig, One-on-ones zu dokumentieren. Einfach nur, damit wir beide dasselbe Verständnis von dem haben, was wir besprochen haben. Und da sage ich auch oft jetzt in dem Remote-Setup zum Beispiel, hey, warte mal, ich schreibe das eben nieder. Genauso wie bei Interviews. Wenn ich Recruiting mache, dann gebe ich am Anfang immer kurz so eine Einleitung, was jetzt die nächste Stunde passiert und so weiter und so fort. Check einmal, ob das okay mit dem Kandidaten oder mit der Kandidatin ist. Und dann sage ich auch, hey, pass mal auf, ich chatte jetzt hier nicht ins Slack, ich mache mir nur zwischenzeitlich ein paar Notizen, du siehst mich also tippen. Also ich bin da sehr, sehr, sehr explizit und das hat immer geholfen bisher. Ich habe so das Gefühl, bei Remote ist diese ganze Sache sogar noch schlimmer geworden, weil bei Remote musst du ja am Laptop sitzen, um dabei zu sein.",
            "start": 2469053,
            "end": 2514316,
            "confidence": 0.7529,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und du siehst Notifications sofort. Also du bekommst ja immer reingebobbt, wenn du sie zumindest aktiviert hast. Das heißt, du bist viel schneller abgelenkt.",
            "start": 2515076,
            "end": 2524443,
            "confidence": 0.7565000000000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Viel schlimmer, dass man die Notification sieht, ab und zu hört man diese auch im Meeting. Und dann merkst du auch, wie die Augen dann sofort weggehen. Ja, da krieg ich immer eine Rappe.",
            "start": 2524463,
            "end": 2537492,
            "confidence": 0.7607941176470587,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt siehst du das, wie es mir immer geht bei unseren Aufnahmen, wenn deine Augen dann zum Handy wandern.",
            "start": 2537512,
            "end": 2542336,
            "confidence": 0.7674736842105262,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich sage ja, ich bin ja selbst Teil des Problems und ich finde es halt einfach nur faszinierend und es ist auch wirklich menschliche Disziplin und ich versuche es ja immer und immer und immer wieder zu machen, nur man muss auch mal sich ganz ehrlich eingestehen, ein gutes, effizientes Meeting zu leiten ist einfach super hart. Es bedarf ordentlicher Vorbereitung. Ordentliche Kommunikation während des Meetings, aber auch, und jetzt was ganz wichtiges, super guten Input und Engagement von den Teilnehmern, aber auch Vorbereitung von den Teilnehmern. Also ein effizientes Meeting liegt nicht an dir alleine als Meetingorganisator. Und das finde ich das Schwierige. Du kannst, es wird Engagement erwartet, es wird Teilnahme erwartet, weil du hast ja eine Gruppe von Leuten eingerufen, um etwas zu diskutieren, um etwas zu entscheiden. Und wenn die Leute nicht engaged sind, dann bringt es ja alles nichts.",
            "start": 2543378,
            "end": 2595770,
            "confidence": 0.8599305555555554,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber man muss schon sagen, dass man das in gewisser Weise vergleichen kann mit einem Talk. Wenn du einen Talk gibst auf einer Bühne und die Leute schlafen weg, dann ist es nicht die Schuld der Leute, sondern von dir. Das heißt, du musst einfach gut vorbereitet sein, du musst die Leute in irgendeiner Form mitnehmen. Natürlich kannst du auch Mitarbeit erwarten und vielleicht auch zum Beispiel mit einer guten Agenda und einem guten Setting schon im Vorfeld triggern, aber du bist halt noch immer der Leiter von diesem Meeting und du musst die Leute mitnehmen.",
            "start": 2595870,
            "end": 2624472,
            "confidence": 0.8071354166666668,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ja, schon gut. Du sprichst jetzt gerade von dem Fall, dass wir im Meeting sind. Ich spreche, es fängt ja schon viel früher an. Jetzt stell dir mal vor, du bereitest alles vor, hast ne Agenda und hast irgendwie Material, was Leute sich vorher reinziehen müssen, was sie lesen müssen und Co. Und jetzt kommst du in den Meeting an und stellst fest, obwohl du drum gebeten hast im Invite, den super viele Leute einfach wirklich nicht lesen, ist jeder auf derselben Seite, weiß jeder, worüber wir sprechen. Und dann sagen die, oh, kannst du das Problem mal zusammenfassen. Da frage ich mich immer, wieso haben wir denn jetzt hier alles zusammengeschrieben und wieso fange ich jetzt wieder von vorne an und jeden auf den Kontext zu bringen. Und das ist, das finde ich so das Faszinierende, dass ein gutes Meeting nicht nur vom Meetingorganisator abhängt. Und ich meine, vielleicht ist das der Grund, was ich nicht weiß, aber du hast vielleicht auch schon mal gehört, dass Amazon am Anfang des Meetings so eine gesamte Reading Time eingeführt hat. Alle setzen sich in dem Meeting hin und lesen das Dokument. Auf der einen Seite finde ich es cool, weil das bedeutet, okay, du kannst 100% sicher sein, dass jeder die gleichen Informationen hat und dann kann die Diskussion oder Entscheidung oder was auch immer starten. Auf der anderen Seite denke ich mir, okay, das ist irgendwie so eine Art, ja, vielleicht Workaround für die fehlende Disziplin, für die fehlende Organisation, für die fehlende Selbstorganisation der Meetingteilnehmer.",
            "start": 2624972,
            "end": 2698042,
            "confidence": 0.7579610894941632,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich sehe das eigentlich schon so wie bei einem Talk. Meiner Meinung nach ist die Einleitung wichtig. Du musst die Leute mitnehmen. Du kannst da auch nochmal deine Meinung mit reinpacken, weil das ist was anderes, ob man was liest oder vielleicht dann nochmal erklärt. Also sogar wenn alle ein Dokument gelesen haben, ist meiner Meinung nach wichtig, eine sinnvolle Einleitung zu machen, um die Leute einfach mitzunehmen. Du kannst nicht sofort in ein Thema einsteigen am Anfang. Es braucht einfach diese Phase, um warm zu werden. Also ich würde das eigentlich immer machen. Und ich glaube, dass genau wie bei einem Talk das Gelingen an der Einleitung hängt. Und genauso bei einem Meeting. Ohne sinnvolle Einleitung kann das kein gutes Meeting werden oder kein guter Talk. Aber das ist vielleicht nur meine Meinung. Denkst du jetzt gerade nach oder liest.",
            "start": 2698342,
            "end": 2742963,
            "confidence": 0.7854788732394365,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du gerade eine andere Message? Ich schaue gerade hier in den Meeting-Notes, in den Podcast-Notes. Ein anderes Thema ist natürlich auch, dass viele Leute sich beschweren, ich habe zu viele Meetings. Und da stelle ich mir die Frage, was ist immer zu viel? Klar, kommt natürlich irgendwie auf deinen Job an und so weiter. Wenn du halt Projektmanager bist, dann ist das vielleicht einfach nur dein Job. Und jetzt steigen mir, glaube ich, alle Projektmanager aufs Dach, die dann sehr wahrscheinlich ordentliches Projektmanagement machen. Hey, mein Job ist nicht Meetings. Aber da möchte ich eine kurze Story erzählen. Und zwar haben wir in der Firma so eine Art Slackbot, nennt sich Status Hero. Jeden Morgen pingt er dich, dann sollst du ein Check-In machen. Und was er dich eigentlich fragt, ist eigentlich ein Stand-Up-Bot, wenn du so möchtest. Ja, der fragt, okay, was hast du? gestern gemacht hast du deine gestrigen ziele erreicht und dann wird das was du gestern eingetragen hast schon schon vorausgefüllt und was nimmst du dir heute vor und wie fühlst du dich ja so stress.",
            "start": 2742983,
            "end": 2795198,
            "confidence": 0.6968277777777779,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das klingt ja nach purer überwachung hast du deine ziele erreicht ja nein welche ziele nicht wird gleich in der performance review eingearbeitet Das hat nichts mit Überwachung.",
            "start": 2795218,
            "end": 2804830,
            "confidence": 0.6814285714285715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zu tun, das ist eigentlich nur ein asynchrones Stand-up in einer Remote-Firma. Weil du kannst dich halt, wenn du in verschiedenen Zeitzonen arbeitest, kannst du dich halt nicht immer treffen. Ist halt einfach so. Und dann hast du deine eigenen Ziele erreicht, weißt du ja selbst, ich meine, du machst Produktivität, getting things done. Also ist eigentlich nichts anderes. Hast du gestern alle deine Tasks, die du dir vorgenommen hast, abgehakt. Also sehe ich jetzt nicht so, ich sehe es einfach nur als so eine Art Journaling oder ähnliches. Alles super.",
            "start": 2804870,
            "end": 2828843,
            "confidence": 0.6870439560439562,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie zufrieden bist du mit Stand-Ups? In dieser Form?",
            "start": 2829203,
            "end": 2831844,
            "confidence": 0.6155555555555555,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kommen wir gleich zu. Das ist nicht die Story. Die Story ist wie folgt. Und zwar ist dieser Slack-Bot dann auch zu meinem Kalender und zu GitHub connected. Ja? Und zu Jira. Das bedeutet, ich sehe dann, also da.",
            "start": 2831864,
            "end": 2842228,
            "confidence": 0.7964871794871795,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wird dann auch... Ich sage ja, Überwachung pur.",
            "start": 2842268,
            "end": 2845069,
            "confidence": 0.5433749999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ne, es ist ja keine Überwachung. Es ist ja Arbeitserleichterung. Warum soll ich da hinschreiben, welche Meetings ich habe? Oder der kann die Informationen automatisch aus meinem öffentlichen Kalender ziehen? Ja, also ich sehe das als Produktivität und nicht als Überwachung. Wie dem auch sei. Ab und zu siehst du dann bei manchen anderen Leuten, an einem Tag haben die 10 1,5 Stunden geschedulte Meetings. Also innerhalb eines 8-Stunden-Tages. Meist dann Conflicting-Meetings oder ähnliches. Also Meetings, die überlappen. Also ich würde das schon als Definition von das sind zu viele Meetings beschreiben.",
            "start": 2845089,
            "end": 2873896,
            "confidence": 0.705608695652174,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder zu viele Aufgaben.",
            "start": 2873916,
            "end": 2874857,
            "confidence": 0.92475,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das eine ist dann sehr wahrscheinlich das Resultat von dem anderen. Aber im Endeffekt sind es zu viele Meetings, weil du dich an deinen 8 Stunden halt mit 10 1,5 Stunden overcommittest. Und natürlich ist die einfache Aufgabe jetzt, okay, man muss Nein sagen oder man muss vielleicht irgendwie ein paar Sachen als Asynchron handhaben oder ähnliches, aber auf der anderen Seite denke ich mir, hm, ich bin ein Fan von asynchroner Arbeit, aber es hat ja auch Nachteile, ne? Also auf der einen Seite ist es natürlich einfacher, sich zu mieten, darüber zu sprechen, auf der anderen Seite Also ich.",
            "start": 2874997,
            "end": 2902915,
            "confidence": 0.7364901960784317,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Glaube, es ist vor allem einfacher zu sagen, machen wir einfach mal ein Meeting, anstatt darüber nachzudenken, ob man das asynchron machen kann, ob man da vielleicht ein Dokument schreiben könnte, ein Dokument schreibt, sondern man sagt einfach, lass uns mal treffen. Das ist so die Standard-Vorgehensweise und ich glaube, das ist das Problem, also dass man einfach schnell mal ein Meeting aufsetzt, ohne darüber nachzudenken.",
            "start": 2902935,
            "end": 2923464,
            "confidence": 0.7941515151515153,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist richtig, aber du weißt ja auch, ich bin ein Mega-Fan von Schreiben, weil ich denke einfach, okay, wenn man was aufschreibt, dann denkt man über die Message 35 mal mehr nach und somit wird sie einfach besser strukturiert und man kriegt klarere Gedanken. Also das finde ich schon, ist ein enormer Vorteil. Plus, man hat automatisch so eine Art, so ein Decision-Trail, so ein Audit-Log. Man hat ja bereits alles kommuniziert und dokumentiert. Und das kann man ja dann ganz einfach locker auch als E-Mail versenden. Und vielleicht umgeht man da natürlich auch dieses Statement, das Meeting hätte auch eine E-Mail sein können. Auf der Down-Zeit wiederum ist es natürlich dann in irgendeiner Art und Weise so, dass es wieder auf die Selbstdisziplin von den Meeting-Teilnehmern kommt. Weil asynchrone Entscheidungen können ganz einfach länger dauern. Und du willst ja, du sitzt ja nicht vor deinem Word-Dokument und siehst jemand tippt da rein und dann sitzt du und schaust ihm beim Tippen zu und dann wenn der fertig ist, dann wartest du eine Minute, um zu sicher zu gehen, dass der wirklich fertig ist und dann addest du das, weil das ist ja auch schon wieder irgendeine Art synchrone Arbeit. Also, ja, was ist eigentlich super, was sind zu viele Meetings? Schwierig. Und ich denke einfach, wir müssen alle besser werden im Nein-Sagen.",
            "start": 2923784,
            "end": 2987258,
            "confidence": 0.7698839285714287,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und ich glaube, es braucht auch einfach Meetings. Also, ich hatte mal ein Team, das sich auch extrem beschwert hat über die vielen Scrum-Meetings und wollte daher zu Kanban umsteigen. Und ich hab dann gemeint, ja, okay, dann steigt auf Kanban um, kein Problem. Und nachdem sie auf Kanban umgestiegen waren, haben sie gesagt, okay, die Leute in unserem Team wissen nicht mehr, an was die andere Person arbeitet, die Projekte laufen so chaotisch, es ist irgendwie nicht mehr aligned, wie man vorgeht in den Projekten. Und am Ende haben wir dann, um das wieder zu kompensieren, Meetings eingeführt. Dann hat es halt Projektstart-Meeting geheißen und so weiter. Und am Ende hatten wir eigentlich wieder gleich viele Meetings in dem Team wie davor mit Scrum. Es hatte zwar jetzt den Namen Kanban und ein paar andere zusätzliche Meetings, Projekt-Init-Meetings, aber am Ende war es genau das gleiche. Also du brauchst Meetings, um ein gewisses Alignment zu haben. Vielleicht kann man manche Sachen asynchron machen, aber du brauchst dieses Alignment. Und es ist halt leicht gesagt, es gibt zu viele Meetings, weil die stören und man ist da nicht produktiv, offensichtlich. Aber im Hintergrund kann das sehr sehr wichtig sein. Und auch wenn man oft sagt, dieses Meeting hätte ein E-Mail sein können. Wir haben da jetzt nur was entschieden, was ganz logisch war. Oft ist der Weg das Ziel, weil du hast diese Diskussion in dem Meeting benötigt, um auf diese simple Entscheidung am Ende zu kommen, aber dass jeder zustimmt. Und dann war das vielleicht trotzdem nicht vergeudete Zeit, obwohl der Outcome super einfach ist und vielleicht im Vorhinein eh schon jeder gewusst hat, das wird der Outcome sein. Aber man hat trotzdem dieses Meeting benötigt, um die soziale Interaktion zu haben und die Diskussion zu haben.",
            "start": 2987738,
            "end": 3080385,
            "confidence": 0.8136677852348995,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, da stimme ich dir auf der einen Seite zu, also besonders jetzt gerade im Remote-Setup sind zum Beispiel die Stand-Ups gegebenenfalls gar keine klassischen Stand-Up-Meetings mehr für uns, sondern wir haben sie nicht abgeschafft, um einfach eine soziale Interaktion zu haben und irgendeine Art Team-Bonding zu schaffen, weil im Remote ist es halt was anderes, du gehst halt nicht zusammen Mittagessen, du triffst dich halt nicht an der Kaffeemaschine. Aber wir machen die Stand-Ups nicht mehr so regulär, wie sie im agilen Bereich gemacht werden. Was hast du gestern gemacht? Was machst du heute? Was blockt dich?",
            "start": 3080965,
            "end": 3111295,
            "confidence": 0.7761122448979595,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und die laufen komplett asynchron ab, oder? Bei euch mit diesem Bot.",
            "start": 3111335,
            "end": 3114737,
            "confidence": 0.56425,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Bot hilft auf jeden Fall sehr viel dabei. Aber es gibt immer wieder Fragen, die während der Projekte, während des täglichen Doings aufkommen, wo einfach darüber diskutiert wird. Wir nutzen Stand-Ups im Allgemeinen, mehr oder weniger als reservierten Timeslot, um alles mögliche zu klären. Hey, ich habe gerade dieses Problem, kann mir wer helfen? Oder ich stehe vor dieser Herausforderung, wie würdet ihr das lösen? Oder hey, pass mal auf, da drüben kommt immer wieder diese Frage auf, sollen wir uns darum mal nächste Woche kümmern? Und nicht, was habe ich gestern gemacht, was mache ich morgen und so weiter, sondern es ist halt wichtig, in einem Remote-Setup sich regelmäßig zu sehen und auch zu interagieren, damit man remote überhaupt irgendein Teambonding hinkriegt. Klar, es ist nicht dasselbe wie in einem Büro und das wird auch nie dasselbe sein.",
            "start": 3114757,
            "end": 3159441,
            "confidence": 0.8062357142857146,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe ja kürzlich, dank dir Andi, du hast mir den Link gesendet, einen Blog-Eintrag gelesen, wo es um genau diese Stand-Up-Meetings gegangen ist. Und der Blog-Eintrag ist von einem Mitarbeiter von der Firma HoneyCamp geschrieben worden, die man vielleicht auch kennt von Charity Mayers, das ist die CEO von dieser Firma, ist im DevOps-Bereich ja super bekannt und auch im Datenbank-Bereich. Aber schreibt sehr viel über Kultur, über Firmenkultur und Teamorganisation. Und von dieser Firma, der Blog-Eintrag, beschreibt, wie die in einem Team weggegangen sind von Stand-Ups, weil die eben auch gemerkt haben, dass Stand-Ups so schwierig sind, vor allem im Remote-Bereich. Und die sind hingegangen zu einem einstündigen Meeting jeden Tag, dass das Stand-Up ersetzt. Wiederholt es nochmal, ein einstündiges Meeting jeden Tag.",
            "start": 3160301,
            "end": 3209125,
            "confidence": 0.8288159999999997,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Blogartikel besagt aber auch, dass dieses einstündige Meeting fast alle anderen Meetings ersetzt hat. Das hast du gerade unerwähnt gelassen. Die sagen, dieses einstündige Meeting, da klären wir einfach fast alles, sogar Retrospektiven machen die in diesen einstündigen Meetings.",
            "start": 3209145,
            "end": 3226732,
            "confidence": 0.8582750000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und die haben das wirklich so als Treffen organisiert. Das ist ein fixer, geblockter Zeitslot. Und auch am Anfang, 10 bis 20 Minuten, ist nur sozial. Man spricht über gewisse Dinge, die gar nicht technisch sind. Geht dann über in so eine Art Stand-Up, wo man Punkte bespricht, die zu klären sind im Team. Vielleicht nimmt man auch jemanden aus einem externen Team dazu, wenn es irgendwas zu klären gibt. Macht eigentlich alles, was sonst irgendwie in Zwischenmeetings passiert oder vielleicht am Gang oder bei der Kaffeemaschine. Probiert mal einfach in dieses 1-Stunden-Meeting reinzubacken. Und die Idee dahinter ist natürlich auch, dass man nicht viele kleine zerstückelte, asynchrone Sachen oder Meetings hat, sondern das blockt in einer Stunde, die immer fix ist. Jeder kennt diese Stunde, kann also seinen Flow außen herum legen. Und für die ist es super effektiv, sagen sie.",
            "start": 3227698,
            "end": 3280020,
            "confidence": 0.8408380281690144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, stell dir mal vor, du hast eine 40-Stunden-Arbeitswoche und du hast in dieser 40-Stunden-Arbeitswoche nur 5-Stunden-Meetings. Wie geil wäre das?",
            "start": 3280373,
            "end": 3287415,
            "confidence": 0.2628571428571429,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also sie schreiben schon, dass es noch andere Meetings auch gibt, aber sie sagen, dass halt auch viel ersetzt wird durch diese Stunde. Und seien wir uns mal ehrlich, diese Stand-Ups, die irgendwo geschrieben sind, meiner Meinung nach funktionieren die nicht. Die liest keiner. Und ein Stand-Up muss in irgendeiner Form die Interaktion haben. Man muss vielleicht in dem Stand-Up auch danach nochmal sich zusammensetzen können, dass man sagt, ah, das Problem hatte ich auch schon mal, setzen wir uns schnell zusammen. Also das ist eine Methode, die für On-Site-Meetings, für Office-Meetings gedacht ist, meiner Meinung nach. Und ich finde die Stunde gar nicht so schlecht. Ich habe ja auch gerade ein Projekt mit einem Kollegen und wir machen das eigentlich auch ganz oft, obwohl wir nur zu zweit sind, dass wir einfach so eine In-Hit-Besprechung jeden Tag machen, wo man einfach kurz auch was Privates bespricht. dann so reinkommt, bespricht, was man denn so macht, vielleicht ein paar Dinge klärt auf der technischen Seite. Und obwohl wir nur zwei sind, macht es absolut Sinn, meiner Meinung nach, und ersetzt so ein bisschen den Office-Charakter. Weil wenn ich so daran denke, wie man früher im Office gearbeitet hat, da kommt man mal an, da trinkt man einen Kaffee an der Kaffeemaschine, diskutiert man irgendwas. Bis man da mal richtig startet und arbeiten beginnt, das braucht eine gewisse Zeit. Und mir kommt vor, dass dieses Stunden-Meeting vielleicht einfach probiert, das im Online-Space wieder zu spiegeln, wie man eigentlich so klassisch im Office gestartet hat. Also ich finde das super interessant. Und mir ist es erst nach dem Lesen aufgefallen, dass ich das selber eigentlich auch oft mache. Genauso ein Starten am Tag. Und das kann halt in einem Online-Meeting passieren.",
            "start": 3287435,
            "end": 3376738,
            "confidence": 0.8103862068965517,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ob es jetzt immer eine Stunde sein muss, weiß ich jetzt auch nicht. Wir versuchen es halt so ein bisschen so zu machen. Ist halt nicht ganz so knallhart, wie Honeycomb es macht. Unter anderem mit Retrospektiven auch da drin. Wir haben schon noch eigene Retrospektiven. Aber es ist auf jeden Fall ein interessanter Ansatz. Und meines Erachtens nach kann man den Ansatz fahren, wenn du ein sehr erwachsenes Team hast und ein sehr eingespieltes Team. Beim neuen Team finde ich immer ein bisschen schwierig, weil die Menschen müssen sich erst einspielen.",
            "start": 3376758,
            "end": 3401957,
            "confidence": 0.6282826086956519,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das hilft ja dem Team bei dem Einspielen. Also gerade das ermöglicht ja mehr soziale Interaktion, die ich sonst vielleicht in so Kurzmeetings eben nicht habe, weil die halt immer sehr technisch fokussiert sind. Man bespricht irgendwas beim Entscheidung. Und dieser ganze soziale Aspekt, wo sich das Team kennenlernt und besser miteinander interagiert, Das geht ja eigentlich verloren und das hast du in dieser Stunde. Also ich finde das super interessant und gerade bei frischen Teams könnte mir das vorstellen, dass das eigentlich sehr gut ist. Es ist natürlich das Problem, dass jeder sagt, hey Moment, eine Stunde pro Tag, das wird multipliziert mit den Leuten. Das ist, glaube ich, auch unter Umständen schwer durchzusetzen. Aber wie gesagt, früher in der Office-Kultur war das wahrscheinlich ganz die Standard-Vorgehensweise. Wer hat denn gestartet unter einer Stunde?",
            "start": 3402017,
            "end": 3448048,
            "confidence": 0.8101029411764707,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du tust ja gerade so, als gäbe es keine Büros mehr.",
            "start": 3448149,
            "end": 3450030,
            "confidence": 0.3031818181818182,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wo wir übrigens gleich bei einem anderen Thema sind, was bei uns eben in der Community besprochen wurde. Es gibt Leute, die haben von ihrer Erfahrung erzählt, dass jetzt im hybriden Setup, wenn sie im Office sind, eigentlich nur mehr die soziale Komponente wichtig ist und nur mehr Meetings gemacht werden, wenn sie im Office sind. Und dass das manche Leute stört, weil die dann natürlich nicht produktiv sind, produktiv im Coding-Sinne. Weil die ja nur in Meetings rumhängen im Office und dann vielleicht auch von links und rechts mal eine dumme Meldung bekommen haben. dass man eher unproduktiv ist, wenn man im Office ist.",
            "start": 3450745,
            "end": 3481482,
            "confidence": 0.8277238095238094,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, Firmen, die hybrid arbeiten inzwischen, haben auch oft akzeptiert, dass man, ich sag mal in Anführungszeichen, unproduktiver ist, wenn man im Büro ist. Aber da stelle ich mir die Frage, okay, wir machen alle einen kreativen Beruf, was heißt denn Produktivität? Lines of Code? Nein, ich denke nicht. Weil Produktivität heißt auch miteinander interagieren, Produktivität heißt auch Vertrauen aufzubauen oder vielleicht einfach nur eine Designentscheidung bei der Kaffeemaschine zu treffen. Was natürlich dann wieder zurück zu diesen Meetings führt, zu diesem hybriden Setup, was unglaublich schwierig ist. Alle Entscheidungen, die nämlich an der Kaffeemaschine getroffen werden, werden oft nicht zurück zum Team gespielt. Also irgendwie in Slack oder ähnliches. Das bedeutet so zwei, drei Leute aus einem Sechs-Mann-Team wissen Bescheid. Sechs-Mann-Team. Sagt man das eigentlich? Sechs-Mann-Team? Sechs-Frau-Team?",
            "start": 3481522,
            "end": 3529589,
            "confidence": 0.7815546875,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Weiß ich jetzt nicht.",
            "start": 3529790,
            "end": 3530451,
            "confidence": 0.49225,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sechs-Personen-Team. Zwei Leute sind aware, die anderen vier aber nicht. Und das finde ich unglaublich schwierig, wenn man diese Hybridkultur macht. Und das wiederum, und das macht die ganze Sache so schwierig, denke ich. Ich denke, das ist der Root Cause dieses, vielleicht sogar dieser Podcast-Episode. Meetings und Entscheidungen, egal wo sie getroffen werden, basieren alles auf der menschlichen Disziplin jedes Einzelnen. Weil wenn das nämlich nicht dokumentiert wird, sorry, niemand schreibt gern Meeting Notes. Es ist aber wichtig, dass die geschrieben werden, auch für die Leute, die im Urlaub waren.",
            "start": 3531131,
            "end": 3564538,
            "confidence": 0.8136703296703298,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber gerade das finde ich ja den großen Vorteil von Hybrid, dass du sagen kannst, okay, wir haben als Team einen Tag, wo immer alle im Office sind und wir machen die ganzen wichtigen Meetings an diesem Tag, wo wir Sachen besprechen, wo wir vielleicht eine Retrospektive machen, ist vielleicht auch einfacher, on-site zu machen. diese ganzen Meetings geblockt an einem Tag. Das heißt, man hat eine saubere Trennung zwischen Focustime, Remote und wirklich dieser sozialen Zeit im Office. Also wenn man das sinnvoll nutzen kann, glaube ich, kann man Hybrid wirklich gut ausspielen.",
            "start": 3564578,
            "end": 3594862,
            "confidence": 0.822648936170213,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sag mal ehrlich, ist Hybrid wirklich die Fixierung eines Officetages? Meines Erachtens nach nicht.",
            "start": 3595623,
            "end": 3600928,
            "confidence": 0.584642857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich finde schon, dass man sich auf einen Tag oder einen halben Tag oder was auch immer einigen kann. Man einigt sich sonst ja auch auf Meetingzeiten, wann man sich meetigt. Also warum kann man nicht auch einen Tag haben, wo alle da sind und dann kann man wirklich diese Team-Meetings an diesem einen Tag machen und dann ist es auch kein Problem, weil da alle drin sitzen und dann sind alle nicht produktiv im Sinne vom Coding. aber sind eben sehr produktiv in den ganzen anderen Bereichen Organisation, das soziale Teamgefüge stärken und so weiter.",
            "start": 3601324,
            "end": 3630125,
            "confidence": 0.8527731958762884,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es löst aber nicht das Hauptproblem, dass Sachen die zwischen zwei Leuten, ist völlig egal ob an der Kaffeemaschine oder in dem One-on-One besprochen werden und entschieden werden, dass diese nicht zurückgespielt werden. Das löst auch einen Office-Tag nicht.",
            "start": 3630166,
            "end": 3641395,
            "confidence": 0.7574871794871795,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Klar, aber das Problem hattest du auch im Office-Setup. Das hast du immer, dieses Problem.",
            "start": 3641927,
            "end": 3646230,
            "confidence": 0.7104666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, richtig. Und ich meine, wir machen gerade eine Podcast-Episode über Meetings. Und weil eigentlich ist es das, ja. Meetings an der Kaffeemaschine, also Gespräche an der Kaffeemaschine, sind eigentlich ein Meeting ohne Meeting-Notes. Also andere Leute haben gar nicht die Möglichkeit, die Entscheidung zu erfahren. Und das trägt ja komplett zu diesem ganzen Problem, was Sie hier besprechen, bei. Kommen wir zu der Frage zurück.",
            "start": 3646350,
            "end": 3666461,
            "confidence": 0.7662424242424241,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wofür aber eigentlich dieses Stand-Up gedacht ist oder eben, wenn man so eine Stunde macht. Also genau das werden ja eigentlich diese Meetings, wo man dann solche Entscheidungen kommunizieren kann. Ich habe gestern mit XY gesprochen an der Kaffeemaschine und wir haben uns geeinigt, dass wir das so oder so machen. Das muss man natürlich durchziehen oder man macht sinnvoll schriftlich, klar. Aber schriftlich ist es wahrscheinlich nochmal schwieriger. Aber was wichtig ist, es muss kommuniziert werden und da ist halt viel Disziplin nötig dafür.",
            "start": 3666481,
            "end": 3692022,
            "confidence": 0.7851294117647061,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und genau das sage ich doch die ganze Zeit hier. Du kannst der beste Meeting-Organisator sein. Das, was gute Meetings erfolgreich macht, hängt nicht von dir alleine ab.",
            "start": 3692142,
            "end": 3703819,
            "confidence": 0.8623928571428573,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber Sachen kannst du steuern, so wie die Meeting-Notes. Die kannst du sehr gut steuern.",
            "start": 3703859,
            "end": 3707004,
            "confidence": 0.6477333333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber das, was du gerade gesagt hast. Dafür ist ja das Stand-Up da, Entscheidungen von der Kaffeemaschine müssen zurück zum Stand-Up gebracht werden. Alles richtig. Realität sieht anders aus. Und das führt meines Erachtens nach im Endeffekt dazu, dass Leute sagen, okay, Stand-Up, das hat mir nichts gebracht. Und die gehen dann nicht dahin. Weil es basiert alles auf der menschlichen Disziplin, sich das aufzuschreiben und dann, ah, okay, das muss ich morgen im Stand-up nennen. Das meine ich doch damit, dass gute Meetings nicht von einer Person abhängen, sondern von der Gruppe an Meeting-Teilnehmern. Und jeder muss eine unglaublich hohe Disziplin an den Tag legen, um jedes Meeting für jeden wertvoll zu machen. Wenn du eingeladen bist, aber das Meeting nicht für dich wertvoll ist, dann verlasse das Meeting. Law of Two Feet, sag's direkt ab oder was weiß der Geier nicht. Oder, mache ich auch sehr oft, Ich sage den Leuten, hey, ich werde nicht teilnehmen, aber ich wäre sehr interessiert an diesen Meeting-Notes.",
            "start": 3707204,
            "end": 3754838,
            "confidence": 0.7725868263473054,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also Key-Take-Away. Nach jedem Kaffeemaschinen-Besuch schreiben wir eine Message auf Slack, was wir besprochen haben. Oder in jedem längeren Meeting, ganz egal. Aber grundsätzlich eine Slack-Message in dem Team-Channel, was besprochen wurde. Könnte man sich vielleicht mal als Grundregel überlegen, ab einem Meeting, wenn irgendeine Entscheidung getroffen wurde, in einem Meeting an der Kaffeemaschine Slack-Message. Sofort danach, asynchron, möglichst schnell. würde wahrscheinlich viele Probleme vermeiden. Gebe dir vollkommen recht. Können wir als große Take-Away-Message von dieser Episode mitnehmen? Bin ich bei dir.",
            "start": 3754898,
            "end": 3788401,
            "confidence": 0.777707317073171,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gut, das war das Wort zum Sonntag. Also, wenn ihr gleich einen Kaffee ziehen geht, Entscheidung bitte zurück in Slack. Dankeschön. oder in unsere Discord-Community.",
            "start": 3788441,
            "end": 3797084,
            "confidence": 0.58356,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also, einen Kaffee zieht man nicht einfach, einen Kaffee genießt man. Das ist ja kein Shot, den man sich da gibt, sondern man genießt den, man hat ein Meeting, macht eine Entscheidung an der Kaffeemaschine, schreibt es in Slack auf. Das ist die neue Kaffeeslack-Office-Kultur.",
            "start": 3797124,
            "end": 3814195,
            "confidence": 0.8127333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ziehen heißt nicht wegziehen wie ein Shot, sondern auf den Knopf drücken und dann läuft der Kaffee in die Kaffeetasse. Das ist, man zieht sich einen Kaffee.",
            "start": 3814256,
            "end": 3822161,
            "confidence": 0.7622962962962965,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ja, aber das ist ja alles ein langsamer Prozess. Ziehen klingt so nach Schnellem. Auf den Knopf drücken ist schon mal falsch. Du brauchst eine Siebträgermaschine, machst das mit Gefühl, Liebe in den Kaffee und dann noch Liebe in die Message am Ende für dein Team.",
            "start": 3822781,
            "end": 3836898,
            "confidence": 0.7734255319148937,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man merkt schon, du bist schon ein bisschen länger raus aus der ganzen Firmengeschichte, ne?",
            "start": 3836918,
            "end": 3840482,
            "confidence": 0.2643333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, ich trinke nur sinnvollen Kaffee.",
            "start": 3840502,
            "end": 3842565,
            "confidence": 0.5436666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann wende ich mal die Law of Two Feet an, denn ich denke, ich kann zu dieser Kaffee-Diskussion hier nichts beitragen. Vielen Dank, Wolfgang, dass wir so über Meetings gesprochen haben. Hoffen wir mal und lassen uns mal bitte an die eigene Nase fassen, dass wir Meetings besser gestalten.",
            "start": 3843125,
            "end": 3857396,
            "confidence": 0.8035714285714286,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das machen wir. Dann bis nächste Woche. Ciao. Tschüss.",
            "start": 3857436,
            "end": 3860478,
            "confidence": 0.6495555555555554,
            "channel": null,
            "speaker": "B"
        }
    ],
    "confidence": 0.7788881147208948,
    "audio_duration": 3866.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}