{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/c2267db9-951c-4ab1-89aa-78f2be5bfe67/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62srnvyexl-770e-4004-b68a-147722c3d06e",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Ich sage immer, es muss idealerweise bunt und kreativ sein und Spaß machen, Spiele entwickeln. Also nicht diesen sehr theoretischen Ansatz, der auch oft in der Schule vermittelt wurde. Weil wir sind jetzt einfach in einer Zeit, da passiert so viel in so kurzer Zeit. Da müssen wir uns alle weiterbilden und vor allem die Lehrerinnen und Lehrer, die so einen wichtigen Job haben, weil die sind dafür verantwortlich, dass die Zukunft, die gerade auf den Schulbänken sitzt, dass die halt gut vorbereitet sind. Was wir uns eben nicht leisten können, dass wir jetzt quasi die guten Lehrkräfte, die jetzt noch da sind, dass wir die verkraulen und dass wir denen die Arbeitsbedingungen so schlecht machen, dass die auch keine Lust mehr drauf haben.",
      "start": 3057,
      "end": 44988,
      "confidence": 0.8257499999999997,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Welt gehört in Kinderhände, wechselte einst Herbert Krönemeyer, der wie Andi aus dem Pott kommt. Kinder sind unsere Zukunft, hört man an jeder Ecke. Doch heute sprechen wir einmal mit einer Spezialistin, die nicht nur darüber redet, sondern auch Dinge bewegt. Die Informatikerin Diana Knodel hat zwei Programmierbücher für Kinder geschrieben und auch gleich zwei Firmen gegründet, die konkrete Probleme in der Bildung lösen und Lehrkräfte unterstützen, das technische Interesse bei Kindern zu wecken. Wir sprechen auch über Rollenbilder, wie man Kindern die Programmierung näher bringt, über die Herausforderungen im Bildungswesen und natürlich auch über den Einfluss von KI auf den Bildungssektor. Los geht's mit einem spannenden Gespräch über unsere Zukunft. Heute sprechen wir mal über ein Thema, das nicht so in unserer Kernkompetenz liegt. Wir sprechen ja oft über Hiring, über den Arbeitsmarkt, wie schwierig es auch ist, Mitarbeiterinnen zu bekommen und ein diverses Team am Ende zu haben. Und oft gibt es ja dieses Argument, dass das schon in der Uni oder sogar noch früher in der Bildung scheitert, dass wir zum Beispiel weniger weibliche technische Arbeitskräfte finden. Und genau in diesen Bereich wollen wir heute mal einsteigen. Und wir sind ja absolut keine Spezialisten in dem Bereich. Wir sind ja nicht mal selber Eltern, der Andi und ich. Und darum haben wir versucht, jemanden zu finden, der richtig Ahnung in diesem Bereich hat. Und wir sind glücklicherweise fündig geworden mit der Dr. Diana Knodl, die absolute Spezialistin ist in diesem Bereich. Willkommen bei unserem Podcast.",
      "start": 50637,
      "end": 136397,
      "confidence": 0.847791164658635,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, vielen Dank für die Einladung. Ich freue mich sehr, heute einmal dabei zu sein.",
      "start": 136757,
      "end": 140858,
      "confidence": 0.7429333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Diana ist studierte Informatikerin, aber auch mit Schwerpunkt Psychologie. Du hast zwei Firmen gegründet in diesem ganzen Bildungsbereich. Tausende LehrerInnen in ganz Deutschland und im deutschsprachigen Raum verwenden euer Material, um die Profis von morgen auszubilden. Du hast zwei Bücher in dem Bereich geschrieben, wie man Kinder an diese ganze Programmierung heranführen kann. Und du warst auch Professorin in Berlin in diesem Bereich. Habe ich noch irgendwas vergessen? Kann man überhaupt noch mehr eigentlich in dem Bereich machen?",
      "start": 141486,
      "end": 173178,
      "confidence": 0.8385316455696202,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich bin jetzt schon länger in dem Bereich unterwegs und habe auch ganz viele verschiedene Dinge tatsächlich gemacht, quasi ja im Bildungsbereich oder im Bereich digitale Bildung und vor allem auch im Bereich Coding und Programmierung, Informatik für Schülerinnen und Schüler. Das klingt dann immer so wahnsinnig viel. Es ist natürlich auch nicht wenig, aber zum einen habe ich es nicht allein gemacht und zum anderen bin ich jetzt schon ein paar Jährchen unterwegs in dem Bereich und ich kann tatsächlich gleich noch ein bisschen Ausführliche erzählen.",
      "start": 174747,
      "end": 202381,
      "confidence": 0.7265113636363636,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie konnte man eigentlich auf die Idee in so einem Bereich eine Firma gründen? Weil normalerweise gründen Leute eher irgendwelche SaaS-Businesses, irgendwelche großen Businesses, wo man viel Geld macht und Bildung klingt ja jetzt im ersten Moment eher so nach einem sehr schwierigen Thema und da ist nie Geld irgendwo in der ganzen Branche und die Regierung steckt irgendwie mit dahinter. Es ist alles so von außen betrachtet immer eher schwergängig, würde ich mal sagen.",
      "start": 203043,
      "end": 232274,
      "confidence": 0.8321466666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist auch von innen betrachtet nicht einfach, kann ich euch schon mal sagen. Aber ich kann ja mal vielleicht ein bisschen ausholen, wie es dazu kam. Ich sage immer, das war tatsächlich nicht so geplant, sondern hat sich ergeben, beziehungsweise die Themen haben sich quasi einfach angeboten und gefühlt musste ich einfach die Chance ergreifen und da was machen. Aber vielleicht, wie das allgemein kam, ich habe ja selbst, wie ihr schon gesagt habt, Informatik studiert an der Uni Ulm damals. beziehungsweise ich hatte Medieninformatik studiert, weil ich in der Schule auch überhaupt keine Informatik hatte und ich konnte auch nicht programmieren. Und es ist sehr ungewöhnlich, dass man sich dann für ein Informatikstudium entscheidet. Und bei mir hat sich das ergeben, ne, irgendwie so 2000 Abi gemacht und dann überlegt, okay, was soll ich denn jetzt machen? Eigentlich wollte ich reisen, aber dann meinten meine Eltern, es ist besser, wenn ich jetzt direkt anfange zu studieren und so weiter. Und dann musste ich mir relativ kurzfristig überlegen, was mache ich denn jetzt, und dachte so, okay, Mathe mochte ich in der Schule ganz gerne. Ich war begeistert von den Möglichkeiten des Internets für die Kommunikation. Ich hatte immer ganz viele Brieffreundinnen auf der ganzen Welt und auf einmal konnte ich viel schneller und unkomplizierter mit denen kommunizieren und musste nicht zwei Wochen auf einen Antwortbrief warten. Genau, dachte einfach so irgendwie mit dem Internet und was man alles machen kann, ist irgendwie ganz spannend. Und dann hatte ich auch noch Kunst-LK und da hat mich dieser Medienanteil in der Medieninformatik so ein bisschen getriggert. Dann habe ich gedacht, okay, was mit Medien macht man ja heutzutage und habe mich für Medieninformatik entschieden. Und habe dann tatsächlich erst im Laufe des Studiums gemerkt, wie toll dieses Fach ist und ich sage auch immer, was für eine Superpower Programmieren eigentlich ist, wie toll das ist, wenn man das kann, weil man einfach wirklich ganz einfach und unkompliziert digitale Produkte entwickeln kann. Und genau, deswegen bin ich zum einen so in dieses Studium reingeraten, ohne wirklich viel Vorkenntnisse zu haben und habe dann einfach gemerkt, dass es ganz toll ist und habe natürlich auch im Studium gesehen, dass es einfach viel zu wenige Frauen gibt, die in den Bereich reingehen und mich ein bisschen damit beschäftigt, woran das liegt, was man da tun kann. Und ein wichtiger Grund ist einfach, dass man selten den Zugang bekommt zu diesen Bereichen und vor allem auch selten auf eine Art und Weise, die ansprechend ist. Ich sage immer, es muss idealerweise bunt und kreativ sein und Spaß machen, Spiele entwickeln. Also nicht diesen sehr theoretischen Ansatz, der auch oft in der Schule vermittelt wurde, sondern wirklich so ein bisschen produktorientiert. Es entsteht was. Man hat am Ende irgendwie ein tolles Produkt. Und so ist dann die Idee entstanden, doch einfach mal einen Workshop für Mädchen anzubieten. Das war 2013, also jetzt tatsächlich zehn Jahre her, der allererste Workshop. Und es ging darum, mit den Schülerinnen, zwölf waren es damals, Apps zu entwickeln. Und zwar mit dem MIT App Inventor. Das ist heute noch ein großartiges Tool. Open Source. Man kann da ganz unkompliziert richtige Android-Apps entwickeln. Mittlerweile funktioniert es sogar auf der iPhone. Und lernt trotzdem so ganz wichtige Grundlagen der Informatik. Eine Schleife, eine Variable. Das ist immer das Gleiche, egal ob es eine grafische Programmieroberfläche ist oder eine textbasierte. Genau, aber das war so ein bisschen der Start.",
      "start": 232678,
      "end": 425239,
      "confidence": 0.7879756944444449,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In welchem Alter waren die ungefähr damals?",
      "start": 425856,
      "end": 428577,
      "confidence": 0.5107142857142858,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Mädchen waren damals, ich glaube, so zwischen 13 und 16 Jahre alt. Und das war so ein viertägiger Workshop, da hatten wir dann irgendwie Sponsoren gesucht und es war alles ganz großartig und toll. Dann kam auch die Presse auf uns zu und wir hatten tatsächlich so einen Beitrag in den Kindernachrichten bei LOGO, Und daraufhin hatten wir dann vermehrt Anfragen bekommen, ob wir nicht solche Workshops geben können. Und das haben wir dann immer wieder gemacht, haben dann aber relativ schnell gemerkt, es ist zum einen super aufwendig, neben Familie und Job immer noch diese Workshops zu geben. Und wir haben auch gemerkt, dass es einfach sehr, dass man vor allem, ich sage jetzt mal, wenn man jetzt einfach einen Workshop ankündigt und sagt, es ist nicht ein Workshop mit dem Fokus Kinder, Mädchen oder so, ne, dass man dann typischerweise einfach viele Jungs hat von Eltern, die die Kinder halt sehr fördern. Und wir dachten halt, wir wollen einfach möglichst breit die Kinder und Jugendlichen erreichen. Wir wollen auch vor allem Mädchen erreichen. Wir haben gesagt, eigentlich muss es in der Schule stattfinden, weil da sind alle. Da erreicht man alle und da soll jeder die Chance bekommen, das mal auszuprobieren. Und dann, wie gesagt, das war alles damals ein Nebenprojekt, wir hatten auch keine Organisation und nichts. Dann gab es damals einen Wettbewerb, der hieß Act for Impact, der wurde von der Vodafone-Stiftung ausgeschrieben. Da hatten wir mitgemacht und ich glaube, es gab so 120 Einreichungen und dann haben wir den auf einmal gewonnen, diesen Wettbewerb. Da hat ja keiner mitgerechnet, auch wir nicht. Und dann hatten wir gewonnen und dann wollte die Stiftung uns quasi Geld überweisen und wir hatten ja gar keine Organisation. Das heißt, wir mussten tatsächlich gründen damals und hatten aber ehrlich gesagt wenig Ahnung. Also es war nicht so, dass wir dem abgeneigt waren, aber es war einfach so, okay, jetzt haben wir dieses Projekt und jetzt haben wir dieses Geld. Es waren nicht wahnsinnig viel, aber immerhin 40.000 Euro für den Staat. Und dann haben wir eine gemeinnützige Organisation gegründet, AppCamps. Und es lief dann auch anfangs tatsächlich noch als Nebenprojekt. Ich war zu dem Zeitpunkt noch Produktmanagerin bei Xing. Und dann hatte ich aber relativ schnell gemerkt, ich habe jetzt Lust, da irgendwie mehr zu machen, habe gekündigt und bin dann quasi zu AppCamps gewechselt. Und dann haben wir gesagt, okay, wir versuchen das Ganze jetzt mal aufzubauen, zu entwickeln und zu schauen, wie weit wir kommen. Und es hat sich alles sehr gut entwickelt. Natürlich mit Höhen und Tiefen, das muss man auch sagen. Gerade in dem Bereich gibt es wenig Geld. Anfangs haben wir eben versucht, wir haben teilweise Firmenworkshops gegeben, die wir uns bezahlen haben lassen. Dann haben wir Stiftungen gesucht, dann haben wir bei Wettbewerben mitgemacht und haben uns halt so von Jahr zu Jahr quasi durchgehangelt finanziell. Und mittlerweile haben wir aber Viele Partner, mit denen wir auch irgendwie jetzt schon längerfristig zusammenarbeiten, dass wir halt wissen, wir haben so und so viel Budget typischerweise im Jahr, können das Team gut finanzieren. Und jetzt gibt's uns halt quasi zehn Jahre bzw. gegründet haben wir dann vor neun Jahren.",
      "start": 428617,
      "end": 598986,
      "confidence": 0.7813820224719097,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie groß ist das Team aktuell?",
      "start": 599006,
      "end": 600147,
      "confidence": 0.6814999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das AppCams Team ist ganz klein. Wir sind sechs Leute. Das reicht auch aus. Und was wir jetzt mittlerweile machen, wir geben keine Workshops mehr, beziehungsweise vereinzelt geben wir noch Workshops, aber wir wollten das Thema ja in die Schulen bringen. Und mit sechs Leuten kann man irgendwie mal in die Schule gehen. Aber der Ansatz war, dass wir die Workshops, die wir geben, einfach als digitale Unterrichtsmaterialien in Form von Videos, digitale Lernkarten zur Verfügung stellen. Und die Lehrkräfte können unsere Materialien nutzen und selbstständig mit unseren Unterlagen im Unterricht mit den Kindern programmieren. Und die kriegen alles von uns, was sie brauchen.",
      "start": 600807,
      "end": 635402,
      "confidence": 0.8152019230769235,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie funktioniert das rein praktisch? Also wenn ich jetzt als Lehrkraft irgendwie da Infos brauche, dann kontakte ich euch oder kann das einfach direkt runterladen und einfach verwenden?",
      "start": 635442,
      "end": 645314,
      "confidence": 0.7907931034482758,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, also wir haben eine Plattform, appcamps.de, da kann man sich dann anmelden und dann hat man Zugriff auf alle Unterlagen. Man kann die PDFs runterladen, man kann ansonsten auch mit der Plattform arbeiten im Klassenzimmer.",
      "start": 645854,
      "end": 658941,
      "confidence": 0.8730833333333332,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie viele Leute verwenden das oder wie gut wird das auch angenommen?",
      "start": 659001,
      "end": 662663,
      "confidence": 0.7016153846153846,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das wird sehr gut angenommen. Wir haben, ja, jetzt habe ich die aktuellen Zahlen nicht im Kopf, aber es sind jährlich um die, sagen wir mal so, 25.000 Lehrkräfte, die das Angebot nutzen im Unterricht und viele nutzen es auch wirklich viel. Also, das ist selten, dass sie mal nur eine Stunde damit machen. Viele nutzen es richtig für ihren Informatikunterricht, weil wir mittlerweile natürlich nicht nur App-Entwicklung haben, sondern wir haben ganz viele Themen. Natürlich immer Schwerpunkt, also so Einstieg, Einführung in die Programmierung. Wir haben auch Grundlagen der Informatik. Das ist zum Beispiel in Baden-Württemberg in der siebten Klasse gibt es ein Curriculum. Da werden quasi Algorithmen, Datensicherheit, Information und so weiter zu diesen typischen Grundlagen vermittelt. Und da haben wir für das gesamte Curriculum einfach Unterlagen erstellt. Und die funktionieren natürlich auch in anderen Bundesländern. Und deswegen sind wir da mittlerweile, glaube ich, ganz gut bekannt unter den Lehrkräften, ich sage immer, die Informatik unterrichten, die ja selten selbst Informatik studiert haben.",
      "start": 662903,
      "end": 721978,
      "confidence": 0.7780000000000006,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe mir die aktuellen Zahlen aus dem Bericht 2022 mal rausgesucht und zwar habt ihr seit Gründung 40.000 Lehrkräfte oder beziehungsweise haben 40.000 Lehrkräfte und 350.000 Schülerinnen und Schüler damit gearbeitet.",
      "start": 721998,
      "end": 733310,
      "confidence": 0.75246875,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Allein letztes Jahr waren es 350.000 Schülerinnen und Schüler. Also seit Gründung ist es über eine Million Schülerinnen und Schüler, die wir erreicht haben.",
      "start": 734052,
      "end": 740775,
      "confidence": 0.7269166666666668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ah, okay. Entschuldigung. Dann habe ich den Bericht ja wahrscheinlich ein bisschen falsch gelesen. Und dass 89 Prozent der Leute aus den Klassen, aus den Schulklassen 5 bis 10 kamen. Das hat mich auch sehr beeindruckt, weil ich habe mir die Plattform mal ein bisschen angesehen. Ihr bietet ja wirklich Unterrichtsmaterialien wirklich so von bis die komplette Spanne. Grundlagen der Informatik, inklusive Algorithmen, hat mich sehr beeindruckt, so nach dem Motto, okay, hätte ich in der siebten Klasse bereits was über Algorithmen gelernt. Wow. JavaScript und Python, also wirklich schon in die Programmierung. Und, was mich auch beeindruckt hat, Datenschutz und unter anderem Wissen zu Fakenews. Ich sag mal, Datenschutz ist ein relativ trockenes Topic. Könnt ihr auch sehen, welches so die populärsten Unterrichtsmaterialien sind?",
      "start": 740815,
      "end": 782895,
      "confidence": 0.7803119999999997,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, das sind wir natürlich. Und die populärsten sind tatsächlich vor allem Scratch, wo es dann darum geht, Einstieg in die Programmierung, Spieleprogrammierung. Was ich auch immer ganz wichtig finde, da diesen bunten spielerischen Zugang zu ermöglichen. Aber natürlich muss man sich auch mit dem Thema Datenschutz beschäftigen, wenn man ja mit Kindern im Web, im Internet unterwegs ist. Aber auch da versuchen wir, das eben immer möglichst praktisch und an der Lebensrealität der Kinder zu orientieren. Und das funktioniert in der Regel ganz gut, ja.",
      "start": 783423,
      "end": 814719,
      "confidence": 0.8477325581395345,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hattest schon App Inventor und Scratch erwähnt und ich hatte auch gesehen, ihr arbeitet auch sehr viel mit anderen Editoren, wie zum Beispiel App Lab und dem Nepo Editor von Open Roberta. Das ist so eine kleine Mikroplatine oder ähnliches. Ist das richtig?",
      "start": 815110,
      "end": 828440,
      "confidence": 0.8021363636363638,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau, also das ist der Calliope Mini beispielsweise. Das ist eine Mikroplatine, die man programmieren kann. Mit dem Editor von Ogbroberta, der vom Fraunhofer-Institut entwickelt wird, kann man ganz viele Systeme programmieren, auch den EV3 und so weiter. Und wir haben halt, wir suchen uns immer die Tools und Editoren raus. die unkompliziert in Schulen genutzt werden können. Und idealerweise so, dass man keine Kosten hat. Also, dass man sich nicht unbedingt Hardware anschaffen muss. Bei Calliope Mini ist es jetzt die Ausnahme. Da muss man sich, wie gesagt, diese kleinen haptischen Geräte kaufen. Oder man kann auch im Simulator arbeiten. Aber ich finde, wenn man jetzt mal so mit Hardware arbeitet, ist es auch ganz schön, das mal in der Hand zu haben.",
      "start": 828802,
      "end": 869520,
      "confidence": 0.7888709677419353,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die meisten dieser Tools sind aber dann wirklich visuell orientiert und nicht wirklich so wie, ich sag mal, wir Erwachsenen Programmierung kennen und wir machen da ein Keyword nach dem nächsten, oder?",
      "start": 869800,
      "end": 879028,
      "confidence": 0.8330625,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Jaja, absolut. Die meisten, die sind quasi grafische Programmieroberflächen, also jetzt zum Beispiel Scratch, App Inventor oder auch das App Lab von Code.org. Gleiches gilt auch für Open Roberta. Wir haben ein bisschen was zu Python. SQL ist jetzt keine klassische Programmiersprache, aber wir haben ein bisschen was zum Thema Webseiten, HTML, CSS und da muss man natürlich den Code oder das Skript schreiben.",
      "start": 879483,
      "end": 904109,
      "confidence": 0.7683593750000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hatte gerade schon gesagt, dass in eurem letzten Bericht gesagt wurde, 89 Prozent der Schülerinnen und Schüler kommen von Klasse 5 bis 10 und ich hatte mir dann ein bisschen die Unterrichtsmaterialien angesehen, weil eine Frage, nach der ich eine Antwort gesucht habe, ist, ab wann kann man denn eigentlich starten? Und da habe ich einen Kurs gefunden, der startet ab Klassenstufe 3 und dann muss ich, da ich selbst kein Vater bin, muss ich selbst erst mal googeln, okay, Klassenstufe 3 ist ab 9 Jahre oder in der Regel so 9 Jahre. Und da kommt dann auch dieser Kallipo-Mini?",
      "start": 904429,
      "end": 935468,
      "confidence": 0.784851485148515,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Kalliope-Mini heißt es genau, ja.",
      "start": 935508,
      "end": 937628,
      "confidence": 0.6462,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Entschuldigung, den kannte ich nämlich auch vorher nicht. Und dann zum Beispiel so Themen wie Datenbanken und SQL, die Unterrichtsmaterialien sind dann in der Regel so für Klassenschufe 10 geeignet, wo man dann circa so, ich sag mal so 16 Jahre alt ist, glaube ich, wenn ich das richtig im Kopf habe. Geht das auch viel weiter runter als Klassenschufe 3? Oder sagst du, okay, ab Klassenschufe 3 entwickelt sich so wirklich logisches Denken und all die Verknüpfungen, die man dafür braucht?",
      "start": 937648,
      "end": 965682,
      "confidence": 0.7756829268292683,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nee, ich glaube, das hat gar nicht jetzt unbedingt mit dem logischen Denken zu tun, sondern die Kinder müssen in der Lage sein, ein bisschen zu lesen und zu schreiben. Selbst wenn es ein grafischer Editor ist. Wir arbeiten gerade tatsächlich an Unterlagen für Scratch Junior. Und es ist eben sehr visuell, sehr grafisch, arbeitet viel mit Icons und es wäre dann auch schon für jüngere Kinder möglich. Insofern kann man also dieses spielerische quasi computational thinking, wie es ja dann im Englischen so schön heißt, auch schon früher anfangen, wenn man das möchte. Aber wir hatten uns eben bisher konzentriert vor allem auf die weiterführende Schule. Wie du schon sagst, Klasse 5 bis 10, da haben wir die meisten Nutzerinnen und Nutzer, weil es da eben diese tollen Tools gibt, um den Einstieg zu ermöglichen. Und das ist auch unser Ansatz. Wir wollen den Kindern den Zugang ermöglichen, dass sie dann hoffentlich am Ball bleiben. Und wenn wir jetzt erst anfangen, Unterlagen für die Oberstufe zu entwickeln, dann haben wir viele schon verloren, die einfach quasi auf dem Weg dahin für sich entschieden haben, das ist nichts für sie. Oder wenn sie dann, jetzt sagen wir mal, in der 11. Klasse sind, und nie den Zugang hatten, sie das auch gar nicht mehr zutrauen. Also vor allem, sage ich jetzt mal, Mädchen, die vielleicht vorher nicht die Chance hatten, das mal auszuprobieren. Und deswegen sagen wir immer, je früher man anfängt, desto besser. Und wir sehen auch, gerade bei den Grundschülern, die haben da in der Regel auch die Mädchen, die trauen sich das genauso zu, die haben genauso tolle Ideen, machen das richtig gut. Und je älter die Kinder werden und wenn die Mädchen oder auch alle in die Pubertät kommen, dann fängt es so an zu überlegen, okay, was ist typisch männlich, was ist typisch weiblich. Und dann würde man jetzt sowas wie Informatik und Maschinenbau und Elektrotechnik und Physik, würde man jetzt eher quasi Männern zuschreiben. Und Mädchen wollen dann vielleicht besonders weiblich sein und suchen sich dann eben andere Bereiche aus. Und das sieht man dann auch so ein bisschen in der Forschungsliteratur, dass gerade so die Pubertät so ein Knackpunkt ist, wo viele Mädchen dann quasi verloren gehen. Und deswegen ist es ganz wichtig, da weiterhin tolle Angebote zu haben. Ich glaube auch einfach, dass die Mädchen sehen, sie sind nicht die einzigen, sondern es gibt andere. Es gibt Rollenmodelle. Sie müssen das idealerweise mit ihren Freundinnen machen. Und da versuchen wir das dann eben auch zu unterstützen und entsprechende Angebote zu machen. Und vielleicht noch eine Ergänzung, was wir bei unseren Unterlagen immer machen, was uns ganz wichtig ist. Wir sind ja selber nicht mehr dabei in den Klassen, weil wir das ja nicht leisten können. Aber wir arbeiten ganz viel mit Videos. Das heißt, wir haben dann Erklärvideos. wo auch viele Entwicklerinnen oder auch wir aus dem Team, wir haben viele Frauen im Team, einfach die Dinge erklären. Das heißt, da sehen die Kinder auch schon, das sind Frauen, die das erklären. Und in unseren sogenannten Abschlussvideos, die dann hinterher gezeigt werden können, haben wir immer noch mal Expertinnen und Experten. Also das sind dann Leute, die wirklich als Programmiererinnen arbeiten und die erklären dann so, ne, oh, ihr habt heute ein Spiel programmiert und es ging um Variablen. Übrigens, Ich bin auch Programmiererin und Variablen verwende ich jeden Tag und dann erklären wir nochmal so ein bisschen die Idee dahinter. Und so bringen wir einfach ganz viele, ich sage nicht nur Frauen, sondern allgemein diverse Rollenmodelle und Vorbilder in die Klassen und das ist total schön.",
      "start": 966322,
      "end": 1157455,
      "confidence": 0.7952049586776863,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weil du auch Vorbilder erwähnst, das ist immer so ein Knackpunkt oder der ganz oft erwähnt wird. Es fehlen die Vorbilder und bei Frauen wird dann ja ganz oft genannt. Ja, es gibt ja Ada Lovelace und Grace Hopper, die es früher gegeben hat. Es ist zwar ganz nett, aber das sind halt so Steinzeitmodelle, würde ich fast sagen. Und ich habe auch nicht irgendwie mit Kurt Gödel identifiziert als Mann oder so irgendwie. Man sucht ja eher so die jungen Vorbilder. Und es gibt ja so im amerikanischen Bereich auch so ein paar YouTuber, die extrem bekannt sind, so wie Mark Robot zum Beispiel, also ob du den zufällig kennst, der so Roboter baut und wirklich super bekannt ist mittlerweile. Gibt's so was in Deutschland? Kennst du zufällig? Irgendwen, sei es jetzt männlich oder weiblich, wie auch immer, der überhaupt so ein Vorbild ist für die Technik und vielleicht auch für YouTube-Star oder irgendwie in die Richtung geht. Gibt es da überhaupt was oder würdest du sagen, sowas wäre eigentlich noch cool zu haben? Irgendeine Person, die da eben auch viel für die Technik ganz allgemein oder für STEM-Berufe macht und vielleicht Leute einfach heranzieht, auch schon im frühen Alter.",
      "start": 1157495,
      "end": 1223443,
      "confidence": 0.7673930348258713,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, vielleicht nochmal ein Schritt zurück zu den Beispielen mit Adala Flays und so. Es ist tatsächlich so, dass diese sehr alten Rollenmodelle häufig sich negativ auswirken, wenn man quasi für einen Bereich motivieren will, weil sich die jungen Mädchen und Frauen heutzutage natürlich nicht damit identifizieren. Die hat in einer ganz anderen Zeit gelebt, die hat ganz andere Kleidung getragen und so weiter. Deswegen ist es häufig genau das Falsche, wenn man dann diese alten Rollenmodelle quasi so als Rollenmodelle sehr stark präsentiert. Und es braucht tatsächlich Rollenmodelle, die sehr nah an der Lebensrealität der Kinder sind. Ich kenne mich da ehrlich gesagt nicht so gut aus, ob es da jemanden gibt oder wen es da gibt. Ich weiß, es gibt natürlich auch viele Initiativen, die das Ganze machen oder unterstützen. Also die ist jetzt nicht super bekannt, aber zum Beispiel Julia Heidinger, das ist auch hier eine Freundin von mir aus Hamburg, die ist auch Programmiererin und die macht ganz viel in dem Bereich und die ist auch teilweise Moderatorin und die macht viel auf Instagram und erzählt und berichtet und so. Also das ist schon, das gibt es. Aber ich glaube, so diese großen YouTube-Stars, wie es das jetzt vielleicht in den USA gibt, das wüsste ich nicht, ob es das in Deutschland schon gibt oder wie da so die Stimmung und die Lage ist. Wobei ich selbst auch quasi sehr wenig auf YouTube unterwegs bin, deswegen kenne ich mich da nicht so gut aus.",
      "start": 1223834,
      "end": 1303358,
      "confidence": 0.7858669354838709,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielleicht ist YouTube auch schon die falsche Plattform mittlerweile. Keine Ahnung.",
      "start": 1303398,
      "end": 1306140,
      "confidence": 0.570909090909091,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielleicht eher TikTok. Muss man aber bei TikTok sagen.",
      "start": 1306161,
      "end": 1307802,
      "confidence": 0.25433333333333336,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Eben, ja genau. Wahrscheinlich ist es eher mittlerweile TikTok. Instagram ist ja vermutlich auch schon zu alt.",
      "start": 1307842,
      "end": 1311946,
      "confidence": 0.48352941176470593,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eine Frage, die mir irgendwie unter den Nägeln brennt. Du hattest gesagt, die ganze Sache ist mit einem viertägigen Workshop für Mädchen gestartet. Sind die ersten Unterrichtsunterlagen aus diesem Workshop?",
      "start": 1312948,
      "end": 1323505,
      "confidence": 0.7194999999999998,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nee, die sind nicht aus dem Workshop, aber die Idee ist da entstanden. Beziehungsweise da hatten wir, also da hatten wir noch keine Unterlagen, da haben wir einfach alles gemacht. Wir haben denen gezeigt, so arbeitet man damit und da haben wir denen geholfen. Wir hatten auch ganz viele tolle Helferinnen damals. Ich hatte dann gesagt, wir machen diesen Workshop, wer will mitmachen? Und da haben sich ganz viele tolle Frauen bei mir gemeldet. Das heißt, ich hatte überhaupt keine Probleme. Freiwillige zu finden, die mitmachen. Genau. Und dann haben sich die Unterlagen mit der Zeit entwickelt. Und ich weiß noch, der allererste Workshop, den wir in der Schule gemacht haben, der ging total daneben, also mit den Unterlagen, weil wir halt auch nicht wussten, wie müssen die Unterlagen aufgebaut sein. Also wir haben das einfach ausprobiert, hatten da einen Lehrer gefunden, der hat uns eingeladen. Und dann war das halt total chaotisch und hat gar nicht so geklappt, wie wir uns das vorgestellt haben, weil wir immer gedacht haben, okay, wir zeigen ein kurzes Video, dann arbeiten die Kinder. Video, die Kinder arbeiten. Video, die Kinder arbeiten. Heutzutage natürlich vollkommen klar, das funktioniert nicht, weil die natürlich alle ganz unterschiedliche Vorkenntnisse haben und haben dann halt irgendwann gesagt, okay, wir müssen die Unterlagen so gestalten, es gibt immer ein Video am Anfang, das gucken alle und dann arbeiten die Kinder selbstständig in ihrem eigenen Tempo, idealerweise im Pair-Programming zu zweit mit unseren Unterlagen. Und die sollten immer so ein, zwei Lernkarten schaffen. Und für die ganz fitten, schnellen gab es dann immer noch Zusatzaufgaben. Da konnten die Lehrkräfte auch differenzieren. Und so funktionieren die Unterlagen ganz wunderbar. Genau. Also insofern haben wir da quasi auf der Reise viel gelernt und auch gesehen, was funktioniert gut, was funktioniert nicht gut. Und können natürlich auch jetzt die Unterlagen immer anpassen, weil das ist alles online und digital. Und die Dinge entwickeln sich natürlich auch weiter. Und da müssen wir auch gucken, dass wir die Unterlagen entsprechend aktuell halten.",
      "start": 1324252,
      "end": 1424365,
      "confidence": 0.7773916913946587,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ihr macht das aber nur als kleines Team oder gibt's da auch von außen irgendwie Hilfe und Unterstützung bezüglich den Unterlagen?",
      "start": 1424995,
      "end": 1431987,
      "confidence": 0.7753181818181818,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nö, das machen wir als kleines Team.",
      "start": 1432007,
      "end": 1433269,
      "confidence": 0.5854285714285714,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist auch sehr impressive.",
      "start": 1433289,
      "end": 1434512,
      "confidence": 0.192,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber das ist natürlich auch gewachsen. Das ist natürlich gewachsen über die Zeit. Und wir haben mittlerweile, ihr habt ja auch schon geschaut, kann sich auch gerne jeder mal anschauen, wir haben sehr viele Themen. Ich glaube, es sind so 15, 16 Themenbereiche, die wir jetzt gerade haben. Und da kommt immer noch ein bisschen was dazu. Aber wir haben jetzt auch viele andere Angebote und Programme bei AppCams zum Beispiel. Was gerade auch sehr beliebt ist und auch jetzt erst durch die Pandemie eigentlich möglich wurde, die sogenannten Glass Chats. Und da ist die Idee, dass man wirklich für ein Gespräch mit einer Entwicklerin oder mit irgendjemandem, der in der Digitalbranche arbeitet, den Schallwurf dann online dazu, über BigBlueButton oder über welches Tool auch immer die Schule eben benutzen möchte. Und wie gesagt, vor der Pandemie war das undenkbar. Mittlerweile haben die zumindest die Ausstattung und wissen, wie Videokonferenzen funktionieren. Und genau, und dann schalten wir die Person dazu. Das wird von der Lehrerin in der Regel vorbereitet. Die haben dann Fragen. Es gibt eine kurze Präsentation und dann können die Kinder oder die Jugendlichen ganz konkrete Fragen stellen. Und es ist halt so richtig schöne Berufsorientierung, weil man halt einfach die Möglichkeit hat, mal mit jemandem zu sprechen, der oder die wirklich im Beruf arbeitet. Das kommt super gut an. Also das sind zum Beispiel so Angebote und Programme, die wir jetzt auch machen. Und wenn jetzt jemand zuhört und sagt, er oder sie hätte da auch mal Lust drauf, in so einem Class-Chat mitzumachen, kann man sich gerne an uns wenden. Am besten auf appcams.de schauen und da findet man alle Infos.",
      "start": 1434552,
      "end": 1520145,
      "confidence": 0.7632836363636366,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die ganzen Unterrichtsmaterialien sind ja jetzt natürlich an Lehrkräfte gerichtet. Ist das auch was, wo ich mich als potenzieller Vater mit auseinandersetzen könnte und dann zu Hause mit meinen Kindern was machen könnte? Oder sagst du, schwierig, weil es ist wirklich die Zielgruppe Schule und Lehrkräfte.",
      "start": 1521186,
      "end": 1538729,
      "confidence": 0.8488260869565221,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Wir haben auch tatsächlich Eltern, die das nutzen, entweder mit ihren Kindern zu Hause oder die AGs in der Schule anbieten. Das ist auf alle Fälle möglich, aber es ist natürlich alles auf Schule und Unterricht ausgerichtet. Das darf einen dann eben nicht stören. Aber wenn einen das nicht stört, dann kann man das sehr gerne machen und auch verwenden und nutzen. Wobei es, wenn man jetzt wirklich zu Hause als Elternteil mit Kindern arbeiten möchte, dann gibt es natürlich auch andere Unterlagen. Zum Beispiel, das hatte die auch gesagt, ich habe zwei Bücher geschrieben zu dem Thema Einfach Programmieren für Kinder, das ist ein Carlson-Verlag, erschien 2017. Und es ist wirklich so ein Grundlagenbuch, da werden die wichtigen Konzepte der Informatik einmal so einfach erklärt wie möglich. Es gibt immer so ein paar Übungen dazu, um das einzuüben, und es gibt auch eine App dazu, um das Ganze so ein bisschen spielerisch zu vertiefen. Genau, und dieses Buch, 2017 erschien, ist jetzt aktuell im Mai, also 2023, sechs Jahre später, im Klett Verlag noch mal als Schulbuch herausgekommen, was mich total freut. Also das ist jetzt quasi, könntest die Schulen auch als sozusagen Workbook nutzen und wirklich quasi, ja, in fünfter, sechster Klasse, ich glaube, das ist so eine Zielgruppe, die die jetzt annonciert haben, ja, mit dem Buch arbeiten, um auch Informatik zu unterrichten.",
      "start": 1539141,
      "end": 1617677,
      "confidence": 0.7773274336283189,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt ist es natürlich so, jetzt hast du die Unterrichtsmaterialien bei AppCamps und das bedeutet natürlich auch, dass Lehrkräfte, ich sag mal, sehr engagiert in ihrem Job sein müssen. Das bedeutet, sie müssen sich aktiv um die Unterrichtsmaterialien kümmern, sie müssen von AppCamps erfahren und so weiter und so fort. Aber mit der zweiten Firma Phobis habt ihr ja den weiteren Schritt, ich sag mal, der Wertschöpfungskette, wenn man jetzt die ganze Sache wirtschaftlich betrachtet, irgendwie bestritten und sagt, okay, wir müssen jetzt aktiver werden, wir müssen jetzt irgendwie direkt in die Schulen rein. Ist das richtig?",
      "start": 1618211,
      "end": 1646095,
      "confidence": 0.7434329896907215,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also sind wir mit AppCamps hier auch, indem wir für Lehrkräfte Unterlagen zur Verfügung stellen, die die in der Schule nutzen, genau. Und mit Vobits. Vobits ist dann gestartet, auch wieder quasi aus dem Neat heraus. Also wir hatten jetzt diese ganzen AppCamps-Unterlagen, wurden dann angefragt, könnte nicht auch Lehrerfortbildungen geben, ne? Dann irgendwie zum Thema Appentwicklung, zum Thema Einstieg in die Programmierung, Calliope und so weiter. Das haben wir dann natürlich auch gemacht, weil wir dachten, super, dann erreichen wir quasi 15 Lehrerinnen und Lehrer, die das dann wiederum mit ihren Kindern im Unterricht machen können. Und auch da haben wir relativ schnell gemerkt, es ist einfach viel zu aufwendig und es lohnt sich auch nicht, so Fortbildungen zu geben, quer durch Deutschland zu reisen für 15 Personen. Und haben gesagt, wir kommen ja aus der digitalen Produktentwicklung. Lasst uns doch einfach mal die Kurse, die wir geben, die Workshops für die Lehrkräfte aufzeichnen und dann könnt ihr das online machen. Und das haben wir auch vor der Pandemie gemacht. Das heißt, wir waren da rechtzeitig dran und es kam von Anfang an auch gut an bei den Lehrkräften. Also wir hatten natürlich auch durch AppCamps die Zielgruppe, die sehr digital affin war, die eben auch schon diese Themen unterrichten wollte. Deswegen war der Start für uns vermutlich gar nicht so schwierig, aber natürlich war es trotzdem eine Herausforderung jetzt, für Lehrkräfte diese Online-Fortbildungen anzubieten. Und wir konnten natürlich so ein paar Themen selbst abdecken, rund um Informatik und so. Aber wir wollten dann auch nicht, dass wir quasi immer den Lehrern erklären, wie es geht. Wir haben gesagt, es gibt so viele tolle Lehrkräfte da draußen, die schon ganz tollen Unterricht machen mit digitalen Medien. Wir haben gesagt, wollt ihr nicht quasi euer Wissen teilen über unsere Technologie, über die Plattform, die wir haben, dass andere Lehrerinnen und Lehrer von euch lernen können. Und so ist die Idee zu FOBITS entstanden, die wir dann vor fünf Jahren, also 2018, haben wir das gegründet. Da haben wir mittlerweile über 250.000 Lehrkräfte, die sich da weitergebildet haben und auch regelmäßig weiterbilden. Auch viel zum Thema Informatik natürlich, aber zu allen möglichen Themen. Da gibt es mittlerweile wirklich alles, auch Achtsamkeit und Sprache und Wie organisiere ich mich als Lehrerin? Und jetzt neuerdings natürlich auch ganz viel zum Thema künstliche Intelligenz. Das ist auch, sehen wir ein riesengroßes Interesse seitens der Lehrkräfte und der Schulen. Und da versuchen wir auch, unseren Beitrag zu leisten.",
      "start": 1646710,
      "end": 1787833,
      "confidence": 0.7982058111380138,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber das ist eine kostenpflichtige Plattform. Also die ist im Gegensatz zu AppCamps nicht kostenlos, sondern kostenpflichtig. Und ihr habt dadurch natürlich auch mehr Möglichkeiten, wahrscheinlich Kontent zu erstellen und Genau.",
      "start": 1787873,
      "end": 1799782,
      "confidence": 0.7428387096774193,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also AppCamps ist als gemeinnützige Organisation gegründet und Fobis ist, ja, eine ganz normale GmbH. Und da ist natürlich immer die Herausforderung, dass wir quasi, ja, genug Geld verdienen, um unser Team zu finanzieren und auch so die Produktentwicklung und die Weiterentwicklung. Wir haben immer viele Ideen. Und wollen natürlich noch ganz viel machen und müssen einfach gucken, dass wir uns da entsprechend finanzieren. Und wir sind auch quasi selbst finanziert. Wir haben das quasi aus dem eigenen Cashflow alles finanziert und haben da kein Geld aufgenommen von externen Geldgebern, um quasi uns zu finanzieren.",
      "start": 1799822,
      "end": 1839113,
      "confidence": 0.8179789473684209,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie groß ist euer Team?",
      "start": 1839453,
      "end": 1840894,
      "confidence": 0.6008333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bei Vogel sind wir 30 Leute.",
      "start": 1841835,
      "end": 1843596,
      "confidence": 0.5875,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, also schon eine Nummer größer.",
      "start": 1844196,
      "end": 1845977,
      "confidence": 0.5073333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja.",
      "start": 1846018,
      "end": 1846058,
      "confidence": 0.05,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In Deutschland erinnere ich mich, dass zumindest für die meisten Schulen ein sogenannter Lehrplan erstellt werden muss und dass die Themen, die in den einzelnen Fächern gecovert werden müssen, ich sag mal, relativ okayisch vorgeschrieben sind. Und jetzt kommst du mit einem relativ modernen Ansatz, KI, Chatship, die wird ja wahrscheinlich auch eine starke Rolle spielen und so weiter und so fort. Überholt ihr da nicht den deutschen Bildungsmarkt oder die Ämter zumindest?",
      "start": 1848155,
      "end": 1873304,
      "confidence": 0.7539178082191782,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also zum einen versuchen wir natürlich mit den Ämtern zusammenzuarbeiten. Das gelingt uns bei einigen sehr gut. Die sehen uns als tolle Unterstützung und Ergänzung. Andere Ämter wollen es lieber selbst machen und sehen uns leider als Konkurrenz, anstatt zu sagen, okay, wir bringen unsere Expertise mit, die bringen ihre Expertise mit und gemeinsam können wir richtig viel schaffen. Aber ganz grundsätzlich machen sich natürlich alle auf den Weg und selbst. Ich meine, das Thema KI, vor allem durch Chat-GPT, ist jetzt ungefähr sechs Monate draußen. Und das hat einfach so, wie sagt man, quasi so viel Verwirrung, Ängste, Überraschung. Also alle Leute waren irgendwie so, wow, okay, jetzt ist irgendwie, da ändert sich ganz viel. Dadurch, dass man jetzt einfach Texte von der KI schreiben lassen kann, was bedeutet das für Hausaufgaben, was bedeutet das für Abschlussarbeiten. vor allem auch im Hochschulkontext. Also ganz, ganz viele interessante Fragestellungen, die da jetzt aufkommen. Und es war klar, dass das auch im Bildungsbereich große Wellen schlagen wird. Und natürlich beschäftigen sich da alle auch die Bildungsministerien mit. Und wir versuchen da einfach gemeinsam mit den Bildungsministerien Lösungen zu finden oder uns bei Unterstützung anzubieten. Weil das Häufige auch nicht, so ein Ministerium, eine Behörde, die sind einfach nicht so schnell und nicht so agil. Und da versuchen wir dann halt zu schauen, ob und wo wir unterstützen können. Und es gibt aber auch einige Landesinstitute, die auf die Lehrerfortbildung zuständig sind, die ganz schnell auch tolle Angebote herausgebracht haben, in Form von Webinaren und Veranstaltungen. Aber was es einfach braucht, sind flächendeckende Fortbildungen für Lehrkräfte, auch nicht einmal, sondern regelmäßig, weil wir sind jetzt einfach in einer Zeit, da passiert so viel in so kurzer Zeit, Und da müssen wir uns alle weiterbilden und vor allem die Lehrerinnen und Lehrer, die so einen wichtigen Job haben, weil die sind dafür verantwortlich, dass die Zukunft, die gerade auf den Schulbänken sitzt, dass die halt gut vorbereitet sind und einen guten Umgang damit lernen. Und deswegen sage ich immer, Lehrkräfte, die haben mit den wichtigsten Job und die müssen halt zum einen gute Arbeitsbedingungen haben und halt auch Zeit bekommen für Fortbildung und Angebote für Fortbildung. Und da braucht es viele Angebote. Und wir haben ein Angebot neben vielen anderen, die eben auch existieren.",
      "start": 1873364,
      "end": 2013736,
      "confidence": 0.8204934383202099,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was ist deine aktuelle Einschätzung? Ich als Österreich habe keine Ahnung über Deutschland natürlich. Aber wie die aktuelle Situation ist bezüglich Ressourcen und Zeit, die den Lehrkräften eingeräumt werden?",
      "start": 2013756,
      "end": 2023523,
      "confidence": 0.8285333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir haben ja gerade, wie glaube ich überall, einen sehr großen Lehrkräftemangel. Und deswegen ist eigentlich viel zu wenig Zeit vorhanden für das Thema Weiterbildung und Fortbildung. Und ich glaube, was es jetzt braucht, ist, wir müssen schauen, wie wir es schaffen, mithilfe der Digitalisierung und der künstlichen Intelligenz Lehrkräfte zu entlasten, zum Beispiel bei administrativen Tätigkeiten. oder schauen, wie können Kinder vielleicht auch noch selbstständiger lernen, was denen ja dann auch mittel- und langfristig viel hilft, weil sie das auch im Arbeitsleben auch brauchen. Und deswegen glaube und hoffe ich, dass sich jetzt durch diese KI-Geschichte, die wir gerade erleben, wirklich ganz viel im Bildungsbereich ändern wird und auch muss, weil jetzt gerade so viel zusammenkommt. Also es kommen so viele Themen, die jetzt in der Schule nötig sind. Es ist ja nicht nur Digitalisierung und KI, es ist auch Inklusion. Es kommen geflüchtete Kinder, die quasi kein Deutsch sprechen. Also so viele Themen in den Schulen. Und da braucht es Unterstützung. Und was wir uns eben nicht leisten können, dass wir jetzt quasi die guten Lehrkräfte, die jetzt noch da sind, dass wir die verkraulen und dass wir denen die Arbeitsbedingungen so schlecht machen, dass die auch keine Lust mehr drauf haben. Deswegen muss man gucken, wie schafft man es. für Lehrkräfte gute Arbeitsbedingungen zu schaffen und denen auch die entsprechenden Tools und die Hilfestellung an die Hand zu geben, dass die einen guten Job machen können.",
      "start": 2024606,
      "end": 2111764,
      "confidence": 0.8061882845188275,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So größenordnungsmäßig, wo liegt denn so ein Zugang preislich, wenn ich als Lehrkraft jetzt dazu komme?",
      "start": 2111784,
      "end": 2117390,
      "confidence": 0.6050625,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir verkaufen zum einen direkt an Lehrkräfte, aber einen Großteil, da bemühen wir uns auch, wir versuchen es immer an die Schulen zu verkaufen oder noch besser an die Bundesländer, also an die Landeslizenzen. Gerne auch in Österreich, wenn du da Kontakte hast, Wolfgang. Und genau, insofern, die Kosten, die sind tatsächlich, also auch pro Person ist es, wenn man quasi jetzt nur die Fortbildungen will, sind es so um die, was sind es, so 15 Euro im Monat. Und du hast Zugang auf 300 Online-Fortbildungen. Es kommen regelmäßig neue dazu. Man hat Live-Webinare. Und was wir jetzt relativ neu haben, ist eben auch, sind die Vogits-Tools, um halt wirklich digitalen Unterricht besser zu gestalten. Und die KI-Assistenz für Lehrkräfte, wo wir so eine Art Chat-GPT nachgebaut haben für Schulen, aber DSGVO-konform. kommt auch super an und es kostet auch nur 10 Euro im Monat. Und im Kombipaket ist es dann auch nicht viel. Also die Kosten sind eigentlich nicht hoch, aber natürlich hat man als Lehrer oder Lehrerin nicht nur ein Tool und nicht nur einen Zugang, sondern mehrere.",
      "start": 2118464,
      "end": 2182653,
      "confidence": 0.7997388888888893,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber haben die überhaupt Budget grundsätzlich? Also gibt es sowas, dass man ein freies Budget hat, über das man verfügen kann oder zahlen das dann LehrerInnen einfach aus ihrer Privatsphäre?",
      "start": 2183334,
      "end": 2192321,
      "confidence": 0.7106999999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, die zahlen das in der Regel privat, aber die Schulen haben zum Teil Budgets. Aber auch hier ist es immer abhängig vom Bundesland. Also ich weiß nicht, wie es in Österreich ist, aber in Deutschland ist es so, einige Bundesländer können frei verfügen und entscheiden, welche Dienste und Tools und Produkte sie sich einkaufen und andere Schulen nicht. Teilweise läuft es über die Schulträger, teilweise läuft es über die Länder. Also wie gesagt, da sind wir auch immer dran zu schauen, wie können wir das den Lehrkräften und den Schulen ermöglichen, das zu nutzen. dass die möglichst keine eigenen Kosten haben.",
      "start": 2192915,
      "end": 2224201,
      "confidence": 0.7811960784313727,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also wenn ich zurückdenke an meinen Informatikunterricht, ich glaube, da hätte ich persönlich diese 15 Euro in die Hand genommen, wenn ich dafür einen sinnvollen Informatikunterricht bekommen hätte damals.",
      "start": 2224605,
      "end": 2234588,
      "confidence": 0.5451724137931034,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und auch wenn ich zurück an meinen Informatikunterricht denke, dann war da immer ein Problem. Und was ich ja faszinierend finde bei euch jetzt, ihr habt angefangen mit Kinderkursen, seid dann irgendwie die Kette hoch und macht jetzt Lehrerbildung. Aber auf der anderen Seite gibt es ja noch das Longtail-Problem der fehlenden Hardware und der fehlenden Ausstattung in den Schulen. Blockiert euch das in eurer Mission? Oder sagt ihr, Covid hat da zumindest in Deutschland, ich glaub, die haben da einen relativ großen Pott an Geld aufgemacht für Hardware-Upgrades oder ähnliches. Und mit, bin mir gar nicht sicher, ob das iPads oder Tablets sind, aber für Computer in den Schulen. Also, seht ihr da auch einen Wandel?",
      "start": 2234628,
      "end": 2270184,
      "confidence": 0.771059829059829,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Absolut. Das ist ja genau quasi der Digitalpakt 1.0 gewesen. Da ging es ja darum, die Infrastruktur erst mal zu schaffen. Und das meinte ich auch vorher, vor der Pandemie wäre sowas wie so ein Glasjet, wo man virtuell jemanden über ein Beamer ins Klassenzimmer bringt, undenkbar gewesen. Und das sehen wir, das kommt an. Natürlich wünscht man sich, dass es alles viel schneller geht. Und natürlich ist es, glaube ich, auch noch nicht überall angekommen. Aber es gibt auch so zum Beispiel in Bremen, hatte ich gerade gestern mit denen gesprochen, Da sind alle Lehrkräfte und alle SchülerInnen ab Klassenstufe 1 mit iPads ausgestattet. Also das gibt es schon und dann überlegen die, was können die damit machen, wie nutzen die das. Die haben da einen ganz guten Zugang gefunden. Aber es ist natürlich auch von Bundesland zu Bundesland wieder unterschiedlich. Aber es passiert auf alle Fälle was und das ist erfreulich.",
      "start": 2271033,
      "end": 2319870,
      "confidence": 0.794,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In der Tat, das freut mich sehr. Ich weiß jetzt nicht, wie die Grundschule in meinem lokalen Dorf hier ausgestattet ist. Müsste ich, glaube ich, mal am Wochenende nachfragen. Du hattest gerade JetGPT und KI erwähnt und Softwareentwicklung und generell die ganzen MINT-Fächer, Mathematik, Informatik, Naturwissenschaften und Technik, können ja sehr abstrakt sein. Wo siehst du die Chancen von KI und JetGPT, um diese abstrakten Themen zugänglicher für Kinder zu machen?",
      "start": 2320280,
      "end": 2345914,
      "confidence": 0.740957746478873,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Naja, da gibt es viele Möglichkeiten. Also was wir zum Beispiel auch haben, also mit unserer Phobits KI-Assistenz können zum einen Lehrkräfte sich Inspiration holen, die können sich Unterrichtspläne entwickeln lassen, die können sich Arbeitsblätter erstellen lassen, aber die können auch so eine Art virtuelles Klassenzimmer öffnen, zu dem sie ihre Kinder einladen, ohne dass sie sich registrieren müssen. Und dann gibt es zum Beispiel, gerade für den MINT-Unterricht ist das ganz beliebt, die Möglichkeit, mit Albert Einstein, Marie Curie, also mit wirklich Leuten aus dem Bereich zu chatten, Fragen zu stellen, sich über deren Forschung zu unterhalten. Es steht natürlich dabei, es ist eine künstliche Intelligenz, aber das kommt trotzdem super an. Also das ist ganz, ganz schön zu sehen. Sowas ist zum Beispiel möglich. Oder halt auch den Kindern zu sagen, sie sollen mal ein Thema selbst erarbeiten mit der künstlichen Intelligenz und hinterher mit den Unterlagen der Lehrerin zum Beispiel zu vergleichen, weil, das ist natürlich ganz wichtig, die KI, die sagt nicht immer nur die Wahrheit. Teilweise sind dann halt auch Fehler drin. Aber das heißt nicht, dass man es deswegen nicht nutzen soll, sondern das heißt, dass es deswegen ganz unbedingt in die Schule muss und eben begleitet, angeleitet werden. muss. Und halt die Lehrkräfte müssen das Ganze halt, ja, unterstützen, aufklären, mit den Kindern durchgehen, zeigen, wo die KI vielleicht noch nicht so gut ist, aber was sie auch schon gut kann, Use Cases rausfinden. Dann muss man eben lernen, wie kann man einen guten Prompt schreiben, eine gute Anfrage, um ein gutes Ergebnis zu bekommen. Also ich glaube, das kann ganz spannend sein, mit der KI im Unterricht zu arbeiten. Und wir sehen ja auch, ne, über unsere KI-Assistenz, die wir den Schulen zur Verfügung stellen, dass es schon viele Lehrkräfte machen und auch ganz begeistert Du hattest.",
      "start": 2346461,
      "end": 2450270,
      "confidence": 0.8043114754098362,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auch gerade den richtigen Promptschreiben angesprochen und Softwareentwicklung ändert sich natürlich auch mit GitHub Copilot und was da nicht alles gibt. Erziehen wir da oder geht die Bildung dann nicht eher in Richtung Promptengineering anstatt Softwareengineering?",
      "start": 2450290,
      "end": 2464319,
      "confidence": 0.8186388888888889,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Boah, das ist eine gute Frage. Ich glaube auch, dass sich für Softwareengineering sehr viel ändern wird. Also das war ja immer so, es ist nach wie vor ein ganz gefragter Beruf, aber ich glaube auch da, diejenigen, die eben gut mit diesen Co-Piloten und KI arbeiten können, die werden Riesenvorteile haben in allen Bereichen. Also irgendjemand hat mal den Spruch gesagt, man muss keine Angst haben, von der KI ersetzt zu werden, sondern von jemandem, der gut mit der KI arbeiten kann. Und insofern weiß ich nicht, ob ihr auch schon selbst viel mit der KI arbeitet, aber ich glaube, das wird schon auch nochmal ganz schön viel, hoffentlich irgendwie zum Positiven auch wandeln, dass man einfach noch schneller ist, dass man weniger Fehler macht und so weiter.",
      "start": 2464359,
      "end": 2509968,
      "confidence": 0.819565891472868,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber glaubst du dann, dass auch dieses ganze logische Denken weniger wichtig wird in Zukunft?",
      "start": 2509989,
      "end": 2514932,
      "confidence": 0.773,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, das glaube ich nicht. Und auch das Wissen ist nicht weniger wichtig, weil man muss ja immer noch die Sachen beurteilen und einschätzen können. Und auch, also im Prinzip, es reicht ja nicht aus, nur zu schreiben, ich will eine Webseite, mit dem man den Inhalt, sondern man muss das ja ganz strukturiert und analytisch angehen, man muss den Prompt richtig formulieren. Man muss quasi mit der KI arbeiten und interagieren, um ein gutes Ergebnis zu bekommen. Deswegen glaube ich nicht, dass man dann weniger logisches und analytisches Denken braucht. Aber wie sich das alles genau entwickeln wird, das wissen wir, glaube ich, alle noch nicht. Ist sehr spannend.",
      "start": 2515360,
      "end": 2550443,
      "confidence": 0.8067727272727273,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dieses Thema analytisches Denken und Logik ist ja auch bei uns in der Community natürlich sofort ein Thema gewesen. Vor allem die Eltern haben natürlich gefragt, okay, wie kann ich denn meine Kinder dieses Thema näher bringen, vor allem vielleicht vor der Grundschule oder in der Grundschule, wenn es die Schule nicht macht. Hast du da irgendwelche Tipps, außer dass man natürlich deine zwei Bücher sich zulegen sollte, wie man in die Richtung irgendwie gehen kann?",
      "start": 2551432,
      "end": 2574243,
      "confidence": 0.7993552631578948,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, also meine Bücher, die sind tatsächlich noch nicht für Vorschule, sondern die starten so mit Elternbetreuung ab acht, neun Jahren und selbstständig dann vielleicht eher zehn, elf. Ansonsten, da kenne ich mich ehrlich gesagt nicht aus, wie man analytisches, logisches Denken frühzeitig quasi unterstützen kann. Da gibt es ja ganz viele Bücher und Knobeleien und so weiter. Da gibt es diese Blöcke, die man kaufen kann, wo man so ein bisschen Rätsel lösen muss. Ich glaube vermutlich so oder einfach mit Kindern spielen. Spiele sind da sicherlich auch hilfreich.",
      "start": 2574509,
      "end": 2605859,
      "confidence": 0.768055555555556,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin ja selber fünffacher Onkel, kein Vater jetzt, aber wenigstens fünffacher Onkel und davon vier Nichten. Und ich hatte immer so diesen Need, dass ich die versuchen muss, irgendwie in die Technik reinzubringen und in das ganze logische Denken. Und das war mir irgendwie ein Anliegen. Jetzt, wo sie älter sind, ich habe es bei keiner geschafft, leider. Aber vielleicht bin ich eben auch das falsche Vorbild gewesen. Vielleicht ist einfach die Vorbildwirkung das, was besser ist. Und zwanghaft irgendwas zu erreichen oder mit Druck ist sowieso, glaube ich, meiner Meinung nach immer ein großer Fehler.",
      "start": 2605919,
      "end": 2637707,
      "confidence": 0.7535463917525774,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, zum einen das und zum anderen muss man halt auch überlegen, es sind so viele Einflüsse, die eben einwirken auf die Nichten. Und man kann immer so versuchen, was im Beitrag zu leisten. Aber letztendlich leben wir in einer Gesellschaft, die bestimmte Rollenmodelle zeigt, die bestimmte Erwartungen hat an bestimmte Personen oder Rollen. Und deswegen finde ich es gut, wenn man da irgendwie überlegt, was man tun kann. Aber letztendlich ist es ja auch nicht für jeden geeignet. Nicht alle müssen hinterher Informatikerin oder Programmiererin werden. Zum einen. Und es kann ja auch sein, dass die später noch den Zugang finden. Ich hatte auch, das ist eine Weile her, die Hamburgi Cats mal gegründet hier in Hamburg, um einfach so Frauen zusammenzubringen aus der IT oder Frauen, die sich dafür interessieren. Und da hatte ich gesehen, dass sehr viele, die so quasi irgendwie jetzt, ich sag jetzt mal so ein sprachlichen, sozialwissenschaftlichen Studiengang gemacht hatten, dann ihren ersten Job hatten und dann gemerkt haben, eigentlich hätten sie gern mehr Tech-Kompetenzen und überlegt, wie können sie das jetzt noch bekommen. Also so Anfang 20, Mitte 20 war bei vielen dann nochmal so, okay, wie kann ich mir das jetzt noch aneignen? Und da gibt es ja mittlerweile auch tolle Möglichkeiten mit Bootcamps und später noch quasi Programmieren zu lernen und auch, wenn die dann am Ende nicht als Programmiererin arbeiten. Einige haben es wirklich durchgezogen, aber selbst, wenn man dann quasi nur das Wissen noch hat und dann wieder, jetzt sag ich mal, in den Marketing- oder Produktmanagementbereich geht, ist es super hilfreich, dieses Wissen zu haben. Insofern ist es, glaube ich, auch heutzutage so, dass man sich auch zu späteren Zeitpunkten immer noch in verschiedene Themen einarbeiten kann.",
      "start": 2638400,
      "end": 2734450,
      "confidence": 0.797103806228373,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube es wird auch in ganz vielen Jobs immer wichtiger und auch wenn du einen ganz nicht technischen Job hast, hast du viel mehr Kontakt natürlich mit Tools und musst vielleicht auch das eine oder andere kleine Skript oder sowas zumindest in irgendwie eine logische Abfolge schreiben oder so, dass dir dann vielleicht in deinem normalen Job hilft. Was mich immer fasziniert ist, gefühlt zumindestens, also ich habe leider keine Statistiken, wäre eigentlich mal ganz interessant, dass Kinder von Ärztinnen immer irgendwie in die gleiche Richtung einschlagen, aber bei IT-Eltern ist es oft umgekehrt, dass die Kinder dann eher nicht in die IT gehen oder in den technischen Bereich. Keine Ahnung, ob das abschreckend ist und das andere vielleicht so der Idealberuf oder als Idealberuf angesehen wird, aber gefühlt kommt mir zumindest vor, dass das immer bei Ärzten gut funktioniert und bei IT-Eltern eher schlechter.",
      "start": 2735012,
      "end": 2786602,
      "confidence": 0.8130342465753423,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe jetzt auch keine Statistiken dazu, aber ich habe zwei sehr gute Freundinnen, die mit mir studiert haben und bei denen war jeweils der Vater auch, nee, sogar drei. Drei von meinen Freundinnen aus dem Studium, die hatten jeweils einen Vater, der Informatiker war. Und da hat es funktioniert anscheinend. Insofern, also wie gesagt, ich kenne keine Studien und keine Zahlen. Ich glaube, es ist mal so, mal so, aber ja.",
      "start": 2787402,
      "end": 2809690,
      "confidence": 0.7896944444444445,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt dreht sich die ganze Geschichte ja natürlich auch darum, den Kindern diese Informatik und die MINT-Bereiche irgendwie näher zu bringen. Wenn wir die Frage jetzt aber mal umdrehen, was sind denn Elemente beziehungsweise No-Gos, die die Kinder eher abschrecken würden für die MINT-Berufe? Also ich meine, ich gehe stark davon aus, dass ihr auch diverse Erfahrungen gemacht habt. Was sind denn so die Elemente, wo man sagt, das sollte man am besten irgendwie vermeiden, wenn ich jetzt ein Elternteil bin oder Lehrer vielleicht.",
      "start": 2810976,
      "end": 2839546,
      "confidence": 0.7783333333333333,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Weiß ich jetzt auch nicht genau, aber ich glaube ganz grundsätzlich, also wie wir es schon eben hatten, also nicht zwanghaft, nicht mit Druck. Ich glaube, es ist einfach wichtig, die passenden Unterlagen für die Kinder zu haben. Also das, was jetzt nicht nur so sehr theoretisch angeht. Und ja, aber ansonsten denke ich immer lieber so, okay, wie schafft man es, das quasi auf eine tolle Art und Weise zu vermitteln und dann einfach zu gucken, wie funktioniert das und kommt das an? Man muss natürlich auch sagen, jeder Mensch ist unterschiedlich und nicht jeder mag das gleiche Tool und die gleiche Herangehensweise. Und das ist ja auch ein Problem. dass man in Schulen häufig große Klassen hat und natürlich nie allen gerecht werden kann. Deswegen ist es immer so, wenn möglich, dass man den Kindern möglichst viele Freiheiten gibt, sich selbst einzuarbeiten und die Kinder dabei unterstützt auf ihrer Reise sozusagen. Und ich glaube, das wäre so mein Ansatz.",
      "start": 2839920,
      "end": 2893402,
      "confidence": 0.8069503105590061,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und die Kinder von heute wachsen ja viel mehr mit Technik auf als ich zumindestens. Ich bin schon 1987, das bedeutet, was ich gemacht habe, ich glaube, ich habe noch Kassetten zurückgespult, wenn ich mich um Kassetten mit dem Bleistift erinnere. Und du hattest gerade gesagt, dass es eine Schule in Bremen gibt, die, glaube ich, ab Klasse 1 dann schon mit einem Tablet arbeiten.",
      "start": 2894108,
      "end": 2913437,
      "confidence": 0.7286153846153844,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Alle in Bremen. Bremen ist komplett ausgestattet.",
      "start": 2913477,
      "end": 2918219,
      "confidence": 0.7195714285714284,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da muss ich mal mit dem Duisburger Bürgermeister irgendwie sprechen. wie bewahrt man denn Kinder davor, falsche Vorstellungen von dem ganzen Thema zu haben? Weil sie wachsen ja von Grund auf jetzt mit GPT-3- und 4-Modellen auf, und Chat-GPT, und dann an Dolly und so zur Imagegenerierung und so weiter und so fort. Und die Bedienung von hochoptimierten Apps. Ich meine, du warst selbst Produktmanagerin bei Zing. Also du weißt, wie viel Arbeit da reinsteckt in Bedienung und UI und UX und Co. Und wie bewahrt man denn Kinder davon, falsche Vorstellungen zu haben bezüglich der Bedienung und der Entwicklung solcher Systeme? Weil das sind ja schon zwei verschiedene Baustellen.",
      "start": 2918239,
      "end": 2954686,
      "confidence": 0.7731181818181819,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, das ist eine total wichtige Frage. Und also ganz grundsätzlich heißt es ja nicht, wenn die Kinder jetzt alle ausgestattet sind mit Geräten, dass die automatisch digital kompetent sind. Und das ist ja genau der Ansatz, was ja auch, was uns wichtig ist, dass wir nicht nur AnwenderInnen haben, sondern dass wir auch Leute haben, die mal hinter die Kulissen blicken und die verstehen, was bedeutet es denn, eine App zu entwickeln. Was bedeutet es denn, Daten in der Datenbank zu speichern? Wenn ich hier meine Daten eingebe, dann sind die in der Datenbank im Zweifel für immer und ewig. Und deswegen finden wir es auch so wichtig, dass man eben nicht nur AnwenderInnen ausbildet, sondern auch quasi EntwicklerInnen, dass die halt verstehen, so ein bisschen mehr technisches Verständnis auch haben. Und ich glaube, das Gleiche mit Fake News und so weiter. Wenn man mal verstanden hat, zum Beispiel mit Dali, was du jetzt eben genannt hast, wie einfach man Bilder erstellen kann. Das ging jetzt auch durch die Medien mit dem Papst und mit Trump und so weiter. Wenn man das mal erlebt hat und vielleicht selbst gemacht hat, dann versteht man, dass es eben Fake News geben kann und dass man vielleicht Dinge ein bisschen kritischer hinterfragen muss. Ich glaube, deswegen sind das jetzt also diese ganzen Kompetenzen, die schon immer wichtig waren, so jetzt zusammengefasst als Medienkompetenz oder digitale Kompetenzen, die werden jetzt in Zukunft noch viel wichtiger werden, wenn die Tools einfacher zugänglich sind, um solche Fake News oder auch solche Daten zu erstellen.",
      "start": 2954770,
      "end": 3044904,
      "confidence": 0.811976833976833,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Inwieweit passt ihr denn eure Aufgaben und Tests von diesen Lernmaterialien an, wenn man jetzt die KI zur Hand hat? Denn ich kann mich noch an früher an den Deutschunterricht erinnern, schreibe bitte eine Zusammenfassung von diesem Text. Ich meine, das macht ChatGPT, glaube ich, deutlich besser, als ich jemals konnte. Oder es gibt auch diese News-Meldung, dass GPT-4, glaub ich, irgendein Harvard-Law-Test, der auf Multiple-Choice basiert, bestanden hat. Also, somit fallen ja diese Art von Aufgaben mehr oder weniger jetzt raus. Also, inwieweit müssen denn jetzt die Aufgaben, die in Schulen gestellt werden, denn wirklich abgeändert werden, damit man vielleicht noch eigene Denkleistung bringt und die KI vielleicht ... Ist Austrix das richtige Wort? Weiß ich nicht, aber du weißt, was ich meine.",
      "start": 3045144,
      "end": 3089677,
      "confidence": 0.8127338709677423,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also das ist auch eine sehr gute Frage, die gerade schon sehr viel diskutiert wird in der Bildungslandschaft. Weil wie du schon gesagt hast, es gibt jetzt bestimmte Aufgaben, die kann man mit der KI super einfach erledigen. Und ich glaube, Was jetzt wichtig werden wird, ist, dass es nicht mehr so stark um das Endergebnis geht, sondern mehr um den Prozess und um den Weg dahin. Und das ist vielleicht auch in drei Jahren vollkommen klar, man kann die KI als Werkzeug und Hilfsmittel nutzen, wie wir auch mit Taschenrechnern arbeiten heutzutage, dass dann aber alle eben die gleichen Chancen, den gleichen Zugang haben und auch, was ist eine Kompetenz, die KI gut anzuwenden und einzubinden, um zu einem guten Ergebnis zu kommen. Und ich glaube, da werden jetzt ja, viele neue Ideen entstehen. Ich glaube, aktuell ist es so, dass natürlich die mündliche Leistung, wenn ich jetzt was präsentiere, da kann ich mich natürlich vorbereiten mithilfe der KI, aber die tatsächliche mündliche Leistung, die muss ich jetzt als Mensch noch erbringen. Und insofern bin ich auch gespannt, wie sich das ganze Prüfungswesen ändern wird. Ich weiß, das ist jetzt gerade, ich glaube, vor zwei Tagen oder vor wenigen Tagen hat Hamburg eine Pressemitteilung rausgegeben, das geplant ist, dass man KI auch zukünftig quasi in der Oberstufe, vielleicht sogar im Abitur irgendwie teilweise verwenden darf. Deswegen im Abitur bin ich mir gerade nicht ganz sicher, aber auf alle Fälle, dass man die KI zukünftig auch nutzen darf. Und das finde ich natürlich sehr spannend und interessant und da zu gucken, wie sich das jetzt alles noch entwickeln wird.",
      "start": 3090371,
      "end": 3179174,
      "confidence": 0.7936951672862455,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das bedeutet auch, ich hatte in meinem Studium, ich habe ein Bachelor in Wirtschaftsinformatik gemacht und da gab es so Open-Book-Klausuren. Da durfte ich dann irgendwie ein Buch mitnehmen, weiß ich nicht, in Informatikrecht oder IT-Recht. Also das bedeutet jetzt, TGPT und die KI wird jetzt der neue Taschenrechner, den ich auch im Matheunterricht dabei habe. Chachipiti wird in Hamburg dann vielleicht auch Teil dieser Open Book Klausur? Habe ich das so richtig verstanden?",
      "start": 3179466,
      "end": 3201247,
      "confidence": 0.7088378378378379,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Kann ich mir gut vorstellen. Ich glaube auch, da wird es hingehen, weil ehrlicherweise die Technologie ist da. Die wird besser werden. Und wir müssen einfach lernen, mit der Technologie zu arbeiten. Und ich sage immer, das ist so eine Art Erweiterung des Gehirns. Und warum soll ich quasi ohne die Technologie lernen, ohne die Technologie die Prüfungsleistungen ablegen? Und dann gehe ich ins Studio oder in den Job und da arbeite ich selbstverständlich damit. Also deswegen, warum nicht jetzt schon anfangen, das frühzeitig in die Schule einzubinden, den Kindern einen guten Umgang beizubringen und quasi die KI, wie gesagt, als Werkzeug zu betrachten, das uns mittelfristig viel Arbeit abnehmen wird.",
      "start": 3201287,
      "end": 3238775,
      "confidence": 0.8104954954954955,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das bedeutet dann aber auch, dass Elemente des Journalismus, wie zum Beispiel Faktencheck und Co. ja deutlich wichtiger werden. Weil ich meine, die KI lernt ja auch nur auf Basis der Large-Language-Models. Alles das, was im Internet halt so rumkursiert. Und wenn da ziemlich viele Fake-News rumkursieren, dann muss man schon sagen, hey, das war nicht richtig und das war, kannst du nochmal gucken.",
      "start": 3239035,
      "end": 3258881,
      "confidence": 0.8134374999999999,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, absolut. Wird wichtiger werden.",
      "start": 3259161,
      "end": 3261302,
      "confidence": 0.6,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hattest gerade gesagt, dass natürlich so Elemente wie Präsentations-Skills und Co.",
      "start": 3261672,
      "end": 3265316,
      "confidence": 0.7611666666666667,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Wichtiger werden.",
      "start": 3265336,
      "end": 3265956,
      "confidence": 0.8685,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Früher haben wir das immer als Soft-Skills markiert. Ich denke eher, das sind jetzt doch schon Hard-Skills. Hast du auch so das Gefühl, dass das dann mehr die Hard-Skills werden, weil JetGPT dann den Content liefert? Oder ist das schon zu weit gegangen?",
      "start": 3265996,
      "end": 3276567,
      "confidence": 0.7969767441860462,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, ich glaube, das wird immer wichtiger werden. Aber wie gesagt, ich weiß nicht, wie sich auch quasi die Prüfungsleistungen und Prüfungen verändern werden und inwieweit man dann quasi mit der KI arbeitet und der Prozess wichtig ist. Ich glaube, wir müssen ganz viel von dem, wie wir bisher gelernt und gelehrt haben, überdenken und anpassen an die neue Realität.",
      "start": 3276875,
      "end": 3298090,
      "confidence": 0.8263500000000004,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie wichtig siehst du denn den Menschen noch in dem ganzen Bild? Also gerade in der Bildung und Lehrerkräftemangel und so weiter. Aber es war ja auch zu meinen Uni-Zeiten zum Beispiel, wie ich unterrichtet habe, schon ein großes Thema. Wie viel macht man bei Video? Wie viel kann man mit Massenunterricht sozusagen machen? Wie viel brauchst du noch dem persönlichen Kontakt? Jetzt haben wir JetGBD und die Large Language Models, die vielleicht automatisch den individuellen Kurs-Content für mich persönlich individuell zusammenstellen. Braucht man den Mensch noch? Was ist denn da deine persönliche Meinung vielleicht?",
      "start": 3298590,
      "end": 3333913,
      "confidence": 0.7983263157894738,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Absolut, weil also im Prinzip genau das ganze soziale, emotionale, den Austausch darüber, die Reflexion, die sollte natürlich mit der Lehrperson und innerhalb der Klasse stattfinden. Und ich glaube, das hat man auch während der Pandemie gemerkt, als die Schulen geschlossen waren, wie wichtig der soziale Austausch ist und wie das eben gefehlt hat. Deswegen glaube ich, dass sich die Rolle der Lehrkraft stark ändern wird. Und natürlich würde immer noch quasi, das Wissen ist immer noch wichtig, um das alles einzuordnen, aber die reine Wissensvermittlung wird vielleicht ein bisschen weniger werden und mehr dieses Coaching, das Begleiten, Gruppenanleiten, vielleicht mehr hin zu so einem Lerncoach und weniger Wissensvermittler, was es ja jetzt teilweise noch ist.",
      "start": 3334732,
      "end": 3380332,
      "confidence": 0.831905172413793,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie kann man sich denn in das ganze Thema einbringen, finanziell oder mittels Zeitinvestment oder als Organisation?",
      "start": 3380552,
      "end": 3388835,
      "confidence": 0.8781764705882354,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, also man kann natürlich spenden an Organisationen, die gemeinnützig sind. Da gibt es ja viele Anbieter, auch neben App-Camps, die natürlich immer dankbar sind. Wobei man natürlich in der Regel auch, braucht man größere Summen, um eine Organisation wirklich am Leben zu halten. Das heißt, da ist man dann eher auf Stiftungen oder auf große Companies angewiesen, die so ein CSR-Budget haben, Corporate Social Responsibility. Und ansonsten kann man sich natürlich als Elternteil oder auch als engagierter Entwickler, Entwicklerin einbringen, indem man halt schaut, welche Organisationen suchen Volunteers, um zum Beispiel mal ins Klassenzimmer zu gehen und Hands-on-Coding zu unterrichten. wie zum Beispiel mit der Hacker School oder bei uns kann man mal bei den Glass Chats mitmachen. Und dann gibt es immer die Code Week, die ist immer im Oktober, das ist auch eine ganz tolle Sache, da dreht sich zwei Wochen lang alles rund um Coding und Informatik und da kann man Workshops anbieten. Genau, also wer sich dafür interessiert, muss glaube ich nur ein bisschen googeln. Ich weiß nicht, ob ihr Shownotes habt, ich kann euch ein paar Links schicken.",
      "start": 3389430,
      "end": 3455650,
      "confidence": 0.7969891304347828,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich packen wir alles in den Shownotes.",
      "start": 3455950,
      "end": 3457671,
      "confidence": 0.40085714285714286,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, da kann man dann sich informieren. Und ansonsten kann man als Eltern natürlich auch AGs anbieten. Das sind gerade Grundschulen häufig sehr dankbar, wenn die dann irgendwie im Nachmittagsangebot auch eine Coding-AG haben oder eine Spieleprogrammieren-AG oder vielleicht auch bald mal eine KI-AG.",
      "start": 3458367,
      "end": 3475870,
      "confidence": 0.7862500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann ich als Elternteil auch irgendwie bei mir in der lokalen Schule nachfragen, ob die bereits mit FOBIS zusammenarbeiten, weil ich selbst Informatiker bin und daran Interesse habe, dass das weiter gestreut wird? Oder sagst du, da sind wir schon dran, wir versuchen halt über die Länder an die Schule zu kommen?",
      "start": 3476925,
      "end": 3493856,
      "confidence": 0.7858846153846154,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nee, absolut. Also gerne immer von Fobitz auch erzählen von den Angeboten, die wir haben. Wir haben auch viele Angebote, die erst mal kostenfrei sind, um das auszuprobieren, weil wir sagen ja auch zum einen zu den Lehrkräften, aber zu den Schulen, wir wollen denen nichts verkaufen, was denen nichts bringt. Aber die meisten sind begeistert und wenn die Budget haben, dann nutzen die es auch sehr gerne. Aber natürlich gerne auch Lehrkräfte, Schulen darauf.",
      "start": 3494136,
      "end": 3517244,
      "confidence": 0.8089999999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ansprechen, Und du hattest gerade kurz diese Glasschats von App Camps angesprochen. Muss man dafür irgendwelche Skills mitbringen? Also muss man da irgendwie Lehrer sein oder reicht auch, Quote und Quote, ich bin Quereinsteiger oder ähnliches?",
      "start": 3517304,
      "end": 3529268,
      "confidence": 0.7738055555555557,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also die Glasschats, die finden ja virtuell statt. Das heißt, ihr könntet an einem Glasschat teilnehmen. Das heißt, das läuft so, ich bin jetzt eine Lehrerin, ich habe eine achte Klasse und ich unterrichte Informatik oder auch was anderes. Kann auch was anderes sein. Und ich sage, ich habe Lust, mal jemanden einzuladen. Dann melde ich mich, beschreibe es so ein bisschen und bei mir passt es immer gut, Dienstag um 11 Uhr habe ich quasi eine Stunde mit der Klasse. Und dann gucken wir, wer kann Dienstag 11 Uhr für die Wünsche, die diese Lehrerin hat, wer ist da geeignet? Und dann gibt es ein Matching und dann würdest du einmal mit der Lehrerin sprechen und einen Termin ausmachen. und die Lehrerin bereitet es mit ihrer Klasse vor und dann kommst du quasi jetzt virtuell über Zoom oder BigBlueButton ins Klassenzimmer, stellst dich kurz vor. In der Regel gibt es eine kurze Präsentation, aber da gibt es auch Vorlagen von uns. Es soll aber auch gar nicht so lang sein und dann haben die Kinder in der Regel schon Fragen vorbereitet und es ist wirklich immer ganz, ganz großartig. Und meistens in weiterführenden Schulen, aber wir hatten auch schon Grundschulen, die das ganz toll gemacht haben und die ganz tolle Fragen gestellt haben.",
      "start": 3529308,
      "end": 3587858,
      "confidence": 0.7666121495327097,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich bin so ein bisschen baff, weil wenn man aus der Schule raus ist, dann hat man das gar nicht mehr so im Blick. Und wenn man selbst keine eigenen Kinder hat, dann hat man das gar nicht mehr so im Blick, was da wirklich im Bildungswesen oder so fast so im lokalen Bildungswesen so abgeht. Und du hast mir schon irgendwie Lust gemacht, dass ich jetzt selbst wieder mit Scratch oder App Inventor irgendwas mache. Super! Vielen lieben Dank, Diana, dass du dir die Zeit genommen hast, zu uns im Engineering-Kiosk zu kommen. Ich habe auf jeden Fall eine ganze Menge mitgenommen über die Bildung, App-Cams, Phobis und was da überhaupt mit KI im aktuellen Bildungswesen so abgeht und dass gegebenenfalls, so habe ich das noch nie gesehen, Chat-GPT und KI der neue Taschenrechner wird. Das finde ich ja so eine schöne Metapher. Vielen Dank! Hast du noch ein paar letzte Worte für die Hörerinnen und Hörer?",
      "start": 3588272,
      "end": 3628535,
      "confidence": 0.7214240506329113,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Nee, ich glaube, ich habe genug geredet. Ich wollte mich nur bedanken bei euch für die Einladung. Ich finde es ganz großartig, dass ihr auch mal so ein Thema in eurem Podcast unterbringt. Und genau, also alle, die neugierig sind, die Fragen haben, schaut gerne auf unseren Webseiten, erzählt gern davon und meldet euch. Auch bei LinkedIn bei mir zum Beispiel, da schreibe ich viel zu dem Bereich. Und genau, weiterhin viel Erfolg euch mit eurem Podcast.",
      "start": 3628795,
      "end": 3652110,
      "confidence": 0.8192467532467531,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielen, vielen Dank. Wir verlinken natürlich alles in den Shownotes. Super, danke. Bis bald, tschüss!",
      "start": 3652130,
      "end": 3658564,
      "confidence": 0.5465333333333332,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.7880924780802944,
  "audio_duration": 3678.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
