{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/5809e7ab-403c-4f95-ae21-b7b0b1f2128a/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62zf06ms5t-52d9-4bd6-bd81-5bd7c3a77ea0",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Wenn man sich so die öffentlichen Jobanzeigen ansieht, erkennt man recht schnell, dass nur Senior Engineers gesucht werden. Doch wie sieht es eigentlich mit dem Nachwuchs, den Junior Engineers, aus? Wo finden Personen mit keiner oder wenig Berufserfahrung einen Platz in der Softwareentwicklungsbranche? In dieser Episode sprechen wir über das Potenzial von Junior Engineers, wie man die Motivation von Kandidaten in Interviews erkennt, welche Rolle persönlicher Bias und strukturierte Interviews spielen, Welche Möglichkeiten gibt es Juniors und Juniors hoch zu coachen, welche Balance an Erfahrung man innerhalb eines Teams halten sollte und wie teuer Recruiting eigentlich wirklich ist. Und das alles gespickt mit persönlichen Geschichten. Wir springen direkt rein. Viel Spaß!",
      "start": 3809,
      "end": 43829,
      "confidence": 0.8329729729729727,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir haben ja kurz überlegt, ob wir irgendwie anders anfangen sollen, aber ich glaube, wir sind schon alle so gewöhnt, dass wir immer anfangen mit Andi und dann eine Frage stellen.",
      "start": 46254,
      "end": 52985,
      "confidence": 0.7358387096774195,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also bitte.",
      "start": 53445,
      "end": 54427,
      "confidence": 0.8115,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Andi, weißt du, was auf dich heute zukommt?",
      "start": 54467,
      "end": 56510,
      "confidence": 0.7238749999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe keine Ahnung. Normalerweise sieht unsere Podcast-Vorbereitung so aus. Einer hat eine Idee. Der andere macht ein Dokument auf, macht so eine Art Braindump und dann wird recherchiert und sein Wissen dazu gepackt und irgendwie eigene Storys noch rausgeholt. Heute muss ich zugeben, sagte der Wolfgang zu mir, wir machen mal was anderes, ich mach da was. Und ich sitze jetzt gerade vor einem leeren Dokument, damit ich mir wenigstens Notizen machen kann.",
      "start": 56550,
      "end": 80686,
      "confidence": 0.7899864864864865,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Brauchst du nicht, brauchst du nicht. Also es ist ein neues Sommerformat, das wir einfach mal ausprobieren. Und ich habe mich jetzt so zurückerinnert an die ursprüngliche Idee, die wir eigentlich hatten mit dem Podcast, als wir gesagt haben, okay, wir reden recht oft miteinander und diskutieren über Dinge und vielleicht nehmen wir das einfach auf und publishen das und vielleicht interessiert es auch jemanden. Und darum habe ich mir mal überlegt, okay, vielleicht können wir einfach mal ein Thema bearbeiten, das nur eine Seite kennt und du hast ja sehr viel erlebt und sehr viel drin in deinem Kopf. oder du kannst auch einfach als interview.",
      "start": 80726,
      "end": 110195,
      "confidence": 0.7273831775700935,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sehen jetzt bin ich gespannt um welches das thema es geht was nur einer von uns im kopf hat sehr wahrscheinlich wie wie vertikultiert und düngt und kalkmann seinen rasen richtig, oder wie baut man den luftfilter eines aufsichtsrasenmeers neu ein und.",
      "start": 110235,
      "end": 124381,
      "confidence": 0.8398333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du glaubst ich kann das nicht oder so du bist bei der feuerwehr täglich.",
      "start": 124401,
      "end": 128181,
      "confidence": 0.5167857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ihr habt leute dafür, Ist ganz interessant.",
      "start": 128241,
      "end": 130321,
      "confidence": 0.7975714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Feuerwehr macht das auch nicht mehr selber, die Bürosfeuerwehr, das wird alles ausgelagert. Heutzutage wird alles nur mehr ausgelagert, outgesourced.",
      "start": 130341,
      "end": 136106,
      "confidence": 0.6774285714285715,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sag ich ja.",
      "start": 136527,
      "end": 137127,
      "confidence": 0.4523333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auf jeden Fall ist dieses Thema so entstanden, dass ich ja ganz kürzlich das Engineering Kiosk Alps Meetup veranstaltet habe, das erste Mal. Also ein Ableger von unserem Podcast als Meetup in den Alpen bei uns in Innsbruck.",
      "start": 137168,
      "end": 150682,
      "confidence": 0.8274473684210527,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Glückwunsch erstmal. Finde ich wirklich gut.",
      "start": 151122,
      "end": 154266,
      "confidence": 0.6153333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wir hatten da zwei coole Speaker, zwei coole Themen. Einerseits wie man eine große Developerfirma mit 500, 600 Developern ohne Hierarchie am Leben erhält oder ob das überhaupt möglich ist. Und der zweite Talk war auch super interessant, da ist es darum gegangen, was man denn so alles erlebt als Einzelkämpfer, als Backend-Einzelkämpfer, wenn man die PAM-App online bringt. Also kennst du ja sicher, Andi, du als Fitness-Freak, die bei Mailer Reif, die hat so eine App und hatte am ersten Tag schon irgendwie eine Million Downloads. Und da hat der Entwickler, der Backend-Entwickler, der das gesamte Backend programmiert hat, hat eben aus dem Alltag erzählt, wie Schwierig das war, wie schnell sie gehackt worden sind, ihre API und was nicht alles schief gelaufen ist und war ein super interessanter Vortrag.",
      "start": 154306,
      "end": 199300,
      "confidence": 0.8213333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Moment mal ganz kurz, du willst mir sagen von dieser Fitness Influencerin Pamela Reif, die hat jetzt eine eigene App und eine Person hat den kompletten Backendstack gebaut.",
      "start": 199340,
      "end": 208693,
      "confidence": 0.7782857142857144,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So wie ich das verstanden habe schon, ja, Frontend sind schon zehn Leute oder so irgendwas, die App an sich, aber den gesamten Backend-Stack mit Authentifizierung und User-Verwaltung und Notifications und Schlag-mich-tot, was da nicht alles geht, das ist scheinbar eine Person, ja, zumindest die Infrastruktur und alles macht eine Person.",
      "start": 209113,
      "end": 226590,
      "confidence": 0.8046470588235294,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Infrastruktur wird auch von dieser einen Person maintained.",
      "start": 226970,
      "end": 229172,
      "confidence": 0.7565555555555554,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, auf AWS, aber ja. Und darum hat er an seinem Alltag erzählt. Und genau um diese Person geht's, weil Adit heißt er übrigens, kommt aus dem Kosovo und war halt gerade in Innsbruck, weil die Firma dort auch einen Standort hat. Und dann sind wir so ins Gespräch gekommen. By the way, falls jemand mal in der Umgebung Innsbruck ist oder so, ganz Deutschland macht ja auch gerne Urlaub in Tirol, bitte einfach melden, wer einen Talk hat, kann ja vielleicht in Innsbruck vorbeischauen auf unserem Meetup.",
      "start": 229272,
      "end": 253680,
      "confidence": 0.77775,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man macht Urlaub, Wolfgang. Im Urlaub dich treffen zerstört den Urlaub.",
      "start": 254240,
      "end": 259082,
      "confidence": 0.6811818181818181,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es sind ja nicht alle so wie du. Auf jeden Fall hab ich dann mit dem Audit so ein bisschen gequatscht. Und dann sind wir irgendwie auf Trivago zu sprechen gekommen. Und da sie bei Trivago gearbeitet haben, hat er gesagt, ja, er kennt einen von Trivago, ein Kollege, der mit ihm studiert hat. Und Trivago hat ja damals so irgendwie 1800 Leute gehabt. Also meistens kennt man diese Person ja sowieso nicht. Aber er hat mir dann den Namen verraten. Und derjenige war bei mir im Team und er wurde dann sogar mein Nachfolger. Also wie ich Trivago verlassen habe, wurde er einer von den zwei Nachfolgern und ist dann zum Team Lead aufgestiegen und ist mittlerweile bei Amazon gelandet. Und dann habe ich mal so zurückgedacht und dann ist mir eingefallen, dass dieser Entwickler durch deine Hände gegangen ist und von dir eingestellt wurde. Damals als quasi frisch von dem Studium weg, direkt in Trivago.",
      "start": 259122,
      "end": 307098,
      "confidence": 0.7867515923566877,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist korrekt, aber das hört sich irgendwie fett an Wirtschaft gerade.",
      "start": 307420,
      "end": 310341,
      "confidence": 0.23641666666666664,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und so ähnlich war es auch mit Adid, weil ich gehört habe, der ist direkt von dem Studium zu dieser Firma und die sind super happy, weil er einfach ein super Senior mittlerweile geworden ist, eben die ganze App alleine gestemmt hat und aber auch als Student direkt eingestiegen ist. Und ich finde das ja total super, wenn man dann so sieht, okay, die Leute, die frisch von der Uni sind, eingestiegen sind in das Business, schnell in so eine seniorrolle gewachsen sind mittlerweile dann bei firmen wie bei amazon landen oder solche coolen talks dann halten auf einem meetup warum suchen eigentlich alle firmen nach seniors und meine frage jetzt ganz konkret an dich warum hat hattest du damals so frischlinge eingestellt Und ich kenne euch noch einen anderen Case, eine Frau, die mittlerweile bei Datadog arbeitet, auch von dir eingestellt wurde, direkt quasi aus dem Studium raus und mittlerweile auch sehr weit in dem ganzen DevOps-Bereich ist und bei Datadog in einem sehr wichtigen Team ist. Und jetzt meine frage warum hast du das immer gemacht andere hiring manager waren da eher auf der senior seite und alle suchen ja meistens seniors warum hast du diese juniors eingestellt hast du einfach keine seniors gefunden.",
      "start": 310381,
      "end": 380330,
      "confidence": 0.8223106796116508,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn du das so erzählst hab ich so das gefühl ich würde mich irgendwie selbstständig machen mit irgendeiner art bootcamp geschichte und dann mit allen big tech firmen kollaborieren und sagt mal, Fördert mich einfach für fünf Jahre und dann kriegt ihr die Top Leute, Amazon, Datadog, Trackrecord hier. Aber ich habe das Gefühl, das wäre so ein bisschen Art wie Menschenhandel.",
      "start": 380370,
      "end": 398644,
      "confidence": 0.7213225806451613,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es war gut. Ich habe damals bei deinen Teams schon die Leute abgegriffen für meine Teams. Der war ja dann auch bei mir. Ich war total happy. Und die Leute sind jetzt in super Positionen und geben Talks. Also das ist ja eigentlich das Idealbild, was man immer vermittelt. Man bringt die Leute durch Motivation so weit, bis sie dann eben selbst diese Seniorstelle ausfüllen.",
      "start": 399265,
      "end": 420562,
      "confidence": 0.8277846153846156,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Naja, fangen wir mal vorne an. Ich denke, es ist völlig ungesund für die Firma und für das Team und für die Abteilung, wenn man immer nur Seniors hat. Unabhängig von der Diversität. Ich denke, man sollte eine gesunde Balance zwischen Junior-Engineers, Middle-Engineers Senior Engineers haben und die Balance geht dann natürlich noch weiter, wenn man Karrierelevel wie Staff oder ähnliches hat.",
      "start": 421482,
      "end": 446618,
      "confidence": 0.7951129032258064,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was siehst du da als Balance an? Also wie, wenn du jetzt so sagst, okay, ganz junge, was ist erfahrene? Siehst du da dann 50-50 oder ist es dann 80-20? Was verkraftet ein Senior an Juniors, wenn du es so sehen willst?",
      "start": 447238,
      "end": 461888,
      "confidence": 0.7275581395348838,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also gehen wir mal von einem 10-Mann-Team aus. Da würde ich halt so sagen, man hat einen maximal zwei Staff, also so Art technischer Lead und so weiter, so wirklich, wirklich, wirklich erfahrene Leute. Einen maximal zwei bei zehn, wo ich bei zwei schon hmm bin, aber könnte man auch noch machen. Dann circa drei bis vier Seniors und zwei bis drei Middle Engineers, also ein Level unter Senior und dann zwei Juniors. Das ist so eine gesunde Balance meines Erachtens nach in einem gut performanten Team.",
      "start": 461948,
      "end": 493326,
      "confidence": 0.7805172413793103,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn du jetzt zurückdenkst an diese Situation, wo du die zwei eingestellt hast, wie war dein Team aufgestellt?",
      "start": 494060,
      "end": 501003,
      "confidence": 0.7897222222222222,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir hatten damals nicht direkte Titel, wir hatten weniger Juniors als Seniors. senior leute und ich denke du solltest auch einen überhang haben einfach aus folgenden gründen a ist immer jemand krank und immer jemand in urlaub b gehört das meines erachtens nach zum wachstum von senior und staff leuten junioren zu mentoren und zu coachen und sich mit denen hinzusetzen und die ganze thematik wie arbeitet man richtig wie bricht man große projekte in kleine aufgaben und so weiter was für debug techniken gibt es und co dass man sich einfach zusammen hinsetzt und das erarbeitet aber ich denke es ist auch unglaublich wertvoll die ich sag mal in anführungszeichen wo jeder denkt das sind dumme fragen von den zehn von den juniors an die Seniors zu stellen und die Senioren kriegen dann einfach mal die Frage, ja aber warum ist das denn so? Und sie haben es ihr Leben lang so hingenommen und überdenken es dann mal, weil diese Art von Fragen, dieses Wissbegierige und einfach dieses Hinterfragen, weil Leute es gar nicht wissen, dass das schon seit 20 Jahren so ist, bringt die Leute zum Nachdenken und auch wirklich zu guten Lösungen.",
      "start": 501043,
      "end": 569990,
      "confidence": 0.8269282051282052,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich sage ja immer, Juniors haben die Freiheit, die dummen Fragen zu stellen und Leads haben die Pflicht, die dummen Fragen zu stellen.",
      "start": 570310,
      "end": 577712,
      "confidence": 0.8453478260869562,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist auch sehr schön, aber das gehört halt dazu, weil es gibt so eine kleine Story aus der Uni und die habe ich, glaube ich, schon mal hier im Podcast erzählt, ich bin mir nicht ganz sicher. Als ich studiert habe, ich habe ja neben dem Beruf studiert, das bedeutet, ich habe oft abends in irgendeiner Unibibliothek gelernt.",
      "start": 577752,
      "end": 592496,
      "confidence": 0.7558135593220338,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Neben deiner Arbeit, wo du Filter gewechselt hast von irgendwelchen Rasentraktoren.",
      "start": 592516,
      "end": 596437,
      "confidence": 0.8140000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, da war ich noch in einer Webagentur und hab Typo 3 Content Management Systeme für deutsche Großkonzerne gebaut. Auf jeden Fall habe ich mir besonders bei so Themen wie Volkswirtschaftslehre und BWL 1 und BWL 2 und so weiter, das waren halt alles nicht so meine Steckenpferde, da musste ich mir halt immer den kompletten Kontext reinziehen, damit ich halt auch, ich sag mal so Verbindungsbrücken bauen kann. Und dann habe ich immer so ganz crazy fragen gestellt was das eine thema denn jetzt mit dem thema aus dem letzten semester zu tun hat weil oft baut ja bw l eins auf bw l zwei auf und dann gibt es dann halt so sowas wie den euribor der treibt dann zum beispiel den europäischen zins und so weiter inflation und. Ne, allem drum und dran. Dann hab ich immer so Verbindungsbrücken gebaut, und dann hab ich diese Fragen immer laut gesagt, und irgendwann saßen zwei, drei, vier Leute neben mir, auch aus meiner Lerngruppe, und irgendwann wuchs diese Lerngruppe, weil die Leute irgendwie verstanden haben, wenn die diese Kontexte zwischen diesen Themen, die vielleicht auch gar nicht immer so klausurrelevant sind, verstehen, dann müssen sie sich das nicht auswendig lernen, sondern dann verstehen die das ganz große Bild dahinter. Und somit sind halt einfach die Klausuren deutlich einfacher zu schreiben. Ich meine, warum erzähle ich die Story? Genau so ist das nämlich bei Junioren. Die stellen einfach die Fragen, weil die die Kontexte haben wollen. Warum bauen wir denn jetzt zufälligerweise die REST-API-Endpoint so, genau wie die Tabellenstruktur unserer Datenbank in MySQL oder in PostgreSQL? Muss das denn so sein? Weil viele REST-APIs sind so aufgebaut. Das ist einfach nur eine JSON-Repräsentation über HTTP von dem Datenbankschema. Kann richtig sein, je nach App. Jetzt nehmen wir mal die PAM-App, die du angesprochen hast. Weiß ich jetzt nicht, ob das jetzt so richtig ist. Oder ob es nicht sinnvoller wäre, sich über die Use-Cases, wie man die REST-API nutzt, Gedanken macht. Und dass man dann hinten dran im Backend wirkliche Joins macht und mehrere Tabellen gleichzeitig darstellt oder, oder, oder. Und all das wird durch solche Fragen getriggert.",
      "start": 596917,
      "end": 706356,
      "confidence": 0.8057039106145247,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie hat denn damals dieses Team von dir das eigentlich gesehen, dass du teilweise so junge Leute ins Team bringst und vielleicht auch aggressiv förderst, vielleicht auch mehr förderst als andere Leute im Team? Hat es da irgendwie Probleme gegeben oder mal Stimmen, warum machst du mit den Jungen mehr als mit uns oder so in diese Richtung?",
      "start": 707116,
      "end": 727994,
      "confidence": 0.8445517241379312,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, sowas gab's da jetzt nicht, aber ich muss auch sagen, ich hab ja nicht alles selbst gemacht. Also erstens, ich bin ja nie der Klügste im Raum. Viele Leute sagen ja auch, du musst nicht der beste Entwickler sein, um Teamleiter zu sein. Solltest du eigentlich auch nicht, glaub ich.",
      "start": 728354,
      "end": 739019,
      "confidence": 0.727921568627451,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bist du selten, ja?",
      "start": 739059,
      "end": 740180,
      "confidence": 0.44225000000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ich einfach gemacht hab, ich hab die ganzen Leute einfach mit eingebunden, weil ich kann halt auch nicht die ganze Arbeit machen. Und hab ich gesagt, so, ihr beide setzt euch jetzt zusammen und ihr löst das Problem. Ihr seid da beide für verantwortlich. So ein bisschen in das kalte Wasser geworfen. Natürlich kam dann ab und zu mal beim One-on-One von den Leuten, weil die haben das dann auch noch nie gemacht, die haben auch noch nie jemanden hochgecoacht. Der eine oder andere hat vielleicht mal schon mal ein paar Workshops gehalten, was dann nicht das gleiche ist, aber ist schon ähnlich. Jedoch war es für andere Leute dann auch recht neu. Und natürlich, nach den ersten ein, zwei Sessions kommt so eine Art ... Frustration möchte ich nicht sagen, aber Akzeptanz, dass das doch nicht ganz so einfach ist. Weil man muss sich halt ein bisschen anders ausdrücken. Du kannst halt nicht kontinuierlich mit Fachwörtern um dich schmeißen, wie als wenn ein Staff-Engineer mit einem Senior spricht. Die sprechen ja auf einer Geschwindigkeit mit ganz vielen Fachwörtern, wo unglaublich viel Grundwissen da ist. Das ist natürlich bei junioren natürlich nicht der fall da muss man es natürlich anders erklären gegebenfalls ein bisschen mehr ausholen man darf aber nicht zum anderen extrem gehen und dass man so eine art mansplaining macht dass man immer alles jedes kleinste detail erklärt und man hält die andere person für dumm das geht natürlich auch nicht.",
      "start": 740200,
      "end": 803062,
      "confidence": 0.7644467213114751,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn wir gerade beim Mansplaining sind, du hast ja eben auch eine ganz junge Frau damals eingestellt, die mittlerweile bei Data Talk ist und auch sehr viele Talks in ihrer ganzen Zeit gehalten hat und auf einigen Bühnen unterwegs ist, würde ich mal sagen. Und die war ja von ihrer Persönlichkeit auch sehr outgoing und dass sie eben gerne Talk macht auf einer Bühne. Hat es da irgendwo Probleme gegeben im Team? War ja damals ja meines Wissens auch die einzige Frau und in dem ganzen Backend-Bereich, Devops-Bereich noch härter womöglich, war das ja doch irgendwie neu. Wir sprechen da jetzt von 1996 ... 96. Von 2016. Damals waren ja eigentlich ganz allgemein noch sehr, sehr wenige Frauen eigentlich in der Devwelt von Trivago.",
      "start": 803402,
      "end": 846703,
      "confidence": 0.843733870967742,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wieso würdest du sagen, dass Devops und Infrastruktur härter ist als ... Im Vergleich zu welcher Abteilung? Softwareentwicklung?",
      "start": 846743,
      "end": 853105,
      "confidence": 0.8198888888888889,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, zu dieser Zeit zumindest waren einfach automatisch irgendwo mehr Frauen in Richtung Frontend-Product-Teams. Da waren eher Entwicklerinnen drin oder die paar Einzelnen, die wir hatten, waren eigentlich eher in dem Bereich. Kann auch Zufall gewesen sein, aber in dem Fall war es ja eigentlich so. Wir hatten das ja dann auch später geändert oder zumindest versucht.",
      "start": 853615,
      "end": 876245,
      "confidence": 0.8277894736842106,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sie war auf jeden Fall zu dem Zeitpunkt, glaube ich, die einzige Dame in meinem Team. Ich hatte auch mal einen Zeitpunkt, da hatte ich zwei Damen in meinem Team. Aber ich muss sagen, es war sehr hilfreich, dass sie eine sehr starke Persönlichkeit hatte. Und was meine ich damit? Ich meine damit, dass sie einfach gar kein Problem hatte, die Stimme gegenüber anderen Leuten und auch erfahrenen Entwicklern zu heben. Und sie sagte halt, okay, ich fühle mich hier, weiß ich nicht, sie hat halt viel öfter probleme angesprochen wir hatten zum beispiel einmal in der woche irgendwie so team meetings und sie war halt schon ein treiber dafür dass wir viele sachen geändert haben und sie war auch sehr sehr sehr wissbegierig was was super war das bedeutet all diese education und und dieses kann mir das mal jemand zeigen sie hat das auch wirklich eingefordert, was super war. Es war natürlich schon ein bisschen fordernd für die ganzen Hähne im Korb, weil normalerweise hattest du da natürlich in der reinen Männerrunde, da geht's halt ein bisschen kräftiger zu ab und zu, was nicht immer positiv ist. Aber ich denke, schon allein das, was immer jemand erzählt bezüglich der Diversität, das war schon spürbar. Und sie hat eine deutlich angenehmere Phase eingeleitet, nenn ich's mal. Weil ab und zu, also, die Hähne wurden auch irgendwann mal ruhiger, muss man auch zugeben.",
      "start": 877107,
      "end": 949372,
      "confidence": 0.8105708154506439,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber du hattest nie die Kritik oder so bekommen, dass du sie förderst, weil sie eine Frau ist oder sowas in der Richtung?",
      "start": 950193,
      "end": 957139,
      "confidence": 0.7613043478260871,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nö, aber ich habe ja auch, nein, weil ich hatte auch Junioren, also männliche Junioren habe ich auch eingestellt.",
      "start": 957199,
      "end": 962583,
      "confidence": 0.8498421052631578,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber es ist ja oft das Problem in dem Fall zum Beispiel, dass sie halt dann eben in der ganzen Firma bekannt war, sie hat Talks gegeben, Kommunikation war super. Das heißt, man hat so das Gefühl, sie wurde vielleicht extra gefördert oder ist halt nur bzw. hätten vielleicht manche dieses Gefühl haben können, dass sie eben nur gefördert wurde, weil sie eine Frau ist und dadurch vielleicht an die Position gekommen ist mit den ganzen Talks und so weiter. Mir ist klar, dass es nicht so ist. Wir hätten sie übrigens auch klarerweise gerne eingeladen für sowas, hätte ich sehr cool gefunden, aber sie ist leider nicht deutschsprachig in dem Fall, ist ein bisschen schwieriger. Aber es wurde dir also nie vorgeworfen?",
      "start": 963306,
      "end": 1000155,
      "confidence": 0.8052983870967741,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, mir wurde das nie aktiv vorgeworfen und aus meiner Sicht muss ich auch sagen, das Geschlecht ist mir auch völlig egal.",
      "start": 1000615,
      "end": 1006479,
      "confidence": 0.8209545454545455,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jaja, das eine ist ja, was man selber denkt und das andere ist, was andere denken.",
      "start": 1006499,
      "end": 1010502,
      "confidence": 0.8055000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist korrekt. Ich hätte gerne auch mehr Frauen im Team. Jetzt zum Beispiel habe ich keine einzige Dame in meinem Team. Sowas wurde mir jetzt noch nie entgegengebracht.",
      "start": 1011150,
      "end": 1017835,
      "confidence": 0.7295999999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Umso cooler eigentlich. Spricht für dein Team.",
      "start": 1018716,
      "end": 1022558,
      "confidence": 0.6914285714285714,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe darüber aber auch nie so wirklich nachgedacht. Und ich meine, was ist da für eine Argumentation hinter? Damit ich sagen kann, ich habe ein diverses Team. Also ich meine, ist das wirklich divers, wenn man neun Männer und eine Dame hat? Ist das divers? vielleicht diverser als andere DevOps-Teams, ich weiß es nicht. Aber das ist ja bei langem nicht divers. Keiner kann sich damit ... Jemand, der ein diverses Team ansteuert, der das als Ziel hat, der kann ja nicht sagen, ich hab jetzt eine Dame und jetzt bin ich divers. Das funktioniert ja auch nicht. Ich habe aber auch damals, gebe ich ja auch zu, gar nicht aktiv nach einer weiblichen Administratorin oder Site-Reliability-Ingenieurin gesucht, weil sie war halt eine der Bewerber. Und ich fand das Profil interessant und die Motivation und die Historie und auch das, was sie schon vorher getan hat. Denn, Achtung, man muss ja auch sagen, bevor ich sie eingestellt habe, war sie schon auf einer Python-Konferenz als Speakerin und zur Vorbereitung des Interviews. habe ich mir diesen Talk dann auch reingezogen, um natürlich auch in die Richtung zu gehen, weil da muss ich jetzt auch zugeben, gab es natürlich auch persönlichen Bias, weil ich habe zu der Zeit natürlich das Web-Engineering-Meetup Düsseldorf gemacht, das bedeutet, ich war natürlich schon sehr auf dieser Kommunikationsschiene, auf dieser Public-Speaking-Schiene und bin zu der Zeit auch ziemlich viel unterwegs gewesen auf Konferenzen, das bedeutet, da muss ich schon zugeben eigentlich, wenn man da jetzt mal so nüchtern drüber nachdenkt, war das vielleicht gar nicht so richtig, dass ich meinen persönlichen Bias da eigentlich freien Lauf gelassen habe, obwohl das natürlich im Endeffekt sehr glücklich ausgegangen ist, aber innen drin hatte sie vielleicht schon einen kleinen Pluspunkt, weil sie das gleiche, weil sie die gleiche Art und Weise hatte mit Public Speaking wie ich, das weiß ich nicht.",
      "start": 1022598,
      "end": 1118781,
      "confidence": 0.8159583333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wobei, ich muss ja sagen, wir haben das, glaube ich, auch schon mal mit Hiring besprochen. Natürlich suchst du dir Pluspunkte raus aus einem CV. Und wenn da drinsteht, jemand hat ein Open-Source-Projekt programmiert oder ist Speaker auf irgendeiner Konferenz, dann sind das natürlich schon irgendwie Pluspunkte, bei mir zumindest. Das Problem wäre ja nur, wenn du plötzlich Minuspunkte geben würdest, wenn jemand sowas nicht macht. Also Pluspunkte ist ja okay, solange du das nicht als negativ wertest, wenn jemand kein Open-Source-Projekt hat oder kein Speaker war auf einer Konferenz. Und es kommt natürlich auch darauf an, wen du suchst für dein Team. Wenn du jemanden suchst, der vielleicht gut kommunizieren kann, dann ist das natürlich auch ein Beweis, dass der oder diejenige halt einfach gut ist in dem Bereich oder vielleicht sprechen kann oder besser sprechen kann und dann natürlich noch eher ein Fit ist für die Position, die du suchst.",
      "start": 1119412,
      "end": 1167322,
      "confidence": 0.8139868421052631,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man muss aber auch dazu sagen, zu dieser Zeit hatten wir keine strukturierten Interviews bei Trivago. Natürlich hatten wir so eine Art Fragenkatalog, aber ich habe sehr viel, das traue ich mich gar nicht jetzt zu sagen, weil das hört sich immer irgendwie so fast verboten an.",
      "start": 1167922,
      "end": 1180567,
      "confidence": 0.8335744680851065,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir sind ja unter uns, kannst du mir schon erzählen.",
      "start": 1180607,
      "end": 1182668,
      "confidence": 0.45439999999999997,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe schon sehr viel aus dem Bauch heraus entschieden, aber auch über Jahre hinweg, weil ich denke halt, dass viele Elemente, die man in strukturierten Interviews nicht so gut rausfiltern kann, wie zum Beispiel die Frage, wie passt diese Person ins Team und wenn du dein Team dann im Kopf hast, Du weißt, welche Persönlichkeiten du da hast, dann suchst du ja eine Persönlichkeit, eine Persönlichkeitsart, die etwas unterrepräsentiert ist, um das Team halt möglichst breit aufzustellen. Und ein strukturiertes Interview kann sowas in der Regel ja nicht liefern. Deswegen habe ich sehr viel aus dem Bauch heraus entschieden und da ging es halt auch sehr viel um die Motivation dahinter. Warum macht jemand was? Was hat diese Person vorher gemacht?",
      "start": 1183078,
      "end": 1222147,
      "confidence": 0.8229098360655738,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wobei das ja nicht immer schlecht sein muss meiner Meinung und ich rück halt schon wieder an, um dich zu verteidigen die ganze Zeit, ich mach das eigentlich viel zu viel, aber in dem Fall muss ich dich auch verteidigen, weil das war natürlich eine Zeit bei Trivago, wo wir einstellen könnten, so viel wir wollen haben. Das war jetzt nicht, wir haben eine Position und da bewerben sich hunderte Leute drauf und dann müssen wir eine Person auswählen, sondern wenn da eine gute Person dabei war, einstellen, wenn die nächste Person gut war, drei Tage später auch einstellen. Also wir hatten da natürlich weniger Need da überhaupt zu vergleichen. um die beste Person zu finden, sondern der Auftrag war eigentlich gute Personen zu finden und sobald eine gute dabei war, haben wir eigentlich schon ein Angebot gemacht. Also wir hatten da natürlich einen gewissen Luxus und dann kann man da natürlich auch anders arbeiten, was natürlich auch sehr gut ist.",
      "start": 1222687,
      "end": 1269223,
      "confidence": 0.8202422360248447,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja gut, aber meine Hiringstrategie mit diesem aus dem Bauch heraus hat sich ja jetzt auch in der neuen Firma, also in einer anderen Firma, nicht Trivago, nicht viel geändert. Ich hatte ein strukturiertes Interview, hab's natürlich immer noch und ich muss natürlich auch diverse Punkte abklappern, das ist halt einfach so. Aber ich fokussiere mich bei dem strukturierten Interview auf die wesentlichen Teile und dann zwitsch ich immer auf dieses Bauchgefühl und dann kommen wir mal wirklich ins Gespräch und weg von dieser Frage-Antwort-Session, sondern wirklich in ein bidirektionales Gespräch, damit ich versuche herauszufinden, wer ist eigentlich die Person dahinter.",
      "start": 1269815,
      "end": 1299482,
      "confidence": 0.7921188118811882,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wie machst du das jetzt in so einem Interview, auch wenn du sagst, du bist motivierte Leute und auch diese Juniors, du hast ja geschafft, irgendwie Juniors auszuwählen, die immer super motiviert waren. Wie hast du denn das ausgewählt? Also hast du da irgendwie Fragen gestellt oder was hast du für Fragen gestellt, um herauszufinden, ob jemand motiviert ist und sich eignet eben für genau diese Art der Arbeit in deinem Team, also die Selbstständigkeit, aber vielleicht auch, dass man sich halt schnell weiterentwickelt und so weiter?",
      "start": 1300463,
      "end": 1328821,
      "confidence": 0.7976022727272725,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also es gibt so ein paar Grundregeln, die ich für mich gesetzt habe. Ich lasse mich zum Beispiel nicht von komplizierten Algorithmen oder super tollen Whiteboard-Interviews beeindrucken. Ich finde das toll, wenn jemand das kann und so eine hohe Lernfähigkeit hat, aber ich bin eher...",
      "start": 1329142,
      "end": 1343830,
      "confidence": 0.7562222222222224,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Dazu müsstest du ja mal überhaupt das verstehen von diesen Whiteboard-Interviews, oder?",
      "start": 1343870,
      "end": 1348032,
      "confidence": 0.6915000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich gucke jetzt mal nach links und ich habe hier so ein großes dickes grünes Buch, was habe ich mir bestellt und das wollte ich auch mal durcharbeiten, habe es aber noch nie gemacht und es nennt sich Cracking the Coding Interview. Ich weiß nicht, ob du das kennst, das ist diese Bibel für diese Whiteboard Interviews.",
      "start": 1348487,
      "end": 1360709,
      "confidence": 0.71919298245614,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich, Klassiker. Aber auch nie gelesen.",
      "start": 1360729,
      "end": 1364170,
      "confidence": 0.8876666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber es steht im Schrank und es sieht gut aus. Auf jeden Fall, ich war im Algorithmus nie stark, aber ich lasse mich von sowas auch nicht beeindrucken, weil ich denke mir, es gibt super viele Genies draußen, es gibt aber auch super viele Genies, die einfach ganz brutal Arschlöcher sind, kein Teamwork machen und immer denken, alles das, was ich alleine mache, ist eh das Beste.",
      "start": 1364210,
      "end": 1380488,
      "confidence": 0.7367500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber genau das ist ja auch das Schwierige bei Juniors, dass du ja viel weniger auf die Erfahrung und so weiter gehen kannst, sondern eben auf die Motivation und die Bereitschaft zu lernen. Und da ist halt meine Frage, wie findest du es heraus?",
      "start": 1380988,
      "end": 1392096,
      "confidence": 0.8502045454545456,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ich eigentlich immer bei Interviews mache, und das ist meines Erachtens auch die Stärke bei Juniors, ich stelle nicht die Fragen, sondern ich lasse die andere Person, nämlich die Bewerberin oder den Bewerber das Interview leiten und ich gebe nur eine Kickerfrage.",
      "start": 1392156,
      "end": 1405546,
      "confidence": 0.8391395348837208,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie zum Beispiel? Mit Kickerfrage meinst du jetzt keine Fußballfrage?",
      "start": 1405586,
      "end": 1408949,
      "confidence": 0.5304,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, keine Fußballfrage, sondern eher sowas wie, erzähl mir doch mal, was du gemacht hast, worauf du richtig, richtig stolz bist. Oder, was war das Beste, was du im letzten Jahr gelernt hast? Einfach mal so Einstiegsfragen, wo die Leute wirklich was aus ihrem Leben erzählen können, wo die sagen können, okay, ich hab da so und das gemacht, weil in der Regel sind das Events, die die freiwillig gemacht haben. die nicht von irgendjemandem aufgedrückt wurden, so wie mach das, schreib ne API oder ähnliches, sondern das, was die aus ihrer intrinsischen Motivation gemacht haben. Und von da aus kommen die Leute dann in das Storytelling. Oder so eine klassische Frage ist auch, was willst du mal werden, wenn du groß bist? Und dann sagen die halt oft irgendwie was anderes als ein Software-Ingenieur. Und dann frage ich weiter, was blockt dich denn, das jetzt zu tun? Und so weiter und so fort. Weil im Endeffekt möchte ich wissen, warum sitzen die hier? Warum machen die den Software-Engineering-Job? Und wo haben die die Stärke? Sind die wirklich hundertprozentig technikverliebt? Oder sehen die das, jetzt kommt wieder der persönliche Bias, sehen die es genauso wie ich, dass die Technik zwar kompliziert ist, aber nicht die Herausforderung, sondern die Menschen? Das sagen die nicht so, aber viele Leute, besonders im jungen Alter und gerade im Berufseinstieg, die haben vielleicht noch nicht so ganz das klare Bild, dass die Technik das Komplizierte ist. Man muss ja auch sagen, und das hört sich jetzt total dreckig an, Das tolle an Juniors, beziehungsweise an motivierten Juniors ist, du kannst sie shapen, weil die sind noch nicht so eingefahren. Viele Leute, die schon 10, 15, 20 Jahre im Berufsalltag sind, die sind unter Umständen eingefahren. Das haben wir schon immer so gemacht. Pass mal auf, Donald Knuth hat damals gesagt, REST-APIs schreiben wir so und so, und Clean Code muss das gemacht werden, und du darfst keine multiple Return Statements haben. Und Achtung, GoTo ist auch ganz schlimm, ja?",
      "start": 1408969,
      "end": 1507335,
      "confidence": 0.7962215568862283,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hat Donald Knuth gesagt, aber Rest APIs hat Donald Knuth noch nicht verbrochen gehabt. Aber okay, lassen wir mal gelten.",
      "start": 1507855,
      "end": 1515657,
      "confidence": 0.6334285714285715,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oder GoTo ist ein ganz böses Statement und darf nicht verwendet werden. Bla, bla, bla. Das mag alles richtig sein, aber es kommt immer jemand, der wusste das nicht und hat's dann einfach gemacht. Von daher ist es ja nun mal so, dass du für ein erfolgreiches Team auch ab und zu neue Ansätze brauchst. vielleicht ja wie du sagtest jemanden der einfach sich traut die in anführungszeichen dummen beziehungsweise ich nenne die nicht dumm sondern offensichtlichen frage zu stellen du kennst das ja wahrscheinlich man sitzt mit sechs leuten im meetingraum jemand erzählt was einer hebt die hand stellt eine frage und alle anderen sind erleichtert dass diese frage gestellt wurde weil sie haben sich einfach nicht getraut zu fragen und das passiert halt dann regelmäßig Und dadurch sage ich ja.",
      "start": 1515697,
      "end": 1555078,
      "confidence": 0.7845681818181818,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Immer als lied muss man die dummen fragen stellen weil wenn sich niemand die fragen stellen traut dann musst du das lied einspringen und dich einfach dumm stellen womöglich und einfach nachfragen.",
      "start": 1555098,
      "end": 1563562,
      "confidence": 0.81728125,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber die die dieses dieses schäpen wovon ich spreche dass das passiert ja nicht während des hirings das passiert ja in den 101 sessions natürlich werden die 101 sessions bei berufseinsteigern ich sag mal enger getaktet, weil man muss halt schon gucken okay das was man im interview gesehen hat ist das dann auch da und wenn nicht, Wie kann man mit der Person richtig zusammenarbeiten? Und welche Stärken hat diese Person? Und wohin möchte die Person sich entwickeln? Möchte sie die nächste Tech Lead werden? Oder gibt es irgendwelche Ambitionen, vielleicht mal in fünf Jahren Product Owner zu werden? Hatte ich auch schon sehr viel, dass Software-Engineers immer Product Owner werden wollen. Und das bedarf ja ganz anderer Stärken. Auf jeden Fall, das ist halt diese Bauchgefühl-Geschichte. Ich lass die Personen immer erzählen, weil wenn diese Person wirklich von etwas begeistert ist, Boah, das hört sich jetzt wie ein Floskel, aber ich versuch immer in irgendeiner Art und Weise, dieses Feuer in den Augen zu sehen. Und deswegen hab ich mir auch diesen PyCon-Talk, sie war auf einer PyCon, wenn ich mich recht erinnere, 45 Minuten lang diesen Talk vor dem Interview hab ich reingezogen. Weil ich wusste, okay, das ist goldener Content, weil ich frage, warum bist du da auf die Bühne gegangen? Was hat dich dazu motiviert, jetzt etwas über ... Ich weiß gar nicht mehr, um was es da im Interview ging, über List Comprehension in Python zu reden. Also warum machst du das? Weil jeder kann sagen, okay, wenn ich auf einer PyCon bin, List Comprehension, das kennt ja jeder. Dennoch wurde Talk angenommen und Co. Also warum tut jemand sowas? Und ich möchte das, das, das Warum dahinter verstehen, weil ich denke schon, dass das sehr viel über einen Menschen aussagt. Macht das Sinn?",
      "start": 1563602,
      "end": 1660191,
      "confidence": 0.7899633333333335,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auf jeden Fall. Und diese Frage habe ich auch immer gern gestellt. Was ist das coolste Projekt, was du je gemacht hast? Kann auf der Uni oder so gewesen sein, gar kein Problem. Oder vielleicht sogar außerhalb der Tech-Welt bekommt man ja hin und wieder auch Antworten, um einfach so die Motivation zu spüren, ob jemand überhaupt motiviert sein kann. Und ich glaube, diese Frage war eine sehr beliebte Frage auch unter anderen Hiringmanagern. und Interviewen habe ich die eigentlich sehr oft gehört oder irgendwo mitbekommen. Und ich würde sogar sagen, dass das eigentlich weniger ein Bauchgefühl ist, sondern das ist eigentlich eine strukturierte Frage. Weil du hast eine strukturierte Frage, du wirst herausfinden, kann jemand motiviert sein? Natürlich ist dann die Entscheidung am Ende irgendwo bauchgetrieben, ist jemand wirklich motiviert? Aber du gehst schon sehr strukturiert an das Ganze heran und probierst es auch strukturiert dann bei den verschiedenen Kandidatinnen zu erfassen und rauszubekommen. Also ich würde sagen, das ist eigentlich kein Bauchgefühl.",
      "start": 1660231,
      "end": 1712608,
      "confidence": 0.804878048780488,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das weiß ich jetzt auch nicht, aber was ich halt schon mache, ist, immer wenn du mal so ein Training zu Recruiting gemacht hast, dann sagt dir jeder, ja, du sollst dich mindestens 30, 45, 60 Minuten vor dem Interview vorbereiten und so weiter. Und das ist doch alles richtig, weil ich denke, umso mehr du dich vorbereitest, umso effizienter wird auch das Interview. Was ich halt immer mache, wenn ich ein CV kriege und ich hab ein Interview, ich schmeiß erst mal Google an. Also ich gucke erst mal ein paar soziale Profile nach, Ich gucke auf GitHub nach, dann schaue ich mir die Repositories an, was diese Person so contributed hat. Vielleicht ist hier irgendwo Core-Contributor, weiß ich jetzt nicht. Oder vielleicht diskutiert diese Person auf Hacker-News oder auf Reddit sehr viel und dann schaue ich, in welchen Subreddits. Also, ich hole mir schon so ein paar Informationen, damit ich halt so ein bisschen Content habe, um genau diese Motivationsroute, die ich gerade so beschrieben habe, runterzugehen. Ist das Stalking? Nee, ich glaube nicht, weil das sind ja schon irgendwie öffentliche Informationen.",
      "start": 1712628,
      "end": 1763324,
      "confidence": 0.7317826086956521,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was halt gefährlich da ist, finde ich, ist, dass eben genau das, was ich zuerst schon gesagt habe, wenn du jetzt irgendeine seniorige Person da sitzen hast in dem Interview und die Person hat weder GitHub, ist öffentlich nicht präsent, du findest nichts dazu, dann darf das halt kein Red Flag sein, weil es gibt halt einfach sehr gute EntwicklerInnen, die einfach unter dem öffentlichen Radar laufen und können aber trotzdem sehr, sehr gut sein und vielleicht investieren sie halt ihre private Zeit einfach lieber in die Familie. anstatt Open Source zu machen.",
      "start": 1763844,
      "end": 1795322,
      "confidence": 0.8181612903225804,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Alles richtig, zum Beispiel, da gibt's ja auch noch was ganz Komplexes, wie zum Beispiel besonders in amerikanischen und englischen Unternehmen ist das ja so, dass viele dieses Outgoing dann komplett verbieten. Also bei amerikanischen, nehmen wir mal Google. Die wenigsten Googler, also die Leute, die bei Google arbeiten, haben ein gut gepflegtes Gitterprofil mit sehr vielen Contributions. Der Grund ist einfach, dass sie in ihren Verträgen irgendwie so Intellectual Property-Geschichten haben, dass die wenig Open Source machen dürfen. Jetzt kann man sagen als Deutscher, wie kann das denn sein? Das ist ja deren Freizeit, die hat das amerikanische Recht. das ist dann alles ein bisschen komplizierter. Was ich damit sagen möchte ist, nur.",
      "start": 1795342,
      "end": 1825391,
      "confidence": 0.754535087719298,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weil ich nichts finde... Ist sogar in Deutschland gar nicht so ohne, also da gibt es schon auch Floskeln und ist ein bisschen schwieriger, aber... Nur weil ich.",
      "start": 1825411,
      "end": 1831674,
      "confidence": 0.5269642857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ich damit sagen möchte, nur weil ich nichts finde, heißt das ja nicht, dass ich diese Motivationsroute nicht runtergehen kann. Es ist dann, ich brauche dann ein paar Einstiege und ich muss dann natürlich auch mit der Person ein bisschen mehr sprechen, als hätte ich dann so ein paar Beispiele in der Hand, ja, wie zum Beispiel jetzt dieser Talk auf Du.",
      "start": 1831714,
      "end": 1847662,
      "confidence": 0.7644444444444444,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kannst ja intern dann auch einiges haben, die können ja vielleicht auf interne Konferenzen, Talks gehalten haben oder intern coole Projekte gemacht haben oder keine Ahnung wo coole Projekte, also du kannst ja trotzdem die Motivation finden, aber du siehst sie halt nicht im Vorhinein schon.",
      "start": 1847842,
      "end": 1862442,
      "confidence": 0.7563695652173914,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also wenn man uns jetzt zuhört, dann könnte man ja fast sagen, im Interview entscheidet sich alles und deswegen ist die Person top oder flop, was auch Blödsinn ist, weil auch die Aussage, ob eine Person flop ist, ist ja schon ein bisschen strange, weil wer sagt, dass es an der Person liegt, kann auch an der Firma liegen, kann auch am Lead liegen, kann auch am Team liegen, es kann an so vielen Faktoren liegen.",
      "start": 1862622,
      "end": 1880909,
      "confidence": 0.7695394736842106,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Er ist halt kein Fit.",
      "start": 1880929,
      "end": 1881790,
      "confidence": 0.6744,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was auch immer fit hier ist, das finde ich auch immer ein bisschen schwammig. Der Punkt ist ... Na ja, du.",
      "start": 1882670,
      "end": 1888794,
      "confidence": 0.6767619047619047,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Suchst eine Person für eine Position, und es muss halt ein Match sein, ein Fit auf beiden Seiten. Und da gehört halt zum Beispiel dazu, wenn du eine absolute extrovertierte Person findest, weil du so viele introvertierte Leute in deinem Team hast, und es bewirkt sich halt eine introvertierte Person, und du suchst aber unbedingt nach einer Extrovertierten, dann ist es halt kein Fit, obwohl die Person vielleicht top ist. Kann natürlich passieren, das sollte nicht das einzige Kriterium sein, schon klar, aber jetzt nur um es mal plakativ zu sagen. Das hat aber null damit zu tun, ob die Person gut oder schlecht ist, sondern einfach, dass es halt für diese Position nicht die passende Kandidatin der Kandidat ist.",
      "start": 1888814,
      "end": 1925438,
      "confidence": 0.8154666666666669,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber was ich auch sage ist, dass die Probezeit von beiden Seiten ist. Also wir sind ja nicht mehr in 1990 und 1980, wo jemand in eine Firma geht und dann da bis zur Rente bleibt. Also sind wir mal ganz ehrlich, das machen die wenigsten. Es gibt solche Leute noch, die besonders in Großkonzernen arbeiten, weil da kriegt man natürlich, umso länger man da bleibt, mehr Benefits und so weiter. Das finde ich auch völlig verständlich. Doch nehmen wir mal das normale Softwareentwicklerleben, die wenigsten werden mehr als 10 bis 15 Jahre bei einem Arbeitgeber bleiben. deswegen kann man natürlich auch sagen hey du hast sechs monate zumindest in deutschland ist es in österreich eigentlich auch so.",
      "start": 1925998,
      "end": 1959812,
      "confidence": 0.7412436974789915,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sechs monate bei einer probezeit na wir haben wesentlich weniger ich glaube wir haben maximal drei monate oder so überraschend okay.",
      "start": 1959832,
      "end": 1966695,
      "confidence": 0.6961428571428572,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber in deutschland hat man auf jeden fall in der regel sechs monate zeit um von beiden seiten ich als teamleiter beziehungsweise aus Perspektive der Firma und dann die Bewerberinnen und Bewerber zu evaluieren, ist das hier ein Fit. Und über diese Zeit arbeitet man natürlich sehr sehr viel und sehr sehr eng miteinander, besonders wenn man eine Person eingestellt hat, die jetzt gerade in den Beruf eingestiegen ist, also Junior oder aus dem Studium kommt oder vielleicht sogar, was ich auch immer sehr sehr gerne gesehen habe, es hört sich total komisch an, ist Studienabbrechung.",
      "start": 1966735,
      "end": 1995721,
      "confidence": 0.7687395833333331,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das musst du jetzt sagen, oder? Es ist übrigens schon zum Running Gag geworden bei uns in der Community, dass sich Leute, wenn sie sich vorstellen, in der Community sagen, übrigens für dich Wolfgang, ich bin so ein Studienabbrecher, ich habe nur den Bachelor. Jetzt wäre ich schon so dargestellt, als würde ich da Ich habe nur damals meinen Professor zitiert, ich persönlich habe natürlich eine ganz andere Meinung.",
      "start": 1995781,
      "end": 2015977,
      "confidence": 0.73004347826087,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich rede aber wirklich von Leuten, die dann den akademischen Titel nicht zu Ende gemacht haben. Auf jeden Fall innerhalb der sechs Monate arbeitet man natürlich auch sehr, sehr eng zusammen. Also ich habe dann zum Beispiel besonders in den ersten paar Wochen zweimal pro Woche ein One-on-One mit den Personen gehabt. Einfach auch nur mal, um zu fühlen, okay, ist die Person im Team angekommen, gibt es da Probleme. Wie baut sich das Kommunikationsnetzwerk auf? Zu wem hat sie am meisten Kontakt, zu wem gar nicht? Welche Themen interessiert sie oder halt auch nicht? Und dann baut man sich natürlich so ein Bild auf über die ersten zwei, drei Monate. Und spätestens nach zwei Monaten kann man schon sagen, okay, das entwickelt sich in die richtige Richtung oder halt in die falsche Richtung. Und ab da sollte man natürlich schon sehr sehr schnell Feedback geben, egal in welche Richtung es sich entwickelt, um einfach A, ein bisschen Selbstreflektion zu triggern, bei beiden Personen, aber auch B, um ja nicht in die Bedulje zu kommen, erst im fünften Monat oder gegen Kurzende zu sagen, hör mal du, pass mal auf, irgendwie wird das hier mit uns beiden nix. Ich glaub, wir müssen gerennte Wege gehen oder ähnliches. Das ist nämlich der Worst Case, wenn vorher noch nichts gesagt wurde. Ich bin jetzt hier nicht und advocate dieses Hire and Fire. Das sag ich nicht. Ich sag dennoch, dass es nicht verwerflich ist, von beiden Seiten von der Probezeit Gebrauch zu machen.",
      "start": 2016438,
      "end": 2087467,
      "confidence": 0.8040597609561757,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich persönlich habe es immer schwer gefunden, in sechs Monaten das schon festzustellen, muss ich ganz ehrlich sagen. Also, weil es gab nie so diese Leute, wo es absolut klar war, sondern es ist halt dann immer so, naja, wo man so sagt, ist kein, nicht top, aber auch nicht irgendwie ein großes Problem. Es ist so dieses Mittelding und da finde ich, ist es ganz schwer, nach sechs Monaten wirklich eine Entscheidung zu treffen. Und da ist halt ein Jahr teilweise schon besser, aber es ist teilweise sogar nach einem Jahr noch schwierig, weil halt ist immer die Frage, wen du halt wirklich haben willst und wie gut du die Person da motivieren kannst, wie motiviert die Person ist und so weiter. Aber ich finde das extrem schwer, wenn das kein klarer Fall ist, dann finde ich, das ist immer super komplex. Darum habe ich zum Beispiel auch sehr gerne dieses Format genutzt, dass man Studenten einstellt, dass man wirklich eine Studentin, während sie noch studiert, als Nebenjob einstellt, vielleicht sogar kombiniert irgendwie mit der Masterarbeit, dass man die Masterarbeit zusammen mit dem Unternehmen macht. und zusätzlich noch einstellt, weil man da dann einfach viel, viel mehr Zeit hat, um sich kennenzulernen. Und das hat eigentlich bei mir super funktioniert. Also ich habe da, glaube ich, wirklich von den, würde man sagen, zehn Studenten Stellen, die ich so da ausgegeben habe, da ist der Großteil eigentlich dann dabei geblieben und die haben wir dann eigentlich alle übernommen und die haben sich alle super entwickelt. Also das hat eigentlich ziemlich gut funktioniert. Ich würde sagen, da waren ein, maximal zwei Ausreißer dabei von zehn. Also es war eigentlich eine super Ratio und super motivierte Leute.",
      "start": 2087967,
      "end": 2176527,
      "confidence": 0.8118916083916085,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich finde, sechs Monate sind schon genug Zeit, um eine juniorige Person zu evaluieren, ob das ein gutes Teamfit ist und allem Drum und Dran. Ich denke, das passt schon so, weil diese Person primär alles lernen muss. Den Beruf, also die Craftmanship, aber auch die Firma und das Team. Wohingegen ... Also, die meisten Personen sind da eh, ich will nicht sagen überfordert, aber ich sag mal wirklich überfordert, weil es ist sehr viel Neues. dass man die ersten zwei, drei, vier Monate im neuen Job in so einer Honeymoon-Phase ist, alles ist erstmal toll, man sieht noch nicht die Probleme, man ist aber erstmal die ganzen Probleme vom alten Arbeitgeber oder von der alten Stelle oder ähnliches los, dass man natürlich nur ein Problemset mit dem anderen Problemset getauscht hat, das sieht man erst nach fünf oder sechs oder sieben Monaten, weil auch in der neuen Firma ist es scheiße. Wie sagt man so schön, Grüße an Dominik, woanders ist auch Kacke. Also von daher, ich glaube, bei Junioren ist sechs Monate schon okay, weil da geht es ja nicht darum, ist das ein hochperformanter Mitarbeiter oder Mitarbeiterin, sondern entwickelt sich diese Person in die richtige Richtung und siehst du Potenzial für die nächsten anderthalb bis zwei bis drei Jahre. Bei Studenten fand ich das immer recht schwierig. Also da gab es mehrere Teams um mich herum, die Studenten eingestellt haben. Ich habe immer so die Herausforderung mit Studenten, dass sie dann in der Regel immer nur so einen Tag oder zwei Tage oder anderthalb Tage oder irgendwie sowas da sind und selten halt irgendwie fünf Tage die Woche. oder vier Tage Woche inzwischen, gibt's ja auch. Und man in dieser Zeit natürlich mit recht vielen Herausforderungen nur wirklich Projekte assignen kann. Also immer nur Sachen zu finden, die dann genau in die Arbeitszeit des Studenten passen, die dann aber auch fertiggestellt werden, damit die anderen weiterarbeiten können, find ich recht herausfordernd. Das bedeutet, man kann diese Studenten dann seltenst an, ich sag mal, Anführungszeichen, wichtige Projekte setzen, weil man weiß ja nie, wie wichtig sie sind, wie weit sie an diesem Tag kommen, Also hat man natürlich immer irgendwelche so Studentenzeitprojekte, so nach dem Motto, es wäre mal nett, wenn. Und das ist dann immer ein bisschen schwierig, dann die wirkliche Priorität und dann die, auch die benötigte Education dran zu setzen. Verstehst du, was ich meine? Weil, weil wenn ich, wenn ich ja jemanden habe, zum Beispiel eine Juniorperson in meinem Team, Die lasse ich an sehr wichtige Projekte anarbeiten, weil ich denke, das ist die Realität. Und da stecke ich dann auch meine Arbeit 100% rein, um diese Person hoch zu coachen. Studenten sind nicht weniger wert, ganz und gar nicht, doch die Projekte, an denen die arbeiten, da ist halt meist eine große Pause dazwischen. Und das macht es recht herausfordernd, mit Studenten richtig zu arbeiten.",
      "start": 2176827,
      "end": 2324027,
      "confidence": 0.8092116182572625,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das stimmt natürlich, ist schon eine gewisse Herausforderung. Also ich hab das immer so gelöst, es hat diese zwei Varianten gegeben. Entweder es gibt die Masterarbeit, die komplett abgekoppelt ist meistens, die halt so wirklich eher so ein Forschungsthema, ein Nice-to-have-Thema, ganz am Rande, komplett unabhängig von dem eigentlichen Tagesgeschäft läuft. Oder die Studierenden, die dann halt wirklich halbtags oder so angestellt sind. Und dann kann ich das eigentlich sehr gut einplanen mit halbtags. Klar, es gibt ja auch Andere Leute im Team, die mehrere Projekte haben, da hat dann ein Projekt von den drei Projekten dann auch nur 30 Prozent der Arbeitskraft, wenn man es so sieht. Also das war eigentlich selten ein Problem. Und wenn man die dann zusammentut mit anderen oder vielleicht auch mal ein Projekt, was jetzt nicht super heikel und kritisch und schnell erledigt werden muss, dann hat das eigentlich immer ganz funktioniert. Und was ich halt gesehen habe, ist einfach, dass der Draht zur Universität sehr, sehr wichtig ist. Und wenn man da halt schon frühzeitig Talente bekommt, das ist natürlich ein Investment und das muss sich eine Firma erst leisten können. Aber meiner Meinung nach ist das ein super Weg, um wirklich super motivierte Leute zu bekommen. wenn man da möglichst früh ansetzt. Aber da muss man halt viel investieren. Da muss man mit den Unis zusammenarbeiten. Du musst halt Studentenpositionen ausschreiben. Du musst die Zeit dafür haben. Du musst die Projekte dafür haben. Wenn es um Masterarbeiten oder sowas geht, Betreuung, brauchst du die Leute auf der Uniseite, die dir vertrauen, die offen sind, die das mit dir zusammen machen. Du musst gewisse Betreuungsfähigkeiten haben. Sollte ein interessantes Thema sein. Ich habe mir da persönlich halt immer leicht getan, weil ich die Uniseite gekannt habe und ich habe auch persönlich, wie ich an der Uni war, mit Firmen zusammengearbeitet. Also ich habe auch den Pain auf der Uniseite gekannt, wenn die Firma unbedingt eine Umsetzung wollte und die Masterarbeit war der Firma eigentlich komplett egal. Und so habe ich das halt probiert dann auszugleichen, wie ich auf der Firmenseite war, dass ich da halt auch eine sinnvolle wissenschaftliche Arbeit rausbringe am Schluss zusammen mit der Studentin oder dem Studenten.",
      "start": 2324247,
      "end": 2437252,
      "confidence": 0.815079019073569,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das fand ich aber immer faszinierend. Die Leute, die immer sehr viel Zeit an der Universität selbst verbracht haben, auf Basis des Bachelors, Masters, vielleicht ein Doktortitel oder ähnliches, die haben immer unglaublich viel Energie genau da reingesteckt. Sei es fürs Recruiting an Universitäten, was ich sehr gut finde. Ich hab ja auch ab und zu mal Gastvorträge gehalten, besonders an der FH und so weiter, im Bereich Datenbanken oder Skalierung und verteilte Systeme und solche Geschichten.",
      "start": 2438167,
      "end": 2465671,
      "confidence": 0.8537922077922073,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da haben sie so einen dahergelaufenen Bachelor unterrichten lassen.",
      "start": 2466171,
      "end": 2468932,
      "confidence": 0.6545555555555556,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja da ging es ja wenigstens weniger um die um die Theorie sondern mehr wie sieht die ganze Sache denn in der Praxis aus das ist ja schön wenn man immer so so so Paxos und Raft und wie sie alle heißen immer nur auf dem Papier malt bla ja, aber dass im Internet trotzdem immer alles kaputt ist weil wenn der Switch einfach ausfällt dann hilft dir auch der beste Konsensus Algorithmus nichts wenn kein Node mehr zu erreichen ist, das war den dann halt auch neu ja weil in der theorie hast du ja tcp pay mit mit rice und ja dann gibt es eine zweite internet line nein, wenn du die nicht baust dann gibt es die auch nicht ja und das fand.",
      "start": 2469412,
      "end": 2500651,
      "confidence": 0.7660158730158727,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Mir übrigens die vorträge immer als student sehr cool gefunden von den firmen.",
      "start": 2500671,
      "end": 2505215,
      "confidence": 0.7983846153846154,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielleicht hätte ich ja dann mal zu euch kommen sollen dann wäre auch mal die aus dir was geworden.",
      "start": 2505235,
      "end": 2508659,
      "confidence": 0.7212105263157893,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das stimmt ja.",
      "start": 2509099,
      "end": 2510360,
      "confidence": 0.5763333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber mir ist halt so ein Pattern aufgefallen, die ganzen Leute, die halt sehr viel in der Uni unterwegs waren, die haben dann auch sehr viel, ich nenne es mal, wieder an die Uni zurückgegeben, indem sie dann auch aktiv Bachelorarbeiten und Masterarbeiten angeboten haben, was ich ja super finde. nur in dem space war ich halt auch nicht so oft ich muss aber auch zugeben ich habe ja nur ein bachelor und das bedeutet nach deutschem recht darf ich glaube ich nur bachelor arbeiten betreuen und du mit deinem doktor darfst sie sogar wenn ich mich recht erinnere teils bewerten.",
      "start": 2510400,
      "end": 2542096,
      "confidence": 0.8125247524752474,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es kommt darauf an, wie das geregelt ist mit der Uni. Es geht beides. Aber ganz viele Unis sagen, es bewertet sowieso nur die Uni. Und das, was die Firma sagt, ist komplett irrelevant. Und dann war eine Masterarbeit, wo ich damals sogar betreut, wo ich wirklich ein Gutachten schreiben habe müssen, ein offizielles. Das wäre aber, glaube ich, auch egal gewesen, ob ich jetzt den Doktortitel habe oder nicht. Da ist es mehr darum gegangen, dass die Firmenseite ein wirkliches Gutachten schreibt, wie die Arbeit und so weiter war. Also es gibt beide Möglichkeiten. Das eine schließt das andere nicht aus. Und ich habe halt da immer einen guten Weg gesehen, dass man halt wirklich an motivierte und sehr gute Leute drankommt. Ich war ja, auch wie ich an der Uni gearbeitet habe, immer als Freelancer unterwegs. Und ganz ehrlich gesagt, ich habe da auch probiert, die besten Studierenden in meinen Kursen, die habe ich natürlich persönlich angesprochen, ob sie bei irgendwelchen Projekten bezahlt mitarbeiten wollen. Und wenn man den Zugang hat, der ist meiner Meinung nach super wertvoll. Und wenn man es eben schafft, diese guten Leute schon von der Uni zu bekommen, dann hat man halt auch die Möglichkeit, die mit Investment, muss man auch dazu sagen, aufzubauen, aber hat da halt auch viele Vorteile. Und ich glaube, viele Firmen machen den Fehler, dass sie diese Möglichkeit eigentlich nicht sehen und dieses Investment nicht machen.",
      "start": 2542636,
      "end": 2612102,
      "confidence": 0.8001008403361342,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da stimme ich dir zu, aber man muss auch sagen, es ist auch schon ein sehr großes Investment.",
      "start": 2612830,
      "end": 2616314,
      "confidence": 0.7932777777777779,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber wenn du einen Senior hirest, dann kann es dir natürlich genauso passieren, dass der halt stur ist, auf seiner Meinung beharrt, vielleicht gar nicht so toll ist, wie man so denkt. Also ins Hiring fließt auch viel Investment. Ich persönlich sehe da eigentlich gar nicht so viel Negatives dran. Du hast natürlich ein Investment und es ist vielleicht ein gewisser Aufwand, aber der sich auf jeden Fall bezahlt macht. Und wie gesagt, von den Leuten, die ich damals eingestellt habe, ich glaube, da waren maximal 10 Prozent, die irgendwie rausgedroppt sind und der restliche Teil, die 90 Prozent, waren super erfolgreich, waren dann länger dabei, jahrelang, sind dann aber natürlich auch irgendwann vielleicht abgewandert.",
      "start": 2616855,
      "end": 2653580,
      "confidence": 0.7949051724137931,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ja auch okay ist, und ich ganz im Ernst, wenn du mir das jetzt so erzählst, ja, die Leute, die ich damals eingestellt hab, sind jetzt bei Datadog und Amazon Web Services und so weiter, super, macht mich ja stolz, ne, das ist ja eine tolle Geschichte, weil irgendwie hab ich ja dann schon im Positiven oder im Negativen zu dieser Karriere beigetragen.",
      "start": 2654032,
      "end": 2670422,
      "confidence": 0.8174843750000003,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber hast du dann nie irgendwie das Gefühl, dass du sagst, okay, jetzt hab ich so viel investiert, jahrelang, Keine Ahnung, ihr habt jetzt 5 Jahre in die Person investiert, die ist jetzt super Senior oder Staff oder was auch immer, wie man da im neuen Jargon auch immer dazu sagen will, aber super Seniorik diese Person, diese Dame zum Beispiel und dann wechselt sie zu Data Talk oder sowas. Denkst du dir dann nicht, jetzt habe ich die ganzen 5 Jahre umsonst investiert?",
      "start": 2670502,
      "end": 2692686,
      "confidence": 0.681404761904762,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hast ja diese fünf jahre dann benefit gehabt also ich meine du hast ja dann sofort auch den benefit gehabt klar diese dame und die die ganzen leute kriegen ja auch geld dafür ich meine immer noch die definition von arbeit, austausch von fähigkeit und zeit im gegenzug zu geld also, Du kannst ja nicht erwarten, dass diese Personen zehn Jahre bei dir bleiben. Umso länger man sich mit Hiring und Recruiting beschäftigt, desto mehr weiß man natürlich, wie teuer das ist. Also diese Rekruter zum Beispiel, die bekommen ja, weiß ich nicht, 15 bis 20, teilweise 25 Prozent Provision des Jahresgehalts.",
      "start": 2693066,
      "end": 2724171,
      "confidence": 0.7740679611650484,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bruttojahresgehalt vor allem.",
      "start": 2725007,
      "end": 2726408,
      "confidence": 0.454,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, das ist richtig, richtig Asche. So, dann gibt's natürlich noch andere. Also, wenn du schon mal eine Job-Ad auf Stackoverflow geschaltet hast, dann weißt du auch, dass die richtig, richtig, richtig Geld kostet. Das bedeutet, dieser ganze Hiring- und Recruitingprozess ist halt natürlich unglaublich teuer. So, und jetzt stellt man sich natürlich die Frage als Firma, wenn ich das tue, wie lange muss die Person bleiben, bis ich das, ich sag mal, Quote und Quote wieder drin hab? Und natürlich kannst du jetzt sagen, ja, das kommt ja auf die Firma drauf an, und ja, umso mehr Revenue du pro Mitarbeiter machst, Bla bla bla so kann man das auch rechnen ja ich sag mal die faustformel die ich jetzt so in den letzten paar jahren mitgenommen habe ist wenn eine person circa zwei bis zweieinhalb jahre bleibt dann war das ein erfolgreiches recruiting das rechne ich jetzt nicht auf die letzte münze um und das kommt natürlich auch ganz drauf an ob du eine hochspezialistische stelle besetzen Möchtest du eine React-Entwicklerin oder Java-Entwicklerin, die sich ein bisschen mehr am Markt gibt, als einen Datenbank-Administrator für DB2? Also als Beispiel. DB2 kennst du noch, alte Datenbank?",
      "start": 2726448,
      "end": 2785248,
      "confidence": 0.7873756345177662,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hey, eine ganze Uni-Zeit habe ich derbe zu machen müssen.",
      "start": 2785725,
      "end": 2789349,
      "confidence": 0.5778000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf jeden Fall ist das so, was ich so gehört habe, so zwei, zweieinhalb Jahre sollte die Person bei dir bleiben und dann war das ein guter Heier. Natürlich gibt es dann immer noch so Metriken in Firmen, wie dass man die Anzahl der Regrettable Losses niedrig hält. Was ist das für eine Metrik? Du hast immer Leute in der Firma, Die sind sehr gut, die haben sehr viel Wissen, die sind sehr gut in der Kommunikation. Die haben auf jeden Fall irgendwie einen sehr hohen positiven Impact. Sei es in der Teamkultur, sei es in der Strategie, sei es im Output. Von mir aus auch Lines of Code und Pull Requests, ja? Völlig egal. Wenn man sagt, okay, das ist eine hochperformante Person, und diese Person geht weg, dann nennt man das ja Regrettable Loss. Es ist schade, dass diese Person weggegangen ist. höher diese zahl ist umso eher desto eher gibt dir das ein zeichen okay warum gehen die jetzt alle waren die alle vier jahre hier fünf jahre hier ist es einfach zeit hatte ich eine ganze zeit lang nur seniors eingestellt und die sind jetzt alle wieder weg weil nämlich das andere extrem und da kommen wir wieder auf deine auf deine unihiring zeit zurück nur billigkräfte also nur juniors weil die ganz günstig sind einzustellen ist es ja auch nicht also du kannst ja nicht nur ein senior haben und dann fünf junioren weil da schwöre ich dir dieser senior da sage ich jetzt ein bisschen direkt aber so meine ich das gar nicht so böse der räumt nur hinterher weil junioren die die produzieren natürlich fünf leute produzieren produzieren sehr viel code und sehr viele tickets und die bewegen sich sehr schnell eine person kann da gar nicht noch ihre arbeit machen und dann mal ein bisschen drüber schauen und die technische strategie verfolgen und diese leute hochkochen also das wäre dann das andere extrem und deswegen kann man deswegen habe ich ja und so kommen wir wieder zum anfang dieser episode von dieser balance gesprochen dass man ich sag mal dicken bauch hat ja Der dicke Bauch ist dann diese Middle Engineers und Senior Engineers, das ist so der dicke Bauch. Oben hat man so den Kopf, der ist wieder so ganz klein, ja, also wenig Staff Engineers, ein, maximal zwei im Zehn-Mann-Team. Und unten, ja, deine Füße sind auch hoffentlich recht dünn und nicht so dick wie dein Bauch. Das bedeutet auch zwei Junioren oder ähnliches.",
      "start": 2789389,
      "end": 2920900,
      "confidence": 0.8079323671497581,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich persönlich würde sogar mehr Junioren als du jetzt in dem Team Aber.",
      "start": 2921440,
      "end": 2925695,
      "confidence": 0.7137857142857141,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du rotierst ja weiter, ne, also das bedeutet, wenn einer dieser Union promoted wird, dann ist ja wieder eigentlich ein neuen Platz unten frei. Weil die Mittelmenschen, also die Middle Engineers, die müssen ja auch hochgecoacht werden. Verstehst du? Also es ändert sich ja nichts. Also es ist ja eine laufende Leiter, weil diese Staff Engineers oben, entweder gehen die auch die Karriereleiter hoch oder wechseln mal das Team, was umso mehr Entwickler du hast, auch sehr, sehr empfehlenswert ist. bevor ihr denkt ihr müsst die firma verlassen und ihr habt irgendwie 50 oder 60 oder 100 entwickler in eurer firma überlegt euch mal einfach nur das team zu wechseln das kann sich für euch wie für eine andere firma anfühlen deswegen sage ich ja die leute gehen die leiter gerade ja alle hoch und die leute die oben sind gehen die leiter entweder noch höher oder die gehen die nach rechts und nach links und deswegen ist das ja immer so ein so ein rad was sich dreht und somit brauchst du ja eigentlich ich rede jetzt hier so wie wie von menschen wie so ressourcen oder ähnliches aber du hast.",
      "start": 2925715,
      "end": 2980722,
      "confidence": 0.770994791666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ressourcen noch nie erwähnt den begriff du hast den ja auch ich ich hasse.",
      "start": 2980742,
      "end": 2984226,
      "confidence": 0.7577857142857142,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir reden ja über menschen nicht über ressourcen obwohl es natürlich human resources heißt ja was natürlich auch völliger bullshit ist.",
      "start": 2984246,
      "end": 2989891,
      "confidence": 0.7551428571428573,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber es ist ja okay wenn sich was dreht es ist ja vollkommen okay auch wenn sich menschen, weiterentwickeln oder auch mal springen zwischen Firmen, das ist ja vollkommen in Ordnung. Also da eine gewisse Rotation drin zu haben. Ich meine, kein Problem, wenn jemand gerne ganz lang bei einer Firma bleibt, ich sehe das auch nicht als großes Problem. Aber heutzutage ist es meistens eher so, dass die Leute rotieren wollen. Und ich persönlich habe das auch immer so gesehen, wenn jetzt jemand zu Google oder zu Amazon oder zu Datadog oder weiß was wohin ist, dann war das eigentlich für mich immer eine Bestätigung, dass ich einen sehr guten Job gemacht habe in dem Hochcoachen, in unserem Team, dass wir ein super Team haben. Wenn sich diese Firmen, die ganz viel Geld zahlen und haben und probieren, die besten am Markt zu finden, dann ist das fast so ein Preis, den man da irgendwie bekommt, verliehen bekommt, dass man einfach ein sehr gutes Team hat. Und wie gesagt, ich habe das immer als Bestätigung gesehen. Klar, wenn dir die Leute nach neun Monaten wegspringen, ist ein Problem. Aber grundsätzlich, dass Leute rotieren und nach ein paar Jahren irgendwo zu anderen Firmen gehen, ich finde das vollkommen in Ordnung. Und so schließt sich ja irgendwie der Kreis, man übernimmt dann selbst Leute von diesen anderen Firmen wieder. Und meiner Meinung nach muss man das fördern und man muss die Leute fördern. Wenn die zu anderen Firmen gehen wollen, habe ich eigentlich immer alle Personen unterstützt. Sogar beim Bewerben teilweise, wenn die unbedingt weg wollten und man nichts mehr machen hat können, habe ich da als Lead auch gerne bei der Bewerbung geholfen und Tipps gegeben. Und man trifft sich immer zweimal im Leben. Vielleicht kommt die Person dann als Superstar wieder zurück. Passiert ja auch hin und wieder.",
      "start": 2989932,
      "end": 3082758,
      "confidence": 0.8081294498381877,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Naja, du redest gerade immer von einem Happy Pass. Es kann doch einfach sein, dass die Person sich einfach... Du bist immer so negativ.",
      "start": 3083082,
      "end": 3089031,
      "confidence": 0.6709166666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich Happy Pass. Ich bin immer positiv eingestellt und meistens hat es eigentlich immer funktioniert, würde ich mal sagen. Es hat eigentlich wenige negative Erfahrungen diesbezüglich gegeben. Eigentlich keine.",
      "start": 3089071,
      "end": 3098626,
      "confidence": 0.7939655172413791,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich arbeite beruflich in der Cloud, also das bedeutet, ich vertraue meiner Applikation anderen Leuten Computer an, und ich weiß nicht, was sie mit ihrer Festplatte machen. Deswegen, ja, man muss da auch mal den negativen Pfad gehen. Ich meine, offengesprochen kann es ja auch einfach sein, dass irgendwas vorgefallen ist in der Firma, oder vielleicht hast du einfach mal einen schlechten Tag gehabt, und ihr habt euch mal gezankt oder was weiß ich, gezankt meine ich jetzt, also Fehler macht ja jeder Lead, ja, und dann ist die Person einfach, habt ihr euch im Schlechten getrennt. Das kann ja auch ganz einfach sein. Oder es ist irgendwas vorgefallen, dass ein Projekt, an dem ihr ein halbes Jahr lang gearbeitet habt, dann eingestellt wurde auf Basis von einer strategischen Änderung oder von Corona. Ich will gar nicht wissen, wie viele Projekte innerhalb von Corona irgendwie eingestellt wurden, weil sich die Welt geändert hat.",
      "start": 3099206,
      "end": 3141494,
      "confidence": 0.76402614379085,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich glaube, da ist sehr wichtig genau das, was du gesagt hast. Man kann zu anderen Teams wechseln. Wenn man Probleme mit dem Lead hat, kann man zu einem anderen Team wechseln. Und diese Option sollte man, wenn man sie zumindest satt in der Firma, immer meiner Meinung nach nehmen, weil man da dann eine Chance noch hat in dieser Firma. Und wenn die Firma cool ist, warum wechseln? Aber es gibt natürlich auch einfach Situationen, externe Firmen zahlen wesentlich mehr zum Beispiel. Oder man will einfach wechseln, weil man schon acht Jahre dabei ist und was Neues sehen will. Kann ich voll und ganz verstehen. Und wenn es dann diesen Fall gibt, unterstütze ich den auch gern als Lead.",
      "start": 3141534,
      "end": 3174950,
      "confidence": 0.8223801652892562,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber jetzt ist natürlich schon immer die große Frage, okay, wie coacht man denn Juniors hoch? Und ich bin mir nicht sicher, ob wir den heiligen Graal gefunden haben, glaube ich nämlich nicht. Aber ich denke, man muss sich das bewusst machen, was eigentlich auch ein großer Teil von einem Senior-Engineer und von einem Staff-Engineer und so weiter und so fort einfach ist. So nach dem Motto, man muss sich klar werden, wenn man es selbst macht, macht man es nicht schneller. Man macht es jetzt kurzfristig schneller, aber nicht langfristig. Weil irgendwann kommen mehr Aufgaben auf dich. Und irgendwann bist du nur noch am Jonglieren. Irgendwann schafft es nicht man sagt ja auch if you wanna go fast go alone if you wanna go far go together ja also wenn du wenn du schnell gehen möchtest.",
      "start": 3175250,
      "end": 3212029,
      "confidence": 0.7423430656934306,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Schön romantisch.",
      "start": 3212069,
      "end": 3213611,
      "confidence": 0.7665,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wenn du wenn du wenn du weit gehen möchtest ja gehe zusammen und das ist halt auch genau diese thematik wie du eigentlich. junioren hoch coach meines erachtens nach die leute müssen verstehen dass du langsamer unterwegs bist um hinten raus schneller unterwegs zu sein das und und das dass das verstehen viele viele also viele meiner vorgesetzten haben genau das nicht verstanden, Die haben mich gefragt, ja, du hast ja jetzt zwei neue Leute, zwei neue Junioren. Wieso wird das Projekt nicht schneller fertig? Ja, pass auf, wir fahren die ganze Zeit in den fünften Gang, wir schalten jetzt mal runter in den zweiten, für den nächsten Monat oder für weiß ich nicht wie lange. Wir haben nicht so einen hohen Output, dafür, schwöre ich dir, schalten wir nach irgendwann wieder in den sechsten, weil wir dann Leute haben, die mehr und mehr und mehr Verantwortung übernehmen können. Und so geht man natürlich auch mit den Projekten um. Irgendwann überträgt man ein Projekt, auf die Damen oder auf den Herren, das Projekt ist nicht das wichtigste Projekt, gibt man auch zu und vielleicht auch nicht das größte. Aber so fängt man halt ja an. Auf jeden Fall, da muss man dann auch, ich sag mal, Achtung, zweites Sprichwort, der Fels in der Brandung sein und den Sturm aushalten. Also, da musst du dann als Teamlead halt auch den Shitstorm-Filter, den musst du sein. Da wird auch rumgeschrien, besonders in der Management-Ebene wird viel rumgeschrien, hab ich auch das Gefühl.",
      "start": 3213651,
      "end": 3292650,
      "confidence": 0.7688764940239049,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, umso höher, umso mehr Geschrei.",
      "start": 3293131,
      "end": 3294611,
      "confidence": 0.522,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, und alles scheiße, und da wird auch oft nicht auf die Wortwahl geachtet. Ich mein, im Pott tut man das eh nicht, aber im hohen Düsseldorf halt schon. Oder in anderen Firmen. Auf jeden Fall muss man da halt von seiner Strategie überzeugt sein. Und wenn man da bei jedem kleinen Ding einknickt, dann sag ich, dann ist die Teamleiterstelle nichts für dich, weil eigentlich ist es genau das. Du musst eine Strategie haben, die muss natürlich in line mit der Firma sein und mit dem, was sein Chef möchte und so weiter und so fort. Aber du musst einen Weg nach vorne haben und dann hältst du halt auch deinen Kopf hin und du lehnst dich ein bisschen aus dem Fenster und du gehst auch ein bisschen Risiko ein. Und Achtung, am Ende muss man natürlich auch liefern. Das bedeutet, wenn du sagst, wir schalten jetzt hier für drei Monate in Gange zwei und am Ende, Also ein Motorschaden? Funktioniert's halt auch nicht. Deswegen ausprobieren, ausprobieren, ausprobieren, denn jeder lernt halt nur mit Erfahrung. Wir können jetzt nicht alle irgendwelche Bücher lesen, sondern sind wir Experte. Das ist gut, da Inspiration zu holen. Aber für so was ist vielleicht auch ein Mentor ganz gut. Also falls ihr jemanden habt, der irgendwie zu dem ein bisschen aufguckt, der schon mal, ich sag mal, einen sogenannten Track Record im Ausbilden von Juniors hat oder Ähnliches, fragt diese Person doch einfach mal, ob ihr euch einfach mal über gewisse Szenarien unterhalten könnt.",
      "start": 3295280,
      "end": 3369159,
      "confidence": 0.7785936254980075,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube ganz allgemein, dass diese Erfahrung, dieser Track Record ganz allgemein überschätzt wird und ich glaube, dass Firmen viel zu wenig in Juniors und vielleicht sogar darunter eben während dem Studium noch Studierende, da viel zu wenig investieren. Meistens, nicht alle Firmen natürlich, aber ich glaube man vergisst es oft und man ist dann irgendwie auf dem hohen Ross, wir stellen nur mehr Seniors ein und ich glaube man vergisst es dann zu oft, dass die Leute eigentlich sehr gut was beisteuern können und ich war überrascht, wie selbstständig Studierende sein können und wie viel die schon Projekte umsetzen können, wenn sie einfach ins kalte Wasser springen und auch die richtige Motivation haben.",
      "start": 3369959,
      "end": 3407049,
      "confidence": 0.808491228070176,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das war aber jetzt was super lustiges angesprochen. Wenn man nur Seniors anstellt. Und wenn ich jetzt mir mal die aktuellen Jobmarkt ansehe, das bedeutet die Job-Ads auf den ganzen Portalen, die suchen hier alle nur Senior-Positionen. Jetzt plaudern wir mal ein bisschen aus dem Nähkästchen an alle Leute, die jetzt gerade zuhören. Das sind nicht alles immer nur Senior-Positionen. Die Personalabteilungen sparen sich einfach den Aufwand, dieselbe Stelle mit reduzierten Anforderungen in Bezug auf die Anzahl der erforderten Jahre einfach als Mittellevel und als Junior und als Staff rauszupacken. Die wählen einfach nur Senior, weil das ist halt so ein Mittelding zwischen den hohen Karriereleveln und den niedrigen, und posten die einfach. Das bedeutet, auch wenn ihr jetzt noch kein Senior seid, auch wenn da jetzt fünf Jahre Erfahrung mit React steht, weiß ich nicht, gibt's das, gibt's React schon fünf Jahre, muss ich zugeben, weiß ich jetzt gerade nicht.",
      "start": 3407409,
      "end": 3455302,
      "confidence": 0.7909602649006622,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, wahrscheinlich.",
      "start": 3455322,
      "end": 3455863,
      "confidence": 0.3905,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf jeden Fall, wenn ihr das nicht erfüllen könnt, bewerbt euch trotzdem, denn die ganzen Leute posten die ganze Thematik einfach, um denselben Job nicht fünfmal zu posten, um die Leute nicht zu verwirren. Und Achtung, ich hab ja gerade erzählt, wie teuer Recruiting ist und wie teuer es ist, Werbeanzeigen zu schalten. Die wollen natürlich auch nicht den fünffachen Preis. für fünf Job Ads für eigentlich denselben Job zahlen.",
      "start": 3456263,
      "end": 3476667,
      "confidence": 0.8016857142857142,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was immer passieren kann, ist, dass man einfach im Bewerbungsgespräch gut ist oder halt weiterkommt und die sagen dann irgendwann, okay, vielleicht keine Seniorstelle, aber wir haben da noch eine Stelle oder sonst irgendwas. Also da würde ich mich auf keinen Fall abhalten lassen von irgendeinem Titel.",
      "start": 3476707,
      "end": 3489397,
      "confidence": 0.8120624999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich meine, überlegt euch mal, was passiert. Ihr macht eure Bewerbung fertig. In der Regel ist das eigentlich nur ein Lebenslauf. Das bedeutet, habt ihr ein gut gepflegtes LinkedIn-Profil, dann ist es das eigentlich schon, mehr oder weniger. Und macht euch nicht so viel Gedanken im Design vom Lebenslauf. Nehmt so ein Lebenslauf-Template von Word oder Microsoft, Apple Pages oder ähnliches. Ihr findet da schon was. Macht euch da nicht so viel Arbeit im Design. Es sei denn, ihr wollt, ist das euer Traumjob, dann ist das eine andere Geschichte, wenn ihr jetzt zu elastik wollt oder ähnliches und das ist euer wirklich hart Traumjob. Dann gibt es andere Strategien, diesen zu erreichen. Dann würde ich das nicht empfehlen, was ich jetzt gerade empfehle. Aber bewerbt euch einfach, weil Achtung, im Worst Case werdet ihr nicht eingeladen. Und dann? Dann ist irgendwie alles genauso wie jetzt auch, als hättet ihr euch nicht beworben. Also von daher macht euch da nicht so verrückt und werdet euch einfach bewusst, wie sieht eigentlich die Perspektive von dem Unternehmen aus? Warum machen die das so? Und die machen das so, um einfach Kosten und Aufwand zu sparen. Also das ist so meine Erfahrung in mehreren Firmen inzwischen.",
      "start": 3489809,
      "end": 3548852,
      "confidence": 0.7649117647058821,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ihr habt auch gerade kürzlich gehört, ihr habt leider vergessen, wo, aber dass Spezialisten eigentlich schätzen, dass 70 Prozent aller Bewerbungen, also Lebensläufe, nicht von Menschen gelesen werden, sondern mittlerweile von Algorithmen. Und die erste Vorsodierung basiert eigentlich von Algorithmen. Das heißt, du hast gar keinen Menschen dort. Das heißt, das Ziel eigentlich von dem CV ist, die richtigen Wörter dort drinnen zu haben, damit du in die nächste Runde kommst, wo dann ein Mensch darauf blickt.",
      "start": 3549639,
      "end": 3574873,
      "confidence": 0.7874155844155845,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja gut, aber das Keyword-Matching, das ist ja ein alter Hut. Denn die Leute, die in der Personalabteilung sitzen, die haben in der Regel nicht die fachliche Ahnung von dem, was sie da suchen oder einstellen. Dafür hast du ja oft den Hiringmanager und so weiter und so fort.",
      "start": 3575493,
      "end": 3589959,
      "confidence": 0.8136326530612242,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt, du meinst, es sind menschliche Roboter und Algorithmen, die da drüber schauen quasi. Also wenn es kein automatisierter Algorithmus ist, ist es die HA-Person, die auch nur am Algorithmus folgt, mehr oder weniger.",
      "start": 3590159,
      "end": 3601044,
      "confidence": 0.7454857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hatte viele Gespräche mit HR Personen, wo ich versucht habe zu erklären, was wir suchen, um halt weg von diesem Keyword Matching zu bekommen, weil diese Menschen kennen ja den Job nicht, weil sonst würden sie ja auch den Job machen und nicht in der Personalabteilung sitzen, aber dafür kann ich ja den Job eines Personalers ja auch nicht, das muss man ja auch ganz offen und ehrlich sagen.",
      "start": 3601424,
      "end": 3619515,
      "confidence": 0.8200999999999997,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, meiner Meinung nach sollte es der Hiringmanager eigentlich machen oder halt die Leute, die irgendwie Interviews machen, also die technischen Leute. Man kann natürlich irgendwelche CVs aussortieren, die gar nicht passen, so absolut falsch sind, aus einem falschen Bereich kommen, aber so grob würde ich dann sagen, wenn die grob ausgefiltert sind, die nächste Stufe sollten eigentlich technische Leute machen.",
      "start": 3620304,
      "end": 3639906,
      "confidence": 0.7905901639344259,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber es geht ja primär um das Filtering. Also nehmen wir mal ein Beispiel. Ich kriege jetzt einen Lebenslauf rein und da steht Erfahrung mit Apache Mesos. Ich suche aber hier hinten für jemand für Kubernetes. Ja, Mesos ist nicht Kubernetes, verstehe ich. Containertechnologien und Co., das bedeutet also die ganz komplette Grundtechnologie, das horizontale Skalieren, Nodes, Worker Nodes, Management Nodes, bla bla bla, ist alles dasselbe.",
      "start": 3640733,
      "end": 3661398,
      "confidence": 0.7052941176470587,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, darum meine ich ja. Also ich glaube, dass da eine technische Person das checken muss und die HR-Person sollte in dem Fall, auch wenn da JavaScript steht und das nach einem sinnvollen Profil aussieht, würde trotzdem auch die JavaScript-Person weiterleiten an den Hiring-Manager und diese Person entscheidet dann, der Hiring-Manager entscheidet, was dann passiert, ob dieses JavaScript-Profil auf deine Kubernetes-Anforderungen trotzdem irgendwie passen. Kann ja durchaus sein.",
      "start": 3662257,
      "end": 3685634,
      "confidence": 0.7900294117647059,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja gut, da bist du wieder in deiner schönen grünen Wiese Welt als Freelancer. So funktioniert halt die Industrie nicht, weil da ist es in der Regel so, zumindest war es vor Corona so, dass du mehr Bewerbungen reingekriegt hast als Stellen.",
      "start": 3685897,
      "end": 3700884,
      "confidence": 0.8194047619047619,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber wir haben das bei Trivago auch immer so gemacht. Wir waren halt hunderte Profile, die wir angeschaut haben, aber die waren alle manuell von Leuten aus den Interview-Pipelines gecheckt. Nie von HR-Personen. Zumindest in der gesamten Zeit, wo ich Hiring-Manager war, war das Aufgabe von uns Developern.",
      "start": 3700904,
      "end": 3718978,
      "confidence": 0.8078163265306125,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, ich hab das immer anders gemacht. Also ich hab das dann nicht so schön und sauber gemacht wie du, sondern bei mir hat das dann immer eine HR-Person gemacht.",
      "start": 3719398,
      "end": 3725243,
      "confidence": 0.5900333333333331,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also, wie gesagt, solche Profile wie, ich hab einen Wochenendkurs im Programmieren gemacht und war früher in einem anderen Job, die sind schon von HR ausgesiebt worden. Aber alles, was irgendwie nach IT ausgesehen hat, die sind durchgekommen.",
      "start": 3725707,
      "end": 3740751,
      "confidence": 0.8377631578947369,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, Moment mal. Aber hast du ... Da muss ich jetzt mal eingrätschen ganz kurz. Einer der besten Programmierer, die ich kenne, mit dem ich auch zusammenarbeiten durfte, war mal Maler und Lackierer. Ich glaub, Fahrzeugmaler und Lackierer. für fahrzeuge für autos und diese person die sehe ich immer mit einem lehrbuch also mit einem buch über diese person hat so viel wissen rein in seinem kopf und unglaublich talentiert die person sagte auch mal weil sie nicht den klassischen informatik background hat kompensiert diese person das mit sehr sehr viel fachbücher lesen was auch nicht geil ist aber unglaublich talentiert und co das bedeutet diese person hat mit hoher wahrscheinlichkeit größer an den d-jahren außerdem diese person hat dann sehr wahrscheinlich auch mal einen wochenendkurs im programmieren ja.",
      "start": 3740791,
      "end": 3786662,
      "confidence": 0.8263178294573645,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es geht nicht um den um den wochenendkurs an sich sondern einfach wenn jemand bis vor zwei wochen nicht programmieren hat können das war uns da einfach zu wenig also es war nicht das problem dass jemand quer einsteiger ist, Aber eine gewisse Programmiererfahrung haben wir einfach vorausgesetzt. Und meiner Meinung nach hat das eigentlich auch ganz gut funktioniert, weil wir haben so viel durchgeleitet bekommen an Müll, muss man auch dazu sagen, der recht schnell wieder ausgesiebt war. Also es ist schon sehr viel durchgekommen. Teilweise sogar die Wochenendkurse, sonst wüsste ich ja gar nicht von denen. Aber die ganzen Fälle, die ganz klar waren oder auch zum Beispiel, was ja auch ein großer Fall war, aus gewissen Ländern, wo es unmöglich ist, irgendwen dann nach Deutschland zu bringen damals, wurde von HR zum Beispiel auch aussudiert, weil die Unis nicht angerechnet werden können. Also wenn es rein legal nicht möglich ist, dann sind die auch aussudiert worden. Und wir hatten ja wirklich ein super Team bei Trivago, die das sehr professionell gemacht haben, aus der ganzen Welt Leute nach Deutschland gebracht haben und das rechtlich gecheckt haben. Aber es gibt natürlich gewisse Fälle, da.",
      "start": 3786702,
      "end": 3847403,
      "confidence": 0.8465918367346936,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist es nicht Ja gut, diese ganze Visa-Thematik und Aufenthaltsgenehmigungsthematik und das ist ein Thema für eine andere Episode, aber nicht mehr für heute.",
      "start": 3847423,
      "end": 3857772,
      "confidence": 0.70925,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wir hatten ja zum Beispiel eine Person aus Kuba auch bei Trivago. Ich glaube, er ist sogar immer noch bei Trivago, super Kollege gewesen. Also sogar aus Kuba schafft man es, Leute nach Deutschland zu bringen.",
      "start": 3857812,
      "end": 3869763,
      "confidence": 0.8451891891891893,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt haben wir so viel darüber gesprochen, Holger von Genz, würde ich mich schon noch dafür interessieren, wie hieß das Thema, was du heute vorhattest mit mir zu besprechen, bevor wir den Podcast aufgenommen haben? Was steht auf deinem Zettel?",
      "start": 3869991,
      "end": 3882238,
      "confidence": 0.8079000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich habe natürlich so ein Vorbereitungsdokument erstellt, da steht Engineering-Keyung ist Boss-Podcast und dann das Thema Template. Aber wie gesagt, es ist alles daraus entstanden. Damals, wie wir da gesprochen haben mit Adit über die PAM App und über Triviago, habe ich mir schon gedacht, ich muss mit Andi mal in der Tiefe besprechen, was er da eigentlich geleistet hat mit diesen ganzen Juniors und wo die jetzt alle mittlerweile gelandet sind. Unsere ganzen jungen Talente, die mittlerweile ja wirklich bei großen Firmen zu Hause sind und dass es eigentlich schon ziemlich cool ist. Und wie gesagt, meine Meinung, man vergisst diesen Bereich ganz oft als Firma und als Hiring Manager.",
      "start": 3882278,
      "end": 3916754,
      "confidence": 0.8069107142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, das hört sich jetzt aber so an, als machen wir einen Podcast, um uns selbst auf die Schulter zu klopfen, hey, wie geil sind wir denn? Das möchte ich jetzt nun mal nicht sagen. Ich habe auch sehr viele schlechte Highers gehabt und ich habe auch sehr viel Blödsinn gemacht in dieser ganzen Thematik, was ich nicht bereue, weil Fehler macht man, aber was ich gerne vermeiden würde. Also es lief halt nicht alles toll und grün. Wir haben jetzt hier vielleicht eine tolle Wiese präsentiert, aber die dunkle Seite, die könnte auch eine Stunde füllen.",
      "start": 3917157,
      "end": 3943157,
      "confidence": 0.7850618556701032,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie gesagt, bei Studierenden und den Juniors habe ich ganz wenig negative Erfahrungen gemacht und darum bin ich ein großer Verfechter von diesem Bereich und kann es nur immer wieder betonen, dass man diesen Bereich nicht vergessen sollte und ich hoffe, dass wir vielleicht irgendwen auch animiert haben, in diese Ecke Richtung Studierenden oder Juniors etwas mehr Zeit zu investieren und da im Hiring auch darauf zu achten. Und damit sind wir eigentlich schon am Ende von unseren Sommergesprächen, würde ich sie fast nennen. Es ist heiß, wir reden über irgendwelche Themen, du bist unvorbereitet. Für das haben wir doch relativ lange diskutiert.",
      "start": 3943457,
      "end": 3982459,
      "confidence": 0.8430679611650488,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bei dem nächsten Sommergespräch erwarte ich dann aber schon entweder ein kühles Bier oder halt so einen schönen aufgeretteten Aperol Spritz oder so.",
      "start": 3982479,
      "end": 3989964,
      "confidence": 0.7426086956521741,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn ich das nächste Mal in Duisburg bin, werde ich dir einen Aperol Spritz machen.",
      "start": 3989984,
      "end": 3993187,
      "confidence": 0.6185333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und falls ihr auch noch Lust habt, über solche Themen zu diskutieren, schaut auch mal einfach auf unserer Webseite engineeringkiosk.dev oder auch in den Shownotes. Da findet ihr den Link zu unserer Discord-Community. Inzwischen haben wir schon 95 Leute da und da entstehen eine ganze Menge coole Gespräche. Schaut einfach mal vorbei.",
      "start": 3994090,
      "end": 4011037,
      "confidence": 0.7994807692307693,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Meinst du jetzt übrigens die Leute sollen kommen zum diskutieren über Aperol Spritz und Bier oder über technische Themen?",
      "start": 4011497,
      "end": 4017684,
      "confidence": 0.7545263157894735,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin für alles zu haben. Also ich bin ja auch ein ganz großer Fan von Kornbrause, also Ahoi Brause. Kennst du die noch, die in den Tüten?",
      "start": 4017704,
      "end": 4025091,
      "confidence": 0.7664642857142859,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, das ist irgendwas deutsches. Ich bin mir nicht sicher, ob das jemals nach Österreich gefunden hat.",
      "start": 4025131,
      "end": 4028655,
      "confidence": 0.4621764705882353,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich war aber noch nie so ein Korn-Fanta-Typ wie auf den klassischen Dörfern. Also das war ich jetzt noch nicht. Und wir reden hier von dem günstigen Korn, nicht von diesem teuren. Also nicht so ein Doppelkorn, weil der schmeckt nicht.",
      "start": 4029021,
      "end": 4038045,
      "confidence": 0.7505365853658537,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ihr habt da einfach schlimme Trinkgewohnheiten in diesem Laden. In dem Sinne, damit wir da nicht noch tiefer gehen. Vielen Dank fürs Zuhören. Schaut bei uns in der Community vorbei, um über Aperol Spritz zu diskutieren. Und wenn euch diese Episode oder vielleicht irgendwelche anderen Episoden bisher ganz gut gefallen haben, bitte erzählt es weiter. Das ist das, was eigentlich am besten funktioniert, wenn ihr uns irgendwo bei Freunden empfehlt. Heißt das empfehlt oder empfiehlt? Schon wieder, in Tirol sagt man immer empfiehlt.",
      "start": 4038085,
      "end": 4064072,
      "confidence": 0.7735180722891566,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du fragst einen Duisburger aus dem Pott wegen deutscher Grammatik.",
      "start": 4064092,
      "end": 4066712,
      "confidence": 0.4250999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, egal. Es wissen, glaube ich, alle, was gemeint ist.",
      "start": 4066732,
      "end": 4068973,
      "confidence": 0.5774999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Viel Spaß, bis zum nächsten Mal.",
      "start": 4068993,
      "end": 4069893,
      "confidence": 0.427,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Tschüss. Ciao.",
      "start": 4069913,
      "end": 4070673,
      "confidence": 0.2605,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.7892318818629263,
  "audio_duration": 4077.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
