{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/a2fa63b5-953b-4273-8cce-93f5edb2fb0e/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62za7ve9h8-42b6-400f-b7aa-4342531928e3",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Das bedeutet, die akademische Laufbahn macht man nicht des Geldes wegen.",
      "start": 2646,
      "end": 7912,
      "confidence": 0.8970000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber der Titel alleine sagt nichts über Qualifikation aus. Alles, was ich so gesehen habe, ist wirklich hingerotzter Code.",
      "start": 7972,
      "end": 15441,
      "confidence": 0.867736842105263,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Viele Berufseinsteiger fragen sich, muss ich studieren um in der IT zu arbeiten? Mache ich nach meinem Bachelor noch einen Master? Soll ich direkt weitermachen und den Doktortitel anstreben? Und speziell die letzte Frage hat mein Podcast-Co-Host öfter gestellt bekommen. Deswegen dreht sich diese Folge um das Thema, lohnt sich ein Doktortitel und was bedeutet es eigentlich einen Doktortitel in der Informatik zu machen. Wolfgang stellt sich meinen Fragen und wir sprechen über Vorurteile über Doktoranden, warum ein Doktortitel immer so lange braucht, ob man Vor- oder Nachteile bei der Jobsuche hat, wie das ganze Thema Finanzen und Gehalt aussieht, was der akademische Spaß ist und für wen der Doktortitel eher nichts ist. Wir springen direkt rein. Viel Spaß. Podcast Episode einmal mit etwas, mit dem wir schon lange keine Podcast Episode mehr gestartet haben. Um die Stimmung etwas aufzulockern, wie immer, ich habe zwei Flachwitze vorbereitet.",
      "start": 19773,
      "end": 72203,
      "confidence": 0.8198299319727893,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und zwei Flachwitze, die eigentlich recht gut.",
      "start": 72263,
      "end": 75104,
      "confidence": 0.8470000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Zum heutigen Thema passen. Bist du bereit, Wolfgang?",
      "start": 75124,
      "end": 78185,
      "confidence": 0.6718750000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie immer bereit.",
      "start": 78206,
      "end": 79226,
      "confidence": 0.7010000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ist der Unterschied zwischen einem arbeitslosen Akademiker und einem, der einen Job hat? Der Arbeitslose sagt, einmal Currywurst mit Pommes. Der mit Job sagt, mach 3,50.",
      "start": 79266,
      "end": 88559,
      "confidence": 0.7983333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ein Klassiker, ja. Ich kenne ihn natürlich. Bei uns erzählt man sich den immer über irgendwelche Geisteswissenschaftler.",
      "start": 88569,
      "end": 93635,
      "confidence": 0.6118823529411764,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich habe den auch schon im Internet mit Ingenieuren gefunden. Also ich glaube, der zieht sich so durch. Der zweite ist aber auch nicht schlecht und ich finde, der passt so noch ein Tick besser zum heutigen Thema. Wie bezeichnet man einen Toilettenbesucher, der eine akademische Ausbildung hat?",
      "start": 93655,
      "end": 105788,
      "confidence": 0.7990408163265306,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Klugscheißer?",
      "start": 106348,
      "end": 107148,
      "confidence": 0.44,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Richtig. So flach kann es kommen.",
      "start": 107228,
      "end": 113230,
      "confidence": 0.8056666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das ohne Vorbereitung, dass ihr das beide kennt.",
      "start": 113270,
      "end": 116451,
      "confidence": 0.7064444444444445,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Worüber sprechen wir heute? Wir sprechen über, Achtung, Bildung. Wir sprechen über den Doktortitel, nämlich den höchsten akademischen Grad, den man, glaube ich, selbst erlangen kann, wenn ich richtig informiert bin.",
      "start": 116491,
      "end": 130214,
      "confidence": 0.8889677419354838,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wieso? Du kannst ja Universitätsprofessor oder so werden.",
      "start": 130253,
      "end": 132555,
      "confidence": 0.485,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das kann man glaube ich aber nicht selbst erlangen, sondern dafür ist eine Habilitation notwendig und da wird man dazu ernannt, soviel ich weiß. So.",
      "start": 133175,
      "end": 142198,
      "confidence": 0.85276,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube nicht, dass da ein großer Unterschied dazwischen ist. Vielleicht ist da irgendwas rechtliches. Habilitieren tust du ja trotzdem selber, aber vielleicht wirst du da ernannt. Das kann schon irgendwie sein. Aber ernannt wirst du zum Doktor wahrscheinlich auch. Egal.",
      "start": 142258,
      "end": 154042,
      "confidence": 0.6328780487804879,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Regelmäßige Hörerinnen und Hörer dieses Podcasts wissen nämlich, dass ich als Bachelorand aka Studienabbrecher, wie Wolfgangs Professor es immer genannt hat.",
      "start": 154082,
      "end": 162965,
      "confidence": 0.848,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hast du schön gesagt. Mein Professor hat das immer gesagt. Ich sagte es natürlich nie.",
      "start": 163025,
      "end": 166446,
      "confidence": 0.6181875,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Regelmäßige Hörerinnen und Hörer wissen, dass ich die Ehre habe, mit jemandem diesen Podcast zu machen, der den höchsten akademischen Grad besitzt. Willkommen, Dr. Wolfgang Gassler.",
      "start": 166486,
      "end": 177430,
      "confidence": 0.8036538461538462,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Vielleicht sollte man dazu sagen, dass der Doktor ein ziemliches Problem mit diesen Titeln hat und sie ganz ungern irgendwo aufführt.",
      "start": 177670,
      "end": 184556,
      "confidence": 0.8537142857142858,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das können wir gerne sagen. Es spielt aber für diese Episode keine Rolle, denn wir sprechen, wie man zu diesem Doktortitel kommt, ob es sich lohnt und ob man den Titel überhaupt für die Ausübung des Berufes in der Informatik als Softwareentwickler, Produktmanager, Data Science Engineer, Machine Learning, Engineer, AI-Engineer, ML-Ops-Engineer, DevOps, Grafiker oder wo auch immer ihr im Tech-Sektor unterwegs seid benötigt. Oder ob das nicht alles einfach nur viel zu viel verschwendete Zeit und Mühen ist.",
      "start": 184597,
      "end": 217202,
      "confidence": 0.8636666666666662,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was man denn eigentlich alles so macht als Doktor? Also auf dem Weg in diese Wissenschaft?",
      "start": 217242,
      "end": 222325,
      "confidence": 0.853470588235294,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, meine Key-Frage ist eigentlich, und zu der kommen wir später natürlich hoffentlich auch, warum brauchen alle Doktorandnehmer so lange? Also deswegen möchte ich von dir auch die ehrliche Antwort nicht nur, was laut Lehrplan vorgeschrieben ist, was man machen muss, irgendwie erfüllen muss, sondern auch, was Doktoranden bzw. angehende Doktoranden denn wirklich machen. Aber fangen wir mal ganz vorne an. Ich hab mich zur Vorbereitung dieser Episode ein bisschen in den Doktortitel eingelesen und hab mich erst mal gefragt, wenn das der höchste akademische Grad ist, was kommt da vor? Weil ich kann da nicht von 0 auf 100 einsteigen. Deswegen muss ich in der Regel nach dem Abitur beziehungsweise nach dem Fachabitur, so heißt es zumindest in Deutschland, wie heißt das in Österreich? Matura?",
      "start": 222906,
      "end": 267763,
      "confidence": 0.8268571428571431,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Matura, genau.",
      "start": 267823,
      "end": 268904,
      "confidence": 0.7090000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gibt es auch ein Fachabitur oder heißt das dann Fachmatura?",
      "start": 268924,
      "end": 271548,
      "confidence": 0.7542000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du meinst sowas, was dann so in einem Beruf auch ausbildet, aber gleichzeitig mit Matura? Also dass du zum Beispiel irgendwie Maschinenbauer machst und noch die Matura?",
      "start": 271998,
      "end": 281604,
      "confidence": 0.7905185185185184,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, genau. Also dass du so ein spezialisiertes Abitur machst.",
      "start": 281664,
      "end": 284566,
      "confidence": 0.6745,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So was gibt es bei uns auch.",
      "start": 284606,
      "end": 285687,
      "confidence": 0.7202857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn du sowas hast, dann kannst du entweder an eine Universität oder an eine Fachhochschule. Es gibt auch diverse Konstellationen, wenn du n Jahre im Beruf bereits bist, dass du mit einem Eignungstest ohne Abitur auf eine Fachhochschule kommen kannst und da dann inzwischen deinen Bachelorabschluss machen kannst. Für den Bereich, in dem wir unterwegs sind, das bedeutet Informatik und Tech-Sektor, ist das in der Regel ein Bachelor of Science. Manche Fachbereiche gehen dann auch in den Bachelor of Arts. Früher hieß die ganze Sache dann in Deutschland zumindest Diplom, das wurde dann durch den Bologna Prozess in Europa vereinheitlicht auf Bachelor und Master. Wie hieß das Diplom früher in Österreich?",
      "start": 285707,
      "end": 326263,
      "confidence": 0.8254324324324325,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Diplomstudium.",
      "start": 326624,
      "end": 327746,
      "confidence": 0.693,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auch Diplom.",
      "start": 327766,
      "end": 328227,
      "confidence": 0.7855000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe ja sogar den Diplom-Ingenieur, es war noch ein Diplom-Studium.",
      "start": 329436,
      "end": 333139,
      "confidence": 0.6742727272727274,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, beim Diplom gab es da natürlich noch diverse Spezialisierungen, das ist glaube ich in dem Bologna-Prozess durch dieses Bachelor of Science, Bachelor of Arts, Bachelor of Laws und Co. abgebildet. Nach dem Bachelor hat man natürlich immer die Möglichkeit, in die Industrie zu gehen bzw. in den richtigen Beruf. Oder man sagt, man macht weiter, dann geht man zum Masterstudiengang. Meines Wissens nach kann man keinen Masterstudiengang anfangen ohne einen Bachelor zu haben. Und wenn man dann diesen Masterstudiengang hat, dann kann man sich, glaube ich, bei einem Doktorvater für einen Doktortitel bewerben. Ist das richtig?",
      "start": 333179,
      "end": 372234,
      "confidence": 0.8294329896907213,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, da gibt es grundsätzlich viele Möglichkeiten. Kann natürlich auch eine Dr. Mutter sein, übrigens.",
      "start": 372254,
      "end": 376055,
      "confidence": 0.8194,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gibt es in dem Bereich Gendern?",
      "start": 376075,
      "end": 377555,
      "confidence": 0.779,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Doktorin, natürlich.",
      "start": 377595,
      "end": 379976,
      "confidence": 0.644,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Heißt das dann im Fachbegriff, ich habe da eine Dr. Mutter?",
      "start": 379996,
      "end": 382277,
      "confidence": 0.6611818181818182,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da bin ich ehrlich gesagt überfragt.",
      "start": 382297,
      "end": 383978,
      "confidence": 0.8193333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Weil ich kenne nur den Begriff Dr. Vater, aber ich weiß natürlich, was du meinst. Also eine weibliche Professorin.",
      "start": 383998,
      "end": 389800,
      "confidence": 0.8023684210526315,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist sowieso ein sehr schräger Titel, eigentlich dieses Dr. Vater. Also ich habe mit dem nie so viel anfangen können. Ich habe übrigens jetzt noch mal schnell nachgelesen, weil hat mir natürlich keine Ruhe gelassen und ich habe mir auch erinnern können, ich hatte eine Diskussion kürzlich mit jemanden, ich glaube sogar mit jemanden von unseren Hörern, wenn ich das richtig im Kopf hatte und da merkt man schon, wie egal mir eigentlich diese ganzen Titel sind, weil das, was du mit dem akademischen Grad gesagt hast, dass der Doktor der Höchste ist, das stimmt natürlich, weil es relativ wenig akademische Grade gibt und der Rest sind Titel, so wie der Universitätsprofessor oder Professor oder Wie in Österreich, haben wir ja schon mal darüber gesprochen, gibt es eine Liste von 200 Titeln oder sowas. Und da müsste man eigentlich das fein unterscheiden, was ist ein akademischer Grad, was ist ein Titel. Und daher kommt das Ganze, dass Doktor eigentlich der höchste akademische Grad ist. Aber wie gesagt, mir ist das eigentlich alles so egal, diese ganze Titel- und akademische Grad-Weltgeschichte. Mir geht es mehr dahinter, was da abläuft und weniger um diesen. Ich nenne es trotzdem noch Titel, auch wenn es ein akademischer Grad ist, natürlich offiziell.",
      "start": 389840,
      "end": 452028,
      "confidence": 0.7972403846153843,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf jeden Fall habe ich gerade gesagt, dass man in der Regel einen Masterabschluss braucht, um den Pfad des Doktors bzw. Doktorandten einzuschlagen, aber dann habe ich auch noch mal nachgeguckt und zwar wird gesagt, in Ausnahmefällen und je nach Bundesland können besonders qualifizierte Absolventen von Fachhochschulen bzw. Bachelorabsolventen anderer Hochschulen im Rahmen einer Eignungsprüfung ebenfalls zur Doktorstelle zugelassen werden. Dies setzt jedoch meist zusätzlich zu erbringende Studienleistungen auf Masterniveau voraus, die mehrere Semester umfassen können. Was dann das im Detail wieder heißt, weiß ich jetzt auch nicht, aber was es besagt, theoretisch ist es möglich mit einem Bachelorabschluss den Pfad zur Promotion einzuschlagen. Hast du sowas schon mal miterlebt?",
      "start": 452368,
      "end": 498277,
      "confidence": 0.821954545454546,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist ganz allgemein eigentlich an der Uni so, dass sehr viel geregelt ist, aber auch sehr viel möglich ist. Und bei uns in Österreich geht ja immer irgendwas. Und es gibt natürlich ganz viele Ausnahmen und es läuft auch an jeder Uni leicht anders ab. Es gibt sogar innerhalb der Unis in allen Fachbereichen und so weiter Unterschiede. Also alles, was wir jetzt besprechen, ist natürlich nicht gültig irgendwie für ganz Europa, sondern da gibt es natürlich überall feine, kleine Unterschiede. Aber im Großen und Ganzen ist es ähnlicher, als man denkt, zumindest was ich mitbekommen habe, mit Leuten, denen ich gesprochen habe, auch international. Natürlich gibt es, gerade wenn man in Amerika oder so in dem Bereich was macht, ist da schon ein großer Unterschied. Aber ich würde mal sagen, in Europa ist es im Informatik-, im IT-Bereich doch relativ ähnlich. Es gibt aber teilweise extreme Unterschiede, jetzt wenn du Grammatik studierst zum Beispiel oder Informatik, da kann es an derselben Uni schon extreme Unterschiede geben. Und ich kann mich erinnern, wir hatten auch mal zum Beispiel, wie bei uns die Wirtschaftsinformatik neu eingeführt wurde, wenn jetzt Wirtschaftsinformatiker dann den technischen Doktor machen wollten, dann hatte man da zum Beispiel auch immer einen manuellen Prozess, das musste ja angerechnet werden, du musstest eventuell ein, zwei Dinge nachholen, theoretische, damit du den technischen, klassischen Doktor der Informatik überhaupt machen kannst, weil die Wirtschaftsinformatik eben sehr wirtschaftslastig war, zum Beispiel. Also da gibt es immer solche Prozesse und das ist teilweise wirklich abhängig von der aktuellen Person, die gerade verantwortlich ist, um das zu entscheiden.",
      "start": 498317,
      "end": 585098,
      "confidence": 0.8328000000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Super Studie gegangen außerdem. Nur mal so als Nebensatz der Wirtschaftsdiplomatik. Superb. Chefkiss. So, dann hat man jetzt diesen Doktortitel und was kann man dann machen? Eine abgeschlossene Prohibition ist in der Regel eine Voraussetzung zur Habilitation. Habil... Habil... Habilitierung? Wenn man die Route des Professors einschlagen möchte, oder der Professorin, dann ist in der Regel ein Doktortitel von Notnöten. Es gibt natürlich immer Wege und Mittel und ja, jemand kann auch ernannt werden und allem drum und dran. Man hört ja immer wieder, ich glaube letztens wieder, dass irgendwie so ein 20-jähriger Professor jetzt irgendwo geworden ist.",
      "start": 585978,
      "end": 619957,
      "confidence": 0.7876632653061225,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Diese Habilitierung ist übrigens auch so ein deutsches Phänomen, interessanterweise. Es gibt es in Europa, in anderen Ländern kaum und wird daher auch immer weniger wichtig im deutschsprachigen Raum, weil du natürlich auch internationale Professorinnen anziehst und du kannst es nicht voraussetzen im internationalen Bereich und darum ist es zwar schon noch existent, aber meines Wissens wird es auch immer weniger wichtig in der Wissenschaft. Was man vielleicht auch noch dazu sagen muss, meine Zeit an der Uni, ich habe zwar sehr lange an der Uni verbracht, über 30 Semester, weit über 30 Semester, also es war eine lange Zeit und war dann natürlich auch angestellt, aber die Zeiten ändern sich auch und ich habe natürlich nicht mehr so viel Einblick wie früher, muss man auch dazu sagen, obwohl ich natürlich schon mit Leuten noch über den ganzen Themenkomplex spreche und in so einem Bereich wie der Wissenschaft und der Universität, die es seit Jahrhunderten gibt, ändert sich auch nichts von heute auf morgen.",
      "start": 620497,
      "end": 674433,
      "confidence": 0.8068963414634147,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber wie kommen wir überhaupt eigentlich zu dem Thema? Und zwar hast du, Wolfgang, das Thema für den Engineering Kiss vorgeschlagen, weil du doch recht regelmäßig Fragen dazu bekommst. Ist das richtig?",
      "start": 674733,
      "end": 685445,
      "confidence": 0.8160937500000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, und die Frage, die ich eigentlich am häufigsten bekomme, die mir Leute stellen, die vielleicht gerade im Masterstudium sind oder vielleicht sogar noch im Bachelorstudium, Soll ich das Masterstudium machen und soll ich vielleicht dann sogar Doktorat dranhängen? Macht das Sinn oder nicht? Und das überlegen sich doch sehr viele Leute und man muss ja auch sagen, man hat eigentlich sehr wenig Einblick davor, was eigentlich so in einem Doktoratstudium passiert überhaupt, was das bedeutet. Und auch ich hatte eigentlich null Ahnung. Mich hatte mein Professor damals reingequatscht in diesen Job und es hat interessant geklungen, aber ich hatte keine Ahnung, was das eigentlich bedeutet.",
      "start": 685485,
      "end": 718624,
      "confidence": 0.7861509433962266,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich kann mich noch erinnern, als ich mein Bachelorstudium begonnen habe, dann gab es vorher immer so Informationsveranstaltungen, dass du dich, Achtung, informieren konntest. Gibt es sowas vor dem Doktor nicht mehr?",
      "start": 719060,
      "end": 727905,
      "confidence": 0.72940625,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Glaube nicht. Auch da muss man wieder sagen, es ist so unterschiedlich. Jeder Professor, jede Professorin handhabt es ganz anders. Und alleine in jeder Forschungsgruppe, also zu jedem Full-Prof, wie man so schön sagt, also ein Full-Prof, hat meistens eine Forschungsgruppe, also Angestellte, ist so wie ein kleines Forschungsteam, Forschungsgruppe auch oft, an vielen Unis heißt es Institut, je nachdem wie das aufgegliedert ist, und auch da unterscheidet sich schon ein Professor von der anderen Professorin extrem, einfach im Umgang, wie geforscht wird, wie gearbeitet wird, was erwartet wird, wie in einer großen Firma. Da kann ein Team auch ganz anders arbeiten als ein anderes Team, was im Raum weitersitzt. Insofern ist es schwierig, da eine Infoveranstaltung zu haben. Klar, du kannst nachlesen, was du da machen musst, aber das sind halt die Formalien und die decken halt 5% von dem ab, was du dann eigentlich machst. Das sind halt die 5%, die fix sind. Du musst ein paar Kurse machen, that's it, wie in einem normalen Studium, aber das sind irgendwie auf paar Jahre verteilt, sind das irgendwie 10 Semesterstunden oder noch weniger. Das ist irrelevant.",
      "start": 727945,
      "end": 790102,
      "confidence": 0.8151122994652406,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Fangen wir mal mit den Basissachen an. Ich habe jetzt meinen Master abgeschlossen. Glückwunsch für alle erfolgreichen Masterstudenten und Studentinnen.",
      "start": 791002,
      "end": 800173,
      "confidence": 0.7511500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Studierende ist das einfachste.",
      "start": 800213,
      "end": 801995,
      "confidence": 0.733,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Studierende, das in der Tat ist wirklich einfach. Und wie überall in der Welt geht es erstmal ums Geld. Bildung ist in Deutschland zumindest zu einem Großteil gratis. Natürlich hat man diese Semestergebühren, aber ich sag mal im Vergleich zu Ländern wie den Vereinigten Staaten von Amerika würde ich unser Bildungssystem als gratis bezeichnen.",
      "start": 802055,
      "end": 823105,
      "confidence": 0.8634074074074076,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn es zumindest keine privaten Hochschulen sind.",
      "start": 823497,
      "end": 826779,
      "confidence": 0.8779999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, also das, was wir hier besprechen mit Bachelor und Master oder so Doktorand, das kann man natürlich auch an privaten Universitäten und Fachhochschulen machen, wie zum Beispiel die FOM oder die IU, verlinken wir auch alles in den Show Notes, das kann man dann auch berufsbegleitend machen. Meine Frage ist eigentlich, welche Kosten entstehen bei einer Promotion? Oder ist die Promotion auch gratis und vom Staat getragen?",
      "start": 826819,
      "end": 848270,
      "confidence": 0.8096470588235296,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also auch da gibt es natürlich wieder Unterschiede, aber meines Wissens auch in Deutschland ist es so, dass du natürlich da wo es Studiengebühren gibt, die halt dementsprechend zahlst, egal ob du jetzt Master oder Doktor bist. In Österreich bist du wirklich noch weiterhin Student, du bist eingetragen, musst Studiengebühren zahlen, du bist also wirklich vollständiger Student. In Deutschland ist es meines Wissens teilweise anders, da bist du kein Student mehr, aber es kommt auch darauf an, wieder wo du bist und dementsprechend kommen aber allgemein wenig Kosten auf dich zu, wenn es darum geht, was kostet das Doktorat an sich. Was die eigentlichen Kosten natürlich sind, ist, dass du irgendwie leben musst und üblicherweise, gerade in der Informatik, hast du eine Anstellung an der Uni in irgendeiner Form, Aber gerade in anderen Studienrichtungen, wenn du irgendwas geisteswissenschaftliches studierst und da einen Doktor machst, ist es ganz oft so, dass da keine Stellen zur Verfügung sind und du das selbst finanzieren musst, dir vielleicht irgendwelche Stipendien suchen musst. Also da gibt es Möglichkeiten natürlich, aber es ist viel, viel schwieriger als in der IT, wo du meistens sehr viel Projektgeld hast, sehr viel Drittmittelgeld, also Geld, das durch Forschungsprojekte, die eingereicht wurden bei irgendwelchen Forschungsfonds, verwendet werden kann für diverse Stellen und das sind ganz oft Doktoratsstellen.",
      "start": 848758,
      "end": 920618,
      "confidence": 0.8043041474654378,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hattest gerade ein Stipendium angesprochen. Nur nochmal zum Gleichziehen unseres Wissens. Ein Stipendium ist, ich bewerbe mich irgendwo, stelle meine Leistungen dar und diese Stiftung oder wer auch immer dieses Stipendium ausstellt, bewertet dann, okay, bin ich gut genug, um dieses Stipendium zu bekommen und die zahlen mir dann einen monatlichen Beitrag, damit ich meine Lebenshaltungskosten finanziert habe, damit ich mich voll auf die Forschung konzentrieren kann. Ist das richtig?",
      "start": 920658,
      "end": 945387,
      "confidence": 0.8005633802816902,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, das wäre so die Idee. Das kann natürlich von einem simplen Zuschuss von 500 Euro reichen, einmal damit du deine Doktorarbeit drucken kannst, das gilt teilweise auch als Stipendium, bis zu natürlich wirklich über Jahre hinweg, dass du monatlich einfach Geld bekommst, damit du die Freiheit hast zu studieren. Das kann von privaten Einrichtungen kommen, von Stiftungen, ganz viel staatliche Unterstützung natürlich auch von der Universität selbst. Also es kann von überall natürlich herkommen an sich und da gibt es auch Möglichkeiten. Aber ich kenne auch ganz viele Leute, die einfach neben dem Doktorat gearbeitet haben, gerade im geisteswissenschaftlichen Bereich und, wie du sagst, deine Currywurst serviert haben, damit sie sich über Wasser halten.",
      "start": 945627,
      "end": 984290,
      "confidence": 0.8260608695652172,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hattest du den Luxus ein Stipendium zu genießen?",
      "start": 984633,
      "end": 987435,
      "confidence": 0.70125,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Er hatte mal später ein kleines Stipendium, aber ich hatte einfach den Vorteil, dass ich eine ganz normale Stelle bekommen habe, damals auf vier Jahre befristet. Das ist so die übliche Zeit in Österreich für eine klassische Stelle. In Deutschland ist es, glaube ich, in einem ähnlichen Umfang. Es gibt natürlich diese Industriedoktoren, nennt man das. Das heißt, es ist üblicherweise dass die Firma, bei der du schon arbeitest, dir den Doktor bezahlt und du den in Zusammenarbeit mit einer Uni machst und eigentlich eher so beim Industrieunternehmen sitzt. Die sind üblicherweise kürzer angelegt, also die sind in dem Bereich von drei Jahren meistens Ich glaube, ich habe sogar im Kopf, dass das teilweise nur zwei Jahre gehen kann, theoretisch. Also die sind üblicherweise ein bisschen kürzer angesetzt und sind halt dann auch für die Firma von Vorteil, weil die halt aus diesem Forschungsergebnis dann im Idealfall was rausziehen können. Also BMW, die großen Autokonzerne sind dann natürlich ganz vorne dabei. Die arbeiten dann mit irgendwelchen Unis zusammen, wo es halt dann um irgendwelche Forschungsbereiche geht für die Automobilindustrie. Und die zahlen dir dann dementsprechend dein Doktorat. Also das gibt es auch. wird oft in der Wissenschaft so ein bisschen belächelt als zweitklassiger Doktor, weil der halt kürzer ist, wird man sehr schnell durchgedrückt und die Firma bezahlt das alles. Also es wird immer so, vor allem von der anderen Seite natürlich, so ein bisschen belächelt als nicht so ernstzunehmender Doktor, weil viel Geld im Spiel ist, eine Firma dabei ist und es meistens auch noch schneller durchgedrückt wird.",
      "start": 987495,
      "end": 1073885,
      "confidence": 0.8147837837837835,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist das vielleicht so ein bisschen, weil in der Firma vielleicht eine harte Deadline da ist und in der Forschung nicht, sondern der angehende Doktor da sich einen Laun machen kann, ein bisschen relaxen kann und auch kommst du heute nicht, kommst du morgen und vielleicht finde ich ja doch noch was in der Forschung und in der Firma vielleicht ein bisschen mehr dahinter steckt?",
      "start": 1074626,
      "end": 1091562,
      "confidence": 0.7602307692307693,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das ist natürlich immer diese Frage, was ist Forschung, was ist Grundlagenforschung vor allem und was ist dann angewandte Forschung und bei der Industrie ist es natürlich am ehesten immer die angewandte Forschung, möglichst nah an der Industrie und darum wird es halt auch ein bisschen belächelt, weil es halt nicht so als ernstzunehmende Forschung, wirklich Grundlagenforschung angesehen wird.",
      "start": 1091822,
      "end": 1110932,
      "confidence": 0.82295,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Für mich als Praktiker ist aber auch genau die angewandte Forschung die relevante Forschung, oder? Denn die angewandte Forschung findet, Achtung, sofort einen Anwendungsfall, wo natürlich dann die, weiß ich nicht, welcher Forschungsarten gibt es noch, hattest du gerade gesagt?",
      "start": 1111452,
      "end": 1123456,
      "confidence": 0.76155,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Grundlagenforschung.",
      "start": 1123956,
      "end": 1125297,
      "confidence": 0.395,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die Grundlagenforschung, das mag dann was super sein und vielleicht hat man dann den Durchbruch in 20 bis 30 Jahren. Aber die angewandte Forschung hat natürlich einen relativ schnellen Effekt, weil die ja doch sofort in Produktion gesetzt wird, oder? Verstehe ich das gerade falsch?",
      "start": 1125317,
      "end": 1136581,
      "confidence": 0.7339777777777775,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich, aber wenn du natürlich als Gesellschaft dich weiterentwickeln willst, ist die Grundlagenforschung die Wichtige. Also es sind natürlich beide Seiten wichtig in irgendeiner Form, aber du entwickelst dich natürlich nur weiter, wenn du auch irgendwelche Durchbrüche hast und langfristig auch Forschung betreibst und nicht nur immer das, was du in einem Monat möglichst schnell oder in ein paar Jahren möglichst schnell umsetzen kannst.",
      "start": 1136892,
      "end": 1157620,
      "confidence": 0.81303125,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, also das sagt mir also eigentlich auch, dass Doktoranden an einer Universität also auch gehässig sind und wenig Respekt haben für die andere Seite, denn du sagtest ja auch, beides braucht man.",
      "start": 1158381,
      "end": 1168215,
      "confidence": 0.7995757575757576,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, natürlich und gerade in der Informatik ist das natürlich ein super großes Thema, weil in der Informatik hast du ganz viel angewandte Forschung und da ist auch immer der Streit, was ist Grundlagenforschung, was ist angewandte Forschung. Aber Informatik ist per se schon sehr angewandt, würde ich mal sagen. Es gibt natürlich theoretische Informatik und wo es dann sehr in die mathematische Ecke geht, das ist dann definitiv Grundlagenforschung. Aber gerade wenn es darum zum Beispiel geht, ein Forschungsprojekt einzureichen und Förderung zu bekommen, also Geld für Forschungsprojekte, da sind viele Förderprogramme limitiert auf Grundlagenforschung und da fängt man dann sehr gern Streiten an, was ist wirklich Grundlagenforschung und wenn ich jetzt in der Softwareentwicklung irgendwas entwickle, weiterentwickle, irgendwelche Modelle, ist es dann Grundlagenforschung oder ist es eigentlich eine angewandte Forschung und das könnte eine Firma genauso machen.",
      "start": 1168708,
      "end": 1215708,
      "confidence": 0.7860647482014386,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hattest gerade gesagt, wenn man Glück hat, hat man eine Stelle, da ging es um, wie verdiene ich Geld. Wenn du von Stelle sprichst, sprichst du dann über eine Anstellung als wissenschaftlicher Mitarbeiter an der Universität oder, also das ist zumindest das, was ich öfter mal so höre, oder was heißt Stelle?",
      "start": 1216040,
      "end": 1232058,
      "confidence": 0.8309056603773585,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, du bist dann wissenschaftlicher Mitarbeiter oder Mitarbeiterin, bekommst Geld, sehr wenig Geld, kann ich gleich mal vorausschicken, können wir noch im Detail darüber sprechen, und bist dann an der Universität üblicherweise angestellt im Rahmen von der fixen Stelle, die es dort gibt, die einfach durchrotiert. Jede Professorin hat zum Beispiel fünf Stellen, immer vier Jahresverträge. Da rotieren dann DoktorandInnen durch. Oder es wurde ein Projekt eingeworben, also Geld eingeworben. Das müssen Unis ja auch machen, beziehungsweise Forschungsgruppen. Und wenn man da Geld eingeworben hat, kann man natürlich auch Leute auf so einem Projekt anstellen. Das ist eine Projektstelle, da arbeitest du dann wirklich an diesem Projekt und forschst an diesem Forschungsprojekt. Und sonst bist du ein bisschen freier, wenn du so eine fixe Stelle hast.",
      "start": 1232458,
      "end": 1279807,
      "confidence": 0.821857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was verdient man da?",
      "start": 1279827,
      "end": 1280468,
      "confidence": 0.71375,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich habe es jetzt mal gecheckt, um gerade den Industriedoktor auch wieder reinzunehmen, also BMW zahlt zum Beispiel 2700 Euro brutto.",
      "start": 1281108,
      "end": 1290712,
      "confidence": 0.7814545454545456,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Pro Monat für das Schreiben der Doktorarbeit und die Forschung.",
      "start": 1290752,
      "end": 1294834,
      "confidence": 0.8158,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, über drei Jahre und aktuell für eine Doktorstelle in Österreich. Ich glaube, Deutschland ist da nicht sehr weit weg, unterscheidet sich auch wirklich teilweise pro Uni, pro Bundesland natürlich. Brauche ich aber nur mal so um eine Größenordnung zu nennen in Österreich. Die offiziellen Sätze für eine Doktorandin sind 2400 brutto, das sind 34.000 brutto Jahresbezug. für eine 30-Stunden-Stelle. Es ist einfach auf 30 Stunden fixiert, weil man davon ausgeht, dass du sowieso 40 Stunden oder 70 Stunden arbeitest. Keine Ahnung, es ist trotzdem irgendwie auf diese 30 Stunden beschränkt. Vielleicht damit du nicht irgendwo unter Mindestgehalt oder so fällst. Bei mir waren das sogar noch 20 Stunden. Ich hatte offiziell eine Halbtagestelle, die sehr gut bezahlt war für eine Halbtagestelle. Aber ich war natürlich trotzdem irgendwie meine 50, 60 Stunden an der Uni.",
      "start": 1294854,
      "end": 1345971,
      "confidence": 0.7407777777777776,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe gerade mal grob den Gehaltsrechner angeschmissen, damit wir mal eine Zahl haben, weil Bruttogehälter sind immer schwierig. Natürlich, Nettogehälter kann man nicht generell ausrechnen, ist abhängig davon, wie alt du bist, Krankenkasse.",
      "start": 1346011,
      "end": 1359301,
      "confidence": 0.7945882352941176,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau auf netto sagen. Ist in Österreich 1800 netto?",
      "start": 1360182,
      "end": 1363843,
      "confidence": 0.6504444444444444,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "In Deutschland sind es bei 2,4 brutto, circa 1,6 netto. Wenn man Steuerklasse 1 setzt, in Nordrhein-Westfalen und Kirchensteuer noch zahlt und keine Kinder hat, dann tingelt man so bei 1,6, 1,7 netto rum. Was natürlich dann, wenn ich jetzt mal überlege, man muss noch Miete zahlen, man hat auch eine Versicherung, ich sag jetzt mal man hat kein Auto, Aber die Miete zahlt man in Berlin, in Stuttgart, in München, in Leipzig, in Düsseldorf, in Hamburg. Das sind ja alles keine Städte, wo man eine gute Wohnung für wenig Geld kriegt. Inflation, darüber sprechen wir schon mal gar nicht, aber 1,6. Also ich würde sagen, das wird dann so ein klassisches Leben mit WG und allem drum und dran, oder?",
      "start": 1363883,
      "end": 1405997,
      "confidence": 0.795669421487603,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Auf jeden Fall, ja. Also es ist wahrscheinlich ein bisschen mehr, weil diese 2,4 wie in Österreich haben einen 13., 14. Monatsgehalt. Das heißt, du müsstest auf Jahresbrutto rechnen. Dann bist du wahrscheinlich bei euch auch irgendwo bei den vielleicht sogar in Richtung 2.000 Euro netto unter Umständen oder 1.900. Aber wie gesagt, kommt auch darauf an, wo das ist, in welchem Bundesland, in welcher Stadt.",
      "start": 1406037,
      "end": 1428423,
      "confidence": 0.7424545454545454,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das mit dem 13. und 14. Monatsgehalt, ist das im Gesetz bei euch verankert?",
      "start": 1428844,
      "end": 1431929,
      "confidence": 0.6080714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ist bei uns immer so.",
      "start": 1431949,
      "end": 1433651,
      "confidence": 0.8518333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bei uns nämlich nicht.",
      "start": 1433691,
      "end": 1434412,
      "confidence": 0.434,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich weiß, bei uns ist das noch steuerlich begünstigt und so weiter. Es ist immer schrecklich zum Umrechnen. Darum ist es mit Monatsgehältern immer so schwierig, mit Deutschland, Österreich. Darum ist der Jahresbruttogehalt. eigentlich am interessantesten, gerade zur Information, weil man ja oft denkt, okay, man macht diesen Doktor und steigt dann in der Wissenschaft weiter ein als Post-Doc, also wenn man einen Doktor hat, dann kann man als Post-Doc-Forscher einsteigen, beziehungsweise Senior Post-Doc weitergehen bis zu Professor, natürlich Professorin, aber nur, um mal so ein Gefühl zu bekommen, also wenn du jetzt den Master fertig hast. Dann kannst du Doktorat machen, bekommst jahresbrutto zum Beispiel 34.000 Euro. Ich würde mal viel, viel wetten in der Informatik, dass du in der Wirtschaft mehr bekommst. Also garantiert mehr, egal wo, in Deutschland und auch in Österreich bekommst du wahrscheinlich mehr als dieses Doktorat. Jetzt könnte man argumentieren, okay, ich mache den Doktor und dann bekomme ich viel. Das offizielle Postdoc-Gehalt ist, also sprich, du hast jetzt nochmal vier Jahre, nehmen wir mal den Best Case, vier Jahre Doktor gemacht, hast dann den Doktor und machst weiter in der Wissenschaft. Dann bekommst du als Postdoc, kommt auch wieder drauf an wo natürlich, aber so als Hausnummer, 60.000 brutto. Das sind netto im Monat 2.700 in Österreich. Und wenn du dann Senior-Postdoc bist, das heißt, wenn du dann nochmal meistens so ein paar Jahre zusätzlich draufgelegt hast, das heißt, du hast schon mal gute zehn Jahre an der Uni nach deinem Master verbracht oder, keine Ahnung, acht Jahre, würde ich mal so sagen, dann bist du vielleicht Senior-Postdoc, wirbst deine eigenen Projekte ein, dann bekommst du 66.000 brutto.",
      "start": 1434472,
      "end": 1532259,
      "confidence": 0.7827527272727265,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, zusammenfassend kann man sagen, den Weg zum Doktortitel macht man auf keinen Fall wegen des Geldes. Bei 34.000 Euro Bruttojahresgehalt, ich denke da hat man gute Chancen auch nach der Berufsausbildung als Fachinformatiker Anwendungsentwicklung dieses Gehalt oder sogar mehr schon zu bekommen. ohne etliche jahre an der uni zu verbringen mit dem doktor dann steigt man als 60.000 ein das muss ich zugeben ist schon ein ganz gutes gehalt in deutschland als softwareentwickler aber wenn man dann sagt innerhalb von acht jahren gehe ich auf 66 hoch da würde ich mich jetzt mal aus dem fenster lehnen mit acht jahren berufserfahrung als softwareentwickler solltest du in der lage sein eine höhere gehaltssteigerung von 6000 brutto über acht jahre hinzukriegen.",
      "start": 1534760,
      "end": 1577216,
      "confidence": 0.8496583333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und es wird nach oben hin noch viel schlimmer, wenn du dann habilitierst, steigst du ein paar tausend Euro noch mehr, aber brutto Gehalt.",
      "start": 1577576,
      "end": 1583944,
      "confidence": 0.7632083333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, das bedeutet die akademische Laufbahn macht man nicht des Geldes wegen.",
      "start": 1584225,
      "end": 1589011,
      "confidence": 0.8515833333333332,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube das kann ich mir so fixieren.",
      "start": 1589211,
      "end": 1591474,
      "confidence": 0.6645,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Unabhängig davon, ob man jetzt mit dem Doktortitel an der Universität bleibt, Oder nicht, aber da kommen wir, was der Doktortitel wert ist in der Industrie, da kommen wir dann gleich noch zu.",
      "start": 1591494,
      "end": 1600206,
      "confidence": 0.8274242424242423,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und du hast natürlich vielleicht noch auch dazu gesagt, gerade um das auch nochmal möglichst unattraktiv zu machen, du hast das Problem, vor allem in Österreich, aber es gibt in Deutschland dasselbe Problem mit den Kettenverträgen, Das heißt, du hast sehr prekäre Arbeitsverhältnisse, du bekommst nie oder fast nie unbefristete Verträge und du springst von Vertrag zu Vertrag und es kann sein, dass du zwei Jahre später wieder keinen Job hast oder sogar eben durch die Kettenvertragsregel dann Uni wechseln musst, ins Ausland gehen musst, du darfst gar nicht mehr an der Uni bleiben. Also du musst super flexibel sein und ganz, ganz viele Leute gehen von den Unis genau darum, weil du einfach keine Sicherheit hast. Und es ist dann auch schwierig, andere Stellen zu finden an anderen Unis. Und du musst halt immer irgendwo in andere Länder springen. Also es gibt ja selten in einer Stadt jetzt irgendwie fünf Informatik-Unis oder so.",
      "start": 1600246,
      "end": 1649497,
      "confidence": 0.8215649350649346,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wo es natürlich dann auf der anderen Seite des Spiegels, zumindest in Deutschland, als Informatiker, als Softwareentwickler, wirst du in der Regel unbefristet direkt vom Staat eingestellt.",
      "start": 1649538,
      "end": 1659240,
      "confidence": 0.7980370370370371,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau. Und du hast die Sicherheit, dass du halt recht schnell auch innerhalb der Stadt oder so wechseln kannst. Also wenn du mal in die wissenschaftliche Karriere gehst, wird es halt auch schwieriger, weil deine Möglichkeiten einfach begrenzt sind, wo du überhaupt eine Stelle bekommen kannst. Also es ist eigentlich sehr unattraktiv, wenn es darum geht um Sicherheit, Einkommen. Es hat dann andere Vorzüge.",
      "start": 1659760,
      "end": 1679893,
      "confidence": 0.7817187499999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn wir schon mal im Finanziellen sind, jetzt habe ich meinen Doktortitel und jetzt gehe ich raus in die Industrie, in private Firmen. Jetzt bewerbe ich mich. Ist der Doktortitel vorteilhaft, um initial beim Berufseinstieg, weil das ist es ja dann im Endeffekt, ein höheres Gehalt zu verhandeln? Habe ich wenigstens da einen Vorteil?",
      "start": 1680213,
      "end": 1696765,
      "confidence": 0.8013148148148148,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kommt auch wieder drauf an, in welche Industrie du gehst, zu welchen Firmen du gehst. Wenn du natürlich jetzt in sehr konservativen Unternehmen arbeitest oder vielleicht sogar staatlichen oder staatsnahen Unternehmen, dort gibt es oft Einstufungen anhand deines akademischen Grades oder dass du sogar Stellen nur machen kannst, wenn du einen akademischen Grad hast. Super geeignet sein für eine Stelle, aber die Voraussetzung ist einfach, du brauchst einen Master zum Beispiel, einfach um auch in dieser Gehaltskategorie zu sein. Dann kannst du oft in staatsnahen Betrieben oder auch konservativen Betrieben einfach nicht diese Stelle annehmen. Das gibt's.",
      "start": 1697445,
      "end": 1732030,
      "confidence": 0.8278350515463917,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kleine Story am Rande, Ende 2012 habe ich mich für eine neue Stelle beworben, kurz bevor ich zur Trivago gegangen bin und da habe ich mich auch bei Aldi Süd beworben, heißt bei euch glaube ich Hofer.",
      "start": 1732430,
      "end": 1741898,
      "confidence": 0.8101351351351351,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Korrekt.",
      "start": 1741938,
      "end": 1742319,
      "confidence": 0.519,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das war genau die Zeit, da wo ich meine Bachelorarbeit geschrieben habe und ich habe sie dann im März 2013 verteidigt. Sagt man das verteidigt? Ich habe auf jeden Fall mein Bachelor da präsentiert und bestanden dann auch. Auf jeden Fall habe ich eine Stelle für den 1.1.2013 gesucht, das war so mein Wunschdatum und dann hatte ich ein Vorgespräch bei Aldi Süd, Hauptzentrale in Mühlheim an der Ruhr, wunderschöne Stadt muss ich auch nochmal zugeben. Ist auch eine super interessante Firma, denn ich denke immer noch dieses Marketingstatement mit dem Porsche zu Aldi ist wahr und die hatten auch super interessante IT-Projekte, also alles klasse. Auf jeden Fall hatte ich mich auf eine Stelle beworben, die einen akademischen Grad, einen Bachelor-Titel vorausgesetzt hat, wie du gerade schon gesagt hast, konservative Firma. Wer mal die Story von den Albrecht-Brüdern gehört hat, weiß, dass sie relativ konservativ unterwegs waren. Dann wurde mir im Interview gesagt, Herr Grumwald, Sie sind auch für die Stelle qualifiziert, aber ich kann Ihnen die leider nicht geben. Da hab ich nett nachgefragt, warum denn nicht, warum ist das denn nicht möglich? Ja, Sie haben den akademischen Grad des Bachelor of Science noch nicht. Sag ich, okay, das Startdatum ist jetzt 1.1.2013, Mitte März verteidige ich die, gehe mit hoher Wahrscheinlichkeit davon aus, dass ich den akademischen Grad des Bachelor of Science dann Ende März habe. Können sie mir dann versprechen, dass ich die Stelle denn dann bekomme? Da wurde mir mal in einem Nein geantwortet. Das fand ich dann schon sehr schade, weil er hat ja im Initialen gesagt, sie sind dafür qualifiziert, sie können den Job und so weiter, der Wissensstand ist ausreichend. Und das war dann unter anderem ein Grund, warum ich dann nicht zu Aldi Süd gegangen bin. Und da denke ich mir dann schon ab und zu, stehen sich private Unternehmen dann ab und zu nicht im Weg. Auf der einen Seite verstehe ich natürlich Schema F, besonders bei der Anzahl der Bewerber, weil in irgendeiner Art und Weise muss man eine Einstiegsbarriere schaffen, ein vergleichbares Schema. Ich verstehe es schon irgendwie, aber auf der anderen Seite habe ich das Gefühl, sie stehen sich dann ein bisschen selbst im Weg. Sehe ich das falsch?",
      "start": 1742359,
      "end": 1845703,
      "confidence": 0.770494623655914,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nein, finde ich auch und bin überhaupt kein Freund von diesen Hürden, die man da in den Weg legt. Und ganz oft ist es ja einfach historisch, früher hat man behauptet, ja, damit du eben diese Zeit, die du gebraucht hast, um den Doktor zu machen, wieder aufzuholen, bekommst du ein höheres Gehalt. Aber das ist ja mittlerweile alles nicht mehr der Fall und viel flexibler, dieser ganze Arbeitsmarkt, dass man sich da, glaube ich, mehr selber ins Fleisch schneidet, als was einem das hilft, ganz klar. Aber um zurückzukommen auf deine Frage, ob es dir hilft bei dem Verhandeln von Gehalt, kommt drauf an. Manche Firmen sehen das als Vorteil. Ganz viele Firmen, gerade die kleineren oder Startups oder wenn man dann zu Leuten wie mit dir zusammenarbeitet, ich habe das ja selber erlebt, dieses Bashing, dass jeder, der von der Uni kommt, nicht lebensfähig ist und sowieso nicht sinnvoll coden kann und nur perfektionistisch veranlagt ist und nichts auf die Straße bringt. Den wollen wir gar nicht in unserer Firma haben. Das ist teilweise schlimm, wie fest das in den Köpfen sitzt und du hast schon einen negativen Punkt mit deinem Doktor, bevor du überhaupt das erste Gespräch gehabt hast, das erste Vorstellungsgespräch. Also das gibt es sehr wohl auch in Firmen. Das heißt, ich würde sagen, gerade in der IT-Welt, wenn du jetzt nicht gerade bei irgendeinem großen Konzern einsteigen willst und da vielleicht auch dann weit nach oben kommen willst, weil auch wenn du keine Ahnung Richtung C-Level oder irgendwelche Abteilungsleiter, da hilft dir dann vielleicht bei BMW schon ein Doktor. Schlussendlich, wenn du den irgendwo stehen hast, also wenn du nicht in dieser Ecke willst, sondern einfach irgendwie cooles Zeug machen willst und Startups, Grownups in dem Bereich arbeiten willst, dann hilft dir der Doktor jetzt rein von dem akademischen Grad her, von dem Titel, den du da im CV stehen hast. wahrscheinlich gar nichts. Außer du bist natürlich jetzt in der Data-Science-Ecke unterwegs, dann ist das natürlich schon nochmal eine andere Sache, weil da will man wahrscheinlich eher Wissenschaftler eigentlich schlussendlich haben. Wenn du wirklich an Modellen arbeitest und an AI, also nicht nur die Anwendung, sondern wirklich dann tiefer gehst, da will man dann vielleicht eher diesen Typ von Wissenschaftler oder Wissenschaftlerin eigentlich haben, die an diesen Problemen arbeitet.",
      "start": 1846280,
      "end": 1972006,
      "confidence": 0.8200595854922285,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Inwieweit hast du denn die Erfahrung gemacht, als überqualifiziert zu gelten, besonders in mittelständigen Unternehmen, und dass da vielleicht eher die Suche nach in Anführungszeichen günstigeren, praxiserfahrenden Mitarbeitern war?",
      "start": 1972666,
      "end": 1985734,
      "confidence": 0.802241379310345,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich persönlich, ich habe auch nicht so viele Vorstellungsgespräche durchgeführt, muss ich auch dazu sagen, also als Kandidat eher von der anderen Seite und da habe ich halt viel miterlebt an Vorurteilen gegenüber Doktoranden und Doktorandinnen, aber selbst hatte ich nie das Gefühl, dass es ein Nachteil ist. Aber man hört schon die eine oder andere Frage in diese Richtung. Aber bei mir war es halt immer leicht, dadurch ich immer Freelancer parallel war, viele Projekte umgesetzt habe, da hatte ich nie dieses Argumentationsproblem. Und wahrscheinlich geht es auch ganz vielen Leuten so, die den Informatik-Doktor machen, dass die nebenbei gewisse andere Projekte haben, schon vielleicht bei irgendeiner Firma gearbeitet haben, während dem Masterstudium Erfahrung haben, Erfahrung sammeln, unter Umständen auch Erfahrung sammeln müssen, weil sie einfach sich das Studium irgendwie finanzieren müssen. Aber wenn man jetzt gar keine Erfahrung hat und nur den Doktor gemacht hat, könnte mir schon vorstellen, dass man da schlechtere Karten hat in ganz vielen Interviews und bei ganz vielen Firmen.",
      "start": 1985754,
      "end": 2041332,
      "confidence": 0.810928143712575,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Inwieweit siehst du das denn als vorteilhaft, einen Doktortitel zu besitzen, um schneller in eine höhere Management-Position zu kommen? Denn wenn ich mir oft die Vorstände, die Aufsichtsräte oder die C-Level-Positionen von Firmen ansehe, dann ist das recht üblich, dass mindestens einer oder zwei dieser Personen einen Doktortitel vorne herantragen.",
      "start": 2042092,
      "end": 2060940,
      "confidence": 0.7991200000000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie gesagt, umso konservativer die Firma und umso höher du dort willst, umso hilfreicher ist dir ja wahrscheinlich auch der Doktortitel.",
      "start": 2061469,
      "end": 2068297,
      "confidence": 0.7943333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt haben wir ein bisschen über Geld gesprochen, über die Dauer und jetzt hattest du auch schon so hämisch gesagt, ja in der Industrie, da dauert das ja alles nur drei Jahre. So und ich höre so im Umgangston immer, eine Promotion dauert im Schnitt fünf Jahre. Meine Frage, was dauert da so lange? Was machen angehende Doktoranden und Doktorandinnen? Fünf bis... Wolfgang, wie viele Jahre hast du studiert? Wie viele Jahre hast du für dein Doktortitel gebraucht? Ich glaube, die war zweistellig, die Jahresanzahl, oder?",
      "start": 2068317,
      "end": 2096393,
      "confidence": 0.7419534883720931,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Er war ganz niedrig zweistellig, also nur zehn Jahre.",
      "start": 2096983,
      "end": 2099884,
      "confidence": 0.768,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was macht man so lange? Du darfst bitte ehrlich antworten. Wie viel Jahre von diesen fünf bis zehn Jahren ist prokrastinieren? Oder das Leben genießen? Ich frage das jetzt so hämisch. Also ich meine, ihr bringt super cooles Zeug auf die Straße, gar keine Frage. Und ich denke auch, all diese Forschung ist jetzt gerade in diesem High Hype vielleicht alles zusammengekommen. Dennoch lache ich. Also ich grinse zumindestens. Und das musst du mir ein bisschen gönnen.",
      "start": 2099924,
      "end": 2123176,
      "confidence": 0.8066883116883117,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also diese Frage stellt man sich ja sehr oft, vor allem, wenn man dann irgendwie 50 Stunden an der Uni verbringt oder so. Wobei, wie gesagt, ich habe halt nebenbei auch immer gefreelanced, damals auch. Also das hat sich natürlich sehr vermischt bei mir. Diese 60 Stunden waren nicht nur rein an der Uni. Und offiziell hatte ich ja nur einen 20-Stunden-Job eigentlich. Du machst natürlich neben deinem Doktor, je nachdem, was du für eine Stelle hast, auch ganz andere Dinge. Du unterrichtest an der Uni, du machst Lehre. Ich habe zum Beispiel ein MySQL-Buch geschrieben, nebenbei noch, was auch viel Zeit gekostet hat.",
      "start": 2123614,
      "end": 2153350,
      "confidence": 0.7806250000000003,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Stopp mal eben. Das MySQL-Buch hast du aber für dich geschrieben und das war jetzt keine Folge, aber von der Universität oder ähnliches. Also das war dein Zeitdienst.",
      "start": 2153750,
      "end": 2159793,
      "confidence": 0.5760357142857142,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich war das ein reines Privatprojekt an sich, aber das kostet natürlich auch Zeit. Und wenn du die Flexibilität hast, nutzt du die vielleicht auch aus. Du hast übrigens auch nicht an allen Unis diese Flexibilität. Manche sind da extrem hart mit den Deadlines und da musst du einfach viel viel schneller sein. Also da ist Österreich vielleicht auch ein bisschen lockerer ganz allgemein. Und du brauchst natürlich auch den richtigen Professor, Professorin, Betreuerin, die auch fein mit dem ist und nicht so pusht. Dann hatte ich noch einen Spezialfall. Mein Professor hatte die Forschungsgruppe ganz frisch aufgebaut in Innsbruck und hatte keine Postdocs. Also die Postdocs sind ja die erfahrenen Wissenschaftler, wenn man sie so nennen will. Und üblicherweise ist das so das Mittelfeld und die haben auch wieder eigene Doktorandinnen. Also du hast so eine Art Hierarchie, wobei es da wenig um die Hierarchie geht, sondern dass du halt mehrere Forschungsbereiche hast und die betreuen dann auch wieder Doktorandinnen, diese Postdocs. Und da der die Forschungsgruppe aufgebaut hat und dem ein Postdoc abgesprungen ist, hat es keine Postdocs gegeben. Und die Postdocs übernehmen normal auch sehr viel Lehretätigkeit, Vorlesungen machen und so weiter. Jetzt hat es bei uns keinen Postdocs gegeben und wir DoktorandInnen haben dann diese Aufgaben auch teilweise mit übernehmen müssen. Also wir haben Vorlesungen gemacht, was man normal gar nie machen kann in dieser Position. Also es war auch ein Glück, aber es hat natürlich auch extrem viel Zeit gebraucht. Zeit gefressen. Wir haben geholfen beim Aufbau von dem ganzen Institut oder dieser Forschungsgruppe. Wir haben Öffentlichkeitsarbeit gemacht. Wir haben irgendwelche Events auch organisiert, wo es darum gegangen ist, wie man Kindern von sechs bis zehn Jahren irgendwie die Uni näher bringt, irgendwelche Tage der offenen Tür und so. Also diese ganzen Geschichten fressen extrem viel Zeit. Die waren super lehrreich, habe ich persönlich wirklich genossen, aber haben null eigentlich mit der klassischen Wissenschaft zu tun und können dich natürlich auch ablenken. Ich würde sagen, lebenserfahrungstechnisch haben sie mich sehr weitergebracht. Und darum habe ich auch sehr spät erst eigentlich mit meinem finalen Dr. Thema angefangen, vor meiner Dissertation. Habe das auch, glaube ich, fünfmal über den Haufen geworfen und gewechselt. Also so ähnlich wie bei einem Startup, wo du nicht weißt, was ist wirklich dein Produkt und du pivotest immer wieder mal. Das passiert ganz oft bei Dr. Demen auch. Also auch in meiner Umgebung, die Leute haben sehr oft gewechselt und wieder in eine andere Richtung geforscht. Du forschst ja auch. Das heißt, es ist nicht so klar, wo du hingehst. Wenn du jetzt wirklich den Auftrag hast, ein ganz fixes Projekt, wo du drauf angestellt bist, was genau schon definiert ist, was ja auch schon Geld eingeworben hat, wo genau das Ziel definiert ist, wobei das auch so eine Frage ist, ob das wirklich definiert ist. Das läuft meistens anders ab in der Wissenschaft. Aber dann hast du ein konkreteres Ziel und dann bist du natürlich auch schneller, weil du weniger links-rechts gehen musst, Fehler machen musst, um rauszufinden, okay, ist vielleicht die falsche Forschungsrichtung, ich will lieber in dem Bereich was machen oder es ist besser, in dem Bereich was zu machen. Du kannst leichter was veröffentlichen. Es ist gewünscht von der Community, von der Forschungs-Community, Wissenschafts-Community, dass du in den Bereich eher reingehst. Es ist einfach der Need da. Also du musst dein Thema finden und das dauert. Und dann habe ich natürlich später auch übrigens bei Trivago schon gearbeitet, full-time. Das heißt, ich habe meinen Doktor dann auch erst ein paar Jahre später wirklich finalisiert, zusammengeschrieben und noch die Verteidigung gemacht.",
      "start": 2159833,
      "end": 2357588,
      "confidence": 0.8103039867109633,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hast gesagt man muss auch lehren, das bedeutet du übernimmst dann Kurse, Datenbankkurse oder ähnliches von deinem Professor oder von der Professorin und die machst du dann ein komplettes Semester inklusive Klausurstellung, Korrektur und Co oder also gibt es da in deinem Vertrag eine Mindeststundenanzahl, du musst mindestens so und so viel Übungen leiten, so und so viel Vorlesungen machen, um irgendwelche Punkte, Scheine oder Qualifikationen zu bekommen.",
      "start": 2357828,
      "end": 2383323,
      "confidence": 0.7909999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also Lehre ist üblicherweise schon Teil von klassischen Stellen. Wenn du Projektstellen hast, also von Drittmittelgeld, dann hast du sehr oft keine Lehre. Aber wenn du eine Stelle hast, die von der Uni direkt ausgegeben wird, also so eine fixe Stelle, die die Professorinnen haben, dann ist da meistens Lehre dabei. Da musst du ein paar Stunden Lehre machen. Das sind üblicherweise Übungen. Die sind auch vorbereitet. Das ist schon alles definiert, aber in unserem Fall haben wir auch teilweise ganze Vorlesungen dann übernehmen müssen, vor allem später. Teilweise auch konzipieren. Klausuren mit korrigieren war sowieso immer ein Thema. Du hilfst ja auch, du hilfst dem Institut. Also du hast schon gewisse andere Tätigkeiten, die auch teilweise im Vertrag festgelegt sind. Nicht so hoch, wie wir sie damals in meiner Gruppe gemacht haben, muss man auch dazu sagen. Es war alles freiwillig, aber es ist halt so umgeben und nehmen. und was dir auch Spaß macht. Und mir hat es halt auch Spaß gemacht, mit einem riesigen Bällebart Sechsjährigen zu erklären, wie Google funktioniert, indem sie in dem Bällebart eine bunte Kugel suchen und Google spielen.",
      "start": 2383827,
      "end": 2442143,
      "confidence": 0.7736182795698918,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Oh, dazu würde ich gerne mal eine Podcast-Episode machen, so Explain-Me-Like-I'm-Five-mäßig mit dir, wie du mir das erklärst. Das wird, glaube ich, ziemlich viele Leute interessieren.",
      "start": 2442844,
      "end": 2450773,
      "confidence": 0.6764615384615383,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es war der volle Renner. Wir hatten da sogar einen österreichischen Preis gewonnen für Öffentlichkeitsarbeit bzw. wie man die Jugend an die Unithemen heranführt.",
      "start": 2451566,
      "end": 2459469,
      "confidence": 0.8165833333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt sagtest du, man verbringt auch sehr viel Zeit, sein Thema zu finden. Da redest du natürlich vom Thema der Doktorarbeit, die am Ende der ganzen Zeit rauspurzelt. Ich hab mal gehört, dass man innerhalb einer Doktorarbeit immer etwas Neues machen muss, also wirklich etwas Neues erforschen muss, bzw. dass da was Neues, was noch nicht bekannt ist, rauspurzelt. Ist das korrekt?",
      "start": 2459969,
      "end": 2482619,
      "confidence": 0.8184032258064516,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist eigentlich korrekt, ja. Ich sag eigentlich, weil es gibt natürlich auch andere Bereiche, gerade Jus ist so ein Thema oder wie heißt das bei euch, Jura?",
      "start": 2482659,
      "end": 2490669,
      "confidence": 0.6761071428571427,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jura, Jus habe ich noch nie gehört.",
      "start": 2490709,
      "end": 2492512,
      "confidence": 0.7001428571428571,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jus ist glaube ich nur die Mehrzahl von Jura, ich bin kein Lateiner, aber in Österreich heißt es Jus, aber für euch Jura? Da sind oft Doktorarbeiten im Prinzip so Zusammenfassungen oder Betrachtungen von einem neuen Winkel oder man bespricht so ein paar Themen, damit es quasi auch neuen Charakter hat, aber das ist nicht, dass man was Neues erfindet. In der Informatik soll es eigentlich nicht so schwer sein, irgendwas Neues zu erfinden. Du probierst irgendeinen neuen Algorithmus aus, dann hast du was erfunden. Also das sollte eigentlich nicht so schwierig sein. Du solltest aber, klar, in deiner Doktorarbeit auf jeden Fall was Neues präsentieren und eigentlich in der Masterarbeit auch schon, aber ist natürlich weniger streng muss man schon auch dazu sagen aber wenn du eine umfrage zum beispiel machst in deiner doktorarbeit einfach leute fragst dann hast du was.",
      "start": 2493033,
      "end": 2536577,
      "confidence": 0.7591338028169013,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Neues doofe frage wenn ich jetzt irgendwas innovatives von github nehme das unter umsauce lizenz ist und das in meiner doktorarbeit vielleicht ein tick weiterführe auf jeden fall wo wo der hauptanteil von jemanden der nicht akademisch aktiv ist getrieben wurde gilt das dann als doktorarbeit denn es geht nicht um arbeit klauen davon davon rede ich jetzt nicht ich rede jetzt eigentlich nur von der formalisierung der innovation in diesem github repository nach dem akademischen standard der doktorarbeit und der wissenschaftlichen betrachtung weil auch das ist ja eine kunst es.",
      "start": 2536597,
      "end": 2568382,
      "confidence": 0.8508571428571431,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kommt natürlich auf den fall immer drauf an und Du musst im Prinzip nur, nur unter Anführungszeichen, jemanden finden, der dich betreut und der auch findet, dass das den Wert hat für eine Doktorarbeit. Und dann dementsprechend gibt es natürlich Gutachter am Ende, die von anderen Unis sein müssen, extern und so weiter. Wenn du glaubst, dass das allgemein in der Wissenschaft anerkannt wird, was du machen willst, kann es natürlich alles sein. Es gibt eigentlich keine Eingrenzung, was das Ganze sein muss. Ganz viele Unis haben auch noch die offizielle oder nicht so offizielle Regel, dass du zum Beispiel veröffentlichen musst. Das heißt, du musst am Weg während deines Doktors publizieren auf einer Konferenz in einem Fachjournal. Das heißt, du musst wirklich peer-reviewed, wie es so schön heißt, also von anderen Wissenschaftlern gecheckte und als sinnvoll bewertete Forschungsergebnisse präsentieren, publizieren, vortragen, damit du überhaupt den Doktor bekommst auf deinem Weg, dass das also nicht nur dein eine Doktormutter und ihre Freundin ist von einer anderen Uni, sondern dass auch da wirklich in der Wissenschafts-Community die Community festgestellt hat, okay, das, was du machst, hat Sinn, ist wertvoll für die Wissenschafts-Community und damit hast du dann auch den Doktor verdient.",
      "start": 2568422,
      "end": 2640313,
      "confidence": 0.8309200000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sind diese Zwischenpublikierungen dann, ich sag mal, diese Seiteneffekte, die während deiner Forschung und deiner Doktorarbeit so rauspurzeln?",
      "start": 2640793,
      "end": 2647959,
      "confidence": 0.7561111111111108,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es sind weniger die Seiteneffekte, sondern einfach üblicherweise das, was du machst. Also du forschst halt und die Doktorarbeit ist dann eher das finale Produkt aus den Zwischenpublikationen.",
      "start": 2647999,
      "end": 2657867,
      "confidence": 0.8118214285714286,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also das bedeutet, ich schreibe dann die Doktorarbeit und da purzeln dann Zwischenergebnisse raus und die mache ich eine Teilveröffentlichung und dann meine Doktorarbeit könnte also eigentlich dann die Summe aus den sechs Publikationen, die ich zwischenzeitlich auf den Weg gemacht habe, sein. Ist das richtig?",
      "start": 2658167,
      "end": 2672211,
      "confidence": 0.7577391304347825,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es gibt sogar Unis, die kumulative Doktorarbeiten erlauben. Das heißt, was du eigentlich machst, du nimmst diese Papers, diese Veröffentlichungen aus den letzten Jahren, schreibst da ein Titelblatt mit einem Inhaltsverzeichnis, heftest die einmal zusammen, das ist deine Doktorarbeit. Also wirklich hintereinander. Sagst, okay, einmal so ein Abstract, um was geht's? Das sind diese zehn Arbeiten, zusammenheften, that's it. Kumulativ nennt sich das, wird aber zum Beispiel in Innsbruck eher nicht erlaubt im Informatikbereich. Kommt auch wieder auf den Bereich drauf an. In der Physikklassiker wird nur so gemacht, wenn du deine fünf Papers über Quantenphysik veröffentlicht hast, kannst du einfach das einmal zusammenheften, that's it.",
      "start": 2672251,
      "end": 2710531,
      "confidence": 0.7954433962264151,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, du suchst dir also jetzt ein Thema, beschäftigst dich da etliche Jahre mit, forschst da drin und versuchst da irgendwas Neues herauszufinden.",
      "start": 2711311,
      "end": 2717633,
      "confidence": 0.5418260869565218,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also vielleicht, um das auch nochmal zu erklären, du forschst da etliche Jahre, das ist nicht so, dass man da Jahre sich hinsetzt und dann ein Resultat veröffentlicht, sondern das ist schon iterativ, also das hat schon was Agiles. Du musst ja auch veröffentlichen im Idealfall, das heißt, du hast ein paar Veröffentlichungen pro Jahr im Idealfall, Okay, was vielleicht viel ist für einen Doktoranden jetzt, aber du arbeitest ja auch mit anderen zusammen. Das heißt, üblicherweise hat man da mehrere Namen auf so einer Publikation. Da gibt es einen Hauptautor, Autorin und dann viele, die mithelfen am Rande, die Input geben, die was durchlesen. Also du arbeitest da schon in der Gruppe, vielleicht sogar an dem gleichen Thema. Du arbeitest iterativ dran, probierst zu veröffentlichen. wirst vielleicht nicht angenommen, das heißt, du bekommst ein Review, die sagen, ja, das ist zwar ein interessantes Thema, aber nicht so interessant oder du hast irgendwelche formalen Fehler, dann gehst du wieder zurück an den Schreibtisch, arbeitest weiter, verbesserst es, reichst es wieder ein, dann wird es vielleicht akzeptiert, dann sagst du, okay, arbeite schon an den nächsten Themen, wieder an einer Verbesserung von dem Algorithmus zum Beispiel und so gehst du schrittweise voran und bekommst eigentlich extrem viel Feedback am Weg von der Community. Also du bekommst, weil du ja so viel einreichen musst, weil es ganz oft schief geht, bekommst du auch im Idealfall viel Feedback von irgendwelchen Leuten in dem Bereich, Spezialisten, die du gar nicht kennst bei Namen. Also das ist alles blind üblicherweise. Du bekommst Feedback, was solltest du besser machen, was könntest du noch machen. Du bekommst auch Ideen zurückgeliefert und hast so einen iterativen Prozess, wo du schrittweise dich an dein Ziel hintastest. Und am Anfang, wenn du, wenn wir ein konkretes Beispiel nehmen, du machst irgendeine neue Indexstruktur für eine Datenbank, dann hast du am Anfang vielleicht 2% Verbesserung, dann fallen dir noch andere Dinge ein. Irgendwann hast du 5% Speedup, irgendwann hast du 20% Speedup und so gehst du weiter und weiter und am Weg veröffentlichst du jede Verbesserung. Oder auch Sachen, die nicht funktioniert haben, ist eben auch wichtig. Du vergleichst verschiedene Algorithmen, du vergleichst dich mit anderen Algorithmen am Markt und so geht man schrittweise. eben weiter. Also es ist nicht sowas Klassisches, wie man oft so im Kopf hat. Man fängt das Studieren an, setzt sich in eine dunkle Kammer, arbeitet allein fünf Jahre an irgendwas und dann hat man eine Veröffentlichung, die Doktorarbeit. Ist in der Informatik auf keinen Fall so. Ist Teamwork und viel Feedback.",
      "start": 2718153,
      "end": 2852887,
      "confidence": 0.783596244131455,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man muss ja auch mal ganz kurz sagen, Forschung, heißt ja nicht immer, etwas Neues zu erschaffen, sondern vielleicht auch etwas Existierendes zu beweisen, beziehungsweise zu beweisen, dass dies nicht möglich ist oder ähnliches.",
      "start": 2852927,
      "end": 2866865,
      "confidence": 0.8788823529411767,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder sogar falsch ist. Gibt's ja auch oft. Es gibt Papers, die sagen einfach, das stimmt nicht, was da veröffentlicht wurde, das ist einfach Bullshit und das geht alles nicht.",
      "start": 2866905,
      "end": 2874469,
      "confidence": 0.7634666666666664,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Gibt's ja auch. Genau, also ein negatives Ergebnis ist auch ein Erfolg in der Hinsicht.",
      "start": 2874489,
      "end": 2878011,
      "confidence": 0.5762666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das wird immer gern gesagt, aber in der Realität kannst du negative Ergebnisse nicht veröffentlichen. Das wird zwar immer so gesagt in der Wissenschaft und man will das eigentlich auch irgendwie machen, aber ich hab das noch nie irgendwo erlebt, dass wenn du etwas einreichst, wo du nur negative Ergebnisse hast, dass es akzeptiert wird. Du brauchst ein Gutes. Du kannst dann sagen, hey, am Weg hatte ich zehn Negative, das ist okay. Aber eigentlich interessiert sich jeder nur, was da Positives rausgekommen ist und was funktioniert hat.",
      "start": 2878031,
      "end": 2904538,
      "confidence": 0.7941348314606741,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist es denn auch üblich, dass sich das Thema, was du dir am Anfang aussuchst, was du gefunden hast, über die Zeit, in der du dich mit diesem Thema beschäftigst, dann auch ändert?",
      "start": 2904798,
      "end": 2912520,
      "confidence": 0.6965151515151514,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, natürlich. Wie ich am Anfang gesagt habe, man ändert das ständig und du hast ja auch kein konkretes Thema, wo du sagst, okay, du willst jetzt genau das machen, sondern du bist ja meistens in dem Bereich unterwegs zusammen mit deiner Betreuerin. Keine Ahnung, zum Beispiel eben Indizes in Hauptspeicherdatenbanken, womöglich noch spezieller unten. Und dann arbeitest du in dem Bereich, probierst mal Sachen aus, probierst andere Sachen aus, merkst, okay, da funktioniert was, geh vielleicht tiefer in den Bereich, wo es funktioniert, diese Indexstruktur, diese neue, die irgendwie Cashline-Optimierung macht, funktioniert besser. Schaut mal da mal tiefer rein, probiert es zu veröffentlichen, schaut, ob das andere weltweit schon mal gemacht haben. ob das eben akzeptiert wird und wirklich neu ist oder nicht. Und so tastet man sich da langsam vor. Es ist ja nicht so, dass man sagt, okay, meine Doktorarbeit wird dieser Spezialalgorithmus und ich arbeite jetzt fünf Jahre genau daran, weil ich will, dass am Schluss diese 20% Performance Impact auftauchen.",
      "start": 2913030,
      "end": 2964913,
      "confidence": 0.7988060606060611,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das bringt mich zu der Frage, ist ein Doktor nur etwas für Leute, die eine starke Spezialisierung anstreben, oder auch etwas für T-Shaped-Personen, beziehungsweise Generalisten und Generalistinnen? Weil es gibt ja Leute, die positionieren sich aktiv als Check of All Trades, was offengesprochen 95 Prozent des Markts, denke ich, abdeckt. Und dann gibt's natürlich die Spezialisten, die bei diversen Anwendungsfällen gerufen werden, aber nicht jede Firma benötigt dies.",
      "start": 2965093,
      "end": 2991140,
      "confidence": 0.8331470588235292,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann man nicht so sagen, kommt wirklich darauf an, in welchem Umfeld du die Doktorarbeit machst und wie du persönlich drauf bist. Ich würde mich eher als Generalist sehen und ich hatte immer das Gefühl, dass es eigentlich extrem hilfreich ist, wenn du auf Konferenzen bist, du hörst extrem viele Themen, du kannst mit super vielen interessanten Leuten sprechen, vielen Wissenschaftlerinnen in deinem Umfeld, auch von anderen Forschungsgruppen. Wenn neben dir in dem Büro einfach jemand an irgendwelchen Roboterarmen bastelt, dann sprichst du natürlich mit dem auch. Und da habe ich eigentlich viel gelernt, einfach mit anderen Wissenschaftlerinnen über Sachen zu sprechen. Aber wenn du dich natürlich auf ein Thema eingraben willst, funktioniert das genau so. Also ich glaube, das ist beides möglich, je nachdem, wie deine Persönlichkeit ist und wie dein Umfeld vor allem das erlaubt. Weil es gibt natürlich auch Betreuerinnen, die einfach sagen, okay, wir sind ganz hart in einem Thema und du sollst auch nur in dem Thema sein und am besten keine Lehre machen. Und die Lehre ist sowieso böse. und mache nur genau dieses Problem, was ich mir überlegt habe. Also das gibt es schon auch. Es gibt die Betreuerinnen, die dir viel Freiheit lassen, was unter Umständen schwierig ist, aber es gibt natürlich auch Leute, die dich sehr auf ein Thema in die Tiefe fokussieren lassen und dich auch micromanagen, würde ich mal sagen, wobei das eher selten der Fall ist an der Uni, muss man schon sagen. Also die meisten sind eher so absolut laissez-faire und such dir mal deine Themen. Natürlich ein bisschen Steuerung ist gut, aber üblicherweise hast du schon sehr viele Freiheiten und das ist ja der große Vorteil an der Uni und darum akzeptieren ja viele dieses Gehalt, weil sie einfach wirklich an neuen Themen forschen können, die absolute Freiheit haben. Muss ja auch da sein, diese Freiheit, sonst kannst du ja nichts Neues erfinden, innovativ sein. Das braucht natürlich Zeit, aber diese Freiheit bekommst du natürlich an der Uni und da wirst du selten irgendwie in die Schranken gewiesen oder hast harte Deadlines oder sowas. Also das sind maximal Deadlines, dass du irgendwo was einreichen musst zu einer Konferenz. Das sind natürlich harte Deadlines, wenn du das willst, aber im schlimmsten Fall verpasst du das natürlich.",
      "start": 2991700,
      "end": 3106622,
      "confidence": 0.7844881266490766,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf Wikipedia steht folgender Satz, durch die Promotion wird dem Kandidaten die Fähigkeit zum selbstständigen wissenschaftlichen Arbeiten bescheinigt. In der Praxis ist es ja so, dass wissenschaftliches Arbeiten oft nicht gewünscht wird, dass die Analyseparalyse, dass man kontinuierlich analysiert und mehr analysiert und mehr analysiert, dass das gar nicht gewünscht ist, sondern eher so der Hang zum get the shit done. Mach dir mal die Hände dreckig und leg einfach los. Natürlich mit einem gewissen Grad an Planung. Meine Frage ist, wie relevant ist der Doktor-Titel eigentlich in der heutigen Zeit noch, wo jeder sich etwas über YouTube und Co. selbst beibringen kann und dann die Aktion und den Outcome wirklich treiben kann, ohne den großen Bass zum wissenschaftlichen Arbeiten vorne dran zu hängen. Also wie relevant ist das wissenschaftliche, selbstständige Arbeiten im Endeffekt an der Praxis in einem Industrieunternehmen, in einer Firma mit Profitabsichten noch? Was, wo ich mal von ausgehe, die meisten Firmen drunter fallen.",
      "start": 3106842,
      "end": 3165297,
      "confidence": 0.8318407643312103,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also zwei Aspekte dazu. Einerseits, ich glaube, dass andere Leute sehr wohl selbstständig arbeiten können, die keinen Doktortitel haben. Du musst aber garantiert, wenn du einen Doktortitel hast, selbstständig arbeiten können. Also alles andere wird schwer, außer in speziellen Umgebungen. Wie gesagt, die eher so Micro-Manager sind diese BetreuerInnen. Das heißt, ein Problem zu erkennen, zu analysieren, auch im Team dann vielleicht an dem Problem zu arbeiten, das lernt man garantiert, wenn du ein Doktorat machst. Ob das jetzt der unique selling point ist, wage ich mal zu bezweifeln von dem Doktoratstudium. Viel wichtiger ist eben das zweite Element, was da mitspielt, und zwar, dass du das Wissen hast, gewisse Sachen zu verknüpfen, dieses breite Wissen auch, die ganzen Grundlagen, dass du Sachen schneller verstehen kannst, dass du in deinem Bereich, in deinem Forschungsbereich einfach diese ganzen Grundlagen hast, aber auch dieses Spezialwissen, um dann eben neue Sachen zu entwickeln, um andere Ansätze zu evaluieren, zu analysieren, um schneller Ansätze verstehen zu können, um dann einfach auch schneller tiefer gehen zu können und vielleicht Dinge weiterentwickeln zu können. Und diese Fähigkeiten sind meiner Meinung nach viel, viel wichtiger, die man da lernt. Also einfach, wie ist dieses wissenschaftliche Arbeiten, dieses Forschen, wie macht man das und wie kann man denn überhaupt was Neues, Innovatives erfinden, wenn man es so nennen will. Und wenn ich natürlich im AI-Bereich zum Beispiel unterwegs bin, dann muss ich da halt vielleicht auch dementsprechend innovativ sein. Aber auch wenn ich jetzt an einer Hardcore-Datenbank arbeite, tief unten bei den Indexstrukturen, dann muss ich halt einfach auch wissen, wie arbeitet die Wissenschaft, Wie kann ich andere Papers lesen? Wie kann ich Veröffentlichungen lesen von anderen Indexstrukturen? Wie kann ich die auch evaluieren, analysieren, dass ich die einordnen kann, um dann meine eigene Datenbank zum Beispiel weiterzuentwickeln? Wenn ich jetzt eine Webseite programmiere, einfach werde ich dieses Spezialwissen nicht brauchen, ganz klar. Und da sind vielleicht dann andere Dinge wichtiger, die ich in einem Unternehmen eher lerne, wie man agil in dem Team, in einem klassischen Unternehmen arbeitet, um möglichst schnell was auf die Straße zu bringen. Aber weil du auch das mit dem Auf-die-Straße-Bringen angesprochen hast, dass das irgendwie nicht so in der Wissenschaft drin ist. Und genau das ist, glaube ich, das Problem mit dem Bias, den viele haben, die nicht in der Wissenschaft mal waren. Und ich kann es nur immer wieder sagen, alles, was ich so gesehen habe in dem Bereich von DoktorandInnen oder überhaupt in der Wissenschaft, ist wirklich hingerotzter Code, der möglichst schnell irgendwas macht, was man zeigen will. Also man arbeitet jetzt vielleicht in dem Bereich von Quality Engineering oder so, wo die Forschung an sich ist, wie kann man da super Modelle und Prozesse aufbauen, um schöner zu programmieren oder Clean Code oder solche Dinge. Aber wenn man die meisten Bereiche anschaut, geht es einfach darum, ich will was ausprobieren, möglichst schnell ein Ergebnis haben. Und da ist es nicht wichtig, dass da Code jetzt der schönste ist, der 20 Jahre überleben kann, sondern ich will möglichst schnell beweisen, diese Idee, die ich da habe für meine Indexstruktur in der Datenbank, funktioniert die und ist die um 3% schneller. Und dann rotzt man den Code möglichst schnell hin, hat die Ergebnisse in irgendeinem CSV oder wird nicht lang rum getan, dann wird ein Paper geschrieben und das möglichst schnell rausgeworfen. weil es um die Idee geht und nicht um den Code. Also dieses Vorurteil, dass alles immer so bis ins Letzte zerlegt wird und analysiert wird, glaube ich, ist ganz oft falsch. Weil Wissenschaft ganz oft ist, ich habe eine Idee, ich bringe möglichst schnell einen Beweis raus, ob die Idee funktioniert oder nicht.",
      "start": 3166155,
      "end": 3369897,
      "confidence": 0.8088682926829261,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da stellt sich mir die Frage, wie sinnvoll der Großteil der Wissenschaft ist, wenn du es gerade so beschreibst.",
      "start": 3369937,
      "end": 3374620,
      "confidence": 0.6468947368421052,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Welcher Teil?",
      "start": 3374640,
      "end": 3375441,
      "confidence": 0.863,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Naja, wenn es einfach nur ist, ich habe eine Idee und rotze dann irgendwas hin, um zu gucken, dass ich was veröffentlicht habe, so hört sich das für mich an.",
      "start": 3375481,
      "end": 3381465,
      "confidence": 0.6027333333333331,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, richtig. Das finde ich auf jeden Fall auch in Ordnung und eine agile Herangehensweise. Du willst ja eine Idee möglichst schnell überprüfen oder widerlegen, so MWB-Charakter. Du hast eine Idee, programmierst es möglichst schnell, damit du überprüfen kannst, ist es auch wirklich schneller, dein Index für diese Datenbank, dein verbesserter Index, Und wenn du bewiesen hast, dass das so ist, dann ist es gut, weil dann wird irgendwann Oracle oder eine Datenbankfirma kommen und das sauber bei ihnen implementieren. Aber warum solltest du irgendeinen Algorithmus für einen Test möglichst schön sauber implementieren, nur um zu zeigen, dass deine Idee funktioniert? Das ist ja die Herangehensweise auch in Startups, würde ich mal sagen. Du hast eine Idee, eine Hypothese und willst die widerlegen oder beweisen, dass sie funktioniert. Und das machst du in der Wissenschaft eigentlich tagtäglich. Und da ist Qualität nicht wichtig. Da sind wir wieder bei dem Bereich, dass viele sagen, okay, die Leute, die von der Uni kommen, können nicht schön coden. Das könnt ihr noch nachvollziehen. Muss nicht immer so sein. Aber könnte natürlich sein, und du hast natürlich jetzt keine Erfahrung, an einer Codebase zu arbeiten, die seit 20 Jahren existiert, und mit 300 anderen Leuten an einer Codebase zu arbeiten. Das hast du an der Uni einfach nicht. Also du bist jetzt in einem riesigen Open-Source-Projekt noch unterwegs, aber ganz oft arbeitest du mit dreckig, dahingerotztem Code. Muss man ganz klar sagen.",
      "start": 3381908,
      "end": 3459060,
      "confidence": 0.8041176470588238,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also sagst du jetzt eigentlich, Leute, die einen Doktor anstreben, beziehungsweise gerade in dieser Zeit sind, sind die besten Startup-Mitarbeiter? Beziehungsweise können partielle Skills davon wiederverwendet werden?",
      "start": 3459100,
      "end": 3469627,
      "confidence": 0.7624444444444445,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, dass es sich nicht ausschließt, nur weil du einen Doktor hast, dass du dann nicht in einem Startup arbeiten kannst oder diese Philosophie aufnehmen kannst, die in einem Startup wichtig ist. Das würde ich nicht sagen. Es kann natürlich ein Problem sein, aber das musst du bewerten. Wie du bei jedem Kandidaten, Kandidatin bewertest, ist das ein richtiger Fit für deine Firma. Aber diesen Bias zu haben, dass jemand, der einen Doktor hat, nicht in einem Startup arbeiten kann, das ist, glaube ich, einfach die falsche Korrelation. Und ich kenne viele Leute, die schön programmieren können, die gut programmieren können. Ich kenne viele Leute, die superschnell was hinrotzen können. Ich habe auch mit super intelligenten Leuten zusammengearbeitet an der Uni, aber auch in privaten Projekten, wo es um ganz unterschiedliche Herangehensweisen geht. Ich glaube, Leute, die einen Doktor machen, sind auch unter Umständen sehr flexibel, haben auch kein Problem mit dieser Unsicherheit, weil man eben selbstständig arbeiten muss, weil bei der Uni eben irgendwie alles so undefiniert ist und du bekommst ja nicht irgendwas auf den Schreibtisch gelegt, das ist dein Task für die nächsten drei monate sondern mach einfach mal das ist meistens so start einfach mal irgendwo liest dir mal was durch schauen wir einfach iterativ also dieses mindset ist fast wieder start up.",
      "start": 3470135,
      "end": 3538768,
      "confidence": 0.7862798165137612,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Like jetzt ist es so ich habe ein bachelor in wirtschaftsinformatik gemacht und muss zugeben dass ich während des studiums sehr sehr viel darüber gelernt habe wie die welt funktioniert natürlich wegen bw l1 und vw l1 also betriebswirtschaftslehre und volkswirtschaftslehre Statistik und allem drum und dran. Also, es war eine tolle Zeit. Und danach ist so der Gedanke des akademischen Spaßes bei mir gewachsen. Und dann hatte ich mir die Frage gestellt, okay, mach ich jetzt noch weiter, mach ich jetzt noch einen Master, der mich wirklich interessiert? IT-Security. Für mich ist auch Wirtschaftsinformatik als Master of Science und so weiter. Aufgrund des akademischen Spaßes und nicht aufgrund der möglichen Karrierepfade danach. Meine Frage ist jetzt eigentlich, würdest du empfehlen einen Doktortitel anzustreben aufgrund des akademischen Spaßes?",
      "start": 3538848,
      "end": 3586899,
      "confidence": 0.7911406250000002,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube sogar, dass der akademische Spaß der einzige Grund sein darf, weil Geld kann es nicht sein. Aussicht auf einen besseren Job kann es eigentlich auch nicht sein. Das heißt, eigentlich musst du Spaß haben an diesem wissenschaftlichen Arbeiten, an dem selbstständigen Arbeiten, neue Dinge zu ergründen, innovativ zu sein, die Freiheit zu haben, die Freiheit zu schätzen auch, die du hast an der Uni. Und du musst wahrscheinlich großes Interesse an dem Bereich an sich haben. Also sei es jetzt ein spezialisierter oder ein allgemeiner Bereich. Ich kann es nur als Beispiel nennen, um vielleicht die Freiheit auch so ein bisschen zu erklären. Ich habe ja in der Forschungsgruppe Datenbanken gearbeitet damals und den Doktor gemacht und dann in Recommender Systems, was so ein bisschen verwandt ist eigentlich zu der Datenbankwelt. Aber da sieht man schon, wie breit so Themen auch sind. Und eine der interessantesten Bachelorarbeiten, die ich zum Beispiel betreut habe und auf die Beine gestellt habe, war mit einem Kollegen zusammen, der in der Roboterforschungsgruppe Institut war. Und wir haben eine Bachelorarbeit gemacht, gemeinsam betreut, von einem System für unsere Kaffeemaschine am Institut. Weil wir da so eine Strichliste hatten, Kaffee ist nicht gratis an der Uni übrigens, also man verdient nicht nur wenig, man bekommt auch keinen kostenlosen Kaffee üblicherweise, und wir wollten diese Strichliste ersetzen, dass man so Striche macht bei seinem Namen, wenn man Kaffee trinkt, und haben ein System gebaut mit einem Raspberry Pi, glaube ich war es, wenn ich mich richtig erinnere, oder vielleicht war es ein anderer Minicomputer damals, haben da mit einem Board direkt die Kaffeemaschine angebunden, haben zuerst herausgelesen, wie diese Schnittstelle wirklich funktioniert. Es war ein serieller Anschluss. Der war gar kein serieller Anschluss, da waren irgendwo 60 Volt drauf. Das heißt, wir haben die Dinge ausgemessen, zusammen mit dem Studenten oder der Student besser gesagt, die gesamte Entwicklung in C von der Anbindung von dieser Kaffeemaschine. dann mit einem RFID-Reader, weil wir alle RFID-Schlüssel hatten, dann mit einem kompletten Web-Verwaltungssystem dazu, mit einer Anbindung zu dem internen Authentifizierungssystem von der Uni, damit man sich dann auch einloggen kann mit seinen User-Daten uniweit, dann seinen Schlüssel auch dementsprechend hinterlegen kann und jedes Mal, wenn man den Schlüssel dann auf dieses Kästchen legt, hat man dann einen Kaffee rausbekommen aus der Kaffeemaschine, das wurde automatisch verbucht, man hatte Statistiken, man hatte institutsweite Rankings, wer trinkt am meisten Kaffee, in welchem Monat und so weiter. Und das war eine der genialsten Bachelorarbeiten, die ich betreut habe. Null wissenschaftlicher Charakter, würde ich mal sagen. Super Bachelorstudent übrigens, super spaßiges, themenübergreifendes, forschungsthemaübergreifende Bachelorarbeit mit meinem Kollegen. hat mir Null gebracht für meinen Doktor, hat aber das ganze Institut viel Spaß gemacht, weil die konnten Kaffee trinken und ich habe extrem viel dabei gelernt, hatte super viel Spaß und das ist die Freiheit, die man hat an der Uni, die man nutzen kann, die man auch nutzen sollte, aber wenn man nicht jemand ist, der diesen Spaß darin sieht, sowas zu machen, Also ist natürlich jetzt ein Extremfall, du kannst auch in deinem Spezialforschungsbereich so viel Freiheit ausleben, aber du hast üblicherweise diese Freiheit und nur wenn dir das Spaß macht, dann solltest du meiner Meinung nach einen Doktortitel machen.",
      "start": 3586959,
      "end": 3782175,
      "confidence": 0.8302096474953623,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Alternativ könntest du natürlich auch zu deinem lokalen Hackerspace vom Chaos Computer Club gehen, oder? Denn solche Projekte werden da mit hoher Wahrscheinlichkeit jeden Tag gemacht.",
      "start": 3782195,
      "end": 3789440,
      "confidence": 0.6858461538461538,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich, also das sollte ja auch nicht die Standardarbeit an der Uni zu sein, aber ich wollte nur damit darstellen, dass dir da keiner reinredet. Du kannst einfach so Arbeiten machen, du kannst auch Bachelorarbeiten üblicherweise einfach ausschreiben, die relativ frei sind, um mal was auszuprobieren. Im Idealfall macht man das natürlich im eigenen Forschungsbereich, ist schon klar. Sonst, vor allem wenn man nicht zehn Jahre brauchen will für einen Doktor. dann macht man das vielleicht fokussierter, aber du hast grundsätzlich die Freiheiten an der Uni und die, das musst du auch wollen. Und das hat halt wenig damit zu tun, jetzt wirklich ein produktives Produkt auf den Markt zu bringen, wo du dann echte User hast, üblicherweise.",
      "start": 3790262,
      "end": 3828166,
      "confidence": 0.8019999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jetzt ist es natürlich so, dass nicht jeder die finanzielle Freiheit oder die Lebenssituation hat, nochmal vier, fünf, sechs Jahre an der Universität zu verbringen.",
      "start": 3828526,
      "end": 3836888,
      "confidence": 0.8308399999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Naja, du bekommst ja nur üblicherweise schon eben gezahlt und hast eine Stelle, aber wenn dir das natürlich zu wenig ist, wenn dir deine, keine Ahnung, 1900 Euro, 2000 Euro zu wenig sind, dann solltest du natürlich in die Wirtschaft gehen, ja.",
      "start": 3837287,
      "end": 3850942,
      "confidence": 0.7216428571428574,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie realistisch siehst du das denn, einen Doktortitel, wenn ich jetzt zum Beispiel einen Master hätte, neben dem Beruf zu machen?",
      "start": 3850962,
      "end": 3856628,
      "confidence": 0.7161904761904762,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, wenn du keine Unterstützung von deiner Firma bekommst und die Freiheiten von deiner Firma, ist es sehr, sehr schwierig. Du kannst es natürlich schon machen, aber ich glaube, es ist hart und wird, glaube ich, auch nicht gern gesehen und es ist schwierig, wahrscheinlich eine Betreuerin zu finden. wenn du einfach so selbstfinanziert freies Thema, weil die Betreuerinnen wollen ja üblicherweise auch was davon haben. Das ist ja meistens in deren Forschungsbereich. Die stehen ja auch auf den Papers mit oben für die Veröffentlichungen, weil die müssen beweisen, dass sie Veröffentlichungen haben, damit sie Geld bekommen. Da gibt es interne Rankings. Also das ist ja eine schwierige Sache. Insofern könnte ich mir das sehr schwer vorstellen. Aber ist natürlich möglich, wo ein Wille deinen Weg.",
      "start": 3856927,
      "end": 3896215,
      "confidence": 0.8171811023622053,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Würdest du selbst nochmal den Doktortitel anstreben?",
      "start": 3896235,
      "end": 3898896,
      "confidence": 0.7037142857142857,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hättest du jetzt nochmal die Wahl? Auf jeden Fall, weil ich extrem viel gelernt habe, weil es viel Spaß gemacht hat. Ich würde vielleicht versuchen, diese zehn Jahre ein bisschen zu kürzen. Aber wie gesagt, ich habe viel erlebt von der Steuerung der Kaffeemaschine über Datenbank, Algorithmen, Recommender Systems bis hin zu, wo bekomme ich die billigsten Werbekugelschreiber für das Institut und Firmen durchtelefonieren.",
      "start": 3898916,
      "end": 3921849,
      "confidence": 0.8208281250000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Besonders der letzte Punkt, sehr wichtiger Skill. Welche zwei, drei Tipps würdest du jemandem geben, der sich überlegt, soll ich noch einen Doktor machen oder nicht? Was sind die zwei, drei Attribute, die man wirklich stark durchdenken sollte, bevor man die Entscheidung trifft? Und wo man sich dann jedenfalls auch sicher sein sollte, den richtigen Weg einzuschlagen. Natürlich kann man einen Doktor auch abbrechen, doch es ist natürlich besser, wenn man das nicht tut und die ganze Sache durchzieht. Also welche zwei, drei Attribute sollte man durchdenken, bevor man den ganzen Pfad einschlägt?",
      "start": 3921869,
      "end": 3953059,
      "confidence": 0.8133225806451609,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich glaube, ganz grundsätzlich mal die Überlegung, kann ich damit leben, dass ich weniger Geld bekomme als andere, die irgendwo dann bei Firmen arbeiten und das Doppelte verdienen? Kann ich damit leben? Bin ich grundsätzlich selbstständig? Dann habe ich wirklich Spaß, an Innovation, mich auch mal mit schweren Problemen wirklich zu beschäftigen, richtig tief reinzusteigen in diese Problematik und da eine Lösung zu finden. Das sind so Grundvoraussetzungen. Und dann ganz, ganz wichtig, nachdem wirklich jede Forschungsgruppe, jedes Institut anders tickt, jede Professorin, jeder Professor oder Betreuer. Was ist das für ein Umfeld? Mit anderen DoktorandInnen sprechen. Und ist es ein Umfeld, wo ich mich wohlfühlen könnte die nächsten Jahre? Wie bei einer Firma eigentlich auch, wenn man eine Bewerbung macht. Aber wie gesagt, die Unterschiede sind mindestens so groß wie bei Firmen zwischen den Professorinnen an einer Uni sogar oder sogar in einer Forschungsgruppe. Es gibt mehrere BetreuerInnen vielleicht und die eine dickt so, der andere so. Also das muss man sich wirklich dann anhören und am besten auch wie in Firmen auch mit anderen sprechen, die dort gerade Doktor machen oder Doktor gemacht haben und das einfach mal wirklich hinterfragen und da möglichst probieren, in die Details reinzuschauen.",
      "start": 3953179,
      "end": 4023303,
      "confidence": 0.8477512437810943,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielen Dank für diesen akademischen Einblick in den Weg zum Doktortitel. Und du hattest am Anfang der Episode gesagt, Doktoranden prahlen nicht gerne mit ihrem Doktortitel. Warum ist das so?",
      "start": 4024173,
      "end": 4034784,
      "confidence": 0.6836333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, ich mache das nicht. Andere vielleicht schon. Keine Ahnung. Aber mir ist es eher immer unangenehm und ich bin froh, was ich gelernt habe. Und ich finde es schrecklich, was in Österreich so gemacht wird mit diesen Titeln. Also darum bin ich einfach da. Kein Freund davon. Und außerdem habe ich auch erlebt, dass es Leute gibt, die sich durch den Master schwindeln, auch manche, wo ich mir nicht sicher bin, ob die den Doktor wirklich verdient haben. Das heißt, der Titel alleine zählt meiner Meinung nach nichts, auch wenn es beim Großteil natürlich passt und okay ist. Aber der Titel alleine sagt nichts über Qualifikation aus meiner Meinung nach. Das kann nur ein Datenpunkt sein.",
      "start": 4034804,
      "end": 4068589,
      "confidence": 0.7231367521367518,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das bedeutet, ich kann mich auch durch den Doktor schwindeln?",
      "start": 4068909,
      "end": 4071230,
      "confidence": 0.7295,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Schwindeln ist vielleicht jetzt übertrieben, aber es gibt natürlich bessere und schlechtere. Und du hast auch ein Notenspektrum von 1 bis 5 in Österreich und alles bis 4 ist bestanden. Und selten fragt dir jemand nach, was du für eine Note hattest bei deiner Verteidigung.",
      "start": 4071271,
      "end": 4086860,
      "confidence": 0.7610000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da gehen wir dann mal nicht weiter darauf ein, die ganzen Themen wie Ghostwriting und Co. und Plagiate lassen wir jetzt einfach mal weg.",
      "start": 4086880,
      "end": 4092423,
      "confidence": 0.7125416666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oh, da sind wir auch Spezialisten in Tirol.",
      "start": 4092690,
      "end": 4094732,
      "confidence": 0.7782500000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Vielen lieben Dank, Dr. Wolfgang Gaßler, für diesen Einblick in die Welt der Universitäten, Doktorandinnen und Doktoranden sowie auf dem steinigen Weg dorthin.",
      "start": 4094772,
      "end": 4105701,
      "confidence": 0.8193478260869567,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber auch den sehr spaßigen Weg dorthin. Also ich kann es auch nur jedem empfehlen, der irgendwie einen Sinn dahinter sieht. Es macht wirklich Spaß.",
      "start": 4105741,
      "end": 4112527,
      "confidence": 0.7798400000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das musst du ja jetzt sagen sonst.",
      "start": 4112546,
      "end": 4113808,
      "confidence": 0.5788571428571428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, man kann die Welt schon verändern. Kann man aber auch woanders. Also Open Source ist zum Beispiel auch eine gute Möglichkeit, die Welt zu verändern.",
      "start": 4114721,
      "end": 4121145,
      "confidence": 0.6957692307692308,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn ihr jetzt Lust habt, doch nochmal eine akademische Laufbahn einzuschlagen, informiert euch mal in eurem Landkreis, Stadtkreis, an eurer Universität. Oder vielleicht ist es auch andersrum eine Möglichkeit, überlegt euch, in welchem Fachsegment ihr euren Doktor machen wollt und schaut, wo interessante Lehrschüle sind, falls ihr nochmal einen Umzug in Betracht ziehen wollt. Wir hoffen, wir konnten euch ein wenig Einblicke in die Welt des Doktortitels geben. Als Zusammenfassung würde ich sagen, wer Karriere machen möchte, beziehungsweise wer ein ordentliches Gehalt verdienen will, der braucht keinen Doktortitel. Der muss die ganzen Jahre Zeit nicht investieren. Wer den sogenannten akademischen Spaß erleben möchte, für den mag das mit hoher Wahrscheinlichkeit eine mögliche Route sein.",
      "start": 4121166,
      "end": 4163599,
      "confidence": 0.8250175438596493,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder einfach auch nur mal ausprobieren will. Es sind ja nur ein paar Jahre. Ist ja okay. Was sind schon vier Jahre in deiner ganzen Karriere?",
      "start": 4163639,
      "end": 4170720,
      "confidence": 0.6743076923076923,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meines Erachtens nach kann man aber auch noch eine ganze Menge über YouTube und Co. alleine lernen. Von daher, kommt euch mal ganz drauf an, was für Ambitionen ihr habt. Das war's von uns für diese Woche. Bis zum nächsten Mal. Tschüss. Ciao.",
      "start": 4171040,
      "end": 4182029,
      "confidence": 0.7025348837209302,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.7971132348217171,
  "audio_duration": 4189.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
