{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/f799a796-6463-44c8-b132-a544e59fb859/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "62zp6pters-9e1e-4d2e-854c-00133c93aec6",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Wenn wir sagen, wir haben eine Fehlerkultur und jedes Team macht doch eigentlich den Fehler, dann haben wir keine Fehlerkultur, dann ist das Management einfach scheiße. Ich wurde nach acht Monaten Manager, Teamleiter mit meinem ersten Hire, da war ich dann also gerade 25, 26. Habe ich da vielleicht mal ein bisschen mehr geteilt, als ich sollte, auf jeden Fall. Nachdem man den Fehler gemacht hat, kommt der anstrengende Teil. Der anstrengende Teil, den keiner mag.",
      "start": 2021,
      "end": 27258,
      "confidence": 0.8029210526315795,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Willkommen zu einem weiteren Sommergespräch im Engineering-Kiosk. In diesem Format kennt nur einer von uns das Thema vorab, in dem Fall ich. Und ich frage Andi, wie er mit Fehlern im Team umgeht. wie er eine gute Fehlerkultur aufbaut und was denn dieses Passwort Fehlerkultur eigentlich bedeutet, vor allem in der Realität von SoftwareentwicklerInnen. Ich will aber auch wissen, wie Andy zu seinen eigenen Fehlern steht, besonders als Engineering Manager. Was denn diese Verantwortung als Manager bedeutet, von der viele so gern sprechen? Hat das auch Einfluss auf die Transparenz? Und wie offen darf man eigentlich in einer Leadership-Rolle sein? Die Episode ist etwas persönlicher geworden und wir beleuchten auch ein paar unschöne Seiten der Manager-Rolle. Also egal ob ihr ein Manager seid oder in einer IC-Rolle, schnappt euch ein Getränk eurer Wahl, in der Sonne sitzt ihr ja hoffentlich schon und lauscht einer für mich zumindest sehr spannenden und persönlichen Unterhaltung. Los geht's!",
      "start": 29875,
      "end": 77478,
      "confidence": 0.8138701298701302,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wolfgang, du bist ja kein Morgenmensch, du bist ja ein Morgenmuffel. Also immer, wenn ich versuche, morgens mit dir eine Podcastaufnahme aufzunehmen und da steht eine 8 vorm Doppelpunkt, dann dauert das bei dir alles immer etwas länger, bis der Motor startet. Ich hab das Gefühl, du bist ab und zu mal so ein alter Diesel.",
      "start": 81467,
      "end": 97742,
      "confidence": 0.6339107142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt steht auch 8 vorm Doppelpunkt, bitte.",
      "start": 97782,
      "end": 99504,
      "confidence": 0.6397142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ne, jetzt steht eine 20 vorm Doppelpunkt, ja? Weil wir sind ja hier nicht mit AM, PM, sondern abends.",
      "start": 99764,
      "end": 105009,
      "confidence": 0.6624210526315789,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und heute macht man mal wirklich so richtiges Abendgespräch.",
      "start": 105353,
      "end": 107854,
      "confidence": 0.8083333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin wieder kommunikationsfähig, nennen wir es mal. Was machst du denn, wenn du um 10 aufstehst, bis 18 Uhr arbeitest und jetzt um 20 Uhr mit mir einen Podcast aufnimmst? Weil ich meine, du bist ja auch nicht mehr der Jüngste, Gedankenkapazität lässt auch langsam nach mit dem Alter. Machst du dann auch irgendwie Sport oder gehst du einmal den Berg hoch und runter? Natürlich, ja.",
      "start": 125861,
      "end": 146122,
      "confidence": 0.7264029850746269,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Mountainbiking ideal. Sechs Uhr Mountainbiking, danach nochmal ein paar Stunden arbeiten.",
      "start": 146686,
      "end": 151728,
      "confidence": 0.7163636363636363,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du überhaupt ein Mountainbike?",
      "start": 151748,
      "end": 153229,
      "confidence": 0.5528000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Natürlich habe ich ein Mountainbike.",
      "start": 153269,
      "end": 154710,
      "confidence": 0.33039999999999997,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bist du so ein E-Bike-Fahrer, der den Berg hoch fährt und dann hast du das getunt, dann drückst du einfach nur auf so einen Knopf anstatt zu trampeln?",
      "start": 154730,
      "end": 161653,
      "confidence": 0.5863928571428572,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Alles Bio. Ich habe nur ein Bio-Bike.",
      "start": 161693,
      "end": 164195,
      "confidence": 0.749142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wolfgangs CO2-Emissionen lassen sich an einer Hand abzählen.",
      "start": 164235,
      "end": 167216,
      "confidence": 0.804125,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das bezweifle ich aber. Das ist nochmal ein anderes Thema. Auf jeden Fall will ich mal auch die späte Stunde nützen, um ein gemütlicheres Gespräch zu machen mit dir. Und das hat ja letztes Mal schon recht gut funktioniert mit unseren Sommergesprächen, wo wir einfach mal frei über irgendwelche Themen sprechen.",
      "start": 167896,
      "end": 182790,
      "confidence": 0.7469615384615385,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Frei. Machen wir jetzt hier alles kann, nichts muss und lassen uns einen Ananas auf den Unterarm tätowieren oder?",
      "start": 182830,
      "end": 187992,
      "confidence": 0.7626315789473684,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, das war der Plan. Und du hattest ja letztes Mal, wo wir so über Juniors gesprochen haben und deine Erfahrung in dem Bereich, wie du so das Junior-Coaching angegangen bist und wo jetzt Juniors von deinen ehemaligen Teams sind, bei welchen großen Firmen. Und du hast ja dich auch am Ende kurz beschwert, dass wir uns da scheinbar so gefeiert haben als Manager und dass es ja auch viele negative Sachen gibt. Und genau diese Sachen möchte ich jetzt mal in dieser Episode besprechen. Und du hast ja keine Ahnung, um was es eigentlich geht. Du bist mal unvorbereitet ausnahmsweise. Und wir haben nicht mal eine Titeldefinition oder eine Episodendefinition. Darum möchte ich mal mit einer ganz einfachen Frage eigentlich anfangen. Und zwar wird ja in der IT und in diesen modernen Unternehmen immer so diese Fehlerkultur so hoch gelobt. Wir haben die gute Fehlerkultur, jeder darf die Fehler machen, die er will. Hast du schon mal bei einer Firma gearbeitet, wo es keine gute Fehlerkultur gab? Oder sagst du, war eigentlich immer schon seit jeher perfekte Fehlerkultur?",
      "start": 188512,
      "end": 244326,
      "confidence": 0.8211229050279331,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Spannende Frage. Bei allen Firmen, bei denen ich bisher gearbeitet habe, die haben immer kommuniziert, dass sie eine Fehlerkultur haben. Und da hieß es immer, wir können Fehler machen, solange wir daraus lernen. Und genau dieses Darauslernen ist dann immer der Knackpunkt. Denn das wird meist nicht getan. Beziehungsweise das Learning des Fehlers wird dann in einer kleinen Gruppe innerhalb des Teams gehalten, aber nicht groß in der Firma verbreitet oder dokumentiert oder ähnliches, denn Diese Fehlerkultur macht ja wirklich nur Sinn, wenn sie auch groß kommuniziert wird und der Kontext gegeben wird und dann was lief schief, damit auch andere Leute davon lernen können.",
      "start": 244346,
      "end": 281157,
      "confidence": 0.8444666666666668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber müssen die Fehler immer kommuniziert werden oder reicht schon, dass du im Kleinen auch Fehler machen kannst? Es muss ja nicht immer jeder Fehler breit und groß getreten werden.",
      "start": 281197,
      "end": 289284,
      "confidence": 0.7782333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ne, das ist richtig, doch es kommt natürlich auch auf den Fehler an, aber was ich schon sehr oft gesehen habe und was auch bei Trivago öfters mal.",
      "start": 289604,
      "end": 296769,
      "confidence": 0.8120714285714288,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Der Fall war, Wobei man dazu sagen muss, bei Trivago war das glaube ich wirklich sehr in den Vordergrund gestellt, also die Firma hat sich immer sehr gebrüstet damit, dass die Fehlerkultur vorhanden ist und eine gute Fehlerkultur vorhanden ist und jeder Fehler machen darf.",
      "start": 296790,
      "end": 310344,
      "confidence": 0.8513333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das stimmt und das habe ich auch sehr wertgeschätzt, doch ich war da neun Jahre und innerhalb diesen neun Jahren wurden diverse Fehler fast jährlich wiederholt. Einfach nur aus dem Grund, weil die Fehler nicht dokumentiert wurden, nicht in die Breite getragen wurden, keine Firewalls, Schutzschilder oder Guardrails implementiert wurden, und davon rede ich jetzt gar nicht immer softwaretechnisch, aber ab und zu vielleicht auch softwaretechnisch, um diese Fehler dann zukünftig verhindern. Weil man hat natürlich bei den Mitarbeitern eine gewisse Fluktuation. Besonders wenn man die Innovationsfreudigkeit und die Fehlerkultur so breit tritt, besonders wenn jedes Team seine Technologie nutzen darf, Container-Scheduler, Cloud und so weiter, dann werden Fehler gemacht. Jeder springt dann auf den Serverless-Hype auf und auf einmal merkt man, Lambda-Funktionen haben auch ihr Limit und können nicht unendlich skalieren, bla bla bla. Und irgendwie merkt man, hey, letztes Jahr hat das doch das andere Team da drüben genauso gemacht und sind ebenfalls auf die Nase geflogen. Und die Leute, die dann von außen zuschauen und dann diese Fehler sehen, denken sich, Okay, jetzt rennen die schon wieder vor die Wand. Aber man will ja auch nicht der Typ sein, der immer durch die Firma rennt und sagt, du, du, du, da sind wir auch schon mal gegen die Wand gerannt, deswegen machen wir es nicht. Weil offengesprochen, es kann ja auch sein, dass wir einfach nur zu blöd waren, das zu implementieren und die sind klüger.",
      "start": 310364,
      "end": 382920,
      "confidence": 0.8199581589958153,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie oft hast du denn das erlebt, vielleicht auch vor deiner Managerzeit, dass dir jemand gesagt hat, so kann es nicht funktionieren und du es trotzdem gemacht hast und selber dann gegen die Wand gerannt bist?",
      "start": 383300,
      "end": 393825,
      "confidence": 0.7693611111111113,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich schließe mich da ja nicht aus. Ich bin ja genauso einer.",
      "start": 393865,
      "end": 396487,
      "confidence": 0.8082499999999998,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ist dir das passiert, jetzt im Nachhinein gesehen?",
      "start": 397067,
      "end": 399690,
      "confidence": 0.7433333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Dass mir jemand gesagt hat, das funktioniert so nicht und dann.",
      "start": 399730,
      "end": 402993,
      "confidence": 0.831090909090909,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, dass du den Fehler selber einfach erleben hast müssen, obwohl dir vielleicht irgendwer, klassischerweise kann man auch noch erinnern, immer als jüngerer, unter Anführungszeichen, dass man so im Kopf hat, ja, Lass den alten da reden, ich kann das schon, ich kann es besser.",
      "start": 403013,
      "end": 418346,
      "confidence": 0.7877333333333331,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja ist mir passiert und ich denke es ist auch eine wertvolle Erfahrung, deswegen mache ich das gar nicht schlecht, dass Leute Fehler machen, denn es kommt natürlich auch darauf an, wo macht man den Fehler, wie hoch ist der finanzielle Schaden, weil denn auch zeitverbrannt ist ja auch finanzieller Schaden, wenn du so möchtest. Aber mir geht es nicht darum, dass die Leute keine Fehler machen dürfen und daraus lernen, also selbst lernen. Mir geht es um die Fehlerkultur innerhalb der Firma. Denn für mich ist das was anderes, wenn ein Team etwas implementiert, gegen die Wand rennt und dann den nächsten Lösungsansatz nimmt. Natürlich ist das auch eine Art Fehlerkultur. Eine richtige Fehlerkultur über die Firma, denke ich aber, wenn die ganze Sache wirklich breit getreten wird. Das, was wir zum Beispiel mal etabliert haben bei Trivago, war so eine Art Inzident-Konferenz. Was ist das? Bei Trivago hatten wir im Düsseldorfer Büro das Glück so einen kleinen Kinosaal zu haben, das war so perfekt für so kleine Konferenzvorträge. Und was wir gemacht haben ist, wir haben einmal pro Quartal uns drei Inzidenz vom vorherigen Quartal rausgesucht und haben die präsentiert. Was war das Szenario, was ist schiefgelaufen, wie haben wir es repariert und was haben wir daraus gelernt und wie haben wir dann diese Bugfixes implementiert, damit man nicht noch mal in dasselbe Szenario rennt. Ich weiß gar nicht mehr, wie das Event wirklich hieß. Dennoch ist das zumindest ein Ansatz, wie man die Fehlerkultur ein bisschen weiter treiben kann und über sein Team hinaus diesen Problemen vorbeugen kann. Denn für mich ist wichtig, dass die Organisation davon lernt, weil nur dann macht es wirklich Sinn. Denn eine Organisation möchte nicht denselben Fehler zweimal machen. Wenn wir sagen, wir haben eine Fehlerkultur und jedes Team macht doch eigentlich den Fehler, Dann haben wir keine Fehlerkultur, dann ist das Management einfach scheiße und dann funktioniert die Planung nicht oder die Cross-Team-Kollaboration einfach nicht. Weil das ist einfach nur Geld verbrennen, meines Erachtens nach. Weil man möchte sich ja nach vorne bewegen. Und die große Herausforderung dabei ist eigentlich, dass nachdem man den Fehler gemacht hat, kommt der anstrengende Teil. Der anstrengende Teil, den keiner mag. Die ganze Sache runterschreiben. die ganze Sache wirklich mal verstehen. So eine sogenannte Root Cause Analysis. Was ist hier eigentlich falsch gelaufen? Wenn es jetzt ein Code war, welcher Commit hat dazu geführt, dass die Änderung reingegangen ist? Und warum ist das damals beim Pull Request Review nicht aufgefallen? Oder, oder, oder. Oder wenn das jetzt ein Engineering-Management-Fehler war, dass man das dann später im Peer-Review oder im Peer-Coaching mal wirklich durchleuchtet. Was war daran schlecht? Warum bin ich in diese Situation gekommen? Wann hätte ich diese vermeiden können und wie würde ich es nächstes Mal anders machen? Oder war das vielleicht gar kein Fehler, sondern die andere Person hatte jetzt gerade auch nur einen schlechten Tag? Kann ja auch sein, weil da sprechen ja zwei Menschen. Also die anstrengende Arbeit beginnt eigentlich, nachdem man den Fehler gemacht hat. Entweder retrospektiv sich darüber Gedanken zu machen, oder Storytelling draus zu machen oder ein Talk draus zu machen oder einen Markdown Fall zu schreiben oder oder oder.",
      "start": 418386,
      "end": 579245,
      "confidence": 0.811592105263158,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt ist das ganze beim Incident Management und in dem ganzen DevOps Bereich ja durchaus gang und gäbe und wie gesagt in Firmen spricht man auch ganz oft davon. Wir haben eine gute Fehlerkultur, aber du hast ja jetzt auch primär eigentlich von so klassischen Infrastruktur, technischen Inzidenz gesprochen und weniger von irgendwelchen Fehlern unter Anführungszeichen, aber bleiben wir mal bei diesem Wort, Fehler ist sowieso immer fraglich. Wenn es um Strategie geht, wenn es um personelle Entscheidungen geht, als Manager, Produktentscheidungen, Priorisierungen, welches Projekt habe ich höher priorisiert, war das die richtige Entscheidung? Wie sieht es denn in diesem Bereich aus? Deiner Erfahrung nach. Weil mein Gefühl war eigentlich immer, dass in dem Bereich viel, viel weniger geshared wird. Da heißt es nur, man darf Fehler machen. Das heißt, man kann auch einfach mal was ausprobieren, was fehlt. Und das hat man vielleicht auch geshared. Okay, wir haben da ein neues Feature ausprobiert. Und das hat nicht den Revenue zum Beispiel gebracht. Aber ich glaube, dass ich irgendwo mal in einem sinnvollen Rahmen irgendwie gehört habe, ich habe eine falsche Recruiting-Entscheidung getroffen. Das habe ich irgendwie zum Beispiel nie irgendwo mitbekommen.",
      "start": 579285,
      "end": 645374,
      "confidence": 0.7960989583333339,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Okay, Recruiting ist natürlich was ganz anderes als Strategie- oder Projektpriorisierung. Habe ich falsche Recruiting-Entscheidungen getroffen?",
      "start": 646085,
      "end": 653069,
      "confidence": 0.79425,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn du jetzt Nein sagst, dann ist es natürlich relativ easy, dann braucht man nichts teilen. Aber ganz allgemein, wir hatten selten über solche Dinge irgendwie strukturiert gesprochen, zumindest so strukturiert, wie man über Inzidenz auf der Infrastrukturseite spricht.",
      "start": 653089,
      "end": 666255,
      "confidence": 0.7685384615384615,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Beim Recruiting ist das natürlich alles immer so eine Thematik, weil a. es geht um Menschen, b. um zu verstehen, was da falsch lief, braucht man in der Regel sehr viel Kontext, was dann auf persönliche Daten betrifft. Nehmen wir mal ein Beispiel. Eine Entscheidung, vor der ich öfters schon stand und auch jetzt noch ab und zu stehe, ist, du bist in einem Vorstellungsgespräch und der Kandidat hat eine enorm hohe Gehaltsvorstellung. Die Gehaltsvorstellung passt vielleicht in deinen Rahmen von deinem Budget, dennoch wird das ein Ungleichgewicht in die Bezahlung vom Team bringen. Das ist so ein klassisches Ding, was eigentlich, ich würde sagen, fast jede Person, die irgendwie Leute einstellt, mal betrifft. Hierst du diese Person jetzt für einen relativ teuren Preis und bringst damit eine Salary-Imbalance ins Team? Ist die Person überhaupt so viel Geld wert? Kann diese Person innerhalb der Probezeit wirklich ihren Wert zurückliefern bzw. beweisen, dass sie das Geld wert ist? Das sind vielleicht noch so die einfachen Fragen. Meine Frage ist dann aber oft, wie weit oder wie lange kann man die Person denn überhaupt halten? Denn wenn die Person mit ihrem Gehalt denn schon am oberen Ende ist, wie sehen dann die zukünftigen Gehaltsgespräche aus? Weil ob die Budgets erhöht werden, kannst du in der Regel als Engineering Manager nicht beeinflussen. Das macht die Firma. Und du kannst auch nicht jedes Jahr sagen, du kriegst keine Gehaltserhöhung, weil du schon am oberen Limit bist. Das bedeutet, Bereits bei der Verhandlung, bereits bei der Einstellung schafft man sich schon ein relativ kniffliges Problem, um die Person länger als zwei Jahre zu halten.",
      "start": 666842,
      "end": 761408,
      "confidence": 0.8232416356877322,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber wenn es die Person geht, hattest du mal irgendeinen strukturierten Prozess, wo du mit anderen Hiringmanagern zum Beispiel besprochen hast, okay, wir hatten den Fall, haben jemanden zu hoch eingestellt, der ist wieder rausgetroppt oder ganz allgemein so die klassische Metrik, die man ja ganz oft anwendet, wie viele Leute von deinen Hires bleiben dir ein Jahr. weil du mal davon ausgehst, wenn ein Jahr die Person bleibt, dann ist sie einerseits mit dem Gehalt wahrscheinlich zufrieden, du bist zufrieden, alle Beteiligten sind zufrieden, alle die vor einem Jahr rausdroppen, da war wahrscheinlich irgendwo ein Problem, egal von welcher Seite. Aber hast du diese Learnings jemals geteilt?",
      "start": 761468,
      "end": 799278,
      "confidence": 0.8152037037037035,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, im kleinen Kreis mit Engineering-Manager-Kollegen, in Runden wie Peer-Coaching oder ähnliches, da, wo man wirklich zu fünft oder zu sechst saß, maximal, in einem vertrauten Kreis, wo wirklich explizit gesagt wurde, wenn man in den Raum kam, alles, was hier besprochen wird, bleibt hier im Raum, weil um solche Fälle zu besprechen, braucht man Kontext. Und wie ich gerade schon sagte, der Kontext hat dann meist Informationen, die in der Regel nicht öffentlich zugänglich sein sollten, aufgrund von Datenschutz oder ähnliches. Sie werden aber nicht weit in die Firma hinausgetragen, wie zum Beispiel ein Software-Failure oder sowas. Das Problem ist aber, ich bin mir gar nicht sicher, ob man da groß daraus lernen kann, denn man kann Patterns erkennen.",
      "start": 799318,
      "end": 839406,
      "confidence": 0.8415833333333335,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber das ist ja lernen. Das ist ja, wenn du rausfindest, das sollte ja HR ja auch machen und teilweise gibt es ja auch so Prozesse, dass das wirklich erfasst wird, damit man mal weiß, okay, was sind denn die Hauptgründe, warum Leute überhaupt gehen? Ist es das Gehalt? Haben wir ein Problem mit dem Gehalt? Also diese Sachen, die ja bei uns in der IT eigentlich sehr üblich sind, was du jetzt erzählt hast in der Infrastruktur, wo das mit Incident Management und Nachbearbeitung und Sharing und Retrospektiven und solchen Dingen ja doch sehr üblich ist. Wenn man in die andere Richtung geht, Richtung Strategie, Produkt, Hiring, also alle anderen Entscheidungen, die nicht so klar technisch sind von Engineering Managern, habe ich das Gefühl, dass da wesentlich weniger strukturelle Nachbearbeitung und Aufarbeitung des Geschehenen eigentlich stattfindet.",
      "start": 839506,
      "end": 885518,
      "confidence": 0.8238333333333335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also auf vielen Engineering Konferenzen, Code Talks in Hamburg zum Beispiel, da gibt es halt auch oft Talks. Wir haben uns jetzt für Microservices entschieden und das haben wir gelernt und das war ein Fehler. Prinzipiell ist das ja auch eine strategische Entscheidung. Klar, hat was mit Technik zu tun, aber in unserem Tech-Job haben wir ja eigentlich immer mit Technik zu tun.",
      "start": 885847,
      "end": 903092,
      "confidence": 0.8249682539682537,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist aber eine strategische, technische Entscheidung, ja. Und weniger Product oder andere Dinge.",
      "start": 903132,
      "end": 908613,
      "confidence": 0.7582307692307692,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meines Erachtens nach ist das auch Produkt- und Organisationsstrategie, denn wenn wir sagen, Microservices richtet sich unter anderem, wie man seine Teams organisiert, denn wie wir in der Microservices vs. Monolith-Folge gelernt haben, ich bin der Meinung, dass Microservices zu einem Großteil ein organisatorisches Problem löst, ja, auch technische, aber der primäre Driver ist ein organisatorischer, dann ist das eine Firmenstrategie. Ob das dann hinten raus eine Produktentscheidung ist, das kommt, glaube ich, aus dem Produkt an, wie zum Beispiel, nehmen wir mal Amazon Web Services. Ich glaube, wenn Jeff Bezos damals nicht ausgerufen hätte, jedes Team macht jetzt hier einen API-First-Ansatz. Ich bin mir nicht sicher, ob Amazon Web Services dann in der Lage wäre, so viele verschiedene Produkte auf einmal zu launchen. Deswegen war da ja eine technische Entscheidung, auch eine strategische und eine Produktentscheidung. Deswegen kommt es halt ganz auf das Produkt an. Und das macht die ganze sache so schwierig die nachbearbeitung weil du enorm viel kontext braucht du musst ich hab das gefühl bei diesem produkt und strategischen entscheidungen musst du erst mal zehn minuten den kontext geben in welchem land sind wir wie sieht die kundengruppe aus b2b b2c wie sieht die ökonomische lage aus haben wir gerade corona ja nein, Ja, klar.",
      "start": 909405,
      "end": 974020,
      "confidence": 0.8086746411483255,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Brauchst du Kontext, aber das ist in jedem Bereich so. Egal, welches Problem du besprichst.",
      "start": 974060,
      "end": 978824,
      "confidence": 0.7492666666666665,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist korrekt, aber ich habe das Gefühl, bei Technik brauchst du deutlich weniger Kontext als bei Produkt- oder Strategieentscheidungen, weil es da in der Regel auf objektive Mittel zurückgeht. Jetzt muss ich eigentlich sagen, dass es bei Produkt- und strategischen Entscheidungen sehr subjektiv zugeht, was aber auch nicht immer der Fall ist, weil es gibt ja viel Research. Aber ich sehe das so. Kennst du Wolfgang Grupp?",
      "start": 978864,
      "end": 999481,
      "confidence": 0.8180147058823531,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist der Stahlmensch.",
      "start": 999521,
      "end": 1000942,
      "confidence": 0.7499999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wolfgang Grupp ist kein Stahlmensch, Wolfgang Grupp ist der Geschäftsführer von Trigema, von diesen T-Shirts.",
      "start": 1001442,
      "end": 1007885,
      "confidence": 0.8695999999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ah doch, den kenn ich auch, ja.",
      "start": 1007925,
      "end": 1009566,
      "confidence": 0.7062857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sehr, sehr bekannter deutscher Unternehmer. Sehr erfolgreich, muss man ihm leider lassen.",
      "start": 1009606,
      "end": 1014049,
      "confidence": 0.8716666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und sehr schwierig, ja.",
      "start": 1014109,
      "end": 1014909,
      "confidence": 0.406,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, Hardliner, in wie er sein Unternehmen führt. Er ist aber auch der Meinung, trifft lieber eine falsche Entscheidung als gar keine. Weil dann geht es wenigstens weiter, weil keine Entscheidung zu treffen, ist meines Erachtens nach, und da bin ich mit ihm einer Meinung, teurer, wenn alle irgendwie so in der Luft hängen, als immer die richtige. Denn du musst ja nur, es gibt glaube ich mal irgendwo so Statistiken, ich glaube, du musst nur 60 oder 70 Prozent von deinen Entscheidungen richtig haben. Dann bist du im Mittel deutlich schneller als Leute, die keine Entscheidung treffen. Und wenn du 30 Prozent der Entscheidung oder 35 Prozent der Entscheidung falsch triffst, dann ist das okay, weil du bewegst dich im Mittel immer weiter nach vorne. Das ist so ein bisschen das Pareto-Prinzip. Wie viele Daten hast du denn zur Hand, wenn du die Entscheidung triffst?",
      "start": 1015448,
      "end": 1054411,
      "confidence": 0.7651232876712327,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was natürlich noch dazu kommt, ist, dass du ganz viele Entscheidungen jederzeit revidieren kannst.",
      "start": 1054431,
      "end": 1058193,
      "confidence": 0.7354666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, ich glaube da gibt es ja.",
      "start": 1058577,
      "end": 1059738,
      "confidence": 0.5758571428571428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die, war das von Jeff Bezos? Keine Ahnung, ich bin sowieso kein Fan von das, nur weil das irgendwelche großen Leute gesagt haben, dann sollte man das verfolgen, aber wer auch immer das gesagt hat, ich habe das sehr sinnvoll empfunden, dass man Entscheidungen in zwei Teile aufteilt, in Entscheidungen, die schnell revidierbar sind, die man jederzeit umändern kann und eben Entscheidungen, die langfristiger sind. Wenn man sich jetzt entscheidet, ein neues Office zu bauen, was irgendwie sieben Jahre dauert, dann kannst du nicht einfach nach drei Jahren sagen, jetzt bauen wir es doch nicht mehr. Hingegen, wenn du natürlich irgendwelche AB-Tests machst, das kannst du tagtäglich entscheiden, wieder zurückrollen, da hast du die volle Flexibilität und so kannst du natürlich auch dementsprechend dann Entscheidungen abwägen, wo du wie viel Zeit investierst. Bei dem guten Group, wenn ich mir da manche Videos anschaue, bin ich mir nicht sicher, ob der eine Fehlerkultur hat, wo die Leute gerne Fehler machen, so wie der rumschreit, aber das ist nochmal ein anderer Bereich und ich habe noch nie dort gearbeitet, also ich kann es ja auch nicht einschätzen. Aber kommen wir mal zurück zu dieser Fehlerkultur. Wie stellst du denn in deinem Team sicher als Engineering Manager, dass es eine gute Fehlerkultur gibt, dass sich Leute trauen, Fehler zu machen, wenn es das Ziel überhaupt ist, Fehler zu machen? Beziehungsweise Ziel ist es wahrscheinlich keine Fehler zu machen natürlich, aber dass man auch Fehler machen kann, um gewisse Learnings zu machen, wenn sie nicht sinnlos sind.",
      "start": 1059758,
      "end": 1134202,
      "confidence": 0.7805770750988145,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meine primäre Aufgabe ist eigentlich, dass die Leute verstehen, dass sie nicht leichtsinnig handeln sollen.",
      "start": 1134442,
      "end": 1138463,
      "confidence": 0.8127999999999997,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie machst du das?",
      "start": 1138503,
      "end": 1139604,
      "confidence": 0.6304000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ich immer erwarte ist, wenn die Leute irgendwie so einen Hero-Stunt machen wollen, weiß ich nicht, irgendeine Datenbankmigration oder Chaos-Testing. Halt, wenn die Leute ihren Job machen, weil Software-Engineers werden dafür bezahlt, Sachen zu ändern, dann ist meine erste Frage, okay, was ist, wenn das in die Binsen geht? Wie rollen wir zurück? Wo haben wir eine Sicherungskopie? Wie sieht das Disaster-Recovery-Szenario aus? Und wenn mir gesagt wird, na, ja, weiß ich grad nicht, das muss jetzt klappen, dann sag ich, mach mal nicht. Weil diese Leute müssen erst ihre Hausaufgaben machen und die ganze Sache so durchdenken, dass es eine sehr hohe Chance hat, erfolgreich zu sein. Ähnlich wie so ein Experiment. Du schreibst ja auch auf, das ist meine These, so mach ich's, das ist das erwartete Ergebnis. Dann machst du das Experiment und dann füllst du die letzte Sektion aus, das war das reale Ergebnis. Und danach schaust du dir vielleicht noch die Logdaten an oder dein Reagenzglas, welche Farbe das Wasser hat oder was weiß ich nicht. Und dann ist das Experiment fertig. Eine Migration oder ein Deployment oder ähnliches ist ja nichts anderes eigentlich. Du dokumentierst, was du ändern möchtest. Du dokumentierst das erwartete Ergebnis. Du dokumentierst, was du machen wirst. Und dann hast du noch eine Sektion, was ist, wenn das da und da schief geht. Wie kann ich auf die Daten wieder zugreifen? Wie komme ich wieder an den Server? Habe ich Data Loss oder ähnliches? Und solange das gegeben ist, können die Leute das machen. Wenn das nicht gegeben ist, ist das für mich leichtsinnig. Aber ich sage auch, ihr habt die Verantwortung. Und wenn ihr das in die Wand fahrt und eure Frau kriegt gerade kein Baby oder ihr habt gerade keinen Notartermin, dann fixt ihr das. Denn ihr habt die Freiheiten, aber dann erwarte ich auch, dass danach wieder zurück auf Baseline gestellt wird. Und wie du merkst, spielen da ein paar Elemente mit. Ich bin Fan von Aufschreiben. Ich bin Fan von asynchroner Kommunikation. Ich bin Fan davon, sich Gedanken darüber zu machen. Ich bin Fan davon, dass das geschriebene Dokument dann später auch rumgezeigt werden kann. Ist natürlich dann ein bisschen mehr Aufwand. Eine Stunde, zwei, drei, vier. Je nachdem, wie groß dein Vorhaben ist. Meines Erachtens nach macht es sich aber 55 mal bezahlt.",
      "start": 1139624,
      "end": 1253175,
      "confidence": 0.7877139175257731,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie bist du denn mit deinen eigenen Fehlern im Team umgegangen? Hast du die geteilt? Hast du die breitgetreten, wie du es so schön gesagt hast?",
      "start": 1254535,
      "end": 1262983,
      "confidence": 0.7154230769230772,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe sie nicht im Team breitgetreten, aber immer wenn das irgendwo mal aufkam, in einer Konferenz, in einem Meetup oder ähnliches, habe ich darüber gesprochen, ja.",
      "start": 1263003,
      "end": 1269769,
      "confidence": 0.7607407407407407,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wenn du jetzt von der technischen Seite mal weggehst, wenn du jetzt irgendwen zum Beispiel gekündigt hast oder vielleicht auch jemand losgeworden bist, der ein Fehler war, hast du das kommuniziert im Team? Und wenn nicht, warum nicht? Oder hast du es bewusst nicht oder bewusst schon gemacht?",
      "start": 1270256,
      "end": 1284105,
      "confidence": 0.7815918367346938,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sowas kommuniziert man nicht, meines Erachtens nach, weil das Angst schürt. Angenommen, man würde sagen, man hat jemand explizit gekündigt. Das hört sich erst mal scheiße an. Wenn du das so im Team teilst, du hast den einfach kündigt, dann denkt sich jeder, oh, ich könnte der Nächste sein. Weil da fehlen halt super viele Informationen. Da fehlt, dass man etliche Feedback-Gespräche vorher hatte. Da fehlt die Performance-Ratings. Da fehlt die 55 Chancen, die der Mitarbeiter oder die Mitarbeiterin hatte, sich zu verbessern. Da fehlen Informationen über den Performance-Improvement-Plan und, und, und. Denn das Einzige, was die Leute merken, oh, ich könnte der Nächste sein.",
      "start": 1284125,
      "end": 1317121,
      "confidence": 0.7651428571428568,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und was machst du, wenn dich jetzt in einem One-on-One jemand direkt fragt, was ist der mit Person X passiert?",
      "start": 1317161,
      "end": 1321262,
      "confidence": 0.7012999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es hört sich jetzt gerade so an okay wir sitzen heute beim Stand-up und morgen ist die Person einfach vom Erdboden verschluckt, da findet natürlich ein klassisches Offboarding statt vorher findet.",
      "start": 1321682,
      "end": 1330736,
      "confidence": 0.8010967741935484,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja aber das sieht ja die Person die fragt auch nicht also was ist wenn wenn dich jetzt irgendwer im 101 fragt was ist denn mit, Betagrad basiert. Also wurde der gekündigt?",
      "start": 1330756,
      "end": 1339967,
      "confidence": 0.76959375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf sowas gehe ich in der Regel nicht ein, weil das sind persönliche Daten. Und dann frage ich oft zurück, es tut mir leid, aber wenn wir beide eine schwierige Zeit hätten, würdest du gerne wollen, dass ich alle deine Details teile? Und da kommt in der Regel ein Nein zurück. Das bedeutet, ich reflektiere oder ich lasse die Person ein bisschen reflektieren. Ich verstehe die Neugier. Dennoch schütze ich schon die Privatsphäre und die Details von jedem Einzelnen. Denn es ist einfach so, dass solche Szenarien so gut wie niemandem was angehen, weil das halt auch confidential teilweise ist.",
      "start": 1340007,
      "end": 1371048,
      "confidence": 0.8381699999999996,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber solche Entscheidungen sind ja auch meistens nicht sehr einfach. Und wie gesagt, viele stellen sich ja gerade, die noch nie irgendwo mal in dieser Liedrolle waren, das sehr einfach vor, dass man da einfach so irgendwelche Leute feuert und so. Aber es ist ja wirklich recht schwierig teilweise und emotional auch das Ganze. Besprichst du das dann mit Peers zum Beispiel?",
      "start": 1371088,
      "end": 1390117,
      "confidence": 0.840016129032258,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Als ich mal jemand gehen lassen musste.",
      "start": 1390157,
      "end": 1391878,
      "confidence": 0.8185714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Schöne Übersetzung vom Englischen.",
      "start": 1392415,
      "end": 1393176,
      "confidence": 0.08825,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Übrigens, ja. To let go, meinst du? Ich habe mir damals sehr, sehr, sehr viel Support von meinem Manager geholt, von meiner Reporting-Line. Und da muss ich auch sagen, dieser Mensch hat mir sehr, sehr viel beigebracht über den ganzen Prozess, um a, die ganze Sache fair für beide Seiten zu gestalten, B, ich habe unglaublich viel gelernt über explizite Kommunikation und C, weil du ja auch schon angesprochen hast, dass die ganze Sache sehr gefühlsgetrieben sein kann, wie man bei manchen Gesprächen einfach recht hart bleibt, weil man eine Entscheidung getroffen hat. Weil in solchen Szenarien kommen natürlich Fragen vom Mitarbeiter, aber du musst die Entscheidung vertreten, weil im Endeffekt ist dein Job hier als Engineering Manager nicht, dass du jemandem etwas Böses willst, sondern du repräsentierst die Firma gerade. Und bei solchen Fällen, wo sich zwei Wege trennen, mit hoher Wahrscheinlichkeit nicht im Guten, ist das seltenst deine eigene Entscheidung oder alleinig deine eigene Entscheidung. Da hängt nämlich eine ganze Menge dran, da ist die Personalabteilung mit involviert, der Director, gegebenenfalls der VP, also der Abteilungsleiter, der Gruppenleiter und so weiter. Das wird nicht so entschieden, ach ich stehe heute mal jemanden, ich stehe heute mal auf und spiele mal russisch Roulette. So heute bist du dran Wolfgang. So funktioniert das alles nicht. Das ist in der Regel ein Prozess über Monate. Von daher, wenn man die ganze Sache dann, hört sich jetzt so doof an, aber ausgeführt hat, dann kann man sowas später vielleicht mal im Peer-Coaching machen und seine Learnings teilen. Aber da ist natürlich dann auch Vertrauen und der sichere Kreis die höchste Priorität.",
      "start": 1395098,
      "end": 1488257,
      "confidence": 0.8189776951672861,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hast du schon erwähnt, dass du da im Namen der Firma agierst bei sowas. Und das ist ja ein Problem bei Managern oder von dieser Managerrolle, dass man irgendwie ganz oft eigentlich im Namen der Firma agiert. Und oft ist man ja selber auch mit irgendwas unzufrieden in der Firma, zum Beispiel mit einer Umstrukturierung oder mit dem CEO. Also es gibt ja, würde ich mal sagen, eine Bandbreite. Gewisse Sachen unterstützt man, gewisse weniger. Von manchen ist man komplett angepisst. Wie viel lässt du üblicherweise zu deinem Team durch von diesen Ansichten, die du über die Firma hast? Gar keine? Oder sagst du mal in 101s, auch vielleicht mit Leuten, mit denen du dich besser verstehst, also jetzt die wirklich in deinem Team sind, wo du der Lead oder Manager bist, erzählst du denen mal, wenn dich irgendwie der CEO anpisst, weil irgendwie eine verdammt dumme Entscheidung euer Team betroffen hat? Oder bist du da immer komplett kalt und lässt gar nichts durch, wenn du das mal Ruby basieren lässt über die letzten Jahre? Ich kann dir dann übrigens auch gerne sagen, was ich dazu denke. Also ich will dir da jetzt nicht nur ausquetschen, ich habe ja auch meine Meinung dazu.",
      "start": 1488617,
      "end": 1550746,
      "confidence": 0.7960588235294117,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sehr schöne Frage. Mir fallen gerade drei Kategorien ein. Erstens, wenn du Angestellter in einer Firma bist, unabhängig davon, ob Individual Contributor oder Engineering Manager oder Abteilungsleiter oder VP oder Director oder was weiß der Geier nicht, Im Endeffekt wurdest du eingestellt, um einen Traum von jemandem anders zu verwirklichen. Das meine ich mit, du agierst im Sinne der Firma. Natürlich hast du einen gewissen Grad an Einfluss, Entscheidungen zu ändern, aber im Endeffekt bist du der lange Arm vom Chef, vom CEO, um den Traum zu verwirklichen oder um dafür zu sorgen, dass der Traum verwirklicht wird. Der zweite Gedanke ist, als Engineering Manager kannst du nicht über alles beleidigt sein, denn passieren viele Dinge, die dir nicht gefallen. Ja, hundertprozentig. Aber werte dir mal ganz kurz bewusst, was dein Job ist. Dein Job ist es, gegebenenfalls Sachen zu ändern. Das bedeutet, wenn eine Entscheidung von oben herabfällt, weil Scheiße fällt nämlich immer nach unten und in der Regel bist du unten, dann kannst du, dann hast du jetzt zwei Möglichkeiten. Du kannst dich wie ein beleidigtes Baby irgendwo in den Meetingraum setzen, deinen Kaffee trinken und beleidigt sein.",
      "start": 1550766,
      "end": 1607809,
      "confidence": 0.7600631578947366,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber es geht ja gar nicht ums beleidigt sein. Es geht ja darum, wenn du jetzt wirklich was schlecht findest. Wir gehen mal davon aus, dass du wirklich was schlecht findest. Teilst du dann solche Sachen oder nicht? Okay, du bist jetzt nicht bei allem beleidigt, aber es gibt garantiert Sachen, die dir gegen den Strich gehen und wo du mir wahrscheinlich als Peer sagen würdest, so ein Scheiß. Wann sagst du oder wie viel sharest du mit deinem Team? Oder ab wann sharest du was mit deinem Team? Oder sharest du gar nicht? Ist ja auch legitim.",
      "start": 1608518,
      "end": 1632672,
      "confidence": 0.7485714285714287,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "In der Regel habe ich eine sehr hohe Transparenz zu meinem Team. Dennoch ist meine Aufgabe, auch das Team zu schützen. Denn als Engineering Manager habe ich Zugriff auf viel mehr Informationen als die Teams und ich möchte auf keinen Fall denen die Laune verderben, denen schlechte Stimmung machen oder ähnliches. Und nur weil es mir gegen den Strich geht, heißt das nicht, dass das negativ fürs Team ist.",
      "start": 1632912,
      "end": 1652497,
      "confidence": 0.7969130434782609,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also hör da raus, dass du gar nichts sharest mit dem Team und dass dir das auch wichtig ist, dass das Team nichts mitbekommt von deinem Nicht-Gut-Finden von gewissen Dingen.",
      "start": 1653196,
      "end": 1661402,
      "confidence": 0.6785000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich versuche auf jeden Fall nicht sowas zu sagen wie, das war jetzt nicht meine Entscheidung, aber ich muss das jetzt hier exekutieren, ich muss das jetzt hier machen. Ich finde das auch scheiße, aber das machen wir jetzt so, okay. Denn ich wurde eingestellt, um die Firma zu vertreten. Ich kann mich nicht meiner Verantwortung entziehen, denn ich bin Teil des Leaderships, Teil des Managements. Und wenn jemand über mir etwas entscheidet, dann ist das auch partiell meine Aufgabe, diese Entscheidung weiterzutragen. Und jetzt kann ich mir natürlich entscheiden und sage, da oben haben sie irgendwie oder was entschieden, aber meine Aufgabe ist es, mit dieser Entscheidung zu arbeiten und das Beste daraus zu machen und das Team trotzdem produktiv zu halten oder das Beste fürs Team rauszuholen oder, oder, oder. Ich kann mich nicht der Verantwortung entziehen.",
      "start": 1661422,
      "end": 1703013,
      "confidence": 0.8080359712230216,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also der Hintergrund dieser Frage ist eigentlich auch, weil ich gerade kürzlich mit jemandem gesprochen habe, der übrigens auch mal bei dir im Team war und mittlerweile selbst Lead geworden ist. Und die Person hat bekrittelt, dass, was sie bisher erlebt hat, war immer so, dass ihre Leads nie irgendwie was geteilt haben und da eine extreme Wand immer aufgebaut wurde. Und man da nie irgendwie eine Connection zu dem Lead herstellen konnte. Und dass da immer alles abgeblockt wurde in der Richtung. Und die Person würde das gern anders machen, by the way. Aber wie gesagt, es gibt unterschiedliche Leadership-Styles, ganz klar. Ich bin auch nicht deiner Meinung übrigens, teilweise zumindest. Aber würdest du dann sagen, du hast bewusst da eine Mauer und eine Wand, die zwischen dir und Team steht? Ich glaube, es braucht definitiv eine Mauer. Die Frage ist immer, wie hoch ist sie und was lässt man durch und was nicht. Das ist, glaube ich, die Schwierigkeit an so einer Lead-Position.",
      "start": 1703193,
      "end": 1753336,
      "confidence": 0.8066727272727273,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich denke, der Scheiß, der im Management abgeht, sollte nicht immer nach unten fallen. Ich denke, ab und zu sollte man dann eine scheiße Rutsche nach links und rechts am Team vorbeibauen.",
      "start": 1753616,
      "end": 1762484,
      "confidence": 0.8061562499999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber okay, das ist, damit das Team gar nichts mitbekommt. Aber oft bekommt das Team ja was mit und du hast auch eine Meinung dazu. Und dann ist eben die Frage, wie weit darf das Team deine Meinung überhaupt erfragen, deine echte Meinung? Oder wie weit spielst du mit der Firma mit? Weil meine Herangehensweise ist eigentlich schon, dass ich auch eher auf der Firmenseite bin, weil man muss ja mit den Entscheidungen leben, wie du richtig gesagt hast. Aber es gibt schon viele Punkte, wo ich zumindest auch versucht habe, meine Meinung darzustellen, aber auch den Kontext der Firma vielleicht zu geben. Also auch das, was wir jetzt besprochen haben, diesen Kontext weiterzugeben, dass man die Entscheidung vielleicht besser verstehen kann, aber trotzdem, dass ich vielleicht anderer Meinung bin. Und wenn ich jetzt CEO wäre, hätte ich es anders gemacht. Das ist ein ganz konkretes Beispiel, Wir hatten mal eine Änderung bezüglich des Salary-Prozesses, der meiner Meinung nach gar nicht gut war, wo ich aber sehr wohl die Firmenmeinung vertreten habe, weil das einfach sonst zu extrem viel, noch mehr bösem Blut geführt hätte zum Beispiel, weil die Leute eh schon auf 160 waren und dann hätte da noch mehr Salz in die Wunde gestreut. Da war ich eher auf der Firmenseite. Hingegen, wenn ich in einem Meeting bin und als gesamtes Team der Chef erklärt, er hätte das am Wochenende lösen können, was wir in zwei Monaten programmiert haben, dann kann ich mich nicht auf die Firmenseite stellen. Die Leute kommen zu mir, beschweren sich, dann kann ich nicht sagen, doch, er hat recht, der CEO. Da muss ich sagen, das war Bullshit. Ich bin absolut deiner Meinung, das ist absoluter Bullshit. und vielleicht noch irgendwie Kontext geben oder vielleicht sagen, vielleicht hat er einen schlechten Tag gehabt, was ja durchaus sein kann. Aber solche Sachen, da muss ich auf der Teamseite stehen. Und gewisse andere Umstrukturierungen zum Beispiel kann ich auch sagen, ich persönlich hätte es anders gemacht, wir müssen jetzt aber damit leben. Es ist eine mögliche Entscheidung gewesen, ich hätte es auch anders gemacht, aber sie ist okay und machen wir das Beste daraus. Also ich finde, da kann man schon auch wesentlich offener sein mit dem Team zum Beispiel.",
      "start": 1762524,
      "end": 1871041,
      "confidence": 0.8032079999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn ich nach meiner Meinung gefragt werde und meine Meinung führt jetzt nicht zu irgendeinem Gossip im Team oder lässt das Management schlecht dastehen oder oder oder, weil das bringt nämlich niemanden weiter, wenn wir anfangen darüber zu lästern, wie doof die Entscheidung war. Denn ich bin fest davon überzeugt, dass die Leute über mir eine Entscheidung zum Besten der Firma treffen.",
      "start": 1871377,
      "end": 1889700,
      "confidence": 0.8498387096774196,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ich bin auch überzeugt, dass sie die Verantwortung haben, wenn sie da was entscheiden, dass sie da mit den Konsequenzen leben müssen. Und wenn mir das nämlich so gegen den Strich geht, dann kann ich das sharen, kann die Firma verlassen, was es auch immer ist, aber die müssen dann auch mit den Konsequenzen leben. Und wir haben meiner Meinung nach auch den Luxus, dass wir entscheiden können, wo wir arbeiten wollen. Und wenn das Upper Management eine Entscheidung trifft, muss es mit den Konsequenzen leben. Und ich muss nicht alles automatisch gutheißen, solange mein Vertrag gilt. Also da bin ich absolut dagegen.",
      "start": 1890064,
      "end": 1919791,
      "confidence": 0.8318749999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ja, da bin ich ja auch voll bei dir. Doch das liegt ja dir. Also du triffst ja die Entscheidung, ob du mit dieser Entscheidung, die über dir getroffen wurde, lebst oder nicht.",
      "start": 1920191,
      "end": 1929975,
      "confidence": 0.788264705882353,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder wie ich sie behandle, ja.",
      "start": 1929995,
      "end": 1931336,
      "confidence": 0.6443333333333333,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau. Und wenn ich sage, uns fehlt der Kontext, dann meine ich damit unter anderem auch, wir wissen ja gar nicht, welche Gedankengänge da stattgefunden haben. Wir wissen ja gar nicht, ob die sich über das Worst-Case-Gedanken gemacht haben. Wir wissen ja gar nicht, unter welchen Voraussetzungen die ganze Sache getroffen wurde.",
      "start": 1931376,
      "end": 1947522,
      "confidence": 0.879769230769231,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber da muss mir der Kontext irgendwie mitgeteilt werden. Wir erwarten, oder wir, wie du ja gesagt hast, wir teilen ja auch den Kontext möglich mit dem Team, um irgendeine Entscheidung vielleicht zu erklären, damit die Leute, wenn sie Probleme damit haben, dass man denen vielleicht mehr Kontext gibt. Und dasselbe muss natürlich auf der Lead-Ebene genauso passieren, dass der Lead über uns zum Beispiel dann dementsprechend den Kontext weitergibt oder Entscheidungen auch erklärt.",
      "start": 1947822,
      "end": 1973795,
      "confidence": 0.8083600000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Alles richtig und da bin ich ja auch ein riesen Fan. Ich muss das, um das verteidigen zu können, um eine Entscheidung dem Team beizubringen, muss ich die Entscheidung verstehen. Wenn ich das nicht tue, dann wie soll ich dem Team dann etwas erklären? Wenn ich nach meiner Meinung gefragt werde, wie ich die Entscheidung finde, und das habe ich in meiner Karriere gelernt, am Anfang war ich sehr emotional getrieben. Und das ist immer ganz schlecht, weil dann hatten wir immer das Bauchgefühl. Über die Zeit habe ich gelernt, okay, man schläft mal eine Nacht drüber und versucht, die ganze Sache aus Sicht der Firma zu verstehen. Und was sind denn eigentlich die guten Seiten? Was sind eigentlich die positiven Seiten? Denn eine Entscheidung hat auch immer positive Seiten. Gegebenenfalls trifft jetzt dich nicht die komplette Positivität, sondern das Sales Team oder so. Aber irgendwas muss ja positiv an dieser Entscheidung sein, sonst wird diese Entscheidung nicht getroffen. Das Tolle ist aber an unserem Job, weil wir ja sehr privilegiert sind, du kriegst die Entscheidung und bist dein eigener Herr. Wenn jetzt eine Firma nach Corona sagt, Wir holen jetzt alle Mitarbeiter drei Tage zurück ins Office und ihr müsst drei Tage in der Woche im Büro sein. Dann kannst du das gut oder schlecht finden. Aber im Endeffekt, was du daraus machst, obliegt ganz allein dir. Und jetzt kommt's. Ich habe sehr viele Leute in meiner Karriere getroffen, die sind auf die Barrikaden bei sowas gegangen. Die fanden das scheiße, haben über Wochen Stunk gemacht, nicht nur im eigenen Team, sondern auch in größeren Runden beim Mittagessen und ähnliches, sind dann aber ganz einfach geblieben und haben es dann irgendwie mit sich arrangiert. Aber vorher wochenlang Stunk gemacht, ah ich hau ab, das ist ja hier alles doof und wie kann das jetzt sein mit drei Tage Pflicht im Büro, aber hintendran dann wirklich die Aktion zu tätigen, sich einen neuen Job zu suchen, zu.",
      "start": 1973815,
      "end": 2064743,
      "confidence": 0.7911529051987775,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kündigen, Wobei das ja nicht die einzige Maßnahme sein kann. Also das Kündigen sollte ja nicht die erste Maßnahme sein. Die erste Maßnahme sollte sein, etwas zu verbessern wollen und vielleicht auch mit den Leuten sprechen. Und man kann ja auch was in der Firma verändern. Man kann ja nicht immer sofort weglaufen. Also ich finde das schon okay, wenn man auch in gewisser Weise natürlich gegen etwas ankämpft. Es ist halt immer die Frage, wie viel Zeit investiert man? Hat man Aussicht? auf eine Änderung vielleicht und ich kann mich da auch an gewisse lange Diskussionen erinnern, wo es um die Anzahl der verschiedenen Milchsorten gegangen ist im Büro. Das sind natürlich dann andere Diskussionen und da investiert man trotzdem viel Zeit, aber macht vielleicht weniger Sinn, als wenn es darum geht, irgendeine schwerwiegende Entscheidung vielleicht zu revidieren oder zu verbessern.",
      "start": 2064803,
      "end": 2109237,
      "confidence": 0.8002464788732394,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da bin ich ja auch ganz bei dir, und das habe ich ja auch vorhin gesagt, dass mein Job ist es ja, nicht stinkig zu sein, sondern erstmal zu evaluieren, okay, was kann ich an dieser Entscheidung noch drehen, beziehungsweise welchen Rahmen habe ich, um diese Entscheidung möglichst verträglich zu machen? Oder, oder, oder. Also in welchem Spielraum befinde ich mich denn? Welchen Freiraum habe ich denn? Doch die Drohung der Kündigung, die ist immer schnell ausgesprochen, aber selten wahrgemacht worden. jetzt nicht von mir oder ähnliches, vielleicht bin ich da auch mal reingerannt, ich habe ja gerade gesagt, dass ich mich ab und zu emotional treiben lasse und wir hatten glaube ich in der Interviewfolge mit den Juniors glaube ich auch schon was mit Bauchgefühl und so weiter, das gehört alles vielleicht auch zu meinen Fehlern, ich weiß es nicht.",
      "start": 2109605,
      "end": 2148604,
      "confidence": 0.8172482269503546,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber bist du jetzt distanzierter geworden über die Jahre als Manager von deinem Team, wenn du sagst du bist emotionaler gewesen? Oder war das nur entscheidungstechnisch? Hast du gelernt, gewisse Sachen hinter der Mauer zu halten und nicht mit dem Team zu sharen oder gewisse Sachen nicht zu sagen, die du sonst vielleicht gesagt hättest?",
      "start": 2148644,
      "end": 2166798,
      "confidence": 0.807490909090909,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich würde es nicht distanzierter nennen, ich würde die ganze Sache... Oder reflektierter vielleicht? professionalisierter. Ich würde sagen, bei manchen Themen habe ich einfach gelernt, wie man diese kommuniziert und wie ich mich selbst einfach nicht in die Scheiße reite. Ich kann nicht Performance-Gespräche, Feedback geben. Das ist kontinuierliche Arbeit. Ich mache mir konstant Notizen über all meine Teammitglieder. Salary-Runden, Gehaltsgespräche. Wenn ich einfach nur sage, ja, du kriegst eine 5-Prozent-Erhöhung ohne ein Warum, ohne wie es hätte mehr sein können oder was nächstes Jahr getan werden muss, damit es mehr ist oder weniger oder ähnliches, dann habe ich einfach meine Aufgabe nicht gemacht.",
      "start": 2166838,
      "end": 2201087,
      "confidence": 0.8227403846153846,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, weil das ist ja Teil der Jobdescription, würde ich mal sagen, und das vielleicht professionalisieren, wie man dann kommuniziert. Aber das ist ja jetzt nicht, dass du dann weniger Emotionen gezeigt hast.",
      "start": 2201867,
      "end": 2212291,
      "confidence": 0.7811818181818183,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Emotionen versuche ich mehr und mehr rauszulassen, weil die einfach nicht da reingehören. Also das bedeutet, wir beide, wenn wir uns auf ein Bierchen treffen, dann werde ich mit hoher Wahrscheinlichkeit, weil wir privat sprechen, sehr wahrscheinlich anders sprechen.",
      "start": 2212351,
      "end": 2225137,
      "confidence": 0.8271282051282051,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie ist schon ein gutes Stichwort, wie war das? Sorry übrigens für alle, dass wir ständig Trivago als Beispiel nehmen, aber da haben wir halt zusammengearbeitet und Trivago hat sich immer auf die Fahnen geschrieben, auch sehr modern, offen zu sein und man hatte auch das Problem bei Trivago durch das sehr internationale Team, dass da teilweise Privat und Business sehr verschwommen ist, weil es einfach auch extrem nette Leute waren und viele Partys am Abend und solche Dinge. Jetzt, wenn du da bei einem Bier am Abend gesessen bist, hast du da früher irgendwie mehr geshared und hast du da über die Zeit gelernt, du musst aufpassen, wenn du da ein Bier am Abend trinkst mit deinem Team? Also mir persönlich ist es definitiv so gegangen, aber hast du auch irgendwie diese Erfahrung gemacht oder gelernt über die Zeit von deinem Beginn als Manager?",
      "start": 2225846,
      "end": 2267733,
      "confidence": 0.7809999999999998,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, auf jeden Fall. Also man muss ja auch ganz offen und ehrlich sprechen. Also ich habe 2013 da angefangen. Ich wurde nach acht Monaten Manager, Teamleiter mit meinem ersten Hire. Da war ich dann also gerade 25, 26. Habe ich da vielleicht mal ein bisschen mehr geteilt als ich sollte, auf jeden Fall. Ich meine, das reicht ja schon, wenn man in irgendeiner öffentlichen Küche sitzt. öffentliche Küche im Büro und man spricht ein bisschen lauter und man weiß nicht, wer links und rechts sitzt hinter einer Wand, also das reicht ja schon. Das ist auch immer die Gefahr, wenn eine Firma Bier anbietet oder man abends noch zusammensitzt, dass man diese Shitchats, dass man halt sehr kollegial und freundschaftlich wird und dann spricht man halt offen über Themen, die man halt nicht gut findet oder ähnliches. Aber inzwischen betrachte ich solche Gespräche als schwierig, denn meine erste Frage ist dann eigentlich, was hast du denn getan, um die Situation zu verbessern? weil eigentlich ist es genau das, wovon wir in diesem Podcast immer reden, wenn man Senior-Engineer werden möchte, Staff-Engineer oder oder oder. Die Aufgabe ist nicht, das Negative zu suchen, das kann dir gegen den Strich gehen. Aber die nächste Frage sollte dann sein, okay, wie sieht dein Handlungsspielraum aus, um die Thematik besser zu machen?",
      "start": 2267873,
      "end": 2334614,
      "confidence": 0.7875707762557074,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie es immer so schön heißt, wenn du nicht Teil der Lösung bist, bist du Teil des Problems.",
      "start": 2334895,
      "end": 2339057,
      "confidence": 0.7098333333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und ich sage das jetzt so salopp, aber weil wir ja auch über Fehlerkultur gesprochen haben. Das sind alles Bereiche, die man meines Erachtens nach lernen muss. Also habe ich als Engineering Manager mir nach und nach ein Schutzschild aufgebaut? Ja, habe ich. Fahre ich retrospektiv besser damit, bei manchen Themen einfach distanziert zu sein? Ja, auf jeden Fall. Habe ich auch schon positiveres Feedback bekommen, dass manche Bereiche professionalisiert wurden aufgrund dieses Schutzschildes? Ja. Packe ich trotzdem noch meine Dad-Jokes im Stand-Up aus? Ja. Also ich verliere ja deswegen nicht an Persönlichkeit.",
      "start": 2339608,
      "end": 2370690,
      "confidence": 0.833784946236559,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wobei, das war für mich zum Beispiel am schwierigsten. Ich bin ja ein sehr humorvoller Mensch, würde ich mal sagen, und schwarzer Humor liegt mir auch sehr gut im ganz Allgemeinen. Und das war zum Beispiel extrem schwierig, wenn du bei einem Bier zum Beispiel am Abend mit deinem Team zusammensitzt, mit mehreren Leuten. Und die joken dann irgendwie so herum und irgendwer sagt dann, hey Wolfgang, den Andi sollten wir jetzt aber langsam kündigen. Das ist ja wirklich ein Stress mit dem und der macht nur Probleme. Und du fängst an in den Witz einzusteigen und fängst an mitzuwitzeln an diesem Abend. Und womöglich ein Monat später musst du den dann wirklich kündigen. Und das war für mich so ein Eye-Opener und das ist relativ schnell gegangen und Das Problem, was du dann hast, und da fühlt man sich ja fast ein bisschen, ich will es jetzt nicht einsam nennen, aber du sitzt da bei einem Bier mit Leuten und musst am Abend sogar jede Minute aufpassen, was du sagst. Darfst du das sagen? Ist das jetzt jemand aus deinem Team? Ist das irgendwie ein Problem, wenn du was verrätst über irgendwelche Insights? Wenn du auf Peer-Ebene bist, ist das wesentlich einfacher. Da kannst du ranten, da kannst du offen diskutieren, aber das ist halt in einer großen Gruppe selten der Fall. Und da musst du wirklich Obwohl es Abend ist, obwohl du stundenlang da einfach bei einem Bier sitzen und Spaß haben willst, musst du mitdenken, dass du Lead bist. Und das war für mich zumindest damals eine extrem große Umstellung.",
      "start": 2370730,
      "end": 2449901,
      "confidence": 0.7861026615969582,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Fällt dir einfach eins bewusst, auch wenn die ganze Firma Familie ist und abends ist noch ein Bier und es wird gegrillt, es ist immer noch Arbeit. Da sitzt dein Chef, da sitzen die Leute, die zu dir reporten. Da sitzt vielleicht jemand aus einer Nachbarabteilung, der seine persönliche Agenda verfolgt und für den du ein Dorn im Auge bist. Ich mag Politik in der Firma nicht, doch umso größer die Firma, desto mehr Politik ist da in der Regel der Fall. Werde dir immer bewusst, du bist da immer noch auf der Arbeit. Was du natürlich machen solltest ist, baue dir deine Peergroup auf, in der Regel Leute auf deinem Level, gegebenenfalls aus anderen Teams, die ähnliche Probleme haben. Denn das tolle dabei ist, ihr könnt offen über sowas sprechen, habt aber oft kein direkten draht zu den jeweiligen leuten weil das dann pierce aus anderen teams sind und so löst du deine probleme so holst du dir positives feedback weil du kannst halt nicht als engineering manager zu deinen teammitgliedern sagst hey, ich hab da dieses problem mit einem anderen mitarbeiter das funktioniert halt nicht weil dein team ist in der regel fünf leute vier leute acht leute, Da weiß eigentlich in der Regel jeder, was da los ist.",
      "start": 2449921,
      "end": 2513416,
      "confidence": 0.7833270142180091,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn wir nochmal zurückkommen auf diese Meinung von dieser Person, die auch bei dir mal im Team war, mit dieser Wand aufbauen und dass die Leads nie was teilen oder nie so was rausrücken und da immer die Wand im Wege steht. Wie bist du denn mit solchen Sachen umgegangen oder gehst um, wenn es dir aus irgendeinem Grund schlecht geht? Weil üblicherweise Leads geht es dir nie schlecht, die haben nie ein Problem. Wenn du jetzt zum Beispiel aus irgendeinem extrem beschissenen Meeting rauskommst mit dem CEO, extrem krantig bist und dann gehst du in 101. Wie viel teilst du von deiner schlechten Laune oder wie oder teilst du überhaupt was diesbezüglich?",
      "start": 2513456,
      "end": 2549828,
      "confidence": 0.801070796460177,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, ich würde lügen, wenn ich sage, ich hätte noch nie was geteilt dann.",
      "start": 2549848,
      "end": 2552770,
      "confidence": 0.8222666666666668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber in welcher Form teilst du das dann? Erzählst du wirklich was, also wenn es natürlich geht, ist immer die Frage, aber teilst du dann was Konkretes oder sagst du einfach, ich hatte ein beschissenes Meeting?",
      "start": 2553322,
      "end": 2562765,
      "confidence": 0.6600277777777779,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich teile, ich hatte ein Meeting, was nicht so verlief, wie ich es mir vorgestellt habe und ich bin gerade schlecht gelaunt. Aber in der Regel teile ich keine interne aus dem Meeting, weil sonst wären nämlich mehr Leute eingeladen worden. Was ich aber tue ist, wenn es ein Meeting zu einem Projekt war oder ähnliches und diese Person, mit der ich das 101 habe, ist an diesem Projekt wirklich beteiligt. Dann teile ich Bruchstücke, was gerade im Gespräch ist. Also wirklich ein bisschen High-Level. Nicht die Details, sondern, hey, pass mal auf, wir sprechen gerade über den möglichen Pivot von dem Projekt, weil wir sehen, die ersten Testergebnisse sind nicht so gut. Wir haben noch keine Details, aber es finden so ein paar Gespräche statt. Ich halte dich auf dem Laufenden. Weil wenn es um sowas geht, da teile ich dann schon mal High-Level so nach dem Motto, okay, weil auf der einen Seite ist das natürlich auch was Positives. Das Management kümmert sich um das Projekt, woran ich arbeite, und das sagt natürlich auch, ich arbeite an einem wichtigen Projekt. Natürlich achte ich immer ein bisschen darauf, wie erfahren ist die Person, kann die mit solchen Informationen umgehen, oder ist sie wirklich, ich sag mal, attached to dem Projekt, also hat die einen mental breakdown, wenn das Projekt jetzt eingestellt wird, oder sagt die Person, okay, Code ist Code. Das lasse ich schon mit einfließen, ob ich der Person sowas sagen kann. Also ich würde niemals einem Junior- oder Mid-Level-Engineer so sagen, hey, dein Projekt ist in der Schwebe. Weil in der Regel sind sie sehr, sehr stolz auf das, was sie da tun. Doch ab Senior- oder Staff-Level können die Leute damit sehr, sehr umgehen, weil die sagen, okay, das sind strategische Entscheidungen, die sind außerhalb meines Rahmens.",
      "start": 2562805,
      "end": 2650000,
      "confidence": 0.7971993355481728,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, es geht jetzt gar nicht so um, wenn es die Leute betrifft, sondern rein unabhängig, was gewesen ist, dass du einfach eine schlechte Laune hast in dem 101, weil für mich ist das immer so ein zweischneidiges Schwert. Einerseits solltest du irgendwie sagen, was Sache ist, dass du sagst, okay, ich bin gerade extrem schlecht gelaunt, hatte ein extrem schlechtes Meeting, aber es ist dein 101 und es ist deine Zeit und darum will ich mich jetzt trotzdem darauf fokussieren, ist zwar ganz nett, aber wenn die andere Person dann weiß, dass ich gerade schlechte Laune habe, dann will sie vielleicht das Thema nicht mehr ansprechen. Also warum muss die Person das ausbaden, was gerade irgendwer anderer und irgendein anderer Chef womöglich oder Chefin gerade verursacht hat in einem anderen Meeting, Das tut mir auch immer irgendwie leid, dann sage ich vielleicht gar nichts, dann bin ich aber nicht so fokussiert und habe das andere Meeting noch im Kopf. Also es ist immer sehr schwierig. Teilweise würde es vielleicht sogar Sinn machen, das 101 dann zu verschieben, wenn man sagt, ich brauche eine halbe Stunde Pause. Aber es ist super, super schwierig, also die Entscheidung meiner Meinung nach.",
      "start": 2650752,
      "end": 2707542,
      "confidence": 0.752859296482412,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nicht nur teilweise. Das ist meine Strategie, die ich jetzt gerade mache. Ich schreibe dann in der Regel, auch wenn es ab und zu fünf Minuten vorher ist, was total doof ist, verstehe ich. Ich sage dann, hey, pass mal auf, mir geht es nicht so gut. Ich hatte einen sehr stressigen Tag. Können wir da ein One-on-One auf morgen verschieben? Aber da mache ich einen expliziten Zeitvorschlag und dann kann ich das auch begründen, weil ich möchte voll da sein, weil es geht ja um dich. Ein One-on-One ist ja nicht mein Meeting, kein Status-Report-Meeting, sondern es ist ein Meeting für den Mitarbeiter, um schwierige Themen anzusprechen, für die Weiterentwicklung. Und da möchte ich auch voll da sein. Und wenn ich sowas sage, hey, können wir das verschieben? Mir geht's grad nicht gut. Ich hatte seltenst jemand, der das nicht verstanden hat.",
      "start": 2708035,
      "end": 2746071,
      "confidence": 0.7581258741258742,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist vielleicht ganz gut, das dazuzusagen, warum du es verschiebst, ja. Das macht vielleicht eigentlich ganz viel Sinn. Finde ich eine gute Idee. Es gibt ja auch das umgekehrte 101-Problem. Das hatte ich auch mal. Ich hatte einen Lead, der hatte immer unser 101 genutzt, um seine Frustration über alles mitzuteilen. Und das war dann fast eine Coaching-Session für ihn. Also ich war unter ihm und habe dann fast unterstützend immer mitwirken müssen und coachen und so weiter. oder einfach nur zuhören, hilft ja auch oft, aber es war eigentlich nicht das 101, was ich unter Umständen gerne gehabt hätte. Also das ist teilweise schon auch ein Problem. Wobei, vielleicht hat's geholfen, vielleicht macht das ja auch hin und wieder Sinn, aber da erwartet man sich vielleicht eigentlich wieder eben, dass der Lied funktionieren sollte. Und in dem Fall hat er eh seinen Frust rausgelassen. Das kann ja auch mal ganz sinnvoll sein.",
      "start": 2746845,
      "end": 2799993,
      "confidence": 0.8014480519480519,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Macht euch immer nur, Lieds sind halt auch nur Menschen. Die haben ebenfalls Stimmungsschwankungen, schlechte Tage, schlechte Nachrichten.",
      "start": 2800013,
      "end": 2807377,
      "confidence": 0.7757777777777778,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sie teilen's nur nicht.",
      "start": 2807417,
      "end": 2808298,
      "confidence": 0.80325,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie gesagt, das ist halt dieses Schild, was man aufhat. Wenn du sagst, okay, diese Person will das anders machen, dann find ich das sehr löblich. Und vielleicht war ich auch mal so ambitioniert.",
      "start": 2810159,
      "end": 2818726,
      "confidence": 0.830235294117647,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich weiß auch nicht, ob's funktioniert. Es ist eine gute Frage, muss man abwarten. Aber es gibt unterschiedliche Stile, ist ja auch gut so.",
      "start": 2818907,
      "end": 2826173,
      "confidence": 0.734375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich versuche sehr, sehr viel zu teilen. Ich bin ein sehr transparenter Mensch. Dennoch habe ich die These, dass wenn man zwei, drei, vier Jahre einen Engineering Manager Job gemacht hat, verschiedenen Zyklen durchlebt hat, Leute kündigen musste oder, oder, oder, schwierige Performance Gespräche führen musste oder, oder, oder, dass man über Zeit lernt, sowas aufzubauen und dann die Vorteile von sowas auch erkennt. Deswegen alles teilen ist halt einfach nicht gesund, weil ich denke, viele Entscheidungen sind nicht final und sie schüren dann mehr Verunsicherung im Team, wenn ich wirklich alles teile. Und das führt im Endeffekt zu mehr Schaden als zu was Gutem.",
      "start": 2826585,
      "end": 2864378,
      "confidence": 0.8243809523809522,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wo wir bei dieser Shit-Umbrella-Aufgabe sind, die Elites definitiv zu erfüllen, damit eben das Team auch mal gut arbeiten kann und nicht wegen jedem kleinen Scheiß, der vielleicht gar nicht so relevant ist, aber wieder viel Unruhe reinbringen würde, dass man da alles teilt.",
      "start": 2864643,
      "end": 2878715,
      "confidence": 0.8049090909090911,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man muss ja auch mal ganz ehrlich sagen, ich verstehe, dass die Individual Contributor oder die Teammitglieder neugierig sind, sehr viel wissen wollen, das verstehe ich alles.",
      "start": 2878836,
      "end": 2887263,
      "confidence": 0.8364444444444445,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Will man ja selber auch im Normalfall.",
      "start": 2887303,
      "end": 2888984,
      "confidence": 0.8175714285714287,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meines Erachtens nach ist es aber positiv, wenn man gar nicht so viel weiß, denn da macht man sich immer noch mehr Gedanken. Du kennst ja dieses, diese, also wenn du halbgare Informationen hast, dann malst du dir aus, was könnte jetzt passieren? Oh, wird mein Projekt eingestellt? Habe ich morgen noch einen Job? Und irgendwo landest du dann, ja nächste Woche liege ich auf der Straße. Ja, diese, diese Gedankengänge. Und im Endeffekt ist dann die finale Entscheidung, dass nun das Logo von rot nach grün geändert wird. Also teilweise wird im Management-Meeting ja so weit ausgeholt und dann kommt da hinten dran ein kleiner Ameise raus. Man redet über einen Elefanten. Deswegen ist dieser Shit-Umbrella schon ganz gut und es ist auch wie bei jeder Diskussion einfach anstrengend, manche Diskussionen einfach zu führen, bis man mal zu einer finalen Entscheidung kommt, die man dann im Endeffekt kommunizieren kann.",
      "start": 2889827,
      "end": 2933063,
      "confidence": 0.7787066666666668,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und es gibt ja auch zum Beispiel den Vorwurf, der ganz oft kommt bei Restrukturierungen, dass man sagt, okay, es war schlecht kommuniziert, diese Restrukturierung war schlecht durchgeführt. Wenn man jetzt die Information schon früher bekommen würde, dann kann man die erst recht nicht mehr sinnvoll durchführen. Also gewisse Sachen musst du geheim halten, damit du sie sinnvoll planen kannst, damit du sie dann orchestriert ausrollen kannst mit der richtigen Kommunikation, die richtigen Leute in der richtigen Reihenfolge informiert werden und so weiter. weil sonst sagen die Leute zu Recht, das war einfach schlecht gemacht und es war nicht vorbereitet. Aber um vorbereiten zu können, musst du etwas geheim halten. Also das ist für mich so das klassische Beispiel, wo es nicht anders geht. Und so gibt es natürlich im Kleinen auch viele ähnliche Beispiele, auch wenn es natürlich immer so ein bisschen arrogant wirkt. Was weiß ich, was die anderen vertragen können, so in der Richtung diese Information. Aber ich bin auch der Meinung, gewisse Sachen machen dir einfach das Leben schwerer und im Gesamten ist es dann besser wahrscheinlich, wenn gewisse Informationen nicht automatisch überall geteilt werden.",
      "start": 2933240,
      "end": 2995336,
      "confidence": 0.8367089947089952,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du hast was Lustiges angesprochen, und zwar Restrukturierungen. Da fallen mir zwei Punkte zu ein.",
      "start": 2995716,
      "end": 3000022,
      "confidence": 0.6929333333333331,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also super, dass du Restrukturierungen lustig findest.",
      "start": 3000062,
      "end": 3002665,
      "confidence": 0.7555714285714286,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja.",
      "start": 3002685,
      "end": 3002925,
      "confidence": 0.726,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das war einmal das Schlimmste für mich, egal auf welcher Seite.",
      "start": 3002945,
      "end": 3005208,
      "confidence": 0.49499999999999994,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, es ist scheiße, verstehe ich und es betrifft halt immer jeden und niemand versteht, warum diese Umstrukturierung so gemacht wurde, wie sie gemacht wurde, denn ich habe noch nie eine Umstrukturierung gesehen, die wirklich gut kommuniziert wurde und ich habe schon 15 mitgemacht oder so, irgendwie sowas.",
      "start": 3005973,
      "end": 3021581,
      "confidence": 0.8323333333333333,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber ihr habt bessere gesehen und schlechtere, das muss man schon sagen. Perfekt ist wahrscheinlich nie eine Umstrukturierung, aber es gibt bessere.",
      "start": 3021621,
      "end": 3027424,
      "confidence": 0.7446363636363635,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, aber mir fallen zwei Dinge ein. Das erste ist, wenn man Individual Contributor ist, Software Engineer, dann hat man so viele Fragen. Ja, was passiert jetzt mit dieser Applikation? Wer ownt jetzt das und wer kümmert sich um die Cronjobs da hinten? Und niemand versteht, warum sich über solch essenzielle Dinge, weil die Cronjobs halten natürlich die Firma zusammen, warum sich darüber keiner Gedanken gemacht hat. Und dann komme ich immer mit dem selben Argument, die da ganz oben wissen von den Cronjobs überhaupt nichts. Und die wissen auch nicht, welches Team welche Applikationen und die schieben Boxen. Die haben 50 Leute da und 20 da und dann verschieden.",
      "start": 3027944,
      "end": 3060261,
      "confidence": 0.8226454545454545,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt redest du ja doch wieder schlecht über das Management.",
      "start": 3060281,
      "end": 3063502,
      "confidence": 0.606,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, also die haben halt ein anderes, wie sagt man so schön, die haben eine andere Flughöhe. Die, die sehen die Level an Details ja gar nicht so. Das ist die eine Baustelle. Das bedeutet, da muss man sich als Individual Contributor und auch als Engineering Manager mal ein bisschen von lösen, dass die Leute auf einer anderen Flughöhe agieren und das Level der Details gar nicht da ist. Die zweite Geschichte ist ebenfalls sehr sehr spannend meines Erachtens nach und die erklärt, warum manche Leute so kommunizieren, wie sie kommunizieren. Und zwar ist das die Change-Kurve. Immer wenn eine Restrukturierung kommt, dann kommt erstmal der Schock, danach kommt die Verneinung, danach die Einsicht. Irgendwann nach ein paar Tagen akzeptiert man die ganze Sache, dann probiert man das aus, dann kommt die Erkenntnis und dann die Integration. Also es geht erst hoch und dann runter ins Tal der Tränen, da wo dann die Einsicht und die Akzeptanz kommt. Und dann geht es wieder hoch bis zur Erkenntnis und Integration. Und jetzt ist es wie folgt. Das Top-Management sagt, wir müssen eine Umstrukturierung machen. Und just in dem Moment, wenn sie das für sich in ihrem Board-Meeting entschieden haben, sind die schon in einem Schockmoment. Und da fängt die Change-Kurve vom Management an. Dann bubbelt die Entscheidung so langsam durch die Hierarchie bis zu dir als Engineering-Manager. Und dann kriegst du die Meldung. Das C-Level-Management ist aber schon in einem Tal der Tränen, in der Akzeptanz. Du fängst aber ganz vorne in der Kurve an mit dem Schock. Und dann wird darüber diskutiert, wann kommunizieren wir es denn im Team. Zwei Tage später. Zwei Tage später ist das C-Level Management aber bereits in der Erkenntnis- und Integrationsphase, also am Ende der Kurve. Du als Engineering Manager bist gerade im Tal der Tränen, du akzeptierst den Change gerade und dann kommunizierst du es und dein Team fängt ganz vorne an der Kurve an mit dem Schock. Und dann kommt natürlich das klassische all hands und dann die ganzen individuell contributor also die belegschaft stellt dann ganz viele fragen und dann kommen so salopp antworten vom cd level management weil die haben natürlich in der kurve die sind schon links raus aus der kurve die haben den schock und die einsicht und dann die alles durch weil die wissen dass er schon zwei wochen.",
      "start": 3063542,
      "end": 3184117,
      "confidence": 0.8152199488491046,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist ja schön, dass du von zwei Tagen und zwei Wochen redest. Ich habe mal gehört, dass bei BMW oder so, so Änderungen teilweise ein Jahr benötigen. Und wenn in Deutschland diese Entscheidung getroffen wurde im Upper Management, dann trifft es irgendwo in Südamerika ein Jahr später ein. Also da spricht man von ganz anderen Wellen. Aber man muss dazu sagen, ein gutes Management kennt diese Welle und die verschobenen Wellen und wo sich Leute ungefähr zumindestens befinden. Es ist ja jeder anders. Manche akzeptieren das sofort, manche brauchen Wochen. Es kommt immer darauf an, wo man da umgeht. Auf jeden Fall, wenn man sich dessen bewusst ist und das halt vielleicht auch mit einplant und dann beim All Hands eben keine saloppe Antwort gibt als professioneller CEO zum Beispiel. Und das erwarte mir eigentlich von einem CEO oder von einer CEO, dass sie genau darüber Bescheid weiß und eben einen guten Job macht als CEO. Da akzeptiere ich dann auch keine saloppen Antworten und sage dann eben auch vielleicht dann im Team, das war eine saloppe Antwort und ich habe die Antwort auch schlecht empfunden, ganz klar.",
      "start": 3184417,
      "end": 3245044,
      "confidence": 0.8328201058201053,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Da muss man aber auch ehrlicherweise sagen, da kommt es immer ganz darauf an, in welcher Firma du arbeitest. Arbeitest du in einem Startup, dann hast du auch oft, sehr unerfahrenes C-Level-Management, weil das sind meist die Founder, die die Firma gegründet haben, die haben vielleicht die Plattform noch programmiert. Woher sollen diese Menschen tiefe Management-Erfahrung haben? Natürlich ist es deren Aufgabe, sich die Management-Erfahrung zu erarbeiten durch Coaching, durch Workshops etc. Aber es ist ein weltweiter Unterschied zu jemandem, der schon die zweite oder dritte CEO-Position hat in einer Firma mit vierstelligen Mitarbeitern. Der wird mit hoher Wahrscheinlichkeit oder die Person wird mit hoher Wahrscheinlichkeit schon etliche Umstrukturierung gemacht haben und dann mit hoher Wahrscheinlichkeit diese Change-Kurve im Sinn haben, wohingegen Founder, die jetzt gerade Series A oder Series B Venture Capital gekriegt haben, die lernen gerade erst mal ihren job zu kennen so nach dem motto ich code jetzt nicht mehr sondern ich muss jetzt leute anleiten und so weiter das ist.",
      "start": 3245064,
      "end": 3300524,
      "confidence": 0.8236219512195119,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja aber das darf meiner meinung nach keine entschuldigung sein weil die erwarten ja von mir als engineering manager auch dass sie jetzt vielleicht gewisse entscheidungen eben mittrage und professionell mittrage dann erwarte mal dementsprechend auch professionelles verhalten von ihnen ist schon klar wenn das jetzt, absolut Neulinge sind und die Firma gerade mal, keine Ahnung, 15 Leute hat, dass das schon einen Unterschied macht. Das stimmt, aber ich habe halt auch oft eigentlich schon gehört oder selber miterlebt, dass sie Oppositionen oder Personen, obwohl sie schon seit 20 Jahren dabei sind, obwohl sie schon die zweite, dritte Firma haben, trotzdem noch extreme Schnitzer machen. Und da denke ich mir dann halt schon, wo ist da die Professionalität? Und dann sehe ich halt dann auch irgendwo nicht ein, warum ich dann diese Sachen mittragen muss unter Umständen, wenn es da keinen Professionalismus gibt. Man bemüht sich natürlich, klar, jeder macht Fehler, aber umso häufiger dann Fehler auftreten, wird es dann auch irgendwann schwierig und dann verstehen natürlich jede oder jeden, der da irgendwie ein Problem damit. Also Professionalität auf allen Stufen, meiner Meinung nach, das gehört halt dazu.",
      "start": 3300544,
      "end": 3359337,
      "confidence": 0.816436170212766,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bei weitem keine Entschuldigung, ich sag nur, nur weil wir beide jetzt als Engineering Manager diese Changekurve kennen, heißt das nicht, dass die jeder CEO oder jeder CFO oder ähnliches kennt, weil sie hilft einem, aber es ist auch nicht immer einfach zu erkennen, wer, wann, wo, in welchem Stadium ist.",
      "start": 3359757,
      "end": 3379072,
      "confidence": 0.8624117647058824,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und da, glaube ich, macht es halt auch einen großen Unterschied, ob du jemanden zur Hilfe holst, ob du irgendwelche Coaches hast, ob du irgendwelche Kommunikationsberater hast. Und wenn du dir dessen bewusst bist, dass du da eine Schwäche hast und dir dann die richtigen Leute holst, dann kann es halt auch wesentlich besser funktionieren. Und da spreche ich jetzt gar nicht nur von CEO Level, genauso auf Engineering Manager Ebene. Und wenn es nur die Peer Group ist oder vielleicht ein professionelles Coaching, was man über irgendwelche interne Strukturen bekommen kann oder von erfahrenen Leuten, also gibt es hier viele Möglichkeiten. Und ich glaube, das darf man auch nicht vergessen, dass die Möglichkeit immer besteht.",
      "start": 3379612,
      "end": 3411004,
      "confidence": 0.7730086206896555,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe jetzt gedacht, du empfiehlst jetzt, dass wir Ernst & Young, PricewaterCoopers oder Deloitte oder Bain oder sowas als Unternehmensberater reinholen.",
      "start": 3411537,
      "end": 3419963,
      "confidence": 0.7804090909090909,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Na, wenn Andi und Wolfgang, natürlich. Also wir coachen ja auch immer wieder und sind beratend am Weg. Das macht ja viel mehr Sinn. Aber Wolfi und Andi, das klingt ja fast wie Ernst & Young. Das könnte man ja auch noch sowas einführen. Gar nicht so schlechte Idee.",
      "start": 3420043,
      "end": 3435914,
      "confidence": 0.7352244897959185,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir sind auch direkt auf dem Weg zu den Big Four.",
      "start": 3435954,
      "end": 3438756,
      "confidence": 0.8507272727272729,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, ja.",
      "start": 3438796,
      "end": 3439816,
      "confidence": 0.479,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und zwar wird die Big Four-Gruppe dann in die Big Five umbenannt. Neben der Boston Consulting Group und PricewaterCoopers haben wir dann bald auch Wolfgang und Andi. Genau. Oh, Wolfi und Andi, Entschuldigung.",
      "start": 3439836,
      "end": 3449302,
      "confidence": 0.7147878787878789,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, so ist es.",
      "start": 3449663,
      "end": 3450623,
      "confidence": 0.686,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wir sind ja dann direkt international aufgestellt, oder? Also, ich meine, kann auch nicht jeder von sich behaupten. Wir operieren aus Österreich und Wahnsinn, Hammer. Dann machen wir direkt Wien mit Wahnsinn.",
      "start": 3450663,
      "end": 3459249,
      "confidence": 0.7612500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, er weiß ja, Österreich liegt in Wien.",
      "start": 3459569,
      "end": 3461070,
      "confidence": 0.441125,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und jetzt haben wir natürlich über die Fehlerkultur gesprochen und du hast ja darauf so gepocht, dass ich meine Fehler, die ich als Engineering Manager gemacht habe, ob ich die auch groß geteilt habe und Co. Und habe ich ja eigentlich dann verneint in der Hinsicht, zumindest nicht in großen Kreisen.",
      "start": 3462858,
      "end": 3477431,
      "confidence": 0.8272549019607842,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und jetzt kommt dein großes Outing und du erzählst uns, was du als großen Fehler gemacht hast.",
      "start": 3477471,
      "end": 3482416,
      "confidence": 0.7884117647058826,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nicht direkt ich glaube ich habe das schon mal erwähnt ich bin mir nicht ganz sicher ein fehler nicht gemacht hat der so offensichtlich ist und wenn ihr den gleich alle hört dann sagt ihr boah andi ernsthaft jetzt das kann nicht wahr sein den werde ich auch nie nie nie nie nie wieder machen da war ich noch sehr jung als ingenieur manager ich glaube noch ein halbes jahr oder ein jahr ist dran. Ich habe Freitagnachmittag meinen Rucksack zusammengepackt, bin aus dem Büro, bin an einem Teammitglied von mir vorbei und mir fiel gerade nur ein, okay, ich muss noch über Projekt XY mit ihm am Montag sprechen. Ich sag so, schönes Wochenende und am Montag müssen wir mal eben kurz sprechen und bin dann raus. Montag kommt diese Person völlig gestresst ins 101, super Augenringe, kaum geschlafen, allem drum herum, was los, du siehst ein bisschen blass aus, weil ich hatte den Spruch gar nicht mehr im Kopf am Montag. Für mich war das nur so ein Reminder, der jetzt gerade im Kopf hochgepoppt ist. Ja, ich habe das ganze Wochenende kaum geschlafen. Oh, warum, was ist los? Dieses Gespräch, du hast gesagt, wir müssen mal reden. Ende vom Lied. Ich habe der Person halt wirklich, wirklich Angst gemacht, dass es um etwas Kritisches geht, um den Job oder ähnliches, weil ich das so beim Rausgehen gesagt habe, Montag müssen wir mal reden, ohne zusätzlichen Kontext und so. war etwas, wo ich hätte selbst drüber nachdenken können und gesagt, boah nee, das kannst du jetzt echt nicht machen, weil ich bin ganz ehrlich, hätte mein Chef das zu mir gesagt und ich wäre noch nicht so erfahren gewesen, hätte ich glaube ich genauso reagiert. Schwieriger Fall, ist mir auch super peinlich, aber ich glaube, Learnings macht man oder halt auch nicht.",
      "start": 3482896,
      "end": 3569706,
      "confidence": 0.7408782894736845,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich glaube, es zeigt ein bisschen, wie schwierig so Kommunikation sein kann und wie leicht man in so Fettnäpfchen tritt, wenn man einfach mal was dahin sagt. Und da macht man sich mit der Zeit schon immer mehr Gedanken, was man wirklich kommuniziert. Und vielleicht baut man darum eben auch diese Mauer auf. Ja, wenn ich so nachdenke, was mein Größter Fehler war, ich glaube, ich habe jetzt nicht so einen konkreten Fall wie du, was aber auf jeden Fall ein Learning war von mir, war, dass ich schneller und früher mit anderen Leuten über irgendwas spreche, sei es jetzt mit Peers eben oder mit dem eigenen Lead und weniger lang selber überlege oder mir denke, ich kann das schon selber machen, das schaffe ich schon irgendwie selber. sondern einfach, wenn man dann eine Idee hat oder so in der Richtung, auch einfach mal mit anderen zu diskutieren, mit Peers oder dem eigenen Lead, dass man da einfach möglichst schnell weiterkommt und weniger Zeit verplempert, wie man bei uns sagt, mit irgendwas, weil man eh glaubt, man schafft es schon selber. Also man muss es dann tragen, das ist eh keine Frage, aber man kommt einfach schneller ans Ziel, wenn man iteriert und das mit anderen Leuten bespricht. Und ich glaube, als Lied ist es noch schwieriger, weil man sich halt auch irgendwie so in dieser Liedrolle fühlt und man denkt, Man darf jetzt keine Fragen haben. Man muss ja die Lösung sofort wissen. Ich bin ja der Lead. Ich muss wissen, was zu tun ist. Der Lead ist allwissend und der weiß immer Bescheid. Und ich glaube, das ist eigentlich ein Fehler und den habe ich halt mit der Zeit auch gelernt, dass man da einfach anders die Rolle einschätzt oder definiert und das halt eher auch Teamarbeit am Ende ist mit vielen Leuten, die auf einen einwirken.",
      "start": 3569946,
      "end": 3662600,
      "confidence": 0.8290841423948221,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du bist halt nicht der klügste im Raum, triffst später trotzdem die Entscheidung und wenn sie dann nicht jedem gefällt, dann musst du diese Konsequenzen leider auftragen. Dafür bist du der Kopf der Schlange, aber dafür rollt auch dein Kopf.",
      "start": 3663160,
      "end": 3673599,
      "confidence": 0.796025,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und darum tun mir oft die CEO-Leute so leid, weil die halt selten irgendwen dann über sich haben. Und für die wird es dann noch halt viel, viel schwieriger, irgendwie Peers zu finden. Auf der gleichen Ebene hast du auch nicht mehr so viel. Also du musst dir dann halt außerhalb der Firma vielleicht irgendwen suchen. Aber das ist auch als Lead ganz gut, vielleicht jemanden außerhalb der Firma zu haben. Einen Coach, einen Mentor, eine Mentorin. Ist alles immer sehr hilfreich und habe eigentlich immer geschätzt, mit anderen Leuten zu sprechen.",
      "start": 3674106,
      "end": 3699650,
      "confidence": 0.7653804347826089,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man sagt ja auch, umso höher man in der Hierarchie ist, desto einsamer wird's.",
      "start": 3700103,
      "end": 3703790,
      "confidence": 0.831857142857143,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Kann ich nachvollziehen.",
      "start": 3703810,
      "end": 3705032,
      "confidence": 0.8203333333333332,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Schwieriges Thema für ein Sommergespräch. Ich bin so ein bisschen down gerade.",
      "start": 3705052,
      "end": 3709880,
      "confidence": 0.6345000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ernsteres Gespräch. Ich hab mir gedacht, am Abend, da bin ich fit, da kann man dann auch über sowas sprechen.",
      "start": 3709940,
      "end": 3713967,
      "confidence": 0.66475,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du denn jetzt noch einen Witz, um mich irgendwie hochzuhören? Weil irgendwie habe ich so Fehler, ja Fehlerkultur, aber man ist halt auch nicht so toll, wenn man immer nur über seine Fehler spricht. Also wir müssen die Episode jetzt positiv enden.",
      "start": 3714259,
      "end": 3724183,
      "confidence": 0.7095581395348834,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, wir sprechen ja nicht über unsere Fehler, wir sprechen über die Learnings. Weißt du übrigens, dass Learnings kein englisches Wort ist?",
      "start": 3724223,
      "end": 3730345,
      "confidence": 0.7449090909090909,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Handy ja auch nicht.",
      "start": 3730365,
      "end": 3731225,
      "confidence": 0.79,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, das ist wirklich ein deutsches Wort. Handy, aber er hat mir mal ein Native Speaker erklärt, dass es Learning eigentlich nicht gibt, obwohl die ganzen Native Speaker mittlerweile auch Learnings sagen, aber Learnings ist eigentlich kein offizielles Wort. Das ist so ein Business-Lingo-erfundenes Wort, das jetzt die Runde geht. Also es ist keine deutsche Erfindung in dem Sinne, aber es ist kein richtiges Wort. Wenn wir übrigens gerade von Learnings und Fehlern sprechen, bei uns in der Community finde ich es super stark, hat es auch schon einige Threads gegeben von Leuten, die wirklich sehr konkrete Probleme, auch emotionale Dinge besprochen haben, beziehungsweise geshared haben in der Community, mit anderen eben genau kommuniziert haben und sich in irgendeiner Form Unterstützung oder Ideen geholt haben. Habe ich super spannend gefunden. und extrem cool, dass die Leute wirklich so offen umgehen bei uns in der Community. Also schaut mal gerne auch in der Community vorbei, auch wenn ihr irgendein Feedback zu dieser Episode habt, wenn ihr noch irgendwas mitzuteilen habt. Und sonst würden wir uns natürlich freuen, wenn ihr auch der einen oder anderen Freundin einfach von unserem Podcast erzählt. Vielleicht gibt's ja noch Leute, die irgendwie eine leere Podcastliste haben und am Strand oder auf der Wiese oder am Berg noch zwei komischen Kauzen folgen und hören wollen.",
      "start": 3731385,
      "end": 3801750,
      "confidence": 0.808,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und damit wir diese Episode nicht ganz so negativ enden lassen, habe ich jetzt nochmal einen Witz rausgeholt. Bist du bereit, Frau Frank?",
      "start": 3802230,
      "end": 3808659,
      "confidence": 0.7445217391304347,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, wenn es sein muss.",
      "start": 3809168,
      "end": 3810768,
      "confidence": 0.5596,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sagt der Manager zum Assistenten, der das Unternehmen verlässt. Eigentlich schade, dass sie uns verlassen. Sie waren wie ein Sohn für mich. Aufsässig, undankbar und nie um eine Ausrede verlegen.",
      "start": 3810808,
      "end": 3820771,
      "confidence": 0.8890666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das war schon der Witz.",
      "start": 3821371,
      "end": 3822472,
      "confidence": 0.36519999999999997,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das war der Witz, ja. Vielen Dank, Wolfgang. Vielen Dank, liebe Hörerinnen und Hörer. Lasst uns doch mal wissen, wie ihr diese Folge fandet. War jetzt jedenfalls kein Evergreen, sondern eher eine Story, ein Schwank aus meiner Jugend sozusagen, aus meinem Leben, wenn man so möchte.",
      "start": 3822532,
      "end": 3837216,
      "confidence": 0.6426086956521739,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und über die schweren Seiten des Engineering Managers.",
      "start": 3837786,
      "end": 3841528,
      "confidence": 0.8056249999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist nicht immer nur Spaß, was glänzt, wa? Ne, so geht das Sprichwort nicht, aber...",
      "start": 3841568,
      "end": 3846870,
      "confidence": 0.7428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es versteht jeder, was gemeint ist.",
      "start": 3846910,
      "end": 3848250,
      "confidence": 0.7891666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also, Happy Pass kann jeder und immer wenn alles gut läuft, kann jeder sich feiern. Das Problem ist, dieser Job ist aber auch nicht einfach. Wir sagen Tschüss, bis zum nächsten Mal.",
      "start": 3848591,
      "end": 3857494,
      "confidence": 0.79840625,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bye bye. Ciao.",
      "start": 3857654,
      "end": 3858675,
      "confidence": 0.408,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.795096984318458,
  "audio_duration": 3864.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
