{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/a113e18c-897c-458d-b252-d305aa8de90c/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62zlocuh8v-4108-41d4-a845-26dc17f2c8df",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Und ich hatte noch diesen Glaubenssatz, ich muss der beste Entwickler sein, um überhaupt Teammanager werden zu können. Ich dachte am Anfang, das ist ja so ein bisschen Orga-Kram. Guck mit den Leuten, dass die nicht so viele Aufgaben haben, dass die Sachen rechtzeitig fertig werden. Aber wie klein dieser Anteil eigentlich ist, war mir so nicht bewusst. Das ist ja keine One-Man-Show, das ist ja im Gegenteil. Mein Job ist ja eigentlich, mein Team zu befähigen, die Aufgaben zu machen.",
            "start": 2447,
            "end": 35727,
            "confidence": 0.781641975308642,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Der Einstieg in die erste Lead-Position des Engineering Management kann ziemlich beängstigend sein. Neue Herausforderungen und Verantwortlichkeiten. Aber wie gestaltet sich das in der Realität? Auf was lässt man sich denn da ein? Und damit willkommen zu einer neuen Episode des Engineering Kiosks, in der wir uns genau diesem Positionswechsel widmen. Vom Developer zur Engineering Managerin und alles, was daran hängt. Wir beleuchten Fragen wie, kann man denn als Lead überhaupt noch hands-on sein, also programmieren, ohne das Team zu blockieren? Wie wichtig ist denn Kommunikation im Team, aber auch nach oben zu den Vorgesetzten? Welche Typen von Leadrollen gibt es eigentlich und wie beeinflusst die Firmenkultur so eine Position? Wie hält man sich als Engineering Managerin motiviert und wer ist eigentlich für so eine Position überhaupt geeignet? Und es freut mich besonders, dass wir das mit Isabel Glasmacher diskutieren können, denn sie ist nicht nur eine unserer ersten Hörerinnen aus der Community, sondern hat diese Transformation von Dev zu Engineering Managerin schon zweimal durchgemacht in komplett unterschiedlichen Firmenkulturen. Also springen wir direkt rein in die spannende Diskussion mit Isabel.",
            "start": 35747,
            "end": 99733,
            "confidence": 0.8499833333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Viele Personen, die uns schon länger mit dem Podcast begleiten, wissen ja, dass Wolfgang und ich des Öfteren über das Thema Engineering Management sprechen. Was dabei gut läuft, was dabei schlecht läuft, ob das jetzt ein Karriereschritt ist oder eine Beförderung oder oder oder. Doch ein Problem gibt es weiterhin, wenn Wolfgang und ich uns über dieses Thema unterhalten, denn wir unterhalten uns da immer nur zu zweit drüber. Und dabei bauen wir uns so eine kleine Echokammer auf und dabei sagen wir, wir sind immer die Besten. Genau so läuft das und das ist die einzige Meinung. Und das fanden wir ein bisschen doof und deswegen haben wir uns heute nämlich jemanden eingeladen, um ebenfalls über das Thema Engineering Management zu sprechen. Willkommen Isabel!",
            "start": 106540,
            "end": 147690,
            "confidence": 0.8250559999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Hi! Schön, dass ich hier sein kann.",
            "start": 147710,
            "end": 149591,
            "confidence": 0.5355714285714287,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Isabel, dich kennen wir aus der Engineering-Cures-Community. Wir haben im Februar diesen Jahres auf der FOSDEM ein Community Treffen organisiert und da haben wir uns glaube ich einen größeren Tisch in einer Pizzeria oder ähnliches gemietet und da wurdest du mitgeschleppt. Ist das richtig?",
            "start": 149651,
            "end": 167542,
            "confidence": 0.8030454545454546,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, so ist es. Ein Kollege hat damals einen Podcast empfohlen. Dann habe ich angefangen, den Podcast zu hören, habe den auch fleißig weiterempfohlen bei uns in der Firma. Da wurde der richtig groß. Und als es hieß, wir fahren zu FOSDEM, hat er gesagt, ja, die treffen sich auch, komm doch mit. Dann waren wir dabei.",
            "start": 167977,
            "end": 184918,
            "confidence": 0.7629649122807021,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hatte auf jeden Fall sehr viel Spaß an dem Abend. Ich hoffe, die Leute, die da waren und du natürlich auch. Ganz kurz zusammengefasst, wer bist du? Du hast Mathematik mit der Vertiefung Logik und Graphenoptimierung an der RWTH in Aachen studiert. Danach warst du fast sieben Jahre lang Softwareentwicklerin. Dann bist du einmal in die Teamleiterrolle geschlüpft für circa zwei Jahre. Dann hast du die Firma gewechselt und bist wieder anderthalb Jahre Softwareentwicklerin geworden. Und jetzt bist du wieder Teamleiterin. Außerdem sprichst du fließend Spanisch, hast Hobbys für lateinamerikanische Folklore-Tänze und Krafttraining und hast eine negative Wertung beim Europa-Park abgegeben. Hatte das Krafttraining was mit dem Europa-Park zu tun?",
            "start": 185438,
            "end": 228373,
            "confidence": 0.7882972972972974,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nee.",
            "start": 228793,
            "end": 229233,
            "confidence": 0.609,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hab ein bisschen Angst vor deinen Stalking-Fähigkeiten, Andi.",
            "start": 229273,
            "end": 232515,
            "confidence": 0.5568888888888889,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaub, wir alle wissen, das Internet vergisst nicht.",
            "start": 232555,
            "end": 234696,
            "confidence": 0.8371111111111111,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin ein bisschen schockiert, wo du das ausgegraben hast.",
            "start": 235236,
            "end": 237417,
            "confidence": 0.7118,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Habe ich irgendwas vergessen?",
            "start": 238689,
            "end": 239430,
            "confidence": 0.5505,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nee, du hast nichts vergessen. Du hast es gut zusammengefasst, bis auf die Bewertung vom Europa-Park, woran ich mich nicht mehr erinnern kann, aber gut.",
            "start": 239970,
            "end": 247875,
            "confidence": 0.6602800000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, super. Vielen Dank, dass du dir die Zeit genommen hast für diesen Podcast. Ich freue mich auf jeden Fall.",
            "start": 247895,
            "end": 251697,
            "confidence": 0.5784999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Vielleicht noch, um den Hintergrund zu erklären, warum wir auf dich gekommen sind. Wir haben uns überlegt, okay, eigentlich war es mal interessant, auch mit jemandem zu sprechen, der noch nicht so lang in der ganzen Teamlead-Rolle ist. Weil wir könnten jetzt natürlich irgendwen einladen, der, keine Ahnung, 15 Jahre, 20 Jahre Teamlead-Erfahrung hat. Aber wir haben uns gedacht, wir machen das mal anders und wollen ja auch mit unserer Community gut zusammenarbeiten. Und dann haben wir überlegt, okay, wen könnten wir einladen? Wer könnte uns da vielleicht auch eine neue Sicht auf die Dinge geben? Wir sind ja auch die klassischen alten zwei weißen Männer, die da immer über Engineering Management sprechen. Und dann bist du uns natürlich gleich in den Sinn gekommen. Also für alle anderen, die bei uns in der Community sind und aktiv sind, die Möglichkeiten, in eine Episode zu kommen, steigen dadurch natürlich extrem an.",
            "start": 251717,
            "end": 296164,
            "confidence": 0.8286666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bevor wir anfangen, wie ist dein Adrenalinspiegel oder bist du nervös oder ähnliches?",
            "start": 296204,
            "end": 300267,
            "confidence": 0.6662307692307692,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin ganz ruhig eigentlich, wie immer.",
            "start": 300947,
            "end": 303709,
            "confidence": 0.6772857142857144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Danke Wolfgang.",
            "start": 303729,
            "end": 305190,
            "confidence": 0.41000000000000003,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin mega nervös, aber das wird schon.",
            "start": 305250,
            "end": 306911,
            "confidence": 0.36612500000000003,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn ich das jetzt alles so zusammenrechne, hast du schon einen Track Record von circa zwölf Jahren in der Tech- und Softwareentwicklungsindustrie. Ist das richtig?",
            "start": 307132,
            "end": 315235,
            "confidence": 0.7636400000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, kommt hin. Man muss dazu sagen, die erste Zeit war als studentische Hilfskraft. Das heißt, sie zählt auch nur so halb.",
            "start": 315715,
            "end": 322318,
            "confidence": 0.852090909090909,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Von diesen zwölf Jahren waren es achteinhalb Jahre Softwareentwicklerin und knapp drei Jahre Teamleiterin, Engineeringmanagerin, wie man den Job auch immer bei euch in der Firma bezeichnet. Bevor wir tief ins Thema einsteigen, würde ich gerne mal ein bisschen Kontext über deine aktuelle Rolle haben. Zum Beispiel, wie groß ist dein Team? Was macht dein Team gerade so? Also sind das alles nur Softwareentwickler oder auch Designer und Designerinnen und Produktmanager und so weiter und so fort?",
            "start": 322358,
            "end": 349824,
            "confidence": 0.7614285714285712,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die Firma ist, glaube ich, mittlerweile über 300 Mitarbeiter. Unsere IT-Abteilung sind, also nur unsere Software-Developer, über 50.",
            "start": 350105,
            "end": 359142,
            "confidence": 0.7939444444444445,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was macht die Firma eigentlich?",
            "start": 359152,
            "end": 360453,
            "confidence": 0.8521999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Im Moment arbeite ich bei an Office. Wir machen ein CRM für Immobilienmakler, was komplett webbasiert ist, mit allem noch zusätzlich, was Immobilienmakler so brauchen, Portalanbindungen und so weiter.",
            "start": 360674,
            "end": 373904,
            "confidence": 0.8048965517241381,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und was sind dann deine Technologien oder bei euch im Team, die ihr da verwendet?",
            "start": 373944,
            "end": 377327,
            "confidence": 0.6204000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir arbeiten hauptsächlich mit PHP und bei uns im Team dann jetzt eben auch mit Vue und GraphQL und allem, was es noch so Neues gibt. Und mein Team sind wir mit mir fünf. Mein Team ist dafür zuständig, so technische Neuerungen rauszusuchen, auszuprobieren, fortzubereiten. nachzudenken und rauszufinden, an welchen Stellen wir was tun müssen, wo wir uns verbessern müssen und was dann die richtigen Wege sind. Von der Teamstruktur her hab ich quasi von allem etwas. Ich hab einen Junior Softwareentwickler, einen Staff, einen Senior und einen Experten. Alles dabei, aber sind nur Softwareentwickler.",
            "start": 377819,
            "end": 419422,
            "confidence": 0.8328842105263156,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ist der Experte in der Levelhierarchie, wenn wir von Junior und Staff und so weiter sprechen?",
            "start": 419442,
            "end": 425405,
            "confidence": 0.7724705882352944,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Bei uns wurde irgendwann ein Expertenlevel eingeführt für die Seniors, die nicht in die Teammanagerschiene rutschen möchten und damit es da trotzdem eine weitere Karrierestufe gibt, gibt es bei uns noch den Experten, wo wir aber auch nur einen einzigen haben.",
            "start": 426062,
            "end": 441800,
            "confidence": 0.7988536585365854,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also sowas wie der Staff-Engineer. Also ist noch über dem Senior. Ja genau, also so wie andere Staff. Staff ist wahrscheinlich zu englisch, dann kann man ja Expertin nennen.",
            "start": 442400,
            "end": 453126,
            "confidence": 0.5724827586206896,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber du hattest ja gerade gesagt, ihr habt einen Staff-Engineer bei euch im Team, oder?",
            "start": 453786,
            "end": 456568,
            "confidence": 0.614,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Bei uns heißt der Professional, also wir haben einen Junior, einen Professional, das ist die Mittelklasse bei uns, quasi der normale, dann haben wir einen Senior und einen Experten.",
            "start": 457711,
            "end": 466555,
            "confidence": 0.7292413793103448,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ah, okay, verstehe. Wieder ein sehr, sehr schönes Beispiel, dass diese Karrierepfade immer anders definiert und auch anders genannt werden. Wünscht du dir ab und zu da auch mal eine industrieweite Definition, dass man das gegebenenfalls sogar firmenübergreifend vergleichen könnte?",
            "start": 466595,
            "end": 479341,
            "confidence": 0.7528500000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, die Frage ist, wofür braucht man das? Wofür braucht man diese Titel? Ist das eine Weiterentwicklungsebene in der Firma? Ist das in der Firma dafür da, damit man irgendwie Gehaltslevel und Anforderungslevel vergleicht? Oder erwartet jetzt jemand anderes, wenn ich mich als Senior Software Developer irgendwo entwickle, dann genau das Gleiche wie alle anderen? Das kann ich mir eigentlich nicht vorstellen. Weil je nachdem, was man wo gemacht hat, ist es überhaupt nicht vergleichbar.",
            "start": 480051,
            "end": 506483,
            "confidence": 0.8552000000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, der Andi hätte immer gerne DIN-Norm. Meiner Meinung nach ist es einfach unmöglich in dem Bereich.",
            "start": 507127,
            "end": 512431,
            "confidence": 0.7498235294117648,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wolfgang, du weißt schon, dass das gerade der Running Gag ist, ne? DIN-Norm. Deutsche Industrienorm-Norm.",
            "start": 512471,
            "end": 517114,
            "confidence": 0.6806666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, ich bin ja Österreicher, ich darf das.",
            "start": 517154,
            "end": 518876,
            "confidence": 0.6293749999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Habt ihr sowas auch?",
            "start": 518895,
            "end": 519775,
            "confidence": 0.5745,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir haben die Ö-Norm.",
            "start": 519796,
            "end": 521057,
            "confidence": 0.5645,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, lassen wir es dabei. Du hattest gesagt, du hast fünf Leute in deinem Team. Ist das bisher auch die Maximalgröße von Leuten innerhalb eines Teams, die du geleitet hast? Oder hattest du auch schon mal größere Teams?",
            "start": 521136,
            "end": 531205,
            "confidence": 0.7664473684210527,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wo ich vorher war, hatte ich erst ein Team von acht Leuten und danach von 16. Da war aber die ganze Entwicklungsabteilung auch nur 16 Leute groß. Also es war viel kleiner.",
            "start": 532225,
            "end": 543612,
            "confidence": 0.7363124999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment, du hattest ein Team mit 16 Leuten?",
            "start": 543632,
            "end": 546074,
            "confidence": 0.678625,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja. Also ich hatte alle.",
            "start": 546094,
            "end": 547875,
            "confidence": 0.7535999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay. Hat das funktioniert?",
            "start": 549035,
            "end": 550417,
            "confidence": 0.772,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist jetzt die Frage, was man als funktioniert definieren möchte.",
            "start": 550457,
            "end": 554300,
            "confidence": 0.6830909090909091,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn du die zwei Situationen jetzt vergleichst, die Situation jetzt mit fünf Leuten und damals mit 16, wo siehst du da den größten Unterschied?",
            "start": 554340,
            "end": 562347,
            "confidence": 0.7616666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also die Unternehmensstruktur ist vollkommen anders, wo ich damals war und wo ich jetzt bin. Wo ich damals war, hatten wir keine One-on-ones. Selbst die Jahresgespräche waren so, ja, wir sollten eigentlich einmal im Jahr hoch. Jetzt ist es schon zwei Jahre. Die Mitarbeiter waren ziemlich erfahren und lange in der Firma. Das heißt, die musste man wirklich sehr wenig unterstützen, leiten oder Sonstiges. Da war auch wenig mit. Wir machen jetzt nochmal eine Weiterentwicklung. Da gab es auch keine Level. Da hat einfach jeder sein Kram gemacht und mein Job war so ein bisschen organisatorisch, auf technischer Projektleitungsebene eher sowas.",
            "start": 562407,
            "end": 599280,
            "confidence": 0.8387227722772272,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das heißt, der Kontakt aktuell im Team ist wesentlich intensiver.",
            "start": 599760,
            "end": 603501,
            "confidence": 0.8480999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja.",
            "start": 603861,
            "end": 604181,
            "confidence": 0.65,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Glaubst du, dass du in der aktuellen Situation auch 16 Leute im aktuellen Setup machen könntest? Oder wäre das unmöglich?",
            "start": 604201,
            "end": 611502,
            "confidence": 0.7950999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Auf gar keinen Fall. Also alleine mit den One-on-Ones, die wir machen, wenn ich 16 Leute hätte, würde ich, glaube ich, gar nicht mehr zu irgendwas kommen. Also nee, das wäre unmöglich.",
            "start": 611522,
            "end": 622804,
            "confidence": 0.7670625000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Programmierst du eigentlich noch? Machst du Hands-on auch irgendwas?",
            "start": 622824,
            "end": 625825,
            "confidence": 0.6322222222222221,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja.",
            "start": 625845,
            "end": 625945,
            "confidence": 0.326,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie viel von deiner Zeit ist hands-on und wie viel ist Team-People-Management?",
            "start": 627767,
            "end": 633451,
            "confidence": 0.8162499999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das kommt drauf an. Also im Moment ist ja Ferienzeit überall. Da habe ich natürlich viel weniger Leute. Da fällt viel auch aus. Dann komme ich mehr zum Entwickeln. Wenn aber alle da sind, würde ich jetzt vielleicht sagen, wenn es gut läuft, 20, 30 Prozent. Wenn es schlecht läuft, also wenn es schlecht, schlecht in Anführungsstrichen, wenn es schlecht läuft, dann auch mal gar nicht.",
            "start": 633491,
            "end": 655025,
            "confidence": 0.7507058823529412,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also 20, 30 Prozent hands on.",
            "start": 655545,
            "end": 657186,
            "confidence": 0.5518333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja.",
            "start": 657546,
            "end": 657806,
            "confidence": 0.702,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe das Gefühl, du hast den heiligen Gral gefunden. Jeder, der schon mal Software entwickelt hat, möchte und in die Teamleiterrolle schlüpfen möchte, möchte natürlich nicht hands off sein, aber im Endeffekt sagen super viele Leute, uh, praktisch ist das aber doch ganz schön schwierig. Deswegen würde mich mal interessieren, wie sieht eigentlich so dein normaler Arbeitsalltag aus? Also welche Aufgaben bestimmen denn deine Woche beziehungsweise deinen Tag? Wenn du sagst, wenn es gut läuft, kommst du mal zu Hands-on, wenn es schlecht läuft, kommst du halt nicht dazu. Also, wie sieht denn so die ganze Sache im arithmetischen Mittel einfach mal aus?",
            "start": 657866,
            "end": 689761,
            "confidence": 0.7731826923076921,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und vielleicht also der People-Management-Teil, also die 30% Coding, das kann sich noch jeder wahrscheinlich gut vorstellen, aber... Werbung.",
            "start": 689781,
            "end": 699614,
            "confidence": 0.751421052631579,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Firma Trivago haben wir bereits öfters in diesem Podcast erwähnt. Primär, weil Wolfgang und ich dort im Laufe unserer Karriere wertvolle Erfahrungen sammeln durften. Und genau über solche Erfahrungen schreiben auch die Mitarbeiterinnen und Mitarbeiter von Trivago selbst auf dem hauseigenen Tech-Blog. Auch ich habe im Laufe der Jahre einige Tech-Artikel dort veröffentlicht. Speziell passend zu dieser Episode hat Tom Bartel, ein Tech-Lead aus dem Frontend-Bereich, einen Artikel über seinen eigenen Wechsel vom Software-Ingenieur zum Manager geschrieben. Darin beschreibt Tom drei Bereiche, die du nun für deine neue Managerrolle anders sehen solltest. Erstens, was Produktivität als Engineering Manager und Managerin bedeutet. Zweitens, wie deine Arbeit und Sichtbarkeit nun vom Team wahrgenommen wird. Und drittens, wie wichtig es auch mal ist, kritisches Feedback zu geben. Wenn du neu im Engineering Management bist oder darüber nachdenkst in die Richtung zu wechseln, ist dieser Blogpost etwas für dich. Schau doch mal auf dem Trivago Tech Blog unter tech.trivago.com slash em vorbei. Link findest du natürlich auch in den Shownotes. Werbung Ende.",
            "start": 699634,
            "end": 758371,
            "confidence": 0.8263905325443787,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und vielleicht also der People Management Teil, also die 30% Coding, das kann sich noch jeder wahrscheinlich gut vorstellen, aber was macht man eigentlich so als Team Lead?",
            "start": 758411,
            "end": 767299,
            "confidence": 0.7493928571428572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also vor kurzem standen bei uns zum Beispiel die Zwischengespräche an. Das heißt, ich musste mir da noch mal Gedanken machen, wie war das letzte halbe Jahr, da noch mal vorbereiten, was war gut, was war nicht so gut, was möchte ich noch mal vertiefen mit den Leuten, die Gespräche vorbereiten. Da ich das noch nicht so lange mache, ist es für mich immer für viel Vorbereitung, weil ich gut vorbereitet in das Gespräch gehen möchte und aber noch nicht so die Routine habe, wie ich die gut vorbereite für mich. Dann wöchentlich die One-on-ones, die wir haben, vorbereiten, nachbereiten. Immer gucken, wie geht es den Leuten, muss ich irgendwo tätig werden? Jetzt als neues Aufgabenfeld habe ich für mich entdeckt, ich muss viel mehr Kontakte zu den anderen Teams und Abteilungen knüpfen, da mehr sprechen und die Kommunikation stärken, weil das eben nicht jeder aus dem Team machen kann, dass ich da das Bindeglied bin. Wenn es irgendwo hakt, Krisenleitung machen, also Leute zusammenführen, wer muss jetzt mit wem sprechen, die Leute ansprechen und am besten zusammen in den Meetingraum setzen und mich dann verabschieden und die das klären lassen.",
            "start": 767667,
            "end": 826788,
            "confidence": 0.8123664921465975,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hast zuerst auch One-on-ones erwähnt. Wie viel Zeit widmest du den One-on-ones?",
            "start": 827507,
            "end": 833449,
            "confidence": 0.786,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist unterschiedlich. Ich habe welche, die sehe ich alle zwei Wochen für eine halbe Stunde und ich habe aber auch welche, die sehe ich jede Woche für eine halbe Stunde und dann Es kommt immer so auf den Typ an. Manche kommen zu mir und sind super vorbereitet und die füllen die halbe Stunde einfach von ganz alleine. Die haben so viel, was sie mir mitteilen möchten in dieser halben Stunde. Da hab ich Vorbereitung wenig. Außer es ist jetzt mal was in der Woche oder in den zwei Wochen gewesen, wo ich sag, das möchte ich auf jeden Fall ansprechen, positiv oder negativ. Aber da ist dann mehr Nachbereitung für mich. Was nehm ich daraus mit? Muss ich irgendwo jetzt was machen? Das ist bestimmt schon 15 Minuten, 20, je nachdem, was da dann rauskommt. Und bei anderen Leuten ist es viel schwieriger. Da muss ich viel mehr vorbereiten, weil die sich selber nicht so sehr vorbereiten. Und dann muss ich gucken, wie kriege ich den aus dieser Position raus? Was kann ich für Fragen stellen? Wie kriege ich raus, ob es dem gerade gut geht? Wie kriege ich jetzt raus, was er für Probleme hat? Also das ist viel, viel mehr Arbeit dann für mich.",
            "start": 833489,
            "end": 898196,
            "confidence": 0.8018221153846158,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du eigentlich nur Männer im Team oder hast du auch Frauen?",
            "start": 898216,
            "end": 901178,
            "confidence": 0.49616666666666664,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, mittlerweile habe ich auch eine Frau noch.",
            "start": 901664,
            "end": 904048,
            "confidence": 0.719625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du denn festgestellt, dass sich die Teamdynamik ein bisschen geändert hat, seitdem eine weibliche Person deinem Team beigetreten ist?",
            "start": 904088,
            "end": 910881,
            "confidence": 0.8035499999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Moment, da war ja schon eine Frau im Team, du selbst.",
            "start": 910921,
            "end": 913647,
            "confidence": 0.6769999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das stimmt, das stimmt. Ich muss sagen, die Frau ist noch nicht so lange jetzt. Die ist relativ neu im Team und wie gesagt, wir haben ja auch Ferienzeit im Moment. Ich kann es noch nicht so richtig greifen, ob sich das verändert hat. Also ich meine, die Teamdynamik ändert sich ja immer, wenn eine Person das Team verlässt oder neue hinzukommt, egal wer das ist.",
            "start": 914579,
            "end": 934002,
            "confidence": 0.7435151515151514,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hattest du gerade schon bei den ganzen Meetings gesagt, du bereitest sie vor, du bereitest sie nach und dass manche One-on-Ones von manchen Personen ganz alleine gefüllt werden. Meine Frage ist jetzt, ist das von dir als Erwartung gesetzt worden oder haben die Leute das von sich aus gemacht und sind das dann eher Themen wie ich arbeite gerade an dem und dem Bug oder sind das dann Persönlichkeitsentwicklungsthemen, also mit was füllen diese Menschen von sich aus das One-on-One? Und wie hättest du es gerne? Sagst du, ist das der erwartete Zustand, den ich gern von jedem hätte? Oder sagst du, ab und zu bring ich schon gerne meine Themen mit rein und ich treibe das One-on-One jetzt hier?",
            "start": 934402,
            "end": 972549,
            "confidence": 0.809090909090909,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also, die Themen, die da besprochen werden, sind schon nicht nur, also eigentlich wenig von technischer Natur tatsächlich. Weil wir auch ein Tech-Lead haben, und dann werden solche Sachen eben mit dem im One-on-One besprochen. Was bei mir dann ankommt, ist eher, was mich im Moment im Team stört, Oder, ihr, letztens hatten wir einen schlechten Review-Prozess. Das ist mir jetzt öfters aufgefallen. Was können wir denn da machen? Oder, hey, mir ist letztens nachts plötzlich eingefallen, was wir anders machen müssen, damit wir erfolgreicher sind. Und ich bin dann die Anlaufstelle, wo so was dann abgeladen wird erst mal. Und ich muss dann filtern, was machen wir daraus? Ich muss auch gucken, dass die Leute dann nicht demotiviert sind, wenn wir es nicht machen, weil es vielleicht nicht unsere Aufgabe ist. Ob ich das will? Ich finde es schon gut, wenn die Leute vorbereitet kommen, wenn sie diese Zeit nutzen für sich. Es muss nicht sein, dass die Leute vorbereitet kommen und sagen, halbe Stunde, ich fülle die jetzt. Aber ich habe ja auch immer die Möglichkeit zu sagen, okay, jetzt hast du ein Thema gebracht, jetzt möchte ich mal ein Thema anbringen. Und wenn man dann sieht, wir haben zu wenig Zeit, kann man immer noch überlegen, ob es sinnvoll ist, die One-on-Ones einfach öfters oder länger zu machen, wenn es nötig ist. Aber es wäre schon mein Wunsch, dass sich jeder entsprechend vorbereitet und was mitbringt.",
            "start": 972589,
            "end": 1047981,
            "confidence": 0.8071129707112967,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hast gesagt, du hast jetzt eine neue Entwicklerin im Team. Nehmen wir mal an, die kommt von dieser Firma, wo du damals Lead warst mit den 16 Leuten, wo es keine 101s gibt und die kennt gar keine 101s. Wie erklärst du denn den neuen Teamzugängen, für was so ein 101 eigentlich da ist und wofür man das überhaupt nutzen kann? Oder wo siehst du den Sinn darin?",
            "start": 1048340,
            "end": 1070198,
            "confidence": 0.788159420289855,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es ist witzig, dass du das fragst, weil tatsächlich, als ich diese Teamlead-Rolle bekommen habe, hatten wir auch noch keine One-on-Ones. Das heißt, die haben wir dann auch später eingeführt und erst mal alle saßen da im ersten One-on-One so und meinten, okay, und was machen wir jetzt? Was soll ich jetzt hier?",
            "start": 1072840,
            "end": 1087353,
            "confidence": 0.6849245283018867,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was heißt, wir haben die eingeführt? Also wer hat die eingeführt? Wurde das Company-wide eingeführt oder hast du die eingeführt?",
            "start": 1087393,
            "end": 1094059,
            "confidence": 0.7510999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der Abteilungsleiter kam damals neu und hat gesagt so, ich möchte, dass er One-on-Ones macht.",
            "start": 1094099,
            "end": 1098623,
            "confidence": 0.7051333333333335,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay.",
            "start": 1099063,
            "end": 1099263,
            "confidence": 0.352,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja.",
            "start": 1099283,
            "end": 1099384,
            "confidence": 0.349,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber was hat der Abteilungsleiter davon?",
            "start": 1100701,
            "end": 1102523,
            "confidence": 0.731,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Er für sich eigentlich nichts, aber er möchte, dass wir diese Kultur leben, dass wir eben mehr Feedback uns geben, dass wir enger miteinander zusammenarbeiten und dass dann auch früher wir wissen, wenn irgendwo was im Busch ist oder sowas.",
            "start": 1102563,
            "end": 1115197,
            "confidence": 0.8553499999999996,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Würdest du sagen seine ambitionen also die vom abteilungsleiter sind eingetreten also zum beispiel sprichst du jetzt mit deiner vorgesetzten oder mit deinem vorgesetzten über solche kulturellen themen damit du einen schnelleren feedback loop hast also die grundidee eigentlich von 11 von dem abteilungsleiter.",
            "start": 1115677,
            "end": 1132781,
            "confidence": 0.7712500000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, dieser Abteilungsleiter ist auch mein direkter Chef. Das heißt, der hat als erstes natürlich die One-on-Ones auch mit seinen Teammanagern eingeführt. Und ja, also ich hatte die vorher auch noch nicht. Ich finde es aber super, weil ich schnelles Feedback sowieso bekomme. Ich kann es mir auch holen, wenn es mir wichtig ist. Und wenn man dann eben Zwischen- oder Jahresgespräche hat, kommt da für mich nichts Neues mehr auf den Tisch. Also sonst ist das eher immer so ein, jetzt habe ich Jahresgespräch, wer weiß, was da jetzt was ich jetzt dieses ganze Jahr über falsch gemacht hab, was mir jetzt auf den Teller gelegt wird. Und so find ich das superangenehm, weil man dafür weder Angst haben muss, noch irgendwie nervös sein muss, weil man weiß ja eigentlich schon genau, was kommt. Es wird nur noch mal vertieft. Und ich hab einmal die Woche die Chance, über meine persönlichen Ziele zu sprechen und zu fragen, wie läuft's, ob ich die Erwartungen erfülle, wie ich meinen Job mache, und aber auch andere Themen anzusprechen, wenn's zwischendurch mal nicht geht.",
            "start": 1133119,
            "end": 1190647,
            "confidence": 0.8059889502762435,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Füllst du dann die halbe Stunde oder lässt du die von deinem Vorgesetzten füllen?",
            "start": 1191068,
            "end": 1195178,
            "confidence": 0.8157857142857143,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Immer unterschiedlich. Also wir haben ein gemeinsames Dokument, wo wir Sachen reinschreiben, die wichtig sind für das nächste One-on-One. Das waren bei mir tatsächlich nicht so viele persönliche Entwicklungssachen. Bisher möchte ich aber auch gerne jetzt anders nutzen, aber es war viel, wo ich gesagt habe, hier, ich habe diesen Problemfall bei mir im Moment im Team. Wie kann ich damit umgehen? Kannst du mir einen Tipp geben? Also schon irgendwo auch Weiterentwicklung als Teammanager. Mentoring quasi.",
            "start": 1195780,
            "end": 1223300,
            "confidence": 0.8292467532467533,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt ist es natürlich super spannend, weil du beide Zeiten miterlebt hast. Damals die Zeit ohne 101s und dann mit 101s. Also die erste Frage, du persönlich findest sie natürlich gut. Hast du ja auch schon gesagt, wie hat das Team reagiert? Sind die mittlerweile auch auf der Schiene, dass sie es gut finden? Oder war das eine lange Phase, bis es akzeptiert wurde?",
            "start": 1223480,
            "end": 1243649,
            "confidence": 0.7694062499999997,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich habe am Anfang, wir waren das erste Team, die das eingeführt haben. So wie wir technische Neuerungen testen, testen wir solche Neuerungen scheinbar auch immer. Und ich habe am Anfang ganz frei gelassen, wie lang das sein soll und wie oft. Ich habe gesagt, trag einen Termin ein, alle 14 Tage oder einmal die Woche, wie ihr möchtet, 15 bis 30 Minuten auch, wie ihr möchtet. Und das ging ganz schnell, dass es am Anfang 15 Minuten alle zwei Wochen waren, bis die Leute gemerkt haben, ich möchte aber dieses Meeting haben. Und dann ging es ganz schnell, dass die länger wurden. Und natürlich saßen wir im ersten Meeting auch da und was machen wir jetzt hier? Wofür ist das da? Weil auch so diese Entwicklungsziele gab es eben vorher auch noch nicht. Und in den Gesprächen, in den ersten, haben wir die aber dann rausgefunden und so ein bisschen hinterfragt, wo möchtest du denn hin? Was willst du denn? Wo willst du dich noch verbessern? Und dann wurde da schon der Nutzen auch gesehen.",
            "start": 1244089,
            "end": 1295423,
            "confidence": 0.7802711864406782,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und hast du das dann auf eine halbe Stunde zurückgekürzt, wenn du sagst, die sind immer länger geworden?",
            "start": 1295683,
            "end": 1300988,
            "confidence": 0.7526111111111111,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, es ging meistens, also die haben angefangen mit 15 Minuten und dann ging das so, ja, sollen wir nicht doch 20 vielleicht machen? Und dann habe ich irgendwann gesagt, komm, mach doch halbe Stunde, passt, und dann haben wir genug Zeit.",
            "start": 1301028,
            "end": 1313698,
            "confidence": 0.7349047619047618,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und die halbe Stunde ist für dich auch ausreichend? Also das scheint so ein Mittelwert zu sein für die, die es eher brauchen wöchentlich, die anderen zwei wöchentlich, aber halbe Stunde ungefähr.",
            "start": 1313718,
            "end": 1323627,
            "confidence": 0.77825,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau und wir sind ja so ein kleines Team, dass wenn irgendwas zwischendrin mal ist, können wir ja immer noch zwischendrin auch mal sprechen und wir sind sowieso so eng im Austausch, weil wir so wenig Leute sind, dass das reicht.",
            "start": 1324697,
            "end": 1336501,
            "confidence": 0.8080975609756097,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Habt ihr eigentlich ein PO oder sowas in der Richtung oder bist du dann auch noch verantwortlich für das Product und eine Art Roadmap oder Priorisierungen, solche Dinge?",
            "start": 1336541,
            "end": 1346025,
            "confidence": 0.7848214285714287,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also die anderen Teams haben sowas und wir, weil wir diese technischen Neuerungen und sowas machen, haben das nicht. Das heißt aber nicht, dass ich das mache, sondern wir machen das eigentlich als Team zusammen. Also wir haben QAMs zweiwöchentlich und da besprechen wir, was wir als nächstes Themen halt in die Iteration mit aufnehmen und auch die generelle Roadmap arbeiten wir schon als Team zusammen.",
            "start": 1346571,
            "end": 1368422,
            "confidence": 0.8455757575757572,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was sind QAMs?",
            "start": 1368622,
            "end": 1369623,
            "confidence": 0.45533333333333337,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir setzen uns halt zusammen und überlegen, was wir für Projekte reinnehmen in die nächsten zwei Wochen.",
            "start": 1369983,
            "end": 1374644,
            "confidence": 0.8474705882352941,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, also sowas wie Sprint-Plannings quasi aus dem Scrum-Bereich.",
            "start": 1374684,
            "end": 1378445,
            "confidence": 0.5721111111111111,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir dürfen nicht sagen, dass wir Scrum machen.",
            "start": 1378985,
            "end": 1381325,
            "confidence": 0.6071249999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt haben wir ja schon die ganze Zeit über One-on-Ones gesprochen und du sagtest auch gerade in der ersten Firma, wo du Teamleiterin warst, gab es keine One-on-Ones. In der zweiten Firma jetzt schon. Jetzt würde mich mal interessieren, ist Engineering-Management in allen Firmen gleich?",
            "start": 1381365,
            "end": 1395208,
            "confidence": 0.7310444444444446,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Vollkommen unterschiedlich. Also nicht mal nur auf die Firma bezogen, selbst vom Chef abhängig. Also wo ich jetzt bin, hatte ich ja auch erst einen anderen Chef und dann kam eine neue und es hat sich wieder komplett geändert, wie was jetzt von mir erwartet wird und was mein Job quasi ist.",
            "start": 1395768,
            "end": 1411432,
            "confidence": 0.809423076923077,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber in allen Rollen hattest du bisher fachliche und disziplinarische Führung oder nur eins von beiden?",
            "start": 1411472,
            "end": 1419094,
            "confidence": 0.8771250000000002,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also wo ich vorher war, hatten wir anfangs, als ich nur die acht Leute hatte, hatte ich fachliche und disziplinarische Führung. Und danach habe ich dann beide Teams übernommen und dafür habe ich eine fachliche Führung an meine Seite bekommen. Und im Moment habe ich auch nur disziplinarische Führung, weil wir ja den Tech Lead haben.",
            "start": 1419848,
            "end": 1438553,
            "confidence": 0.8175178571428573,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Obwohl du selber auch noch hands-on mitprogrammierst. Das ist eine interessante Struktur.",
            "start": 1438573,
            "end": 1442454,
            "confidence": 0.5933333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, aber ich finde, ich habe das ganz am Anfang gesagt, wenn ich mitprogrammiere, programmiere ich als vollwertiges Teammitglied und nicht als Teammanagerin. Und wenn ich was mit meinen Leuten diskutiere, eine fachliche Entscheidung, möchte ich nicht, dass die sagen, ja, das machen wir so, wie du sagst, nur weil ich Teammanagerin bin.",
            "start": 1442926,
            "end": 1457448,
            "confidence": 0.8268113207547166,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Funktioniert dieser Spagat? Weil ich hab nämlich immer die Erfahrung gemacht, immer wenn der Chef was sagt, dann ist das so. Und dass wenn man jetzt, ich sag mal, diese flexible Struktur hat, weil wenn du sagst, du hast jetzt an guten Wochen oder in guten Wochen 20 bis 30 Prozent Hands-on, gehen wir mal von 20 Prozent aus und machen uns mal den Traum, dass das ein voller Tag wäre, was mit hoher Wahrscheinlichkeit nicht ist. Das bedeutet, jeden Montag ist die Isabel jetzt ein klassisches Teammitglied und nicht meine Vorgesetzte. Funktioniert dieser Spagat?",
            "start": 1457868,
            "end": 1486493,
            "confidence": 0.7902315789473684,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich hoffe das natürlich. Ich glaube bei den Entwicklern bei mir im Team, die schon länger dabei sind, also der Senior und der Experte auf jeden Fall, weil ich das auch klar sage, also der eine von denen war witzigerweise mein Mentor, als ich da angefangen habe. Und ich sag auch immer klar, dass ich technisch, ich kann nicht alles wissen, was die schon wissen, weil das gar nicht 100 Prozent mein Gebiet ist und ich mich noch gar nicht so lange beschäftige damit wie die. Und deswegen ist es mir total wichtig, dass sie mir auch sagen, Isabel, das ist jetzt Quatsch, was du da machst, oder das ist nicht der beste Weg. Und von denen krieg ich super viel Feedback. Von den anderen beiden ... Also, wir diskutieren schon, und ich hoffe, dass keiner irgendwann mal einfach sagt, ja, okay, dann mach das so, nur weil ich der Teammanager bin.",
            "start": 1486913,
            "end": 1530934,
            "confidence": 0.7895526315789471,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Agierst du da in irgendwelchen Meetings dann auch anders, dass du dich irgendwie zurückhältst oder so, wenn es um technische Entscheidungen geht? Also aktiv, dass du dich irgendwie rausnimmst?",
            "start": 1531322,
            "end": 1540113,
            "confidence": 0.7471724137931036,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sollte vielleicht. Aber ich glaube, dafür bin ich echt nicht der Typ. Viele Sachen, die wir machen, sind schon so, dass ich sage, ich verstehe die nicht bis in die Tiefen. Ich stelle dann vielleicht Fragen einfach, um eben offene Sachen zu klären und dann aufs richtige Ergebnis zu kommen. Es ist aber auf jeden Fall nie so, dass ich sage, nee, wir machen jetzt das und Punkt. Also solche Entscheidungen treffe ich nicht und möchte ich auch nicht treffen.",
            "start": 1540133,
            "end": 1566389,
            "confidence": 0.811225,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und trifft da täglich diese Entscheidungen dann?",
            "start": 1566429,
            "end": 1568930,
            "confidence": 0.6414285714285715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn es notwendig ist, schon. Aber normalerweise treffen wir die als Team. Also bisher war das immer eine Demokratie.",
            "start": 1568970,
            "end": 1575373,
            "confidence": 0.8216842105263158,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hast du schon erwähnt, dass dein Tech Lead, glaube ich, dein Mentor war. Habe ich das richtig verstanden?",
            "start": 1575773,
            "end": 1580335,
            "confidence": 0.6761578947368422,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein, der Senior, der bei mir im Team ist, der war mein Mentor.",
            "start": 1580396,
            "end": 1585098,
            "confidence": 0.5928461538461538,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber das heißt, du bist irgendwann auf diese Leadrolle gekommen und hast dann auch dann Teile von deinem Team sozusagen unter dir gehabt als Managerin, die davor deine Kollegen waren. War das irgendwie schwierig?",
            "start": 1585811,
            "end": 1599856,
            "confidence": 0.8717058823529412,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube, ich hatte Glück, dass es quasi eine Neustrukturierung der Teams gab. Das heißt, es war nicht mein altes Team, was ich übernommen habe. Da gab es ja auch einen Teammanager. Die Teams wurden in dem zu dem Zeitpunkt neu strukturiert, neu zusammengewürfelt, zusammengesetzt. Und da war zuerst der damalige Teilungsleiter, CTO sogar, hat den Teammanager-Posten übernommen, weil erstmal keiner da war. Und dann War das schon so, als ich dann die Rolle bekommen hab, hab ich gesagt, okay, aber ist das für alle okay? Oder wollte jemand, vielleicht hatte der Ambition, diesen Job selbst zu kriegen, weil ich auch nicht wollte, dass dann irgendwie böses Blut dann da herrscht. Ich war aber aber ziemlich sicher bei den meisten, dass die nicht in diesen Bereich rein wollen, sondern dass die Tech weitermachen wollen. Und von daher war es dann vollkommen in Ordnung.",
            "start": 1599916,
            "end": 1647753,
            "confidence": 0.8039027777777774,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hatte ich am Anfang der Episode erwähnt, Du hast den Sprung von einer Softwareentwicklerin zur Teamleiterin gemacht, dann wieder zur Softwareentwicklerin und jetzt wieder zur Teamleiterin. Das wirft mehrere Fragen bei mir auf. Was war die Motivation, die erste Motivation von der Stelle als Softwareentwicklerin zur Teamleiterin zu wechseln? War das für dich eine Beförderung? Warum hast du das gemacht?",
            "start": 1648614,
            "end": 1672720,
            "confidence": 0.7830655737704919,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Oder wurdest du gar nicht gefragt?",
            "start": 1672760,
            "end": 1673861,
            "confidence": 0.6918333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich war ja damals gar nicht so lange noch dabei. Und ich hatte noch diesen Graubenssatz, ich muss der beste Entwickler sein, um überhaupt Teammanager werden zu können. Und damit war das für mich eigentlich außer Frage. Aber dann war eben zu der Zeit ein sehr, sehr guter Entwickler Teammanager, der vielleicht nicht unbedingt ein Teammanager war. Also er hatte diese Rolle, er wollte diese Rolle auch, aber er hat sie als Manager glaube ich, nicht so gut ausgefüllt. Und das hat mich schon gestört, weil es mich stört, wenn mein Vorgesetzter nicht den Job so gut macht, wie ich das gerne hätte. Und dann wurde das irgendwann umstrukturiert. Dann hieß es doch, Isabel, möchtest du das nicht machen? Und ich war natürlich erst mal, oh mein Gott, aber ich weiß gar nicht, was ich machen soll, was ich so genau machen muss. Und außerdem kenne ich ja auch gar nicht alles. komplett jede Ecke der Software und alle Kunden und überhaupt alles, was wir machen. Wie soll ich den Job denn machen? Und irgendwann dachte ich dann, ja, okay, vielleicht bin ich die beste Option gerade für den Job.",
            "start": 1674348,
            "end": 1732975,
            "confidence": 0.8172894736842105,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also warst du eigentlich mit deinem damaligen Vorgesetzten unzufrieden, hast gedacht, du kannst das besser und hast dann irgendwann die Chance bekommen, dich zu beweisen?",
            "start": 1732995,
            "end": 1740616,
            "confidence": 0.74912,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Klingt jetzt fast ein bisschen böse, aber vielleicht schon, ja.",
            "start": 1740636,
            "end": 1742917,
            "confidence": 0.6739999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Denkst du denn, du hast den Job besser ausgeübt, so jetzt so retrospektiv betrachtet? Oder hast du dann erst festgestellt, wie schwierig das eigentlich ist, das zu erfüllen, was du dir so vorstellst?",
            "start": 1744054,
            "end": 1754217,
            "confidence": 0.7573939393939393,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich glaube beides. Also ich habe festgestellt, dass es schon schwierig ist, dass es ein ziemlicher Balanceakt ist, den ich vielleicht damals auch noch nicht so richtig gut gemacht habe. Aber ich habe auch festgestellt, dass ich mich schon eher in dem Bereich sehe als jetzt. Also Softwareentwickler schon, aber ich sehe mich nicht da total deep into it mit super technischem Wissen.",
            "start": 1754665,
            "end": 1774288,
            "confidence": 0.8100634920634922,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hast du gesagt, du hattest keine Ahnung, was du da eigentlich machen sollst. Und es geht ja eigentlich sehr vielen Leuten, die in diese Rolle reinrutschen, weil man hat halt davor selten sowas schon mal gemacht. Und ganz oft kommt man aus dem technischen Bereich. Das heißt, man hat da auch wenig Ahnung in der ganzen Kommunikationsecke. Und vielleicht ist man ein Naturtalent, aber ist halt auch selten. Lernen tut man in dem Bereich auch ganz wenig, vor allem Wenn es um Uni oder solche Dinge geht, da ist ja Kommunikation oder Zwischenmenschliches eigentlich eher selten irgendwo zu finden. Was hättest du dir denn gewünscht damals, dass dir jemand sagt, wie denn so eine Teamlead-Rolle überhaupt aufgebaut ist? Oder was für Infos hätten dir damals geholfen bei dem Start?",
            "start": 1774528,
            "end": 1815550,
            "confidence": 0.8058769230769233,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube, klare Erwartungsaufstellungen. Also was wird von mir erwartet? Was muss ich wirklich machen in dem Job? Was sind meine Freiräume und was muss ich absprechen? Und wie läuft ein Tag eines Teammanagers in dieser Firma mit diesem Vorgesetzten ab? Weil als ich die Rolle übernommen hab, hab ich am Anfang, war ich weiter Softwareentwicklerin, bis irgendwann Sachen auf mich eingeprasselt sind. Ich dachte, ah ok, das ist also Teammanagement.",
            "start": 1815922,
            "end": 1846121,
            "confidence": 0.8080555555555554,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du das dann in der zweiten Firma besser bekommen? Weil ich muss ja auch sagen, das ist ein Klassiker und mich hat das auch immer gestört, aber ich hab das auch nie bekommen. Egal wie erfahren meine Leads waren, es war immer irgendwie ein Sprung ins kalte Wasser. Würde mich interessieren, ob es wirklich irgendwie geht, weil man hört es ja ständig, man predigt es auch ständig, Expectations setzen. Aber es ist halt schwieriger, als man so denkt, wirklich die Expectations, diese Erwartungshaltung vielleicht auch rüberzubringen, dass das ankommt.",
            "start": 1846141,
            "end": 1874708,
            "confidence": 0.8265111111111112,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also Erwartungshaltungen jetzt so richtig definiert hatte ich da auch nicht. Was ich wohl hatte, ich habe immer schon mal wieder Urlaubsvertretung für meinen damaligen Teammanager dann gemacht und habe dann so ein bisschen so einen kleinen Einblick bekommen. Aber das ist ja wirklich ganz kleiner Bereich, den man dann in der Zeit macht. Das ist ja wirklich mehr organisatorisches als wirklich Menschenführungsverantwortung übernehmen. Es hat auch tatsächlich ziemlich lange gedauert. Also auch als ich das Team übernommen habe, war es immer mehr so ein Ausfluten. Darf ich das jetzt selber entscheiden oder muss ich jetzt fragen? Also es war immer mal fragen, mal einfach selber entscheiden und gucken, ob es okay ist. Und ja, aber jetzt Mit dem Führungswechsel ist es jetzt schon gefühlt etwas besser geworden. Das wurde mir nicht von Anfang an gesagt, das erwarte ich von dir, aber ich habe dann mal gefragt, was muss ich denn machen jetzt?",
            "start": 1875257,
            "end": 1928044,
            "confidence": 0.8279805194805198,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und hast du eine Antwort bekommen?",
            "start": 1928084,
            "end": 1929425,
            "confidence": 0.717,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe keine ganz klare Antwort bekommen, mit hier sind deine zehn Regeln, die du befolgen musst oder sowas.",
            "start": 1929465,
            "end": 1935852,
            "confidence": 0.8602105263157893,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Was ja auch sicher super schwer ist, also solche Regeln aufzustellen.",
            "start": 1935892,
            "end": 1939195,
            "confidence": 0.7702727272727272,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Aber ich weiß ungefähr, in welche Richtung es geht und ich mich bewegen muss und wo mein Rahmen ungefähr ist.",
            "start": 1939215,
            "end": 1946789,
            "confidence": 0.7082857142857145,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bist du über die Zeit sicherer geworden, was du selbst entscheiden kannst? Dass du einfach sagst, okay, das ist ganz klar, das entscheide ich jetzt einfach und sonst kann ich immer noch sorry später sagen.",
            "start": 1946809,
            "end": 1955218,
            "confidence": 0.7324571428571427,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, also das fällt mir echt immer noch schwer. Also ich bin ja eher der Typ, der sagt, wenn es läuft, dann lasse ich die anderen damit in Ruhe, weil es läuft ja. Und wenn ich Probleme habe, dann melde ich mich schon. Aber bei jetzt das Feedback bekommen, das ist wohl nicht so gut. Ich sollte vielleicht öfters kommunizieren.",
            "start": 1956058,
            "end": 1970595,
            "confidence": 0.7421499999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber in welche Richtung?",
            "start": 1971095,
            "end": 1972456,
            "confidence": 0.90225,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nach oben.",
            "start": 1972496,
            "end": 1973116,
            "confidence": 0.9455,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also eher so Reporting in dem Fall, oder?",
            "start": 1973156,
            "end": 1976777,
            "confidence": 0.8478749999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 1976837,
            "end": 1977257,
            "confidence": 0.883,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist ja auch ein ganz schwieriges Thema eigentlich, dieses Reporting. Es wird ja eher selten gewünscht, dass man wirklich einen Report, einen schriftlichen Report oder sowas macht. Aber es erwartet sich halt doch jeder irgendwie Kommunikation und dass man etwas mitbekommt. Und ich habe da auch so ganz oft die Antwort bekommen, ja, das musst du dann schon selber rausfinden, was für mich wichtig ist oder was du mir da sagst. Du musst halt irgendwie filtern und wenn was wichtig ist, sag es mir. Und dann habe ich auch immer so gedacht, ja, woher soll ich wissen, was dir wichtig ist? Ja, das findest du schon heraus. Das sind halt dann so Ansagen, die halt extrem schwierig sind, aber ich kann es natürlich auch von der Lead-Seite verstehen, weil, ich weiß nicht, hast du zum Beispiel für dein Team irgendwie klare Regeln, wann sie zu dir kommen müssen und wann nicht und wann sie was selber entscheiden können?",
            "start": 1977277,
            "end": 2021534,
            "confidence": 0.7821886792452828,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir brauchen das eigentlich gar nicht, weil wir immer zu fünft in den größeren Projekten mitarbeiten und involviert sind. Und deswegen bin ich bei allem mit dabei und kenne den Stand. Deswegen müssen wir das bei uns nicht machen, sonst würde ich es wahrscheinlich auch eher verstehen.",
            "start": 2022477,
            "end": 2036672,
            "confidence": 0.8095957446808509,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe aber das Gefühl, ihr geht die ganze Sache hier falsch an, schon allein mit dem Wording. Das Wort Reporting hat ja so einen kompletten negativen Touch. Das klingt so nach Zwang. Jeden Freitag 12 Uhr ist hier die E-Mail von der kompletten Wochensummary in meiner Inbox. So kann man das sehen, weil im Endeffekt ist es ja nichts anderes. Aber Managing Up, also wirklich seiner Vorgesetzten die Informationen zuzuschießen, Es ist so ein zweischneidiges Schwert, wie du schon sagtest Wolfgang, was reportet man denn? Aber auf der anderen Seite, man kriegt da super selten Feedback, weil man schmeißt ja immer Informationen in irgend so ein schwarzes Loch und wenn du mal Glück hast, kriege ich mal so einen Daumen hoch im Slack oder ähnliches. Aber dann irgendwann fragt man sich schon, wozu mache ich mir die ganze Mühe denn? Wieso schmeiße ich denn die Informationen alle rüber? Bis ich mal irgendwann Feedback von meinem damaligen Vorgesetzten bekommen habe. Und zwar habe ich festgestellt, immer wenn er gefragt wurde, was in seinen Teams los ist, Beziehungsweise in dem Team, was ich da geleitet habe. Er musste nie wieder zu mir kommen und nach dem Status fragen, weil er hatte alle Informationen. Und das hat ihn natürlich unglaublich gut aussehen lassen, weil er hatte natürlich immer alle Informationen zur Hand. Und dann habe ich verstanden, okay, ich muss ihn einfach nur erfolgreich machen oder erfolgreich aussehen lassen. Und dann hab ich einfach keine Probleme mehr. Und seitdem hab ich dieses, ich werf Informationen in ein schwarzes Loch akzeptiert. Ist leider schade, weil du kriegst relativ wenig Feedback wie ein Danke oder hey, das war sinnvoll. Also, kurzum, du lernst nie, welche Informationen zu detailliert sind oder was war zu high-level. Aber nun gut.",
            "start": 2037180,
            "end": 2129597,
            "confidence": 0.7807440273037543,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber Andi hat da ja auch das sehr gut gemacht, weil wir hatten ja mal denselben Vorgesetzten, Andi und ich. Und damals war die Ansage an mich, schau dir mal an, was der Andi macht, das passt ganz gut.",
            "start": 2129637,
            "end": 2139922,
            "confidence": 0.7412307692307692,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, da schließt sich ja auch wieder der Kreis zu den, welche Entscheidungen darf ich selber treffen. Also mir wurde jetzt auch gesagt, sagt mir doch einfach die Sachen, dann habe ich zumindest die Chance, ein Veto noch mal einzulegen. Und wenn ich kein Veto einlege, bin ich selber schuld und muss dir den Rücken stärken, auch wenn ihr eine falsche Entscheidung getroffen habt. Und das ist natürlich noch mal ein ganz anderer Blickwinkel auf die Sache und ist dann für mich natürlich noch mal verständlicher, weil es mir ja auch was bringt.",
            "start": 2140589,
            "end": 2164692,
            "confidence": 0.8267634408602148,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube, es geht gar nicht darum, um eine Erlaubnis zu fragen oder ähnliches, sondern eher, okay, halt die Leute in Loop und so wissen sie es wenigstens und jeder hat die Chance, Nein zu sagen und dann mach einfach weiter und wenn sie nicht schnell genug reagieren, dann hatten sie wenigstens die Chance, dann ist es aber nicht mehr dein Problem.",
            "start": 2165092,
            "end": 2178902,
            "confidence": 0.7601428571428573,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie schaut das eigentlich aus, das technische Reporting, wenn man das so will? Läuft das dann über dich? Also sprecht jeder über technische Details, also jetzt produktrelevante Dinge oder was ihr so treibt auf der Produkt- und technischen Seite?",
            "start": 2179422,
            "end": 2194013,
            "confidence": 0.7926666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich teile ihm schon mit, wenn wir neue Sachen anfangen und wie wir zu Entscheidungen gekommen sind oder warum wir jetzt irgendeine Neuerung zum Beispiel abbrechen, zurücknehmen, einen anderen Weg gehen. Er hat aber gleichzeitig auch einen engen Kontakt zu meinem Techlead, um da auch nochmal Feedback zu bekommen, wenn er das nochmal detaillierter braucht oder nochmal andere Erklärungen dazu braucht. Ich muss aber auch dazu sagen, er ist auch nicht in unserer Firma groß geworden, also ist vielleicht da auch eher der People Manager als der Tech Lead.",
            "start": 2194327,
            "end": 2224935,
            "confidence": 0.8364888888888891,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber um zur ursprünglichen Frage zurückzukommen, also dir hat Guidance gefehlt, hat dir noch irgendwas anderes gefehlt an Informationen über das Team Lead Dasein?",
            "start": 2224975,
            "end": 2233878,
            "confidence": 0.7848750000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, wie viel das wirklich mit Kommunikation zu tun hat. Ich dachte am Anfang, das ist ja so ein bisschen Orga-Kram. Also ich gucke mit den Leuten, dass die nicht so viele Aufgaben haben, dass die Sachen rechtzeitig fertig werden. Aber wie klein dieser Anteil eigentlich ist, auch wieder je nachdem, wo man arbeitet, war mir so nicht bewusst.",
            "start": 2234337,
            "end": 2254614,
            "confidence": 0.8211166666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hast jetzt schon fast meine nächste Frage vorbeantwortet, weil meine nächste Frage wäre nicht gewesen. Hätte es irgendwas gegeben, wenn du das gewusst hättest, wie so eine Teamlead-Rolle aussieht, dass du sie gar nicht angetreten hättest?",
            "start": 2254929,
            "end": 2267414,
            "confidence": 0.7909999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich würde jetzt nicht sagen, dass ich sie nicht angenommen hätte, wenn ich gewusst hätte, wie viel Kommunikation mit Menschen das ist. Ich hätte sie trotzdem angenommen. Aber ich hätte mich vielleicht anders vorbereitet. Ich hätte mich anders weitergebildet. Ich hätte anderen Fokus auch gelegt bei manchen Sachen.",
            "start": 2267454,
            "end": 2283681,
            "confidence": 0.8079795918367346,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Inwiefern?",
            "start": 2284061,
            "end": 2284501,
            "confidence": 0.712,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab halt am Anfang tatsächlich, ich hab halt entwickelt erstmal weiter und dann prasselten so die Sachen an mich an, hier Deadline-Projekt, hier der hat zu viele Aufgaben, hier haben wir ganz viel in dem Bereich, da kennt sich nur der aus, wie machen wir das, das waren ja eher so Orga-Sachen und Wirklich dieses Thema, wie kommuniziere ich jetzt wirklich mit dieser einen Person? Wie kriege ich das hin, dass ich genau diese Person anspreche, sodass wir gemeinsam eine Basis finden und dass es funktioniert? Da habe ich nicht so den Fokus drauf gelegt. Also weder zu meinem Team noch zu meinem Chef damals.",
            "start": 2284901,
            "end": 2319452,
            "confidence": 0.8233679245283019,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hattest gerade gesagt, du hättest dich anders vorbereitet und dich gegebenenfalls mehr eingelesen. Ab wann hättest du dich entschieden, so ich bin jetzt gut vorbereitet? Oder anders, fühlst du dich jetzt gerade gut vorbereitet, um den Job einer Engineering Managerin auszuführen?",
            "start": 2319612,
            "end": 2333347,
            "confidence": 0.7365714285714288,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Achtung, das ist eine Fangfrage.",
            "start": 2333387,
            "end": 2334368,
            "confidence": 0.442,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, man ist nie zu Ende vorbereitet. Man kann ja immer mehr wissen und Sachen noch mal besser machen. Ich glaube, im Moment ist es so, wie es ist, in Ordnung und es läuft. Natürlich kann man noch mal Sachen verbessern und sich noch mehr weiterbilden und Sachen üben. Das ist, glaube ich, immer so.",
            "start": 2334927,
            "end": 2352885,
            "confidence": 0.8331607142857146,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Woher hast du denn Informationen bekommen zu dieser ganzen Kommunikationsschiene? Also hast du dir da irgendwann, wie du gemerkt hast, das ist ein Thema, hast du dich da irgendwie probiert einzulesen? Hast du irgendwelche Mentoren, Mentorinnen gehabt? Hast du Peers vielleicht, wenn es gegeben hat, gefragt? Oder hat sich das einfach so entwickelt über die Zeit? Und man lernt ja auch einfach by doing. Ist ja auch vollkommen okay.",
            "start": 2353313,
            "end": 2376593,
            "confidence": 0.7928985507246378,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wir hatten in der ersten Firma, wo ich war, irgendwann so ein Führungskräfte-Seminar, wo uns dieses DISC-Verfahren, ich weiß nicht, ob euch das was sagt, vorgestellt wurde. Und klar, das mag man positiv oder negativ bewerten, aber alleine diese … Also.",
            "start": 2377755,
            "end": 2392402,
            "confidence": 0.8206428571428571,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du meinst mit diesen vier Vertranten und den Maya Pricks und so weiter, ja.",
            "start": 2392422,
            "end": 2397545,
            "confidence": 0.5883571428571429,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, und das mag man positiv oder negativ bewerten, aber es gibt erstmal den Anstoß zu denken, hey, vielleicht muss ich nicht mit jedem gleich kommunizieren, vielleicht muss ich bei einem anderen Fokus auf was anderes legen als bei einem anderen Mitarbeiter, um, das hört sich doof an, aber an mein Ziel zu kommen, also um eine Basis zu schaffen.",
            "start": 2398005,
            "end": 2415671,
            "confidence": 0.8116333333333331,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also Fortbildungen können schon helfen demnach?",
            "start": 2415711,
            "end": 2417792,
            "confidence": 0.8058333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich finde schon.",
            "start": 2418312,
            "end": 2418772,
            "confidence": 0.26666666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist ein interessanter Aspekt. In den Fortbildungen werden ja meist dir Tools an die Hand gegeben. Die packen dann ihren Toolkoffer aus und geben dir dann 37 Tools und du musst dann herausfinden, wann du welches Tool anwenden kannst. Und jetzt hattest du das Diskmodell schon erwähnt. Nutzt du regelmäßig diese Tools aus den Fortbildungen, die du genossen hast?",
            "start": 2419457,
            "end": 2436795,
            "confidence": 0.7116833333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also es ist jetzt nicht so, dass ich sage, oh, jetzt in der Situation nehme ich jetzt dieses Tool aus meinem Werkzeugkasten und wende jetzt genau das an. Aber man hat das, finde ich, immer im Hinterkopf. Also ich habe jetzt auch nicht für mein neues Team mich noch mal hingesetzt und gesagt, ach, jetzt versuche ich die noch mal nach diesem Verfahren zu typisieren und weiß dann genau, wie ich die ansprechen muss. Sondern man hat das ja mal gehört. Und dann schwingt das ja irgendwie im Hintergrund mit, wenn man mit denen arbeitet. Und manchmal denkt man so, Ja, okay. Ich habe hier jetzt gemerkt, das ist das, worauf du Wert legst. Ich weiß, wie ich jetzt mit dir kommunizieren muss.",
            "start": 2437442,
            "end": 2475020,
            "confidence": 0.7801463414634148,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wäre das auch eine Empfehlung für Leute, die sich überlegen, in die Engineering-Manager-Rolle zu gehen, dass du sagst, frag mal wirklich nach Workshops, nach On-Site-Workshops zum Thema Leadership? Also würdest du wirklich sagen, ja, die haben mir wirklich aktiv geholfen oder sagst du, ach, ich glaube, in der Praxis habe ich mehr gelernt?",
            "start": 2475040,
            "end": 2492015,
            "confidence": 0.7861886792452829,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also ich glaube, im Hintergrund Wissen zu bekommen, ist das immer gut. Aber es kommt natürlich auf den Workshop an. Damals, das hat mir halt einen Anstoß gegeben, zu gucken, wie ist die Kommunikation mit unterschiedlichen Typen. Jetzt haben wir bei uns nochmal einen anderen Workshop. Daraus kann man immer unterschiedliche Sachen mitnehmen, finde ich. Und irgendwas nimmt man immer mit aus einem Workshop. Und klar, man lernt super viel in der Praxis, was man in einem Workshop überhaupt nicht abbilden kann. Und viele Sachen wie, wie gebe ich Feedback? Natürlich sollte man einmal wissen, wie es generell geht und wie man es am besten machen sollte. Aber das dann richtig zu machen, ist auch super viel Übung. was man ja nur in der Praxis üben kann, finde ich. Also diese Übungen, die man dann in den Kursen schon mal macht, die sind zwar ganz gut und ganz nett, aber da hat man es einmal gemacht und nur weil man es einmal gemacht hat, kann man es halt trotzdem noch nicht.",
            "start": 2492397,
            "end": 2539191,
            "confidence": 0.8101988304093569,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Entschuldigung, meine Obsidian-On-Call ist zu Ende. Wenn jetzt ein Incident losgeht, ich bin nicht mehr dabei.",
            "start": 2540307,
            "end": 2549089,
            "confidence": 0.6471875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe gedacht, du bist Manager, du bist noch als Manager On-Call. Aber gut, das ist ein anderes Thema.",
            "start": 2549169,
            "end": 2553650,
            "confidence": 0.5358421052631579,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kommen wir nochmal zurück zu deinem Werdegang. Du bist nach deinem ersten Teamleiter-Job, hast du die Firma gewechselt und bist dann wieder in die Rolle der Softwareentwicklerin. War das für dich ein mentaler Rückschritt?",
            "start": 2553670,
            "end": 2562512,
            "confidence": 0.7329117647058824,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Eigentlich nicht. Ich hab meinen Job als Softwareentwicklerin vorher auch super gerne gemacht und hätte auch kein Problem damit gehabt, einfach Softwareentwicklerin weiter zu sein. Und ich hätte es für mich problematisch gefunden, irgendwo als Lead anzufangen, wenn ich die Firmenkultur noch nicht kenne, wenn ich noch nicht technisch im Thema drin bin. Das kann ein persönliches Thema sein, aber das war mir eben auch wichtig, die Kollegen auch erstmal auf eine andere Art und Weise kennenlerne und nicht direkt als Vorgesetzter da reinkomme. Und dann muss ich von denen eingelernt werden in die technischen Sachen als Vorgesetzter. Das finde ich ganz schwierig. Und man kriegt dann die ganzen Probleme, die eigentlich da sind, vielleicht auch gar nicht mehr so mit, weil man ist ja dann der Vorgesetzte. Und also nee, mir war das schon wichtig als Softwareentwicklerin auch erstmal da anzufangen.",
            "start": 2562552,
            "end": 2612688,
            "confidence": 0.8095563380281688,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also würdest du wirklich sagen, dass hin- und herspringen ist gegebenenfalls sogar ein Vorteil für dich gewesen?",
            "start": 2613549,
            "end": 2618031,
            "confidence": 0.7528823529411767,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich fand's für mich schon.",
            "start": 2618391,
            "end": 2619451,
            "confidence": 0.7659999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich hab das immer so das Gefühl gehabt, wenn ich länger Engineering Manager bin, dann verliere ich immer die Sichtweise fürs Detail, weil dann fange ich mich an zu fragen, warum dauert das denn alles so lange? Diese klassischen Fragen, die jeder hat. Und ich hab auch mal den Sprung gemacht.",
            "start": 2619491,
            "end": 2632575,
            "confidence": 0.8183725490196078,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Du meinst so deinen Kontakt zur Basis. Sehr arrogante Herangehensweise.",
            "start": 2632595,
            "end": 2636657,
            "confidence": 0.6027,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ignoriere ich jetzt einfach. Auf jeden Fall habe ich mich dann auf eine andere Stelle beworben, wo ich dann wieder Hands-on war, also wirklich 100% Hands-on. Und auf einmal habe ich gemerkt, oh, diese Details, die fressen ja richtig Zeit. Und irgendwann bin ich wieder in die Managerrolle gewechselt, also einen ähnlichen Werdegang wie du. Und seitdem erinnere ich mich halt immer genau daran, so nach dem Motto, die Details, das sind die Sachen, die richtig Zeit fressen. Und ich habe so Devils Advocate mäßig gefragt, war das ein Rückschritt, weil für die meisten Leute ist das ja die Karriereleiter, die geht natürlich nur nach oben. Und man wird natürlich nur daran gebissen, wie viele Leute man unter sich hat. Deswegen finde ich es auch mal schön, solche gesunden Meinungen zu hören. Danke dafür.",
            "start": 2636677,
            "end": 2674675,
            "confidence": 0.8058814814814813,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin mir gar nicht so sicher, weil ihr habt zum Beispiel gestern bei unserem Meetup beim Engineering Kiosk Alps in Innsbruck waren sehr junge Engineering Manager, also der gerade in einem Startup Engineering Manager geworden ist. Und er hat gesagt, der Feedback Cycle fehlt ihm so beim Engineering Manager sein. Und er probiert immer, irgendwo noch technische Tasks zu machen, weil die kann er deployen, pull request, bam, erledigt, und da hat man ein Output. Also ich bin mir gar nicht sicher, ob jeder und jede das so als negativ sehen und vielleicht manchmal sogar das eigentlich zurückwünschen. Jetzt hast du die glückliche Situation, dass du immer noch hands-on sein kannst, Wünschst du dir öfters, dass du mehr Hands-on machen könntest, oder bist du zufrieden mit diesem Mix zwischen Hands-on und Engineering Manager? Und könntest du dir, vielleicht auch Zusatzfrage gleich, könntest du dir vorstellen, 100 Prozent nur People Management machen, oder muss da dieser technische Aspekt dabei sein?",
            "start": 2674715,
            "end": 2728723,
            "confidence": 0.7418812499999996,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das kommt im Moment immer auf die Themen an, die wir gerade haben. Wir haben ja als Team einfach super viele wechselnde Themengebiete. Und es gibt natürlich Themengebiete, die mich persönlich einfach viel mehr interessieren, wo ich dann manchmal sage, schade, dass ich mich jetzt da nicht 100 Prozent drauf stürzen und einarbeiten kann. Und es gibt Themengebiete, wo ich sage, da bin ich gerade froh, dass ich mich da nicht total bis in die Tiefe einarbeiten muss und derjenige sein muss, der sich da am besten mit auskennt.",
            "start": 2729078,
            "end": 2758308,
            "confidence": 0.8015274725274725,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also das Beste aus beiden Welten sozusagen.",
            "start": 2758828,
            "end": 2760969,
            "confidence": 0.8458571428571428,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich finde schon. Also ich finde es super cool, dass ich noch mitentwickeln kann. Ich merke immer wieder, dass ich noch genau gucken muss, was ich für Aufgaben mir nehme und was nicht, damit ich die anderen eben nicht blockiere. Jetzt ganz ohne Softwareentwicklung. Ich habe gehört, ich muss mich damit vielleicht abfinden, dass es irgendwann so ist. In meinem Kopf.",
            "start": 2761329,
            "end": 2779578,
            "confidence": 0.8166129032258064,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wurde dir das schon nahegelegt?",
            "start": 2780942,
            "end": 2782743,
            "confidence": 0.619,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nee, nicht nahegelegt, sondern ich soll langsam anfangen, mich damit abzuwenden, dass es vielleicht nicht für immer so sein wird. Ja, ich arbeite daran.",
            "start": 2782784,
            "end": 2792970,
            "confidence": 0.7950416666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, also wenn ich das jetzt richtig interpretiere, aktuell wärst du nicht so happy, wenn du 100% People Management hättest und gar keinen technischen Kontakt mehr.",
            "start": 2793050,
            "end": 2801536,
            "confidence": 0.6705384615384615,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, kann man so sagen.",
            "start": 2801731,
            "end": 2802992,
            "confidence": 0.6866,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist aber ein gutes Stichwort, weil da haben wir nämlich schon den ersten negativen Punkt. Was sind denn noch andere Bereiche, die du richtig hast, die dir richtig auf die Nerven gehen, die aber wirklich zum Engineering Management gehören?",
            "start": 2803032,
            "end": 2815744,
            "confidence": 0.7476,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Man hat so viele Meetings. Es ist unfassbar. Man sitzt gefühlt in jedem Meeting drin und ja, manchmal kann man sich nicht so richtig wehren. Manchmal sind die Meetings nicht so, wie man sich das wünschen würde und man hat es aber nicht so in der Hand, daran was zu ändern. Und ja, manchmal, das hängt ja auch wieder mit dem Vorherigen zusammen, denke ich mir auch, in der Zeit hätte ich schon drei Merch-Requests machen können.",
            "start": 2815764,
            "end": 2841417,
            "confidence": 0.7665714285714286,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja. Wie machst du das ganz allgemein mit dem Zeitmanagement? Oder auch wenn du zurückdenkst, wo du zum ersten Mal Lead warst, war das schwierig, irgendwie das alles unter einen Hut zu bekommen, zeitmanagementtechnisch?",
            "start": 2841657,
            "end": 2853581,
            "confidence": 0.8219411764705884,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Schon. Also es gibt Zeiten, da prasselt irgendwie alles auf einen rein. Irgendwie kurz vorher war am besten noch nichts los, da hat man sich irgendwie drei Aufgaben genommen. Die liegen jetzt bei allem rum, man hat zu allem eine Idee und hat schon mal angefangen und auf einmal kommen tausend Sachen und man kann die nicht weitermachen und da gebe ich die ab, aber ich weiß doch eigentlich schon, was ich machen will und dann kommen noch 20 Meetings dazu und auf einmal ist das alles zu viel und ja, kommt schon mal vor.",
            "start": 2853621,
            "end": 2879961,
            "confidence": 0.7971789473684213,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und hast du dieses Problem gelöst? Bist du da jetzt mittlerweile Frau über die Dinge, dass du alles managen kannst?",
            "start": 2880001,
            "end": 2886928,
            "confidence": 0.7332500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ab und zu kommt es trotzdem noch dazu, dass ich irgendwann vor meiner Aufgabenliste sitze und denke, wie ist das passiert? Und wie komme ich da jetzt wieder raus? Aber ich glaube, ich habe für mich eine Strategie gefunden, wie ich die Aufgaben dann wieder abarbeite oder loswerde oder die nach der Wichtigkeit priorisiere, den Rest für mich ausblende und die dann trotzdem abgeahlt bekomme. Es gibt ja Leute, die sehen so viele Aufgaben, dann geht auf einmal nichts mehr. Also da ist mittlerweile Augen zu und durch.",
            "start": 2887723,
            "end": 2914208,
            "confidence": 0.8258764044943818,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also du machst dann eher den Approach des Arbeitstiers.",
            "start": 2914808,
            "end": 2917169,
            "confidence": 0.3526666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Mache deswegen keine Überstunden. Also ich priorisiere, was das Wichtigste ist. Ich gucke, was ich abgeben kann und gebe das ab. Oft muss ich dann auch sagen, tut mir leid, das war nicht deine Aufgabe. Ich habe mir das genommen. Tut mir leid, dass ich das jetzt dir geben muss, weil ich es trotzdem nicht schaffe. Aber ich meine, das ist dann auch okay, finde ich.",
            "start": 2918338,
            "end": 2936795,
            "confidence": 0.8029090909090909,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und die andere Person? Ist da Verständnis vorhanden dafür?",
            "start": 2937075,
            "end": 2940799,
            "confidence": 0.8067777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Meistens kam das Verständnis schon an, ja.",
            "start": 2940839,
            "end": 2943582,
            "confidence": 0.8127142857142857,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Doch, Weil es ist ja auch oft so und eben, ich kann es jetzt nur auch wieder zitieren von diesem jungen Engineering Manager, dass man, wenn man die andere Seite auch kennenlernt und weiß, wie schwierig das ist, dann hat man natürlich den Einblick auf der Engineering Manager Seite. Aber davor denkt man sich ja nur, ja, die sitzt ja nur in Meetings rum. Jetzt ladet sie dann noch irgendwelche Tasks bei mir ab, weil sie wieder in ein anderes Meeting gehen muss oder so. Also man sieht ja oft, wenn man das selber noch nie gemacht hat, sieht man ja oft nicht, wie schwierig das ist und auch wie schwierig dieses Zeitmanagement dann auch dahinter ist.",
            "start": 2943622,
            "end": 2977528,
            "confidence": 0.8247008547008547,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich glaube, das ist Transparenz. Also ich erkläre dann immer, wie es dazu gekommen ist, wieso ich mir diese Aufgabe genommen habe, warum ich dann da zu dem Zeitpunkt dachte, ich schaffe das, was zwischenzeitlich jetzt plötzlich passiert ist, warum ich das nicht mehr machen kann. Das liegt ja dann, wenn es soweit kommt, meistens gar nicht in meiner Hand. Das kommt dann irgendwie von der Seite oder von oben oder von irgendwo anders her. Und ich glaube, wenn man da transparent ist, ist das in Ordnung.",
            "start": 2977913,
            "end": 3002625,
            "confidence": 0.8191363636363636,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und du schaffst es in deinen, keine Ahnung, 40 Stunden oder was du halt offiziell an Vollzeitarbeitszeit hast, kommst du eigentlich gut durch? Also du machst keine Überstunden, wenn ich das richtig verstanden habe.",
            "start": 3003385,
            "end": 3015097,
            "confidence": 0.726735294117647,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, genau. Also mal irgendwie eine Viertelstunde länger oder sowas, weil man gerade vertieft irgendwo dran sitzt, klar. Aber jetzt nicht, dass ich jetzt eine 50-Stunden-Woche klappen würde oder so.",
            "start": 3015137,
            "end": 3025208,
            "confidence": 0.7309,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Immer wenn ich höre, dass jemand so eine lange To-Do-Liste hat, frage ich mich immer, sind das denn alles wichtige Aufgaben, die überhaupt gemacht werden sollten? Oder kann man da nicht einfach 50 Prozent einfach in die Mülltonne schmeißen und wird niemand mehr nachschreien?",
            "start": 3026115,
            "end": 3038999,
            "confidence": 0.8130909090909092,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, manchmal ist das so. Aber wenn die dann da rumliegen und man hat noch eine kurze To-Do-Liste und man arbeitet die wichtigsten Sachen ab, dann sind die erst mal da drin. Und erst wenn die To-Do-Liste dann so lang ist, sagt man, so, jetzt kommen die weg. Reicht's mir aber.",
            "start": 3039419,
            "end": 3050703,
            "confidence": 0.746862745098039,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vielleicht sollte ich einfach jeden Tag meine To-Do-Liste einfach um die Hälfte kürzen und mal schauen, was passiert.",
            "start": 3050763,
            "end": 3054984,
            "confidence": 0.808,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Verwendest du da eigentlich irgendwelche Tools, um deine To-Dos zu managen oder Ticketsystem oder keine Ahnung?",
            "start": 3056113,
            "end": 3063000,
            "confidence": 0.7284999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir nutzen ja unsere eigene Software, auch um unsere Aufgaben zu verwalten und das verwende ich dann eben entsprechend auch.",
            "start": 3063040,
            "end": 3071749,
            "confidence": 0.81745,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber auch für deine kleinen Tasks jetzt, die du persönlich hast?",
            "start": 3071769,
            "end": 3075053,
            "confidence": 0.7732727272727274,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also wenn das so ganz kleine sind, die im One-on-One aufkommen, wo ich weiß, da lohnt es sich gar nicht mal ein Ticket für zu erstellen. Ich bin ein großer Fan tatsächlich noch von Stift und Papier und habe das immer noch mal neben mir liegen für so Kleinigkeiten. Die mache ich dann auch sofort und andere Sachen lege ich mir in der Aufgabe an, wenn es größere Sachen sind.",
            "start": 3075697,
            "end": 3094383,
            "confidence": 0.7686478873239435,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Bedeutet das aber, dass deine Teammitglieder Transparenz haben, was du den ganzen Tag so machst?",
            "start": 3094403,
            "end": 3098685,
            "confidence": 0.7594666666666665,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, die können sich jederzeit angucken, auf welche Aufgabe ich gerade checke. Außer das ist jetzt irgendwas total Besonderes, Privates.",
            "start": 3099181,
            "end": 3105624,
            "confidence": 0.76535,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Weil das ist ja auch so ein Punkt, der sehr, sehr oft angesprochen wird. Teammitglieder wissen gar nicht, was die Vorgesetzten so den ganzen Tag machen. Und dann geht's immer darum, ja, du sollst mehr transparent darstellen, wieso du einen Tag hast, damit die anderen Leute auch mal wissen, was du tust. Aber das ist ja eine super Lösung, die du da ausgegraben hast.",
            "start": 3105664,
            "end": 3122093,
            "confidence": 0.71653125,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, also unser Kalender ist öffentlich, das heißt, jeder kann sich angucken, was ich für Termine habe, mit wem die sind, Notizen, jeder die Agenda beschreiben, jeder kann sich meine Aufgabenliste angucken, wenn er möchte.",
            "start": 3122238,
            "end": 3134631,
            "confidence": 0.8008285714285717,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Finde ich auf jeden Fall sehr impressive und die hätte jetzt eine kleine Hypothese, vielleicht kannst du mir beantworten, ob die stimmt. Ich bin immer sehr beeindruckt von Eltern, was die alles unter einen Hut bringen, organisationstechnisch. Und ich kenne natürlich auch ganz viele Engineering Manager und auch von mir persönlich, dass es grundsätzlich schon sehr schwierig ist, dieses ganze Zeitmanagement. Und das ist, was eigentlich bei den meisten auch so das größte Problem darstellt, wenn sie neu in diese Rolle kommen. Jetzt habe ich bei dir irgendwie rausgehört, das war eigentlich nie so extremes Problem. Und du hast ja auch Kinder. Glaubst du, dass das in irgendeiner Form zusammenhängt?",
            "start": 3134671,
            "end": 3168711,
            "confidence": 0.7404545454545455,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das kann schon sein.",
            "start": 3168751,
            "end": 3169632,
            "confidence": 0.31575,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch in Bezug auf Priorisierung, weil meine Elternkontakte sind teilweise auch sehr hart im Priorisieren. Und vielleicht lernt man das dann noch härter als Eltern.",
            "start": 3170079,
            "end": 3178441,
            "confidence": 0.7979999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das kann schon sein. Also ich glaube, dass generell bin ich ein ziemlich strukturierter und organisierter Mensch. Was vielleicht dazu führt überhaupt auch erst, dass ich den Job und die Kinder so gut unter einen Hut bekomme. Aber ich glaube, dass da auch noch, sobald die da sind, muss man ja noch mehr dann unter allen Mut bekommen und sich organisieren und strukturieren. Ich finde das immer witzig, wenn Leute sagen, ja, aber jetzt musst du doch jetzt noch nicht planen. Doch, doch, doch, ich muss das jetzt planen.",
            "start": 3178621,
            "end": 3208312,
            "confidence": 0.7903666666666664,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt die alte Firma, die du ja auch erwähnt hast, die ja vielleicht ein bisschen konventioneller oder konservativer war, wenn ich das jetzt so richtig rausgehört habe, hat es da auch irgendwo Unterschiede gegeben bezüglich Flexibilität und Arbeitszeiten und vielleicht auch mit Kindern oder Vereinbarkeit grundsätzlich?",
            "start": 3209513,
            "end": 3227201,
            "confidence": 0.8033695652173912,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also tatsächlich war auch da, obwohl die sehr konservativ waren, immer das Thema mit Kindern, wenn man mal früher gehen muss oder später anfängt, ist es vollkommen in Ordnung. Also man sollte natürlich zu den Meetings da sein, aber ansonsten Und nicht nachts arbeiten und solche Sachen. Aber ansonsten war man da schon relativ frei. Tatsächlich hatte die Firma sogar einen Betriebskindergarten.",
            "start": 3227241,
            "end": 3252969,
            "confidence": 0.7800000000000004,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist der Vorteil bei klassischen größeren Firmen. Die Strukturen diesbezüglich sind teilweise sehr, sehr gut.",
            "start": 3253009,
            "end": 3259792,
            "confidence": 0.7879999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hattest du gerade von dieser langen To-Do-Liste gesprochen. Und da kam mir die Frage, wie wichtig findest du es, im täglichen Job Nein zu sagen? Also wie wichtig ist es, anderen Leuten auch Grenzen zu setzen, dass sie nicht alles auf deinem Tisch abladen und dass deren Problem gegebenenfalls nicht dein Problem ist. Und die zweite Frage ist, wie gut bist du darin?",
            "start": 3259812,
            "end": 3284040,
            "confidence": 0.8496718749999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also ich finde es super wichtig, weil sonst mache ich ja alle Aufgaben von allen. Und das geht natürlich nicht. Es ist ja keine One-Man-Show. Es ist ja im Gegenteil. Mein Job ist ja eigentlich, mein Team zu befähigen, die Aufgaben zu machen. Was ja heißt, also ich finde, nein ist immer so hart. Wenn natürlich jemand mit einem Problem zu mir kommt, kann ich natürlich sagen, nö, mache ich nicht, befasse ich mich nicht mit, finde ich das der falsche Weg. Ich bin ja da, ich kann helfen, dass der das Problem selber lösen kann und das im besten Fall demnächst auch selber lösen kann. Aber das sollte auf keinen Fall auf meinem Schreibtisch liegen bleiben. Ich glaub selber, nein, in dem Sinne zu sagen, das bleibt nicht auf meinem Schreibtisch liegen, glaub, das kann ich gut. Ich glaub, das Problem ist eher, zu erkennen, wann jemand ... ganz geschickt hintenrum mir ein Problem auf dem Schreibtisch legt, wo ich eigentlich dazwischen schreiten muss und sagen muss, halt, Moment, das ist eigentlich gar nicht mein Problem. Ich helfe dir gerne, das selber zu lösen.",
            "start": 3284682,
            "end": 3343292,
            "confidence": 0.797362162162162,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber da helfen ja dann auch ganz gut gesetzte Erwartungen, so nach dem Motto, was ist eigentlich dein Problembereich und wofür bist du eigentlich verantwortlich? Also ich meine, es gibt immer so ein Sprichwort, you don't make friends in Silicon Valley. Und das bezieht sich eigentlich genau darauf, dass sich jeder nur um sich kümmert und dann jeder nur für seine Promotion, für seine Beförderung arbeitet und dann niemandem mehr hilft. Das ist vielleicht das eine Extrem. Jetzt reden wir natürlich auch über das andere Extrem, dass du eigentlich nur den ganzen Tag jemanden anderem hilfst, weil du halt so freundlich bist, vielleicht weil du auch einfach super produktiv bist, wer weiß das denn schon. Aber ich sag mal, einen gesunden Mittelweg zu finden ist halt auch schwierig, weil im Endeffekt, besonders wenn man dann zu Feedback-Mechanismen wie 360-Grad-Feedback rüber schielt, dann kann es ja auch schnell bedeuten, uh, die Isabel, die hilft mir nie, das ist jetzt ganz schlecht. Welche Feedback-Zyklen habt ihr so? Also wie wirst du zum Beispiel bewertet? Wirst du auch von deinen Peers bewertet?",
            "start": 3343795,
            "end": 3398629,
            "confidence": 0.8007709497206706,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, also von meinen Peers werde ich nicht bewertet. Es ist mehr, wir haben so ein gemeinsames Team-Manager-Retro, wo dann eben schon mal kommt, unsere Arbeit für Probleme in anderen Teams geführt hat oder sowas, was ich dann natürlich als Feedback zurückbekomme. Wo ich dann überlegen muss, habe ich da mein Team falsch geleitet? Hätte ich da als Teammanagerin die Sachen anders angehen müssen? Ansonsten, ich meine von Teammitgliedern ist es immer schwierig, ob man da jetzt eine ehrliche Meinung bekommt oder nicht. Ich hoffe, dass wir vertrauensvolles Umfeld bei uns geschaffen haben, dass ich ehrliches Feedback bekomme vom Rest meines Teams. Ja, ansonsten von meinem Manager natürlich immer.",
            "start": 3399010,
            "end": 3443845,
            "confidence": 0.8179174311926605,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber es ist immer nur direktes Feedback? Also ihr habt jetzt kein anonymes Feedback-Tool oder solche Dinge?",
            "start": 3443885,
            "end": 3449030,
            "confidence": 0.6965882352941177,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, sonst haben wir nicht.",
            "start": 3449292,
            "end": 3450552,
            "confidence": 0.2746,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt hast du gerade schon das vertrauensvolle Verhältnis angesprochen und Management auf dem Happy Pass macht natürlich immer super viel Spaß, weil dann alles immer rund läuft, aber es gibt ja auch unschöne Momente. Wo holst du dir denn Hilfe oder Support, wenn du jetzt mal sagst, jetzt habe ich aber hier eine Situation, ich habe keine Ahnung, wie ich die bewältigen soll, da brauche ich mal wen, da braucht man eine zweite Meinung oder ähnliches?",
            "start": 3450592,
            "end": 3471780,
            "confidence": 0.7366315789473689,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Du darfst jetzt auch sagen, dass du unseren Podcast dafür hast.",
            "start": 3472450,
            "end": 3477333,
            "confidence": 0.6137272727272727,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Stimmt ja auch. Also wenn es wirklich ein ganz konkreter Fall ist, ich habe auf jeden Fall meinen Direktor, Chef, also meinen Manager, hat mir das angeboten, dass er quasi als mein Mentor fungiert und ich mit solchen Sachen immer zu ihm kommen kann. Ich brauche auch keine Namen nennen, ich kann es ja anonymisiert mit ihm auch besprechen. Wobei meistens kennt er die Leute auch und sagt dann, der ist was. Aber da ist auf jeden Fall die Möglichkeit da. Das mache ich auch öfters, weil er einfach sehr viel Erfahrung mitbringt auf dem Bereich und die meisten Situationen einfach schon erlebt hat und da aus seinem Erfahrungsschatz mir gute Ratschläge geben kann. Ansonsten ist auch vor kurzem einer aus meinem Team, Der selbst vor kurzem in meinem Team Teammanager geworden ist, also jetzt ein Peer. Das heißt, der kennt auch mein Team, wie es bis dahin war und kennt auch die Teamdynamik. Das heißt, da ist es auch immer cool, wenn man da sich noch mal austauschen kann und er dann noch mal Ratschläge gibt.",
            "start": 3477373,
            "end": 3533285,
            "confidence": 0.7751129943502825,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also eigentlich wie so eine kleine Peer-Coaching-Gruppe.",
            "start": 3533305,
            "end": 3535226,
            "confidence": 0.7185714285714286,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja.",
            "start": 3535766,
            "end": 3536166,
            "confidence": 0.698,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kommen wir mal zu deinen Tipps beziehungsweise zu deinen Warnungen. Wem würdest du denn nicht empfehlen, in die Engineering-Manager-Rolle zu gehen?",
            "start": 3536186,
            "end": 3546371,
            "confidence": 0.7927142857142856,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Moment, Andi, du sagst immer, wir müssen positiv sein und wir müssen die Leute motivieren. Jetzt kommst du mit dem Negativen.",
            "start": 3546793,
            "end": 3552799,
            "confidence": 0.7502380952380951,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich bin für mehr Realismus in Social Media und bei den Content Creatern. Und wir sind ja auch Content Creator. Deswegen, wir sind zwar nicht auf Instagram oder TikTok mit irgendwelchen Filtern, denn im Ruhrgebiet spricht man ungefiltert. Deswegen, für wen ist die ganze Sache denn eigentlich mal nix?",
            "start": 3552819,
            "end": 3567794,
            "confidence": 0.7951224489795918,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also wenn ich ein Softwareentwickler bin, der mit seinem ganzen Herzblut am Code und am Coden hängt und eigentlich sagt, ach, mit diesen Menschen möchte ich gar nichts zu tun haben, mein Computer und ich, wir machen das schon, dann vielleicht lieber nicht.",
            "start": 3568708,
            "end": 3584928,
            "confidence": 0.8406511627906977,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Glaubst du, man kann sowas auch lernen?",
            "start": 3584968,
            "end": 3586730,
            "confidence": 0.6495714285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Zu einem gewissen Grad würde ich sagen schon, aber es wird immer, glaube ich, eine Aufgabe bleiben, die man nicht gerne macht. Und da die einen so großen Teil einfach einnimmt von dem Job, möchte man auch nicht einen Job machen, den man eigentlich nicht gerne macht. Weil davon abgesehen bin ich immer dafür, eher Stärken hervorzuheben und zu stärken und Schwächen nur bis zu einem, damit kann man arbeiten, Level zu bringen. Also es behindert mich nicht mehr, weil in einer Schwäche werde ich ja niemals so gut werden wie jemand anderes, der es als Stärke hat. Warum sollte ich mich da so krass weiterentwickeln?",
            "start": 3587135,
            "end": 3619780,
            "confidence": 0.8125094339622644,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Welche Entscheidungshilfen würdest du den Leuten an die Hand geben, die sich jetzt überlegen, ich bin jetzt gerade Softwareentwickler, Softwareentwicklerin und würde gerne mal den Sprung zur Engineeringmanagerin wagen. Was würdest du den Leuten raten, worüber die sich wirklich, wirklich Gedanken machen sollten?",
            "start": 3620267,
            "end": 3636143,
            "confidence": 0.8117441860465117,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Komme ich damit klar, wenn ich ein, zwei Tage mal keinen Code sehe? Komme ich damit klar, wenn ich jeden Tag sieben meiner acht Stunden mit anderen Menschen kommunizieren muss? Wenn ich Probleme lösen muss? Wie sehr kann ich selber auch mit Kritik umgehen und schwierigen Situationen?",
            "start": 3636775,
            "end": 3654961,
            "confidence": 0.861468085106383,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du hattest Kommunikation angesprochen. Denkst du, introvertierte Leute haben es schwieriger, in der Rolle erfolgreich zu sein als extrovertierte Leute?",
            "start": 3655001,
            "end": 3662184,
            "confidence": 0.7445499999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Würde ich, glaube ich, gar nicht so direkt sagen. Also ich weiß nicht mal, ob ich mich selbst als extrovertiert beschreiben würde. Ich glaube, man muss als Teammanager nicht jemand sein, der sich vor 20 Leute stellt und vor denen den Affen macht oder da irgendwie denen was erzählt. Derjenige muss man nicht sein. Es ist ja wichtig, dass man mit den Einzelnen im Gespräch vernünftig sich präsentieren kann und die Kommunikation fühlen kann und deswegen Würde ich behaupten, dass die meisten Situationen, die man als Teammanager meistern muss oder die ich bisher hatte, waren in 1 zu 1 oder 1 zu 2 Situationen, wo ich sagen würde, introvertierter Mensch kommt damit vielleicht auch klar.",
            "start": 3663012,
            "end": 3701635,
            "confidence": 0.8101652173913041,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich möchte mich gleich für diese Schubladenfrage von meinem Co-Host entschuldigen. Es gibt ja auch extrem viele Beispiele von introvertierten Leads. Und Andis Lieblingslead, der Simon Sinek, sagt ja auch immer, er selber ist introvertiert. Also ich könnte mir das auch vorstellen, dass das gar nicht schlecht ist, vielleicht sogar introvertiert zu sein. Ich glaube, es gibt beides. Also meiner Meinung nach ist das auch weder das eine noch das andere ein Hindernis, ganz klar.",
            "start": 3702137,
            "end": 3729886,
            "confidence": 0.8095466666666665,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube auch, es kommt darauf an, was man für ein Team übernimmt. Natürlich, wenn mir jemand sagt, du musst jetzt ganz plakativ mal ein Team von Salespersonen leiten, also ich glaube, das würde ich auch nicht machen wollen, weil die vom Typ einfach meistens eher extrovertiert sind und damit ganz anders als ich. Da würde ich mich schwerer mit tun als mit meinem Entwickler.",
            "start": 3731088,
            "end": 3751295,
            "confidence": 0.7957230769230769,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Jetzt ist es ja natürlich bei der Softwareentwicklung so, dass Bugs unvermeidlich sind. Und bei den Führungen von Menschen sehe ich das ähnlich. Fehler werden gemacht. Was ist denn der größte Fehler, den du bisher im Management oder im Leadership gemacht hast? Und wir grinsen jetzt in dem Podcast, was eigentlich total falsch ist, muss man ja so sagen, weil wir reden ja mit Menschen und wir sprechen ja über Menschen. Aber irgendwie grinsen wir gerade, weil wir.",
            "start": 3752156,
            "end": 3773451,
            "confidence": 0.7889743589743591,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wissen auch, fuck, da Ich glaube tatsächlich, in der Firma, wo ich vorher war, ich war ja noch sehr unerfahren und ich habe vielleicht nicht so gut mit meinem Chef kommuniziert und wollte viel mit dem Kopf durch die Wand. Also ich hatte da meine Pläne und Ideen und ich wusste, so wie es gerade ist, so geht es nicht weiter. Und das, was ich will, ist auf jeden Fall besser. Und ich habe das nicht strategisch gut platziert und vorbereitet, weshalb es dann auch gescheitert ist am Ende.",
            "start": 3773471,
            "end": 3801506,
            "confidence": 0.8120337078651688,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Glaubst du, dass das allgemein wichtig ist, dass man da irgendwie besser damit umgehen kann, wenn andere Entscheidungen getroffen werden oder eben andere Menschen deines Teams auch die Entscheidung trifft, dass man da als Lead dann irgendwie, obwohl man innerlich vielleicht ganz was anderes machen will, dass man da dann irgendwie trotzdem damit leben muss, dass das wichtig ist in dieser Rolle? Oder hast du das geändert, die Herangehensweise diesbezüglich, wenn es um andere Meinungen, andere Entscheidungen auch gegangen ist?",
            "start": 3802845,
            "end": 3829397,
            "confidence": 0.8130875000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also, ich finde, wenn wir im Team was entscheiden, was mir immer wichtig ist, dass ich das Warum wissen möchte, dass ich das verstehen möchte, warum diese Entscheidung getroffen wurde oder die bessere ist. Und dann komme ich damit auch klar, was ich schwierig finde, ist, wenn eine Entscheidung kommt ohne Begründung, boah, das ist jetzt so. Also, da tue ich mich auch immer noch schwer mit, klar. Wenn das von oben kommt, muss man das akzeptieren. Aber ich würde schon versuchen, nachzufragen, um die Hintergründe zu verstehen. Wenn da nichts kommt und ich kann da nichts mehr rauskitzeln, dann muss ich mich damit abfinden. Kann man nicht mehr machen.",
            "start": 3829838,
            "end": 3867683,
            "confidence": 0.8199363636363638,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Vielen lieben Dank Isabel und herzlich willkommen in unserer Echo-Kammer. Du joinst somit den Kreis der Leute, die sagen, wir machen alles richtig hier. Wahnsinn. Nein, es war unglaublich interessant, mal deine Sichtweise auf Engineering Management zu sehen und auch die Unterschiede und auch neue Erfahrungen, die Wolfgang und ich einfach nicht haben. Zum Beispiel keine One-on-ones. Ich mal mir grad wirklich aus, wie ist das, arbeiten in einer Firma ohne.",
            "start": 3868442,
            "end": 3895061,
            "confidence": 0.8080281690140846,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Sowas, aber... Ich hab lang an der Uni gearbeitet, ich kenn das. Da kommuniziert niemand miteinander. Das ist noch schlimmer als in Firmen.",
            "start": 3895081,
            "end": 3902267,
            "confidence": 0.6809130434782609,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich schüttel grad nur den Kopf, aber nun gut. Ich kann mir aber auch gut vorstellen, dass das immer noch gang und gäbe ist in vielen deutschen, österreichischen oder Schweizer Firmen. Hast du noch irgendetwas, was du unseren Hörerinnen und Hörern mit auf den Weg geben möchtest?",
            "start": 3902567,
            "end": 3916678,
            "confidence": 0.8327446808510638,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Falls du einen Pro-Tipp hast für Leeds noch, kannst du den auch gerne unterbringen.",
            "start": 3916698,
            "end": 3921162,
            "confidence": 0.5207857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, für einen Pro-Tipp bin ich noch nicht pro genug.",
            "start": 3921803,
            "end": 3923524,
            "confidence": 0.7170000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das Imposter-Syndrom kickt rein.",
            "start": 3925045,
            "end": 3927127,
            "confidence": 0.49724999999999997,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau.",
            "start": 3927147,
            "end": 3927407,
            "confidence": 0.823,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also, wenn, würde ich sagen, wenn ihr die Möglichkeit bekommt, so einen Job mal auszuprobieren, einfach mal machen. Man kann ja immer noch später sagen, das ist es nicht. Wenn man messenvoll ist in der Firma, wo das kein Problem ist, noch mal die Rolle zu wechseln, wenn man merkt, das ist nicht der Job, den man machen möchte, einfach ausprobieren.",
            "start": 3929888,
            "end": 3948961,
            "confidence": 0.8257540983606556,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist ein sehr guter Tipp. Gefällt mir.",
            "start": 3949001,
            "end": 3950582,
            "confidence": 0.4781428571428572,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was würdest du den Leuten empfehlen? Wie lange sollten die die Rolle ausprobieren?",
            "start": 3951048,
            "end": 3954012,
            "confidence": 0.7485384615384615,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Würde ich sagen, bestimmt halbes Jahr, Jahr. Weil der Feedbackzyklus als Manager ja einfach viel, viel, viel länger ist. Und bis man da erst das Feedback bekommt, ob man das gut macht, ob man das nicht gut macht, bis man sich überhaupt mal eingefunden hat in diesem Job.",
            "start": 3954032,
            "end": 3968292,
            "confidence": 0.8440625,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dann beenden wir mal mit diesem sehr schönen Gedanken, probiert es einfach mal aus. Vielen Dank Isabel für die ganzen Insights, auch obwohl du gar nicht so lange Engineering Managerin bist, aber doch extrem viel schon erlebt hast und das Ganze auch aus verschiedenen Blickwinkeln beobachten hast können, was auch sehr spannend war. Du bist ja auch bei uns in der Discord-Community, also wenn also irgendwer noch Fragen hat, gerne bei uns in der Discord-Community mal vorbeischauen. Ich hoffe, du bist da auch da, um vielleicht ein paar Antworten zu geben, wenn sich irgendjemand noch interessiert für Details oder gute Tipps oder auch andere Fragen, wie es denn so ist als Engineering-Managerin. Und falls jemand mit dir arbeiten will, habt ihr eigentlich offene Stellen oder du gerade im Team?",
            "start": 3968652,
            "end": 4011766,
            "confidence": 0.819209302325581,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe gehört, ich in meinem Team aktuell leider nicht, aber generell in der Entwicklung oder auch bei unseren Admins haben wir immer offene Stellen.",
            "start": 4011806,
            "end": 4021072,
            "confidence": 0.7576399999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dann entlassen wir dich jetzt auch in den Feierabend, Isabel. Vielen lieben Dank für deine Zeit und für deine Mühen und ich hoffe bis zum nächsten 4STEM Community Treffen in Belgien.",
            "start": 4021092,
            "end": 4029017,
            "confidence": 0.768290322580645,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Auf jeden Fall. Dankeschön für die Einladung.",
            "start": 4029077,
            "end": 4031278,
            "confidence": 0.6459999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da geht das nächste Bier, Kaffee, Cocktail oder was weiß ich nicht dann mal auf uns. Vielen lieben Dank und ich würde sagen bis später und tschüss, bye bye.",
            "start": 4031953,
            "end": 4040564,
            "confidence": 0.6697241379310345,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Danke, tschau.",
            "start": 4040604,
            "end": 4041725,
            "confidence": 0.477,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Tschüss.",
            "start": 4041765,
            "end": 4045750,
            "confidence": 0.556,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und nicht vergessen, schau auf dem Trivago Techbook vorbei unter tech.trivago.com slash em. Viel Spaß beim Lesen.",
            "start": 4045790,
            "end": 4051637,
            "confidence": 0.6895882352941176,
            "channel": null,
            "speaker": "C"
        }
    ],
    "confidence": 0.7879700896495445,
    "audio_duration": 4052.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}