{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/211295fe-9079-453f-a2b0-2efed15cf6e6/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62z4vdg07i-4e41-421c-b496-5a2661ddba43",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Willkommen zu einer neuen Episode vom Engineering Kiosk, deinem deutschsprachigen Software Engineering Podcast. In welchem Licht steht bei dir eigentlich die Personalabteilung? Als strategischer Partner auf Augenhöhe oder ist es dein Feind und Blocker? Für viele ist die Personalabteilung ein notwendiges Übel. Dennoch kann die HR auch ein Team sein, welches dir eine Menge Arbeit abnimmt und neue Möglichkeiten eröffnet. Heute sprechen wir mit Patrick Kuster, einem Personaler, der die letzten 11 Jahre den Wandel der Personalabteilung mitgestaltet hat. Wir sprechen mit ihm über Lebensläufe und Recruiting, künstliche Intelligenz im Kandidatenauswahlprozess, Jobbenefits wie unbegrenzten Urlaub, sowie deine Möglichkeiten und Rechte auf Arbeitszeitverkürzung durch Teilzeit, mit einem Sabbatical eine Auszeit nehmen oder Bildungsurlaub. Wir springen direkt rein. Viel Spaß. Diese Podcast-Aufsage startet schon wunderbar. Zwei ITler sitzen remote mit einem Personaler. Und bei wem klappt mal wieder die Technik überhaupt nicht? Beim Personaler. Wahnsinn. Wie stereotypenhaft können wir werden?",
            "start": 4788,
            "end": 64550,
            "confidence": 0.8272567567567568,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie soll es auch anders sein? Mehr kann ich nicht dazu sagen.",
            "start": 65471,
            "end": 68292,
            "confidence": 0.38716666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gut. So, darf ich starten? Oder war das jetzt schon dein Intro, Andi?",
            "start": 68332,
            "end": 72833,
            "confidence": 0.6683846153846154,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich finde, das ist ein super Intro. Du kannst direkt von hier aus weitermachen.",
            "start": 72853,
            "end": 75194,
            "confidence": 0.6456428571428571,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aber vielleicht als kurze Erklärung, warum wir mit einem Personaler, ist übrigens ein schreckliches Wort, Personaler zusammensitzen, aber jemandem, der eine wirkliche Ahnung hat in diesem Bereich. Und zwar ist der Hintergrund, dass wir in unserer Community eine Frage gestellt bekommen haben, ob wir da mal helfen können in einem HR-Bereich. Es ist um Bildungsurlaub gegangen und nachdem wir natürlich überhaupt keine Ahnung haben, haben wir, wie wir es so immer machen, wenn wir keine Ahnung haben, und einfach mal überlegt, wer uns da helfen kann. Und wir haben zurück überlegt, wer könnte uns da behilflich sein. Und zu unserer Zeit bei Trivago, da hatten wir ja mit Hypergrowth und extrem vielen Leuten, Hiren, Recruiten, viele Interviews, eigentlich eine Person immer an der Hand, und zwar Andi und ich, die gleiche Person. Und das war der Patrick. Das war unser Partner in Crime sozusagen, der uns von der HR-Seite zur Seite gestanden ist. Und da haben wir gedacht, okay, wir holen uns den Patrick, weil der kann uns wirklich mal verraten, was da hinter den Kulissen abläuft und uns Techies vielleicht mal erklären kann, was denn eigentlich HR bedeutet und vielleicht uns da mal auch einen Einblick geben, damit wir verstehen, warum denn die HR so arbeitet, wie sie arbeitet. Denn ganz ehrlich, wenn man mit Techies spricht, dann sehen die meisten so die HR-Seite als die Fine-Seite an. Und genau das wollen wir mal adressieren und da vielleicht ein paar Einblicke bekommen. Und wenn ich mich auch so zurück erinnere, ich bin einmal neben Patrick gesessen, wie er mit der Ausländerbehörde telefoniert hat. Und da habe ich mir schon gedacht, das ist ein Job, da musst du sehr viel Kompetenzen vereinen, von sozialen Kompetenzen. rechtlichen Kompetenzen, viel Wissen in dem Bereich haben und das Ganze dann bündeln, damit so ein Telefonat funktioniert. Und da habe ich mir dann schon gedacht, Hut ab, das ist ein Job, den ich als Techie vielleicht nicht machen sollte oder kann. Willkommen, Patrick.",
            "start": 75532,
            "end": 184318,
            "confidence": 0.827036474164134,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Vielen Dank. Schön, dass ich heute dabei sein darf. Ich freue mich sehr und bin sehr gespannt, was mich heute bei euch erwartet.",
            "start": 185249,
            "end": 192755,
            "confidence": 0.8161739130434782,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Lieber Patrick, du wohnst im schönen Düsseldorf. Du hast deine Ausbildung zum Industriekaufmann bei einem Düsseldorfer Traditionsunternehmen gemacht, nämlich bei Henkel. Ich glaube unter anderem bekannt für Waschmittel, wenn ich mich recht erinnere. Korrekt nach deiner ausbildung bist du sofort nach trivago gegangen das war im jahr 2012 und war es dann ganze sieben jahre lang in der personalabteilung bei trivago die dann unter anderem talents und culture hieß so viel ich mich erinnern kann dort warst du dann unter anderem als take recruiter und. Sogenannter Business Partner für den Bereich Software Engineering tätig da haben wir uns dann auch kennengelernt und du hast uns natürlich dann vom Recruiting bis teilweise zum Offboarding von Leuten wenn die Karrierewege sich getrennt haben begleitet.",
            "start": 192795,
            "end": 236081,
            "confidence": 0.8303852459016396,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Inklusive unserem eigenen Offboarding dann von Trivago quasi.",
            "start": 236121,
            "end": 239742,
            "confidence": 0.767,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "In der Tat in der Tat. Aber in den letzten viereinhalb jahren sammelst du flugmeilen als hr manager beziehungsweise als human resource business partner bei eurowings digital in der feindlichen stadt köln ist das richtig.",
            "start": 239782,
            "end": 253415,
            "confidence": 0.8374857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist richtig das hast du wunderbar zusammengefasst.",
            "start": 253435,
            "end": 256178,
            "confidence": 0.7512500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie viel flugmeilen hast du schon.",
            "start": 256197,
            "end": 257519,
            "confidence": 0.7631666666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Boah, das ist eine sehr, sehr gute Frage. Müsste ich mal in mein Miles-and-More-Konto reingucken. Tatsächlich sind es gar nicht ganz so viele, muss ich mal dazu sagen, weil die Flüge, die ich hier als Mitarbeiter natürlich mache, sei es irgendwie dienstlich oder mit Mitarbeitervergünstigungen, nicht auf mein Miles-and-More-Konto angerechnet werden.",
            "start": 257740,
            "end": 277011,
            "confidence": 0.7775686274509807,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sind die Flugmeilen der Obstkopf von Eurowings?",
            "start": 277471,
            "end": 280353,
            "confidence": 0.46742857142857147,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nein, mit Sicherheit nicht. Da haben wir ganz, ganz andere Benefits im Angebot. Also ich würde es jetzt nicht als den Obstkorb von Eurowings bezeichnen, aber es ist natürlich ein sehr, sehr attraktives Goodie, was ich nicht vermissen möchte, sagen wir es mal so.",
            "start": 281050,
            "end": 295617,
            "confidence": 0.7746363636363637,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber Eurowings Digital ist also wirklich eine reine Tech-Tochterfirma. Also du bist ja den Techies treu geblieben sozusagen.",
            "start": 296699,
            "end": 304543,
            "confidence": 0.7730555555555556,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau bin ich. Also Eurowings Digital ist eine Eurowings-Gesellschaft innerhalb der Eurowings-Gruppe. Und wir sind 2018 im Oktober gegründet worden und kümmern uns schwerpunktmäßig um die Eurowings-Webseite, aber auch um die mobilen Applikationen für Android und iOS. Das komplette Tech-Geschäft für die Website und für die App läuft über uns.",
            "start": 304583,
            "end": 324812,
            "confidence": 0.8311,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und oben drüber eure mutter ist die.",
            "start": 325092,
            "end": 327654,
            "confidence": 0.3048571428571429,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Lufthansa ist richtig genau also unsere eigene muttergesellschaft zugesehen ist die eurowings aviation und die eurowings aviation als fluggesellschaft innerhalb der lufthansa gruppe gehört dann quasi zur lufthansa mit rein und deswegen ist die lufthansa unsere übergeordnete mutter wenn du so sehen möchtest.",
            "start": 327674,
            "end": 342526,
            "confidence": 0.779860465116279,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also hast du in einem Konzern gelernt bei Henkel, bist dann zu einem mehr oder weniger damaligen Start-up gegangen, 2012 konnte man Trivago glaube ich noch als Start-up bezeichnen, und jetzt bist du wieder bei einem Großkonzern.",
            "start": 342943,
            "end": 354810,
            "confidence": 0.7951621621621622,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau. Ja, also man kann es so ein bisschen so sehen, aber ich würde es jetzt nicht zu 100% so sehen. Auf der einen Seite ja, ich bin im Traditionskonzern beruflich groß geworden, als ich meine Ausbildung bei Henkel gemacht habe. und bin jetzt zurück in die Konzernstrukturen der Lufthansa-Gruppe gegangen. Nichtsdestotrotz sind wir bei der Eurowings Digital sehr eigenständig, sehr selbstständig und können da sehr, sehr frei agieren, was nicht unbedingt, zumindest mit meinen eigenen Erfahrungen aus dem Konzern, sich immer deckt, sagen wir es mal so.",
            "start": 354850,
            "end": 388008,
            "confidence": 0.7655795454545451,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Springen wir mal direkt in meine lieblingsfrage und zwar wenn ich mir den bereich wo du arbeitest immer so ansehen heißt es auf deutsch personalabteilung auf englisch heißt es human resources und wir gehen ja so noch weiter wenn man nämlich von resource planung spricht dann spricht man auch meist von enterprise resource planning also erp systemen aber unten drunter sprechen wir immer von menschen und ich habe so ein persönliches Was soll das denn, Gefühl, wenn wir jetzt von Menschen und Ressourcen sprechen? Und jetzt bewegt sich ja alles so in die moderne Richtung, jetzt mal Richtung Obstkorb und Gen Z, die ein bisschen mehr vom Leben wollen und nicht nur von 9 to 5 arbeiten wollen. Also wirklich, wir wollen jetzt etwas machen, wo wir die Welt verändern. Und wenn ich mir die Welt so ansehe, geht alles weg von dem Begriff, Menschen sind Ressourcen. Wie siehst du das aktuell und wann versteht die Industrie, dass man Human Resources vielleicht nicht mehr Human Resources nennen sollte?",
            "start": 388388,
            "end": 441635,
            "confidence": 0.8240773809523809,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist eine sehr, sehr gute Frage und ich teile da tatsächlich auch deine Sichtweise. Ich selber bekomme, um nicht zu sagen, die Vollkrise, wenn ich Human Resources höre. Deswegen nennen wir uns tatsächlich auch innerhalb der Eurowings digital nicht HR oder Human Resources Team, sondern wir sind das People Team. Für mich geht es letzten Endes darum, die Mitarbeiter entsprechend zu betreuen, den Mitarbeitern Aufmerksamkeit zu schenken, den Mitarbeiter in den Fokus zu stellen und den Mitarbeiter einfach auch glücklich zu machen. Ich mag dieses Ressourcendenken überhaupt nicht und da bin ich vollkommen bei dir. Ich stelle mir natürlich auch die Frage, wann ein Umdenken in der Industrie stattfindet. Ich würde sagen, dass viele modernere Unternehmen, vor allem Start-up-Unternehmen, da jetzt auch schon den Wandel vollziehen, beziehungsweise auch vollzogen haben, indem sie ihre HR-Abteilung, wie sie früher vielleicht geheißen hat, zum People-Team umbenannt haben oder auch Talents and Culture oder andere Namen entsprechend verwenden, um einfach diesen Ressourcen-Aspekt da rauszunehmen. Ich glaube aber auch, dass bei dem einen oder anderen Unternehmen vielleicht noch ein bisschen was dauern wird, weil es einfach so eingeschliffen ist, in Anführungszeichen.",
            "start": 441695,
            "end": 511557,
            "confidence": 0.834465240641711,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Werbung Gegen Ende eines Jahres stellen wir uns oft die Frage, wie es mit der eigenen Karriere weitergeht. Wenn du Softwareentwicklerin bist, ist vielleicht die Tech Lead Masterclass der Tech Leaders Academy etwas für dich. Dabei handelt es sich um ein sechswöchiges Trainingsprogramm, um vom Softwareingenieur zum Tech Lead aufzusteigen. Das Ganze findet in kleinen Gruppen und in interaktiven Workshops statt, komplett remote und dadurch optimal in deinen Arbeitsalltag integrierbar. Die Techlead Masterclass behandelt unter anderem Themen wie die Herausforderungen beim Wechsel in die neue Rolle zum Techlead, Aufgaben- und Zeitmanagement, um deinen Impact zu erhöhen, die Definition einer technischen Vision und Roadmap, Designdokumente oder die Weiterbildung von anderen durch Mentoring und Coaching. Alle Inhalte sind praxisnah, direkt anwendbar und werden von langjährigen, erfahrenen Experten vermittelt. Wolfgang selbst übernimmt einen kleinen Part als Coach. Deswegen gibt es ein spezielles Angebot für alle Engineering-Kiosk-Hörerinnen. Unter techleaders.academy bekommt ihr mit dem Code Kiosk10 10% auf alle Angebote. Und das Beste, bis Ende September gibt es noch einen Frühbuchuhrpreis. Damit steigt der Rabatt auf fast 25%. Alle Infos findet ihr natürlich in den Show Notes. Werbung Ende. Du hattest gerade schon gesagt, ihr nennt euch People Team. Bei Trivago hieß es unter anderem mal Talents und Culture. In meiner aktuellen Firma heißt die Personalabteilung People Operations. Aber ist das jetzt alter Wein in neuen Schläuchen oder ändert sich die Arbeitsweise wirklich, wenn da ein neuer Name draufkommt, modernerer Name?",
            "start": 512267,
            "end": 600332,
            "confidence": 0.8214533898305082,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich hoffe, dass es natürlich auch mit einer Veränderung verbunden ist. Ich kann mir schon vorstellen, dass das ein oder andere Unternehmen sich einen neuen fancy Namen gibt, um hip und modern zu sein und letzten Endes sich davon erhofft, dass automatisch ein Wandel vollzogen wird, nur durch den neuen Namen. Nichtsdestotrotz wird sich der Wandel nicht vollziehen, wenn sich nicht grundlegend etwas an der Denkensweise im Unternehmen entsprechend ändert, was die Personalarbeit angeht. Neuer Name, gut und schön, aber dann müssen auch die Prozesse, die Strukturen etc. im Hintergrund angepasst werden und natürlich in allererster Linie das Mindset. Also weg von, wir administrieren nur Tätigkeiten und bewegen Papier von A nach B nach C hin zu, wir sind wirklich people-orientiert und stellen den Mitarbeiter, die Mitarbeiterinnen in den Fokus.",
            "start": 600792,
            "end": 647563,
            "confidence": 0.8350534351145037,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt ist uns ja die Diversity eigentlich sehr wichtig und wir probieren ja auch möglichst viele weibliche Gäste zum Beispiel einzuladen, gerade in der IT-Bubble. Jetzt in HR, ich sage immer noch, HR ist einfach die kürzeste Variante, aber People Operations finde ich übrigens auch nicht sehr freundlich. Aber egal, diese HR-Blase ist ja sehr weiblich dominiert. Ich kann mich erinnern, du warst der einzige Mann, zeitweise zumindest, damals bei Trivago, Hat sich das verändert oder bist du jetzt quasi unser Diversity-Ticket als Mann, als Gast in der HR-Bubble?",
            "start": 648043,
            "end": 678600,
            "confidence": 0.7964157303370788,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich würde sagen, es hat sich tatsächlich ein Stück weit geändert. Es ist natürlich jetzt nicht so, dass es zumindest auf Basis meines eigenen Empfindens und meiner eigenen Beobachtung, ich habe da jetzt keine statistischen Auswertungen oder sonst irgendwas drüber, sodass es nicht 50-50 verteilt ist. Also 50 Prozent Männer, 50 Prozent Frauen. Aber ich sehe schon, dass zunehmend immer mehr Männer tatsächlich auch in der HR-Abteilung tätig sind. Und ich bin auch sehr stolz und sehr glücklich darüber, dass das bei Eurowings Digital ebenfalls der Fall ist, dass ich nicht der einzige Hahn im Korb bin, sondern dass ich grandiosen Support auch von zwei, wenn nicht sogar drei männlichen Kollegen bei uns im People-Team habe.",
            "start": 678640,
            "end": 718367,
            "confidence": 0.8160862068965515,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, also es ändert sich auch in diesem Bereich.",
            "start": 718988,
            "end": 720929,
            "confidence": 0.7028888888888889,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, tatsächlich schon.",
            "start": 721649,
            "end": 723170,
            "confidence": 0.61,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn wir gerade bei Veränderungen sind, du bist jetzt doch seit über zehn Jahren in der ganzen Blase unterwegs. Wenn du so zurückdenkst an deine Anfangszeiten, hat sich da viel geändert in der HR-Branche? Und wenn ja, wo siehst du die größte Veränderung eigentlich so in den letzten zehn Jahren, die sich getan hat?",
            "start": 723190,
            "end": 741115,
            "confidence": 0.832944444444444,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es hat sich sehr, sehr viel verändert in den letzten Jahren. Also wenn ich jetzt meine Ausbildungszeit noch mit hinzurechne, in meiner Ausbildung war ich auch sehr, sehr viele Monate im HR-Bereich tätig, sehe ich schon einen signifikanten Unterschied zwischen heute und der damaligen Zeit. Also die Personalwelt hat sich grundlegend verändert. Ich habe es ja vorhin schon mal so ein bisschen gesagt, dass diese Denkweise weg von wir administrieren oder wir machen bürokratische Sachen und bewegen Papier von A nach B nach C, dass das weg muss hin zu einem people-orientierten Mindset. Und genau diese Veränderung habe ich tatsächlich in meinen Berufsjahren im People-Bereich, im HR-Team oder wie auch immer du es jetzt bezeichnen möchtest, einfach wahrgenommen. Also es verändert sich. Die Arbeit, die ich heute mache, ist nicht mehr die gleiche Arbeit, die ich vielleicht vor fünf, sechs oder sieben Jahren gemacht habe, weil sich der Fokus immer mehr auf den Mitarbeiter bewegt.",
            "start": 741155,
            "end": 798277,
            "confidence": 0.813490322580645,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und was ist da zum Beispiel dazu gekommen?",
            "start": 798318,
            "end": 800441,
            "confidence": 0.8619999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es ist einfach mehr Zusammenarbeit einfach dazu gekommen. Also es ist mehr eine Zusammenarbeit auf Augenhöhe geworden. Es ist mehr ein Verständnis füreinander schaffen. Es ist einfach auch so, dass die HR-Abteilung und das People-Team in vielen Firmen mittlerweile einfach auch als Enabler oder als strategischer Partner für das Business entsprechend wahrgenommen wird oder angesehen wird. Früher war es ganz oft so, okay, Personalabteilung, was machen die? Die stellen Arbeitsverträge aus, schreiben ein paar Zeugnisse und sehen irgendwie zu, dass pünktlich das Gehalt an die Arbeitnehmerinnen und Arbeitnehmer entsprechend ausgezahlt wird. Und diese Veränderung, die ich jetzt vorhin beschrieben habe, die habe ich einfach daran gemerkt, dass es mittlerweile zunehmend auffällig ist und auch gut ist, dass die Personalabteilung in strategische Unternehmensthemen mit eingebunden wird. Also wir wollen auch in solche Themen eingebunden werden. Und wir wollen auch einen entsprechenden Mehrwert da schaffen und als strategischer Partner das Business entsprechend enablen. Wir wollen das Business quasi entlasten, indem wir gewisse Service-Dienstleistungen, nenne ich es jetzt einfach mal, auch anbieten. und indem wir auch besser verstehen, wo die Probleme innerhalb der Organisation im Daily-Doing in den Teams sind, damit sich die Teams tatsächlich auf das Wesentliche konzentrieren können und wir aus der HR-Perspektive dann entsprechend uns um den Rest kümmern können.",
            "start": 801282,
            "end": 889240,
            "confidence": 0.8267285714285716,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was wäre so eine Serviceleistung, wo du sagst, okay, vor zehn Jahren hätte das nicht existiert und jetzt ist es vielleicht gang und gäbe?",
            "start": 889581,
            "end": 898165,
            "confidence": 0.8029166666666665,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich kann mich an eine sehr konkrete Situation aus meiner Ausbildungszeit erinnern. Damals ging es darum, dass eine neue Kollegin aus dem Ausland nach Deutschland gekommen ist. Diese Kollegin war komplett aufgeschmissen mit der Bürokratie, die in Deutschland herrscht. Sie wusste nicht, wie man ein Bankkonto öffnet. hatte tausend Probleme, eine Wohnung zu finden, wusste nicht, wie sie an einen Termin bei der Ausländerbehörde kommt, um entsprechenden Arbeits- und Aufenthaltserlaubnis zu bekommen etc. Und das waren alles so Sachen, die dann tatsächlich bei dem direkten Vorgesetzten hängen geblieben sind. der dann versucht hat, zwischen Terminen und Meetings irgendwas dann noch mit den Behörden zu klären oder Hinweise und Tipps zu geben. Hat Kollegen gefragt, wie war das? Kennt ihr jemanden, der schon mal durch eine ähnliche Situation durchlaufen ist? Und er hat es dann halt versucht, als der zukünftige Vorgesetzte entsprechend aufzufangen. Und hatte dann natürlich nicht mehr die Zeit, sich um die anderen Probleme oder um die wesentlichen Dinge, die sein eigentlicher Job sind, zu kümmern. Und das sind jetzt, würde ich sagen, zumindest aus meiner Perspektive gesprochen mittlerweile auch Themen, die nicht nur bei uns im People-Team gemacht werden, sondern vielleicht auch das ein oder andere Unternehmen draußen auf dem deutschen Markt mittlerweile auch an Service-Dienstleistungen für die Fachbereiche anbietet.",
            "start": 899131,
            "end": 979228,
            "confidence": 0.8514858490566032,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also man kann der Person keinen Vorwurf machen, weil ab und zu würde ich mir gerne auch wünschen, dass mich jemand an die Hand nimmt, wenn ich mit irgendwelchen Behörden was zu tun habe. Also von daher. Jetzt reden wir die ganze Zeit in den letzten Jahren davon, dass Corona ja zum Beispiel so ein Boost war für Remote Work und für flexible Arbeitszeitmodelle und Hybrid Work und so weiter und so fort. Hast du das Gefühl, dass der sogenannte Fachkräftemangel auch so ein Booster dafür war, dass die HR eine wichtigere, zentralere Rolle eingenommen hat, weil du ja schon die HR als strategischen Partner erwähnt hattest?",
            "start": 979608,
            "end": 1012152,
            "confidence": 0.7865794392523364,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Definitiv. Also ich glaube, dass der Fachkräftemangel sehr, sehr wohl eine sehr übergeordnete Rolle dabei spielt und einfach auch eine sehr, sehr wichtige Rolle, dass ein Umdenken entsprechend in Unternehmen stattfindet, weil als People-Team, als HR-Team, wie auch immer, again, wir uns bezeichnen möchten oder die Organisationen sich bezeichnen, sind wir halt mit verschiedenen Herausforderungen konfrontiert. Und die müssen wir entsprechend angehen. Und dazu gehört zum Beispiel auch das Thema Recruiting, Employer-Branding etc. Und da können wir natürlich mit unserem Wissen, mit unseren Skills und auch mit unseren vorherigen Erfahrungen, die wir vielleicht aus dem einen oder anderen Bereich mitbringen, dem Unternehmen helfen, sich entsprechend auf dem Arbeitsmarkt zu positionieren und dann auch die richtigen Leute anzusprechen, damit sie dann auch entsprechend zum Unternehmen kommen und dann hoffentlich auch lange bleiben.",
            "start": 1012472,
            "end": 1064831,
            "confidence": 0.8422671755725191,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber wenn wir jetzt mal zurückkommen zum eigentlichen Thema und wir wollten ja darüber sprechen über die Feindseite, dass man die HR oft als Feindseite sieht. Patrick, du bist ja kein Feind mehr, aber trotzdem. So der erste Kontaktpunkt ist ja eigentlich der CV, der Lebenslauf, den man an eine Firma sendet, an die Feindseite sendet, wenn man es so will. Jetzt, du bekommst ja hunderte CVs, tausende CVs unter Umständen und musst die möglichst schnell scannen und möglichst schnell evaluieren. Ist es eine gute Person, mache ich mit dieser Person weiter, gehe ich in den nächsten Schritt. Was ist dir denn wichtig in diesem Schritt? Was muss in dem CV drin sein? Was ist für dich wichtige Information? Also was würdest du empfehlen, damit man dir auch vielleicht möglichst weiterhilft, dass du diesen Schritt möglichst schnell abarbeiten kannst?",
            "start": 1065291,
            "end": 1111890,
            "confidence": 0.8139928057553957,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn ich Recruiting mache, ist es immer super wichtig, einfach Bewerbungsunterlagen zu bekommen, wo wirklich relevante Informationen drinstehen. Und das Wort relevant ist mir hier an der Stelle extrem wichtig. Jemand kann 15, 16, 17 Jahre Berufserfahrung entsprechend haben und kann natürlich das alles versuchen, irgendwie in den Lebenslauf unterzubringen. Da wird der Lebenslauf aber extrem lang und viele Dinge wiederholen sich ein Stück weit auch. Diese Wiederholungen, die brauchen wir teilweise einfach gar nicht im Recruiting immer wieder zu lesen. Deswegen das Wichtigste für mich ist tatsächlich immer mit der aktuellsten Position im Lebenslauf zu beginnen und dann nicht nur zu schreiben, ich bin Softwareentwickler oder ich bin Engineering Manager oder ich war jetzt CTO bei der und der Firma, sondern einfach auch nochmal High Level in vier, fünf, sechs, von mir aus auch sieben Bullet-Points darunter packen, was waren die Aufgaben, die ich in dieser Position übernommen habe. Und diese Bullet-Points sollten aber so beschrieben sein, dass sie nicht zu verklausuliert oder zu technisch sind. Also jeder Non-Tech-Mitarbeiter oder jeder Non-Tech-Mensch sollte auch in der Lage sein, so grob zu verstehen, was waren so die Aufgabenschwerpunkte. Warum sage ich, dass es auch wichtig ist, dass das Non-Tech-Leute verstehen? In erster Linie ist es ja oft so, dass ein Rekruter oder eine Rekruterin sich den Lebenslauf als allererstes durchliest und entscheiden muss, macht das jetzt Sinn, in den nächsten Step zu gehen oder eben nicht. Deswegen diese Klarheit und diese Verständlichkeit in den Bewerbungsunterlagen ist ja an der Stelle extrem wichtig und relevant für mich.",
            "start": 1112190,
            "end": 1215295,
            "confidence": 0.8490781250000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber bei euch ist es schon so, dass du als Recruiter oder eine andere Recruiterin die CVs mal als erstes durchscannt und dann kommt erst der nächste Schritt oder geht es auch teilweise an Techies direkt weiter?",
            "start": 1216147,
            "end": 1228541,
            "confidence": 0.8206756756756757,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das kommt immer ein bisschen darauf an, wie viele Positionen gerade auch ausgeschrieben sind, was das für Positionen sind. Ich würde jetzt einfach mal sagen, dass so 90% tatsächlich aller eingehenden Bewerbungen im ersten Schritt vom People-Team, also im Schwerpunkt vom Recruiting-Team, sich angeschaut werden und dass sie erst dann an den Hiring-Manager bzw. an das Team entsprechend weitergehen. Wenn es mal Ressourcenengpässe, ich sage jetzt bewusst Ressourcenengpässe, im Team da sein sollten, Dann hat der ein oder andere Fachbereich natürlich auch schon mal angeboten und gesagt, hey, wir unterstützen euch da. Ihr müsst jetzt nicht aus der Recruiting-Perspektive euch die Lebensläufe für diese Position auch noch angucken. Das machen wir alles in Eigenregie. Aber das ist jetzt nicht der Standardprozess, zumindest bei uns. Es ist eher so, dass das Recruiting-Team das macht.",
            "start": 1228581,
            "end": 1277833,
            "confidence": 0.8163458646616546,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also zusammenfassend alle Informationen, die relevant sind für die jeweilige Jobbeschreibung oder für den jeweiligen Job und die Grundschule kann man getrost weglassen, oder?",
            "start": 1278250,
            "end": 1288177,
            "confidence": 0.8966666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau, die Grundschule kann man getrost weglassen, auch sämtliche Praktika, die man vielleicht als 17- oder 18-Jährige entsprechend gemacht hat. Werkstudentenjobs können natürlich auch weggelassen werden, aber ganz wichtig immer mit dem kleinen Asterix da dran, es kommt auch darauf an, an welcher Stelle im beruflichen Leben befindest du dich jetzt gerade. Wenn du gerade mit deinem Studium fertig bist und dich auf eine Einstiegsposition im Engineering-Bereich bewirbst, dann ist es natürlich wichtig, nochmal zu erwähnen, welche Studentenjobs habe ich denn vielleicht gemacht oder habe ich nebenbei irgendwie, weiß ich nicht, in der Hochschule noch als Teaching Assistant supportet oder habe ein Praktikum irgendwo gemacht. Das sind natürlich dann Kenntnisse und Erfahrungen, die man dann zusätzlich erwähnen kann. Wenn du aber jetzt schon seit 10 oder 15 Jahren im Beruf unterwegs bist, dann kann man solche Sachen auch eher vernachlässigen beziehungsweise Man muss sie nicht so prominent im Lebenslauf entsprechend hervorheben. Da geht es dann eher darum, die aktuellsten zwei, drei letzten beruflichen Stationen nochmal rauszustellen, darauf einzugehen, was man da gemacht hat und welche Technical Skills man da entsprechend erworben hat oder mit welchen Programmiersprachen man da gearbeitet hat.",
            "start": 1288217,
            "end": 1361283,
            "confidence": 0.849636842105263,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ist das nicht so ein Widerspruch, wenn du sagst, das, was man während des Jobs gemacht hat, kurz und knapp zusammenzufassen, so dass das auch Nicht-Techniker verstehen? Weil im Endeffekt würde ich ja dann schon ziemlich viele Industrie-Fachwörter nutzen, da wo jeder, der in der Industrie arbeitet, in der Domäne arbeitet, weiß sofort, ah, okay, zum Beispiel Service Levels Objectives wird SLOs abgekürzt. Somit kann ich ein relativ langes Wort sehr kurz machen, krieg vielleicht mehr rein und so weiter. Ist das nicht direkt ein Widerspruch? Weil in der Regel ist es ja auch so ein bisschen, ich sag mal, Keyword-Bashing, ne? Du haust dann da alles rein, in der Hoffnung, dass du dann matchst. Und, also, wie siehst du das, dass man auf der einen Seite relativ viel beschreibt, auf der anderen Seite, ja, vielleicht auch Domänen, Fachwörter rauslässt, um es halt massenverständlich zu machen?",
            "start": 1361643,
            "end": 1406608,
            "confidence": 0.8104081632653065,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich würde nicht sagen, dass es grundsätzlich ein Widerspruch ist. Also es ist schon in Ordnung und auch wichtig, die richtigen Keywords zu platzieren, weil sie einfach eine entsprechende Relevanz für die Bewerbung haben. Aber jetzt einfach mal an dem Beispiel Projektmanagement. Ich kann ja auch im Software Engineering unterwegs gewesen sein und in meinem Job die letzten vier, fünf Jahre super viele verschiedene Projekte umgesetzt haben. Es ist nicht erforderlich, da bis ins kleinste Detail zu beschreiben, welche Projekte waren das, wie viel Budget steckte dahinter, wie viele Leute waren daran beteiligt, etc. Da reicht es einfach, das auf einem High-Level entsprechend anzugeben und dann können wir aus der Recruiting-Perspektive schon ganz gut erstmal nachvollziehen, okay, diese Person, die sich jetzt gerade mit diesem CV bei uns bewirbt, hat Erfahrung im Projektmanagement und die Details, was dahinter gesteckt hat oder was da vielleicht auch nicht so gut gelaufen ist oder was die Lessons learned gewesen sind, die kann man dann immer noch im ersten oder im zweiten Gespräch im Detail besprechen. Aber für das CV Screening im ersten Schritt ist das zu viel an Information.",
            "start": 1406931,
            "end": 1476802,
            "confidence": 0.847411764705883,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also wenn ich mich da zurück erinnere an mein CV-Screening damals, was ich so gemacht habe, und wir haben ja die CVs ziemlich ungefiltert von dir durchbekommen, zumindest du hast die schlimmsten CVs so rausgefiltert, aber dann ist es ziemlich schnell bei uns gelandet. Und ich kann mich erinnern, also um ehrlich zu sein, ich glaube bei den meisten CVs hat mein Screening 10 bis 15 Sekunden gedauert. Wie lange dauert dein Screening, wenn du ehrlich bist, dieses Keyword-Matching sozusagen oder wahrscheinlich einfach Pattern-Matching, das du betreibst in so einem CV?",
            "start": 1477182,
            "end": 1508526,
            "confidence": 0.7817032967032967,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, das ist eine gute Frage. Tatsächlich muss ich sagen, es kommt auf die Position an. Wenn das jetzt eine Position ist, mit der ich mich schon sehr, sehr intensiv beschäftigt habe, weil ich sie in vorherigen Unternehmen schon mal rekrutiert habe oder weil sie hin und wieder mal ausgeschrieben ist oder weil sie dauerhaft online ist aufgrund unseres Unternehmenswachstums und wir da entsprechend viele Leute für suchen, dann wird das CV-Screening irgendwann tatsächlich sehr sehr schnell gehen und dann verbringe ich auch teilweise nicht mehr als 15 bis 25 Sekunden mit einem einem CV oder mit einer Bewerbung. Wenn das jetzt aber eine neue Position ist, Also wo quasi ich selber noch nicht so viel Erfahrung im Recruiting habe, wo ich selber zwischen den Zeilen noch mehr lesen muss, um einfach das große Gesamtbild zu verstehen, dann kann das tatsächlich auch mal zwei, drei, vier Minuten dauern. bevor ich da eine unüberlegte Entscheidung treffe. Also bevor ich jetzt jemandem absage, möchte ich für mich selber ein gutes Gefühl in Anführungszeichen dabei haben, sagen zu können, okay, ich habe mir das angeguckt, was auf dem Papier steht, ich habe dann eine entsprechende Bewertung vorgenommen und kann dann auf Basis der gewonnenen Erkenntnisse halt sagen, okay, es geht weiter oder es geht halt eben nicht weiter.",
            "start": 1508546,
            "end": 1585632,
            "confidence": 0.8317023255813953,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, man kommt auch schneller zu dem Punkt, dass man einen Lebenslauf ablehnt. Und umso besser der Lebenslauf ist, umso mehr Zeit investiert man dann ja auch, weil man noch mehr in die Details dann reingeht und so weiter.",
            "start": 1585926,
            "end": 1596115,
            "confidence": 0.8412500000000003,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, tatsächlich.",
            "start": 1596135,
            "end": 1597516,
            "confidence": 0.422,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, umso einfacher das ist, umso schneller geht es natürlich auch die Ablehnung zum Beispiel. Hast du eigentlich schon mal irgendwie mit AI gearbeitet oder in einem automatischen Prozess, wo dieser Step komplett automatisiert wurde? Also so, was man so immer hört von Google und von anderen größeren Firmen, dass sie wirklich automatisches Keyboard-Matching machen.",
            "start": 1597556,
            "end": 1613770,
            "confidence": 0.8102909090909092,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Tatsächlich habe ich selber noch nie benutzt. Ich kenne auch gar keinen in meinem Umfeld an anderen Kolleginnen und Kollegen aus dem Personalbereich, die das genutzt haben. Ich weiß, dass die Recruiting-Software, die wir früher bei Trivago benutzt haben, das theoretisch abbilden konnte. Wir uns aber sehr, sehr bewusst dagegen entschieden haben.",
            "start": 1614605,
            "end": 1636036,
            "confidence": 0.8756153846153847,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und warum dagegen entschieden? Wobei das war damals wahrscheinlich auch keine AI noch, oder? Das war wahrscheinlich irgendwie nur manuelles Keyword-Matching oder so. Also manuell definierte Keywords.",
            "start": 1636096,
            "end": 1646171,
            "confidence": 0.7003703703703704,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Richtig, also es war keine richtige AI, es waren manuell definierte Keywords. Wir haben uns dagegen entschieden und diese Entscheidung teile ich auch heute immer noch, weil es einfach zu fehleranfällig sein kann. Also bestes Beispiel, du kannst im CV-Screening dann das Keyword vergeben, du möchtest, dass automatisch geschaut wird, dass der Jobtitel Software-Developer auftaucht. oder dass der Jobtitel XY entsprechend auftaucht. Und wenn das aber nicht der Fall ist, dann würde quasi automatisch dieser CV aussortiert werden. Aber man kann ja diese Position auch noch mit 20 anderen Namen betiteln. Man kann ja sagen, ich bin nur ein Developer oder ich bin ein Software Engineer oder Was weiß ich was? Und diese Leute würden dann automatisch aus dem Recruiting-Prozess rausgefiltert werden, würden nicht die Chance bekommen, in den Next Step entsprechend zu gehen. Deswegen bin ich froh, dass wir auch bei Eurowings Digital noch immer diese menschliche Komponente mit involviert haben und dann mit gesundem Menschenverstand uns die Lebensläufe angucken und dann einfach aufgrund der Eindrücke, die wir da gesammelt haben, unsere Entscheidung treffen. Also wir haben immer noch diesen menschlichen Aspekt mit dem Recruiting und der ist mir sehr, sehr wichtig, weil der einfach auch dabei hilft, zwischen den Zeilen zu lesen. Anderes Beispiel, ich kann ja sagen, liebes Tool, ich definiere jetzt diese Keywords, such danach, wenn du die nicht findest, dann sagt der Person entsprechend ab. Das kann ja sein, dass sich jemand auf einen Job beworben hat und es passt vielleicht auch für diese Position nicht unbedingt, was aber nicht bedeutet, dass er grundsätzlich unqualifiziert ist. Es kann ja sein, dass die Person auch noch für eine andere Position in Frage kommt, die vielleicht online nicht selber gefunden wurde oder die gerade noch in der Pipeline ist und erst nächste Woche ausgeschrieben wird. Da geht einfach zu viel Potenzial aus meiner Perspektive entsprechend verloren, wenn man es nur anhand von Keywords oder mithilfe von AI entsprechend macht. Also dieser menschliche Faktor sollte auch aus der ethischen Perspektive für mich immer im Recruiting mit mit involviert bleiben jetzt hattest.",
            "start": 1646211,
            "end": 1774920,
            "confidence": 0.8273760932944608,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du ja schon so eine art menschlicher faktor angesprochen also meines erachtens nach hast du gerade unter anderem über den sogenannten team fit company fit auch gesprochen und die erfahrung die ich bisher gemacht habe ist dass die kultur beziehungsweise die sogenannten company values unter anderem von der personalabteilung ja auch definiert geprägt erarbeitet aber auch getrieben werden, Und jetzt spricht man ja oft von dem sogenannten Teamfit, aber könnt ihr, und mit ihr meine ich Personen aus der Personalabteilung, wirklich den sogenannten Teamfit bestimmen, ob jemand ins Team passt, oder bewertet ihr eigentlich nur, Quote und Quote, nur, oh, das ist eine ganz strikte Konzernperson, braucht ganz klare Regeln, oder kann sehr selbstständig und flexibel durchs chaos navigieren also in wie weit traut ihr euch zu aus deiner erfahrung den team fit company fit für von mitarbeitern zu bestimmen oder beziehungsweise der passt.",
            "start": 1774940,
            "end": 1834566,
            "confidence": 0.8405416666666669,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde an der Stelle tatsächlich so ein bisschen differenzieren. Also differenzieren zwischen Company-Fit auf der einen Seite und Team-Fit auf der anderen Seite. Company-Fit sind Dinge, das hast du gerade selber angesprochen, wie Unternehmenswerte zum Beispiel. Danach können wir gezielt im Recruiting schauen, da können wir gezielte Fragen zu stellen und können halt versuchen, einen bestmöglichen Eindruck davon zu bekommen, könnte diese Person jemand sein, der oder die mit unseren Company Values entsprechend übereinstimmt.",
            "start": 1834966,
            "end": 1866425,
            "confidence": 0.8090799999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du da ein Beispiel?",
            "start": 1866725,
            "end": 1867985,
            "confidence": 0.4704,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Zum Beispiel, einer unserer Unternehmenswerte ist Power of Proof. Das heißt, Entscheidungen treffen auf Basis von Daten, Zahlen und Fakten. Und im Gespräch, sei es jetzt im Telefonat, sei es in einem persönlichen Gespräch oder über Teams, kann man natürlich auch über Situationen sprechen und da fragen, okay, wie hast du denn in der Vergangenheit Entscheidungen getroffen? Waren das Entscheidungen, die aus dem Bauch getroffen wurden oder hast du dir da irgendwelche Zahlen, Daten, Fakten aus dem System gezogen oder irgendwelche Argumente vorbereitet? Was weiß ich was? Anhand von konkreten Situationen und Fragen kann man das ganz gut im Vorstellungsgespräch herausfinden, ob das passen könnte oder eben halt nicht. Das ist jetzt nicht nur auf den auf den Unternehmenswert Power of Proof bezogen, sondern auch auf alle anderen Unternehmenswerte, die wir bei der Eurowings digital haben. Zum Thema Teamfit. Jedes Team tickt natürlich anders. Jedes Team besteht aus anderen Menschen und jedes Team arbeitet vielleicht auch ein bisschen anders zusammen. Natürlich können wir aus der Perspektive der Personalabteilung nicht immer zu 100 Prozent entscheiden, passt die Person jetzt wie die Faust aufs Auge ins Team oder nicht. Das, was wir machen können, ist natürlich im Vorfeld mit dem Team klären, welche Persönlichkeit würde Ihrer Meinung nach gut ins Team als Edition passen, dass wir darauf entsprechend im Auswahlprozess schon achten können. Das ist halt das, was wir als Personalabteilung, als Recruiter oder Recruiterin entsprechend gewährleisten können. Darüber hinaus können wir uns natürlich ein eigenes Bild machen und uns immer die Frage stellen, wenn diese Person, mit der wir jetzt hier gerade sprechen, sich für eine Stelle bei mir im eigenen Team beworben hätte, könnte ich mir vorstellen, mit dieser Person entsprechend zusammenzuarbeiten. Ja oder Nein? Und wenn ich diese Frage ganz klar mit Ja oder ganz klar mit Nein beantworten kann, dann ist mir vielleicht auch im Zweifelsfall die Entscheidung leichter gefallen zu sagen, okay, das geht in den nächsten Schritt oder es geht halt eben nicht in den nächsten Schritt. Warum soll ich eine Person, mit der ich mir nicht vorstellen kann, im eigenen Team zu arbeiten, jemand anderes ins Team setzen? Also das wird für mich halt keinen Sinn machen. Nichtsdestotrotz die absolute finale Entscheidung, ob jemand eingestellt wird oder nicht, trifft ja nicht die Personalabteilung alleine im Idealfall. Da ist ja immer das Team im Idealfall mit involviert. Da ist der entsprechende Vorgesetzte oder Hiringmanager mit involviert. Und dann sollte es eine gemeinschaftliche Entscheidung entsprechend sein. Weil das Team muss sich letzten Endes mit dem neu eingestellten Mitarbeiter oder der neu eingestellten Mitarbeiterin entsprechend wohlfühlen. Und wenn da jemand im Recruitingprozess eine Red Flag festgestellt hat, dann sollte er oder sie diese Red Flag dann auch entsprechend vor der Einstellung oder vor der finalen Entscheidung auch entsprechend an alle Interviewer kommunizieren und dann auch im zweifelsfallenden Veto ausüben. Also das ist entsprechend wichtig. Und nochmal ganz konkret zusammengefasst, Company Fit, glaube ich, können wir ganz gut beurteilen anhand von Fragen, die sich auf die Values beziehen. Ansonsten können wir, glaube ich, einen ganz guten Eindruck bekommen, wie die Person drauf ist. indem wir fragen, was das Team für Wünsche hat oder was das Team einfach braucht an zwischenmenschlichen Komponenten, nenne ich es jetzt einfach mal, und dann sollte die finale Entscheidung dann mit dem Team gemeinsam entsprechend getroffen werden, nicht alleine von der Personalabteilung aus.",
            "start": 1868025,
            "end": 2070369,
            "confidence": 0.8263494623655914,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt sind diese zwei Bereiche, Companyfit und Teamfit, definitiv zwei Dinge, die überprüft werden in Interviews. Und da sieht man auch schon, dass da teilweise viel Hirnschmalz hineinfließt in so ein Interview und das nicht nur random Fragen sind. Also jeder, der mal auf der anderen Seite gesessen ist, weiß, dass es gar nicht so einfach ist, die richtigen Fragen in dem Interview zu stellen und dass da schon viel dazugehört, vor allem, wenn man da strukturiert arbeitet. Hast du ganz allgemein noch irgendwelche Tipps für Interviews? für Bewerber und Bewerberinnen, wie sie sich vorbereiten sollen oder was wichtig ist, wie man sich auf Interviews auch so vorbereitet, dass du vielleicht ein leichteres Leben hast und vielleicht nicht schon schlecht gelaunt aus einem Interview rausgehst?",
            "start": 2070969,
            "end": 2110753,
            "confidence": 0.8140640000000003,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist eine sehr interessante Frage tatsächlich. Was jeder machen kann als Vorbereitung, ist sich nochmal ein bisschen mit dem Unternehmen auch auseinanderzusetzen. Ich stelle es regelmäßig fest in Vorstellungsgesprächen, dass vielen Bewerberinnen und Bewerbern überhaupt gar nicht klar ist, was das Unternehmen macht. Also ich erwarte jetzt nicht, dass ein Bewerber weiß, wann das Unternehmen gegründet wurde, wer da der Geschäftsführer ist und was weiß ich was. Es geht aber darum, zumindest ein grobes Verständnis sich davon anzueignen, was so das Kerngeschäft des Unternehmens ist. Und was vielleicht auch die Rahmenbedingungen sind, also welche Branche ist es überhaupt, welche Produkte und Dienstleistungen werden jetzt aktuell entsprechend angeboten etc. Also wenn man sich darauf schon mal im Vorfeld von einem Interview darauf vorbereitet, dass man da aus der Personalperspektive nicht immer alles doppelt und dreifach und 20 mal wieder erzählen muss, dann hilft uns das auf jeden Fall schon enorm, würde ich jetzt einfach mal behaupten. Ansonsten ist es auch noch mal super wichtig, und das hört sich jetzt nach einer Selbstverständlichkeit für viele an, ist es aber tatsächlich nicht, dass man sich einfach auch Zeit nimmt für ein Interview. Es ist jetzt kein lustiges Frage- und Antwortspiel aus Jux und Dollerei, sondern es ist einfach ein Gespräch auf Augenhöhe, was da stattfindet. Es geht ja darum, dass der Bewerber oder die Bewerberin das Unternehmen besser kennenlernen möchte. Und wir möchten natürlich auch als Arbeitgeber entsprechend Input geben, indem wir erzählen, wie unsere Unternehmenskultur ist, wie unsere Arbeitsabläufe sind, was die Herausforderungen in der Position sind, was vielleicht auch in der Vergangenheit nicht gut gelaufen ist und weshalb, warum wir jetzt auch gerade auf der Suche nach jemandem Neuen sind. Und auf der anderen Seite geht es aber genauso darum, dass wir als Unternehmen den Kandidaten, die Kandidatin kennenlernen möchten. Welche Erfahrungen bringt er da sie mit? Welche Wunschvorstellungen? Was sind absolute Must-Haves im neuen Job? Was sind absolute No-Gos? Etc. Also es ist wirklich ein Gespräch auf Augenhöhe, was wir da führen wollen. Und das braucht einfach auch Zeit. Wenn man die ersten Worte im Interview hört, ja, ich habe maximal 30 Minuten Zeit, ich habe einen harten Anschlag. dann wird es halt manchmal schon so ein bisschen schwierig, weil man dann innerlich so ein Gefühl von, okay, wir haben jetzt den zeitlichen Druck und wir müssen das jetzt irgendwie hier abfrühstücken hat. Es ist okay, wenn das mal fünf Minuten oder zehn Minuten länger dauert. Deswegen lieber den Kalender ein bisschen länger blocken und früher fertig sein, als den Kalender zu kurz geblockt zu haben und dann hinten raus in die Problematik zu rennen, dass der Anschlusstermin wartet und man das Interview entsprechend abbrechen muss. Und last but not least, das mag sich jetzt auch wieder nach einer Kleinigkeit anhören oder nach einer Selbstverständlichkeit, aber Fragen vorbereiten. Was interessiert mich eigentlich an dem Unternehmen? Was sind so Sachen, die mir jetzt unklar geblieben sind, nachdem ich mir die Stellenausschreibung durchgelesen habe, nachdem ich auf der Webseite gewesen bin? oder auch Sachen, die einem selber extrem wichtig sind, was das Team angeht, Teamgröße zum Beispiel, oder wie die Arbeitsmethodiken sind. Sind das agile Teams oder wie sieht das aus? Also, dass man sich einfach mit konkreten Fragen vorbereitet und die dann einfach auch während des Gesprächs oder am Ende des Gesprächs, je nachdem, wie es entsprechend passt, dann auch stellt. der dritte Tipp, den ich da entsprechend geben kann. Genau. Und ansonsten, ich glaube, es sollte selbstverständlich sein, dass man sich ein Environment sucht, wo man dann auch entsprechend ungestört reden kann und nicht irgendwie Angst haben muss, dass der nächste Kollege gleich den Besprechungsraum braucht, weil man im Büro sitzt oder was weiß ich was.",
            "start": 2111434,
            "end": 2330715,
            "confidence": 0.8257293354943274,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was war das außergewöhnlichste Interview, was du geführt hast in Bezug auf Environment?",
            "start": 2331436,
            "end": 2335339,
            "confidence": 0.7261538461538463,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe vor, es ist noch gar nicht so lange her, ich würde jetzt mal sagen so knapp drei, vier Monate oder so ist es her, da hatte ich ein Interview mit einem Bewerber, der das Interview mit mir geführt hat über sein Smartphone auf öffentlicher Straße. Das Handy wackelte die ganze Zeit hin und her, im Hintergrund war der Straßenlärm, links eine Baustelle, rechts fuhr der Bus entsprechend vorbei, man hat sein eigenes Wort nicht mehr verstanden. Das war schon eine Ja Situation nenn ich es jetzt einfach mal wo ich mir einfach gewünscht hätte dass es ein bisschen bisschen ruhiger im Hintergrund gewesen wäre.",
            "start": 2336882,
            "end": 2372667,
            "confidence": 0.8237169811320759,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt habe ich alle deine Tipps befolgt. Und ich hab mich eingestellt und ich hab neuen Job ich starte jetzt mega.",
            "start": 2372687,
            "end": 2378874,
            "confidence": 0.7940476190476191,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und das würdest du dir wünschen oder.",
            "start": 2378934,
            "end": 2380796,
            "confidence": 0.7742857142857142,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jedes Hund findet mal ein glückliches Korn oder wie sieht das aus, jetzt hatte die aber in der Stellenausschreibung und Benefit direkt nach dem Obstkorb geschrieben unlimited Vacation Days. Trivago hat's sehr lange gemacht ich weiß nicht ob die es immer noch haben ich glaube Netflix wirbt damit auch. Oder hat damit überhaupt begonnen? Meine Frage ist jetzt, wie hast du die ganze Sache wahrgenommen? Ist das ein Traum für jeden Arbeitnehmer? Kann ich jetzt wirklich 60, 70, 80 Urlaubstage pro Jahr nehmen? Oder die Gegenkritik, dadurch nimmt man weniger als 30 oder 24 Urlaubstage im Durchschnitt. Wie hast du dieses Benefit Unlimited Vacation Days wahrgenommen?",
            "start": 2383098,
            "end": 2420890,
            "confidence": 0.7759056603773588,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Generell würde ich sagen, es ist schon ein riesengroßes Benefit, unlimited vacation days zu haben. Warum? Weil man nicht urlaubsoptimierend planen muss. Als Arbeitnehmer hast du meistens 28, 29, 30 Tage Urlaub. arbeitsvertraglich entsprechend zugesichert und da versuchst du ja als Arbeitnehmer, als Arbeitnehmerin das Bestmögliche rauszuholen. Dann schaust du dir an, wie sind jetzt, weiß ich nicht, Feiertage oder gibt es irgendwie Brückentage, die ich noch mitnehmen kann etc. und versuch dann entsprechend so zu planen. Wenn du Unlimited Vacation Days hast, dann hast du diese Problematik nicht. Dann ist dir das egal, ob du jetzt dein Urlaubsoptimieren in dem Monat geplant hast und dann irgendwie umschaffelst oder was weiß ich was, weil du einfach dich frei austoben kannst. Also in der Theorie ist das gut und in der Theorie ist das, glaube ich, eine Sache, wo ich mir vorstellen kann, dass da auch mehr und mehr Unternehmen vielleicht für sich einen Benefit entsprechend drin sehen. Nichtsdestotrotz, ich kenne es aus meiner eigenen Erfahrung, muss man der Typ auch dafür sein, die Unlimited Vacation Days auch anzunehmen. Also wenn man halt gar keine Form von Orientierung hat, was ist denn in Ordnung an Urlaubstagen tatsächlich zu nehmen. Also ich meine, allein, dass ich jetzt schon sage, was ist denn in Ordnung. Also wenn man Unlimited hat, dann ist es egal, ob du 80 nimmst oder 30 oder 20, aber dir fehlt irgendwie so gefühlt ein Richtwert. Und dann versuchst du dann natürlich so ein bisschen mal nach links zu gucken und nach rechts zu gucken. Was machen denn deine eigenen Teamkollegen? Oder was machen denn deine Freunde und Bekannte in anderen Unternehmen? Wie viele Tage haben die? Und dann versuchst du dich dann trotzdem so ein bisschen daran zu orientieren. Und meine Erfahrung ist, zumindest meine eigene persönliche Erfahrung ist, dass ich meistens genauso viel Urlaub genommen habe, wie meine Freunde oder meine Bekannte. die ein festes Kontingent entsprechend zur Verfügung hatten. Also ich habe da jetzt nie den Riesenurlaub quasi vom Unternehmen abgezapft und war jetzt mal 60 Tage entsprechend weg. Und man muss sich natürlich dann auch immer noch in den Kopf rufen, dass man für die Abwesenheit auch immer jemanden finden muss, der dann gegebenenfalls Aufgaben übernimmt oder zumindest Ansprechpartner ist. Also die Arbeit, die erledigt sich ja letzten Endes dann auch nicht von alleine. Ich kenne eine Person, die bei einem anderen Arbeitgeber sehr, sehr intensiv davon Gebrauch gemacht hat, tatsächlich. Und dann auch mal in einem Jahr 55 oder 60 Tage weg gewesen ist. Diese Person hat dann aber rückblickend gesagt, das war vielleicht dann doch nicht die schlauste Idee, tatsächlich. Einfach vor dem Hintergrund, weil sie sich selber ein bisschen gestresst hat. Zu wissen, okay, die Kollegen sitzen jetzt im Büro, müssen die Arbeit auffangen. ein bisschen gestresst hat, dass sie da alleine mit gewesen ist, so viel Urlaub genommen zu haben und einfach auch gestresst gewesen ist, so viel unterwegs gewesen zu sein. Einfach ständig auf Achse gewesen zu sein und nicht mehr irgendwie so vom Team her alles so mitzubekommen. Also es war dann quasi schon zu viel Auszeit für diese Person. Das war dann so ein bisschen die Kehrseite, die ich da auch mitbekommen habe.",
            "start": 2421507,
            "end": 2612233,
            "confidence": 0.805829906542056,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich höre aber auch schon so ein bisschen raus, dass für manche Personen dann einfach ein festes Kontingent von 24 bis 30 Urlaubstagen vielleicht die bessere Wahl ist, oder?",
            "start": 2612613,
            "end": 2622161,
            "confidence": 0.7512068965517242,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Würde ich schon sagen. Also es kommt immer so ein bisschen auf den Typen an. Also ich finde, grundsätzlich die Flexibilität zu haben, zu sagen, ich nehme jetzt so viel Urlaub, wie ich will oder wie ich kann oder wie ich darf oder wie auch immer, das ist super, super cool. Man muss nur der Typ dafür sein. Wenn man der Typ nicht dafür ist, wenn man sich irgendwie ständig Sorgen macht, es ist vielleicht doch zu viel oder den Brückentag arbeite ich dann vielleicht doch oder weil die anderen schon irgendwie Urlaub haben etc., dann kann das natürlich leicht darauf hinauslaufen, wenn man das selber dann halt für sich in seinem Kopf nicht klar hat, dass man eher zu wenig Urlaub nimmt als zu viel in Anführungszeichen.",
            "start": 2622181,
            "end": 2660106,
            "confidence": 0.8410234375000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich kenne auch einige InformatikerInnen, die eigentlich ganz glücklich sind zum Beispiel mit einer ganz harten Stechuhr und die sagen einfach 40 Stunden und alles andere sind Überstunden und es wird genau getrackt und ich habe keine Flexibilität, sondern es ist wirklich halt hart getrackt und wenn es zu viel ist, ist es zu viel, bekomme ich Zeitausgleich, was es auch immer ist und die leben eigentlich mit dem Modell sehr gut und wollen auch genau dieses Modell. Also für die wäre das komplett flexibler und es wird überhaupt nichts aufgezeichnet, keine Stunden und dafür vielleicht flexiblere Urlaubszeiten auch. Für die wäre das auch gar nichts. Also es kommt glaube ich wirklich auf die Person drauf an.",
            "start": 2660806,
            "end": 2693423,
            "confidence": 0.806760683760684,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jetzt ist es ja so, Unlimited Vacation Days oder beziehungsweise Urlaub, das ist die eine Baustelle, wie ich, mehr vom Leben haben kann. Jetzt gibt es ja aber auch noch andere Mittel, wie zum Beispiel, eine andere Belegung wäre die Arbeitszeitverkürzung. Kannst du uns mal so einen Rundumschlag geben, was das heißt, Arbeitszeitverkürzung?",
            "start": 2693922,
            "end": 2711048,
            "confidence": 0.800264150943396,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, kann ich euch definitiv geben. Arbeitszeitverkürzung wird oftmals auch als Teilzeit bezeichnet. Und da stellt sich natürlich die Frage, was bedeutet denn Teilzeit? Bin ich nur in Teilzeit, wenn ich irgendwie 50 Prozent mache? Oder bin ich schon in Teilzeit, wenn ich eine Stunde weniger arbeite als meine Kolleginnen und Kollegen? Teilzeit fängt da an. wo deine individuelle Arbeitszeit als Arbeitnehmer weniger ist als die betriebsübliche Arbeitszeit. Das heißt, wenn die betriebsübliche Arbeitszeit bei 40 Stunden pro Woche liegt und ich aber dann 39 Stunden oder 38 Stunden entsprechend arbeite, dann bist du entsprechend schon in Teilzeit beschäftigt. Also alles, was weniger ist als die betriebsübliche Arbeitszeit, ist entsprechend schon Teilzeit. Und das Interessante ist, es gab, ich glaube, 2019 war es, lage mich jetzt nicht auf das Jahr genau fest, eine Entscheidung auch vom Gesetzgeber, die quasi gesagt hat, dass man Mitarbeiter und Mitarbeiterinnen in Teilzeit entsprechend mehr unterstützen möchte. Früher war es halt so, wenn du dich als Arbeitnehmer entschieden hast, in Teilzeit zu gehen, dann konnte der Arbeitgeber dann deinen Antrag entsprechend prüfen, hat im Idealfall dann auch entsprechend stattgegeben. Und dann warst du dann halt in Teilzeit, dann weiß ich nicht, 30 Stunden oder was auch immer du beantragt hattest, hattest aber keinen Anspruch mehr darauf, entsprechend in Vollzeit zurückzugehen. Und mit der Gesetzesänderung in Deutschland wurde dann die sogenannte Brückenteilzeit entsprechend eingeführt. Das bedeutet, dass du auch für einen zeitlich begrenzten Zeitraum, Anspruch darauf hast, deine normale Arbeitszeit zu reduzieren und hast dann aber auch wieder den gesetzlichen oder rechtlichen Anspruch darauf, nach Ablauf dieser Zeit wieder zurück in ein Vollzeitarbeitsverhältnis entsprechend zu wechseln, wenn du in vorhinem Vollzeitarbeitsverhältnis entsprechend beschäftigt gewesen bist.",
            "start": 2711528,
            "end": 2824547,
            "confidence": 0.8262329749103944,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In letzter Zeit ist es ja wesentlich üblicher geworden, würde ich sagen, gerade im IT-Bereich, dass man 32 Stunden oder sowas macht, also 80 Prozent. Wie siehst du das industrieweit? Siehst du da einen Trend? Ich weiß, auch bei ganz vielen Unternehmen ist es immer noch ein extrem großes Problem, dass man da irgendwie reduziert. Wie siehst du das im Markt aktuell so?",
            "start": 2825263,
            "end": 2846748,
            "confidence": 0.7973492063492063,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe da jetzt keine Statistiken oder Zahlen, Daten, Fakten vorliegen. Gefühlt merke ich aber auch, dass immer mehr Mitarbeiterinnen und Mitarbeiter, sei es bei mir im eigenen Betrieb oder auch in den Betrieben, wo Freunde und Familie arbeiten, Teilzeit beantragen oder von vornherein entsprechend in Teilzeit arbeiten. Und ich finde das eigentlich eine sehr, sehr positive Sache tatsächlich. Weil jeder Mensch sollte für sich frei entscheiden können, wie viel Zeit möchte ich denn mit Arbeit verbringen und wie viel Zeit möchte ich gerne für andere Dinge entsprechend aufwenden können. Und wenn man halt sagt, okay, Ich möchte nur 32 Stunden die Woche arbeiten, diese 32 Stunden auf vier Tage oder was auch immer entsprechend verteilen, habe dafür einen Tag dann in der Woche frei, ist das für mich vollkommen in Ordnung. Und da gibt es zum Glück bei uns überhaupt gar keine Probleme und da bin ich auch sehr glücklich und sehr dankbar darüber, dass wir da so offen und flexibel mit umgehen können.",
            "start": 2848769,
            "end": 2901440,
            "confidence": 0.8503575757575754,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Man muss aber mal ganz explizit sagen, also nur um das wirklich klarzustellen, wenn ich jetzt normalerweise 40 Stunden arbeite, 8 Stunden pro Tag, 5 Tage die Woche und reduziere jetzt auf 30 Stunden, also ich reduziere meine Arbeitszeit um 25%, dann ist in der Regel mein Gehalt ebenfalls um 25% reduziert, richtig?",
            "start": 2901780,
            "end": 2920844,
            "confidence": 0.8040754716981132,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Richtig, genau. Das ist so die Standard-Vorgehensweise. verzichtest du auch noch auf eine gewisse Anzahl von Einkommen, weil du in Teilzeit entsprechend arbeitest. Ganz wichtig ist auch noch, wenn du dich dazu entscheidest in Teilzeit zu arbeiten und die reduzierte Stundenzahl auch auf weniger Tage pro Woche aufteilst, also anstatt auf fünf Tage zum Beispiel nur auf drei Tage oder auch vier Tage, dann reduziert sich in der Regel auch dein Urlaubsanspruch entsprechend nach unten. Also das ist auch ganz wichtig im Hinterkopf zu behalten. Also der Urlaubsanspruch basiert nicht auf der tatsächlich geleisteten Stundenzahl, sondern basiert auf den Arbeitstagen, die du entsprechend erbringst. Also wenn du normalerweise 30 Tage Urlaub pro Jahr hast für fünf Tage und dann nur noch vier Tage arbeitest, dann teilst du die 30 Tage durch fünf. rechnest dann mal vier Tage, die du arbeitest und hast dann deinen entsprechenden individuellen reduzierten Urlaubsanspruch. Aber dann musst du natürlich für die freien Tage, die du hast, so oder so, dann keinen Urlaub mehr einsprechen, einreichen, weil der ist ja so oder so frei, der Tag.",
            "start": 2921304,
            "end": 2989093,
            "confidence": 0.8037318435754188,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kann der Arbeitgeber mir die Arbeitszeitverkürzung verbieten oder habe ich dann Rechtsanspruch drauf?",
            "start": 2989113,
            "end": 2994259,
            "confidence": 0.8553076923076923,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also du kannst als Arbeitnehmer natürlich einen Antrag auf Teilzeitarbeit entsprechend stellen. Und der Arbeitgeber muss diesen Antrag auf Teilzeit auch genehmigen, es sei denn, es gibt irgendwelche wichtigen, dringenden betrieblichen Gründe, die dagegen sprechen. Das heißt zum Beispiel, wenn kompletter personeller Engpass zum Beispiel in einem Team entsprechend herrscht und du die einzige Person bist, die diese Aufgabe gerade wahrnehmen kann etc., dann kann es natürlich sein, dass der Arbeitgeber ein berechtigtes Interesse hat und die die Arbeitszeit entsprechend nicht reduzieren möchte. Dann muss dein Antrag auf Teilzeit auch entsprechend vom Arbeitgeber mit einer Begründung abgelehnt werden. Um dem Ganzen aber vorzubeugen, mein Tipp aus der Praxis ist, wenn jemand mit dem Gedanken spielt, in Teilzeit zu gehen, das frühzeitig entsprechend in Angriff zu nehmen. Es gibt natürlich eine gesetzliche Frist. Ich glaube, das sind drei Monate im Voraus, wo man das entsprechend schriftlich anzeigen muss. Macht das vielleicht sogar schon ein halbes Jahr vorher oder von mir aus auch ein Dreivierteljahr vorher und sprecht dann mit dem Teamleiter oder mit dem Vorgesetzten darüber und sagt, Ich kann mir vorstellen, grundsätzlich in Teilzeit zu gehen. Wie sieht das eigentlich aus? Können wir da mal irgendwie gucken, wie viele Stunden wären denn überhaupt möglich, die ich reduzieren kann? Wie viele Tage braucht ihr mich eigentlich überhaupt? Dass man das einfach in einem Dialog macht und gemeinsam mit der Firma, mit dem Arbeitgeber eine Lösung entsprechend ausarbeitet, anstatt einfach nur den Antrag dahin zu knallen und darauf zu hoffen, dass es entsprechend genehmigt wird. Wenn man genügend Vorbereitung hat als Arbeitgeber, dann kann man sich auch verschiedene Lösungsszenarien überlegen und auch gucken, dass man Aufgaben vielleicht schon im Vorhinein umverteilt, dass man jemand anders irgendwie noch einstellt oder was weiß ich was. Also das Thema Kommunikation und Offenheit, wenn ihr solche Pläne habt, macht euch, glaube ich, da das Leben einfach leichter, eventuell mal in eine Teilzeitbeschäftigung zu gehen.",
            "start": 2994519,
            "end": 3110992,
            "confidence": 0.8254999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir werden langsam zu einer Episode, wo es darum geht, wie man weniger arbeiten kann. Aber dann gehen wir gleich in das nächste Thema, wie man weniger arbeiten kann. Und zwar Sabbatical ist ja ganz oft ein Perk mittlerweile. Keine Ahnung, ob ihr ein Sabbatical anbietet oder vielleicht kannst du uns da mal kurz einen Überblick geben, was es eigentlich bedeutet und wie das eigentlich so vonstatten geht.",
            "start": 3111412,
            "end": 3129162,
            "confidence": 0.7864852941176471,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das kann ich sehr, sehr gerne machen. Sabbaticals bieten wir tatsächlich bei der Eurowings digital auch an. Ganz wichtig ist in Deutschland zumindest ist es so, dass ein Sabbatical keine rechtliche Grundlage in Anführungszeichen hat. Also du als Arbeitnehmer kannst es nicht einfordern und sagen, so lieber Arbeitgeber, ich bin jetzt mal ein halbes Jahr oder ein Jahr entsprechend weg. Nein, das ist eine Sache, die entsprechend mit dem Arbeitgeber und dem Arbeitnehmer einvernehmlich abgeschlossen werden muss. Und es gibt da verschiedenste Möglichkeiten. Die zweigängigsten Möglichkeiten sind einmal das bezahlte oder das unbezahlte Sabbatical. Unbezahlte Sabbatical bedeutet, man einigt sich mit dem Arbeitgeber darauf, Anzahl an x Tagen oder Wochen oder Monaten entsprechend die Arbeit zu unterbrechen und das dann für Reisen oder private Zweck oder wie auch immer entsprechend zu nehmen.",
            "start": 3129482,
            "end": 3183184,
            "confidence": 0.8510227272727274,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist das einfach ein unbezahlter Urlaub dann?",
            "start": 3183224,
            "end": 3185465,
            "confidence": 0.6417142857142857,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau, das ist die unbezahlter Urlaub, richtig, genau. Für diese Dauer wird dann auch kein Arbeitsentgelt entsprechend bezahlt. Wichtig ist aber, dass das Arbeitsverhältnis weiter bestehen bleibt. Nur die Hauptpflichten aus dem Arbeitsverhältnis ruhen. Hauptpflicht bedeutet, der Arbeitgeber zahlt kein Gehalt und der Arbeitnehmer, die Arbeitnehmerin arbeitet entsprechend. Also diese Hauptpflichten, die ruhen. Alles andere an Nebenpflichten wie Geheimhaltung etc. bleiben entsprechend weiter bestehen. Das ist ganz wichtig.",
            "start": 3185505,
            "end": 3213746,
            "confidence": 0.8469117647058824,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wie läuft es mit der Versicherung? Das ist ja auch immer so ein Knackpunkt.",
            "start": 3213806,
            "end": 3216748,
            "confidence": 0.6685333333333336,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau, das ist ein Punkt, da wollte ich gerade noch drauf eingehen. Wenn man sich für ein unbezahltes Sabbatical entscheidet, sollte man natürlich im Vorfeld als Arbeitnehmer auch Kontakt zu den entsprechenden Sozialversicherungsträgern in Deutschland aufnehmen. Insbesondere die zuständige Krankenkasse. Also wenn man jetzt in der gesetzlichen Krankenversicherung versichert ist, sollte man dann bei Sicht nicht, wo man dann entsprechend versichert ist, einmal anrufen oder in eine persönliche Beratungsstelle gehen und sagen, Ich habe jetzt den Plan, vom So-und-so-vielten bis zum So-und-so-vielten in einen unbezahlten Urlaub, in ein unbezahltes Sabbatical entsprechend zu gehen. Können wir da bitte mal kurz darüber sprechen, was mit meinen Krankenversicherungsbeiträgen entsprechend passiert? Bei dem Zweifelsfall kann es halt sein, dass dann die Krankenversicherung sagt, in Deutschland gilt Versicherungspflicht. Wenn kein Arbeitsentgelt fließt, aus dem dann entsprechend die Beiträge bezahlt werden können, müssen sie das entsprechend als Arbeitnehmer in Eigenleistung machen. Und dann hängt das davon ab, was man tatsächlich im Sabbatical macht. Also macht man da irgendwie nur Urlaub und bekommt kein Einkommen oder macht man das, weil man sich irgendwie eine Selbstständigkeit aufbauen möchte oder wie auch immer und bekommt dann trotzdem irgendwie Einkommen danach, bemisst sich das dann, soweit ich weiß, von der Krankenversicherung auch, wie hoch die Beiträge dann sind. Das ist ganz wichtig zu klären und natürlich auch nochmal im Vorfeld mit der Rentenversicherung in Deutschland kurz schließen. und sich vielleicht auch nochmal darüber aufklären lassen, ob es gegebenenfalls negative Auswirkungen auf die Rentenansprüche quasi gibt und wie hoch das vielleicht auch ausfallen würde. Also wenn man halt für ein halbes Jahr keine Versicherungen oder keine Beiträge in die Rentenversicherung einzahlt, dann kann es natürlich auch sein, dass dann im Alter die Rente entsprechend niedriger ausfällt, als man sich das vielleicht so oder so wünschen würde.",
            "start": 3217446,
            "end": 3326026,
            "confidence": 0.8254644067796613,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wenn man sich das Gehalt irgendwie dann aufteilt über mehrere Monate, dass pro Monat doch was Kleines fließt, ist das dann schon das bezahlte Sabbatical?",
            "start": 3326246,
            "end": 3333550,
            "confidence": 0.8184230769230769,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau, das ist dann schon das bezahlte Sabbatical. Das ist die zweite Form. Da kann ich dann mit meinem Arbeitgeber darüber sprechen und sagen, pass mal auf, ich möchte gerne ins Sabbatical gehen. Ich möchte aber trotzdem während der Zeit, in der ich nicht arbeite, eine gewisse finanzielle Sicherheit haben in Form von Gehalt. Und das kann man dann quasi vertraglich entsprechend vereinbaren. Also viele Arbeitnehmerinnen und Arbeitnehmer sagen dann, okay, ich möchte ein Sabbatical machen von drei oder von sechs Monaten und möchte gerne während der Freistellungszeit trotzdem 50 Prozent meines Gehaltes bekommen. Wie funktioniert das? Man macht quasi mit dem Arbeitnehmer oder zwischen Arbeitnehmer und Arbeitgeber entsprechende Vereinbarungen über das bezahlte Sabbatical. Es gibt dann eine sogenannte Ansparphase. Das ist dann die Zeit vor dem Sabbatical, wo dann die Arbeitszeit quasi reduziert wird. Die vertragliche Arbeitszeit wird dann in dem Beispiel auf 50 Prozent reduziert und der Arbeitnehmer arbeitet aber trotzdem in Vollzeit weiter und baut damit einen Überstundenkontingent quasi auf. Und dieses Überstundenkontingent feiert dann der Arbeitnehmer die Arbeitnehmerin während der Freistellungsphase entsprechend ab. Also wenn ich jetzt sechs Monate ins bezahlte Sabbatical gehen möchte mit dieser 50-50-Regelung, dann würde meine Ansparphase mit den Überstunden sechs Monate vor Sabbatical-Beginn starten. Und dann läuft dann das quasi sechs Monate als Teilzeitarbeitsverhältnis mit Aufbau von Überstunden vor sich her. Dann kommt der Tag X, wo mein Sabbatical entsprechend anfängt. Der Arbeitnehmer, die Arbeitnehmerin ist in der Freistellung, bekommt trotzdem 50 Prozent des Gehalts weiterbezahlt, weil ja die Überstunden aufgebaut wurden. Und damit fließen dann auch Sozialversicherungsbeiträge an die Krankenkasse, beziehungsweise auch an die Rentenversicherung, Arbeitslosenversicherung entsprechend weiter. Und dann ist das Sabbatical irgendwann vorbei und der Arbeitnehmer oder die Arbeitnehmerin kommt dann wieder zurück ins Unternehmen.",
            "start": 3333610,
            "end": 3444372,
            "confidence": 0.8309128919860623,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und nachdem wir das Weniger-Arbeiten-Podcast jetzt geworden sind, Es gibt ja noch den sogenannten Bildungsurlaub und der Bildungsurlaub ist eigentlich eben genau diese Frage, die uns Yvonne aus unserer Community gestellt hat, wie es denn mit dem Bildungsurlaub aussieht. Ob das eigentlich bekannt ist, ob der genutzt wird, war auch ihre Frage, so in der Industrie. Ich als Österreicher habe dann sehr lachen müssen, wie ich da mal gegoogelt habe, was ein Bildungsurlaub in Deutschland ist, aber vielleicht lass ich das dich beantworten, bevor ich kurz erwähne, was wir in Österreich so haben als Gegenwert. Man kommt sich da teilweise so vor, wie wenn man hört, dass die Schweizer, glaube ich, jetzt endlich Vätern erlauben, fünf Tage Vaterschaftsurlaub oder so zu machen. Aber bitte, erklär uns mal, was Bildungsurlaub ist vielleicht.",
            "start": 3444412,
            "end": 3485879,
            "confidence": 0.8006259541984733,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich bin sehr gespannt, was du gleich über Österreich erzählen wirst, aber ich erzähle gerne erstmal was über die deutsche Situation. Grundsätzlich gilt, Bildungsurlaub in Deutschland ist Ländersache. Das heißt, wir haben in Deutschland ein föderales System. Und jedes Bundesland kann für sich selber entscheiden, ob es Bildungsurlaub anbieten möchte und wenn ja, wie viel und unter welchen Voraussetzungen. In Deutschland haben wir 16 Bundesländer. Mallorca lassen wir jetzt mal außen vor als 17. Bundesland. Und von den 16 Bundesländern, die wir tatsächlich haben, bieten 14 Bundesländer entsprechend Bildungsurlaub an. Die einzigen beiden Bundesländer, die, soweit ich weiß, aktuell keinen Bildungsurlaub haben, sind Bayern und Sachsen. Und ich meine, ich bin selber in Nordrhein-Westfalen geboren, aufgewachsen, ich arbeite hier, deswegen werde ich mich jetzt schwerpunktmäßig auch auf Nordrhein-Westfalen einschießen, sage ich jetzt einfach mal. Und hier gibt es die Möglichkeit, Bildungsurlaub zu beantragen. Das sind fünf Tage pro Jahr, pro Arbeitnehmer. Vorausgesetzt, es ist natürlich eine Beschäftigung, die auch an fünf Arbeitstagen pro Woche entsprechend stattfindet. Und theoretisch hast du auch als Arbeitnehmer den Anspruch, deinen Anspruch auf Bildungsurlaub von zwei Jahren entsprechend zusammenzufassen. Das heißt, wenn du jetzt in 2023 deinen Bildungsurlaub von fünf Tagen nicht nimmst, aber weißt, dass du in 2024 gerne in den Bildungsurlaub gehen möchtest, dann könntest du die Ansprüche aus diesen beiden Jahren quasi zusammenpacken und dann in 2024 entsprechend nutzen. Ganz wichtig ist, Bildungsurlaub ist genehmigungspflichtig vom Arbeitgeber. Das heißt, du kannst nicht einfach sagen, so lieber Arbeitgeber, ich bin jetzt mal im Bildungsurlaub. Die gesetzliche Regelung sagt, dass Bildungsurlaub gewisse Kriterien erfüllen muss. Dazu gehört zum Beispiel, dass es eine anerkannte Weiterbildung ist. In Nordrhein-Westfalen können zum Beispiel nur Weiterbildungen, die beruflich oder politisch motiviert sind, entsprechend vom Bildungsurlaub abgedeckt werden. In anderen Bundesländern gehören auch noch mal kulturelle Aspekte mit dazu. Aber in Nordrhein-Westfalen muss es entweder der beruflichen oder der politischen Bildung entsprechend dienen. Es muss auch eine zertifizierte oder akkreditierte Bildungseinrichtung sein. Es müssen mindestens acht Stunden täglich stattfinden. Eine Unterrichtsstunde ist mindestens 45 Minuten lang und die Weiterbildung darf auch nicht mehr als 500 Kilometer von der NRW-Landesgrenze entsprechend entfernt sein. Wenn diese Kriterien erfüllt sind, dann kann man entsprechend den Bildungsurlaub beim Arbeitgeber beantragen und der Arbeitgeber prüft dann die eingereichten unterlagen und gibt dann offenlich sein grünes licht am am ende.",
            "start": 3485899,
            "end": 3655768,
            "confidence": 0.8191584415584416,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich meine zertifiziert und akkreditiert das sind ja schon sehr große unterschiede akkreditiert soviel ich weiß macht das land oder der bund und ich kann dir patrick ja jetzt ein zertifikat ausstellen für den schönsten düsseldorfer der in köln arbeitet also ich meine das ist ja das ist ja schon ist ja schon unterschied oder.",
            "start": 3655808,
            "end": 3674212,
            "confidence": 0.7828363636363639,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gebe ich dir recht, ich habe mich da vielleicht nicht klar genug ausgedrückt. Also es müssen offiziell anerkannte Weiterbildungseinrichtungen sein, also offiziell anerkannt vom Land NRW.",
            "start": 3675257,
            "end": 3684989,
            "confidence": 0.8398076923076924,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gibt's da irgendeine Liste oder sowas, wo ich das nachgucken kann? Weil für mich als Arbeitnehmer wäre es ja schon interessant, wenn ich sagen würde, ich bin ein Software-Ingenieur und möchte mich weiterbilden, dass ich davon ja wirklich profitiere. Wenn ich jetzt mich im Bereich Linux weiterbilden möchte, dann hole ich mir dann jetzt aus dieser Liste irgendeinen Workshop-Anbieter, der dann zertifiziert ist und dann kriege ich ja den Urlaub, oder?",
            "start": 3685480,
            "end": 3706196,
            "confidence": 0.798394366197183,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja. Also es gibt da definitiv eine Liste. Einfach mal Google aufmachen, Bildungsurlaub NRW entsprechend eingeben.",
            "start": 3706256,
            "end": 3713770,
            "confidence": 0.7908125,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nur um explizit zu sein, die klassische Webkonferenz zählt leider nicht dazu.",
            "start": 3713790,
            "end": 3718834,
            "confidence": 0.8750833333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Würde ich jetzt nicht mal pauschal so sagen. Es kommt natürlich darauf an, ob sie entsprechend beim Land NRW jetzt in dem Fall gelistet ist oder nicht. Ich gebe jetzt mal ein blödes Beispiel. Es ist natürlich jetzt keine Webkonferenz, aber als ich damals noch berufsbegleitend studiert habe, habe ich damals ein Kompaktmodul besucht und dieses Kompaktmodul in der Uni konnte ich mir als Bildungsurlaub entsprechend anrechnen lassen. Also wenn jetzt zum Beispiel der Anbieter oder der Veranstalter dieser Webkonferenz auf das Land NRW zugeht und sagt, hey, wir haben hier eine berufliche Bildung und das sind mindestens acht Stunden, die wir tagtäglich machen, fünf Tage etc. pp., dann kann das natürlich schon sein, dass das mit da drunter fällt. Wie groß die Wahrscheinlichkeit ist, kann ich jetzt nicht sagen. Ich würde jetzt mal aus meinem Bauchgefühl sagen, dass es eher eine Ausnahme sein wird, aber in der Theorie wäre es möglich, würde ich jetzt mal sagen.",
            "start": 3718854,
            "end": 3768518,
            "confidence": 0.786356687898089,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wäre natürlich schon geil, wenn sich jetzt Konferenzorganisatoren, die diese Podcast-Episode hören, sich beim Land NRW oder bei Deutschland als zertifizierter Bildungsträger registrieren und somit ganz viele Leute dann irgendwie Bildungsurlaub nehmen könnten, weil sie dann zur Konferenz gehen. Also ich glaube, den Tipp müsste ich mal an die ganzen Konferenzorganisatoren schieben.",
            "start": 3769177,
            "end": 3787327,
            "confidence": 0.8192307692307695,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Oder zumindest, dass sie sich einfach mal erkundigen, ob das überhaupt möglich wäre. Und das Coole ist, da hat uns Corona tatsächlich ein Stück weit nach vorne gebracht. Früher mussten es zwingend Veranstaltungen sein, die in Präsenz stattfinden. Dann gab es eine Übergangsregelung in Nordrhein-Westfalen, dass auch digitale Geschichten, also Online-Geschichten zulässig sind. Und diese Übergangsregelung ist jetzt zur Dauer geworden. Das heißt, das wurde dann auch entsprechend im Gesetz verankert. dass jetzt auch digitale Weiterbildungsangebote, die alle anderen Kriterien für Bildungsurlaub entsprechend erfüllen, auch quasi darüber abgedeckt werden können.",
            "start": 3787995,
            "end": 3824882,
            "confidence": 0.8146555555555552,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So, jetzt habe ich festgestellt, in Deutschland ist das natürlich alles kompliziert. Mich würde natürlich schon interessieren, wenn das jetzt auch Mallorca im 17. Bundesland ist. Aber wie ist das denn im kleinen Deutschland, im Österreich?",
            "start": 3825123,
            "end": 3835386,
            "confidence": 0.7248333333333332,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich probiere das kurz zu machen. Es gibt ja diesen berühmten Faktor 10. Also wir sind zehnmal kleiner als Deutschland. Ich probiere es jetzt also in einem Zehntel der Zeit zu erklären. Wenn man das ganz kurz zusammenfasst, bei uns heißt es Bildungskarenz, wenn es Fulltime ist oder Bildungsteilzeit, wenn es eben nur Teilzeit ist und im Endeffekt läuft es so, die Minimalzeit von einer Bildungskarenz ist zwei Monate, maximal zwölf Monate innerhalb vier Jahren und du bekommst da einfach das Arbeitslosengeld. Auf gut Deutsch. Das ist eigentlich die Regel. Und du musst natürlich auch dann an der Uni irgendeine Fortbildung machen oder sonst irgendwas. Also da sind die Regeln dann ähnlich. Aber im Prinzip sind es zwei bis zwölf Monate. Fulltime oder Teilzeit. Ich hoffe, das war in einem Zehntel der Zeit. Und es ist natürlich simplifiziert. Also da hängt schon noch ein bisschen was dran und es muss genehmigt werden und so weiter. Aber es zahlt nicht die Firma, sondern es wird dann als öffentliche Hand bezahlt.",
            "start": 3835406,
            "end": 3883659,
            "confidence": 0.7715235294117648,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und in Deutschland, wer zahlt das? Die Firma, oder?",
            "start": 3883739,
            "end": 3886221,
            "confidence": 0.3861111111111112,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich musste gerade ganz kurz überlegen. In Deutschland zahlt der Bildungsurlaub der Arbeitnehmer tatsächlich selber. Das heißt, der Arbeitgeber stellt dich für die Zeit des Bildungsurlaubs frei. Du musst deine Arbeitsleistung nicht erbringen. Und du hast dann aber auch tatsächlich nur den Bildungsurlaub für die Bildungsmaßnahme, die du machst. Aber alles, was an Kosten wie Anfahrt, Hotel, Frühstück, Mittagessen oder die Weiterbildung an sich angeht, sind Sachen, die als Arbeitnehmer in Eigenregie übernommen werden müssen.",
            "start": 3886261,
            "end": 3918686,
            "confidence": 0.8571066666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn der Arbeitgeber jetzt aber irgendwie so ein Learning Budget oder so freigibt, kann ich das dafür natürlich nutzen.",
            "start": 3918706,
            "end": 3923090,
            "confidence": 0.7793157894736844,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, also wir zum Beispiel haben ein Learning Budget für unsere Mitarbeiter und wir geben auch für Weiterbildungen, die nicht im klassischen Sinne des Gesetzes als Bildungsurlaub gelten, den Mitarbeitern den Bildungsurlaub.",
            "start": 3923567,
            "end": 3938352,
            "confidence": 0.8345,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich muss zugeben, ich habe in meiner ganzen Karriere noch nie Bildungsurlaub genommen. Ich habe so gerade so ein bisschen das FOMO-Gefühl, dass ich da echt ein paar Urlaubstage irgendwie verschwindet habe. Aber es sind ja keine Urlaubstage, weil man bildet sich ja weiter, also von daher.",
            "start": 3938592,
            "end": 3951937,
            "confidence": 0.780063829787234,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, da fehlt halt die Motivation zur Fortbildung bei dir, Andi.",
            "start": 3952350,
            "end": 3956994,
            "confidence": 0.7828181818181817,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich wollte gerade noch sagen, für mich ist das Wort Bildungsurlaub tatsächlich an der Stelle ein bisschen irreführend. Urlaub verbinden viele mit Sonne, Strand, Städtetrips, wie auch immer, also Erholung. Und in dem Fall ist es ja kein keine Auszeit für die Erholung, sondern du tust dir etwas dafür, um dich politisch oder beruflich weiterzubilden. Du sitzt ja nicht auf der faulen Haut und lässt es dir gut gehen, sondern du machst ja tatsächlich etwas. Deswegen Bildungsurlaub ist da vielleicht an der Stelle nicht so das präziseste Wort, was der Gesetzgeber sich da ausgedacht hat.",
            "start": 3957054,
            "end": 3989298,
            "confidence": 0.8171684210526315,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber jetzt mal zusammenfassend, diese ganzen Strategien, um weniger zu arbeiten, das seid dann ihr eigentlich die Ansprechpartner, oder? Also ihr als HR könnt helfen, weniger zu arbeiten und seid da eigentlich die Partner für das Ganze?",
            "start": 3989759,
            "end": 4004674,
            "confidence": 0.8619459459459462,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir sind definitiv die richtigen Ansprechpartner im Unternehmen, um diese ganzen Themen rund um Arbeitszeitverringerung, Sabbaticals etc. zu besprechen und auch über die Möglichkeiten diskutieren. Nichtsdestotrotz sollte das Ganze auch immer mit dem eigenen Fachvorgesetzten oder disziplinarischen Vorgesetzten gemacht werden. Also wir aus der People-Perspektive, also aus der Personalperspektive, werden keine Entscheidung für oder gegen etwas treffen, ohne dass das Buy-in des direkten Vorgesetzten quasi fehlt. Weil wir können natürlich aus der People-Team-Perspektive nicht abschätzen, okay, ist das jetzt genau der richtige Zeitpunkt für ein Sabbatical? Oder wird die Person da gerade im Projekt XYZ entsprechend gebraucht? Oder solltest du jetzt irgendwie doch irgendwie einen Monat früher anfangen oder einen Monat später oder wie auch immer, ne? Deswegen solche Sachen entscheiden wir nicht in Eigenregie, sondern immer in Absprache mit dem Fachbereich. Deswegen einfach auch Sparingspartner und strategischer Partner auf Augenhöhe.",
            "start": 4004714,
            "end": 4071135,
            "confidence": 0.8512765957446808,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hast du uns ganz viele Tipps gegeben, wie wir als Arbeitnehmer uns das Leben erleichtern können, indem wir weniger arbeiten. Jetzt würde ich gern mal von dir wissen, da du ja immer in tech- oder tech-orientierten Unternehmen gearbeitet hast, was würdest du dir von uns Techies wünschen, womit wir dir dein Leben als Personaler, als HR-Mensch erleichtern können? Sei es von Elites, sei es von Individual Contributors.",
            "start": 4071175,
            "end": 4100348,
            "confidence": 0.8580147058823532,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Moment, ich muss da jetzt kurz reingrätschen. Ist Personala eigentlich eine Beleidigung für dich als Wort oder ist das okay? Für mich hat das so einen negativen Unterton immer, Personala.",
            "start": 4101228,
            "end": 4111635,
            "confidence": 0.7301666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also für mich ist es vollkommen fein. Ich verstehe, dass du sagst, es ist irgendwie was Negatives mit dran, aber ich nehme es nicht als Beleidigung auf. Ich wüsste jetzt gerade auch aus dem Stegreif nicht, wie ich mich anders bezeichnen würde. Also von daher alles gut.",
            "start": 4111975,
            "end": 4124344,
            "confidence": 0.7553191489361702,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, also dann, was wünscht sich der Personaler von den Techies? Techies ist ja auch so eigentlich fast ein Schimpfwort, würde ich jetzt nicht sagen, aber zumindest ein eigenartiges Wort, ja.",
            "start": 4124663,
            "end": 4133549,
            "confidence": 0.6987419354838709,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was wünsche ich mir? Das ist eine gute Frage, vor allem in Bezug auf Recruiting. Ich meine, wir haben ja vorhin schon sehr im Detail darüber gesprochen, wenn eine neue Stelle online geht und ich aus der Personalperspektive im Recruiting mit drin stecke, dann wünsche ich mir im Idealfall jemand aus dem Techfachbereich, der auf der einen Seite die Geduld und auf der anderen Seite auch das notwendige Einfühlungsvermögen mitbringt, mir wirklich zu erklären, was dieser Job, für den wir jetzt gerade rekrutieren, mit sich bringt. Das hört sich halt für mich als Personaler manchmal so weit weg an, weil mein Job, den ich mache, der hat halt null mit Softwareentwicklung an sich zu tun. Also ich bin jetzt nicht derjenige, der tagtäglich Code schreibt oder mit Datenbanken hantiert oder sonst irgendwas. Also ich brauche da jemanden an meiner Seite, der mir wirklich mal in Ruhe erklärt, okay Patrick, Das ist das Profil, das wir suchen. Wir suchen diese Person, um genau diese Aufgaben entsprechend zu machen, aus dem und dem Grund. Also das wirklich mit einer Engelsgeduld, das einfach auch mal versucht zu erklären und auf eine Art und Weise, dass das auch ein Nicht-Techie entsprechend verstehen kann. Ich weiß, Wenn ich mit meinen Personalkollegen rede, dann landen wir manchmal auch sehr schnell in Fachterminologie und außenstehende Leute können dann halt irgendwie nicht nachvollziehen, wo sind sie jetzt gerade. Und das habe ich halt in der Vergangenheit auch schon mal an der einen oder anderen Stelle. mitbekommen, mit Techies, die unter sich quasi gesprochen haben. Also, dass man dann halt Sachen als selbstverständlich wahrnimmt und man davon ausgeht, okay, die Personalabteilung, die hat uns ja mal irgendwann eingestellt, die wissen ja, was wir machen. Im Großen und Ganzen wissen wir natürlich, was Softwareentwickler machen, aber halt nicht im Detail. Deswegen entsprechend Geduld und auch das Einfühlungsvermögen, uns das immer und immer wieder so zu erklären, dass wir das einfach auch verstehen, weil letzten Endes sind wir diejenigen die im zweifelsfall das erste gespräch mit einem bewerber oder einer bewerberin hat oder haben und wir müssen die stelle verkaufen wir müssen das unternehmen repräsentieren und wir müssen auf die ersten fragen entsprechend eingehen und ohne verständnis unsererseits können wir halt keinen guten job abliefern im recruiting ich.",
            "start": 4133589,
            "end": 4268832,
            "confidence": 0.8243156498673737,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Glaube ich habe neues lieblingswort engels geduld.",
            "start": 4268852,
            "end": 4272173,
            "confidence": 0.2904285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Schön geduld ja Da möchte ich dir gleich ein Kompliment machen, weil damals, wie ich mitgehört habe, warst du mit diesem Einbürgerungsbüro oder wie das auch Ausländeramt... Ausländerbehörde. Ausländerbehörde, genau so heißt es. Was du da alles erwähnt hast am Telefon vom Paragraphen, ich habe da ein Paragraph 38 Fall und ob das Formular Paragraph XY schon da ist und so weiter. Wenn du mit mir gesprochen hast, hast du das nie erwähnt. Also du hast dieses Mapping von deiner Spezialwelt zu mir in die normale Welt immer sehr gut gemacht. Also vielleicht wünscht man sich halt genau auch von der anderen Seite, dass man die technischen Sachen möglichst einfach erklärt, damit es eben die andere Seite auch gut versteht.",
            "start": 4272193,
            "end": 4309739,
            "confidence": 0.7976583333333332,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das freut mich, dass es mir in dem konkreten Fall, den du gerade geschildert hast, gelungen ist. Und genau das ist halt das, was ich halt auch super cool finden würde und was uns, glaube ich, als Personalabteilung generell das Leben manchmal leichter machen würde.",
            "start": 4310079,
            "end": 4323692,
            "confidence": 0.8284888888888889,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielen lieben Dank für deine Zeit, um uns bezüglich Strategien des weniger Arbeitens zu erleuchten.",
            "start": 4323712,
            "end": 4332099,
            "confidence": 0.8918,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehr gerne. Schön, dass ich da sein durfte.",
            "start": 4332139,
            "end": 4333721,
            "confidence": 0.6908749999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du noch etwas spezielles was du unserer hörerinnen und hörern mit auf den weg geben möchtest was ihnen vielleicht noch helfen könnte oder möchtest du irgendetwas der großen weiten deutschen software engineering community mitteilen dann ist das jetzt.",
            "start": 4334261,
            "end": 4348122,
            "confidence": 0.7563846153846153,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Der Stelle nochmal ganz ganz ganz ausdrücklich betonen, dass eine Personalabteilung nie Dinge aus Boshaftigkeit oder aus sonstigen anderen negativen Gründen quasi macht. Also wir wollen tatsächlich für euch Ansprechpartner sein, auf Augenhöhe, wir wollen mit euch gemeinsam Dinge bewegen. Und ja, es gibt manche Prozesse, die vielleicht für den einen oder den anderen oder die eine oder die andere entsprechend nervig sind, bürokratisch sind etc. Seht es uns nach. Es gibt manchmal rechtliche Rahmenbedingungen, die es uns nicht anders realisieren lassen, als es irgendwie so zu machen. Wir wollen aber immer nur euer Bestes. Und wir wollen, dass wir mit euch auf Augenhöhe zusammenarbeiten können. Wir wollen, Euch in den Fokus stellen, wir wollen euer Leben leichter machen und wenn ihr das Gefühl habt, dass das vielleicht bei euch in der Personalabteilung doch nicht so ganz der Fall ist und ihr habt einen anderen Eindruck, dann versucht doch einfach mal das Gespräch zu suchen und zu sagen, hey, liebe Personalabteilung, Wir haben das bis jetzt immer so und so gehandhabt. Macht das nicht vielleicht Sinn, dass wir da einfach in eine andere Art und Weise der Zusammenarbeit gehen? Also in einem mehr kollaborativen Ansatz entsprechend überzugehen und auf Augenhöhe miteinander zu arbeiten, anstatt einfach nur Prozesse zu administrieren oder Papierakten von A nach B oder nach C zu bewegen. Das ist so das, was ich noch loswerden wollte.",
            "start": 4349303,
            "end": 4436398,
            "confidence": 0.8316768558951967,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also sagst du eher, man sollte eher mit Eis ins Büro kommen anstatt mit Boxhandschuhen?",
            "start": 4436978,
            "end": 4440700,
            "confidence": 0.5061333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Würde ich schon sagen. Oder mit Kuchen. Ich meine, wer kein Eis mag, macht vielleicht Kuchen. Ich weiß es nicht. Kuchen geht immer. Nee, Spaß beiseite. Also mir ist es halt einfach wichtig. Ich glaube, das ist nicht nur im beruflichen Kontext so, sondern es ist einfach auch im privaten Kontext, wenn man sich auf Augenhöhe begegnet und einfach davon ausgeht, dass beide Seiten gute Absichten und gute Intentionen haben. dann ist das Miteinander einfach auch wesentlich harmonischer. Und mit einem harmonischen Miteinander kann man einfach auch wesentlich mehr bewegen, als wenn man sich einfach nur gegenseitig irgendwie mit Anschuldigungen überhäuft oder mit dem Finger aufeinander zeigt. Deswegen mehr Liebe und mehr Miteinander. zwischen Personalern und Techies, anstatt sich einfach den Kopf immer ständig darüber zu zerbrechen, warum sind die Prozesse jetzt so sperrig, wie sie sind.",
            "start": 4441101,
            "end": 4492132,
            "confidence": 0.833832116788321,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das sind mal schöne abschließende Worte. Vielen, vielen Dank, Patrick, für deine Zeit und dass du uns auch gezeigt hast, dass du auch nur ein Mensch bist auf der anderen Seite, außer wenn du mit der Ausländerbehörde telefonierst. Das sind keine normalen Fähigkeiten mehr. Das ist schon übernormal.",
            "start": 4492152,
            "end": 4508239,
            "confidence": 0.80375,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das nehme ich mal als Kompliment.",
            "start": 4509279,
            "end": 4510500,
            "confidence": 0.576,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Natürlich, auf jeden Fall. Und ich vermute mal auch, wenn man mit dir zusammenarbeiten will in Zukunft, ihr habt wahrscheinlich auch viele Tech-Stellen offen und man kann sich wahrscheinlich auch bewerben oder dich wahrscheinlich sogar anschreiben, wenn man an irgendeiner Stelle Interesse hat, oder? Schätze ich mal.",
            "start": 4511401,
            "end": 4524432,
            "confidence": 0.7687021276595747,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Tatsächlich beides. Also gerne bei mir melden. Entweder über LinkedIn oder direkt per E-Mail. Ansonsten auch gerne bei uns auf der Internetseite von Eurowings digital vorbeischauen. Wir suchen in verschiedensten Teams verschiedenste Leute. Angefangen bei Frontend-Entwicklung über Backend-Entwicklung. Mobile-Entwicklung gehört auch mit dazu. Site-Reliability-Engineering, DevOps, Data-Architects, Data-Engineers. Also die komplette Bandbreite, falls auch Produktleute das heute zuhören sollten. Wir suchen auch Product Owner, also einfach gerne auf die Internetseite von Eurowings digital gehen und falls noch nichts passendes dabei ist, gerne einfach bei LinkedIn melden und dann schauen wir, ob da vielleicht in Zukunft irgendwelche Positionen noch in Planung sind oder ob wir was anderes finden können.",
            "start": 4524770,
            "end": 4569497,
            "confidence": 0.8320373831775706,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kontaktmöglichkeiten verlinken wir wie immer in den Shownotes. Patrick, vielen lieben Dank für dieses Gespräch. Danke für deine Zeit und wir sagen bis zum nächsten Mal.",
            "start": 4569517,
            "end": 4578663,
            "confidence": 0.793653846153846,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Tschüss. Danke an euch und danke nochmal, dass ich mit dabei sein durfte. Es hat Spaß gemacht und bis zum nächsten Mal vielleicht.",
            "start": 4579103,
            "end": 4586828,
            "confidence": 0.7850434782608694,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Tschau.",
            "start": 4587188,
            "end": 4587808,
            "confidence": 0.389,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Tschau. Tschüss.",
            "start": 4588028,
            "end": 4592071,
            "confidence": 0.392,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und vergesst nicht, die TagLead Masterclass der TagLeaders Academy mit dem Code Kiosk10 10% auf alle Angebote. Link in den Show Notes.",
            "start": 4592151,
            "end": 4599895,
            "confidence": 0.8035454545454545,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.8169438077045545,
    "audio_duration": 4600.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}