{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/a4d80c45-c3c5-4609-9331-e20e84e73a03/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "62zzqvhppl-1e36-4329-91ae-602bc4e4414a",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Der Klimawandel ist real. Da erzähle ich euch nichts Neues, denn wir pendeln zwischen den Extremen. Wenn die Sonne scheint, wird es direkt über 30 Grad. Wenn es regnet, sind wir sofort bei Starkregen mit 40 Liter und mehr pro Quadratmeter. Auf der anderen Seite steigt unser Energiebedarf immer und immer weiter. Alles wird digitalisiert, alles hat eine App, alles wird getrackt. Wie passt dies nun eigentlich zusammen? Der CO2-Ausstoß und Klimawandel sowie unser erhöhter Energiebedarf? Gegebenfalls sind wir, Softwareentwickler und Softwareentwicklerinnen, Teil des Problems. Also, wie sieht es in der Welt der Softwareentwicklung und Infrastruktur eigentlich aus? Was können wir, die Leute aus der Welt der Softwareentwicklung und Infrastruktur, nun eigentlich tun, um unseren CO2-Fußabdruck unter Kontrolle zu halten bzw. zu senken? Und zuallererst, für wie viel Kohlendioxid sind wir eigentlich verantwortlich bzw. haben unter unserer Kontrolle? Ihr merkt schon, sehr große Fragen. In dieser Episode werden wir uns mit dem Gast Christian Schepp-Schäfer ein bisschen Licht in das komplexe Thema der Green IT bringen. Es geht um die Herstellung und Nutzung von Client- und Server-Hardware, den Energieverbrauch von einzelnen Farben auf deinem Screen, welchen CO2-Fußabdruck ein Gigabyte Datenvolumen hat, Green Hosting bei Cloud Hyperscalern und vieles, vieles mehr. Und los geht's! Leute, die uns schon öfter im Podcast folgen, wissen ja, dass ich zumindest aus dem schönen Ruhrpott aus Duisburg komme und auch da leben möchte. Aber jetzt hat im Mai 2023 die WWF eine neue Studie veröffentlicht. Ihr wisst schon, diese Natur- und Umweltorganisation mit dem großen Panda als Logo. Die Studie heißt Dirty 30, also die Dreckigen 30 und da geht es um die Emissionen des Industriesektors in Deutschland. Natürlich habe ich mir diese angesehen und was passiert ist, sie haben sich 30 industrielle Anlagen ohne Raffinerien aus dem Jahr 2022 genommen und haben gemessen, wer von denen am meisten CO2 Emissionen ausgeschlossen hat. Erschreckenderweise oder offengesprochen nicht erschreckenderweise waren unter den ersten 12 Plätzen 7 Firmen aus Duisburg, speziell aus dem Eisen- und Stahlbetrieb. Dann habe ich mir diese Firmen mal genauer angesehen und 3 aus diesen Firmen sehe ich, wenn ich aus meinem Schlafzimmerfenster rausgucke. Wirklich, das ist kein Witz. Habe ich gedacht, das kann ja nicht sein. Ich muss irgendwie was ändern. Zeitgleich habe ich einen neuen Speaker für mein Meetup, den Web Engineering Düsseldorf, gesucht. Und da habe ich einen alten Freund angesprochen, den Christian Schäfer, den Shep. Und er hat zufälligerweise einen Vortrag über Sustainable Web Design unter anderem mit dem Fokus auf Green IT und Co vorbereitet. Und da habe ich gesagt, ich kann zwar jetzt nicht direkt was ändern, also ich kann jetzt nicht direkt rüber zu den Stahlanlagen gehen und sage, macht mal eure Hochöfen aus, aber was ich tun kann, ist wenigstens vielleicht mal eine Podcast-Episode zu diesem Thema aufnehmen und ein bisschen Awareness schaffen. Zumindest unter anderem für mich. haben wir uns gedacht, wir setzen uns heute mal in einer kleinen, illustrierten Dreierrunde zusammen und sprechen über das Thema Sustainable Web Design, Green IT und Co. Hallo Christian.",
            "start": 2534,
            "end": 189834,
            "confidence": 0.8251434262948198,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Illustren-Runde heißt es übrigens, nicht illustrierten Runde, aber wir sind wahrscheinlich auch illustriert.",
            "start": 189894,
            "end": 194581,
            "confidence": 0.8203076923076923,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Auf jeden Fall sind wir das. Hallo. Genau, ja, freut mich.",
            "start": 196123,
            "end": 198644,
            "confidence": 0.592,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich hatte jetzt schon deinen gebürtigen Namen Christian Schäfer genannt, aber ich bin mir gar nicht sicher, wie viele Leute dich unter diesem Namen kennen, denn irgendwie kennt dich jeder nur unter Shep.",
            "start": 198684,
            "end": 208106,
            "confidence": 0.847060606060606,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, also Christian Schäfer ist eher so für am Telefon melden, wenn ich nicht weiß, wer dran ist. Und Shep ist seit, also seit jeher mein Spitzname. Der wurde mir natürlich gegeben, den habe ich mir nicht selber ausgesucht und da haben sich die Leute darauf geeinigt. Versuche dann auch immer den sozusagen an den Mann und die Frau zu bringen.",
            "start": 208126,
            "end": 225672,
            "confidence": 0.7501803278688525,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wer bist du? Du bist Freelance Frontend Entwickler. Du bist regelmäßiger Speaker auf Konferenzen und Meetups. Du stehst selbst auf Bleeding Edge CSS Features und hast eine gewisse Liebe für Accessibility sowie für die Loading und Runtime Performance von Webseiten. Du bist Co-Organisator vom CSS Café, einem Online Meetup. Du bist Organisator von dem Webworker NRW Meetup, einem Offline Meetup. wir haben zusammen schon mal eine konferenz die sogenannte local host konferenz organisiert du bist im orga team der frontiers konferenz die in den niederlanden stattfindet und nebenbei machst du auch noch ein podcast den working draft podcast was habe ich noch vergessen.",
            "start": 225732,
            "end": 265034,
            "confidence": 0.8077766990291264,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich bin nur noch vorsitzender in einem förderverein aber sonst hast du glaube ich nichts vergessen.",
            "start": 265234,
            "end": 269436,
            "confidence": 0.5476470588235295,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie lange macht ihr den Podcast jetzt schon? Elf Jahre? Habe ich das richtig im Kopf?",
            "start": 269736,
            "end": 273739,
            "confidence": 0.7314999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, müsste länger sein. Also wir haben angefangen Ende 2010. Zwölfeinhalb Jahre.",
            "start": 273779,
            "end": 279043,
            "confidence": 0.8073333333333332,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Brauchen wir ja gar keine Werbung mehr dafür machen. Den kennt wahrscheinlich eh schon jeder. Nach 13 Jahren. Ihr wart da ziemlich früh am Start. Alle Adopters von Podcasts.",
            "start": 279063,
            "end": 287489,
            "confidence": 0.7609655172413795,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sozusagen. Ja, es gab einen Podcast noch ein älteren, die Technikwürze, den habe ich immer gerne gehört. Die haben dann irgendwann die Segel gestrichen.",
            "start": 287529,
            "end": 294995,
            "confidence": 0.7359166666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "An den kann ich mir auch noch erinnern, das war von der Runde von dem, von den Web Crowds, oder?",
            "start": 295295,
            "end": 300219,
            "confidence": 0.7807,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, ja. Den fand ich, fand ich echt gut. Und mir fehlte das. Und so wie bei den Meetups, also die fehlt mir genauso. Da ist eigentlich immer das Beste, dann zu sagen, okay, also sofern man irgendwie die Kapazität hat, dann pack ich das eben an. Also dann hat man das Problem für sich selber sozusagen so halb gelöst. Man ist natürlich jetzt involviert darin, aber so viele andere Leute freuen sich dann, so eine Plattform zu haben. Und ich freue mich auch, dass ihr euren Podcast macht. Meinen Podcast kenne ich ja, ich bin ja oft selber mit dabei. Das heißt, da kann ich dann nicht mehr reinhören hinterher oder könnte ich schon, aber das ist so wie sich selbst googeln.",
            "start": 300239,
            "end": 335184,
            "confidence": 0.7195447154471541,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Man muss ja fast sagen, dass du Mitschuld bist an unserem Podcast, weil wir hatten uns das ja mal überlegt, wir könnten sowas starten und dann hat Andi gemeint, wir fragen den Chef, der hat das Equipment, dann können wir das mal ausprobieren und du hast uns dann netterweise damals dein Equipment geliehen und mindestens die erste Episode war auf deinem Equipment aufgenommen.",
            "start": 335364,
            "end": 354176,
            "confidence": 0.8186031746031744,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Finde ich gut also ich kann auch kann da auch jeden zu ermutigen oder jede ein podcast zu machen.",
            "start": 354316,
            "end": 360563,
            "confidence": 0.7045263157894738,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Kommen wir mal zum thema und zwar thema green it themasustainable webdesign thema co2 emission die wir als softwareentwickler oder als internet menschen erzeugen, warum ist dir das thema wichtig warum liegt dir das am.",
            "start": 360603,
            "end": 374716,
            "confidence": 0.7756571428571427,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Herzen das ist jetzt würde ich sagen so ein bisschen rhetorische frage gerade in 2023 wo wir irgendwie diese statistiken sehen wie die dass die meeresoberfläche eben riesensprung in sachen erwärmung gemacht hat die adria ist so warm wie noch nie es gibt feuer auf sizilien auf griechenland es gibt stürme und überflutung und fußball großer oder vielleicht etwas kleiner als Fußball große Hagelkörner in Kroatien und Italien. Das Klima spielt, finde ich, dieses Jahr besonders verrückt, aber hat ja nicht erst dieses Jahr angefangen. Und ich bin immer mal wieder über das Thema gestolpert, aber eben nur so in Ausschnitten. Also ich habe jedes Mal gedacht, ach, das ist eigentlich echt ein cooles Thema und da würde ich irgendwie gerne mehr drüber wissen und ich habe dann einfach angefangen so ein bisschen material zu zu sammeln zu dem thema zu recherchieren zu verschiedenen themen und das ist halt eine echt krasse rabbit hole also da kann man wirklich sehr in sehr viele richtungen sehr lange recherchieren.",
            "start": 374736,
            "end": 433933,
            "confidence": 0.825700598802395,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Einen Moment noch, bevor wir tiefer in das Thema Green IT einsteigen. Wenn du CO2 einsparst, kommt das der Gesellschaft zugute. Wenn du zur Open Source kontributest oder dein Projekt quelloffen mit der richtigen Lizenz veröffentlicht, kommt dies ebenfalls der Gesellschaft zugute. Deswegen freuen wir uns besonders, dass unser Episodensponsor es sich zur Aufgabe gemacht hat, Open Source-Entwicklung zu unterstützen. Das Programm Media Tech Lab fördert innovative Open Source Projekte für die Medienlandschaft mit 50.000 Euro. Wolfgang hat bereits selbst letztes Jahr an diesem Programm teilgenommen. Erzähl mir doch mal bitte, wie das Ganze eigentlich abläuft.",
            "start": 434594,
            "end": 466403,
            "confidence": 0.6999583333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Klar. Gemeinsam mit einem Programmierkollegen haben wir eine kurze Beschreibung von unserer Idee im Bereich Podcast Analytics eingereicht. Und das Schöne daran ist, man kann als Zweierteam oder als Einzelperson die Ideen umsetzen. Und wenn die Idee dann ausgewählt ist, erhält man großzügige 50.000 Euro Förderung für die Projektlaufzeit von nur sechs Monaten. Und was ich besonders geschätzt habe, ist auch die Flexibilität. Ihr könnt das Projekt entweder in Vollzeit oder so, wie wir es gemacht haben, in Teilzeit umsetzen. Zusätzlich zu den 50.000 Euro bekommt man auch Zugang zu Medienunternehmen über das umfangreiche Netzwerk des Media Labs. Denn euer Projekt soll nicht nur umgesetzt, sondern im Idealfall auch von der Medienlandschaft erfolgreich verwendet werden. Die langfristige Perspektive ist ebenso wichtig wie die Initialförderung. Wir bauen zum Beispiel gerade eine Firma um unser Open Source Projekt auf.",
            "start": 466823,
            "end": 509043,
            "confidence": 0.8568978102189778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Euer Projekt muss jedoch nicht im Bereich Podcasting sein. Eine Idee im Bereich Medienlandschaft kann eigentlich alles sein, zum Beispiel Video Streaming, Augmented und Mixed Reality, Semantic Tagging, AI für Audio Transcriptions oder, oder, oder. Falls euer Interesse geweckt ist und ihr mehr über dieses Förderprogramm erfahren wollt, besucht doch einfach mal die Webseite des Media Lab Bayern. Dort findet ihr auch Informationen über bereits abgeschlossene Projekte und alles, was ihr für die Einreichung benötigt. Die Bewerbungsphase läuft übrigens vom 1. September bis zum 13. Oktober. Also hopp hopp und ran mit deiner Idee. Links wie immer in den Shownotes. Werbung Ende.",
            "start": 509563,
            "end": 543107,
            "confidence": 0.8359117647058826,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hast du ein paar Zahlen für uns, was denn so die ganze IT eigentlich für eine Rolle spielt in dem ganzen Bereich? Weil jetzt wenn Andi was ändern will, Andi hat ja relativ viele Quadratmeter Rasen wenigstens und ein paar Bäume, da macht er eh schon einiges richtig, muss man ja auch dazu sagen. Keine Ahnung, ob du das Stahlwerk um die Ecke schon kompensieren kannst dadurch, aber welche Möglichkeit haben wir denn überhaupt?",
            "start": 543147,
            "end": 564940,
            "confidence": 0.7779999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist natürlich, also außer dem, was wir direkt imitieren, sozusagen in Form von Methan und CO2, kann man das nur indirekt messen. Also es geht im Prinzip darum, dass wir einfach die Emissionen von CO2 reduzieren wollen. Das heißt also, letztlich sollten wir weniger Energie verbrauchen für das, was wir tun. Zumindest so lange, wie nicht die gesamte Energie, die wir erzeugen oder auf die wir zurückgreifen können, CO2-neutral produziert wird. Genau, und es gilt eben herauszufinden, wie hoch ist denn eigentlich der von uns herbeigeführte Stromverbrauch und wie dreckig ist der Strom, den wir bei unseren Tätigkeiten verbrauchen. Und da gibt's halt viele Schaltstellen, an denen wir Strom verbrauchen. Also auch als digitale Konsumenten verbrauchen wir schon Strom. Ich hab mal in meiner Fritzbox nachgeguckt, wie viel Daten ich so pro Monat durch die Gegend schiebe, beziehungsweise unser Haushalt. Und das war jetzt im Juni waren das 1,3 Terabyte an Daten. Und das, obwohl wir die letzte Woche weg waren. Das heißt also wahrscheinlich sind es eher vielleicht 1,7 Terabyte. Und diese Datenmenge, das sind Video Streams, das sind, weiß ich nicht, alle möglichen Dinge, die wir tun. Und dann muss man eben schauen, wie dreckig wird denn dieser Strom erzeugt, der zum Beispiel für das Video Streaming benötigt wird.",
            "start": 564960,
            "end": 649380,
            "confidence": 0.840419811320755,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was für mich auch immer wichtig ist, ist ja eigentlich, auch wenn jetzt wir davon ausgehen, dass wir jetzt nur erneuerbare Energien hätten, die Energiequellen sind natürlich trotzdem endlich. Und so wie es aussieht, brauchen wir in Zukunft immer mehr Energie. Also alleine der IT-Sektor wird sich um 50 Prozent erhöhen, sind so die Schätzungen bis 2030. Und in anderen Bereichen mit Elektroautos und so weiter wird es noch viel stärker werden. Das heißt, das Sparen ist sowieso angesagt.",
            "start": 649815,
            "end": 676467,
            "confidence": 0.8309873417721518,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, also das Sparen ist auf jeden Fall die Devise. Man weiß nicht, ob wir irgendwann mal in so einen Bereich kommen, wo wir wirklich problemlos so viel Strom erzeugen können, wie wir uns gerne nehmen möchten, aber wahrscheinlich wird das wird das nie passieren.",
            "start": 676787,
            "end": 689596,
            "confidence": 0.8073111111111113,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe gerade mal nachgeschaut, ich habe auch eine Fritzbox. Im Vormonat habe ich 600 Gigabyte Datenvolumen gehabt. Was macht ihr bitte mit dem Dreifachen?",
            "start": 689877,
            "end": 702308,
            "confidence": 0.8279199999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist wahrscheinlich so, wie man ja auch sagt, irgendwie ein Vier-Personen-Haushalt verbraucht. 6 kilowattstunden glaube ich oder 6000 ich weiß es nicht auf jeden fall ist es so ein vier personenhaushalt liegt halt vom stromverbrauch höher als ein zwei personenhaushalt ich glaube ihr seid zwei personen und hund der hund hat wahrscheinlich kein netflix und ich habe aber zwei kinder die youtube gucken und eine frau die viel in video calls ist Jetzt ist es.",
            "start": 702348,
            "end": 727062,
            "confidence": 0.7920526315789476,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja so, jetzt arbeiten wir alle drei im IT-Sektor. Und ich hab das Gefühl, seit ich diesen Job ausübe, wird das immer mehr und mehr und mehr. Es gibt für alles eine App. Jede App braucht irgendwie eine Backend-API. Es kommen immer mehr Cloud-Regionen hinzu. Cloud-Regionen werden teilweise in Island oder Ähnliches gebaut, wo es schon von Haus aus ein bisschen kühler ist, damit man weniger Energie benötigt, um das Datacenter zu kühlen und so weiter und so fort. Und jetzt sprechen wir irgendwie über Green IT. Ich frage mich, ist das eigentlich der richtige Ansatz, dass wir sagen, okay, wir erweitern die komplette IT-Infrastruktur und immer mehr Digitalisierung, Digitalisierung, Digitalisierung und dann schauen wir mal, wie betreiben wir dies denn irgendwie ökologisch sinnvoll. Wäre es dann nicht ganz einfach, besser, dass wir weniger Datacenter bauen und mal halt, ich sag mal, diesen alles-muss-eine-App-sein-Movement stoppen.",
            "start": 727082,
            "end": 785395,
            "confidence": 0.8382206896551723,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das wär sicherlich hilfreich. Es hängt ja auch ein bisschen davon ab, wofür wir die Datacenter bauen. Also, man liest ja auch immer, dass zum Beispiel so KI-Modelle ziemlich viel Energie ziehen. Und da kann man eben überlegen, ist das eben nötig, so viel Energie auf in KI zu lenken? Also, ist natürlich cool. Ist auch toll, was die da irgendwie machen mittlerweile. Und dann gibt's eben andere Dinge, die vielleicht Papier, tote Bäume sparen, die dann eben nicht bedruckt werden müssen. Da könnte es schon sinnvoll sein. Oder wir kaufen ja auch weniger CDs, weniger DVDs, die müssen nicht hergestellt werden, die landen später nicht im Müll, weil eine DVD dann irgendwann irgendwie kein Mensch mehr die angucken möchte, weil die Auflösung zu niedrig ist. Also solche Sachen sind nicht per se irgendwie schlecht.",
            "start": 785435,
            "end": 836638,
            "confidence": 0.8196444444444448,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also nur um da ein paar Zahlen auch dazu zu bringen, alleine bei JetGPT schätzt man, dass JetGPT pro Monat circa 4 Millionen Kilowattstunden benötigt, nur um die ganzen Anfragen zu beantworten. Also das ist schon eine ganz ordentliche Menge und da sprechen wir noch gar nicht von der Produktion, also von dem Herstellen von diesem Modell. Da gibt es ja auch so Zahlen, die der Gründer damals so erwähnt hat, dass das 100 Millionen Dollar gekostet hat, nur das Modell herzustellen, wenn man das dann umrechnet auf den Stromverbrauch, da steckt sich ja auch einiges dahinter. Wobei das ja noch wesentlich sinnvoller ist als dieses sehr oft bemühte Beispiel mit den Bitcoins, weil Bitcoins ist halt wirklich ein extrem großer Posten und braucht zum Beispiel 700 Kilowattstunden für eine Transaktion. Also das ist ja ungefähr, was ein Single-House-Halt so in einem halben Jahr verbraucht an Strom. Und das ist nur eine Transaktion. Also was Bitcoin pro Jahr verbraucht, ist so ungefähr das 20-fache von Österreich. Oder was hier im NRW das ganze Jahr verbraucht, ist was Bitcoin an Strom frisst. Ich glaube, es ist ein bisschen jetzt nach unten gegangen, aber da kann man natürlich wirklich über die Sinnhaftigkeit auch nachdenken, wobei natürlich KI-Modelle vielleicht noch sinnvoller sind oder vielleicht hoffentlich wenigstens sinnvollere Dinge in Zukunft auch machen und uns bringen. Ja. Aber um auf Andis Frage zurückzukommen, und darum geht es genau, um das Reduzieren. Und da haben wir natürlich als ITler natürlich auch einen großen Einfluss, weil jetzt muss ich auch wieder Zahlen bringen. Ich bin schon der Zahlen-Mensch fast. Aber die IT macht ungefähr 7% vom gesamten Stromverbrauch weltweit aus. 7 bis 10 Prozent, je nachdem, was man für Schätzungen nimmt. Das heißt, wenn wir als IT-ler dort reduzieren können oder was verbessern können, dann können wir auf diese 10 Prozent Einfluss nehmen, was natürlich ein riesen Boston ist. Und darum macht es meiner Meinung nach natürlich extrem Sinn, darüber nachzudenken, was wir als IT-ler machen können. Und da ist der Chef natürlich auch in die Tiefe gegangen und hat mal gekramt, was es denn so überhaupt gibt, was wir eigentlich machen können.",
            "start": 836958,
            "end": 965961,
            "confidence": 0.8290280112044817,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Fangen wir mal an, welche Komponenten es gibt. Also ich meine, wir sprechen hier von Web, wir sprechen hier von Programmierung. Das bedeutet, am Anfang steht natürlich erstmal der Server, wo läuft die Applikation drauf und dieser Server steht dann entweder bei uns im RAC, bei uns in der Co-Location, in einem Datacenter von Google oder Amazon. Dieser Server muss irgendwie hergestellt werden, das bedeutet, da sind Herstellungskosten. Dieser Server muss betrieben werden, also wirklich mit Strom. Dann gibt es natürlich auf der ganz anderen Seite unser Equipment, also mein Laptop, mein Bildschirm, der muss auch hergestellt werden, der muss auch betrieben werden. Und dann gibt es halt noch die Die dritte Komponente, das ist dann die Applikation. Die Applikation, die dann auf der einen Seite auf dem Server wirklich läuft und kontinuierlich Strom verbraucht. Weiß ich jetzt nicht. Wenn ich da jetzt zum Beispiel ein Large-Language-Model trainiere oder Bitcoin errechne, dann verbrauche ich sehr wahrscheinlich mehr Strom, als wenn ich eine kleine Java-App da laufen lasse, lehne ich mich einfach mal aus dem Fenster, kommt natürlich auf die Java App an. Und dann gibt es natürlich dann noch die kleinseitige Applikation, die dann auf dem Endkundenrechner läuft, also im Endeffekt im Browser, im JavaScript. Sind das diese vier Komponenten, die wir eigentlich dann so unter Kontrolle haben oder beziehungsweise betrachten sollten?",
            "start": 966161,
            "end": 1034178,
            "confidence": 0.7955855855855851,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja würde ich sagen also das sind das eigentlich die beteiligten Instanzen könnte das offener betrachten so muss ich in meinem Büro immer irgendwie Kaffeemaschine haben da kann man so ins kleine klein gehen aber das ist so im wesentlichen was du gesagt hast das was jetzt quasi zu diesem zu dem Fußabdruck gehört den wir ITler erzeugen.",
            "start": 1034798,
            "end": 1053300,
            "confidence": 0.7944827586206897,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Oh, das ist ein guter Punkt. Andi hat so eine Kaffeemaschine, ich nenne das gar nicht Kaffee.",
            "start": 1053500,
            "end": 1057582,
            "confidence": 0.5962352941176471,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "So ein Vollautomaten?",
            "start": 1057602,
            "end": 1058763,
            "confidence": 0.27566666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Noch viel schlimmer, so ein Filterding, was dann unten so ständig geheizt wird mit dieser Platte. Andi, also wenn du da was einsparen willst, ich vermute mal, diese Platte, wenn die ständig läuft und heizt, ist nicht das effizienteste.",
            "start": 1058783,
            "end": 1069950,
            "confidence": 0.8079230769230769,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Du musst das so sehen, bei meinem Kaffeekonsum, der mit hoher Wahrscheinlichkeit nicht gesund ist, bin ich mir auch nicht sicher, ob immer diese Siebträgermaschine zu starten dann effizienter ist. Fangen wir mal am Anfang des Übels an, fangen wir mal mit dem Client an. Also mit dem, was wir so hier haben.",
            "start": 1069970,
            "end": 1087077,
            "confidence": 0.8022264150943395,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wir können ja mal kurz die Hardware erwähnen. Da ist es ja so, das kennen wir ja auch vom Auto. So Autos, die wir lange nutzen, deren Herstellungskosten, die haben sich dann gelohnt. Wohingegen, wenn wir jetzt irgendwie Autos nur kurze Zeit benutzen und dann ... abstoßen und sie dann von jemandem genutzt werden, mehr eher ein Problem sind. Und so ist es im Prinzip auch mit unseren Geräten. Also je länger wir Geräte, die wir haben, nutzen, desto besser ist natürlich die Umweltbilanz dafür. Das ist ja nicht nur die Energie bei der Herstellung, sondern es ist ja auch das Material und vielleicht auch, was dann hinterher passiert, weil das ist ja auch oft verheerend für die Umwelt, wenn dann irgendwelche Riesenmüllhalden in Afrika irgendwo am Strand existieren, wo eben Menschen und auch vor allem Kinder drin rumpopeln und nach Rohstoffen irgendwie suchen und das Ganze quasi über dem Feuer wieder rausschmelzen.",
            "start": 1087117,
            "end": 1144222,
            "confidence": 0.8271103896103894,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es gibt ja mittlerweile auch ziemlich die Bewegung, dass man viel mehr in die gebrauchte Ecke geht, also gerade mit so Stores wie Refurb zum Beispiel, ohne als Werbung machen zu wollen, aber die sind halt sehr bekannt. Und ich glaube, viele nutzen das ja mittlerweile auch, dass man wirklich Hardware auch günstig kaufen kann, die noch sehr gut funktioniert und für die meisten ja auch wirklich ausreichend ist. Ist vielleicht jetzt für uns IT-Spezialisten weniger der Fall, weil das einfach unser Hauptgerät ist, so ein Laptop zum Beispiel, und das macht vielleicht da jetzt für uns Spezialisten keinen Sinn, da jetzt einen Gebrauchten zu kaufen. Höchstwahrscheinlich, würde ich mal sagen. Aber für ganz viele Menschen oder auch für uns ein Handy zum Beispiel kann ja durchaus Sinn machen, auf gebrauchte Hardware zurückzugreifen und da halt dann viel einzusparen und Man sieht auch bei den meisten Geräten, gerade bei Handys, dass natürlich die Produktion extrem viel Einfluss hat. Und wenn man da so Kuchendiagramme anschaut, wie viel die Produktion ist und wie viel dann die Laufzeit ist an CO2-Emissionen, dann gerade bei Handys ist da natürlich ein extrem großer Brocken bei der Produktion, der da anfällt und weniger das Laden vom Akku dann am Ende.",
            "start": 1144530,
            "end": 1211560,
            "confidence": 0.8144682926829269,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist das nicht irgendwie so ein Trugschluss, weil du sagst jetzt gerade, okay, ich soll meinen Rechner einfach länger benutzen, dann wird im Endeffekt weniger hergestellt, weil ich weniger was Neues kaufe. Aber wenn ich mir das halt so ansehe, was so ein moderner Rechner natürlich an Strom zieht, unter anderem vielleicht mit einer modernen CPU, einer ARM-CPU, die halt meines Erachtens nach oder meines Wissens nach bekannt dafür sind, weniger Energie zu verbrauchen, Kippt da nicht irgendwann die Balance, wenn ich jetzt irgendwie so einen Desktop-Rechner hab mit einem 800-Watt-Netzteil von vor zwölf Jahren? Mit dem kann ich noch super PHP programmieren oder Go oder Ähnliches. Wenn ich den nicht einfach gegen einen kleinen Laptop austausche, der ein deutlich geringeres Netzteil hat, deutlich effizientere CPU, also gibt's da nicht irgendwann die Balance und irgendwann kippt die?",
            "start": 1211858,
            "end": 1259148,
            "confidence": 0.7940364963503651,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, also irgendwann ist das sicherlich sinnvoll. Ich finde, man sollte das nur nicht als Argument nehmen, einen Rechner, der vielleicht irgendwie drei Jahre alt ist, dann abzustoßen, weil man halt Lust hat, zum Beispiel auf einen neuen Apple mit einem M2 Prozessor. Ich denke, wenn der Punkt gekommen ist, wo man sich ein neues Gerät holt, dann sollte man eben schauen, dass man diese Dinge in Betracht zieht oder auch schaut welche hersteller zum beispiel betreiben ihre fabriken vielleicht mit erneuerbare energie oder apple ist da ja relativ weit vorne soweit ich das weiß also ich bin kein hardcore apple nutzer aber das muss man denen auf jeden fall lassen dass sie da schon irgendwie wert drauf liegen auch was so den den abbau von rohstoffen angeht und so dass das irgendwie dass das vernünftig vonstatten geht Ich glaube, das.",
            "start": 1259468,
            "end": 1309359,
            "confidence": 0.8010141843971631,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wichtige bei diesen Berechnungen ist ja auch, wie sehr du eigentlich die neue Hardware ausnutzen kannst und brauchst. Weil wenn dein Rechner unter dem Tisch sowieso herum eidelt, dann hilft dir der neue Prozessor eigentlich wenig, weil der neue Prozessor wird erst recht herum eideln. Und wenn man das reine Netzteil ansieht, dann hast du meistens gleich starke Netzteile heutzutage, auch bei Laptops. Die sind alle ungefähr gleich geblieben, aber du bekommst natürlich viel mehr Rechenleistung pro Watt zum Beispiel raus. Wenn aber deine Rechenleistung sowieso nie gebraucht wird bei diesem Laptop und bei privaten Computern ist das höchstwahrscheinlich meistens der Fall. Im Serverbereich ist das natürlich was ganz was anderes, aber im privaten Umfeld macht das wahrscheinlich keinen Sinn. Also müsste man sich natürlich immer im Detail ausrechnen, aber ich würde mal sagen, dass gerade im privaten Umfeld gebrauchte Rechner oder Handys, sofern die ausreichen für dich, aber das tun die meisten ja auch, macht es viel mehr Sinn, weil die paar Prozent, die vielleicht ineffizienter sind, die werden durch die Produktionsemissionen eindeutig wieder aufgehoben. Wie gesagt, Server-Bereich ist was ganz anderes, aber im normalen Consumer-Bereich spielt es sicher weniger eine Rolle.",
            "start": 1309379,
            "end": 1376278,
            "confidence": 0.8394818652849741,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie sieht das denn bei den Bildschirmen aus? Weil ich denke da jetzt an solche speziellen Fälle wie große Gamer-Bildschirme, die dann speziell mit 144 Hertz laufen, damit man möglichst viele Frames per Second darstellen kann bei Counter-Strike und was weiß der Geier nicht. Dann sollte natürlich noch die Farbdarstellung super sein, speziell für Elemente wie ich bin jetzt Designer und weil Rot ist ja nicht gleich Rot und Weiß ist ja nicht gleich Weiß. kleine nette seitenstory mein kunstlehrer hat damals gesagt es gibt kein weiß und es gibt kein schwarz schwarz ist nur die völlige abwesenheit von licht und weiß ist die völlige anwesenheit von licht poetisch oder.",
            "start": 1376628,
            "end": 1414006,
            "confidence": 0.8269636363636359,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kommt aber auf das farbmodell drauf an ob additiv oder aber egal wie geht zu sehr in die tiefe eindeutig überlastig andy nur Es ist ja auf jeden.",
            "start": 1414026,
            "end": 1423551,
            "confidence": 0.73275,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Fall so, dass verschiedene Bildschirme eine verschiedene Farbdarstellung haben und umso mehr man in diese, ich möchte eine genauere Farbdarstellung geht, umso teurer werden dann auch in der Regel die Preise. Genauso wie eine höhere Herzrate für Gamer-Bildschirme oder ähnliches. Und ich gehe stark davon aus, umso größer der Screen ist, umso mehr Energie wird auch verbraucht. These, weiß ich jetzt nicht. Kann man da irgendwas machen? Oder ist das schon alles hochoptimiert im Bildschirmbereich? Oder kann ich da, okay, wenn ich das nehme, dann bin ich CO2-effizient.",
            "start": 1423571,
            "end": 1453332,
            "confidence": 0.8324318181818181,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es kommt halt drauf an. Tatsächlich ist es so, dass es gibt so eine Aufschlüsselung, welche Bestandteile zum Beispiel bei Videostreaming, wie viel Anteil am insgesamt dadurch verbrauchten Strom haben. Und die Displays haben da den höchsten Anteil dran. Und natürlich ist es so, je größer der Bildschirm, also je mehr Pixel leuchten müssen, desto mehr Strom verbraucht er. Das heißt also, Regel Nummer eins ist, wenn du mit einem kleineren Bildschirm klarkommst, dann ist das auf jeden Fall gut. Und dann gibt es eben noch unterschiedliche Display-Technologien, die allerdings nicht per se gut oder schlecht sind, sondern bei denen es auch so ein bisschen auf den Inhalt ankommt, den du auf diesem Bildschirm dann darstellst. Also klassisch kennen wir die LCDs, also Funktionsprinzip ist, man hat eine leuchtende Fläche im Hintergrund und Kristalle, die eben dieses Licht entweder durchlassen oder versuchen eben zu blocken, was ihnen so nicht vollständig gelingt. Darum hat man in der Regel auch keine richtig schwarzen Schwarzwerte, sondern immer so ein leichtes Grau. Und dann gibt's OLEDs und auch Mikro-LED, die allerdings noch ein bisschen Zukunftsmusik sind. In der Vergangenheit auch Plasma-Bildschirme. Bei denen ist es eben so, dass einzelne Pixel angesteuert werden und dann zum Leuchten gebracht werden oder eben nicht. Und das führt dazu, dass man auf diesen Bildschirmen maximales, also wirklich absolutes Schwarz in Kombination mit irgendwie hellen Bereichen zeigen kann. Aber das bedeutet eben auch, Je mehr helle Bereiche ich darstelle, desto höher steigt der Stromverbrauch von diesen Displays. Da sind dann die LCDs besser, weil denen ist es im Prinzip völlig egal, was gezeigt wird. Die Hintergrundbeleuchtung ist sowieso an. Ist natürlich auch alles nicht mehr so ganz wahr heutzutage, weil mittlerweile haben auch LCDs Das sind unterteilte leuchtende Backlights. Also das heißt, wenn du nur unten links irgendwas helles zeigst, dann schalten die ganzen anderen Teile des Backlights aus und dann ist noch unten links ein Backlight an. Und weil nur da brauchst du ja Licht, wenn du da was darstellst, sieht man eben aber auch, Weil, wenn man genau hinschaut, sieht man auch, dass das Schwarz um diese helle Fläche herum eben nicht vollständig schwarz ist. Und dann die Bereiche, wo das Backlight aus ist, die sind dann wirklich schwarz. Aber dadurch reduzieren die sozusagen die zu leuchtende Fläche auch.",
            "start": 1453792,
            "end": 1601592,
            "confidence": 0.8271623036649219,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt eigentlich, wir Entwickler sind automatisch alle stromsparend am Weg, weil wir den Black Dark Mode, heißt der, ich bin kein Fan übrigens von diesem Dark Mode, aber weil wir den Dark Mode alle verwenden, sind wir eigentlich stromsparend am Weg.",
            "start": 1601632,
            "end": 1613694,
            "confidence": 0.7567857142857144,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Im Grunde ja.",
            "start": 1613974,
            "end": 1614694,
            "confidence": 0.7253333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber auch nur, wenn ich ein OLED hab, oder? Weil du sagtest ja grad, bei einem LCD wird die Hintergrundbeleuchtung, also die Pixel, so oder so angestellt. Das bedeutet, wenn ich jetzt Dark-Mode-User bin, sollte ich mir ein OLED-Display kaufen, weil ich dann eco-friendly unterwegs bin. Ist das richtig?",
            "start": 1614734,
            "end": 1630600,
            "confidence": 0.779204081632653,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, also auf einem LCD hat der Dark-Mode relativ wenig Effekt.",
            "start": 1630640,
            "end": 1635021,
            "confidence": 0.7094545454545454,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber wenn wir jetzt mal zu unserem Bereich kommen, also zum Coding-Bereich, wo wir wirklich Einfluss haben, klar, haben wir auf die Hardware auch Einfluss, Über den Bereich, den wir eigentlich in der Hand haben, den wir produzieren, so wie eine Webseite, wie Code, können wir natürlich auch viel mehr Einfluss haben, weil sich das natürlich potenziert am Ende. Wenn ich eine Webseite baue, die in irgendeiner Form stromsparender ist und ich habe Millionen von User, dann habe ich dann natürlich einen extremen Hebel. Hingegen, wenn ich nur, unter Anführungszeichen, nur mein Display tausche, dann habe ich natürlich nur im kleinen Rahmen eine Möglichkeit.",
            "start": 1635061,
            "end": 1668788,
            "confidence": 0.8284326923076922,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, also basierend auf dem, was wir gerade gesagt haben, wäre es sinnvoll, wenn unsere User-Interfaces vielleicht standardmäßig im Dark-Mode daherkämen und man sozusagen einfach den Default umdreht. Und dann gibt es tatsächlich nochmal so eine weitere Unterschiede bei der Farbdarstellung, was allerdings auch wiederum nur bei OLEDs und MicroLEDs der Fall ist. Und zwar hat Google herausgefunden, dass die Farbe Blau mehr Strom zieht als zum Beispiel die Farbe Rot oder Grün und sich fast schon dem Weiß annähert. Und das liegt einfach an der Wellenlänge des Blau. Das Blau ist höherfrequentig und dadurch wird eben mehr Strom benötigt, eben ein Blau in der gleichen Helligkeit wie zum Beispiel ein Rot zu erzeugen. Das heißt also, die Kür wäre dann nicht nur ein Dark Mode auszuliefern, sondern eben auch die Farbe Blau zu vermeiden und vielleicht eher so erdige, natürlichere Farben in der eigenen CI oder in der App zu nutzen.",
            "start": 1669129,
            "end": 1733022,
            "confidence": 0.8474473684210525,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn du jetzt schon von der Kür sprichst und den blauen Farben, was wäre denn die Pflicht, wenn es um Webseiten geht und zum Stromsparen?",
            "start": 1733042,
            "end": 1740608,
            "confidence": 0.7991600000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, die Pflicht wäre eigentlich quasi im Frontend, also in dem darunterliegenden Code, kann man so als Richtschnur eigentlich sagen, alles, was so Web-Performance-Kriterien erfüllt, also das kennt man ja in Lighthouse, da gibt es ja so verschiedene Tests, die man da in diesem Google-Auditing-Tool durchführen kann. Und da gibt es eben diesen Web-Performance-Bereich. Die Dinge, die dort empfohlen werden, sind eigentlich auch Dinge, die gleichzeitig eco-friendly sind, weil es gibt zwei Aspekte. Das eine ist Datenmenge und der entsprechende dadurch also für die Übertragung benötigte Stromverbrauch und wiederum, wie der erzeugt wird und wie viel CO2 der freisetzt. Das kann man auf Electricitymaps übrigens sehen. Das ist so eine Webseite, die das anbietet. Da liegen wir in Deutschland so im Mittelfeld, weil wir noch relativ viel Kohle- und Gaskraftwerke haben. Das heißt also, wenn wir Daten erzeugen, die in Deutschland gehostet werden, in Deutschland übertragen werden und in Deutschland konsumiert werden, dann ist das eben schlechter als zum Beispiel in Frankreich, die sehr viele Atomkraftwerke haben und die dann kein CO2 erzeugen oder nahezu keins.",
            "start": 1741040,
            "end": 1816609,
            "confidence": 0.837085227272727,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Da habe ich übrigens gerade mal recherchiert, weil auf Electricity Maps waren die Gramm pro Kilowattstunde relativ niedrig und ich habe dann beim Umweltbundesamt, ich hoffe mal die haben richtige Zahlen bei euch, eine Zahl gefunden, dass ein Kilowatt 420 Gramm emittiert und ein Gigabyte hat ja ungefähr 0,8 Kilowatt. Das heißt man ist da schon bei einem Drittel Kilogramm pro Gigabyte sozusagen. Also das ist schon eine ganz ordentliche Menge.",
            "start": 1817269,
            "end": 1845437,
            "confidence": 0.8049436619718308,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, das ist immer so ein bisschen das Problem. Also das sind ja alles Hochrechnungen. Man muss sich einfach an irgendwas orientieren und da wird man eigentlich immer Abweichungen haben.",
            "start": 1845813,
            "end": 1855380,
            "confidence": 0.6159666666666668,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, und ganz abgesehen davon, wie gesagt, auch wenn man jetzt komplett erneuerbare Energien hat und ich komme aus Tirol und bei uns werden regelmäßig irgendwelche Täler mit Wasser geflutet und die Locals finden das weniger toll, aber trotzdem spricht man da natürlich von erneuerbaren Energien und es ist ja auch gut, aber trotzdem gibt's da auch Abstriche und gerade die Locals, die da gerne durch diese Natur gewandert sind, finden das weniger cool, wenn einfach ein Tal geflutet wird oder wenn irgendwelche Bäche abgeleitet werden und dadurch dann das Ökosystem Probleme dadurch hat in dieser Gegend. Also nur weil man erneuerbar ist, heißt es noch lang nicht, dass man einfach.",
            "start": 1855700,
            "end": 1894187,
            "confidence": 0.8501081081081079,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Energie jetzt gedankenlos verschwenden kann, ja.",
            "start": 1894247,
            "end": 1896629,
            "confidence": 0.6593333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn wir jetzt schon diese Zahlen in den Raum werfen, dann heißt es ja immer, okay, ich kompensiere das und ich pflanze einen Baum und das ist gut. Wie viele Bäume müsste ich denn jetzt zum Beispiel pflanzen, damit ich dieses Gigabyte Datenvolumen kompensieren kann? Also können wir das mal in Relation setzen? Ich kann mir das jetzt gerade nicht vorstellen. Ich meine, ich habe drei der dreckigsten Stahlerzeugungsindustrien direkt vor meiner Tür.",
            "start": 1897067,
            "end": 1921834,
            "confidence": 0.7771232876712328,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da musst du noch einiges pflanzen in deinem Garten. Können wir auf jeden Fall gleich zu kommen. Ich hatte ja gesagt, ich muss noch zu Ende ausführen, was das Frontend sozusagen für einen Fußabdruck hat, nämlich einerseits eben das Datenvolumen und das andere ist der Energieverbrauch in der Runtime. Das heißt also, ich kann ja theoretisch eine Seite shippen, die total klein ist, aber die JavaScript beinhaltet oder vielleicht auch sogar CSS, das einfach so ungünstig programmiert ist, dass ich dann sozusagen zur Laufzeit einfach wahnsinnig viel Strom verheize für Dinge, weil ich sie eben ineffizient durchführe. Also das sind so die zwei Aspekte, die man da betrachten muss. Und um deine Frage zu beantworten, dafür gibt es eine Seite, die das, die sagen wir mal, das zumindest für Webseiten versucht. Das ist die der Website Carbon Calculator. Und da kannst du eben eine URL eingeben und dann steht da, wie viel das hochgerechnet, ich glaube auch auf die Electricity Maps Daten stützend, wie viel der Aufruf deiner Seite verbraucht und was das für ein Äquivalent ist. Zum Beispiel, dass wenn du 10.000 Besucher pro Monat hättest, wie viele Bäume du dafür dann pflanzen müsstest.",
            "start": 1922473,
            "end": 2000797,
            "confidence": 0.8437025641025632,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wobei man natürlich ja auch, ohne da jetzt eine große Diskussion aufmachen zu wollen, aber mit dem Kompensieren, das ist ja auch immer so eine Sache und Bäume pflanzen lassen, ob dann wirklich die Bäume stehen und du musst dir garantieren, dass die Bäume 50 bis 80 Jahre stehen, damit das überhaupt funktioniert. Und dann ist die Frage, sind das wirklich neue Bäume oder hat man nur alte Bäume gerettet? Also es ist ein super komplexes Thema. Aber nur um so eine Größenordnung zu geben, eine 80-jährige Buche zum Beispiel speichert circa 1300 Kilogramm CO2. Das wären also ungefähr, so jetzt gerade ganz grob berechnet, circa 3000 Gigabyte.",
            "start": 2001017,
            "end": 2037747,
            "confidence": 0.7986388888888888,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich habe jetzt gerade mal meine Webseite da durchgejagt und da heißt es eben, dass es 0,01 Gramm CO2 pro Besuch erzeugt wird. Und wenn ich 10.000 Besucher hätte, also sagen wir mal, ich schreibe ein tolles Blogpost, was sich ganz viele Leute angucken, dann wäre das das Äquivalent von einem Baum im Jahr, den ich pflanzen müsste, um das zu kompensieren.",
            "start": 2038027,
            "end": 2059734,
            "confidence": 0.779968253968254,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Obwohl man natürlich schon noch das Wachstum des Baumes theoretisch mit einkalkulieren müsste, oder? Weil ich meine, wenn du jetzt so einen Baum mit einer Höhe von einem Meter pflanzt, Der hat natürlich jetzt nicht die Möglichkeit, so viel CO2 zu kompensieren, als wenn das jetzt eine 10 Meter, 15 Meter Buche ist, oder?",
            "start": 2059774,
            "end": 2074478,
            "confidence": 0.7703703703703705,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du rechnest grundsätzlich immer die ganze Lebenszeit von so einem Baum. Weil nur so kannst du überhaupt das CO2 speichern.",
            "start": 2074518,
            "end": 2080542,
            "confidence": 0.74305,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Naja, bei dem Baum würde ich halt denken, es geht ja darum, quasi CO2 zu binden. Und das ist wahrscheinlich sozusagen der Zuwachs, den ein Baum in einem Jahr hat. Also die Menge CO2, die ein Baum durch seinen Wachstum in einem Jahr in sich einlagert.",
            "start": 2080581,
            "end": 2095827,
            "confidence": 0.838565217391304,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, dieser Baum würde dann quasi über die Zeit auch immer meine Webseite kompensieren.",
            "start": 2096303,
            "end": 2100827,
            "confidence": 0.854857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, genau.",
            "start": 2101228,
            "end": 2101988,
            "confidence": 0.6739999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, ja, macht Sinn.",
            "start": 2102048,
            "end": 2104010,
            "confidence": 0.57075,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was Leute ja immer gerne mögen, ist so, sagen wir mal, Universal-Tipps, sowas wie eben, mach dein Interface dunkel, dann ist das besser für die Umwelt. Und beim Frontend ist das eben tatsächlich auch, halt dich an die Empfehlungen von Tools wie Lighthouse oder Webpagetest oder was auch immer. Und wenn du die Kriterien dort erfüllst, dann kannst du eigentlich auch davon ausgehen, dass du ökologisches oder möglichst CO2 Fußabdruck armes Frontend hergestellt hast.",
            "start": 2104050,
            "end": 2135642,
            "confidence": 0.8081756756756755,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jetzt bist du ja in dem ganzen Performance-Bereich auch schon lange unterwegs und ich habe immer das Gefühl, dass alle Leute, die Webseiten optimieren wollen und Performance rausholen wollen, die hatten immer so ein Schattendasein gepflegt in der Vergangenheit. Das war immer so ein Kampf mit Product, weil du musst da ja Zeit investieren, um die Webseite performanter zu machen. Und früher war natürlich auch immer die Argumentation, der User merkt es sowieso nicht, ob jetzt 200 Millisekunden oder 50 Millisekunden, am Ende sind es immer noch Erfahrungen, die schnell genug sind, würde ich mal sagen. Jetzt kommt vielleicht ein Argument dazu mit CO2, aber hast du das Gefühl, dass jetzt Performance endlich den Stellenwert bekommt, den es eigentlich schon immer haben sollte? Man hat ja in der Product-Welt wenigstens irgendwann diese Studien an Land gezogen, dass man gezeigt hat, okay, wenn was schneller reagiert auf der Webseite, Dann konvertiert der User eher, dann kauft er mehr im Shop oder solche Dinge. Also die haben ja dann geholfen, ein bisschen wenigstens die Performance so aus dem Schattendasein rauszuziehen. Glaubst du, dass CO2 beziehungsweise die Emissionen, die jetzt da in Korrelation stehen, dass die irgendwie mehr helfen, dass man da wirklich Produktleute überzeugt, dass man da 30% mehr Zeit investiert in ein Projekt, nur um sustainable dann zu sein?",
            "start": 2135987,
            "end": 2210273,
            "confidence": 0.804123853211009,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja also ehrlich gesagt glaube ich das nicht also da wird man den den kampf wird man weiter ausfechten müssen diese studien sind natürlichen oder auch googles suche sind sind natürlich ein toller antreiber um seiten performance zu machen also weil Die Tatsache an sich, dass eine Seite schnell ist, ist ja für die meisten Produktmenschen nicht unbedingt erstrebenswert. Aber eben in der Google-Suche weit oben zu landen ist es oder irgendwie die Verkaufszahlen zu verbessern ist es. Und das sind natürlich dann tolle Proxys für Web-Performance. Und Web-Performance ist wiederum ein guter Proxy für eco-friendly Webseiten.",
            "start": 2210901,
            "end": 2254580,
            "confidence": 0.8552268041237114,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt aber auch, wenn wir nochmal von der Tools-Ecke ausgehen, es gibt ja sehr viele Tools, die dann anzeigen, wie viel CO2 du emittierst mit der Webseite oder so. Aber eigentlich könnte man einfach die ganzen alten Oldschool-Performance-Tools verwenden und anhand deren einfach optimieren. Oder man verwendet die und schreibt dann CO2 drüber, einmal diese Formel und dann.",
            "start": 2254942,
            "end": 2274611,
            "confidence": 0.8373559322033898,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hat man auch Könnte man machen, also die Menschen von Webpagetest, die machen es jetzt schon, dass die das einfach kombinieren. Das heißt, die haben auch so einen Carbon Calculator sozusagen extra Bereich jetzt mit eingehängt. Eventuell erzeugt man da dann Awareness, aber den Stromverbrauch zu senken ist eigentlich so etwas, das so ein bisschen Richtung Gutmenschentum fällt. Und irgendwie nicht um den cooles und deshalb auch in einem sag mal anführungsreichen harten business umfeld da niemand zeit für hat das ist so ein bisschen wie bei accessibility das ist ja im grunde auch was was wir alle tun sollten und die meisten wissen das auch aber wenn es dann sozusagen hart auf hart kommt dann wird das eigentlich immer außen.",
            "start": 2274631,
            "end": 2321125,
            "confidence": 0.8318760330578512,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Vor gelassen Wobei man natürlich sagen muss, dass der gesellschaftliche Druck jetzt durchaus steigt, auch für personennotierte Unternehmen. Du brauchst ein Sustainable Business, du brauchst Sustainability, du brauchst irgendwelche Reports, wo du zeigst, was du denn alles machst. Also ich glaube, es wird besser und natürlich, was man immer verknüpfen kann mit der Performance, ist natürlich auch die Kostenersparnis. Die kann natürlich groß sein, vor allem wenn man jetzt in irgendeiner Cloud hostet zum Beispiel und du hast jetzt irgendwo Performance-Verbesserungen, dann kann die da natürlich unter Umständen viel Geld übrig bleiben am Ende, das du dir ersparst. Und da kann man dann das Business vielleicht auch noch überzeugen. Also du hast natürlich eine Win-Win-Win-Situation. Bei Accessibility kannst du jetzt gar keine Kosten sparen. Das wird nur teurer unter Anführungszeichen auf der Business Seite. Hingegen bei der Performance kannst du wenigstens auch Kosten sparen und eben auch dann Energie sparen automatisch. Also das hängt ja sehr stark zusammen und du hast noch in der Öffentlichkeit vielleicht ein cooles Bild, was du verkaufen kannst, dass du eben keine 21 Prozent Strom eingespart hast jetzt, weil du irgendwas optimiert hast auf der JavaScript-Seite. Hast du so ein paar grobe Punkte als Performance-Spezialist dann auch, wo denn gerne Zeit verloren geht oder Performance verloren geht bei Webprojekten?",
            "start": 2321145,
            "end": 2394976,
            "confidence": 0.7846542056074767,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es gibt, einmal im Jahr gibt's den, kommt der Web-Almanack raus, der so ein bisschen zumindest das Frontend, also die Webstruktur, ich glaub es sind irgendwie die mehrere Millionen Top-Webseiten analysiert und auswertet und da ist es eben so, dass das Gewicht der Seiten, also die übertragene Datenmenge, kontinuierlich steigt und die Hauptverursacher dafür Bilder und JavaScript sind. Und bei den Bildern, da hilft im Prinzip einfach, sich mehr Mühe zu geben, sag ich mal. Bei der Bildoptimierung, also oft werden zu große Bilder benutzt, also viel größere Bilder eingebunden, als dann am Ende zum Anzeigen nötig wäre, weil das Bild vielleicht 2000 Pixel groß ist, aber es nur in 300 Pixeln Breite angezeigt wird. Das wäre Schritt Nummer eins. Wenn man eine responsivee Seite hat, wo es eben große Unterschiede gibt in der Darstellung der Seite auf Mobile oder Desktop, kann man eben zu responsiven Bildtechniken greifen, wo man im Prinzip dem Browser einen Strauß von verschiedenen Varianten des Bildes anbietet und sagt, pick dir eben das raus, was jetzt in dem Kontext gerade für dich das Beste ist von der Pixelgröße. Und dann kann man eben auch überlegen, ob man einfach effizienter komprimiert. Das heißt also wahlweise vielleicht dem JPEG-Kompressor die Spuren gibt und irgendwie sagt so, vielleicht reicht auch 75 Prozent Qualität anstatt 85, spielt auch eine immer größere oder die Kompression kann auch immer weiter gesteigert werden, quasi je höher die Pixeldichte von dem Display ist. Das ist vielleicht auch noch interessant. Dadurch, dass der Browser das Bild eben auf sehr viele quasi Retina-Pixel darstellt, ist es vollkommen legitim, auch die Kompression noch viel weiter hochzudrehen, weil das am Ende sozusagen für das menschliche Auge dann nicht mehr wahrnehmbar ist in diesem Detailgrad. Und dann kann man auch modernere Bildformate nehmen. Da ist jetzt relativ neu AVIV, so das neueste Bildformat, und dann gibt's WebP. Ich finde, die sind beide ähnlich von der Effizienz. Und was ich auch mal recherchiert habe, ist nicht nur, ob diese Bildformate vielleicht Bilder kleiner komprimiert bekommen bei gleicher Qualität, sondern ob die, also ob das sozusagen einhergeht mit einem höheren Stromverbrauch auf den Geräten, um das darzustellen. Das kann ja sein. Also das heißt, wenn man effizienteren Codec hat, dann steckt da ja auch mehr Rechenaufwand drin. Und dann kann es ja sein, dass man zwar Datenvolumen spart, aber hinterher beim enkodieren und dekodieren einfach die die Energie vielleicht flöten geht. Also ich hätte gesagt, dass oder gedacht, dass ich da irgendwie was finde, was gegen zum Beispiel AWIF spricht, aber dem ist wohl nicht so.",
            "start": 2395374,
            "end": 2569040,
            "confidence": 0.8375704225352115,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Man muss ja auch dazu sagen, im Idealfall hast du ja die Last eher auf der Client-Seite zum Beispiel, weil da hast du sie einmal, aber wenn du große Datenpakete verschickst, dann hat jeder Router am Weg, jeder Switch, alle die irgendwie diese Daten angreifen, die haben ja auch CPUs, die müssen die analysieren, dann hast du Deep Packet Inspection womöglich auf Firewalls und so weiter. Also dann wird jedes Bit viel viel öfters angegriffen am Weg. anstatt wenn du das nur dann eben klein sendest und dann wird es einmal entpackt. Und wenn man sich nicht den Stromverbrauch ansieht weltweit, dann liegen die ganzen Data Center Infrastrukturen und Netzwerk Infrastrukturen bei fast 50 Prozent vom gesamten Stromverbrauch. Also die machen schon extrem viel aus, also vom IT Stromverbrauch 50% liegt auf der Infrastruktur und Netzwerkseite. Und da sind nicht mal die mobilen Netzwerke mitgerechnet, die sind nämlich dann fast nochmal ein Drittel mehr.",
            "start": 2569300,
            "end": 2620672,
            "confidence": 0.8166948051948055,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn wir jetzt schon über Bilder, Kompressionen, Auslieferungen sprechen, dann geht mein Hirn sofort auf die Serverseite. Und zwar spreche ich da über Hosting, CDNs und Co. Du hattest ja gerade auch schon gesagt, So eine Daumenregel ist, achte mal drauf, was die Lighthouse-Analyse so gibt und befolge das einfach, dann bist du schon ganz gut dabei. Und die empfehlen ja auch, nutze ein CDN, komm relativ nah mit deinen Assets an den Endkunden, um vielleicht auch Datenvolumen zu sparen und so weiter und so fort. Welche Tipps gibt es denn auf der Serverseite, beziehungsweise welche Bewegungen gibt es denn auf der Serverseite, Hostingseite, wenn wir über Green IT, Sustainable Web Design sprechen?",
            "start": 2620712,
            "end": 2659373,
            "confidence": 0.7735044247787607,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also da gibt's viele Möglichkeiten und auch viel Aktivität, was Green Hosting angeht. Im Grunde schimpft sich, ich würd mal sagen, so gefühlt fast jeder als grüner Hoster. Also man muss sozusagen zwischen den Zeilen lesen, welche Art von grünem Hosting das ist. Da gibt's zum Beispiel die Möglichkeit, mit Geld zu kompensieren, den CO2-Ausstoß, den man als Rechenzentrum oder als Hoster erzeugt. Und und da gibt es dann wiederum zwei kategorien und das eine ist eben ich bin co2 neutral und das ist so ein bisschen eine mogel packung weil das letztendlich bedeutet andi du hast ein weiß ich nicht ein waldstück in duisburg und dein stahlwerk geht zu dir hin und sagt andi ich glaube du wolltest diesen wald gerade abholzen richtig hier ist geld dass du es nicht tust. und damit hat man sozusagen etwas kompensiert das hypothetisch passieren könnte aber nicht also nicht wirklich man hat nichts kompensiert man hat nur sozusagen schlimmeres verhindert und es steht dann im raum ob du das überhaupt vorgehabt hättest also es ist sozusagen ist ein ganz seltsames system und dann gibt es eben die die netto null net zero auf englisch das wäre dass du tatsächlich dann mit dem geld auch aufforstung zum beispiel finanzierst und von dem geld eben so viel bäume gepflanzt werden dass die das hier zwei binden was du mit deinem hostingbetrieb vielleicht erzeugst und so da kommen wir dann am ende wenn wenn das klappt eben wirklich auf null extra emissionen raus Sofern du garantieren.",
            "start": 2659715,
            "end": 2760122,
            "confidence": 0.8350476190476184,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Kannst, dass die Bäume eben wieder 50 Jahre stehen und das ist immer das große Problem mit den Bäumen. Aber du hast natürlich beim Hosting auch die Möglichkeit, was ja auch ganz viele Hoster machen und ich glaube Facebook war da ja ganz früh dran, die in den Noden sind mit ihren Datacenter. weil sie da einfach extrem viel Strom sparen können durch die kühlen Bedingungen dort, weil wenn man auf den Verbrauch von Datacentern schaut, dann ist über 30% die Kühlung und 50% ungefähr das Equipment, was den Strom frisst. Und wenn du da natürlich diese 30% schon weg bekommst, weil du irgendwo in Norwegen, Finnland, keine Ahnung, irgendwo, wo es arschkalt ist, dein Datacenter aufstellst, dann kannst du da natürlich extrem viel einsparen. Und Google hat ja zum Beispiel mittlerweile diese grünen Icons bei ihren Datacentern dabei. Ob das Datacenter grüner ist oder weniger grün, dann kannst du schon als User auswählen, wo du deine App deployst, ob das ein grünes Datacenter ist oder nicht. Wie grün ist dann nochmal eine andere Sache. Es gibt ja Reports und wie du schon richtig sagst, die probieren natürlich alle das gut zu verkaufen. Aber man ist natürlich auch limitiert, weil am Ende verbraucht man den Strom und es geht eigentlich nur durch Kompensation. Aber du kannst natürlich auch stromsparender sein und das macht natürlich dann schon Sinn.",
            "start": 2760162,
            "end": 2830878,
            "confidence": 0.802039647577092,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das bedeutet, wenn ich jetzt eine Cloud-Region in der Schweiz habe, da wird mit hoher Wahrscheinlichkeit jetzt nicht so viel grüne Energie erzeugt, weil wir da jetzt nicht an der Küste sind oder ähnliches und nicht ziemlich viel mit Windkraft oder mit Wasserkraft machen können.",
            "start": 2831178,
            "end": 2846169,
            "confidence": 0.8359555555555558,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Du bist in den Alpen, natürlich wird da viel Energie erzeugt.",
            "start": 2846209,
            "end": 2849651,
            "confidence": 0.701,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab keine Ahnung, wir müssten auf Electricity Maps gucken, wie's in der Schweiz aussieht.",
            "start": 2850267,
            "end": 2854328,
            "confidence": 0.43566666666666676,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Angenommen, ich habe ein Datacenter ganz irgendwo, wo halt echt wenig erneuerbare Energie erzeugt wird.",
            "start": 2854368,
            "end": 2860390,
            "confidence": 0.8395333333333332,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "In Nordkorea zum Beispiel.",
            "start": 2860830,
            "end": 2862451,
            "confidence": 0.588,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die würden das dann offsetten, das bedeutet, die würden sich irgendwie was einkaufen, wer dann irgendwie Bäume pflanzt, beziehungsweise keine Bäume abholzt, und das nennt man Carbon Neutral. Wenn ich jetzt aber ein Datacenter auf Grönland habe oder Island oder Ähnliches, und direkt neben dem data center die windräder sind und solar panels und alles was dazugehört und wasserkraft weiß ich nicht und ich erzeuge die komplette energie zum betreiben des data centers selbst dann bin ich.",
            "start": 2862491,
            "end": 2893638,
            "confidence": 0.8576233766233765,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Net neutral ist das richtig nee dann bist du sogar dann bist du mehr als das also net neutral bist du dann wenn du durch deine tätigkeit am ende nicht mehr co2 imitiert wird aber ist ja nicht ganz richtig also es wird ja schon imitiert das co2 und es wird dann an anderer stelle wieder gebunden was du gerade schilder ist ja dann sogar noch mal eine eine nummer besser oder sogar eigentlich zwei nummern besser weil eine nummer besser ist dass man den strom dass man sicherstellt dass der strom den man als hosting betreiber bezieht 100 prozent aus erneuerbaren energien kommt dann musst du ja auch keinen keinen wald pflanzen lassen für geld also dann musst du das nicht mit geld kompensieren das ist im prinzip co2 zertifikats handel letztlich der funktioniert ja auch so. dass du, dass du deinen eigenen Ausstoß kompensierst. Aber wenn du von Anfang an als Hoster sagst, ich kaufe nur erneuerbare Energien bei einem entsprechenden Anbieter, dann hast du ja durch den Betrieb, hast du gar keinen, du musst nicht diesen indirekten Weg gehen, das erst zu erzeugen und dann zu kompensieren, sondern du hast sozusagen gar nicht erst CO2 erzeugt. Genau aber das ist noch eine stufe unter dem was du gesagt hast weil sozusagen das aller coolste ist wenn du tatsächlich deinen data center hast und dazu dir deine eigenen energiequellen baust die erneuerbar sind weil dann. stellst du wirklich sicher, dass der Strom nicht im Schnitt erneuerbar ist? Weil es natürlich so ist, wenn ich jetzt irgendwo hingehe und sage, ich will erneuerbaren Strom haben, hänge ich ja immer noch am gleichen Stromnetz. Und diesem Stromnetz ist ja dann auch irgendwie anderer Strom. Und es kann halt auch mal sein, dass ich dann trotzdem CO2 emittiere, weil das Stromnetz eben nicht bestimmte Elektronen durchlassen kann und andere nicht. Also das Öffentliche. Das heißt also, wenn du sozusagen alles, alles, alles richtig machen willst, dann hängst du dich nicht an das öffentliche Stromnetz, sondern dann hast du deine eigene Stromversorgung, die erneuerbar ist.",
            "start": 2893658,
            "end": 3015927,
            "confidence": 0.8199912536443154,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist ja auch genau die Marketing Schiene, die zum Beispiel die Deutsche Bahn fährt, die sagt, du fährst mit grünem Strom bei uns, alle Personenzüge sind grüner Strom, aber das ist eben dieser Zusatz Personenzüge, weil alle Güterzüge fahren dann sozusagen virtuell am anderen Strom, ist natürlich alles derselbe Strom, aber man macht einfach mal vom Energiemix so, dass grüne Strom in die Personenzüge fließt. virtuell und dadurch kannst du es natürlich viel besser verkaufen. In der Realität verbraucht dann aber halt den dreckigen Strom unter Anführungszeichen einfach jemand anderer. Also du hast dann auch wenig gewonnen.",
            "start": 3016265,
            "end": 3051316,
            "confidence": 0.8133265306122449,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bei der Recherche zu dieser Episode bin ich über ein nettes Gimmick gestoßen. Wenn wir schon über Datacenter sprechen, dann kommen wir natürlich in das Areal, wo ich beruflich unterwegs bin. Cloud, Google Cloud, Amazon usw. und so fort. Bei GCP, bei der Google-Cloud-Plattform, kannst du dir deinen Carbon-Footprint in der Cloud-Konsole selbst anzeigen lassen. Das bedeutet, von deiner Infrastruktur wird dir angezeigt, wie viel CO2 du damit verbrauchst. Und jetzt kommt das wirkliche Gimmick, weil ich dachte mir, das ist wirklich weitergedacht. Du kannst es sogar in deinem Billing-Export mit exportieren lassen. Das bedeutet, du kannst nicht nur deine Kostenanalysen machen, du kannst natürlich auch deinen automatischen Billing-Export nutzen, um dein Carbon-Footprint von deiner Cloud-Infrastruktur messen zu lassen. Und das find ich ja schon irgendwie cool beziehungsweise weitgedacht. Hab ich jetzt noch nicht gemacht, aber ich denke mal, das wird ein spaßiges Wochenprojekt.",
            "start": 3051336,
            "end": 3104695,
            "confidence": 0.7813402777777778,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es gibt ja auch von ThoughtWorks so einige Tools, die haben das auf GitHub zur Verfügung gestellt. Können wir übrigens alles verlinken natürlich. Die probieren, über die Cloud-Usage deinen Footprint zu berechnen. Also das ist ja ... Gerade in der Businesswelt aktuell sehr in, dass du da über irgendwelche Heuristiken oder so grobe Schätzungen eben irgendwie das dann raus bekommst, solche Annäherungen, damit sich das dann meistens eben gut verkaufen lässt, wenn du einsparst. Ich meine, die Richtung ist ja okay, aber ist natürlich auch immer so mit Vorsicht zu genießen, diese ganzen Daten. Aber es geht zumindest in die richtige Richtung. Wenn wir übrigens bei Google sind, was auch sehr interessant ist und das habe ich kürzlich gerade, wie ich den Unmute-IT-Podcast gehört habe, gelernt, dass Google-Suchen ja auch Energie brauchen, das ist ja oft in den Medien, aber dass zwei Google-Suchen so viel Energie brauchen, wie circa eine Tasse Tee machen, aufheizen. Und wenn man sich das mal vor Augen führt, diesen Vergleich, dass jedes Mal, wenn du eine Domain eingibst und zu faul bist, die Domain schon korrekt einzugeben und eine Google-Suche im Hintergrund angeworfen wird, mach das zweimal, hast du schon eine Teetasse aufgeheizt. Also auch da, gerade wenn du in so einem Scale bist wie Google oder mit so vielen Servern zu tun hast, dann ist da natürlich jede Optimierung eine Möglichkeit, das im großen Scale zu verbessern und an sowas kann man natürlich als User denken, wenn man jetzt Google sucht, aber auch auf der Serverseite, wenn man im Hosting-Bereich unterwegs ist oder einfach die Skalierung auch bei dem eigenen Produkt mit einer App hat, Wenn man da einfach Millionen von User hat, dann ist da halt jedes Prozent, was man verbessert, hat dann natürlich einen extremen Impact, den ich persönlich durch ein bisschen mehr zu Fuß gehen, weniger Auto fahren oder so gar nie erreichen könnte. Also da haben wir als Informatiker wirklich extrem viel Einfluss und haben einen Impact darauf.",
            "start": 3104735,
            "end": 3211953,
            "confidence": 0.8114542682926832,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Google ist auch generell ein ziemlicher Vorreiter, also um an das anzuknüpfen, was Andi noch eben meinte, was eben die Beschaffung von Energie angeht. Also sie sind der einzige Anbieter oder von den großen Cloud-Hostern zumindest im Vergleich zu Microsoft und Amazon, die seit 2017 schon komplett nur auf 100% erneuerbare Energien im Einkauf setzen. Und seit 2018 arbeiten die eben dran, sich ihre eigene stromversorgung an ihr rechenzentren dran zu bauen um eben dann diesen allerletzten schritt auch noch zu gehen das heißt also google ist ja nicht in jedem bereich führend aber so was das angeht ist google wirklich weit vorne microsoft bei microsoft ist es so dass die sind carbon neutral nur also sozusagen die Die light version von also sie tun ein bisschen was aber gehen eben nicht bei weitem nicht so weit wie google und bei amazon ist das irgendwie noch so ein bisschen unklar das heißt also wenn man auf amazon hostet dann sollte man im hinterkopf behalten dass man wahrscheinlich nicht so die in den eco friendliesten cloud host da gerade nutzt.",
            "start": 3212193,
            "end": 3286144,
            "confidence": 0.8419608938547484,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und um da nochmal vielleicht die Klammer zu schließen zu dem, was wir am Anfang gesagt haben, wo wir gesprochen haben über neue Hardware kaufen. Im Server-Bereich ist das natürlich ein großes Thema. Wenn ich meine Server effizienter gestalten kann oder neue Server-Technologien habe, die zum Beispiel nur mehr die Hälfte des Stroms verbrauchen, dann habe ich natürlich einen extremen impact weil diese server laufen 24 stunden sieben tage die woche durchgehend möglichst hoffentlich durchgehend auf full load und da kannst du natürlich dann extrem viel sparen damit auch wenn du deine eigenen server zum beispiel updatest oder erneuerst wenn das wirklich selber sind die viel am Rechnen sind und unter hoher Load sind. Ich habe mal probiert das rauszufinden, wie das auch gegenübersteht zur Produktion und habe da bei Dell einen Report gefunden, was so ein Dell-Server an Produktionsemissionen so hat. Und die haben das berechnet mit 200 Watt im Schnitt, was der Server zieht und haben da dieses ganze Modell auf vier Jahre gerechnet. Und der Server braucht ungefähr das 12-fache an Energie, während er läuft, im Vergleich zur Produktion. Also 0,5 Tonnen CO2 ungefähr in der Produktion und 6,5 Tonnen in vier Jahren Laufzeit. Das heißt, wenn du da einen neuen Server kaufst, der um die Hälfte energiesparender ist, dann hast du die Produktionsemissionen sofort drin und hast überhaupt keine Probleme. Also im Serverbereich rentiert sich das auf jeden Fall. Egal, ob es jetzt Google ist oder auch im Rack im Office, sofern der Server ausgelastet ist, kann sich da durchaus rentieren, einen neuen Server zu kaufen, weil der viel, viel energiesparender ist. Und man muss sich das schon vor Augen führen, wenn du 800 Watt zum Beispiel verbrauchst bei deinem Server, das ist durchaus ein großer Server, aber das existiert und steht herum, dann sind es drei Tonnen CO2, der emittiert nur über den Strom. über ein Jahr. Und das steht wahrscheinlich in vielen Büros, irgendwo in einem Rack stehen solche Server, die durchaus da vor sich hin rechnen und 800 Watt ziehen. Also das sind schon ordentliche Größenordnungen, wo man durchaus einsparen kann, wenn man das um 50 Prozent zum Beispiel reduzieren kann.",
            "start": 3286704,
            "end": 3412909,
            "confidence": 0.8162765363128491,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn sie in der regel unter volllast.",
            "start": 3413489,
            "end": 3414790,
            "confidence": 0.8184285714285714,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Laufen natürlich aber du hast große server die die haben wesentlich mehr watt und oder oder wenn du mehrere server zum beispiel hast also 800 watt ist durchaus eine größenordnung die die nicht extrem weit entfernt ist von dem was was durchaus so verbraucht wird aber ist das nicht.",
            "start": 3414830,
            "end": 3428916,
            "confidence": 0.7879387755102041,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Eine milchmädchenrechnung ich meine die wenn du die komplette supply chain mal ansiehst die server müssen erstellt werden also gebaut werden transportiert werden und so weiter und sofort da frage ich mich Ist dann nicht zum Beispiel das Konzept von Commodity-Hardware, wie auch Google gestartet ist oder wie Hetzner ja auch mal in einem YouTube-Video dargestellt hat, dass die ganz viel Commodity-Hardware, existierende Hardware noch ganz lange nutzen, die dann vielleicht vom Netzteil her und von den CPUs her sehr wahrscheinlich nicht so energieeffizient ist. Ist das da nicht der bessere Weg, anstatt sich ein komplett neues Datacenter aufzubauen mit komplett neuen Servern?",
            "start": 3428936,
            "end": 3463127,
            "confidence": 0.7854368932038837,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also wie gesagt, das, was ihr gerade vorgerechnet habt, das ist halt wirklich nur ein sehr kleiner Bereich. Bei dem Dell-Server, die rechnen auch Transport mit rein, das Recycling und so weiter, das siehst du in dem Graphen fast gar nicht. So kleine Bereiche sind das. Und wie gesagt, die Produktion ist 0,5 Tonnen im Vergleich zu 6,5 Tonnen Stromverbrauch dann. Also wenn du dort was einsparen kannst, Und sei es nur 10%, hast du die Produktionsemissionen sofort wieder drin. Und das Recycling ist sowieso so klein, dass man es fast gar nicht sieht in dem Graphen. Also das sind Größenordnungen, die im privaten Bereich vielleicht einen Einfluss haben. Aber im Bereich, wo deine Server möglichst unter Volllast laufen und viel Strom ziehen, da ist wahrscheinlich ab ein paar Prozent mehr Effizienz. Macht das schon Sinn, vor allem wenn du so jemand bist wie Google, der irgendwie tausende Server hat oder zehntausende Server. dann rentiert sich es da auch dementsprechend, das Ganze zu investieren. Wenn man jetzt nur auf die Emissionen blickt, natürlich sind da auch Kosten damit verbunden, aber von den Emissionen ist es sicher kein Problem.",
            "start": 3463187,
            "end": 3524952,
            "confidence": 0.7842925531914894,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, muss man nur eben sicherstellen, dass die Herze und so, die eben benötigt werden, um so einen Server zu bauen und auch hinterher dann die Entsorgung nicht zu lasten, wieder von Ökosystemen geht, die halt einfach irgendwie ausgebeutet werden oder so.",
            "start": 3525252,
            "end": 3540805,
            "confidence": 0.8022857142857143,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Da spielt natürlich dann das Recycling auch wieder eine große Rolle, aber gerade im professionellen Bereich bei Google und Co hoffe ich mal, dass die auf den Recycling-Bereich auch blicken. Habe jetzt zu wenig Einblick darauf, aber kann man sicher in Reports nachlesen. Ist wahrscheinlich natürlich immer viel Greenwashing auch dabei, muss man ganz klar sagen, aber wenn Anbieter extrem in eine Richtung gehen, Und ich würde mal sagen, du rechnest ein 50% Greenwashing weg, dann sind die anderen 50% immer noch sehr wertvoll. Und die Richtung stimmt zumindest. Und man kann ja auch probieren, das Greenwashing aufzudecken. Und dafür gibt es ja auch viele Stellen und Journalismus, die sich darum kümmern.",
            "start": 3541292,
            "end": 3578914,
            "confidence": 0.8270000000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bedeutet das, wir voten jetzt für mehr Raspberry Pi Clusters in Datacentern?",
            "start": 3578934,
            "end": 3582599,
            "confidence": 0.7540833333333331,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja nicht unbedingt also ich glaube es kommt darauf an wie viel macht wie viel schafft ein raspberry pi sozusagen weg zu ackern also wie viel. Kleines kann der bedienen bei seinem stromverbrauch und ist das eben ein besserer schnitt als weiß ich nicht ein 128 kern armprozessor.",
            "start": 3583351,
            "end": 3600367,
            "confidence": 0.8227500000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Grundsätzlich Armprozessoren sind natürlich ein großes Thema und klarerweise sind die wesentlich effizienter. Ich glaube auch bei Raspberries, dass die eigentlich im Vergleich zu einem Hochleistungsrechner-Server eigentlich keine Chance haben bei Leistung pro Watt. Kann ich mir kaum vorstellen.",
            "start": 3602961,
            "end": 3620395,
            "confidence": 0.8279487179487179,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bei ARM-Prozessoren muss man natürlich auch sagen, dass der Workload ein anderer ist. Durch die anderen CPU-Instructions und so weiter, du kannst jetzt nicht dieselbe Performance, also nicht jeder Workload liefert dieselbe Performance auf ARM- und Intel-CPUs. Das muss man auch ein bisschen differenzieren. Also es könnte sein, dass wenn du deinen Workload ... weiß ich nicht, ein Kafka-Cluster oder Ähnliches, von Intel auf ARM verschiebst, dass du mehr ARM-Prozessoren dafür brauchst, weil die CPU-Instructions einfach andere sind und weil du deswegen nicht dieselbe Performance an den Tag legst. Ob sich das dann unterm Strich, wenn wir nur auf die Energieeffizienz gucken, trotzdem rechnet, das ist dann eine andere Rechnung. Ich will nur sagen, bei vielen Workloads ist es nicht einfach so, CPU austauschen und ich bin effizient.",
            "start": 3621676,
            "end": 3670997,
            "confidence": 0.8243828125000003,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, wobei die so als Pi mal Daumen-Regel würde ich sagen, kann man schon mittlerweile feststellen, dass ARM-Plattformen energieeffizienter arbeiten als x86-Plattformen zum Beispiel. Zum Beispiel Cloudflare, die ihre Edge-Server jetzt migrieren auf ARM, einfach weil die viel weniger Strom verbrauchen und trotzdem schneller sind. Ich sehe das ja auch auch als frontend entwickler wenn ich ich habe hier ein projekt dass ich wo ich quasi in staatlichen seiten generator habe um seiten zu bauen das sind 20.000 das braucht eine weile bis der die gebaut hat und ein kollege hatten m2 laptop und ich war mal irgendwann mit dem. verbunden und der hat das gleiche bei sich ausgeführt und der war irgendwie in einem fünftel der zeit war der fertig und ich dachte ich dachte erst ob der vielleicht gar nicht den das komplett durchgebaut hat sondern vielleicht nur ein teil aber tatsächlich hat er das komplett durchgebaut und seitdem habe ich ja auch ein mini stehen und es ist einfach unglaublich wie schnell die sind und und dennoch höre ich von dem nichts der stromverbrauch ist niedrig der bleibt kühl also da haben die architekturell gerade einfach die nase vorn das kann sich irgendwann mal ändern vielleicht aber derzeit sind die armen cpus glaube ich die bessere wahl Das ist.",
            "start": 3671277,
            "end": 3746327,
            "confidence": 0.8201933962264156,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Glaube ich, schon ein gutes Stichwort, weil du gesagt hast, deinen Static Site Generator und Build Pipelines, die vergisst man natürlich auch gerne. CI, CD, wo läuft das? Was laufen da für Tests ab? Wie oft laufen diese Tests ab? Kann ich da Sachen zwischenspeichern? Auf welchen Architekturen laufen meine Server durch, meine Workers, obwohl die nie was machen, meine Test Workers oder Build Workers? Also da gibt es auch viel Potenzial, um Geld zu sparen, aber auch natürlich, um Emissionen zu sparen, ganz klar. Wie gesagt, ich glaube, das ist eher der große Vorteil, dass da immer auch Kosten damit verbunden sind, die man einsparen kann und darum ist es ja auch gerade beim Business, ganz unabhängig vom gesellschaftlichen Druck, auch noch eine Möglichkeit, einfach Geld einzusparen und gleichzeitig eben dieses grüne Image zu haben, ohne das jetzt negativ zu sehen, tue Gutes und sprich darüber. Also ich glaube, das ist schon okay. Und auch wenn viele sagen, das ist Greenwashing, aber klar, wenn man in diese Richtung geht, dann wird man viel Kritik einstecken müssen und man kann nicht alles ändern sofort, aber die Richtung stimmt wenigstens. Und überall, wo man einspart, wenn, wie gesagt, jeder ein bisschen einspart, kann es natürlich auch weiterhelfen. Und gleich vorweg, weil das ein gern gebrachtes Argument ist, China soll doch einsparen. Wir brauchen gar nicht einsparen. Ich habe gerade gestern kurz die Zahlen gecheckt. china hat zum beispiel acht tonnen pro einwohner und deutschland hat neun tonnen pro einwohner nur dass wir das mal auch.",
            "start": 3746367,
            "end": 3833892,
            "confidence": 0.8152874015748032,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aus der welt träumen ja und das ist natürlich bequem das zu sagen also während wir gleichzeitig unsere gesamte produktion nach china ausgelagert haben also letztlich diese ganzen fabriken die früher bei uns mal standen also ich weiß gar nicht wieso es in duisburg überhaupt noch stahlwerke gibt da sind ja die meisten sind ja auch nach china sozusagen abgebaut worden und in china wieder aufgebaut worden also das finden wir dann auch gut dass wir diesen ganzen kram hier bei uns nicht mehr haben und gleichzeitig halten wir den chinesen aber vor dass sie die umwelt verpesten und tatsächlich ist es aber so dass zum beispiel die chinesen die haben die haben ja auch sozusagen sich ziele gesetzt wie viel zubau sie an erneuerbaren energien machen wollen bis zu welchem jahrzehnt und die liegen halt da Die haben ihre eigenen Ziele schon weit übertroffen, also sind viel schneller im Ausbau als eigentlich selbst ursprünglich angestrebt. Und vielleicht ist es auch in dem Kontext ganz gut, dass alles in China hergestellt wird, weil wenn die so weitermachen, dann wird eben alles, was hergestellt wird, auch bekommt eben kleineren CO2-Fußabdruck.",
            "start": 3833932,
            "end": 3901138,
            "confidence": 0.8423915343915346,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wir hatten gerade schon CI-CD-Pipelines angesprochen, und immer wenn ich darüber nachdenke, dann komme ich zu Programmiersprachen. Und am Anfang des Jahres ging so ein LinkedIn-Post relativ viral, wo es darum ging, was ist eigentlich die grünste Programmiersprache. Und zwar haben da Forscher im Jahre 2017 bereits mal nachgeschaut, was ist eigentlich die energieeffizienteste Programmiersprache. Und sie haben so eine Art relativ einfaches Ranking rausgebracht, wo gesagt wird, okay, diese Programmiersprache verbraucht die Baseline an Energie und Von da wurde dann der Effizienzwert berechnet. Und raus kam eigentlich, dass C die effizienteste Programmiersprache ist, wo Python und Perl die eher am schrecklichsten effizienteste Programmiersprache ist. Und zwar, Python und Perl bewegen sich ja im Faktor im Vergleich zu C so mal 75 beziehungsweise mal 79. Und jetzt hatten wir auch gerade schon über Kleinprogrammierung gesprochen, da ist Javascript so der Elefant im Raum. Und Javascript ist auch vom Faktor 4 weniger effizient als C. Und die Grundaussage dieser Studie ist eigentlich, umso näher man am Metall ist, umso effizienter ist die ganze Sache. So und jetzt kommen wir mit unseren Transpilierten Programmiersprachen, Scriptsprachen und so weiter an. Jetzt frage ich mich, sollten wir alle auf WebAssembly umsteigen? Ist das die Lösung oder wie ist deine Meinung dazu?",
            "start": 3901621,
            "end": 3993597,
            "confidence": 0.8412077294685986,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wenn wir das können, ist das natürlich hilfreich, aber nicht jede oder nicht jeder tut sich eben mal schnell eine neue Programmiersprache und dessen Ökosystem drauf. Vielleicht kann man nochmal sagen, die kompilierten Sprachen sind in der Regel die effizienteren, die interpretierten Sprachen sind die ineffizienteren. Ist ja auch irgendwie logisch. Und es gibt Ausreißer, nämlich zum einen im positiven Bereich Java, das ja quasi auch nicht kompiliert wird, aber dennoch mitmischen kann ganz vorne. Und javascript auch relativ schnelles genau und dann die die langsamen sprachen hat es ja genannt und php es ist ja auch sehr verbreitet und sagen wir mal auch nicht die effizienteste sprache ich würde ja sagen. Wenn man eine neue Programmiersprache im Web-Bereich lernt, dann empfehlen sich ja irgendwie Go und Rust oder eben Java auch. Da wird man auch so schnell nicht arbeitslos.",
            "start": 3993617,
            "end": 4055042,
            "confidence": 0.8277214285714287,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wobei, also zwei Punkte noch kurz zu dieser Statistik. Einerseits steht da TypeScript mit fünfmal so energieaufwendig wie JavaScript drin, was ein bisschen eigenartig ist. Also, weil bei der Ausführung ist es ja JavaScript, biliert es einmal. Also da sehe ich nicht ganz, woher das kommt, die eine Sache. Und die andere Sache ist natürlich, klarerweise, wenn du dich jetzt entscheidest, was verwendest du für eine Programmiersprache, okay, kann man sich das überlegen, ob man diese Wahl wirklich anhand der Emissionen treffen sollte. Ich glaube, da kann man während dem Programmieren eigentlich viel mehr rausholen, dass du eben sinnvoll programmierst. Und wir hatten da ja schon eine eigene Folge darüber, Episode 65 über Clean Code, wo es sehr in die Richtung gegangen ist, wie performant sollte Code sein. Aber ich glaube, dass man da eben auf der Coding-Seite viel mehr Performance rausholen kann, indem man den Algorithmus mal sinnvoller programmiert oder vielleicht einfach nicht Standard Copy-Paste irgendwas übernimmt oder eine fette Library reinhängt. Also, dass man da viel mehr Impact generieren kann, anstatt sich jetzt C ans Bein zu binden. Nichts gegen C-Programmierer, aber wenn ich jetzt anfange, alles, was ich so in JavaScript programmiere, jetzt in C programmiere an Webseiten, dann werden wir wahrscheinlich gesellschaftlich viel weniger produktiv sein, was dann vielleicht auch negative Auswirkungen hat und so auch auf die Emissionen. Also, da würde ich mal nicht zu viel Gewicht drauflegen. Und ich glaube, da kann man eben an anderer Seite viel mehr sparen. Oder wenn man an mein Gebiet, die Datenbanken, denkt, wenn man es schafft, irgendwo eine Query zu optimieren, weil man einfach einen Index erzeugt und vielleicht eine Query von 100 Millisekunden auf 10 Millisekunden runterbringt, das ist eine Verbesserung von 90 Prozent. Wenn ich es jetzt schaffe, einen Datenbankserver plötzlich statt 100 Prozent nur mehr 10 Prozent auszulasten, dann habe ich eine 90 Prozent Einsparung. Und wie wir zuerst besprochen haben, Wenn so ein Server drei Tonnen CO2 braucht pro Jahr und ich spare da 90 Prozent ein, dann habe ich da eine super Einsparung. Und vielleicht ist es sogar nicht ein Datenbankserver, sondern zehn Datenbankserver oder die Query läuft bei Google und greift plötzlich zehn Prozent weniger Daten an und braucht dann statt 300 Server nur mehr 100 Server. Das sind dann wirklich Größenordnungen, wo man sehr viel bewegen kann und ich glaube, da hat dann die Wahl der Programmiersprache eigentlich viel weniger Anteil daran, als was man dann wirklich als Code, als Algorithmus eigentlich dann dem Computer füttert und wie man die CPU verwendet.",
            "start": 4055082,
            "end": 4198941,
            "confidence": 0.7907061611374399,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hab ich als Duisburger, wie eingangs beschrieben, mit den Stahlwerken ein relativ schlechtes Gewissen. Was kann ich denn jetzt mal wirklich tun, um mich dazu beteiligen, um vielleicht mein Gewissen ein bisschen grün zu waschen? Ich weiß es nicht. Wie kann ich mich daran beteiligen, dass die Welt vielleicht ein bisschen besser wird bezüglich der CO2-Emissionen? Offen gesprochen, ich guck jetzt hier aus dem Fenster und hab jetzt aber auch Bauernhöfe hier vor mir. Da stehen auch ein paar Kühe auf der Weide, also das bedeutet, die pupsen auch eine ganze Menge. Für dich weiß, löst das auch ziemlich viele Emotionen. Also bei den Kühen kann ich jetzt wahrscheinlich nicht viel machen, aber was kann ich mit meinem Job machen, um vielleicht ein bisschen die Stahlwerke in Duisburg zu kompensieren?",
            "start": 4199593,
            "end": 4240197,
            "confidence": 0.790511450381679,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also deine Kaffeemaschine mal hin und wieder abschalten, diese Heizplatte, und dann treibst du mal die Kühe in den Nachbargrund, weil dann sind es seine Emissionen und nicht mehr deine.",
            "start": 4240217,
            "end": 4250160,
            "confidence": 0.7872,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das ist eine gute Idee, da musst du auch den Kaffee nicht so als Film unten abziehen, dann aus deiner Kanne, wenn der eingekocht ist. Tatsächlich würde ich sagen, ist so das Beste, was man machen kann, darüber sprechen, das immer mal wieder thematisieren, vielleicht auch Libraries. Ich weiß ja, dass du, Andi, auf jeden Fall auf GitHub diverse Libraries hast, dass du irgendwie vielleicht, wenn du das nicht sowieso ja schon tust, weil du bestimmt eine sehr performante Library da veröffentlichst, eben dann auch sagst, so hier Eco-Friendliness ist da auch irgendwie mit eingebacken. Du kannst in deinen Programm-Code einbinden, wenn du möchtest, die CO2-Signal-API von Electricity Maps, um gegebenenfalls Dinge live anzuzeigen. Also kannst du zum Beispiel sagen, oder meine Seite erzeugt dieses Volumen, ist in Deutschland gehostet. Sag mir mal, wie viel CO2 erzeuge ich mit meiner Webseite, dann steht das halt da drauf. Das einfach, denke ich, sichtbar machen und in den eigenen Projekten so ein bisschen das mit mit reinweben, würde ich sagen. Ansonsten finde ich eben dieses Konzept der CO2-Zertifikate super, dass es ja sogar so dass die selbst die fdp gefordert hat dass die teurer werden müssen was mich sehr gewundert hat aber letztlich sind die noch nicht so teuer wie sie sein müssten um abzubilden was also wie viel schaden entsteht durch co2 emissionen und wenn eben die preisschraube angezogen wird dann hat das einfluss auf eben alles das heißt also dann fängst du wirklich an zu überlegen gehe ich noch zu dem hoster der sehr teuer ist, weil er eben nicht energieeffizient ist. Und du als Firma selbst musst dann eventuell auch deinen CO2 kompensieren.",
            "start": 4250886,
            "end": 4350982,
            "confidence": 0.8042290909090909,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und schön, Andi, dass du das jetzt fragst, weil wir haben jetzt gerade eine Stunde Beispiele präsentiert, wo man CO2 einsparen kann. Also wenn du jetzt nicht mindestens 300 Anknüpfungspunkte hast bei deinem Client-Code, bei deinem Server-Code, bei deinem Cloud-Usage, da kannst du überall perfekt einsparen. Und, wie Shep schon richtig gesagt hat, Kommunikation, da kannst du schon einen Check dran setzen mit dieser Podcast-Episode. Haben wir schon mal definitiv über dieses Thema gesprochen. vielleicht mehr awareness geschaffen hoffentlich.",
            "start": 4351452,
            "end": 4382859,
            "confidence": 0.7794430379746836,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Weil Duisburg so dreckig ist habe ich ein extrem schlechtes gefühl gerade das bedeutet ich habe auch das verlangen mehr zu tun als alle anderen und jetzt überlege ich gerade ich glaube da müsste ich noch mal in die verhandlung mit dem wolfgang gehen ob wir diese folge nicht einfach die nächsten drei wochen kontinuierlich jeden dienstag releasen.",
            "start": 4382879,
            "end": 4397515,
            "confidence": 0.8238103448275861,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Würde auf jeden Fall unsere Downloadzahlen senken und damit weniger Gigabyte transferieren. Das wäre vielleicht eine Möglichkeit. Aber was wir machen könnten, Andi, du könntest, um unsere Downloads zu kompensieren, jetzt anfangen Bäume zu pflanzen bei dir im Garten. Dann brauchst du auch nicht mehr Rasen mähen, ist super, dann hast du da einfach ein paar Bäume mehr. Ich glaube, das wäre eigentlich eine gute Möglichkeit.",
            "start": 4397935,
            "end": 4416339,
            "confidence": 0.7415151515151519,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe auf jeden Fall in dieser Podcast-Episode unglaublich viel gelernt, denn wie wir auch eingangs gelernt haben als Duisburger, bin ich eher dafür zuständig, CO2 zu erzeugen durch die ganzen Stahl- und Metallindustrie-Konzerne hier.",
            "start": 4416939,
            "end": 4430328,
            "confidence": 0.8585999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir in Tirol sind eher für das Greenwashing zuständig. Wir machen dann euren Dreck in Strom wieder grün, indem wir da Wasser durch die Gegend pumpen.",
            "start": 4430368,
            "end": 4437033,
            "confidence": 0.7441923076923076,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also geht unser Geld wegen CO2 Zertifikaten dann nach Österreich?",
            "start": 4437793,
            "end": 4441274,
            "confidence": 0.8519,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hoffentlich, hoffentlich bekommen wir mehr Geld, ja.",
            "start": 4441314,
            "end": 4443574,
            "confidence": 0.5697142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Shep, vielen lieben Dank, dass du dir die Zeit genommen hast, um mit uns über dieses Thema zu sprechen.",
            "start": 4443614,
            "end": 4448735,
            "confidence": 0.7563684210526315,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, danke für die Einladung.",
            "start": 4448875,
            "end": 4450036,
            "confidence": 0.6994,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe eine ganze Menge gelernt. Ich schaue mal, was ich auf meiner Seite optimieren kann. Unglaublich interessant, mal wirklich ein paar Zahlen vor Auge zu haben und aber auch zu wissen, wie tief dieses Thema überhaupt gehen kann, speziell mit, ich sag mal so praktischen Beispielen wie, warum sehen wir eigentlich immer Always-on-Displays mehr und mehr in den Alltag einziehen? Ah ja, OLED, besser in der Taschung von dunklen Pixeln, super interessant. Aber natürlich auch, dass man sich bei der GCP, bei Google Cloud Plattform, sich sein CO2 Fußabdrucks in seiner Cloud-Infrastruktur ansehen kann. Wow! Also ich habe jetzt auf jeden Fall 35 Links, wo ich mich mal mehr und mehr mit beschäftige.",
            "start": 4450056,
            "end": 4491331,
            "confidence": 0.8502105263157897,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir verlinken natürlich auch alles in den Show Notes, auch die ganzen Quellen, die wir verwendet haben und Tools, wo man gewisse Dinge berechnen kann, Footprint-Berechnungen und so weiter. Ich glaube, was man auch nie vergessen darf, ist eben auch, wie viel Einfluss wir haben, weil wir halt wirklich das Ganze potenzieren können, weil wir meistens Software entwickeln, die halt von sehr vielen Usern hoffentlich verwendet wird. Und da kann man einfach, wenn man eine Kleinigkeit einspart, multipliziert sich das gleich mit der Anzahl der User, Endgeräten, was es auch immer ist. Also unser Einfluss ist groß und vielleicht sollten wir da öfter daran denken, wenn wir eine Codezeile schreiben.",
            "start": 4491411,
            "end": 4525512,
            "confidence": 0.8560999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das klingt nach einem guten Plan. So machen wir das. Vielen Dank für die Einladung. Hat Spaß gemacht.",
            "start": 4525961,
            "end": 4530024,
            "confidence": 0.5402777777777776,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Danke für deine Zeit. War super spannend.",
            "start": 4530064,
            "end": 4532485,
            "confidence": 0.8324285714285714,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wer den Shep öfters hören möchte, der kann natürlich auch gern mal beim Working Graph Podcast vorbeischauen. Da ist er regelmäßig, ich glaube alle 14 Tage, alle 7 Tage zu hören.",
            "start": 4532525,
            "end": 4542912,
            "confidence": 0.7293750000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Naja, wir releasen einmal die Woche, aber ich bin nicht immer immer dabei. Nicht wie bei euch. Genau, ihr seid ja immer am Start.",
            "start": 4542952,
            "end": 4549777,
            "confidence": 0.6844166666666668,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Vielen lieben Dank und weiterhin einen schönen Tag. Tschüss. Tschüss.",
            "start": 4549797,
            "end": 4552839,
            "confidence": 0.52,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ciao.",
            "start": 4552859,
            "end": 4552959,
            "confidence": 0.103,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und nicht vergessen, falls ihr eine Förderung in Höhe von 50.000 Euro für euer Open Source Projekt haben wollt, bewerbt euch beim Media Tech Lab. Link in den Shownotes.",
            "start": 4555918,
            "end": 4563505,
            "confidence": 0.7879310344827586,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.8114720955824545,
    "audio_duration": 4563.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}