{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/682c53df-17b1-4a18-b62e-ddfe402f57a2/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 3,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "6acncpom2y-acaa-478c-bd65-17aa28d03c84",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Einige sagen ja, kann ich überhaupt eine IT-Ausbildung machen, wenn ich noch nie zu Hause was programmiert habe. Ich sage immer, der Maurer-Azubi muss auch noch kein Haus gebaut haben. Ja, ganz oft ist es wieder das Vorurteil, ist ja nur eine Ausbildung. Du musst ja studiert haben, wenn du was Vernünftiges machen willst. Nur dann kannst du ja irgendwie programmieren oder Führungskraft wählen oder sonstiges. Also das finde ich zum Beispiel auch völlig banane, diese Geschichte. Ich hatte wirklich schon Prüflinge, die mit Kobol ihr Abschlussprojekt programmiert haben. Mega cool, weil er hat dann quasi das MVC-Pattern in Kobol nachgebaut und das war so...",
      "start": 2118,
      "end": 31806,
      "confidence": 0.7415619047619046,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das Land Deutschland ist bekannt für die hohe Qualität der Berufsausbildung. Auch im Bereich der Informatik kann man sich ausbilden lassen. Dabei sprechen wir vom Fachinformatiker, vom IT-Systemelektroniker, von der Kauffrau für Digitalisierungsmanagement oder IT-Systemmanagement. Doch wie ist der aktuelle Stand in der Berufsausbildung? Wie offen und modern sind die Ausbildungsinhalte? Halten diese Schritt mit der schnellen Entwicklung? Wie sehen die Statistiken von Ausbildungsstellen versus wirklichen Azubis aus? Und benötigen wir in 2023 überhaupt noch die klassische Ausbildung, wo wir uns mit YouTube und Coding Bootcamps alles viel schneller beibringen können? Über all das und noch viel mehr sprechen wir heute mit unserem Gast Stefan Macke. Viel Spaß!",
      "start": 36257,
      "end": 76635,
      "confidence": 0.8528055555555556,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Uns liegt ja Bildung ziemlich am Herzen und wir haben ja jetzt schon über viele Themen gesprochen, über Unis, gerade kürzlich über Doktortitel, Episode 77 gar nicht noch lange her, über die Bildung in der Kindheit mit Diana Knodl, wie können wir die Kinder in Richtung IT bringen. Aber wir haben noch nie so richtig den Zwischenteil beleuchtet, eigentlich so zwischen Uni-Welt, würde ich mal sagen, und Kinderwelt, da wo auch Andi herkommt. Andi hat ja auch eine Ausbildung genossen, oder?",
      "start": 79552,
      "end": 106273,
      "confidence": 0.8451234567901231,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Eine deutsche Berufsausbildung, richtig.",
      "start": 106313,
      "end": 108094,
      "confidence": 0.79975,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und nachdem wir Andy aber eh so viel reden hören in unseren Episoden, haben wir uns heute mal einen wirklichen Profi für Ausbildung eingeladen. Und ich darf mal ganz herzlich Stefan begrüßen. Hi.",
      "start": 108394,
      "end": 119481,
      "confidence": 0.8539393939393941,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Moin, hallo.",
      "start": 119521,
      "end": 120401,
      "confidence": 0.524,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Stefan, du bist selbst ausgebildeter Fachinformatiker mit der Fachrichtung Anwendungsentwicklung. Du bist Diplom Wirtschaftsinformatiker und hast ein Master in Software Engineering. du arbeitest als abteilungsleiter bei einer krankenversicherung mit unter anderem dem text deck java c sharp und einer programmiersprache die ich noch nie gehört habe namens natural yes du bist seit 2007 ausbilder für fachinformatiker du bist seit 2009 IHK-Prüfer und Dozent an einer privaten Hochschule, wo du unter anderem die Einführung in die Programmierung mit Java lehrst. Du hast einen eigenen Podcast zum Thema IT-Berufe. Was eine Nische. Du hörst Podcasts auf dreifacher Geschwindigkeit. Ich wiederhole, dreifach, nicht 1,3, dreifach. Somit sind unsere Episoden circa 17 Minuten lang. Und du hast auf deiner Webseite noch dein Google-Plus-Profil vollgenommen.",
      "start": 120441,
      "end": 176658,
      "confidence": 0.8165500000000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wow, oh Gott, oh Gott, oh Gott, okay. Da hast du gut gegraben, das wusste ich ja nicht mal mehr, okay.",
      "start": 176858,
      "end": 182908,
      "confidence": 0.5923333333333334,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hab ich was vergessen?",
      "start": 182928,
      "end": 183790,
      "confidence": 0.8180000000000001,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ich glaub nicht, nee, das ist so das Wichtigste, ja.",
      "start": 185758,
      "end": 187940,
      "confidence": 0.7138,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du kennst also unsere Stimmen wirklich im Dreifach-Speed-Modus. Das hab ich selber noch nicht erlebt. Nicht mal beim Schneiden, obwohl ich da sehr in hohen Speedraten schneide. Jetzt meine erste Frage wär sofort mal, warum machst du Programmierung mit Java und nicht mit Natural, die ich auch noch nie gehört habe? Was ist Natural?",
      "start": 187980,
      "end": 208296,
      "confidence": 0.7622592592592595,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Naja, ich mach ja beides. Also, Natural kann man vergleichen so, wer Kobol kennt, ist das ganz dicht dran.",
      "start": 208336,
      "end": 214201,
      "confidence": 0.7212105263157896,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Informatikausbildung gibt es zum Glück in vielen verschiedenen Arten. Ist der traditionelle Ausbildungsweg nicht dein Ding? Dann schau doch einmal bei unserem Episodensponsor, den Coding Bootcamps Europe vorbei. Dieses Remote Coding Bootcamp mit Fokus auf Frontendentwicklung öffnet dir die Tür zu deinem ersten Job als Junior Dev. In nur drei Monaten Vollzeitkurs oder neun Monaten Teilzeitkurs, welcher ideal für junge Eltern ist, lernst du HTML, CSS und JavaScript mit dem innovativen Vue.js Framework, das übrigens auch Wolfgangs Lieblingsframework ist. Aber es geht nicht nur um den Code. Im Bootcamp wird auch großer Wert auf Problemlösungsstrategien, Semantik und Accessibility gelegt. Das Beste? Es ist nicht nur ein Bootcamp, sondern deine Brücke zur realen Arbeitswelt. Denn Coding Bootcamps Europe vermittelt auch gerne zu den zahlreichen Partnerunternehmen, die aktiv nach Juniorentwicklerinnen suchen. Einige Firmen nutzen das Bootcamp sogar als interne Ausbildung, denn sie haben gelernt, dass Absolventinnen top ausgebildet sind und entlasten so ihre eigenen Seniorentwickler und Entwicklerinnen. Dein erster Schritt in die Welt der Informatik und des Codings beginnt hier. coding-bootcamps.eu Alle Links auch zum YouTube Kanal findest du auch in den Show Notes. Werbung Ende.",
      "start": 216603,
      "end": 289059,
      "confidence": 0.8111413043478259,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, Tamino hieß sie. Ja, genau. Die ist tot.",
      "start": 300768,
      "end": 302848,
      "confidence": 0.5648888888888889,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die kennen wir natürlich.",
      "start": 302868,
      "end": 305049,
      "confidence": 0.4205,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau, aber nach SAP, Software AG, zweitgrößter deutscher Softwarehersteller. Und Adabas ist eigentlich die Datenbank, mit der die groß geworden sind in den 1970er-Jahren schon. Kurz danach kam Natural, quasi eine 4GL-Sprache, um diese Datenbank abzufragen. Und ist aber in vielen Bankenversicherungen immer noch im Einsatz, auch heutzutage. Und nur mal so eine Anekdote am Rand. Sogar die ZDF-Mediathek lief mal auf Adabas Natural. Ich weiß nicht, ob's heute noch so ist, aber es war mal so.",
      "start": 305109,
      "end": 329913,
      "confidence": 0.7575194805194804,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe mir die Wikipedia Seite von Natural gerade mal rausgeholt und da steht drauf, dass diese Sprache unter anderem für Großrechner von IBM und Siemens entwickelt wurde und natürlich, wenn man über Großrechner von IBM spricht, spricht man natürlich über Mainframes, ZOS und Co. Meine Frage ist, programmierst du auf Mainframes?",
      "start": 330133,
      "end": 350565,
      "confidence": 0.844153846153846,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, Gott sei Dank nicht. Ungefähr die Hälfte der Kunden ist noch auf Mainframes tatsächlich. Die haben so ein Ding im Keller. Und wir zahlen da ein paar Millionchen, damit es ein bisschen schneller wird und so. Aber die andere Hälfte ist inzwischen, so wie wir auch auf Open Systems nennen die das, also auf Linux einfach unterwegs. Wir haben Suse Linux und da läuft das drauf. Kann auch inzwischen alles kontinuiert werden. Läuft alles in Kubernetes und so. Also das ist nicht mehr, also wie gesagt, die andere Hälfte der Kunden, die ist noch auf dem Mainframe. Ja, die haben da andere Probleme, aber auch wir im Linux-Umfeld haben uns eigentlich alles genauso gebaut wie die Java-Entwicklung mit Continuous Deployment und allem Schickschack.",
      "start": 351065,
      "end": 380395,
      "confidence": 0.7373225806451614,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Schade, wir suchen ja seit langem jemanden, der uns was zu Mainframes in der Episode erklären kann. Also vielleicht finden wir da noch eine oder den anderen. Aber kommen wir mal zurück zum Thema, zur Ausbildung. Für mich als Österreicher ist ja Ausbildung sowieso ein sehr schräges Wort, weil bei uns ist Ausbildung einfach alles. Bei uns heißt es ja Lehrberuf oder Lehre, auch wenn es um Informatik geht. Also erklär mal einem Österreicher, wie läuft denn dieses ganze System in Deutschland eigentlich ab? Wie läuft es mit der Ausbildung? Was gibt es denn da in der IT-Welt? In welchen Bereichen kann man sich da ausbilden lassen oder eine Ausbildung machen?",
      "start": 380735,
      "end": 415042,
      "confidence": 0.8299639639639638,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, also erstmal, ich glaube, das deutsche System der Ausbildung ist weltweit ganz gut aufgestellt, wird auch viel nachgefragt im Ausland. Wir haben ja so ein besonderes Ausbildungssystem. In Deutschland gibt es über 300 anerkannte Ausbildungsberufe. Jetzt muss man immer aufpassen, was für ein Ausbildungssystem Weg man sich anschaut ich rede jetzt wenn ich wenn ich Ausbildung sage meine ich immer die duale Ausbildung das bedeutet es gibt zwei Ausbildungspartner nämlich einmal die Berufsschule, dass also die Auszubildenden ganz normal in die Schule gehen und dort dann zum Beispiel ein oder zwei Tage die Woche oder wie es bei uns ist im Blockunterricht eine Woche Schule und dann zwei Wochen im Unternehmen sind, Und der andere Partner ist halt eben das Ausbildungsunternehmen und dort, das ist dann immer so der Punkt, was die Ausbildung eigentlich erreichen soll, nämlich berufliche Handlungskompetenz. Das heißt, am Ende der Ausbildung soll ich einfach in der Lage sein, meinen Beruf auszuüben. Darum geht's eigentlich. Und es gibt halt einige Theorieinhalte, die dann hauptsächlich auch in der Schule vermittelt werden und der ganze Praxisteil, was muss ich im Alltag machen, jetzt in unserem Fall Anwendungsentwicklung, Wie programmiere ich mit Java eine Klasse oder was auch immer ich da tue? Das wird dann halt im Ausbildungsunternehmen vermittelt und beides zusammen wird dann am Ende, also die Inhalte bei der Partner werden am Ende in der Abschlussprüfung abgefragt und dann entscheidet ein Prüfungsausschuss, ob man in der Lage ist, diesen Beruf auszuüben und dann darf man sich zum Beispiel Fachinformatiker für Anwendungsentwicklung nennen und hat diesen Beruf erfolgreich erlernt.",
      "start": 415442,
      "end": 489992,
      "confidence": 0.7794559386973183,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wie lange dauert das? Bei uns in Österreich sind es meistens vier Lehrjahre. Ist das bei euch ähnlich?",
      "start": 490766,
      "end": 496709,
      "confidence": 0.7689473684210526,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Üblich sind es eigentlich drei. Zumindest in den IT-Berufen sind es drei. Es gibt andere Berufe, die zwei Jahre sind und es gibt aber auch andere, die zum Beispiel dreieinhalb oder vier Jahre sind. Aber die IT-Berufe sind eigentlich immer dreijährig.",
      "start": 496769,
      "end": 506713,
      "confidence": 0.7808536585365855,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und mit welchem Alter kann man starten?",
      "start": 507133,
      "end": 509214,
      "confidence": 0.7852857142857144,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das hängt davon ab, was die Voraussetzungen für den Beruf sind, was die schulischen Abschlüsse angeht. Also wenn zum Beispiel die IT-Berufe kann ich offiziell, glaube ich, sogar mit Hauptschulabschluss machen oder mindestens Realschulabschluss. Und wenn ich den habe, kann ich loslegen. Das heißt, theoretisch könnte ich mit 15, 16 in so einer Ausbildung starten. Die meisten, sage ich auch gleich dazu, die heutzutage in der IT die Ausbildung starten, haben wohl aber eher Abitur oder Fachhochschulreife.",
      "start": 509254,
      "end": 531342,
      "confidence": 0.7816883116883117,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es ist aber auch so, dass, glaube ich, die Ausbildungsdauer auch unter gewissen Umständen auch verkürzt werden kann. Von drei auf zweieinhalb oder teilweise sogar auf zwei Jahre, oder?",
      "start": 531602,
      "end": 539545,
      "confidence": 0.8084137931034484,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Richtig. Also da muss man jetzt ins BBIG gucken, das Berufsbildungsgesetz. Das ist für alle Berufe einheitlich festgelegt. Es gibt einfach Voraussetzungen, die man erfüllen muss. Dann kann man grundsätzlich die Ausbildung immer verkürzen. Ganz simples Beispiel, wenn ich Abi habe, kann ich schon mal alleine um ein Jahr verkürzen, theoretisch. Und soweit ich richtig weiß, kann man die Berufsausbildung maximal auf die Hälfte verkürzen, also auf anderthalb Jahre. würde ich jetzt in der IT nicht unbedingt empfehlen, aber es wäre durchaus denkbar. Ich sag mal, so ein halbes Jahr verkürzen, das machen, ich sag mal, relativ viele, weil man da nicht so viel verpasst, zum Beispiel in der Berufsschule, aber ein Jahr verkürzen ist halt ein ganzes Jahr, was einem fehlt. Und wenn wir nachher nochmal drüber sprechen, was man eigentlich an Inhalten alles wissen muss, dann ist das schon ganz schön viel. Von daher, die meisten in der IT werden wahrscheinlich zwischen zwei oder drei Jahren, die meisten drei Jahre ausgewählt werden.",
      "start": 539605,
      "end": 582223,
      "confidence": 0.7792378048780486,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es war nämlich so bei meiner Ausbildung, ich bin auch ausgebildeter Fachinformatiker, Fachrichtung Anwendungsentwicklung, also das, was man so gut deutsch eigentlich Softwareentwickler nennt. Ich habe, glaube ich, wenn ich mich recht erinnere, auf zweieinhalb Jahre verkürzt. Jetzt mit der Erfahrung, die ich jetzt habe, muss ich aber zugeben, die Ausbildung habe mich nicht darauf vorbereitet, damit ich weiß, was ich im Beruf mache. Also mit Stackoverflow und Co. Ja, also ab und zu kriege ich eine Syntax-Error und dann frage ich mich, das habe ich nie im Leben getippt.",
      "start": 582482,
      "end": 611228,
      "confidence": 0.8166555555555555,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das wäre dann zum Beispiel, also in der Ausbildung müsstest du lernen, mit Stack Overflow umzugehen, weil so entwickelt man ja, oder? Copy-Paste von Stack Overflow, beziehungsweise Beitrag von JetGPT oder was auch immer. Aber ja, das gehört halt dazu, dass man jetzt natürlich in drei Jahren nicht der perfekte Software mitklaviert, das ist auch klar. Aber ich glaube, für den Tech-Stack, den man im Unternehmen einsetzt, ist man danach dann ganz gut vorbereitet, weil wenn man jetzt mal die Berufsschulzeiten abzieht, ist man ja schon eine recht lange Zeit dann da und kriegt dann hoffentlich, da mitsteht und fällt natürlich die Ausbildung, von einem guten Ausbilder oder einer Ausbilderin, das auch entsprechend praxisorientiert vermittelt, sodass ich es am Ende auch anwenden kann und es halt nicht nur aus dem Buch gelernt habe. Darum geht es natürlich hauptsächlich.",
      "start": 612368,
      "end": 647429,
      "confidence": 0.7560071942446042,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und in welchen Bereichen kann man jetzt eine Ausbildung machen? Also in welchen IT-Bereichen?",
      "start": 647549,
      "end": 651311,
      "confidence": 0.7535,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, ganz kurz dazu. Also wir haben inzwischen seit 2020, da wurden die IT-Berufe neu geordnet, gibt es sieben verschiedene IT-Berufe, die man in der Ausbildung machen kann. Das ist einmal der Beruf des Fachinformatikers. Da gibt es vier sogenannte Fachrichtungen. Das ist ähnlich wie zum Beispiel auch bei Elektronikern oder so. Die können sich dann, sag ich mal, spezialisieren auf bestimmte Bereiche. Und das ist bei den Fachinformatikern auch so. Da gibt es einmal den klassischen Weg der Anwendungsentwicklung. Also, ganz blöd gesagt, der Programmierer. Dann gibt es den Systemintegration-Bereich. Da geht es dann eher in Richtung Administration. Also Windows, Linux, Netzwerk, alles auf der Ebene. Dann gibt es jetzt ganz neu seit 2020 zwei neue Fachrichtungen. Und zwar einmal die digitale Vernetzung. Da ist so der Hintergrund so ein bisschen IoT und ich sag immer so bei Volkswagen das Bandprogrammieren quasi, also auch sehr hardware-nah und solche Dinge. So Robotik, in die Richtung geht es so ein bisschen. Und es gibt noch die vierte Fachrichtung, das ist Daten- und Prozessanalyse. Das ist so ein bisschen, ja, da sind eigentlich zwei grobe Brocken drin. Und zwar einmal geht das so ein bisschen in Richtung zum Beispiel SAP-Beratung. Prozessanalyse, aber eben auch Datenanalyse, also sowas wie Machine Learning und so soll da auch mit drin sein. Das alles in einer dreijährigen Ausbildung zu vermitteln, ist schon ein Brocken. Er hat sich auch noch nicht so durchgesetzt. Also die beiden neuen Fachrichtungen sind jetzt noch nicht so stark nachgefragt. Nur mal ein kurzer Zwischenwurf. Bei unserer Berufsschule, mit der wir kooperieren, haben wir ungefähr 100 Anwendungsentwickler und zwei oder drei machen Daten- und Prozessanalyse. Also es ist noch ganz, ganz, ganz stark am Anfang. Das sind die vier Fachinformatiker. Dann haben wir noch den IT-System Elektroniker. Der ist quasi ganz dicht an der Hardware. Der hat auch als einziger IT-Beruf ein sogenanntes Sperrfach, in dem er bestehen muss. Wenn man da durchfällt, besteht man die Ausbildung nicht. Und zwar ist das Elektronik. Das heißt, er darf auch wirklich mit Strom hantieren. Und da sollte es natürlich dann entsprechend funktionieren und einem nicht die Bude abfackeln. Das ist dann zum Beispiel jemand, der ja wirklich Telefonverkabelung macht oder hier durch die Gegend fährt und die ganzen Verteilstellen hier bei der Telekom zum Beispiel wartet und verkabelt und sowas. Und dann haben wir noch zwei kaufmännische Berufe. Das ist einmal Kaufmann beziehungsweise Kauffrau für Digitalisierungsmanagement und einmal für IT-Systemmanagement. Und um das so ganz grob auseinanderzuhalten, IT-Systemmanagement wäre vielleicht eher jemand, der vielleicht in so einem Elektronikmarkt Endkunden Dinge verkauft, Computer, Laptops, Handys, sowas in die Richtung, also auch Endkundenkontakt und Einkauf, Verkauf so ein bisschen. Und Digitalisierungsmanagement geht so in die Richtung, Digitalisierungsprojekte in Unternehmen umzusetzen, Beispiel im Supermarkt. weiß ich nicht soll das system automatisch erkennen wenn die schokolade ausverkauft ist und soll das nachbestellen oder so dass dann zum beispiel mit einem sap im hintergrund zu verknüpfen und dann eher kaufmännisch das ganze anzugehen dass das soll dieser beruf so ein bisschen darstellen.",
      "start": 652431,
      "end": 810710,
      "confidence": 0.8050178926441355,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bleiben wir mal bei den fachinformatiker beziehungsweise mit fachrichtungen da, ich kann mich daran erinnern dass ich in meiner ausbildung teilweise dieselben fächer wie system integratoren hatte ist das dann jetzt bei den zwei neuen digitale vernetzung und daten und prozessanalyse ebenfalls der fall weil wenn du sagst bei daten und prozessanalyse sind nur zwei oder drei personen im lehrjahr dafür machen die ja eigentlich keine neue klasse auf oder.",
      "start": 810730,
      "end": 834023,
      "confidence": 0.8162142857142856,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Genau, ja, das ist ein Problem. Das war auch schon früher ein Problem. Wir kommen, glaube ich, noch auf die Qualität in der Ausführung mal zu sprechen. Es gibt Berufsschulen, die alle IT-Berufe in eine Klasse packen, weil sie nicht genug haben. So zum Beispiel bei uns auch in Norddeutschland oben auf, also ganz, ganz oben in Richtung Küste, da wird das sehr, sehr dünn mit Leuten. Da haben die eine Klasse für alle. Und jetzt zum Beispiel unsere Azubis gehen nach Oldenburg zur Berufsschule und da gibt es allein drei komplette Klassen nur mit Anwendungsentwicklern. Also da wird dann auch wirklich fokussiert halt unterrichtet. Aber das kann ich halt nicht, wenn sieben verschiedene Berufe in der Klasse sitzen. Es ist leider inzwischen sogar noch schlimmer geworden, muss ich sagen, weil die ersten 18 Monate der Ausbildung sind für alle IT-Berufe identisch tatsächlich, also inhaltlich steht im Rahmenlehrplan exakt das Gleiche. Das ist also aus meiner Sicht nicht unbedingt eine Optimierung zu früher, ja, denn eigentlich würde das bedeuten, dass so ein Anmeldungsvermittler erst nach der Hälfte der Ausbildung anfängt zu programmieren und das ist irgendwie nicht so ganz zielführend. Das heißt, in den ersten 18 Monaten werden so absolute Grundlagen vermittelt, dafür aber sehr in die Breite, wenig in die Tiefe, aber sehr in die Breite. Und da sind auch ganz viele, sag ich mal, wirtschaftliche Sachen drin oder kaufmännische Sachen drin. So was wie, wie lese ich Angebote? Wie mache ich einen Angebotsvergleich? Wie schreibe ich eine Abrechnung? Aber auch so was, wie bringe ich einen Client in ein Netzwerk? Und auch ganz, ganz oberflächlich ein bisschen Programmierung. Schreiben mal so ein PowerShell-Skript über 10 Zeilen oder so. Also wirklich Rundumschlag. Ach ja, und natürlich Elektrotechnik. Das muss man natürlich auch gerne, weil wir haben ja noch so einen Elektrotechnik-Beruf mit drin. Und das ist immer eine ganz große Überraschung, was dann in der Prüfung abgefragt wird, weil das wird ja einfach komplett in die Breite alles mit, ja, RAID-Systeme, ne, muss man natürlich auswendig kennen. Und die USVs, die es da verschiedene gibt. Und also wirklich ganz, ganz wild, was man da lernen muss. Und im zweiten Teil der Ausbildung wird dann, das muss man jetzt eigentlich sagen, im Vergleich zu früher, deutlich stärker vertieft. Das heißt, im Einbruchsentwicklerbereich habe ich dann tatsächlich auch solche Sachen wie Designpattern, UML-Diagramme, Datenbankentwurf, Testverfahren, etc. Also da geht's dann schon auch wirklich in Richtung, sag ich mal, Praxis bei der Programmierung. Das ist bei den anderen Berufen natürlich auch so. Aber ja, so grob 50 Prozent der Ausbildungen sind für alle IT-Berufe gleich. Das war früher anders. Da hat's wahrscheinlich an der Berufsschule gelegen, dass du die gleichen Kurse hattest wie die anderen Berufe.",
      "start": 834723,
      "end": 958189,
      "confidence": 0.773433920704846,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber hast du nicht gerade gesagt, dass man die Ausbildung sogar bis um die Hälfte, also auf anderthalb Jahre, verkürzen kann? Das bedeutet, wenn ich die komplett verkürze, dann nehme ich nur den generellen Teil mit und habe gar keine Spezialisierung auf meine Fachrichtung?",
      "start": 958547,
      "end": 971914,
      "confidence": 0.8178409090909089,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, es kommt darauf an, wie du das verkürzt. Da gibt es verschiedene Möglichkeiten. Du kannst zum Beispiel die Ausbildung so verkürzen und direkt im zweiten Ausbildungsjahr einsteigen quasi und nimmst dann das zweite und dritte Ausbildungsjahr in der Schule mit. Du kannst auch sagen, ich fange bei Ausbildungsjahr 1 an und mache dann nur 1 und 2, aber das würde ich vielleicht nicht unbedingt empfehlen, weil da fehlt dir ganz viel für die Abschlussprüfung. Also, Verkürzung um länger als ein Jahr ist immer ein bisschen schwierig. Habe ich, ehrlich gesagt, in der Praxis auch noch nie gehabt. Wobei, ehrlich gesagt, es gibt ja auch noch die Umschulungen, und Umschüler haben eine noch kürzere Ausbildungszeit, machen aber den gleichen Stoff. Das heißt, die haben eigentlich jedes Jahr immer dieses Problem, dass sie diesen Riesenhaufen in noch kürzerer Zeit vermittelt bekommen müssen. Wenn man ein halbes Jahr verkürzt, ist das nicht so ein Problem. Bei einem Jahr werden die meisten einfach ins zweite Jahr einsteigen und gehen dann davon aus, dass sie diese Grundlagen, ich weiß nicht, schon aufgrund irgendwelcher Kurse im Abitur vielleicht hatten oder die haben schon eine schulische Ausbildung vorher gemacht im IT-Bereich, sowas gibt es auch noch. Da hat man dann solche Grundlagen vielleicht schon. Aber das ist nicht ohne, würde ich mir gut überlegen.",
      "start": 972715,
      "end": 1028950,
      "confidence": 0.7393256880733944,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hattest du schon gesagt, dass die neuen Büro für digitale Vernetzung und Daten- und Prozessanalyse jetzt noch nicht so großen Anklang finden, obwohl sie ja inzwischen drei Jahre schon auf dem Markt sind. hast du denn ich sag mal aktuelle zahlen beziehungsweise statistiken wie die verteilung von den berufen jetzt deutschlandweit ist, Also ja, die gibt es.",
      "start": 1029190,
      "end": 1049485,
      "confidence": 0.742344827586207,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es gibt einfach jedes Jahr eine Statistik über alle Ausbildungsberufe. Wie gesagt, es gibt ja über 300 verschiedene, da kann man immer mal reingucken. Und da steht dann zum Beispiel für die männlichen Auszubildenden sowas wie Kfz-Mechatroniker immer ganz oben oder halt auch Einzelhandelskaufleute und so weiter. Aber tatsächlich der Fachinformatiker mit allen vier Fachrichtungen, das ist so ein bisschen die Einschränkung dieser Statistik, wird nicht nach Fachrichtung unterschieden. Der Fachinformatiker ist inzwischen der fünftbeliebteste Beruf in Deutschland, mit über 16.000 Neuabschlüssen jedes Jahr. Das heißt, der hat für den männlichen Part, da ist er auf Platz zwei tatsächlich schon, das heißt, der hat die klassischen Ausbildungsberufe, so was wie Maurer, etc., BP, Tischler und so weiter, alle überholt. Das heißt, der ist wirklich unter den männlichen Azubis sehr beliebt und auch sehr verbreitet. Bei den weiblichen sieht es ein bisschen anders aus, also Geschlechterverteilung ist, meine ich so, 91 Prozent männlich. Und da bei den Frauen sieht es natürlich ein bisschen anders aus, ich weiß nicht, auf welcher Position er ist. Und insgesamt, über beide Geschlechter hinweg, ist er halt auf Platz 5. Das heißt, also der Auswuchsberuf mit den fünftmeisten neuen Auswuchsverträgen jedes Jahr. Das ist, finde ich, schon ganz gut.",
      "start": 1049545,
      "end": 1112672,
      "confidence": 0.758344827586207,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Machst du mir grade Hoffnung, dass wir den Fachkräftemangel zumindest in der Softwareentwicklung jetzt in Deutschland irgendwie jetzt in den nächsten zwei, drei Jahren so, okay, haben wir geschafft, aber dann kommt der Fachkräftemangel bei den Handwerkern, oder?",
      "start": 1113572,
      "end": 1127296,
      "confidence": 0.7634210526315791,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Na ja, Fachkräftemangel haben wir überall auf jeden Fall. Ich sag mal so, der ist in den letzten Jahren geklettert. Der ist quasi, ich glaub, in den letzten drei Jahren immer so ein Positionchen hochgerutscht, und jetzt ist er halt schon auf Platz fünf. Das sieht ganz gut aus, aber ich glaube, um den Mangel, den wir da haben, zu decken, reicht das nicht. Also da brauchen wir, glaube ich, noch ein bisschen mehr. Vor allen Dingen, weil es ja in allen Ecken und Enden brennt. Also Gastronomie, etc., darüber brauchen wir, glaube ich, nicht zu reden. Und IT ist ja auch ein weiteres Feld, wo einfach dringend Leute gebraucht werden. Von daher finde ich es natürlich gut, dass das stärker nachgefragt wird. Absolut. Aber das alleine wird unser Problem nicht lösen. Da gehe ich nicht von aus.",
      "start": 1127316,
      "end": 1162788,
      "confidence": 0.7267101449275362,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hast bei Systemintegration Windows und Linux genannt, wenn ich das richtig mitbekommen habe. Bei uns in Österreich war das, beziehungsweise bei uns in Tirol, da wo ich den Einblick hatte, war das immer ein extremes Problem, dass alles so Windows fokussiert war. Es war wirklich durchgehend Windows. Also Linux war, glaube ich, eigentlich überhaupt nicht vorhanden. Läuft es bei euch fairer ab? Gibt es da Möglichkeiten, mehr in Linux auch abzutauchen oder sind da die Firmen und gerade Windows extrem drinnen?",
      "start": 1163052,
      "end": 1189901,
      "confidence": 0.8076463414634145,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Da muss man ganz klar sagen, das liegt am Ausbildungsunternehmen. Es gibt einen Ausbildungsrahmenplan, der in der Berufsverordnung als Anhang am Gesetz hängt, was man an Inhalten so vermitteln muss in der Ausbildung. Das sind sehr, sag ich mal, abstrakte Begriffe, die da stehen. Da würde dann so was stehen wie, man muss ein Betriebssystem beherrschen. Steht aber gar nicht hinter welches, weil es gibt ja ganz viele. Dann gibt es einen Rahmenlehrplan. Das ist der, der an den Berufsschulen gelehrt wird. Da steht dann auch irgendwas Abstraktes drin. Aber letztlich müssen natürlich die Lehrer und Lehrerinnen und auch die Ausbilder und Ausbilderinnen das irgendwie in die Praxis übertragen. Und da nehmen sie dann natürlich meistens die Sachen, die einfach im Unternehmen eingesetzt werden. Und das hängt dann ganz stark davon ab, wo ich mich ausbilden lasse. Also wenn ich in einem reinen Windows-Shop bin, werde ich kein Linux kennenlernen, auch wenn ich das theoretisch mal können müsste für so eine Prüfung. Aber viele Unternehmen bilden halt auch, sag ich mal, nach Bedarf aus. Und das machen sie natürlich mit den Technologien, die sie selber einsetzen. Und dann muss ich mich vorab so ein bisschen informieren, was möchte ich denn eigentlich lernen und was wird in meinem Unternehmen eingesetzt, dass zum Beispiel jetzt bei uns in der Ausbildung Java eingesetzt wird. Ja, das kann in einem anderen Unternehmen halt ganz anders sein. Also da muss man sich schon informieren. Das ist aber bei anderen Berufen genauso. Das ist ja genau der Teil, der diese Berufsausbildung so interessant macht, nämlich, dass ich praktisch handlungsfähig werde. Und das werde ich halt nur, wenn ich die Technologien kann, die ich im Unternehmen da brauche. Auf der anderen Seite habe ich natürlich dann die Herausforderung als Ausbilder, dass ich ja eigentlich nicht nur für mein Unternehmen ausbilden sollte. Das ist ja ein allgemein anerkannter Berufsabschluss und da kann ich jetzt zum Beispiel in unserem Fall nicht sagen, ich bringe unseren Azubis aber nur natural bei und dann habt mal viel Spaß auf dem Arbeitsmarkt, wenn ihr mal woanders hin wollt. Also das geht natürlich nicht. Deswegen habe ich persönlich den Anspruch, dass sie natürlich allgemein ausgebildet werden sollen. Aber natürlich im Zweifel mit den Technologien, die wir einsetzen. Also Beispiel, ich würde zum Beispiel nicht den Fokus auf Java legen, sondern ich lege den Fokus auf Objektorientierung am Beispiel von Java. Und dann kann ich dann in der Prüfung später auch vielleicht mit einer ganz anderen Programmgesprache arbeiten oder darauf Fragen beantworten, wenn ich die gestellt bekomme.",
      "start": 1190341,
      "end": 1308602,
      "confidence": 0.7935271867612296,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie ist denn der Stand von den Berufsschulen? Du hast da ja mehr Einblick. Ich kann mich erinnern, ich habe einmal so einen Plan studiert, was die da so machen in der Schule und habe mir gedacht, irgendwie sind die zehn Jahre hinten, um ehrlich zu sein. Vor allem auch die Lehrer dann teilweise. Das sind so eingesessene Leute, die aus irgendwelchen anderen Richtungen, gerade in der Informatik, kommen oft und einfach weit, weit weg sind eigentlich von der Praxis und was up to date ist. Wie sieht denn das bei euch aus? Zumindest da, wo du Einblick hast.",
      "start": 1308862,
      "end": 1337352,
      "confidence": 0.7908484848484847,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, es kann man einfach nur sagen, kommt drauf an. Genau wie bei Ausbildern. Da gibt es auch Leute, die sehen die Azubis als billige Arbeitskraft und hier, setzt mal WordPress-Seiten auf, damit wir Geld verdienen. Und genauso ist es bei den Lehrern auch. Es gibt super gute Lehrer, die top aktuell sind, auch immer am Puls der Zeit sind und andere, die machen halt ihr Ding so. Das ist, glaube ich, in jedem Beruf so. Und ich hatte weiß nicht, ob ich es schon erwähnt hatte, aber der Prüfungsausschuss, der am Ende die Prüfungen abnimmt, muss sogenannt paritätisch besetzt sein aus einem Arbeitnehmer, einem Arbeitgeber und einem Lehrervertreter. Und das heißt, viele Lehrer sind auch Teil des Prüfungsausschusses und wissen demnach auch, was rankommt in den Prüfungen und bereiten dementsprechend auch ihren Unterricht vor. Und die Lehrer, die ich dort kennengelernt habe und Lehrerinnen übrigens auch, gibt es auch in der IT natürlich, Die schauen dann schon, was wird in Unternehmen eingesetzt, bereiten im Unterricht entsprechend darauf vor, bereiten die Zielgerichte auch auf die Prüfung vor und kümmern sich auch um neue Sachen. Jetzt gerade bei der Neuordnung 2020, da haben die Lehrer wirklich viel Zeit investiert, um diesen, wie ich gerade schon sagte, sehr abstrakten Traktenlehrplan auf konkrete Inhalte zu übertragen. Und nur als Beispiel, die haben an unserer Berufsschule jetzt seit Jahren mit Java gearbeitet. Und durch diese Neuordnung wurde jetzt zum Beispiel umgestellt auf Python, sodass sie im ersten Ausbildungsjahr in die Programmierung jetzt mit einer ganz anderen Sprache einsteigen, die auch noch dynamisch typisiert ist statt statisch. Das heißt, das hat alles jahrelang anders funktioniert. Und da müssen sich jetzt die Lehrer und Lehrerinnen auch umstellen. Das hat auch eigentlich ganz gut funktioniert. Also ich kann jetzt nur sagen, die Leute, die ich da kenne, die machen echt einen super Job. Aber selbstverständlich gibt es ja auch Leute, die ziehen einfach hier den durch.",
      "start": 1337772,
      "end": 1421932,
      "confidence": 0.7795705329153609,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Sind die inhalte die in den berufsschulen gelehrt werden deutschlandweit standardisiert oder macht da jedes bundesland irgendwie seinen eigenen also ich meine ja so in welche flexibilität haben die also lehren jetzt alle berufsschulen peißen oder kann das sein dass irgendeiner noch auf c hängt.",
      "start": 1422692,
      "end": 1439218,
      "confidence": 0.7637999999999999,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja bildungspolitik und deutschland das ist immer ganz interessant weil das ist ja länder sache das heißt wir haben in jedem land unterschiedliche vorgaben wobei da muss man jetzt sein sagen bei den berufen ist es tatsächlich so dass deutschlandweit. gleiche Prüfungen und Voraussetzungen gelten, außer in Baden-Württemberg. Baden-Württemberg macht sein eigenes Ding, und das kann man überhaupt nicht mit dem Rest der Republik vergleichen, aber alle anderen 15 Bundesländer machen das recht einheitlich. Wobei jetzt dann die konkrete Ausgestaltung in den einzelnen Berufsschulen wieder jedem selbst überlassen ist. Also es gibt keinerlei Vorgaben, du musst Python machen, du musst PHP, Java, irgendwas machen, das kann jeder komplett frei entscheiden. Und das fällt aber noch mal ganz wichtig, Es wird auch in keiner Prüfung irgendwas Spezifisches zu einer Programmiersprache abgefragt. Die ist immer so offen gestellt, dass man einfach einen Algorithmus formulieren muss und tatsächlich sogar eher einen Pseudocode. Das heißt, eine konkrete Programmiersprache muss man auch gar nicht vermitteln, sondern man nimmt einfach die, ja, entweder die man im Unternehmen einsetzt oder wo der Lehrer halt sagt, ja, damit kann ich es am besten vermitteln. Und das kann inzwischen Python sein. Ich kenne aber Berufsschulen, die nutzen C. Es gibt C++, wobei ich das häufig tatsächlich aus der Physiausbildung eher höre, dass sie das da einsetzen. Keine Ahnung warum.",
      "start": 1439598,
      "end": 1506949,
      "confidence": 0.8001727272727268,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ist die Physiausbildung?",
      "start": 1506989,
      "end": 1508650,
      "confidence": 0.377,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das ist der Fachinformatiker für Systemintegration.",
      "start": 1508947,
      "end": 1511409,
      "confidence": 0.8986666666666666,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ah, okay.",
      "start": 1511449,
      "end": 1511930,
      "confidence": 0.1835,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Und der 4AE, oder wir kürzen den auch anders ab, 4AN oder so, ist dann für die Amerikanische Entwicklung. Also wie gesagt, C, C++ kenn ich, Java, C Sharp, Python, PHP, die hab ich alle schon im Beruf schon mal gesehen. Es gibt da keine Standards.",
      "start": 1511970,
      "end": 1526161,
      "confidence": 0.7455434782608699,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Während du gerade Baden-Württemberg genannt hast, hab ich direkt mal nach einem baden-württembergischen Flachwitz gegoogelt. Ein Schwabe, ein Berliner und ein Badener wetten um 100 Euro, wer am längsten tauchen kann. Der Schwabe ist ertrunken.",
      "start": 1526181,
      "end": 1538749,
      "confidence": 0.7835142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sehr gut.",
      "start": 1540575,
      "end": 1540995,
      "confidence": 0.614,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder auch schön, was verbindet Baden mit Württemberg? Ein Bindestrich.",
      "start": 1541736,
      "end": 1545939,
      "confidence": 0.7266,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Sehr gut.",
      "start": 1545959,
      "end": 1548801,
      "confidence": 0.7290000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber du hattest gerade gesagt, dass als Unternehmen sollte man eigentlich allgemein ausbilden. Und da hattest du auch schon, ich sag mal, dieses Vorurteil, oder vielleicht ist es ja auch wahr, ich weiß es nicht, genannt, dass manche Unternehmen, ich sag mal, Azubis als billige Arbeitskraft nehmen. Aber das ist natürlich dann schon so ein kleiner Spagat. Also zum Beispiel, ich habe in meiner Ausbildung im Unternehmen habe ich PHP, JavaScript, CSS und HTML und so weiter gemacht. In der Schule habe ich dafür C programmiert und Java, glaube ich. Also kopftechnisch war das damals zumindest für mich schon ein Spagat. Klar, die Prüfung war dann alles sehr generell. Und wenn ich mir jetzt noch denke, dass jetzt andere Schulen dann zum Beispiel Python machen und dann die zum Beispiel in ihrem Unternehmen eine stark typisierte und eine stark objektorientierte programmiersprache wie java zum beispiel machen das kann ja schon kopftechnisch dann spagat sein oder absolut also man.",
      "start": 1548841,
      "end": 1600574,
      "confidence": 0.802493670886076,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Muss immer dann denken da du kannst theoretisch als 16 jähriger anfangen mit der ausbildung du hast vorher noch nie programmiert das ist also ich sehe das immer so einige sagen ja kann ich überhaupt mal die ausführung machen wenn ich noch nie zu hause was programmiert habe ja natürlich ich sage immer der maurer azubi muss auch noch kein haus gebaut haben das ist ja irgendwie quatsch aber viele bringen natürlich ein bisschen vorkenntnis und einfach interesse mit Aber theoretisch könnte jemand mit Realschulabschluss mit 16 da sitzen und halt noch nie programmiert haben, muss jetzt anfangen. Und da ist es natürlich sehr schwierig und eine Herausforderung, dann zwei verschiedene Programmiersprachen gleichzeitig zu lernen und auch noch in unterschiedlicher Geschwindigkeit. Denn meistens, so hat es sich schon so ein bisschen angedeutet, sind die Betriebe ein bisschen schneller bei der Vermittlung als die Berufsschulen. Aber es ist auch ganz normal, weil, wie gesagt, die sind darauf ausgelegt, dass da halt 16-Jährige sitzen. Auf der anderen Seite haben wir auch immer mehr ältere Azuis, die vielleicht schon eine andere Ausbildung haben oder sogar schon studiert haben, die dann da mit 30 sitzen und ein ganz anderes Skill-Level haben. Das heißt, sie haben eine ganz heterogene Gruppe dort in der Klasse. Von daher muss man das irgendwie erstmal auf einen Nenner bringen. Das ist also für die Azubis alles andere als einfach. Ich sehe es bei meinen Azubis auch jetzt, wo umgestellt wurde. Erst im ersten Jahr, wenn ich jemanden habe, der noch nie programmiert hat, und dann fängt er auf einmal an, Python-Befehle in Java einzutippen, weil das ist einfach alles durcheinander dann. Also es ist nicht einfach. Deswegen, ich sage schon, der Anspruch auch in der Anwendungsentwicklerausbildung, der ist schon recht hoch. Und wenn man dann auch noch zwei Sprachen gleichzeitig lernt.",
      "start": 1600614,
      "end": 1674814,
      "confidence": 0.7417715231788082,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Weil du jetzt erwähnt hast, 16-Jährige, wie teilt sich das ungefähr auf? Bei dir jetzt, so deiner Erfahrung nach, sind das wirklich vereinzelt nur 16-Jährige? Also, ich glaub, bei uns sind das eher der Großteil 16-Jährige, also die, die schon früh anfangen damit. Wie ist das bei euch?",
      "start": 1674834,
      "end": 1691221,
      "confidence": 0.7286250000000001,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ich würde jetzt mal behaupten, wenn ich jetzt aus Sicht der Prüfungen gucke, wo die am Ende ja alle landen, ist die Tendenz eher in Richtung etwas älter. Ich würde behaupten, ich weiß nicht, ob der Großteil inzwischen Abi hat, aber ich glaube, sehr viele haben schon Abi. Einfach weil diese IT-Ausbildung auch ja Ja, das hört sich mal so blöd an, dass die anspruchsvoll ist. Man kann das jetzt nicht mit dem Studium vergleichen, wo man ja Abi braucht, das ist klar. Aber ich finde schon, dass die anspruchsvoll ist, einfach auch, weil die Breite der Themen und so weiter, die da abgedeckt wird, sehr groß ist. Und die Tendenz geht dahin, das muss man ja auch immer berücksichtigen, die Unternehmen stellen ja die Azubis ein. Und die nehmen natürlich dann auch präferiert Leute, wo sie sicher sind, dass sie die Ausbildung bestehen. Und das ist dann bei Abiturierenden wahrscheinlich her, vermutlich. Deswegen würde ich behaupten, die Azubis, die wirklich mit Realschule mit 16 dort anfangen, sind eher in der Unterzahl. Wir haben ja auch im IT-Bereich ganz viele, wie ich gerade schon sagte, die zum Beispiel Studienabbrecher sind, die nochmal was handfestes machen wollen, dann setzen sie sich da auch mit rein. Es gibt ja auch viele Umschüler, die zum Beispiel irgendwie gesundheitlich eingeschränkt sind und ihren Job wechseln müssen, das gibt es ja auch alles noch. Also Tendenz ist eher, dass die schon ein bisschen älter sind, so um die 19, 20, schätze ich jetzt mal.",
      "start": 1691261,
      "end": 1758013,
      "confidence": 0.7884658634538154,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Inhalte, die in den Fachinformatikerberufen denn gelehrt werden, du hast gerade schon angesprochen die neuen Felder, digitale Vernetzung, IoT, Daten- und Prozessanalyse, Python, Machine Learning, das geht ja alles so voll in die moderne Richtung, würde ich mal sagen. Wie ist denn deine Einschätzung im Allgemeinen? Würdest du sagen, die Inhalte, die in der Fachinformatikerausbildung gelehrt werden, entsprechen dem sich schnell entwickelnden Internetstandard?",
      "start": 1758270,
      "end": 1784764,
      "confidence": 0.7877968750000002,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das würde ich sagen, hängt vom Ausbildungsunternehmen ab. Man muss ja mal sehen, 2020 wurden die Berufe neu geordnet. Sie wurden das erste Mal festgelegt 1997. Das heißt, sie waren 23 Jahre lang unverändert am Markt mit der gleichen Ausbildungsordnung. Das heißt, das, was vor über 20 Jahren aufgeschrieben wurde, wurde die ganze Zeit benutzt, um die Leute auszubilden. Das spricht eigentlich dafür, dass die Inhalte sehr zeitlos formuliert sind, sagen wir mal vorsichtig. Das heißt, da steht im Rahmenplan sowas drin wie, du musst Programmierparadigmen auseinanderhalten können. In der Neuordnung steht dann wenigstens sowas wie zum Beispiel objektorientiert und funktional, ja, aber Programmierparadigma, ja, gibt es jetzt auch vielleicht alle zehn Jahre mal ein neues, dann kann man das halt einfach unter diesem Oberpunkt dort mit in die Ausbildung reinbringen. Und ich würde mal behaupten, da die Prüfungen ja von zwei Drittel der Prüfungsausschüsse sind ja in der freien Wirtschaft, Arbeitnehmer, Arbeitgeber, die arbeiten ja mit dem, was am Markt der Bedarf ist. Das heißt, da sind die Prüfungen sehr modern auch schon immer gewesen, meiner Meinung nach. Berufsschule ist halt tendenziell immer ein Problem, da mahlen die Mühlen etwas langsamer. Aber die Ausbildungsunternehmen, da hängt es dann daran, ja, ob ich halt ein Unternehmen habe, was darauf viel Wert legt und moderne Sachen einsetzt oder halt, jetzt wie bei uns, Versicherungen, 30 Jahre alte Programmiersprache, wenn ich Pech habe, lerne ich halt die in der Ausbildung. Also das kommt ganz stark darauf an, wie sich die Ausbilder und Ausbilderinnen da einsetzen. Jetzt in unserem Fall, unser Bestandsführungssystem, mit dem, ich sage das immer so, wir unser Geld verdienen, ist halt in Natural programmiert. Aber deswegen würde ich meine Azubis nicht auf natural ausbilden, weil dann kommen sie nicht gut durch die Prüfung und werden sicherlich auch keine guten allgemein einsetzbaren Softwareentwickler. Dass wir das irgendwann auch mal brauchen, weil unser Unternehmen das halt haben muss, das ist ganz klar, aber da würde ich nicht den Fokus in der Ausbildung drauf legen. Aber andere Unternehmen machen das vielleicht. Ich hatte wirklich schon Prüflinge, die mit Kobol ihr Abschlussprojekt programmiert haben. Der Typ, der das gemacht hat, erinnere ich mich heute noch dran. Mega cool. Weil er hat dann quasi das MVC-Pattern in Kobol nachgebaut. Und das war so, boah, eins. Viel Spaß. Aber es gibt Leute, die haben da nicht so den Schirm davon und machen ihr Leben lang danach vielleicht Kobol.",
      "start": 1785464,
      "end": 1906505,
      "confidence": 0.7991836228287836,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja.",
      "start": 1907205,
      "end": 1907746,
      "confidence": 0.806,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wie Andy immer sagt, Legacy verdient das Geld.",
      "start": 1907766,
      "end": 1910628,
      "confidence": 0.686625,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, das ist tatsächlich so, ja.",
      "start": 1910648,
      "end": 1913750,
      "confidence": 0.4756666666666667,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "So, Fun Fact, du sagtest gerade, Stefan, es gibt dann moderne Unternehmen, ja, und dann gibt's so was wie die Versicherung, ihr nutzt dann natural. Meines Erachtens nach, es hält sich ja wirklich knallhart das Gerücht, dass Leute, die Kobold programmieren und heutzutage noch Mainframe-Programmierung machen, dass die ja Stunden- oder Tagessätze nehmen können, die irgendwo im universum sind also theoretisch bildet ihr dann eigentlich den reichtum aus den zukünftigen reichtum wenn sie sich zumindest als freelancer selbstständig machen also so viele.",
      "start": 1913910,
      "end": 1945361,
      "confidence": 0.7726341463414632,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Bekannte andere Natural-Anwender, die immer sagen, wir lösen schon seit 20 Jahren Natural ab. Das ist erstaunlich. Ja, das ist nicht so einfach, solche etablierten Systeme abzulösen. Aber ehrlich gesagt, das habe ich in zehn Jahren auch mit Java-Anwendungen ganz sicher. Also das ist einfach nur eine Frage der Zeit. Es ist in bestimmten Branchen einfach nicht tot zu kriegen und ich sage auch nicht, dass das schlecht ist oder so. Man kann auch in Coboil oder eben auch in Natural richtig coole Sachen machen. Also wir haben für Natural auch, das habe ich sogar als Teil meiner Masterarbeit gemacht, ein eigenes Test-Framework gemacht. Wir haben inzwischen Continuous Integration da alles selber gebaut und solche Sachen. Da kann man richtig coole Sachen machen, wenn das Unternehmen einen unterstützt. Wenn man natürlich sagt, wie gerade, Wir müssen Geld verdienen, die Entwickler sind hier, die müssen Anforderungen umsetzen, dann funktioniert es natürlich nicht und dann programmiere ich halt Natural oder Cobol wie vor 20 Jahren. Also, und so habe ich zum Beispiel auch meine Ausbildung angefangen, direkt auf dem Server hardcoded auf der Produktion, dann wird gespeichert und dann ist das Ding live quasi. Und davon mal wegzukommen in Richtung Subversion war es bei uns erst, dann in Richtung Git und dann in Richtung Continuous Deployment, das ist natürlich ein Brett, was man erstmal bohren muss und das machen viele Unternehmen nicht. Und dann würde ich auch behaupten, dass die jetzt nicht unbedingt die ersten sind, die ausbilden, aber das ist nur eine Vermutung.",
      "start": 1947062,
      "end": 2012997,
      "confidence": 0.7507738095238095,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also eigentlich sollte man einen neuen Beruf einführen, den Migrationsentwickler oder der Migrationen durchführt. Das ist eigentlich die wirkliche Zukunft. Aber auf die Berufe zurückzukommen, die werden deutschlandweit definiert, oder?",
      "start": 2013477,
      "end": 2025413,
      "confidence": 0.8263666666666666,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Die Berufe gelten nur in Deutschland, sind nur in Deutschland. anerkannt. Ja, es gibt sicherlich auch viele im Ausland, die dann so etwas anerkennen. Aber andersherum, wenn man zum Beispiel Bewerbungen sich anschaut und ausländische Uni-Abschlüsse werden ja in Deutschland teilweise nicht mehr anerkannt. Das heißt, wir kriegen zum Beispiel auch für die Ausbildung ganz, ganz viele Bewerbungen von studierten Masterleuten aus, ich weiß es nicht, Tunesien, Iran etc., weil die einfach nichts anerkannt bekommen. Ich glaube, in die Gegenrichtung, ehrlich gesagt, ich weiß es nicht, ich kenne keinen ausländischen Recruiter, aber ich glaube, das deutsche Ausbildungssystem an sich hat schon einen sehr guten Ruf. Aber wie das Ausland das genau anerkennt, das kann ich sagen.",
      "start": 2025453,
      "end": 2060833,
      "confidence": 0.7864741379310346,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also es ist schön, dass du das globaler siehst. Meine Frage war ja eigentlich eher in die andere Richtung bezogen, dass die Berufe in Deutschland alle gleich sind und nicht auf Länderebene spezifiziert werden.",
      "start": 2060873,
      "end": 2070155,
      "confidence": 0.738294117647059,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ach so, ja. Ja, nein. Ja, das stimmt.",
      "start": 2070215,
      "end": 2071456,
      "confidence": 0.34075,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber das ist auch der Fall, oder? Aber es ist schön, dass du das gleich globaler siehst. Dann haben wir das auch noch abgefrischtigt. Wahrscheinlich in Österreich würden die meisten Ausbildungen höchstwahrscheinlich anerkannt werden, denke ich mal. Also im Großen und Ganzen.",
      "start": 2071476,
      "end": 2084197,
      "confidence": 0.7653571428571427,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "In deutschland gibt es so viele ich weiß listen von universitäten von ausländischen universitäten ob diese hier anerkannt sind diese abschlüsse um genau dieses problem was du gerade besprochen hast leute aus tunesien und so weiter zu umgehen und da ist weil es zum beispiel in indien sehr sehr sehr viele universitäten gibt fehlen dann ab und zu mal so universitäten auf der liste und das Also da habe ich so ein bisschen Erfahrung in meiner Einstellungskarriere, von Hiringkarriere gemacht, dass, oh, die Uni ist nicht auf der Liste, okay, dann müssen wir dann halt immer mit dem, wir haben dann immer mit irgendeinem Amt in Düsseldorf telefoniert und dann haben die uns die neue Liste gegeben oder so.",
      "start": 2084658,
      "end": 2120508,
      "confidence": 0.7762016806722692,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ah, okay.",
      "start": 2120648,
      "end": 2121228,
      "confidence": 0.7055,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wenn das nicht auf der Liste steht, dann kannst du nämlich diese Leute auch nicht als Akademiker hereinbringen in das Land und dann ist es meistens gar nicht möglich, deine Arbeitsgenehmigung und so weiter zu bekommen. Also das ist ein komplexes Feld, ja.",
      "start": 2121288,
      "end": 2133679,
      "confidence": 0.7705454545454546,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ich möchte noch mal ganz kurz, weil das ist jetzt kein Witz. Das hab ich mir nicht ausgedacht. Wolfgang, du sagtest, Legacy verdient das Geld. Da haben wir über Mainframe gesprochen.",
      "start": 2134819,
      "end": 2143684,
      "confidence": 0.7971612903225805,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Du sagst immer, Legacy verdient das Geld.",
      "start": 2143724,
      "end": 2146045,
      "confidence": 0.4657142857142857,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ich hab das Gefühl, der Stefan wusste das schon lange vor uns. Der Stefan hat nämlich 2017 auch einen eigenen Podcast darüber gemacht, wie es damit ist, mit Natural zu arbeiten. Und der Name hieß Legacy Coder.",
      "start": 2146085,
      "end": 2160192,
      "confidence": 0.8196756756756758,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja! Genau, weil die Domain noch frei war und so gut zu merken, habe ich das genommen.",
      "start": 2160233,
      "end": 2165143,
      "confidence": 0.766,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist kein Witz.",
      "start": 2165885,
      "end": 2167249,
      "confidence": 0.86925,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, also ich habe viele Jahre auch, haben wir in der Ausbildung natural eingesetzt. Ich habe das auch während meiner Ausbildung gelernt. Es ist einfach eine Programmiersprache. Viele sagen ja so Legacy, okay. Also die Programmiersprache an sich ist gar nicht das Problem, sondern einfach diese alten Systeme sind das Problem. Ich meine, unser natural System hat irgendwie fünf Millionen Zeilen Code. Das steigt man einfach nicht durch. Übrigens auch ernst gemeint tatsächlich, das System kommt ursprünglich aus Spanien. Das heißt, die inneren Variablen haben alle spanische Namen. mal so eine kleine Hürde on top, um das System zu verstehen. Also die Sprache, ehrlich gesagt, da gibt es einen zwei Wochen Kurs, dann kann man die Sprache. Aber das ist halt eine 4GL-Sprache, super abstrakt und alles. Da gibt es nicht viele Konzepte, die ich lernen muss. Aber das System dahinter ist halt super komplex, weil da steckt natürlich die Fachlichkeit drin. Und das ist halt schwer zu vermitteln.",
      "start": 2168530,
      "end": 2214517,
      "confidence": 0.7431698113207549,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Gibt es da irgendwie Probleme schon, wenn man jetzt Azubis sucht, dass die sagen, oh mein Gott, natural, was soll denn das? Also in der Berufswelt habe ich schon oft erlebt, dass die Leute sagen, hey, ihr verwendet nur Java und nicht Kotlin. Bei euch will ich gar nicht arbeiten. Also gibt es das dann auf der Ebene auch schon oder sind die Leute so weit weg, dass sie noch gar keine Ahnung eigentlich so haben, auf was sie sich einlassen und irgendwann wird es dann Normalität?",
      "start": 2214537,
      "end": 2236507,
      "confidence": 0.6934367816091953,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Es kommt drauf an. Also Bewerbungen, ich persönlich habe schon welche bekommen von Leuten, die wirklich noch nie was programmiert haben. Denen hätte ich alles erzählen können, ja. Aber es gibt halt auch Leute, die hatten das teilweise fünf Jahre schon in der Schule. Die haben da schon drei verschiedene Programmiersprachen gelernt. PHP für Web und dann noch ein bisschen Java und so weiter. Die wissen natürlich schon, was Sache ist. Und die informieren sich dann auch drüber. Die gucken sich Udemy-Kurse an oder YouTube etc. Das heißt, sie wissen dann schon Bescheid und gucken auch, wenn ich jetzt hier anfange, kann ich mit der Sprache später mal was anfangen oder nicht. Also das kommt auch wieder ganz drauf an. Ehrlich gesagt, den meisten ist es wahrscheinlich erstmal egal. Hauptsache, die werden gut ausgebildet. Aber wenn ich jetzt so richtig, also was heißt gut, aber Leute mit Vorerfahrung habe, die fragen schon danach auf jeden Fall.",
      "start": 2236547,
      "end": 2275337,
      "confidence": 0.7638717948717951,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie schwer ist es allgemein, Leute zu bekommen? Also wird euch da die Tür eingerannt oder ist es mehr so anflehen, dass Leute überhaupt so eine Ausbildung beginnen?",
      "start": 2276257,
      "end": 2286164,
      "confidence": 0.7781071428571428,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Branchenweit würde ich auf jeden Fall sagen, Letzteres. In unserem konkreten Fall haben wir eher das Problem, dass wir zu viele Bewerbungen bekommen, allerdings ganz verstärkt in letzter Zeit aus dem Ausland. Das geht auch vielen anderen Unternehmen auch so. Einfach, weil sie zum Beispiel solche Probleme haben, wie Master wird nicht anerkannt oder dann bewerben die sich halt auf Eine Ausbildung fängt nochmal bei null an und so. Das ist der Großteil zumindest der Bewerbung, die wir bekommen. Aber insgesamt kann man auf jeden Fall sagen, Azubis sind genauso heiß umkämpft wie Fachkräfte. Die gibt es einfach nicht. Die jungen Leute, ja, die meisten ist ja inzwischen, glaube ich, seit letztem Jahr ist es so, dass definitiv mehr Leute studieren gehen als eine Ausbildung machen. Und das ist seit Jahren rückläufig leider insgesamt, die Anzahl der Auszubildenden neuen. Von daher ist das ein sehr, sehr heiß umkämpfter Markt. Und dann haben wir auch noch 300 verschiedene Berufe. Das ist ja nicht nur die IT, wo wir Auszubildende suchen. Das heißt, die haben ja auch noch eine Riesenauswahl. Und daraus folgt, wenn wir jetzt noch in Richtung dieser Gen Z gehen, Riesenauswahl. Kein Plan, was sie machen sollen. Das heißt, sie haben auch gar nicht so das Ziel vor Augen, was sie verfolgen, sondern wollen sich ein bisschen umgucken, sage ich mal. Wir haben zum Beispiel jetzt in den Sommerferien bei uns so einen Das heißt, die Praktikumswoche, da können Schüler an fünf Tagen jeweils ein Unternehmen und einen Beruf kennenlernen. Und da gibt es ganz viele, die sagen, ich habe wirklich gar keinen Plan, was ich machen will, zeig mir mal IT und morgen gucke ich mir dann das Tischler-Unternehmen an und übermorgen werde ich Bäcker. Und die wissen überhaupt nicht, was Sache ist. Und es gibt auf der anderen Seite natürlich auch immer Leute, die schon seit Jahren zu Hause ihren Gaming-PC aufgebaut haben und Makros für WoW programmiert haben. Und die gibt's auch. Aber da gibt's halt nicht so viele von. Und da gibt's dann noch entsprechende Unternehmen, die darum konkurrieren. Also, ich würde behaupten, einen sehr, sehr großen Teil meiner Arbeitszeit als Ausbilder stecke ich inzwischen ins Recruiting und ins Marketing für die Ausbildung. Weil wir sonst einfach echt Probleme haben, Leute zu finden.",
      "start": 2286204,
      "end": 2383258,
      "confidence": 0.7601719576719569,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist dazu schon die Ausbildungsbetriebe oder Unternehmen angesprochen? Welche Anforderungen muss denn so ein Ausbildungsbetrieb eigentlich mitbringen, damit man als Unternehmen eigentlich ausbilden kann? Also welche Hürde muss ich überwinden, damit ich billige Arbeitskräfte kriege?",
      "start": 2383398,
      "end": 2395538,
      "confidence": 0.8589428571428571,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, eine sehr niedrige Hürde, so viel kann ich schon mal sagen, leider. Nicht umsonst gibt es auch ein paar schwarze Schafe. Also im Prinzip ist die einzige Voraussetzung, man muss, so steht es im BBIG, persönlich und fachlich geeignet sein, jemanden auszubilden. Und fachlich kann man relativ einfach dadurch nachweisen, dass man zum Beispiel den gleichen Beruf auch erlernt hat. Und wenn man noch eine Schippe drauflegen will, noch den Ausbilderschein macht. die Ausbildung nach ADA, Ausbildung der Ausbilder, oder AEVO, Ausbildereignungsverordnung, das ist das gleiche, nur eine andere Abkürzung, das heißt, dann macht man noch eine kleine Prüfung, wo man auch tatsächlich eine echte Lehrprobe dann gibt, die, ich glaube, 15 Minuten lang ist, wo man dann so eine Art, ja, wie erklär ich es dem Azubi macht, und dann guckt sich das im Prüfungsausschuss an und sagt dann, du bist jetzt Ausbilder oder Ausbilderin, das ist auch gar nicht auf die IT bezogen, sondern ganz allgemein, also da sitzt dann auch in den Kursen sitzt der ITler wirklich neben dem Bäcker und dem Tischler, das ist halt einfach der ausbilder schein und wenn man den hat hat man quasi am fachlichen so ein bisschen den haken dran und das persönliche ist, wenn man fies ist sagt man einfach wenn ich jetzt noch keinen umgebracht habe oder noch keine kinder geschlagen habe dann darf ich persönlich ausbilden also es ist wirklich eine sehr geringe hürde da muss ich schon wirklich irgendwas, Ja, ich muss quasi eine Vorstrafe haben, damit ich es nicht darf, übertrieben.",
      "start": 2396337,
      "end": 2468172,
      "confidence": 0.7888476562500003,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber die Ausbildnerprüfung, die braucht man auf jeden Fall. Also die muss man machen oder ist die sehr optional?",
      "start": 2468232,
      "end": 2473014,
      "confidence": 0.3119473684210526,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das kommt auch wieder so ein bisschen auf den Beruf an. In der IT, ehrlich gesagt, kann ich es gerade nicht sagen. Ich würde behaupten, es gibt gar keine Pflicht mehr, den zu haben. In bestimmten Berufen muss mindestens eine Person im Unternehmen wohlgemerkt diesen Ausbilderschein haben. Das muss gar nicht die Person sein, die wirklich ausbildet. Die muss nur da arbeiten quasi. In der IT meine ich, dass vor einigen Jahren diese Ausbilderpflicht sogar ausgesetzt wurde, weil man sonst gar keine Betriebe mehr gefunden hat, die ausbilden. Es geht natürlich eher in die Berufe, wo ich halt wirklich missbauen kann, so keine Ahnung, wenn das Haus zusammenstürzt, weil ich falsch gemauert habe, ist halt nicht so gut, da brauche ich vielleicht einen richtigen Ausbilder. Aber wie gesagt, Es muss nur irgendwer im Unternehmen diesen Schein haben. Und dann darf das Unternehmen als Ganzes ausbilden. Weil das ist so ein bisschen aufgeteilt von den Fachbegriffen her. Einmal in den Ausbilder. Das ist dann der, der diesen Schein hat vielleicht. Und es gibt auch ganz viele Ausbildungsbeauftragte. Und das sind dann die Personen, die wirklich Hands-on neben dem Azubi sitzen und dem das tägliche Doing beibringen quasi. Und solange es einen Ausbilder gibt oder Ausbilderinnen, die diesen Schein haben, kann ich mit meinen Ausbildungsbeauftragten machen, was ich will und irgendwen ausbilden. Auch wenn ich den Azubi jetzt ehrlich gesagt drei Jahre lang gar nicht sehe.",
      "start": 2473054,
      "end": 2535482,
      "confidence": 0.763717948717949,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und bei euch in Deutschland gibt es ja grundsätzlich auch so bei Handwerkern Meister, oder?",
      "start": 2535837,
      "end": 2539341,
      "confidence": 0.8546666666666666,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, genau.",
      "start": 2539902,
      "end": 2540863,
      "confidence": 0.5615,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das gibt es aber in der Informatik demnach auch nicht. Bei uns gibt es das natürlich auch nicht, weil das wäre ja sonst Grundvoraussetzung. Du hast einen Meister, dass du überhaupt Lehrlinge haben kannst, oder? Schätze ich mal, bei anderen Handwerkerberufen.",
      "start": 2540903,
      "end": 2550795,
      "confidence": 0.6955365853658536,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, das kommt wohl daher, weil Teil der Meisterprüfung auch die IEVO-Ausbildung ist. Also man muss einen Ausbilderschein machen, wenn man Meister wird quasi. Und dadurch habe ich das halt quasi automatisch. Meister in dem klassischen Sinne gibt es in der IT jetzt nicht, aber es gibt Fortbildungsmöglichkeiten, die dann irgendwann auch auf Bachelor-Niveau quasi enden. Die heißen dann nur ein bisschen anders, aber das ist quasi vergleichbar mit dem Meister in der IT. Die heißen dann Operative Professionals zum Beispiel. Das ist dann auch nach der Ausbildung eine weiterführende Fortbildung mit der IHK, mit Abschlussprüfung etc. Das kann man vergleichen mit einem Meister im Handwerksbereich.",
      "start": 2551235,
      "end": 2584610,
      "confidence": 0.8054433962264149,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hast du kurz erwähnt, es wurde diese Voraussetzung für die Ausbildungsprüfung auch schon ausgesetzt, weil man sonst gar keine Betriebe gefunden hätte. Da habe ich jetzt rausgehört, dass es bei euch auch ein Problem ist, dass ganz wenig Betriebe das eigentlich überhaupt sich antun. Ich kenne immer die Ausrede oder das Argument, jetzt muss ich da extrem viel Zeit investieren in irgendwen, der ist die halbe Zeit in der Schule und nicht bei mir und dann ist er endlich fertig nach den paar Jahren und dann springt er irgendwie zur nächsten Firma. Und ist weg. Und ich habe extrem viel Zeit investiert und dann ist derjenige weg. Besteht das Problem demnach in Deutschland oder in deiner Umgebung auch?",
      "start": 2584650,
      "end": 2618173,
      "confidence": 0.8007310924369748,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, das Problem gibt es definitiv auch, sicherlich. Ich würde aber behaupten, dass es genauso auch Betriebe gibt, die das einfach ausnutzen. Ein Azubi ohne richtig viel Arbeit. auszubilden, der dann einfach die Zahl, also ich hab das wörtlich schon gehört, der Azubi muss sich ja auch irgendwann rentieren. So, der muss ja auch irgendwann sein Geld wieder reinholen, was ich da reingesteckt hab. Und das heißt dann so, ich bild den ein halbes Jahr aus und danach muss er auch arbeiten, so nach dem Motto, ne? Und Prüfungsvorbereitung, ja, das machst du mal am Wochenende, so, ne? Also gibt es alles solche Betriebe. Das ist nicht die Mehrzahl, sag ich gleich dazu, aber es gibt es alles. Und auf der anderen Seite gibt es sicherlich auch Unternehmen, die richtig, richtig gut ausbilden. Und dann ist das immer das Risiko, dass der Azubi am Ende sagt, ja, ich geh woanders hin. Klar. Aber ja gut, das kann ich auch haben, wenn ich jemanden fest einstelle und der hat sechs Monate Probezeit und muss sich einarbeiten, kann er nachher auch sagen, ich gehe wieder. Also von daher, das ist ein Risiko, das muss ich halt eingehen. Wenn ich aber eine sehr, sehr gute Ausbildung mache, dann ist die Chance auch sehr hoch, dass die Leute bleiben. Also nur als Beispiel, unser Unternehmen, bei uns sind alle Azubis, die ich ausgebildet habe, da geblieben. Also wir haben 100% Übernahmequote, wollte auch keiner weg. Aber das ist bei vielen anderen Unternehmen auch so. Die sehen ja auch, wenn man eine gute Ausbildung macht, dass man sich für sie interessiert, dass man Zeit investiert. Warum sollen die am Ende sagen, tschüss, ich geh da mal, danke für alles. Das hat ja auch viel mit persönlicher Bindung zu tun.",
      "start": 2618213,
      "end": 2685957,
      "confidence": 0.7424523809523813,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich hab mal gehört, dass große Unternehmen wirklich dreistellige, vierstellige Mitarbeiter anzahlen, die nicht ausbilden, dass sie dann irgendeine Strafzahlung oder so leisten müssen.",
      "start": 2686277,
      "end": 2696201,
      "confidence": 0.8297916666666668,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ist das korrekt? Das ist, soweit ich weiß, noch nicht gesetzt. Vor ein, zwei Monaten gab es eine Petition in Bremen, wo genau das jetzt durchgewinkt wurde. Das ist eine Ausbildungsabgabe. Wenn ich theoretisch in der Lage wäre, auszubilden, aber es nicht tue, dann muss ich tatsächlich etwas in so einen Topf zahlen. Und aus diesem Topf bekommen dann alle ausbildenden Unternehmen etwas zurück. Sodass, wenn ich ausbilde, da kann ich jetzt nicht sagen, mit Plus, Minus, Null rausgeht, das natürlich nicht, aber wenn ich nicht ausbilde, zahle ich drauf. War ganz blöd gesagt, ne? Und das finde ich persönlich sehr, sehr fragwürdig. Also das finde ich nicht gut, weil das führt meiner Meinung nach dazu, dass dann die Unternehmen sagen so, ja, dann bilde ich doch mal eben jemanden aus, um das nicht zahlen zu müssen. Und der läuft dann einfach drei Jahre da durch. Und wenn er die Prüfung nicht schafft, ja, das ist halt sein Problem. Also das finde ich nicht den richtigen Anreiz. Man müsste eigentlich eher gucken, dass die Ausbildung insgesamt einfach attraktiver wird und nicht die Leute zwingen, mit einer Geldzahlung Leute auszubilden. Also das ist einfach, ich finde das Quatsch.",
      "start": 2696241,
      "end": 2749622,
      "confidence": 0.7697563451776648,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber demnach würde es Sinn machen, mehr Firmen zu haben grundsätzlich, mehr Ausbildungsbetriebe. Also es sind eigentlich zu wenig aktuell.",
      "start": 2750017,
      "end": 2758084,
      "confidence": 0.83015,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Oh, ne, ne, ne. Bitte auch nicht falsch verstehen. Also die Zahlen sehen ganz anders aus. Also wir haben viel, viel mehr offene Stellen als potenzielle Azubis. Ich glaube, da ist eine Lücke zwischen von mehreren Zigtausend, die uns da eigentlich fehlen. Also es gibt genug Ausbildungsstellen. Es gibt nicht genug Azubis tatsächlich. So ist aktuell der Markt.",
      "start": 2758324,
      "end": 2774298,
      "confidence": 0.7512241379310344,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was würdest du denn sagen, welche Rolle spielt denn das Unternehmen selbst an der Ausbildung? Ich meine, die Berufsschule übernimmt eine ganze Menge. Je nach Modell, glaube ich, gibt es Blockunterricht irgendwie so drei Wochen oder so im Quartal oder vier Wochen im Quartal und dann gibt es dann irgendwie so ein oder zweimal, das andere Zeitmodell umfasst dann ein oder zwei Tage pro Woche oder irgendwie sowas, wenn ich das richtig in Erinnerung habe. Welchen Erfolg hat das Unternehmen denn an der ganzen Sache?",
      "start": 2774678,
      "end": 2798824,
      "confidence": 0.7528941176470587,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich glaube, einen sehr großen Anteil. Kurz zu dem Zeitmodell. Es gibt das Teilzeitmodell. Da hab ich, je nachdem, in welchem Ausbildungsjahr ich bin, ein oder zwei Tage die Woche an einem fixen Tag Berufsschulunterricht. Es gibt das Blockmodell, das nicht alle Berufsschulen anbieten können, aufgrund der Lehrersituation. Da hat man eine Woche Berufsschule, dann zwei Wochen im Betrieb. Das wechselt sich dann immer ab. Wir persönlich benutzen das Block-Modell, weil man sich einfach eine Woche auch fokussieren kann und nicht einen Tag hier, einen Tag wieder da und das ist alles. Aber das kann man Pro und Contra argumentieren, ist jetzt nicht das Thema. Ich glaube, einen ganz wichtigen und großen Teil tragen die Unternehmen dazu bei, weil ich hatte es gerade schon gesagt, die Berufsschule muss halt irgendwie alle abholen und es entsprechend auch kann einfach nicht so schnell Sachen vermitteln und sich auch nicht so schnell an neue Gegebenheiten anpassen auf dem Markt. Und da sind die Unternehmen gefragt. Das ist alles, was ich eigentlich für die Praxis brauche. Jetzt mal nur ein Beispiel. Ich habe vielleicht Python in der Berufsschule, aber dort wird mir nicht vermittelt, wie ich das Zeug jetzt in Git einchecke und irgendwo ein PR abnehme oder sowas. Das muss das Unternehmen machen, weil dafür ist gar nicht die Zeit in der Berufsschule. Und deswegen finde ich, der Großteil muss eigentlich im Unternehmen vermittelt werden, gerade für diese praktische Handlungsfähigkeit.",
      "start": 2798864,
      "end": 2866615,
      "confidence": 0.7927679324894514,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "In meiner Ausbildung, ich hab die Ausbildung in einer relativ kleinen Webagentur gemacht, mit, ich glaub, damals zehn oder zwölf Mitarbeitern. Wir hatten gar nicht große Abteilungen. Und ich hatte Leute in meiner Berufsschulklasse, die waren bei der Metro Cash & Carry, Großkonzern, weltweit aktiv. Und zu diesem Zeitpunkt war das so, dass der Metro-Konzern richtig, richtig, richtig viel Geld in die Azubis gesteckt hat. Die sind danach wirklich mit so einem kleinen Leitz-Ordner. Vollzertifikate rausgegangen ja SQL, Oracle, SAP, ABAP und Zertifikate im Wert von echt viel Geld. Und die sind natürlich auch während in der Ausbildung durch die ich sag mal Abteilungen geschleust worden, die haben dann den Einkauf gesehen und dann haben die das gesehen und dann haben die das gesehen und so weiter. Und damals, muss ich schon zugeben, war ich schon so ein bisschen neidisch. Heutzutage völlig unberechtigt, meines Erachtens nach. Weil ich glaub, wir wissen inzwischen alle, wie Zertifikate, was sie für einen Wert haben können oder halt auch nicht. Und ich würd sogar fast sagen, die Ausbildung in diesem kleinen Unternehmen hat mir menschlich auch viel mehr gebracht, weil ich war ja nicht nur Softwareentwickler, wie dann zum Beispiel bei der Metro, ich habe auch mit den kunden telefoniert ich habe auch schulungen gegeben ich habe auch angebote geschrieben und die final die rechnung und konzepte erstellt und so weiter ich sag mal ich will nicht sagen dass mit den für alles aber weil wir halt so wenig mitarbeiter waren mussten dann halt mal alle irgendwie alle machen und wie ist denn deine meinung dazu hast du auch schon mal so eine ähnliche story, gehört dass du sagst okay bei großkonzernen ist das eher so im klassischen sinne man geht durch die abteilung und bei kleinen firmen halt ja eher so wie ich das gerade beschrieben habe oder kann.",
      "start": 2867155,
      "end": 2966842,
      "confidence": 0.7818267973856208,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Man wieder nur sagen kommt darauf an also ich habe wir haben quasi schon alles mögliche gesehen tendenziell ist es schon so dass in großen konzernen ja auch nur die möglichkeit besteht überhaupt solche abteilung zu durchlaufen und ich hatte auch schon gesagt nach der neuordnung haben wir auch ganz viele kaufmännische anteile gerade in den ersten 18 monaten der Ausbildung. Da ist es sogar von Vorteil, wenn ich tatsächlich mal in den Einkauf, in den Vertrieb etc. gehe, weil diese Inhalte stehen ja auf dem Rahmenplan. Das ist sogar gut. Auf der anderen Seite ist natürlich die Frage, die Zeit, die ich da investiere, die fehlt natürlich für die Programmierung. Wie kriege ich dann den Kern meines Berufs noch entsprechend vermittelt? Und da sehe ich dann eher das Problem, Ich betreue auch dual Studierende, da ist es meist noch schlimmer, in Anführungszeichen, weil die meist nicht irgendwie fachinformatische Anwendungsentwicklung als Fokus haben, sondern Wirtschaftsinformatik, und da müssen die auch noch sowieso zur Hälfte Wirtschaft machen, und da kommt dann zum Beispiel der Technikanteil wirklich sehr, sehr, sehr, sehr kurz. Ja, hat halt alles Vor- und Nachteile. Ich meine, für den ersten Teil der Abschlussprüfung ist das sicherlich gut, wenn ich meine Rechnung geschrieben habe zum Beispiel, das hilft mir da wirklich. Aber für Teil 2, wo ich dann wirklich ein Projekt umsetzen muss, was programmieren muss, konzipieren muss etc., die Zeit fehlt mir dann vermutlich. Also ich würde sagen, so eine Dreijährige-Ausbildung, die geht schneller rum, als man glaubt. Man muss ja auch überlegen, es gibt ja auch noch Ferien, man hat auch noch Urlaub und Büroschulzeit etc. Da würde ich doch dann lieber in einer Abteilung sitzen, wo ich auch programmiere. Aber auf der anderen Seite haben wir auch ganz viele Prüflinge zum Beispiel, die gerade aus solchen großen Konzernen kommen, die dann zum Beispiel auch immer so in SAP was machen und so und die sind auch top ausgebildet. Auf der anderen Seite gibt es auch Großkonzerne, die bilden echt bescheuert aus. Also man kann das gar nicht an der Größe festmachen. Aus meiner Sicht hängt das immer an den Personen, die da in der Ausbildung aktiv sind, ob die das gut machen oder nicht. Groß oder klein ist auch, wie du auch schon sagtest, im Großkonzern bin ich halt vielleicht der x-te Azubi und im kleinen Unternehmen kennt mich jeder und ich darf alle verschiedenen Dinge tun. Das ist so ein bisschen auch persönliche Präferenz, glaube ich. Ich würde mich da auf jeden Fall als Azubi, also als angehender Azubi, in so einem Forschungsgespräch informieren. Wie wird hier ausgebildet? Was werde ich sehen in der Zeit? Und entweder gefällt mir das oder nicht, aber pauschal zu sagen, großes Unternehmen ist gut, kleines nicht oder umgekehrt, Das kommt wirklich komplett aufs Unternehmen an, ist ganz schwer.",
      "start": 2966862,
      "end": 3087536,
      "confidence": 0.7720874200426437,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wahrscheinlich auch einfach auf deine Präferenzen, was dir natürlich lieber ist. Ja, absolut.",
      "start": 3087576,
      "end": 3092317,
      "confidence": 0.7606428571428572,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Es gibt ja auch viele Softwareentwickler, die wirklich so Websites zum Beispiel bauen wollen. Und hier, cool, in WordPress habe ich da was zusammengeklickt und super. Das ist, wenn man da Bock drauf hat, super gut. Aber man muss halt immer gucken, dass man auch noch die Ausbildungsinhalte vermittelt bekommt, die halt für die Prüfung wichtig sind. Und da machen halt viele Unternehmen immer so Probleme, sag ich mal.",
      "start": 3092457,
      "end": 3109243,
      "confidence": 0.7097826086956521,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ich habe mir jetzt gerade mal die Zahlen rausgesucht von Auszubildenden in Deutschland und in den letzten zehn Jahren ist es so um 15 bis 20 Prozent rückläufig bei den Zahlen. Habe mir auch die österreichischen rausgesucht, typischer Faktor 10 zwischen Österreich und Deutschland, genau gleich. Das Ganze einfach zehnmal kleiner, aber genauso 15 bis 20 Prozent der Einbruch. Also es wird irgendwo weniger attraktiv, das Ganze, scheinbar. Oder es wählen zumindestens weniger Leute. Jetzt gibt es ja auch extrem viele Alternativen. Studium klarerweise, aber vielleicht einfach YouTube, Bootcamps, Podcasts. Du bist selbst Content Creator. Nimmst du dir jetzt selbst deine Azubis weg, dadurch du Content Creator bist im Internet?",
      "start": 3109903,
      "end": 3153837,
      "confidence": 0.8029363636363636,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ich würde behaupten, mein Content ist sehr spezifisch auf die Ausbildungsinhalte ausgelegt. Also ob sich das jetzt jemand in seiner privaten Zeit anhört, ich glaube eher nicht. Ich mache da jetzt ja keine Programmiertutorials, so wie schreibe ich meine erste Zeile Java, sondern ich fange ja direkt an mit, sag ich mal, Definitionen, die in der Prüfung abgefragt werden. Das interessiert Leute ja so nicht unbedingt, wenn sie nicht in der Ausbildung sind. Aber es ist natürlich Auch in der Ausbildung sehe ich es ja an meinen eigenen Azubis, die Quellen, die es dann im Internet gibt und selbstverständlich gehört auch Chat-GPT inzwischen dazu, die werden dann natürlich genutzt und wenn ich da Bock drauf habe auf die IT, muss ich jetzt nicht unbedingt eine Ausbildung machen, um Programmieren zu lernen. Je nachdem, wir hatten es gerade, wenn ich in so einem Unternehmen bin, wo ich erstmal im Einkauf sitze, da kann ich es mir besser bei YouTube angucken, wie man programmiert. Aber ja, der Nachteil, In Deutschland zumindest ist es ja immer noch so, dass wir sehr, zumindest viele Unternehmen, sehr viel Wert auf diese offiziellen Abschlüsse legen. Und die hat man natürlich mit so einer IHK-Ausbildung, weil die ist bundesweit einheitlich, die kennt man und da weiß man, was man hat quasi. Und das kann ich halt bei YouTube, ja, kann ich in den Lebenslauf schreiben. Aber es ist halt die Frage, was machen die Unternehmen, die mich damit einstellen wollen denn daraus? Und da würde ich jetzt behaupten, in Deutschland ist es dann eher schwieriger, irgendwie einen Job zu finden. Aber das ist meine persönliche Einschätzung.",
      "start": 3155352,
      "end": 3221968,
      "confidence": 0.7172081784386616,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich bin da auch großer Fan davon oder Fan geworden von dem Ganzen, weil ich war da eigentlich eher früher ein Gegner und ich habe mal in Holland gelebt für eine Zeit und da gibt es kein System bei Handwerkern zum Beispiel, da gibt es keine Meister, da gibt es keine Ausbildung. Da ist einfach jeder, der will, kann dir da dein Bad installieren und da merkst du halt dann im Nachhinein, wie praktisch das eigentlich gewesen wäre, wenn da irgendwo Meisterbetrieb oder so gestanden wäre. Also es kann durchaus auch ein Vorteil sein. Aber was würdest denn du sagen, was müsste man denn machen, um das Ganze attraktiver zu machen, also dass die Ausbildung attraktiver wird?",
      "start": 3222568,
      "end": 3254508,
      "confidence": 0.7916610169491524,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also ich glaube insgesamt ist die Ausbildung durchaus attraktiv, aber wie du auch schon sagtest, die Alternativen sind halt so zahlreich. Und wenn wir mal gucken, ich habe es gerade schon gesagt, viele Azubis haben inzwischen Abi und wenn man die mal fragt, was denen in der Schule erzählt wird, da sagen die Lehrer, ja du gehst studieren, du machst ja Abi, du willst ja wohl keine Ausbildung machen mit deinem Abitur, hallo. Also es gibt bei uns in der kleinen Stadt, in der ich wohne oder arbeite, Fechter, wir haben drei Gymnasien, ja historisch, das ist völlig überdimensioniert für die Einwohnerzahl, aber wir haben drei. Und in zwei davon, sag ich mal ganz blöd, da ist die Ausbildung gar kein Thema. Die haben keine Berufsorientierung oder sonst irgendwas. Die sagen einfach, ihr macht hier Abi, ihr geht danach studieren, Feierabend. Es gibt keine Ausbildung für euch. Und wenn die jetzt nicht zufällig irgendwo im Bekanntenkreis jemanden haben, der das mal gemacht hat, oder Papa hat selber eine Ausbildung gemacht oder so, dann ist das vorgezeichnet, dass man studieren geht. Und dann braucht man sich auch nicht informieren. Wenn das ganze Umfeld sagt, Leute, wir sind hier auf dem Gymnasium. Wir werden hier nicht für eine Ausbildung ausgebildet. Das können die von der Realschule machen, nach dem Motto. dann ist klar, dass die Leute nicht in die Ausbildung gehen. Wir haben auf der anderen Seite aber zum Beispiel auch einen großen Anteil von Studienabbrechern, die inzwischen in die Ausbildung gehen, weil sie nämlich kennengelernt haben, oh, so ein Informatikstudium an der Uni, das ist ja auch ganz viel Mathe, das wollte ich eigentlich gar nicht machen, ich wollte eigentlich programmieren, das lehre ich da gar nicht. Dann suche ich mir jetzt mal einen Ausbildungsberuf. Also das wird immer mehr, dass die Leute wieder zurückkommen und merken, das war doch nichts für mich und dann nochmal eine praktische Ausbildung gehen. Also es hängt ganz viel davon ab, auch was in der Schule vermittelt wird, sag ich mal. Und da ist auch an ganz vielen Schulen gibt es Programme. Ihr hattet ja selber auch sogar schon mal eine Episode darüber, wie bringen wir Kindern so IT näher und so weiter. Und das ist, glaube ich, ganz wichtig. Und das gilt auch nicht nur für die IT-Ausbildung, sondern für alle anderen Ausbildungsberufe auch. Da muss einfach mehr gemacht werden, Berufsorientierung in Schulen. Die Leute oder die Kinder oder Schüler wissen gar nicht, was sie machen können überhaupt. Und dann ist so ein bisschen Studium vorgezeichnet, weil das machen ja alle anderen auch.",
      "start": 3254948,
      "end": 3360262,
      "confidence": 0.7360233100233102,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt hast du erwähnt zuerst, dass es eigentlich schon weniger Stellen gibt, als was es überhaupt Azubis gibt, potenzielle, aber würde das dann eigentlich nicht auch irgendwo attraktiver wirken, wenn dann noch mehr Unternehmen nach Azubis suchen und vielleicht auch die großen Unternehmen, die mit einem guten Namen die vielleicht jetzt sagen, wir bekommen eh genug Studierende und dann nehmen wir die natürlich. Worum sollten wir jetzt die Zeit investieren, da noch eine Ausbildung zu machen? Wenn jetzt mehr Unternehmen suchen würden, würde das dann nicht schlussendlich das Ganze attraktivieren, weil dann kann ich auch die Chance oder dann sehe ich auch die Chance, da einen guten Arbeitsplatz zu bekommen bei einem sehr großen oder interessanten Unternehmen. Muss ja gar nicht groß sein, weil keine Ahnung, das kleine Startup, was irgendwas mit AI macht, die vielleicht jetzt auch Ausbildungen anbieten.",
      "start": 3360302,
      "end": 3406145,
      "confidence": 0.8367571428571428,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja also würde das ding auf jeden fall erst mal bekannter machen glaube ich das ist einfach gar nicht bei vielen zumindest abiturierten gar nicht auf den zettel dass es auch eine möglichkeit ist mit einer ausbildung. Karriere zu machen wenn das denn überhaupt das lebensziel sein sollte ja das ist eine ganz andere frage aber wenn ich das will kann ich auch mit einer ausbildung ja meine karriere starten, Also, in den letzten, ich sag jetzt mal, 10 Jahren haben unsere Azubis, die erstmal eine Ausbildung gemacht haben, alle danach noch studiert. Einfach, weil sie auch Bock hatten, weil sie auch noch ein bisschen was draufsetzen wollen. Das hätte jetzt aber, ehrlich gesagt, vom Gehalt nicht den riesigen Unterschied gemacht, ehrlich gesagt. Weil da gucken wir drauf, was können die Leute? Und da können die die Position ausfüllen. Ob da jetzt Bachelor oder Fachinformatiker steht, das ist mir am Ende auch egal. Von daher, in vielen Köpfen ist halt noch, studieren heißt viel Geld verdienen. Aber das ist gar nicht zwangsläufig so. Weil jetzt muss man auch mal überlegen, es gibt ja so schöne Berechnungen, wie viel verdiene ich im Laufe meines Lebens. Und so ein Auszubildender, wenn der anfängt, jetzt zumindest bei uns in der Versicherungsbranche, der kriegt im ersten Ausbildungsjahr fast 1200 Euro im Monat. Der kriegt alles bezahlt. Da muss der Student vielleicht erst mal drei Jahre irgendwo nebenbei noch jobben gehen. In der Zeit hat er nichts für die Rente angespart, das ist mal ganz blöd gesagt.",
      "start": 3406345,
      "end": 3470896,
      "confidence": 0.7430238095238093,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn du mit 16 oder so beginnst, dann musst du die ganzen Jahre erst mal aufholen, wenn du dann mit 28 erst arbeiten beginnst oder so.",
      "start": 3471496,
      "end": 3477998,
      "confidence": 0.6788076923076923,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, genau. Und jetzt schauen wir uns an, was an der Universität gelehrt wird. Ich habe auch schon ein paar Leute eingestellt, die nur Uni gemacht haben. Die kannst du jetzt auch in der Praxis nicht sofort an einen Code setzen, weil die haben dann zum Beispiel, das ist jetzt auch wieder nur anekdotisch, aber die haben auch noch nie gesehen, was Git zum Beispiel ist. Die können zwar super Datenstrukturen dir erklären, aber Programmieren ist ja auch wieder was anderes. Das heißt jetzt nicht, dass ich sie sofort einsetzen kann und dass sie sofort ihr Geld wieder reinbringen, im Gegenteil. Das wäre dann vielleicht eher bei den Fachinformatikern so. Also ich weiß nicht, ich würde es auf jeden Fall nicht am Geld festmachen oder an der Attributität. Je mehr Unternehmen natürlich suchen, desto prominenter wird es und vielleicht wird es für viele eine Alternative. Ja, das kann ich mir gut vorstellen.",
      "start": 3478158,
      "end": 3516940,
      "confidence": 0.6876315789473684,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Man könnte ja auch sagen, und das sagen ja auch viele, dass Informatik selbst nichts mit Programmieren zu tun hat.",
      "start": 3516980,
      "end": 3521565,
      "confidence": 0.6925000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das stimmt. Das sage ich tatsächlich auch meinen Azubis immer, dass sie nicht eine Programmiersprache lernen, sondern eigentlich lernen sollen, wie man Probleme löst. Und da ist tatsächlich auch die IHK-Prüfung so aufgebaut, dass man ja gar nicht in dem Sinne programmieren muss, sondern eigentlich Algorithmen formulieren muss und die Sprache auch völlig egal ist dafür. Das finde ich auch wichtig. Das sage ich auch schon unseren Praktikanten. Wenn die jetzt zum Beispiel mit der Java-Syntax mit den Klammern nach drei Wochen immer noch nicht klarkommen, ist nicht schlimm. Hauptsache, man kann im Kopf formulieren, was man eigentlich machen will. Das ist viel wichtiger bei der Berufsausbildung. Und die Sprache lernt man dann schon irgendwo.",
      "start": 3522310,
      "end": 3551125,
      "confidence": 0.7593275862068963,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist ja aber auch bei anderen Bereichen mit Netzwerken zum Beispiel. Du sollst wissen, wie Netzwerke funktionieren, IP-Adressen, aber du sollst nicht wissen, in was für einem Cisco-Untermenü du das möglichst schnell einstellen kannst, sondern die Grundlagen haben.",
      "start": 3551525,
      "end": 3563149,
      "confidence": 0.7569743589743592,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau.",
      "start": 3563189,
      "end": 3564830,
      "confidence": 0.786,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Jetzt ist es ja so, eine Ausbildung braucht zwei Jahre, zweieinhalb, drei Jahre. Und in der heutigen Zeit könnte man sagen, Zeitverschwendung, besonders wenn ich irgendwie Karriereambitionen habe, Ich mache ein Bootcamp, drei Monate. Wozu brauche ich dann noch eine Ausbildung? Weil auch nach einem guten Bootcamp, vielleicht setze ich mich dann nach abends nochmal hin, kriege ich bestimmt auch einen Job als App-Entwickler irgendwo.",
      "start": 3564850,
      "end": 3584784,
      "confidence": 0.7923384615384617,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, absolut. Da würde ich mir einfach die Frage stellen, was will ich denn in meinem Leben erreichen? Also wenn ich jetzt Bootcamp versus Ausbildung versus Studium vielleicht sehe. Ich lerne halt einfach in einem, es gibt eine gewisse Schnittmenge an Themen, die man da sicher lernt, zum Beispiel Programmieren, ja. Aber in der Ausbildung bin ich vielleicht eher im Unternehmen, sag ich mal, verdrahtet, vernetzt. Ich weiß, wie das Unternehmen tickt. Ich kenne halt diese Praxis. Ich habe auch schon mal mehr gesehen als nur meinen Code-Editor vielleicht. Und ich bin halt einfach seit drei Jahren da. Und wenn ich jetzt nach der Ausbildung da bleibe, dann bin ich da halt, wie ein fertiger Mitarbeiter kann, direkt einsteigen. Nach einem Bootcamp, ja, da lerne ich ganz sicher in drei Monaten nur oberflächlich, wie ich vielleicht in einer Sprache und einem Framework irgendwas entwickle, aber ich lerne sicherlich nicht in der Tiefe die Konzepte der Programmierung, die Paradigmen, wie ich eine vernünftige Datenbank gestalte, etc. Das kann in der kurzen Zeit einfach nicht vermittelt werden, das heißt, es muss einfach oberflächlich bleiben. Wenn ich damit zufrieden bin und ich will in so einem Webshop ein paar Frontend-Sachen machen, ist ja cool, dann reicht das vielleicht auch. Aber ich glaube dann nicht, dass ich dann mal eben ins Backend wechseln kann, weil das ist ja easy peasy. Das glaube ich nicht. Und wenn ich es nochmal mit dem Studium vergleiche, da lerne ich halt auch ganz andere Sachen. Da geht es natürlich nicht nur ums Programmieren, das ist völlig klar. Da lerne ich dann vielleicht eher, wie ich mir Sachen selber aneigne oder auch vielleicht Sachen kritisch zu hinterfragen oder eben auch mehr Theorie und Abstraktion. Und da gehe ich dann vielleicht beruflich später auch in eine andere Schiene. Ja, es kommt darauf an, was ich will. Wer jetzt am Ende dann der beste Programmierer von den dreien ist, Schwer zu sagen. Kommt halt auch immer so ein bisschen auf die persönliche Motivation an und ob man sich noch abends mal hinsetzt oder nur das anguckt, was man reingetrichtert bekommt. Also je nachdem, wo ich hin will, ich kann für alle drei Sachen, sag ich mal, ich kann nicht sagen, das ist per se schlecht. Wenn ich vorhabe, meinen Job zu wechseln, weil ich keinen Bock mehr habe, Tischler zu sein, mache ich drei Monate Bootcamp. Wenn ich dann einen guten Job kriege, ist ja super. Aber ich glaube nicht, dass ich dann eine Art Architektur, irgendwas aufziehen kann, weil mir da wahrscheinlich dann die Grundlagen fehlen werden. Das ist meine Vermutung.",
      "start": 3585104,
      "end": 3689124,
      "confidence": 0.7325522041763344,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Welche kritik hast du denn schon so erlebt oder wurde dir entgegengebracht bezüglich der ausbildung als fachinformatiker.",
      "start": 3689464,
      "end": 3697434,
      "confidence": 0.7662941176470588,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja ganz oft ist es wieder das vorurteil ist ja nur eine ausbildung man muss ja studiert haben wenn du was vernünftiges machen willst oder nur dann kannst du ja irgendwie programmieren oder führungskraft werden oder sonstiges. Also das finde ich zum Beispiel auch völlig banane, diese Geschichte. Jetzt bei uns im Unternehmen wird es auch immer mehr Konzern etc., wenn man Führungskraft werden will, muss man ab einer gewissen Ebene irgendwie studiert haben. Aber das hat ja eigentlich überhaupt nichts mit der Aufgabe zu tun. Das ist ja einfach nur eine andere Rolle. Und weil ich drei Jahre Informatik studiert habe, kann ich jetzt nicht besser Leute führen. Das ist bei einer Ausbildung genauso. Also ja, ist so ein bisschen studierte Versus die Ausgebildeten. aber ehrlich gesagt, jetzt bei uns im Unternehmen wird da gar kein Unterschied gemacht. Die verdienen sogar das Gleiche am Ende. Also, das ist in anderen Unternehmen wahrscheinlich eher in großen Unternehmen, beziehungsweise auch vielleicht in Behörden natürlich irgendwo ein Problem, weil man da ab einem gewissen Niveau ja wirklich nicht weiterkommt ohne Studium. Ja, und ansonsten ... Wenn man halt so die persönlichen Geschichten kennt, ich wurde aber hier gut ausgebildet oder da schlecht ausgebildet, natürlich immer die schwarzen Schafe bei Ausbundsunternehmen, die es immer gibt, dass man ja als Azubi eigentlich hauptsächlich Kaffee kocht und solche Dinge. Das gibt es leider auch heute noch, muss ich auch sagen. Die sehen wir dann auch manchmal in der Prüfung, leider. Und da kann man dann vielleicht sagen, wenn ich an der Uni studiere und es gibt da einen akkreditierten Studiengang, da weiß ich dann vielleicht wenigstens am Ende, da hat mal jemand anderes drüber geguckt. In so einem Unternehmen, da machen die Leute, was sie wollen. Da kommt auch niemand von der IHK und guckt mal nach, ob man gut ausbildet. Also, das passiert einfach nicht. Das heißt, ich kann drei Jahre lang mit den Leuten machen, was ich will. Und wenn die am Ende nicht ausgebildet sind, ja. Also, ganz ehrlich, dass ich mich als Azubi irgendwo beschwere über meine Unternehmen, das machen die wenigsten. Und dann können solche Unternehmen halt auch jahrelang einfach schrottig ausbilden und niemand tut was dagegen. Und wenn ich da mit solchen Leuten rede, ist klar, dass die sagen, Ausbildung ist scheiße, weil es wird ja nicht kontrolliert und so. Und das ist auch so. Aber ich sage mal so, die meisten Unternehmen bilden eigentlich ganz gut aus. Es sind immer nur so schwarze Schafe, wie gesagt.",
      "start": 3697454,
      "end": 3816765,
      "confidence": 0.8016985645933009,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wenn du jetzt ganz oben stehen würdest bei der IHK oder keine Ahnung wer das schlussendlich entscheidet im Ministerium oder sonst was, was würdest du ändern diesbezüglich? Irgendwie mehr Kontrollen oder hättest du da irgendwelche Vorschläge?",
      "start": 3816805,
      "end": 3827793,
      "confidence": 0.7850833333333335,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Also Kontrollen finde ich persönlich ja grundsätzlich nicht so toll, so will ich eigentlich auch nicht arbeiten. Aber ich glaube, in gewissem Umfang wäre das ganz gut, irgendwie mal nachzuweisen, dass man vernünftig ausbildet. Ich meine, über kurz oder langen Weg der Markt, das hoffentlich irgendwie regeln. Aber wir haben tatsächlich auch in der Prüfung wirklich Unternehmen, die seit Jahren einfach schlecht ausbilden. Da passiert einfach gar nichts. Und selbst wenn sich Azubis beschweren über das Unternehmen, Jetzt muss man überlegen, wo beschweren die sich denn dann? Bei der IHK, wo das Unternehmen Zahlen des Mitglieds ist. Ja, da kann man sich jetzt überlegen, wie viel da passiert. Ja, da kann natürlich mal so eine Ausbildungsbotschaft oder Berater heißen, die glaube ich mal, ruft dann mal beim Unternehmen an und sagt, jetzt bildet er mal vernünftig aus und sagen, ja, machen wir und dann melden sie sich wieder drei Jahre nicht. Also, da passiert einfach nichts. Also, da gibt, es gibt ganz wenig Handhabe, wenn halt schlecht ausgebildet wird. Und meistens sehen wir das dann erst in der Prüfung, Weil ehrlich gesagt, die Prüflinge selber, also die Azubis selber, können ja ganz oft gar nicht bewerten, ob sie überhaupt gut ausgebildet werden oder nicht, bis sie dann in der Prüfung sehen, oh, das hätte ich alles lernen müssen. Wie sollen die das wissen mit teilweise 16, 17 Jahren? Da wird ja keiner sagen und sagen, hier, das große Unternehmen mit 300 Leuten, hier bildet mich schlecht aus. Das wird ja niemand machen. Vor allem bezahlen die mir ja auch noch meine Ausbildungsvergütung, von der ich vielleicht meine Wohnung bezahlen muss. Also das ist eine ganz schlechte Position, in der Azubis da sind, muss man leider sagen. Und deswegen finde ich es, ja, dass man so eine gewisse Kontrolle vielleicht bräuchte.",
      "start": 3828124,
      "end": 3908478,
      "confidence": 0.7975933333333332,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber es ist dann mehr die Handhabe eigentlich, die fehlt, weil wenn du jetzt als Prüfer das eigentlich eh regelmäßig siehst, dann ist die Information ja eigentlich schon da, dass da irgendwo ein Mangel ist, sondern es geht dann mehr darum, was macht man, wenn man die Information bekommt und was hat man für eine Handhabe.",
      "start": 3909218,
      "end": 3923843,
      "confidence": 0.7871785714285712,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Genau, richtig. Also die IHK können den Unternehmen die Ausbildungserlaubnis erziehen, das geht. Es passiert einfach nur sehr, sehr selten, so wie ich das mitkriege. Wie gesagt, das Problem ist, die Unternehmen zahlen Beiträge an die IHK. Wieso sollen die die rausschmeißen? Das System ist halt einfach Banane. Da könnte man sicherlich ein bisschen mehr machen. Da sind die Azubis drauf angewiesen, die sprechen dann mal mit ihren Lehrern und Lehrerinnen. Dann kann man sich bei der IHK beschweren, das ist alles okay. Da kann man noch so was machen wie mitten in der Ausbildung das Unternehmen wechseln, wenn's gar nicht mehr geht. Das machen die wenigsten. Und dann haben sie halt am Ende irgendwie einen IHK-Abschluss mit, ja, knapper vier Bestanden und so. Da werden sie dann auf dem Jobmarkt es auch sehr, sehr schwer haben, irgendwo eine Anstellung zu bekommen. Und dann waren die drei Jahre wirklich in den Sand gesetzt, muss man leider sagen. Und ja, genau, da fehlt einfach die Handhabe, da irgendwie gegen vorzugehen.",
      "start": 3923883,
      "end": 3971507,
      "confidence": 0.788775147928994,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber vielleicht noch gerade als super kurzen Exkurs, weil ich ja doch sehr tief in der Uni drin war. Du hast dieselben Probleme an der Uni natürlich genauso. Wenn du schlechte Vortragende hast, da wird auch nichts passieren. Also da kannst du noch so schlechte Evaluierungen haben, da passiert im Normalfall nichts, weil da gibt es einfach andere Dinge, die zählen, Forschung und Co. Und es gibt auch schwarze Schafe, das kenne ich auch, sogar bis zu dem Doktor hinauf. Es gibt schwarze Schafe, die da durchgerutscht sind in irgendeiner Form. Und es fragt auch niemand nach, was hattest du für eine Note bei deinem Doktor. Fragt dir niemand nach, wenn da eine extrem schlechte Note drin stand. Hauptsache, du hast den Titel. Insofern, die schwarzen Schafe hast du überall und die Probleme gibt's wahrscheinlich auch überall. Soll jetzt nicht heißen, dass man nichts dagegen tun kann, aber die schwarzen Schafe hast du.",
      "start": 3971767,
      "end": 4015704,
      "confidence": 0.7978954248366014,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Da kann man jetzt von Glück vielleicht sagen, jetzt in den modernen Zeiten mit Social Media etc. Die Azubis reden ja auch untereinander auch in der Berufsschule. Die kriegen das auch schon nebenbei mit, ob sie ein gutes Unternehmen erwischt haben oder nicht. Das fängt allein schon bei der Ausbildungsvergütung an. Es gibt ja zum Beispiel nicht die eine Vergütung für die IT-Berufe, sondern die werden ganz oft einfach nach Tarif der jeweiligen Branche bezahlt, bei uns in der Versicherung zum Beispiel, das ist mit die höchste Vergütung in der Ausbildung überhaupt in Deutschland. Es gibt andere Branchen, die zahlen die Hälfte der Ausbildungsvergütung. So krass ist da der Unterschied. Und natürlich reden die auch darüber. Und da wird sich natürlich auch darüber ausgetauscht, wie wirst du auf die Prüfung vorbereitet? Ist überhaupt immer ein Ausbilder da? Hat irgendwer bei dir den Ausbilderschein? Hast du das alles schon mal gehört, was wir hier in der Schule gemacht haben? Die tauschen sich auch aus, und dann haben sie zumindest eine Chance, wenigstens zu erkennen, dass sie nicht gut ausgebildet werden. Und da muss ich nochmal einmal kurz was sagen, und zwar, es gibt ja das Berichtsheft, oder Ausbildungsnachweis heißt es ja, was man ja seit Tag 1 der Ausbildung immer schön pflegen muss, und da muss ich ehrlich sagen, das sage ich meiner Zubis auch immer, das ist jetzt die einzige Sache, die man in der Hand hat, um nachzuweisen, dass man schlecht ausgebildet wurde. Weil da schreibt man rein, was man so gelernt hat, und da muss auch der Ausbilder unterschreiben, dass das so ist. Und wenn da nur steht, Kaffee kochen, ausfegen, etc., dann kann ich damit irgendwo hingehen und sagen, hier steht es schwarz auf weiß, ich wurde schlecht ausgebildet. Aber wenn da, und das kenne ich leider auch, der Ausbilder quasi diktiert, was drin stehen soll, und der Azubi das dann abzeichnet, dann habe ich wirklich nichts mehr in der Hand, und dann habe ich einfach Pech gehabt.",
      "start": 4016144,
      "end": 4099350,
      "confidence": 0.7852356495468283,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Gibt's eigentlich bei euch irgendwie so Siegel oder so Zeug, dass man Top-Lehrbetrieb ist oder irgendwie ausgezeichneter Lehrbetrieb oder solche Dinge, die dann auch vielleicht die Auszubildenden fragen, wie war's denn eigentlich?",
      "start": 4100470,
      "end": 4112754,
      "confidence": 0.8119375000000002,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Das gibt es ja. Das wäre dann eher so, also nicht in Richtung Kontrolle, sondern das Gegenteil. Ich mache freiwillig, möchte ich mich als guten Ausbildungsbetrieb darstellen. Da gibt es verschiedene Sachen. Bei uns in Oldenburg gibt es eine niedersachsenweite Geschichte, wo mehrere IHK in ganz Niedersachsen mitmachen und das heißt Top-Ausbildung. Und das ist dann tatsächlich mal so, dass wirklich jemand ins Unternehmen geht, weil vielleicht habt ihr schon mal, es gibt glaube ich einmal im Jahr, gibt es die im Fokus oder so, Deutschlands beste Ausbilder, ja. Da habe ich jetzt seit drei Jahren glaube ich jedes Mal mitgemacht und das ist einfach so ein Online-Fragebuch, die ich selber durchklicke und da kann ich sagen, alles top und am Ende bin ich Platz 1 bei Fokus, so. Da habe ich einfach nichts von. Das prüft auch keiner. Im Gegenteil, ich darf ja hier alles sagen, oder? Wenn man das ausgefüllt hat, kommt direkt danach der Anruf. Wollen Sie das Siegel kaufen? 10.000 Euro, so, ja? Also, das ist komplett Banane. Aber diese Siegel, über die ich ja jetzt rede, da kommen wirklich auch Leute aus der IHK ins Unternehmen, führen Interviews bei uns mit den Azubis, mit dem Ausführungsbeauftragten, mit dem Ausführungsbeauftragten, mit dem Vorstand sogar, ja? Um auszuprüfen, ist das Unternehmen wirklich darauf ausgelegt, langfristig auszubilden? Sollten die Leute durchgeschleift werden, et cetera? Und auch im Vier-Augen-Gespräch mit den Azubis fragen die danach, ist das eigentlich alles wirklich so, wie die Leute das da erzählt haben? Und dann kriegt man am Ende auch so ein Siegel da. Das haben wir auch gemacht. Da steckt auch wirklich Arbeit drin. Da waren auch wirklich mehrere Interviews und das hatte es schon in sich.",
      "start": 4113413,
      "end": 4190782,
      "confidence": 0.7617711267605637,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber bei den Siegeln muss man ja sagen, von außen ist es sehr, sehr schwer zu erkennen, ob das jetzt so ein fokusgekauftes Siegel ist oder Trusted Jobs ist, glaube ich, ein ähnliches Konzept. Oder ob da jetzt wirklich hier mit Interviews, Vorstand, Überprüfung und Co. Also von außen kann ich das ja nicht erkennen, besonders wenn ich irgendwie 19, 20 bin und mir überlege, eine Ausbildung zu machen.",
      "start": 4190841,
      "end": 4210768,
      "confidence": 0.8018985507246378,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nein, keine Chance, genau. Also das Ding machen wir auch nicht für die Azubis, die gucken da auch gar nicht drauf, können das auch gar nicht bewerten. Das ist dann so ein Ding, das machen wir einmal für uns, um auch selber nochmal von extern bestätigt zu bekommen, dass wir das Video richtig machen. Das ist für uns ja auch wichtig, weil wir ja auch viel Wert auf die Ausbildung legen. Und man darf aber auch eine Sache nicht vergessen bei der Ausbildung, das ist auch, sind die Eltern eine wichtige Zielgruppe? Ja, weil wir hatten schon gehört, junge Menschen wissen teilweise gar nicht so genau, was sie machen sollen. Und wenn dann Mama, Papa sagt, hier, guck dir doch mal das Unternehmen da an, ist das schon mal viel wert. Deswegen schalten wir auch Anzeigen bei Facebook, ja, aber nicht für die Schüler, sondern für die Eltern. Und wenn die dann sehen, oh, top Ausbildung hier, IHK, habe ich doch letztens noch in der Tageszeitung hier gelesen, was das ist. Das ist dann schon wieder eine andere Sache. Und die muss man auch im Blick haben. Und dafür, unter anderem, machen wir das dann auch.",
      "start": 4211228,
      "end": 4253357,
      "confidence": 0.7483265306122449,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Nochmal eine ganz kurze Sache zur IHK. Du bist IHK-Prüfer und du kriegst dafür kein Geld. Das ist Ehrenamt, oder?",
      "start": 4253617,
      "end": 4261725,
      "confidence": 0.793,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das ist alles ehrenamtlich, ja, genau. Also das ist vielleicht auch, kann man jetzt auch mal überlegen, die gesamte Berufsausbildung in Deutschland basiert komplett auf dem Ehrenamt. Das heißt, wenn alle sagen würden, Leute, ich gucke lieber Netflix, dann gibt es halt keine Berufsausbildung mehr. Also das ist schon krass. Ich habe ja schon gesagt, IHK, das ist eher so das ausführende Organ. Die machen die ganze Verwaltung, achten auf die Fristen, schicken die Zeugnisse zu etc. pp. Aber die prüfen nicht selbst. Können sie auch gar nicht bei 300 verschiedenen Berufen. Das heißt, die Prüfungsausschüsse, da sitzen ausschließlich ehrenamtliche Leute drin. Wie gesagt, Arbeitgebervertreter, also irgendwas in Richtung Führungsverantwortung oder Inhabe von Unternehmen oder sowas. Arbeitnehmervertreter, so wie ich, die halt einfach angestellt sind und dann halt in einem Unternehmen arbeiten und immer mindestens ein Lehrer oder eine Lehrerin, das muss also paritätisch besetzt sein und die kriegen alle dafür kein Geld, sondern machen das freiwillig, ja. Gut, kein Geld ist jetzt nicht ganz richtig, wir kriegen eine Aufwandsentschädigung, also wir kriegen zumindest das Spritgeld erstattet, weil ich zum Beispiel muss auch nach Oldenburg hin und zurück fahren für eine Prüfung, das sind auch 60 Kilometer. Das heißt, wir kriegen, wir werden dafür nicht bezahlt, aber es gibt eine Aufwandsentschädigung. Wir müssen zum Beispiel, wenn wir diese Projektdokumentationen für die Abschlussprüfung lesen, das sind manchmal 50 Seiten, wenn man sich die ausdruckt zum Beispiel, das kriegt man erstattet und so weiter, aber wir werden dafür nicht bezahlt, nein.",
      "start": 4261745,
      "end": 4331530,
      "confidence": 0.7786345381526101,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber die LehrerInnen natürlich schon, oder?",
      "start": 4331990,
      "end": 4334611,
      "confidence": 0.38850000000000007,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Von der Seite. Wenn sie ganz viel Glück haben, werden sie irgendwie stundentechnisch ein bisschen entlastet, aber die, die ich kenne, machen das einfach zusätzlich.",
      "start": 4334651,
      "end": 4341032,
      "confidence": 0.7654000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, wow.",
      "start": 4341112,
      "end": 4342613,
      "confidence": 0.573,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Und somit werden diese Pflichtabgaben, die deutsche Unternehmen führen müssen, weil deutsche Unternehmen sind automatisch verpflichtet, eine Gebühr an die IHK abzudrücken, so flichweise. Die gehen dann in diesen organisatorischen Wasserkopf mit Zeugnisse raussenden und Spritgeld und allem drum und dran, oder?",
      "start": 4342713,
      "end": 4358997,
      "confidence": 0.7755714285714286,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja und was die IHK halt alles noch so für die Wirtschaft tut, das weiß ich jetzt nicht, ich kann das nur für den Bereich Ausbau besprechen, aber da müssen, ja klar, das muss man überlegen, wir haben ja mehrere zigtausend Prüflinge in x verschiedenen Berufen jedes Jahr, das ist ein riesen organisatorischer Aufwand natürlich. Und das muss verwaltet werden, das geht nicht anders. Aber die eigentliche Prüfung selbst, da ist wirklich nur der Prüfungsausschuss für verantwortlich. Das heißt, die IHK kann auch nicht sagen, hier, die Note stimmt nicht oder sonst irgendwas. Das ist komplett in der Hoheit des Ausschusses, weil nur die überhaupt die fachliche Expertise haben, das zu bewerten. Deswegen, wenn ich jetzt zum Beispiel als Prüfling eine schlechte Note habe und ich will den Prüfungsausschuss verklagen, dann kann ich das vom Verwaltungsgericht tun und dann kann das sagen, Der Prüfungsablauf war nicht ganz korrekt, weil ihr habt nur 14 Minuten geprüft und nicht 15. Aber der kann nicht sagen, hier, die Antwort auf Objektnotierung hat er aber richtig gegeben. So, das können die gar nicht bewerten. Das heißt, es geht da wirklich ausschließlich um den Verwaltungsakt an sich. Und inhaltlich ist der Prüfungsausschuss komplett autark und bestimmt über die Note.",
      "start": 4359500,
      "end": 4418510,
      "confidence": 0.8109656862745095,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Gibt's während der Prüfung denn wenigstens Schnittchen?",
      "start": 4419288,
      "end": 4422470,
      "confidence": 0.8735714285714286,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, es gibt sogar Brötchen, teilweise sogar mit Ei. Ja, sehr gut. Und was zu trinken kriegen wir auch.",
      "start": 4422510,
      "end": 4427894,
      "confidence": 0.7597368421052632,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da wenigstens etwas. Und vielen Dank, dass du das Ehrenamt ausübst. Finde ich sehr, sehr gut.",
      "start": 4427994,
      "end": 4436459,
      "confidence": 0.7764375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, vielen Dank dafür. Jetzt haben wir ja schon besprochen, wie die zum Ausbildungsbetrieb werden. Hättest du noch irgendwelche Tipps für Azubis oder Leute, die eine Ausbildung machen wollen?",
      "start": 4437420,
      "end": 4448467,
      "confidence": 0.8601379310344828,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ja, Tipp, auf jeden Fall, aus meiner Erfahrung heraus, jetzt das Unternehmen auch vernünftig angucken. Und wir haben es an den Zahlen auch schon gesehen, wir haben definitiv einen BewerberInnenmarkt. Das heißt, als Azubi kann ich mir heute die Stellen aussuchen. Es gibt eine schöne, es gibt viele Statistiken zur Ausbildung, aber von Ausbildung.de zum Beispiel, der größten Plattform in Deutschland, gibt es immer jedes Jahr einen schönen Report. Und da ist es so, inzwischen schreiben die meisten Azubis ein, zwei Bewerbungen und bekommen aber auch ein, zwei Zusagen dann. Ich kann mir das einfach aussuchen, wo ich hin will. Und diese Chance sollte ich auch nutzen und mich auch informieren im Vorstellungsgespräch oder vorab auf der Website, wo auch immer, wie so eine Ausbildung abläuft. Weil, wie gesagt, die Qualität ist sehr, sehr unterschiedlich, je nachdem, in welchem Unternehmen ich bin. Und teilweise sogar, wenn ich in einem Unternehmen bin, in welcher Abteilung ich bin. Zum Beispiel große Konzerne bilden Fachinformatiker zum Beispiel im SAP-Bereich aus, aber auch im Java-Bereich. Teilweise Welten, die dazwischen liegen von der Qualität her auch. Also unbedingt erzählen lassen, wer bildet mich hier eigentlich aus? Wie läuft das ab? Wie werde ich betreut? Wie sieht mein Arbeitsalltag aus? Wie werde ich unterstützt? Auch gerade bei der Prüfungsvorbereitung hatte ich schon gesagt, das ist so viel Zeug, was man da lernen muss. Darf ich das zum Beispiel während der Arbeitszeit lernen oder muss ich das alles zu Hause lernen? Das ist schon eine wichtige Sache. Und dass man einfach irgendwie versucht zu prüfen. Ich weiß, das ist schwierig, wenn ich 17, 18 bin, aber werde ich hier auch vernünftig ausgebildet? Und bitte nicht als Bittsteller da auftreten, sondern es ist einfach so, die Unternehmen sind die Bittsteller. Das wird man auch an den Stellenanzeigen inzwischen sehen, so kommt zu uns. Also ich meine, ich bin hier auf dem Land und wir haben hier einen Ort weiter, eine Firma, die holt ihre Azubis morgens mit dem Bus von zu Hause ab und bringt die zur Arbeit und bringt die abends wieder nach Hause, weil die sonst nicht zur Arbeit kommen. Und das dreht sich komplett gerade. Und ich kann mir mein Unternehmen selber aussuchen, muss dann aber entsprechend auch mal ein bisschen prüfen, ob das denn richtig ist. Und ich würde auf jeden Fall noch den Tipp geben, es ist kein Verlust, eine Ausbildung zu machen, auch wenn ich Abitur habe. Die Ausbildung, und das gilt für viele Berufe, nicht nur für die IT, ist inzwischen sehr, sehr anspruchsvoll. Die ist sehr nah am Puls der Zeit, sage ich mal. Ich komme in ein Unternehmen rein. Ich habe nach den dreien Ausbildungen, habe dort Kontakte geknüpft. Ich habe quasi einen festen Arbeitsplatz, wenn ich will, ja, in den meisten Unternehmen zumindest. Und ich kriege, das darf man auch nicht vergessen, die ganze Zeit Geld dafür auch noch, dass ich ausgebildet werde. Das ist eigentlich schon Luxus, würde ich mal sagen. Ich glaube, es ist eine gute Wahl. Und selbst wenn ich erst mal mit der Ausbildung anfange und danach noch studiere, man kann das inzwischen berufsbegleitend machen, man kann dual studieren, da haben wir noch gar nicht drüber geredet. Also wenn ich zum Beispiel gerade Abi mache und ich will irgendwie beides, dann mache ich einfach ein duales Studium. Da mache ich halt irgendwie in dreieinhalb Jahren meinen Bachelor und parallel noch die IHK-Ausbildung im Unternehmen und kriege ich währenddessen die ganze Zeit Geld. Also was Besseres gibt es eigentlich nicht. Das habe ich übrigens auch gemacht. Also das ist eine Top-Geschichte. Ich muss nicht Ausbildung als etwas Minderwertiges sehen. Es ist im Gegenteil sehr, sehr anspruchsvoll. Und wenn ich keinen Bock habe, nur Theorie zu lernen in der Uni zum Beispiel, ich sage nicht, dass es immer so ist, aber dann sollte ich vielleicht eine Ausbildung machen.",
      "start": 4448887,
      "end": 4622148,
      "confidence": 0.7708271028037383,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Die Story mit dem Bus erinnert mich an das Silicon Valley. Im Silicon Valley wohnen sehr viele Leute in San Francisco und Google und Facebook und so weiter haben Shuttlebusse, die von San Francisco dann ins Valley fahren, weil das sind ein paar Kilometer. Also anscheinend ist bei euch im Niedersachsen das Silicon Valley von Deutschland. Anders kann ich mir das einfach nicht erklären mit dem Bus. Stefan vielen lieben dank ich glaube wir haben relativ umfangreichen podcast über ausbildungen fachinformatiker ausbildungen wow also ich habe eine ausbildung als fachinformatiker gemacht und ich muss zugeben ich habe hier heute eine ganze menge gelernt. Für alle Leute, die sich noch weiter informieren wollen, wir verlinken in den Shownotes eine ganze Menge Ressourcen von Stefan, unter anderem auch den IT-Berufe-Podcast, weil der Stefan ist selbst Podcaster und redet eigentlich so wie wir hier im Engineering-Kiosk auch ins Mikro, aber dann komplett mit dem Fokus Fachinformatiker-Ausbildung, Abschlussprüfung und natürlich auch Definitionen, was dann prüfungsrelevant ist. Also wer da weiter einsteigen möchte, wer immer noch nicht sicher ist, mache ich eine Ausbildung oder wer vielleicht auch als Ausbilder irgendwie auftreten möchte oder vielleicht sogar auch das Ehrenamt des IHK Prüfers ausüben möchte. Ich glaube, Stefan ist auch bereit, hier und da mal Rede und Antwort zu stehen, um mehr Leute für dieses Ehrenamt zu begeistern. Stefan, vielen lieben Dank aus meinem Podcaststudio aus Duisburg ab in den hohen Norden nach Niedersachsen. Vielen Dank für deine Zeit und ja, mir hat es Spaß gemacht.",
      "start": 4622608,
      "end": 4721821,
      "confidence": 0.8226666666666675,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, vielen, vielen Dank.",
      "start": 4722301,
      "end": 4723602,
      "confidence": 0.5415,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Ich sage auch vielen Dank, dass ich da sein durfte und vielleicht ein paar Leute für die Ausbildung auch mal begeistern durfte. Das ist mein Anliegen.",
      "start": 4723642,
      "end": 4728766,
      "confidence": 0.6730384615384615,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das hoffen wir doch.",
      "start": 4728786,
      "end": 4730267,
      "confidence": 0.8667499999999999,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Dann würden wir immer sagen bis nächste Woche. Tschüss.",
      "start": 4730307,
      "end": 4733249,
      "confidence": 0.8426666666666667,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Tschüss.",
      "start": 4733269,
      "end": 4733610,
      "confidence": 0.211,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ciao.",
      "start": 4733890,
      "end": 4736972,
      "confidence": 0.431,
      "channel": null,
      "speaker": "C"
    },
    {
      "text": "Und nicht vergessen, wenn du einen alternativen Ausbildungsweg in die Softwareentwicklung suchst, schau bei unserem Episodensponsor coding-bootcamps.eu vorbei. Link in den Show Notes.",
      "start": 4737012,
      "end": 4747100,
      "confidence": 0.8044347826086957,
      "channel": null,
      "speaker": "B"
    }
  ],
  "confidence": 0.7737925433739384,
  "audio_duration": 4747.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
