{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/b7e59af5-cd61-4f6c-97d8-9baab461a562/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 4,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": true,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "6acq3jpynl-ade8-4ef6-98ba-aa1d9b41406c",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "Seit einer gefühlten Ewigkeit sprechen wir von einem Fachkräftemangel. Um diesen Mangel einigermaßen auszugleichen, arbeiten viele Unternehmen regelmäßig mit Freelancern zusammen. Ab und zu als Berater, ab und zu als Erweiterung des eigenen Teams. Auf den ersten Blick klingt dies recht verlockend. Man selbst arbeitet an unterschiedlichen Projekten, stellt jede Stunde in Rechnung, ist sein eigenes Unternehmen, ist zeitlich flexibel und macht Urlaub wann man will. Doch ist das wirklich so? In dieser Episode sprechen wir über das Thema mit gleich drei Freelancern. Ich, Andi, als einziger Angestellter interview Wolfgang sowie Thomas Diroll und Christian Braun vom Index Out of Bounds Podcast. Was ist Ihre Motivation zum Freelancing? Verdienen Sie wirklich so viel? Wie sieht es aus, wenn es mal schlecht läuft? Wie sieht es mit der eigenen Weiterbildung aus? Und wie gut sind eigentlich Engineers im Sales? All das und noch viel mehr. Los geht's! Heute haben wir eine etwas andere Folge. Und zwar sind wir nicht zu zweit, wir sind nicht zu dritt, sondern wir sind heute zu viert in diesem Aufnahmestudio für diesen Podcast.",
            "start": 4208,
            "end": 68440,
            "confidence": 0.8425367231638416,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist eine Premiere, glaube ich. Waren wir noch nie.",
            "start": 68460,
            "end": 70962,
            "confidence": 0.7762222222222223,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, und das wird mit hoher Wahrscheinlichkeit sehr chaotisch, beziehungsweise eine sehr große Herausforderung, die ganze Sache zu managen. Und zwar haben wir heute die grandiosen Podcast-Hosts vom Index Out of Bound Podcast bei uns. von dem Wolfgang und ich große Fans sind.",
            "start": 71002,
            "end": 86833,
            "confidence": 0.7411162790697674,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hallo, Index out of bounds. Da ist ein S hinten dran. Index out of bounds.",
            "start": 86853,
            "end": 91595,
            "confidence": 0.6122666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Schwierig.",
            "start": 91615,
            "end": 92335,
            "confidence": 0.817,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Index out of bounds.",
            "start": 92375,
            "end": 94096,
            "confidence": 0.7945000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Mi, mi, mi, ja. Der Christian Braun und der Thomas Sirol, die können das verstehen, wenn man sich verspricht, weil die wissen nämlich, wie kompliziert Postcasting ist. Deswegen willkommen Christian, willkommen Thomas.",
            "start": 94136,
            "end": 105400,
            "confidence": 0.8171874999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, sehr schön hier zu sein. Vielen Dank.",
            "start": 105646,
            "end": 107947,
            "confidence": 0.29862500000000003,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Gleichfalls. Vielen Dank für die Möglichkeit, mit euch zusammen eine Folge aufzunehmen.",
            "start": 107967,
            "end": 112408,
            "confidence": 0.6124999999999999,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Und warum haben wir die beiden heute hier? Und zwar geht es um ein spezielles Thema, was ich mit einem doch einigermaßen schlechten Witz einleiten möchte. Und zwar, ein Unternehmensberater kommt völlig abgehetzt zum Flughafen an. Er springt sofort ins nächste Taxi, packt seinen Laptop aus und ruft gleichzeitig über das Handy die Wirtschaftsnachrichten ab. Der Taxifahrer fragt, wohin soll es denn gehen? Der Unternehmensberater sagt, egal, ich werde überall.",
            "start": 112468,
            "end": 135313,
            "confidence": 0.7341999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehr schlecht.",
            "start": 137354,
            "end": 137774,
            "confidence": 0.7484999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Den kenne ich noch gar nicht.",
            "start": 137794,
            "end": 140015,
            "confidence": 0.34,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe gedacht, da kommt noch was.",
            "start": 140055,
            "end": 141716,
            "confidence": 0.6338571428571428,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist schon die Pointe.",
            "start": 141756,
            "end": 145658,
            "confidence": 0.40440000000000004,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Oder auch schön.",
            "start": 145718,
            "end": 146959,
            "confidence": 0.875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das Glas ist halb leer, sagt der Pessimist. Das Glas ist halb voll, sagt der Optimist. Das Glas ist viel zu groß, sagt der Unternehmensverrater. Und zwar sprechen wir nicht über Unternehmensberatungen, ja doch irgendwie schon. Und zwar sprechen wir heute mal über Freelancing. Denn ich bin der Außenseiter in dieser Runde. Ich bin in einem festen Angestelltenverhältnis und meine drei Gäste, der Christian, der Thomas und der Wolfgang, das sind nämlich alles Freelancer bzw. selbstständig. Und wo jetzt der Unterschied ist, klären wir auch noch in dieser Folge. Aber da machen wir heute mal einfach eine lustige Fragerunde und stellen nicht nur die Fragen, wie toll ist denn Freelancing, sondern auch mal die kritischen Fragen. Lohnt sich die ganze Sache finanziell eigentlich? Werdet ihr bald reich und geht mit 30 in Rente? Oder wie wird das hier eigentlich aussehen?",
            "start": 146999,
            "end": 200261,
            "confidence": 0.8490357142857139,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin schon 30.",
            "start": 200301,
            "end": 200912,
            "confidence": 0.6877500000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich auch schon.",
            "start": 200922,
            "end": 203804,
            "confidence": 0.515,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Du nimmst schon alles vorweg.",
            "start": 203824,
            "end": 205146,
            "confidence": 0.438,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir haben alles falsch gemacht.",
            "start": 205166,
            "end": 206627,
            "confidence": 0.5212,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Okay, dann würde ich was sagen. Ziel verfehlt, Jungs.",
            "start": 207608,
            "end": 212793,
            "confidence": 0.8476666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Naja, fangen wir an mit einer kleinen Vorstellung. Und zwar würde ich euch bitten, dass ihr euch einmal kurz vorstellt, und zwar mit Attributen, wie lange ihr zum Beispiel schon selbstständig seid, beziehungsweise im Freelancing-Business, worauf ihr euch spezialisiert. Programmiersprache oder ähnliches. Welche Arten ihr eigentlich macht? Also habt ihr eigene Software-as-a-Services? Macht ihr Consultant-Beratung? Seid ihr selbst Hands-on in Projekten? Oder, oder, oder. Und da würde ich ganz einfach mal mit dem Christian starten.",
            "start": 212833,
            "end": 242210,
            "confidence": 0.7993733333333336,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, vielen Dank für diese Einführung. Also ich bin iOS-Entwickler, jetzt auch schon seit sieben Jahren und ich liebe es noch immer wie am ersten Tag. Ich denke, das liegt daran, dass ich gestartet habe, als Objective-C abgelöst wurde von Swift und war eigentlich in diesen sieben Jahren immer festangestellt. Aber letztes Jahr habe ich eine eigene Firma gegründet, die eine Bildbearbeitungs-App rausbringt. Und seit diesem Jahr März arbeite ich auch als Freelancer. In einem großen Projekt, der Titel ist irgendwie Lead IOS Transition Manager. Klingt total fancy. Im Endeffekt bedeutet das, dass ich irgendwie 40 bis 60 Stunden die Woche 40% meiner Zeit in Calls sitze und 60% tatsächlich am Code arbeiten darf. Ja, so viel zu mir.",
            "start": 242791,
            "end": 282606,
            "confidence": 0.8206218487394954,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wolfgang, mach du doch einfach mal direkt weiter, bitte.",
            "start": 283407,
            "end": 285728,
            "confidence": 0.405,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich habe nur gerade nachgerechnet, wie lange ich schon selbstständig bin. Also ich bin, glaube ich, das erste Mal selbstständig geworden, als ich 18 war oder vielleicht sogar mit 17. Bin mir gar nicht mehr genau sicher. Also über 20 Jahre jetzt und war auch immer selbstständig. Ich war zwar in Anstellungsverhältnissen zwischendurch, aber war parallel auch immer noch selbstständig. Die Firma ist immer weitergelaufen. Das heißt, über 20 Jahre jetzt und mittlerweile wieder hauptberuflich selbstständig und kein Anstellungsverhältnis.",
            "start": 285768,
            "end": 313374,
            "confidence": 0.7668101265822785,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich musste gerade irgendwie hart lachen wegen diesem mit 30 in Rente gehen und.",
            "start": 313954,
            "end": 317155,
            "confidence": 0.7315000000000002,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Dann kommt der Wolfgang, ich bin schon.",
            "start": 317175,
            "end": 318395,
            "confidence": 0.6794285714285714,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "20 Jahre und dann dachte ich so, Kinderarbeit ist doch verboten.",
            "start": 318405,
            "end": 324657,
            "confidence": 0.6032727272727273,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wir haben noch gar nicht gehört, was Wolfgang macht, auf was er sich spezialisiert hat.",
            "start": 324677,
            "end": 329138,
            "confidence": 0.6645333333333332,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ja, spezialisieren ist schwierig, aber mittlerweile eigentlich vor allem in der Skalierung und zwar in der Skalierung von Architektur und Skalierung von Teams. Und meistens hängt es auch sehr zusammen, das Ganze, weil du kannst die eine Seite nicht ohne die andere skalieren. Nur die Code-Seite bringt meistens viele Probleme auf der menschlichen Seite.",
            "start": 329158,
            "end": 347602,
            "confidence": 0.8382037037037039,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Thomas, wie sieht es bei dir aus? 2014 war ich das allererste Mal Freelancer. Das war noch während dem Studium. Und da habe ich in so einem Institut mitgearbeitet als freier Mitarbeiter. Und dann habe ich mich, dann war ich aber wieder erstmal zeitlang im Studium. Und ich glaube, so ab 2018 kann man das so datieren, dass ich dann wirklich auch Freelancer in der Form war, dass ich eigene Projekte und eigene Kunden hatte. und damit angefangen habe. Und heute würde ich mich als einer dieser Full-Stack-Developer bezeichnen im Bereich Web. Und da mache ich so eigentlich ganz viele unterschiedliche Projekte, also entweder als verlängerter Arm von Agenturen oder mit eigenen Kunden, Websites, Online-Shops, Plugins für bestehende Systeme, Web-Apps oder auch mobile Apps. Und worauf ich mich ein bisschen spezialisiert habe in den letzten Jahren ist Shopware 6, das E-Commerce, die E-Commerce Plattform. Und dafür habe ich auch Plugins entwickelt, die ich im Community Store dort verkaufe.",
            "start": 347622,
            "end": 405217,
            "confidence": 0.8326265822784811,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Das heißt, du hast auch mehr als einen Kunden in dem Fall.",
            "start": 405257,
            "end": 407600,
            "confidence": 0.8295,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also mehr als einen Kunden, mehr als ein Projekt. Normalerweise immer so eins gleichzeitig, aber ja.",
            "start": 408000,
            "end": 413506,
            "confidence": 0.8601764705882351,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Und wenn ich es richtig verstanden habe, Christian, du hast aber primär einen Kunden, oder? Wenn du dauerhaft für den arbeitest.",
            "start": 414387,
            "end": 420391,
            "confidence": 0.7617619047619048,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Richtig. Also ich habe, die meiste Zeit habe ich einen Kunden. Über so ein paar Plattformen habe ich mal so Dayjobs auch angenommen. Aber ich würde schon sagen, wahrscheinlich 99 Prozent meiner Zeit fließt in ein einziges Projekt und einen Kunden.",
            "start": 420471,
            "end": 433701,
            "confidence": 0.7678780487804878,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also das klassische Bodyleasing.",
            "start": 433741,
            "end": 435402,
            "confidence": 0.722,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 435442,
            "end": 435622,
            "confidence": 0.877,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Bodyleasing beschreibst du jetzt als, du bist wirklich als Teil eines Teams, bist da hands-on, bist aber nicht angestellt in dieser Firma, sondern bist einfach so als Teamerweiterung im Team, richtig? Das versteht ihr unter Bodyleasing?",
            "start": 436122,
            "end": 447751,
            "confidence": 0.7600277777777777,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wolfgang, verstehen wir das unter Bodyleasing?",
            "start": 447972,
            "end": 452235,
            "confidence": 0.7113333333333335,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, also ich würde das unter Bodyleasing so verstehen. Also dass du wie eigentlich normaler Angestellter arbeitest, ... ... aber die Verrechnung ist natürlich eine andere. Aber du arbeitest im Team Fulltime ... ... oder mehr oder weniger Fulltime einfach für eine Firma.",
            "start": 452275,
            "end": 466303,
            "confidence": 0.7486046511627906,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also ich muss gestehen, ich hatte nämlich vor diesem Podcast den Begriff Bodyleasing noch nicht gehört, aber so wie Wolfgang das beschrieben hat, das ist eigentlich genau die Art und Weise, wie ich arbeite. Also ich werde auch als vollwertiges Teammitglied gesehen in diesem Projekt.",
            "start": 466653,
            "end": 478616,
            "confidence": 0.8325434782608695,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Werbung. Auch selbstständige Freelancer müssen sich weiterbilden. Darüber sprechen wir später noch in dieser Episode. Aber egal ob Freelancer oder Arbeitnehmer in Festanstellung, die erstklassigen deutschsprachigen Schulungen von Workshops.de bringen deine Karriere voran. Egal ob du dich für Angular, React, Vue.js, Springboot, Docker, Security, Data Science oder einfach für die Grundlagen von HTML, CSS, JavaScript und Typescript interessierst. Workshops.de bietet ein breites Spektrum an hochwertigen Schulungen. Du hast die Wahl. Du kannst einen einzelnen Platz in den Remote-Schulungen buchen oder du investierst in maßgeschneiderte Inhouse-Schulungen, die speziell auf die Anforderungen deines Unternehmens zugeschnitten sind. Ein besonderes Angebot von Workshops.de sind die sogenannten Lifetime-Schulungen. Das sind Videotrainings inklusive wöchentlichen Livecalls mit erfahrenen TrainerInnen, Musterlösungen, regelmäßigen Updates und uneingeschränktem Zugang zu allen Lernmaterialien. Du bestimmst dein Tempo und behältst lebenslang Zugriff auf sämtliche Ressourcen. Schließlich wissen wir alle, dass im Leben manchmal etwas dazwischenkommt. Alle Infos auf workshops.de oder in den Show Notes. Werbung Ende.",
            "start": 479416,
            "end": 546335,
            "confidence": 0.815869281045752,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also es gibt ja auch Bodyleasing, dass man zum Beispiel angestellt ist für eine Agentur und die vermietet einen dann weiter oder macht dieses Bodyleasing. Das ist eigentlich das ganz klassische Bodyleasing. Aber ich würde mal beim Freelancing das auch so als zwei große Kategorien sehen. Also hat man mehrere Kunden, kümmert man sich selber um die Projekte, um die Akquise und hat da kleinteiligere Projekte oder arbeitet man eben primär für einen großen Kunden und mehr oder weniger Fulltime. Das sind so meiner Meinung nach zwei große Bereiche und ein großer Unterschied zwischen den zwei Bereichen, weil man halt im Alltag ganz anders agieren muss. Wenn man einen fixen Job für sechs Monate, zwölf Monate hat, dann muss man sich halt um Akquise einfach wesentlich weniger kümmern, als wenn man kleinere Projekte annimmt.",
            "start": 547374,
            "end": 588838,
            "confidence": 0.8319850746268656,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es gibt ja auch den Begriff Arbeitnehmerüberlassung. Das habe ich auch vor kurzem, das erste Mal, bin ich damit in Kontakt getreten.",
            "start": 588898,
            "end": 595122,
            "confidence": 0.7724545454545454,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Das ist wahrscheinlich der deutsche Begriff für Bodylessing.",
            "start": 595327,
            "end": 598129,
            "confidence": 0.5535,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wahrscheinlich schon. Also da ist es auch so, du bist eigentlich angestellt bei einem anderen Unternehmen, nicht beim Kunden, den du dann letztendlich unterstützt. Und das Unternehmen, bei dem du angestellt bist, überlässt dann für einen definierten Zeitraum im Monat, Stundenzeit im Monat, Stundensatz im Monat, Tagessatz, wie auch immer, dich dem Kunden quasi als Ressource. Das ist dann quasi genau das Gleiche.",
            "start": 598149,
            "end": 619164,
            "confidence": 0.8140793650793652,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Also ich finde, die Leute, die das machen, die machen den Markt kaputt.",
            "start": 619714,
            "end": 622095,
            "confidence": 0.7873076923076923,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Warum das?",
            "start": 622115,
            "end": 625377,
            "confidence": 0.5175000000000001,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ja, weil Arbeitnehmerüberlassung, du bist ja tatsächlich angestellt. Du bist nicht mehr selbstständig nach Definition, wenn du das so machst. Und für die Firmen ist das total interessant, weil sie eben dir nicht ganz so viel zahlen müssen, wie wenn du ein Freelancer bist. Aber für mich als Freiberufler, da kommen wir vielleicht auch später noch drauf, warum man das überhaupt alles macht und was das finanziell macht. Für mich kombiniert das so ein bisschen die beiden schlechtesten Sachen von freiberuflicher Arbeit. weil man nicht die Flexibilität hat als Freelancer und eigentlich auch nicht ganz so hohe Stundensätze bzw. so flexibel ist, was das Finanzielle angeht.",
            "start": 625437,
            "end": 656018,
            "confidence": 0.8023301886792445,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wobei man schon dazu sagen muss, dass die Agenturen dann eigentlich schon so klassische Stundensätze verlangen beim Kunden. Also da läuft es halt dann dementsprechend in deren Risiko, dass sie dich fix anstellen und wenn dann halt kein Kunde da ist und sie dich fortbilden, gerade große Agenturen und Body-Leasing-Agenturen arbeiten so. Also ich bin mir gar nicht sicher, ob die dann so einen viel geringeren Stundensatz aufrufen. Und was ich so bisher mitbekommen habe, ist das eigentlich schon ein klassischer Stundensatz.",
            "start": 656552,
            "end": 682344,
            "confidence": 0.7827439024390244,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn man Arbeitnehmerüberlassung googelt, wird das gleichgesetzt mit Zeitarbeit oder Leiharbeit?",
            "start": 683264,
            "end": 688329,
            "confidence": 0.8859090909090909,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, sehr beliebt ist das natürlich überhaupt in dem Bereich, wo man, keine Ahnung, Kellner, Kellnerinnen in der Gastro, solche Dinge, da passiert das natürlich sehr oft und da sprechen wir dann über andere Gehälter natürlich, aber in der IT sind es halt klassische Agenturen, die dann die Leute dementsprechend in Projekte positionieren.",
            "start": 688930,
            "end": 706387,
            "confidence": 0.8243396226415094,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber den mix finde ich hier ganz spannend denn wir haben jemand der ist unter ein jahr selbstständig dann haben wir jemanden der ist so circa seit fünf jahren wirklich selbstständig und dann haben wir den dinosaurier den wolfgang der mit den 20 jahren hier den jungen hasen schon was was vormacht. Aber Thomas, ganz kurz Shopware. Shopware ist ein E-Commerce System in PHP geschrieben. Das bedeutet, du beweist dann hier auch, dass man auch in 2023 noch mit PHP Geld verdienen kann, oder?",
            "start": 706787,
            "end": 735459,
            "confidence": 0.8273333333333336,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ihr sagt ja selbst fast in jeder Folge, lecke sie verdient das Geld, oder? Genau so ist es. Nee, also ich bin auch nicht so ein unglaublich großer PHP-Fan, aber durch diese Plattform und dem Framework, unten drunter Symphonie ist das nämlich, habe ich die Sprache auch so ein bisschen lieben gelernt, weil modernes PHP ist schon echt nochmal was anderes als das PHP vor, weiß nicht, wann ich da mit angefangen habe, vor fünf bis acht Jahren oder so.",
            "start": 735519,
            "end": 761018,
            "confidence": 0.7980749999999999,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Wahnsinn. Ich finde das schön, dass Legacy verdient das Geld, dass dieser Spruch von jemand anders kommt als von mir.",
            "start": 761318,
            "end": 767104,
            "confidence": 0.8671999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Außerdem, ich mache hin und wieder auch noch PHP. Also es gibt alte Codebases von mir, da programmiere ich hin und wieder noch rum, das ist immer noch PHP. Ganz klar.",
            "start": 767144,
            "end": 774931,
            "confidence": 0.7810645161290324,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ist ja auch immer noch die meistverbreitetste und supportetste Sprache, glaube ich, so im Web-Bereich, oder?",
            "start": 774971,
            "end": 781237,
            "confidence": 0.7965625000000002,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ich würde es auch nicht ausschließen bei neuen Projekten, wenn es sinnvoll ist und passt, würde ich durchaus noch auf BHB auch setzen.",
            "start": 781757,
            "end": 787759,
            "confidence": 0.7712608695652172,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, voll. Also vor allem Symphonie, Laravel sind echt richtig gute Frameworks.",
            "start": 788239,
            "end": 792600,
            "confidence": 0.6055833333333334,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Kommen wir mal ein bisschen in das Warum der ganzen Thematik. Also ich würde gern wissen, warum macht ihr Freelancing? Was ist eure Motivation? Und besonders jetzt zum Beispiel beim Christian, der jetzt erst vor kurzem in die Selbstständigkeit gewechselt ist von einem festen stabilen Angestelltenverhältnis. Was hat dich bewegt, Freelancer zu werden? Warum machst du das? Warum bindest du dir all das ans Bein?",
            "start": 792640,
            "end": 818632,
            "confidence": 0.7901076923076924,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Eine ausgezeichnete Frage. Ich find gut, dass du gesagt hast, dass ich aus einem stabilen Umfeld irgendwie mich entschieden hab, quasi in dieses instabile Freelancen reinzugehen.",
            "start": 818672,
            "end": 827440,
            "confidence": 0.7888076923076924,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Weil du gefeuert wurdest?",
            "start": 827480,
            "end": 828301,
            "confidence": 0.49624999999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Aus dir wird nie was. Nee, weil genau da würde ich widersprechen. Denn das ist nämlich auch mein vorheriger Job. Ich hab den sehr genossen, das waren großartige Kollegen. Und das sag ich nicht nur, weil die wahrscheinlich diese Folge hören werden, sondern auch, weil ich das wirklich so sehe. Aber ich muss sagen, mein Hauptgrund, warum ich gesagt hab, ich muss jetzt mal ins Freelancen, ist zum einen, ich arbeite seit sieben Jahren quasi jetzt professionell und war davon die meiste Zeit einfach bei einer Firma in der Festanstellung und ich habe für mich entschieden, ich möchte halt mal eine neue Firma sehen und in dem Zuge kam für mich einfach der Gedanke, hey, warum nicht einfach als Selbstständiger das probieren? Und ein Hauptgrund war natürlich auch der finanzielle Aspekt, warum ich mir gesagt habe, hey, man hört immer, Freelancer verdienen mehr. Darüber sprechen wir dann ja auch gleich noch. Und mein damaliger Chef hat auch zu mir gesagt, weil wir hatten natürlich Gehaltsverhandlungen, ich wollte erst nochmal sprechen, hey, könnte ich vielleicht, ja also, wo ist hier Bewegung, was ist möglich in dieser Festanstellung? Und da hieß es auch irgendwie so, ja, wir können dir nicht das bieten, was du möchtest, aber ich kann dir Stabilität hier bieten. Und an dieser Stelle muss ich sagen, in der aktuellen Situation, in der man als Retailer ist, finde ich, ist die Stabilität, die mir irgendwie jetzt in so einem normalen mittelständischen Unternehmen mir geboten werden kann, die ist nicht so viel höher als die Stabilität, die ich irgendwie jetzt als Freelancer für mich sehe. Deswegen war für mich die Entscheidung jetzt nicht so schwer zu sagen, hey, ich spring da ins kalte Wasser, ich probiere jetzt zu freelancen, weil im schlimmsten Fall wäre ich zurückgefallen auf die Festanstellung. bei irgendeiner anderen Firma. Ja, ich hatte auch Gespräche mit anderen Firmen. Das heißt, ich wusste, ich komme da irgendwo unter. Dieser Sprung war für mich deswegen gar nicht so weit weg irgendwie. Und ich wollte eigentlich super gerne mal Freelancen ausprobieren, Selbstständigkeit ausprobieren. Und vor allem auch hatte ich Bock auf dieses Hustler-Mindset. Ja, das ist ein bisschen auch ein verbrannter Begriff. Aber so dieses, ich versuche das Beste aus mir rauszuholen und irgendwie mich mal ein bisschen selber wieder zu challengen. Und den Eindruck habe ich auch heute noch hier jetzt nach, ich glaube acht Monaten freelancen jetzt, habe ich immer noch den, dass ich das Gefühl habe, ich werde sehr viel mehr gefordert als Freelancer und das mache ich natürlich auch viel von mir selbst, aber natürlich auch, weil in dem Projekt, in dem ich bin, die Kunden eine ganz andere Erwartung von mir irgendwie haben und ja, das waren so die Punkte, warum ich gesagt habe, hey, ich möchte gerne dieses Freelance mal ausprobieren.",
            "start": 831672,
            "end": 962870,
            "confidence": 0.790884120171674,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie sieht es bei dir aus, Thomas? Was treibt dich an, Freelancer zu sein?",
            "start": 963130,
            "end": 966251,
            "confidence": 0.7217142857142856,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das ist eine sehr gute Frage. Ich glaube, grundsätzlich ist mir Freiheit und Flexibilität schon immer sehr wichtig gewesen. Ich war ja früher in mehreren Anstellungen, wo ich immer so ... maximal ein bis eineinhalb Jahre geblieben bin und dann mir einen neuen Job gesucht habe, weil es mir irgendwie beim aktuellen Arbeitgeber so ein bisschen zu langweilig wurde und zu monoton und mir die Abwechslung so ein bisschen gefehlt hat. Und nebenbei habe ich da auch schon kleine Projekte entweder selbst gemacht oder halt sogar erste Freelance-Projekte gemacht. Ja, dann kam halt irgendwann der Schritt, als man dann irgendwann genug Kontakte hatte und sich so ein bisschen spezialisiert hat, dass man sagt, okay, probiert man es halt mal komplett. Und seitdem ist es ein Auf und Ab immer wieder. Es ist auf jeden Fall nicht so stagnierend und nicht so stabil, wie das bei einer Anstellung der Fall wäre, für mich persönlich zumindest. Aber diese Challenge, was Christian auch gemeint hat, ich glaube, das ist auch was, was irgendwie trotzdem auch ein Reiz dabei sein kann.",
            "start": 966772,
            "end": 1026333,
            "confidence": 0.8263785310734464,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Aber wenn du von Freiheit und Flexibilität sprichst, was heißt das? Also für den einen heißt das, ich mache eine Weltreise, für den anderen heißt das Vanlife und der dritte sagt einfach nur, ich möchte einfach den ganzen Tag Netflix gucken. Also was ist Freiheit und Flexibilität für dich?",
            "start": 1026647,
            "end": 1041903,
            "confidence": 0.7905102040816323,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Eigentlich den ganzen Tag Netflix gucken natürlich. Nee, es ist ein sehr guter Punkt, weil das ist genau so ein Thema, worüber ich mir auch Gedanken gemacht habe, während Corona und während so Homeoffice-Situationen immer mehr normal geworden ist. Weil als Freelancer hattest du das früher, also früher hattest du es gefühlt nur als Freelancer. Zumindest war das meine Erfahrung, ich weiß nicht, wie es bei euch ist. Aber da konntest du sagen, okay, ich arbeite von zu Hause aus oder ich arbeite vom Café aus oder wie auch immer. Ich teile mir meine Zeit selbst ein. Ich arbeite vormittags, dann mache ich nachmittags. Irgendwie was mit der Familie oder was mit Freunden oder wie auch immer. Und abends setze ich mich nochmal ein paar Stündchen hin und arbeite halt und verdiene mein Geld irgendwie auf Stundenbasis oder mit einem Tagessatz, wie auch immer. Und dann hast du halt den 9-to-5, wo du halt morgens ins Büro gehst, bis 18 Uhr bleibst, deine Mittagspause hast und halt lokal gebunden bist und da jeden Tag hin musst. Und das war so der viel größere Kontrast. Das war für mich so das Thema Freiheit, was mich immer in diese Richtung Freelance gebracht hat. Jetzt, wo es aktuell so ist, dass viele Leute diese Vorzüge auch in der Anstellung genießen können, finde ich, ist der Punkt auch in der Anstellung eigentlich zumindest zum Teil gegeben. Sehr viele Arbeitgeber sind offen dafür, dass man einen Großteil der Zeit irgendwie von zu Hause heraus arbeitet oder vielleicht auch einfach von unterwegs. Also das ist für mich so der Bereich Freiheit. Aber es kommt natürlich auch der Punkt dazu, dass wenn man komplett selbstständig ist und Freelancer ist und seine eigenen Kunden hat, was natürlich auch mal ein bisschen schwierig ist, trotzdem die Möglichkeit hat zu sagen, an was arbeite ich überhaupt. Also als Angestellter arbeitest du natürlich an den Projekten, die dir deine Firma vorlegt, sag ich mal. Als Freelancer kannst du bis zum gewissen Teil trotzdem entscheiden, an welchen Projekten und mit welchen Kunden du halt arbeitest, was auch interessant ist.",
            "start": 1041923,
            "end": 1143705,
            "confidence": 0.7971210374639771,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ich glaube, dass ganz, ganz viel auch einfach eine Kopfsache ist. Weil ich glaube, viel von der Flexibilität, die ich jetzt fühle oder wo ich das Gefühl habe, dass ich die habe, das ist auch so ein bisschen, das bilde ich mir ein. Eben das, was du gesagt hast auch, Thomas. Ja, ich kann mir selber jetzt überlegen, welches Projekt ich machen will. Ich kann mir selber überlegen, welche Arbeit, also ob ich eine gewisse Aufgabe, die mir gegeben wird, ob ich die überhaupt annehme oder nicht. Und theoretisch, wenn man einen guten Arbeitgeber hat, kann man diese Dinge ja auch alle irgendwie machen. Aber was ich für mich irgendwie merke, was mir schon gut tut, ist auch dieses, ich bin niemandem so gesehen Rechenschaft schuldig. Also ich werde auch nicht blöd angemacht, wenn ich einfach mal schreibe, hey Leute, ich bin heute nicht in den Meetings. Oder ich schreibe am Donnerstag, wenn es gar nicht so stressig ist, Leute, ich bin am Freitag, ich nehme mir heute frei. Und da merke ich schon, das entlastet mich. Und jetzt vor kurzem hatte ich die Situation, dass ich Corona hatte. Und was ich normalerweise immer habe, wenn ich irgendwie krank bin, dann kommt irgendwo die Phase, wo man sich so wieder ein bisschen gesünder fühlt und dann überlegt man so, okay, lass ich mich jetzt nochmal für zwei Tage krank schreiben, weil eigentlich kann ich wieder arbeiten, aber ich weiß nicht, ob ich durch den ganzen Tag komme. Und ich habe jetzt so als Freelancer gemerkt, hey, gar kein Problem, ich arbeite einfach mal eine Stunde, weil mir geht es gerade gut und dann höre ich wieder auf und am nächsten Tag probiere ich das mal zwei Stunden und ich muss da mit niemanden wirklich kommunizieren und da habe ich schon so gemerkt, hey, das finde ich irgendwie cool, dass ich jetzt nicht irgendwie damit HR kommunizieren muss, ich bin jetzt hier verfügbar oder nicht verfügbar. Das waren dann schon so Momente, wo ich mir dachte, okay, da spüre ich das dann tatsächlich. Was ich auch nicht nutze, ist diese Freiheit im Sinne von, ich arbeite jetzt vom Café aus, ich reise irgendwie viel. Das möchte ich gerne mehr machen, aber dadurch, dass ich sehr viele Telefonate habe, ist dieses gerade, dieses Arbeiten vom Café ist echt super schwierig.",
            "start": 1143885,
            "end": 1235837,
            "confidence": 0.7789252577319583,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und man muss das natürlich auch wollen. Und es ist gar nicht so einfach, dann aus dem Café zu arbeiten, würde ich mal sagen. Aber es hat, glaube ich, auch ganz viel mit Verantwortung zu tun, dass du halt für dich selbst verantwortlich bist. Und für mich ist das halt auch dieses Selbstständigsein. Also gar nicht Freelancen. Freelancen ist für mich immer so, irgendwo gibt es so ein Jobboard, da hängt jemand irgendwie so einen Job raus, hilf ihm mal ein, zwei Stunden und ich schnapp mir den dann. Aber wenn man selbstständig ist, ist man halt auch für sich selbst verantwortlich und macht dann vielleicht eigene Produkte, eigene Projekte, kümmert sich um sich selbst, hat die volle Verantwortung. Natürlich auch die Unsicherheit und das Risiko, was damit zusammenspielt. Aber man ist halt Unternehmer, wenn man das mal so nennen will. Und das war für mich eigentlich auch immer so der Antrieb von dem Ganzen. Und ich habe keine Ahnung mit 15 schon in der Schule begonnen irgendwie so Pepsi Dosen zu verkaufen an meine Mitschüler und da Gewinn zu machen.",
            "start": 1236492,
            "end": 1290440,
            "confidence": 0.8005524861878457,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Hast du das versteuert Wolfgang?",
            "start": 1290460,
            "end": 1293285,
            "confidence": 0.6746000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es war jetzt. Aber die waren einfach zu faul, zum Supermarkt zu gehen, beziehungsweise wir durften das auch nicht. Und dann habe ich halt Pepsi-Dosen verkauft in der Pause. Also irgendwie hatte ich halt dieses Unternehmertum schon immer irgendwie cool gefunden. Und ich muss auch sagen, dann, wie ich selbstständig geworden bin, dann mit 18 und eine Firma hatte, ich habe da garantiert nicht wenig gearbeitet und hatte sehr viel Freizeit oder sowas. Ganz im Gegenteil sogar. Für das Geld, was ich bekommen habe, habe ich wahrscheinlich viel zu viel gearbeitet. Der Fokus war da auch ein anderer und das Fokussieren war nicht so einfach und das Priorisieren. Aber trotzdem hatte ich ein gutes Gefühl, weil ich einfach selbstständig war und die Verantwortung hatte. Und wie du richtig sagst, Christian, ich glaube, heutzutage in vielen Berufen ist das auch möglich, wenn du einfach viel mehr Ownership hast und diesen Purpose und was man halt so immer runterradelt und was heutzutage so wichtig ist. Aber man kann das sicher in der Anstellung auch haben.",
            "start": 1293345,
            "end": 1342365,
            "confidence": 0.7606820809248549,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was ich so raushöre, ist, dass, wenn die Motivation irgendwie so eine Art Freiheit und Flexibilität ist, dass das durch die modernen Privilegien von ITlern aber eigentlich schon gegeben ist, auch durch die Fachkräftemangel kann man sich wahrscheinlich mehr Homeoffice und mehr zeitliche Flexibilität einfordern und allem Drum und Dran, je nach Arbeitgeber natürlich. Aber was ich jetzt so raushöre, dass besonders durch die Entwicklung eigener Produkte eher die Selbstverwirklichung im Vordergrund steht. Kann man das so zusammenfassen, Wolfgang? Ich meine, du hast das speziell erwähnt.",
            "start": 1342985,
            "end": 1371758,
            "confidence": 0.7706162790697673,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch natürlich, ja. Also egal, was ich mache, ich bin immer für mich verantwortlich, auch bei Kundenprojekten. Ich kann entscheiden, was ich für ein Kundenprojekt wirklich annehme und mache. Natürlich, wenn man Geld verdienen muss, muss man teilweise auch Sachen annehmen, die man vielleicht gar nicht so gern hat. Das ist dann nochmal ein anderes Problem, aber da kommen wir später nochmal drauf zu sprechen. Aber grundsätzlich kann man sich selbst verwirklichen. Und wenn man irgendwo ein scheiß Projekt hat, ist man selbst schuld. Und wenn man irgendwas nicht delivert, ist man selber schuld. Also man hat die volle Verantwortung und die Freiheit, wenn man es so nennen will. Aber es ist auch das Problem, du kannst am Abend zum Beispiel nicht abschalten. Das war bei einem Anstellungsverhältnis für mich immer viel, viel einfacher, als wenn du verantwortlich bist für andere Leute. ... vielleicht ... ... das Projekt noch verzögert ist, ... ... du musst irgendwas fertig bekommen. Das ist einfach viel schwieriger, ... ... wenn man selbstständig ist, ... ... als wenn man in einem ... ... Anstellungsverhältnis ist. Wo man vielleicht hunderte andere Leute ... ... noch hat im Team ... ... und große Firma und ... ... das läuft einfach ganz anders. Auch wenn man Verantwortung trägt in der Firma, ... ... aber trotzdem ist ... ... einfach ganz was anderes.",
            "start": 1372818,
            "end": 1433762,
            "confidence": 0.781973214285714,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Thomas nickt die ganze Zeit mit ...",
            "start": 1433802,
            "end": 1435293,
            "confidence": 0.7997142857142858,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "... ich kann nicht abschalten, ... ... ich kann nicht abschalten.",
            "start": 1435293,
            "end": 1437143,
            "confidence": 0.7588181818181817,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie sieht es bei dir aus? Bist du ein Workaholic oder?",
            "start": 1437183,
            "end": 1439764,
            "confidence": 0.6973636363636363,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich nick nur, weil ich ... ... ja also ... ... zustimmendes Nicken halt einfach, ... ... was Wolfgang da spricht, weil ... Genauso nehme ich es auch wahr, also einmal das, was Christian gesagt hat, das mit der Flexibilität, mit der Freiheit kann durchaus auch, sage ich mal, einfach so ein bisschen, ja wie sagt man, falsche Wahrnehmung sein, dass man irgendwie sagt, ich bin Freelancer, ich bin flexibel, ich bin frei und dann ist es in der Realität eigentlich so, wie Wolfgang gesagt hat, dass man eigentlich non-stop arbeitet. Und es gibt ja auch diesen Spruch irgendwie, selbstständig ist ständig und selbst. Und das kann ich auch absolut unterschreiben. Und gleichzeitig fühlt es sich aber trotzdem gut an irgendwie. Es ist nicht so, ich bin jetzt, also für mich persönlich zumindest, so ein bisschen dieses, was Wolfgang auch gesagt hat, mit der Selbstverwirklichung wahrscheinlich, wo ich mir gar nicht so bewusst bin, dass das irgendwie da so mit reinspielt, dass man sagt, ich bin in einem Anstellungsverhältnis, um 18 Uhr ist eigentlich Feierabend und da sitzt du dann irgendwie noch drei Stunden da und musst noch irgendwie Überstunden schieben, damit was fertig wird. Im Vergleich zu, du machst irgendwie fünf oder acht Überstunden, aber halt für dein eigenes Projekt, für deine eigenen Kunden, für dein eigenes Business, was du irgendwie vorantreibst, was du Stück für Stück, Monat für Monat und Jahr für Jahr weiter aufbaust, das ist irgendwie einfach so ein anderer Unterton, der da mitschwingt.",
            "start": 1439824,
            "end": 1511395,
            "confidence": 0.7842298387096777,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Obwohl es natürlich nicht immer Spaß macht, meiner Meinung nach. Also ich hatte auch Projekte, die dann einfach delayed waren und dann habe ich, wo ich auch in Teams mit anderen Freelancern gearbeitet habe, aber ich war der Hauptauftragnehmer und dann habe ich mich einfach um so Sachen kümmern müssen und dann ist es bei mir hängen geblieben. Das war natürlich auch mein Fehler, ganz klar. Aber am Ende trifft es natürlich mich und das war dann auch wenig Spaß, wenn man dann irgendwelche Nächte durchprogrammiert, um irgendeine Deadline zu halten, die man versprochen hat. Andere halt langsamer waren, aber das Problem bei mir natürlich falsch geschätzt, falsch kommuniziert, was es auch immer war. Ich habe viel gelernt dabei, aber das sind schon auch Zeiten, die man dann nicht gut findet und die dann schon auch sehr hart sind, meiner Meinung nach.",
            "start": 1512015,
            "end": 1552229,
            "confidence": 0.8078028169014085,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also in meinem Fall muss ich schon noch sagen, geht mir auch so, dass ich diese Phasen habe, wo ich quasi, also nicht nur Phasen, eigentlich ist es, seitdem ich angefangen habe als Freiberufler zu arbeiten, ist es so, ich kann nicht mehr abschalten. Aber der große Unterschied ist schon der, dass ich mir jetzt manchmal denke, ich habe zum Beispiel jetzt auch letztes Wochenende arbeiten müssen. Super ärgerlich, aber ich denke mir natürlich schon, die Zeit, die ich jetzt arbeite, die wird halt auch abgerechnet. Also es ist nicht so wie, weil ich schon auch in meinem vorherigen Job niemand war, der gesagt hat, 17.30 Uhr lege ich meine Sachen nieder und ich verpiss mich, sondern wenn was noch zu machen war, dann mache ich das. Und wenn es auch im Wochenende ist, habe ich das noch gemacht. Mit dem Unterschied, dass ich mich da manchmal geärgert habe, im Sinne von alles, was ich jetzt bekomme dafür, ist ein am Montag, toll gemacht Christian, du bist wirklich ein sehr wertvoller Mitarbeiter. Und jetzt ist es halt so, ja, sehr wertvoll für mein Konto.",
            "start": 1552834,
            "end": 1599333,
            "confidence": 0.8123206521739127,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Kannst du eigentlich jetzt irgendwie in Urlaub gehen, so spontan, oder musst du das dann auch irgendwie Wochen davor abklären, wenn du quasi so ein fixer Freelancer bist?",
            "start": 1599773,
            "end": 1608352,
            "confidence": 0.7408214285714286,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In der aktuellen Projektphase könnte ich das, glaube ich, nicht machen. Also ich könnte es natürlich machen, aber dann wird mein Vertrag vermutlich nicht verlängert.",
            "start": 1608707,
            "end": 1615528,
            "confidence": 0.7712,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was hast du in deinem Vertrag geregelt? Musst du das vorankündigen? Oder auch wenn du krank bist, wie läuft das?",
            "start": 1615568,
            "end": 1622910,
            "confidence": 0.72415,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In meinem Vertrag steht eigentlich gar nichts dazu drin, zu Urlaub oder was weiß ich, sondern einfach ich mache meine eigenen Arbeitszeiten so, wie ich möchte. Es gibt keine Kernarbeitszeit, es gibt eigentlich gar nichts. Es steht aber drin, dass sie mich.",
            "start": 1622930,
            "end": 1632171,
            "confidence": 0.7628333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Quasi zu Vollzeit gekauft haben.",
            "start": 1632211,
            "end": 1634352,
            "confidence": 0.9526,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das bedeutet eben für mich diese 40 Stunden. Und wenn ich jetzt noch ein anderes Projekt nebenbei mache, dann muss ich da auch Bescheid geben. Und ja, theoretisch steht es Ihnen natürlich dann auch frei zu sagen, hey, das wollen wir nicht.",
            "start": 1635592,
            "end": 1644797,
            "confidence": 0.7700952380952379,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber wenn du jetzt Vollzeit hast und hast nun mal sechs Monate oder so einen Vertrag, dann dürftest du eigentlich in den sechs Monaten Fulltime keine einzige Stunde Urlaub nehmen?",
            "start": 1644817,
            "end": 1654642,
            "confidence": 0.8318666666666665,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn man das nach dem Vertrag so auslegen möchte, dann ist das so, ja. Also ich weiß nicht, ob das in dem Vertrag so geregelt sein müsste, dass es so ist, aber ich meine natürlich, ich kann, also es gibt eine Kündigungsfrist in Anführungszeichen von 14 Tagen, was ich super finde, weil ich eigentlich diese Flexibilität gut finde zu sagen, ich kann schnell mich irgendwie da auch verpissen, wenn ich möchte, aber an sich könnte ich, also so wie es in dem Projekt gehandhabt wird und so wird es auch gehandhabt, wenn die Leute nicht wollen, dass ihre Freelancer ihnen davonlaufen in Schaden, dann ist es so, ich sage jetzt irgendwie am Montag Bescheid, ich möchte gern Freitag weg und dann läuft es auch. Also wenn das Projekt nicht gerade was anderes erfordert, denn natürlich kaufen sich die Leute auch Freelancer ein, weil sie eine gewisse Erwartungshaltung haben. Von mir können sie auch ein bisschen erwarten, dass ich vielleicht mal ein paar Stunden mehr mache, dass ich vielleicht am Wochenende verfügbar bin. Deswegen entscheiden sich ja auch Kunden für den Freelancer und nicht für eine Festanstellung, zum Teil zumindest.",
            "start": 1654682,
            "end": 1701218,
            "confidence": 0.8082751322751324,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber wenn ich euch so zuhöre, dann kommt mir ein Punkt in den Sinn und zwar, es sind schon Wörter gefallen, wie ich bin für mich selbst verantwortlich, ich bin Unternehmer, wurde auch schon gesagt und das bringt mich zu dem Wort Disziplin und Ambitionen. Ja, dass man als Freiberufler anscheinend sehr viel Disziplin an den Tag legen muss, weil man muss halt schaffen. Und dass man auch professionell ein paar Ambitionen hat. Und jetzt habe ich mir die Frage gestellt, nicht jeder hat professionelle Ambitionen. Sich im Job weiterzuentwickeln, viel zu arbeiten. Es gibt eine ganz große Menge an Menschen, die einfach nur den Job ausüben, um die Miete zu zahlen, um ein schönes Familienleben zu haben, um auf die AIDA mal eine Kreuzfahrt zu machen. und einfach Job sein zu lassen und danach auf dem Dorf kegeln gehen. Die dann halt einfach sagen, Job ist Job, bin ich fein damit. Und da stelle ich mir die Frage, ist Freelancing wirklich für jeden geeignet oder gibt es auch einfach Leute, die sagen, da wo ihr sagen würdet, wenn du darauf stehst, würde ich es komplett nicht empfehlen. Wolfgang, wie siehst du das?",
            "start": 1702098,
            "end": 1765475,
            "confidence": 0.8510207253886005,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube schon, dass man ein gewisses Risiko hat, wenn man das Ganze macht und wenn man diese Sicherheit einfach braucht, diese ständige Sicherheit, das fixe Einkommen, dann ist es sicher keine gute Wahl, würde ich mal sagen, wenn man selbstständig wird, ganz klar. Ich hatte das schon auch, wie dann in Vollzeitanstellungsverhältnissen war. Das war schon angenehmer, einfach monatlich das Gehalt zu bekommen, sich keine Sorgen machen zu müssen. Ich habe zwar auch mehr als 40 Stunden gearbeitet, weit mehr, aber es war trotzdem irgendwie diese Sicherheit und am Abend auch mal mehr oder weniger abschalten. Es hat zwar Probleme gegeben im Team oder so, die dann vielleicht auch schlaflose Nächte oder so gegeben hat, auch obwohl man nur angestellt war, ganz klar. Aber das Abschalten war schon viel häufiger und das war schon irgendwo eine Erleichterung. Aber ich bin trotzdem wieder zurückgekommen. Also irgendwie habe ich dann doch etwas vermisst.",
            "start": 1765840,
            "end": 1816204,
            "confidence": 0.8197500000000002,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich muss gestehen, in dem Projekt, in dem ich gerade arbeite, sind alles sehr, sehr gute Freelancer. Es sind auch, also man muss dazu sagen, ich glaube insgesamt, boah, also bestimmt mehrere hundert Leute, die an diesem Projekt arbeiten. Und ich glaube, dass wahrscheinlich ungefähr 60 Prozent davon Freelancer sind, also ein hauptsächlich aus Freelancern bestehendes Projekt. Und ich bin mir nicht ganz sicher, ob da nicht auch ein paar Freelancer arbeiten, die gerade auf der AIDA sind. Also, da sind schon auch ein paar Leute, wo ich mir denke, wie haben die es geschafft, diese Stelle zu bekommen als Freelancer. Also im Großen und Ganzen wirklich sehr gute Qualität an Freelancern, wenn man das so sagen möchte. Ich sehe natürlich die Menschen dahinter auch, nicht nur das, was sie leisten. Aber ich glaube schon, dass man auch als Freelancer arbeiten kann, wenn man einen relativ entspannten Lifestyle gerne haben möchte. Trotzdem habe ich mir selber so ein bisschen ja auch überlegt, fühle ich mich bereit als Freelancer irgendwie zu arbeiten? Und für mich waren drei Punkte da irgendwie wichtig. Und zwar, ich hätte mich nicht dazu entschieden zu freelancen, wenn ich nicht irgendwie ein gefestigtes soziales, also kein gefestigtes soziales Umfeld hätte, weil Arbeit einfach schon häufig für Leute, ja, der Hauptkontakt ist, wo man neue Leute kennenlernt, wo man sich eben auch abends mal auf ein Bierchen trifft und so. Und auch bei mir war das ganz, ganz krass. Also viele meiner Freunde, da wo ich jetzt gerade lebe, sind auch einfach ehemalige Kollegen. Und wenn man da die Arbeitsstelle allein wechselt, dann bricht es ja immer so zum Teil weg. Deswegen war das für mich schon auch eine wichtige Überlegung zu sagen, hey, ich würde das nur machen, wenn ich irgendwie auch Freunde habe außerhalb von meiner Arbeit. Weil häufig ist es so, dass man als Freelancer doch so ein bisschen nebenherläuft im eigentlichen Team und nicht zu den ganzen Events eingeladen wird und so. Und das andere war auch so Thema, ich hätte das nicht gemacht, wenn ich jetzt nicht gesund wäre. Ja, also so das Thema, also ich hab natürlich jetzt keine extra, keine, eigentlich nicht extra eine Vorsorgeuntersuchung gemacht oder sowas, aber ich weiß zum Beispiel von einem guten Freund von mir, bevor er die Entscheidung getroffen hat, dass er sagt, er wird jetzt Freelancer, hat er erstmal so ein paar Gesundheitschecks abgewartet, die sowieso angestanden sind, weil das ist natürlich eine andere Hausnummer, wenn ich mir überlege, ich mach mich jetzt selbstständig und weiß gar nicht oder fühl mich eigentlich nicht irgendwie gesund. Also das sind für mich schon zwei Themen, die irgendwie wichtig sind und natürlich, Der dritte Punkt ist, ich glaube, jetzt selbstständig als Freelancer zu arbeiten, wenn man noch gar keine Erfahrung hat, ist schon nochmal eine ganz andere Herausforderung. Ich würde aber trotzdem gern jedem oder jeder ZuhörerIn hier die Angst nehmen, davor im Sinne von Stabilität und Sicherheit, weil wie gesagt, wenn ich keine Verpflichtungen habe, also keine Kinder oder keinen Kredit, den ich irgendwie abbezahlen muss, dann ist das Schlimmste, was passieren kann, sofern ich in meine Fähigkeiten vertraue und auch da ein bisschen was vorzuweisen habe, dass ich wieder in eine Festeinstellung gehe. Und der Zeitraum dafür ist vielleicht ein Monat. Also das war auch so immer meine Einstellung war, wenn ich jetzt einen Monat irgendwie suche und ich finde nichts oder zwei Monate suche und ich finde nichts, im schlimmsten Fall gehe ich wieder in eine Festeinstellung. Also dieses Sicherheitsding ist auch so ein Gefühl und wenn man das loslassen kann, dann ist das eigentlich gar nicht so ein großer Sprung.",
            "start": 1817085,
            "end": 1980560,
            "confidence": 0.7856573311367373,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber man hat trotzdem irgendwo im Hinterkopf immer dieses, man hat nicht die hundertprozentige Sicherheit. Und es gibt ganz viele Leute, mit denen ich auch gesprochen habe, die brauchen einfach diese absolute Sicherheit. Und ich glaube, für diese Leute wäre es einfach nichts, da in das Freelancing zu gehen. Und ich bin voll auf deiner Seite. Ich sehe überhaupt kein Risiko beim Freelancen, beim Selbstständigsein. in unserer Branche zumindest. Wir sind vollkommen abgesichert, wir können jederzeit irgendwo einen Job bekommen. Vielleicht nicht den besten und den, den wir unbedingt wollen, aber das haben wir so auch nicht, wenn man irgendwo einen Job verliert und dann zum nächsten gehen muss und da hat man auch mal ein, zwei, drei Monate dazwischen. Also das Risiko hat man immer, das ist meiner Meinung nach genau dasselbe Risiko, aber viele Leute können trotzdem mit dem Risiko nicht umgehen und wollen, ist vollkommen okay, wollen dieses Risiko einfach nicht und dann ist es okay, auch kein Freelancer zu sein. Aber allen anderen würde ich sagen, man hat kein Problem damit. Also es gibt eigentlich kein wirkliches Risiko als ITler, muss man dazu sagen.",
            "start": 1981200,
            "end": 2042337,
            "confidence": 0.8366595744680851,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich wollte an ein paar Stellen einen Haken, die ihr beide erwähnt habt. Also ich glaube, ich gehe jetzt mal davon aus, dass es uns allen so geht, als auch den Zuhörern und Zuhörerinnen, dass sie Spaß am Programmieren haben und Spaß an der Arbeit haben, weil sonst würden sie sich wahrscheinlich nicht so intensiv mit dem Thema beschäftigen. Aber wenn dir deine Arbeit nicht Bock macht, ich glaube, das ist ein sehr gutes Indiz dafür, wenn sie dich nicht richtig begeistert, dass du vielleicht nicht den Weg in die Selbstständigkeit gehen solltest. Vielleicht seht ihr das auch anders. Finde ich mal interessant. Dann der Punkt, dass man quasi plötzlich alleine ist im Arbeitsumfeld. Das musste ich eigentlich auch ziemlich stark erfahren, weil ich quasi eigentlich aktuell ausschließlich an all meinen Projekten alleine arbeite.",
            "start": 2042697,
            "end": 2088783,
            "confidence": 0.8157910447761192,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Und keine Freunde hast.",
            "start": 2089362,
            "end": 2090465,
            "confidence": 0.61125,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau. Und nicht in Teams. Und das ist schon auf jeden Fall eine Umstellung gewesen im Vergleich zu ich bin irgendwo angestellt und hab halt die ganze Zeit meine Arbeitskollegen um mich rum. Und das ist auch was, wenn das einem einfach extrem wichtig ist. dass ich während der Arbeit halt auch mal irgendwie nach links und rechts gucken kann und irgendwie mit dem Kollegen quatschen kann, mal an der Kaffeemaschine irgendwie ein Pläuschchen halten kann oder so, dann ist das vielleicht auch ein Indiz dafür, dass Freelancen vielleicht nicht unbedingt das Richtige für einen ist. Ich meine, man kann ja trotzdem sich noch mit Freunden treffen und so weiter, wenn man gerade mal nicht arbeitet. Was auch nicht so oft vorkommt, gerade wenn man anfängt, glaube ich. Aber es ist auf jeden Fall eine Umstellung. Es gibt sicherlich auch Situationen, keine Ahnung, in Großstädten oder so, dass es irgendwie sowas wie Coworking Spaces und sonst was gibt, wo man sich mit reinsetzen kann. Dann hat man quasi auch die Situation wieder als einzelner Freelancer ein bisschen abgedeckt. Aber im Normalfall ist es ja für uns ITler irgendwie so Homeoffice. Und dann ein Punkt noch mit im Notfall falle ich auf eine Festanstellung zurück. Also sehe ich genauso. Ich habe jetzt beispielsweise auch aktuell so eine Situation, wo es einfach wirklich ein bisschen schlechter läuft. Und ich habe mir auch schon Gedanken darüber gemacht, okay, vielleicht muss ich am Ende wieder nach einer Festanstellung suchen. Ich hoffe, dass das jetzt nicht passieren wird und ich Projekte finde. Aber wir sind als Programmierer da schon relativ privilegiert, dass so viel nach uns gesucht wird. Und ich glaube, in anderen Berufen ist es durchaus ein Privileg, was man vielleicht nicht unbedingt hat. Und das ist natürlich, also kann man sich auch glücklich schätzen als Programmierer, dass das eine Option ist. Ja, genau. Und ich habe noch einen Punkt, den ich vielleicht kurz anspreche, weil du gesagt hast, Disziplin und Ambition als Freelancer. Ich muss ganz ehrlich sagen, ich habe auch schon Freelancer kennengelernt, die jetzt nicht so viel Disziplin an den Tag gelegt haben und nicht so viel Ambition. Und auch die schaffen es irgendwie. Also ich frage mich immer ein bisschen, wie? Weil ich würde mich persönlich schon als jemand beschreiben, der zumindest im Kundenkontakt und dem Kunden gegenüber und dem Projekt gegenüber relativ viel Disziplin und Ambition an den Tag legt. Trotzdem habe ich oft Probleme, irgendwie auch Projekte und Kunden zu finden.",
            "start": 2090485,
            "end": 2211989,
            "confidence": 0.8059297820823245,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Aber ich glaube, das ist halt auch der große Unterschied dann, wenn du Bodyleasing machst, also jetzt nicht um Christian näher zu treten, aber wenn du dich einfach bei einer Agentur meldest und die Agentur dich vermittelt und du machst da nur normaler Programmieren im Team, dann hast du natürlich null zu tun mit der Akquise, das läuft über einfach eine Agentur, über einen Agent und da brauchst du dann natürlich jetzt nicht so agieren und selbstständig sein und so weiter. Solche Leute gibt es natürlich auch, aber ich glaube, umso selbstständiger du bist, Projekte an Land ziehen musst und da musst du dann natürlich schon beweisen, dass du auch den Fokus hast, dass du priorisieren kannst, dass du die organisieren kannst und die ganzen Dinge, die da dazugehören.",
            "start": 2212409,
            "end": 2251668,
            "confidence": 0.7887596899224806,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Was auch extrem viel Zeit und Nervenraum kann. Als Programmierer will man ja eigentlich programmieren. Das macht ja Spaß und man will die Projekte vorantreiben und wenn man irgendwie Bock auf Kundenkontakt hat, will man vielleicht auch irgendwie tolle Ideen mit einbringen und das Produkt verbessern. Aber dann halt die ganze Zeit noch Akquise zu machen, aber da kommen wir später nochmal drauf.",
            "start": 2252308,
            "end": 2268520,
            "confidence": 0.8237936507936507,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Zum Thema Akquise, genau, das behandeln wir gleich. Wir fangen erst mal mit einem Thema an, was eigentlich Christians Motivation ist, nämlich Money, Money, Money. Na, na, na, na.",
            "start": 2269140,
            "end": 2281038,
            "confidence": 0.8302068965517241,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Weiter kannst du es nicht, ne?",
            "start": 2281058,
            "end": 2281939,
            "confidence": 0.4240000000000001,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ist aber von ABBA, oder?",
            "start": 2283942,
            "end": 2285604,
            "confidence": 0.5902000000000001,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ist von ABBA.",
            "start": 2285624,
            "end": 2287646,
            "confidence": 0.461,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau, mir brennt immer die Frage unter den Nägeln, okay, lohnt sich das Ganze denn wirklich finanziell für euch? Also macht man im Freelancer-Dasein wirklich mehr Kohle als im Angestelltenverhältnis? Wolfgang, 20 Jahre am Start. Ich denke, du solltest die Frage beantworten können.",
            "start": 2287666,
            "end": 2305503,
            "confidence": 0.8453953488372093,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ich würde mal sagen, nicht automatisch. Man kann sicher mehr machen, aber es gibt auch Anstellungsverhältnisse, die sehr gut zahlen. Also ich glaube wirklich, it depends. Und auch da ist wieder ganz, ganz wichtig, dass du dich selbst organisieren kannst, schätzen kannst, verhandeln kannst, die ganzen Dinge. Und da muss ich schon sagen, gerade am Anfang, konnte ich gar nichts von dem Zeug. Ich hoffe, ich bin besser geworden, könnte aber immer noch besser sein. Und wenn du halt einfach gerade Projekte realisierst und dann eine Schätzung machst und dann einen Fixpreis womöglich und das Schlimmste noch einen Fixpreis mit einem ganzen Freelancer-Team womöglich und du verschätzt dich einfach mal so um 300 Prozent, dann hast du ein Problem am Ende und dann hast du sicher nicht viel verdient am Ende, falls du überhaupt was verdient hast. Also je nachdem, es ist wirklich schwierig zu sagen, wenn du jetzt einen fixen Stundensatz hast und einfach stundenmäßig abrechnest, dann hast du relativ wenig Risiko. Dann ist noch, okay, Verhandlungsgeschick, wie viel kannst du rausverhandeln und du musst natürlich Projekte organisieren, aber Stundensatz basiert ist natürlich immer einfacher und ist heutzutage auch viel anerkannter, würde ich mal sagen. Also zu meiner Anfangszeit wollte jede Firma einen Fixpreis. Da hat es das einfach nicht gegeben. Und wenn du dann mit agilen Methoden gekommen bist, hat jeder dumm angeschaut und hat gemeint, was ist eine agile Methode? Ich will ein fixes Angebot haben für den Webshop. Und wenn du dann sagst, die Anforderungen ändern sich dreimal, sagen die, mir ist egal, die anderen fünf Firmen haben auch ein fixes Angebot gemacht. Also das war früher einfach nicht möglich, da stundenbasiert oder flexibler zu arbeiten. Und das hat sich heutzutage natürlich schon geändert. Darum auch weniger Risiko. Aber am Ende wirklich mehr zu verdienen als bei einem top angestellten Job ist gar nicht so leicht, je nachdem wie gut du bist natürlich. Aber es gehört schon was dazu, auch wirklich regelmäßig da ein Income zu haben. Ist auch die Frage, wie wichtig dir das ist. Mir aktuell zum Beispiel die Arbeit einfach gern weniger. Schaut dann natürlich auch weniger raus, ist eh klar. Also es kommt darauf an, wie man das halt angeht grundsätzlich. Aber es ist sicher nicht so, ich werde jetzt Freelancer und verdiene automatisch das Doppelte, nur weil ich einen Stundensatz von 140 Euro oder so bekomme. Also du musst ja dann auch die Kunden haben, du musst das Ganze richtig machen und du musst die Steuern zahlen und, und, und. Und dass dir dann am Ende noch wirklich über ein Jahr zum Beispiel gerechnet, dass da mehr raus schaut als bei einem Anstellungsverhältnis, ist sicher nicht so, dass es automatisch immer so ist. Auf gar keinen Fall, würde ich mal sagen.",
            "start": 2305543,
            "end": 2451110,
            "confidence": 0.7886334056399128,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber würdest du sagen, Wolfgang, weil du gesagt hast, es gibt die Topjobs, ja, und das weiß ich auch, dass es die gibt. Ich finde, es ist auch eine Frage immer, wenn man sich jetzt überlegt, was verdiene ich als Freelancer, was verdiene ich in der Festentstellung. In der Festentstellung kann ich mir ja auch eine Karriere aufbauen, die mich vielleicht nach vier, fünf Jahren in Gehaltssphären katapultiert, die du als Freelancer eigentlich gar nicht erreichen kannst, weil du einfach nicht jedes Mal deine Stundensätze anheben kannst. Aber würdest du sagen, von der Anzahl der Jobs, die es gibt, von diesen Topjobs, dass das den Anzahl an Freelancer-Positionen irgendwie matcht, weil das ist eigentlich nicht mein Eindruck. Also es mag sein, dass es diese Jobs gibt, wo ich jetzt irgendwie auch in der Festanstellung genauso viel verdienen würde wie als Freelancer, aber ich würde sagen, die sind sehr viel härter umkämpft als diese Freelancer-Positionen, die es jetzt gerade da draußen gibt.",
            "start": 2451495,
            "end": 2494688,
            "confidence": 0.7949316770186333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, kann durchaus sein. Es kommt auch immer darauf an, bis zu Bodyleasing hast du wirklich 40 Stunden pro Woche, bekommst du jede Stunde bezahlt, weil wenn du auch projektbasiert arbeitest, dann hast du meistens nicht jede Stunde bezahlt. Gerade im Beratungsgeschäft ist es ganz oft so, die Leute zahlen dich ja für deine Erfahrung und dass du ein breites Wissen hast und dass du aktuelle Trends kennst und, und, und. Das heißt, du könntest gar nicht 40 Stunden die Woche oder Fulltime arbeiten, Und ich würde mal sogar sagen, wenn du Beratungsgeschäft machst, dann kannst du maximal 50% verrechnen, weil die anderen 50% musst du dich weiterbilden, fortbilden, vielleicht auch Akquise machen, alles, was sonst rundherum dazugehört. Also du kannst da nur 50% verrechnen. Und dann ist es schon nicht mehr so easy, auf denselben Jahressatz zu kommen, würde ich mal sagen, mit dem ganzen Risiko dabei und alles, was dazugehört.",
            "start": 2495628,
            "end": 2552397,
            "confidence": 0.8116052631578947,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber Christian, du hast gerade am Anfang gesagt, dass die Finanzen eine Motivation war für dich. Und jetzt bist du ein paar Monate drin. Wie sieht dein Forecast aus?",
            "start": 2553046,
            "end": 2561932,
            "confidence": 0.7308620689655171,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Rechnet sich die ganze Sache? Also ich bin jetzt ungefähr nach dem, was ich, wenn ich alles abziehe schon, würde ich sagen, hat sich mein Gehalt verdoppelt. Also für mich hat sich das auf jeden Fall gelohnt. Ich habe natürlich davor jetzt auch nicht das Top-Gehalt verdient als iOS-Entwickler. Aber für mich ist es eigentlich war das ein absoluter No-Brainer zu sagen, ich arbeite als Freelancer. Ich muss auch dazu sagen, als ich eingestiegen bin in die ganze Geschichte, war mein Stundensatz würde ich sagen wirklich unterdurchschnittlich, weil ich einfach keine Ahnung hatte. Ich wollte irgendwas finden. Die Recruiter, die mit mir gesprochen haben, die waren auch total skeptisch irgendwie, was kann der Junge überhaupt. Deswegen haben die natürlich mich gedrückt und gedrückt und ich konnte nicht wirklich was dagegen sagen, weil ich auch keine Ahnung hatte. Und trotzdem, selbst wenn ich das reinrechne, plus mit die Stundensatzanpassung, die ich jetzt glücklicherweise bekommen habe, bin ich immer noch, also für mich hat sich das finanziell auf jeden Fall gelohnt. Ich muss aber natürlich dazu sagen, es ist so wie Wolfgang gesagt hat, ich bin ja in diesem Bodyleasing, ich verkaufe mich quasi und ich kann jeden Monat meine 160 Stunden da irgendwie reinklatschen. und kann auch damit rechnen, dass ich die arbeiten werde. In der Regel ist es sogar eigentlich mehr in dem Projekt, in dem ich arbeite, und ich kann an sich auch jede Stunde verrechnen. Natürlich, wenn jetzt mal am Wochenende irgendwie nur kurz mal ein Anruf kommt oder so, dann mache ich das nicht, aber im Großen und Ganzen kann ich schon sehr gut kalkulieren, was denn im nächsten Monat irgendwie reinkommt an Geld, plus eben ich habe auch eine Prognose, wie lange dieses Projekt für mich noch funktioniert und wie lange ich in dem arbeiten kann. Also deswegen ist für mich dieser Schritt auch in dieses Freelancen total, ja, es war einfach ein absoluter No-Brainer. Und vielleicht zu der Art und Weise, wie ich das berechne für mich, weil ich natürlich, man kann ja nicht so einfach sagen, ich rechne jetzt mal meine 160 Stunden, mal meinen Stundensatz, mal zwölf, sondern ich habe mir auch von Anfang an irgendwie gesagt, okay, ich werde keine zwölf Monate im Jahr arbeiten, selbst wenn ich dieses Bodyleasing mache, weil Urlaub, Krankheit und so weiter und so fort. Das heißt, ich rechne quasi meine Monate in dem Projekt, in dem ich gerade bin, mal zehn. Also zwei Monate im Jahr weiß ich, da werde ich nicht arbeiten aus irgendwelchen Gründen, sei es mal Urlaub oder Krankheit. Und davon ziehe ich dann auch noch zusätzlich natürlich Einkommenssteuer ab. Kann man ja wirklich auch relativ gut errechnen, was einem da ungefähr erwartet, wenn man hochrechnen kann in meinem Fall. was man da verdient und natürlich auch Krankenkasse und so weiter und so fort. Das heißt, ich weiß sehr gut, was ich verdiene und für mich ist das, wie gesagt, einfach eine klare Sache, dass ich ungefähr um 100 Prozent mein Einkommen gesteigert habe durch die Freelancerarbeit.",
            "start": 2561972,
            "end": 2698383,
            "confidence": 0.8091507936507941,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Thomas, du sagtest, bei dir läuft es gerade nicht so gut, aber wenn du jetzt mal auf die letzten fünf Jahre zurückschaust, würdest du sagen, im arithmetischen Mittel hast du mehr verdient als die Stellenausschreibung mit den angesagten Gehältern, die du im Internet so findest?",
            "start": 2698623,
            "end": 2715133,
            "confidence": 0.8077777777777778,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich glaube, im Mittel ist es wahrscheinlich so wie eine normale Anstellung. Also ich habe ja, wie gesagt, schon während meiner damaligen Anstellung in Freelance gearbeitet und habe da quasi so Teilzeit auch gewesen, habe da quasi dann mit Freelance-Projekten den Rest aufgefüllt, der durch die Teilzeit dann sozusagen verloren gegangen ist. Und jetzt ist es, denke ich, so, dass man auf jeden Fall wieder wehrt von der normalen Anstellung, aber natürlich mit dem Ziel, das Ganze ein bisschen weiter anzuheben. Das ist natürlich auch eine Motivation. Und ich denke, also ich denke auch, das, was Wolfgang gesagt hat, als Freelancer oder als Selbstständiger hat man grundsätzlich, denke ich, eine sehr offene Möglichkeit, wohin man das treibt und hat natürlich auch wieder die eigene Verantwortung, was man daraus macht, ob man irgendwie, keine Ahnung, dann irgendwann seine eigene Firma oder sonst was aufbaut, seine eigenen Produkte entwickelt, wie auch immer. und da verschiedene Kanäle aufbaut, worüber dann irgendwie auch verschiedenes Einkommen generiert wird. Man muss ja nicht nur seine Zeit, sage ich mal, verkaufen, sondern kann ja vielleicht auch irgendwelche Produkte entwickeln, die Geld generieren. In der Anstellung, glaube ich, also vielleicht sehe ich das auch einfach ein bisschen zu einseitig, weil in der Anstellung hat man schon auch die Möglichkeit, eine Karriereleiter, glaube ich, sehr weit hoch zu laufen. Aber so von dem, was man aus der Freelance-Welt, sage ich mal, immer hört, ist das halt einfach so, man lässt die Ketten fallen, sage ich mal, und kann theoretisch, wenn man es schafft, wenn man den Skill dazu hat, entsprechend hoch sich entwickeln.",
            "start": 2715578,
            "end": 2806195,
            "confidence": 0.8413030303030298,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Also ich glaube auch, dass das grundsätzlich möglich ist, wenn du Bodyleasing machst, wenn du also den selben Job weitermachst. Wobei selber Job ist auch immer so die Sache. Freelancer bekommen ja gern die uninteressanten Dinge. Also keine Ahnung, ob du das bestätigen kannst, Christian, wie interessant das Projekt ist. Aber was ich so von vielen Freelancern kenne, sind es halt eher so mühselige Jobs. Keine Ahnung. Wie ist das bei dir?",
            "start": 2806647,
            "end": 2828680,
            "confidence": 0.7773611111111111,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich war überrascht, muss ich sagen, weil das war auch meine Mein Eindruck, dass ich wahrscheinlich jetzt irgendwo alleine in ein Projekt lande, wo es... Ja, die suchen halt jetzt jemanden, der diesen Legacy-Code irgendwie wartet oder irgendwas auf eine Version anhebt. Aber tatsächlich ist es ein sehr, sehr spannendes Projekt, in dem ich da gelandet bin. Wäre ich aber, glaube ich, auch ohne Recruiter nicht reingekommen. Also, ich glaube, es gibt da schon beides.",
            "start": 2829121,
            "end": 2850565,
            "confidence": 0.7692631578947369,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie gesagt, ich glaube, ich würde da auch wieder die zwei Seiten einfach sehen. Mit Bodyleasing ist es wesentlich einfacher, wenn du einen Fulltime-Job hast, pro Stunde bezahlt wirst, als wenn du selber dich um alles kümmern musst. Aber wie Thomas richtig gesagt hat, wenn du selber Produkte machst oder wirklich ein Unternehmen auch gründen willst, dann hast du ja den Ausblick oder zumindest das Ziel, vielleicht irgendwas zu erschaffen, was dir dann in Zukunft mehr Geld bringt in irgendeiner Form. Also das ist halt das klassische Unternehmertum, wenn du in diese Richtung gehst. Also da sind schon nochmal Unterschiede. Machst du ein Unternehmen, machst du was selbstständig oder bist du ganz klassisch Freelancer, Bodyleasing?",
            "start": 2850845,
            "end": 2886947,
            "confidence": 0.7617913043478259,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wo man natürlich sagen muss, dass wenn du jetzt sagst auf eigene Produkte und ich sag mal Software as a Service oder was weiß ich nicht, irgendwie Plugins verkaufen möchtest, da hast du natürlich ein unglaubliches Upfront-Investment. Das bedeutet, du steckst unglaublich viel Arbeit rein und in der Theorie musst du diese Stunden natürlich auch in deine Arbeit reinrechnen. Und jetzt muss man ganz klar einmal vergleichen, was würde passieren, wenn ihr eure Freelancer-Sache auf 40 Stunden pro Woche limitiert wie ein deutscher Arbeitnehmer und danach den Löffel fallen lasst, den Stift fallen lasst. Der Vergleich wäre ja nur fair. Wenn ihr hustelt, hustelt, hustelt und eure 120 Stunden macht, offengesprochen ist das ja kein fairer Vergleich mit einem Angestelltenverhältnis, wenn man die finanziellen Mittel vergleicht.",
            "start": 2886967,
            "end": 2928333,
            "confidence": 0.7947380952380955,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kommt drauf an, was für ein Angestelltenverhältnis. Also wenn ich als Angestellter auch 120 Stunden die Woche arbeite, würde ich sagen, ist es sogar nochmal ein besserer Vergleich, weil ich ja alles bilden kann, was ich auch arbeite. Aber ich habe schon auch die Rechnung, die ich jetzt hier vorgemacht habe, die basiert tatsächlich auf 160 Stunden im Monat. Wenn ich mehr mache, zum einen muss ich das auch, da ist mein aktuelles Projekt ein bisschen streng, muss ich das auch immer verargumentieren, warum ich mehr mache, dann lohnt sich das ja für mich nur nochmal mehr. Aber so wie Wolfgang gesagt hat, ist es halt einfach, ich habe quasi die faulste Art des Freelancerns. Und die funktioniert für mich sehr gut. Also vor allem als Einstieg, glaube ich, ist das eine super Möglichkeit und da bin ich halt nun mal auch gerade, ja.",
            "start": 2928353,
            "end": 2967756,
            "confidence": 0.7777013888888888,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich glaube, es sind einfach zwei unterschiedliche Welten und je nachdem, in welcher Welt du dich bewegen willst, sind es halt dementsprechend auch andere Verdienste, die du dann hast oder eben Langzeit-Investments. Klar, bei Christian hat jetzt kein Investment in dem Sinne, weil da kann halt morgen gekündigt werden und der wird nicht extrem steigen. Wenn du selber investierst in ein Produkt, ist das was anderes natürlich, auch wenn du eine Anstellung suchst, wo du irgendwie ein Ziel hast, wo du aufsteigen kannst. Es ist natürlich alles schwer zu vergleichen, weil du kannst bei einem Anstellungsverhältnis auch den besseren Job suchen. Und wenn du jetzt, Christian, vielleicht die Monate investiert hättest in das Suchen einer besser bezahlten Anstellung, hätte das vielleicht auch anders ausgesehen. Also dann wäre es vielleicht auch nicht mehr das Doppelte, was du jetzt bekommst. Aber wie gesagt, es ist immer alles schwer zu vergleichen.",
            "start": 2968352,
            "end": 3013373,
            "confidence": 0.7819999999999997,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es kann natürlich aber auch ins Negative umsteigen. Also ich hab einen Bekannten, mit dem hab ich mich unterhalten, der hat sich selbstständig gemacht, der war auch jahrelang angestellt, und nach 5, 6, 7 Monaten sagte der zu mir, ich verdien so viel Geld, der hat auch Bodyleasing gemacht, ich verdien so viel Geld, ich möchte gar keinen Urlaub machen, weil dann kann ich ja die Stunden nicht bilden. Der wurde dann, ich sag mal, von den Dollarzeichen auf seinem Konto ein bisschen geblendet. Apropos Dollarzeichen, schaffen wir mal ein bisschen Wert für Hörerinnen und Hörer. Reden wir mal Tacheles. Was nimmst du pro Stunde? Thomas, was rufst du auf?",
            "start": 3013413,
            "end": 3047095,
            "confidence": 0.7589636363636358,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Soll ich sozusagen anfangen bis jetzt oder aktuell nur?",
            "start": 3047175,
            "end": 3050816,
            "confidence": 0.8611111111111112,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Nee, das ist mal ganz interessant. Wie hast du angefangen und wo bist du jetzt?",
            "start": 3051256,
            "end": 3056619,
            "confidence": 0.7487333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Kann man deinen Stundensatz noch darstellen überhaupt?",
            "start": 3056659,
            "end": 3058580,
            "confidence": 0.8157142857142858,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das sind Phantastrilliarden einfach. Da gibt es gar kein Ausdruck mehr für. Nee, das ist ja, denke ich, eben das Interessante, weil man, wenn man als Freelancer so anfängt, vor allem, wenn man vielleicht noch nicht so viel Berufserfahrung hat, noch nicht so viel Selbstvertrauen in die eigenen Skills, dann verkauft man sich ja schnell Unterwert. Und ich habe beispielsweise angefangen mit meinen ersten Freelance-Shops, da habe ich 40 Euro die Stunde verlangt, was unglaublich wenig ist. Aber ich war happy, dass ich das überhaupt verkaufen konnte. Habe ich erste Websites gebaut und so weiter.",
            "start": 3059277,
            "end": 3088964,
            "confidence": 0.7810736842105263,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Das her? Also nur jahrelang?",
            "start": 3089264,
            "end": 3092466,
            "confidence": 0.7015999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich denke, das ist wahrscheinlich so 2016 gewesen oder so, noch während dem Studium.",
            "start": 3092527,
            "end": 3096289,
            "confidence": 0.6098571428571429,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Da war der Euro auch noch was anderes, muss man auch dazu sagen.",
            "start": 3096309,
            "end": 3099192,
            "confidence": 0.7777692307692307,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Gut, ja, das hat sich sicherlich auch verändert. So viel dann?",
            "start": 3099212,
            "end": 3102935,
            "confidence": 0.8494545454545456,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Also man unterschätzt es, wie viel sich das geändert hat und natürlich auch, was Angestellte verdienen. Wenn du jetzt rechnest, was hat man 2016 verdient, was verdient man heute, wenn man frisch anfängt? das sind schon in der it gerade hat sich da viel getan würde ich sagen.",
            "start": 3102955,
            "end": 3120192,
            "confidence": 0.8347291666666669,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wolfgang das waren damals schon euro nicht mark nur.",
            "start": 3120232,
            "end": 3122737,
            "confidence": 0.7672222222222222,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, Mark kenne ich sowieso nicht. Ich kenne ja nur Schilling.",
            "start": 3123048,
            "end": 3125350,
            "confidence": 0.31309090909090903,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Also damit habe ich so angefangen und dann habe ich das eben mit Skills, die ich mir drauf geschafft habe und der Erfahrung, die ich mir drauf geschafft habe und so weiter Stück für Stück angehoben. Und jetzt je nach Projekt und je nach Dauer des Projekts auch, daran muss man es ja auch ausmachen. Wenn mich jetzt jemand bucht für, keine Ahnung, einen Zeitraum von zweistelliger, dreistelliger Stundenbereich, dann kann man natürlich da auch ein bisschen entgegenkommen und setzt den Stundensatz ein bisschen niedriger an. Und wenn es irgendwie ... kurze, dauernd sind, dann ... ... möchte man halt auch nicht ... ... unter einen bestimmten Stundensatz gehen, ... ... aber es bewegt sich so zwischen ... ... 80 und 100 Euro bei mir.",
            "start": 3125370,
            "end": 3158932,
            "confidence": 0.7866825396825393,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Sind das Zahlen, mit denen du auch ... ... arbeiten kannst, Christian?",
            "start": 3158952,
            "end": 3160752,
            "confidence": 0.6313333333333333,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ist sehr, sehr ähnlich. Ich habe nur ein bisschen höher angefangen ... ... als Thomas, also ... ... ich bin tatsächlich ein bisschen unter 80 ... ... eingestiegen, als ich meinen ersten ... ... Freelancer-Gig irgendwie gefunden habe ... ... und auch Grund darf, also ich habe mir ... ... viel, viel höhere ... ... Vorstellungen gemacht, bin ich auch ehrlich. Ja, ich habe mich mit anderen Freelancern ... ... unterhalten ... ... und da hieß es immer so, ja also unter 100 ... ... fange ich gar nicht an und mit dem Mindset ... ... bin ich auch irgendwie rangegangen. und hab nach Jobs gesucht und hab dann einfach sehr lange gar keine Antworten bekommen. Und dann bin ich immer so Stück für Stück runtergeklettert und bin dann halt quasi unter 80 rausgekommen und hab da dann auch tatsächlich eine Antwort bekommen. Mittlerweile ist es aber so, dass ich eben durch die Erfahrung, die ich mittlerweile gesammelt habe, schon für Projekte eher so 100 Euro die Stunde ansetzen würde. Also es sind ähnliche Hausnummern wie das ...",
            "start": 3161113,
            "end": 3204435,
            "confidence": 0.7476256983240225,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wobei bei dir jetzt ja noch eine Agentur dazwischen sitzt. Also die Agentur ruft dann wahrscheinlich andere Preise auf bei der Firma selbst.",
            "start": 3204445,
            "end": 3211390,
            "confidence": 0.8080869565217391,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Ich wäre natürlich an dieses Projekt nicht rangekommen ohne die Agentur.",
            "start": 3211630,
            "end": 3214412,
            "confidence": 0.7098333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also das muss man natürlich auch sehen. Hat man noch jemanden zwischendrin oder nicht? Und ich glaube, dass auch ein großer Unterschied ist, wie viel du wirklich arbeitest, wenn du jetzt 40 Stunden, 60 Stunden die Woche bezahlt wirst, wo du jede Stunde verrechnen kannst. Ist das was anderes, als wenn du jetzt irgendwie ... ein kleineres Projekt hast oder über recht lange Zeit ein kleineres Projekt mit nur ein paar Stunden oder ein paar Tage, dann kannst du da sicher auch andere Stundensätze aufrufen, weil du ja auch ein anderes Risiko hast, wenn du einen kleinen Auftrag übernimmst. Also da kannst du dann sicher nach oben gehen. Aber ich würde mal auch sagen, so in der Programmierwelt, was ich so gehört habe, was Agenturen verlangen, ist es sicher irgendwo jetzt bei 120 Euro sind es sicher realistische Preise, die Firmen zahlen für Freelancer ganz allgemein, jetzt unabhängig davon, was sie machen. Wenn man natürlich in die Lead-Ecke geht, sind es meistens schon höhere Sätze dann oder klassische Consultants haben natürlich noch höhere Sätze, aber da kommt es auch wieder darauf an, wie viel Berufserfahrung hast du. In welchem Bereich machst du das? Ist das dein Kernbereich? Übernimmst du auch einen anderen Bereich? Wie hart rechnest du die Stunden? Verrechnest du da jede Minute, die du wirklich am Computer sitzt? Oder bist du da flexibler und verrechnest dann quasi einen höheren Stundensatz dafür weniger Stunden, weil du halt jetzt nicht jedes Telefonat sofort aufzeichnest, die zehn Minuten? oder die Anfahrt, wenn du zu einem Kunden fährst oder in der Dusche überlegst oder keine Ahnung. Also da gibt es schon auch nochmal Unterschiede, aber ich würde schon auch sagen, also heutzutage noch unter 80 Euro oder so einen Stundensatz zu haben, ist wahrscheinlich nicht mehr sinnvoll meiner Meinung nach. Und auch wenn man sich jetzt Jobs ansieht, was Angestellte bekommen, wenn man das sinnvoll runterrechnet mit einer richtigen Formel, dann landest du meistens auch bei irgendwo 50 Euro in der Größenordnung und da hast du aber dann die ganzen Benefits noch vom Angestelltenverhältnisse obendrauf, teilweise 60 Euro und die Firma hat ja noch mehr Kosten, die sie da ausgibt für dich. Also man muss das schon immer fair vergleichen und dann wird man irgendwo so bei den 100 Euro, mal so im Großraum 100 Euro aktuell definitiv rauskommen.",
            "start": 3214752,
            "end": 3337966,
            "confidence": 0.8052196382428938,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es wird schon angesprochen, je nachdem, wie man an den Job kommt, ob da irgendwie ein Vermittler zwischenhängt. Kommen wir mal zum Thema Akquise. Wie kommt ihr an eure Jobs? Ich mein, es gibt Plattformen wie Fiverr, Unico, Mach-du-das. Sehr wahrscheinlich find ich auch so was auf eBay-Kleinanzeigen oder in irgendwelchen Facebook-Gruppen. Aber wie kommt ihr an eure Jobs, beziehungsweise viel spannender, wie seid ihr an eure ersten Jobs gekommen? Thomas.",
            "start": 3338286,
            "end": 3364435,
            "confidence": 0.8019999999999997,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Puh, bei den ersten müsste ich jetzt tatsächlich überlegen. Das war ein Mix aus jemand kennt jemand, der jemand kennt, der Websites baut und Vorstellungsgesprächen bei Firmen, bei denen ich am Ende nicht als Angestellter gelandet bin, aber der Kontakt gehalten wurde. Also das war dann quasi so immer wieder bei einem Jobwechsel so eine kleine Akquise Runde, die man da irgendwie gedreht hat bei verschiedenen Unternehmen. Und dann war man irgendwie auf dem Schirm. Und auch wenn es irgendwie Wenn man sich nicht für den Job entschieden hat, war dann trotzdem der Kontakt irgendwie da. Also das waren so die ersten Projekte. Jetzt aktuell schaue ich auch viel auf Plattformen, wobei ich da nicht so viel Erfolg habe, muss ich ganz ehrlich sagen. Also das ist auch ähnlich wie Christian schon erzählt hat, man schreibt viele an, manche Antworten gar nicht. Für vieles bekommt man einfach Absagen, vor allem bei Recruitern. kann ich nur vermuten, dass es vielleicht im Hintergrund so abläuft, dass jeder Recruiter irgendwie so seine Liste an Top-Kandidaten hat, die er immer wieder gut vermitteln kann und weiß, mit dem hat es gut geklappt und der ist gerade verfügbar und so weiter. Und ich glaube, da ist es einfach schon schwierig, in diese Liste reinzukommen. Und man kommt auf diese Liste wahrscheinlich auch erst, wenn man dann halt Irgendwie mal, wenn alle Top-Kandidaten quasi gerade nicht zur Verfügung stehen, und man dann mal ein erstes Projekt bekommt. Also da hab ich tatsächlich nicht so viel Erfolg gehabt. Ansonsten, was ich auch noch probiert habe, als ich eine GbR gegründet habe vor drei Jahren, war viel Kaltakquise. Also wirklich, ich weiß gar nicht, ob man das überhaupt aktuell noch machen darf. Leute anrufen einfach und sagen, hey, brauch dir 100...",
            "start": 3364795,
            "end": 3458282,
            "confidence": 0.835081911262798,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Das ist alles Graubereich.",
            "start": 3458292,
            "end": 3459573,
            "confidence": 0.36225,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Graubereich, ne?",
            "start": 3459593,
            "end": 3460493,
            "confidence": 0.474,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Also wirklich hart Klinken putzen.",
            "start": 3460514,
            "end": 3462015,
            "confidence": 0.8071999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das habe ich auch probiert, ja. Also ich glaube, ich bin da nicht der richtige Typ für, weil ich da zu schnell einknicke, aber es ist halt wirklich so, dass du irgendwie 20 Leute, was wahrscheinlich viel zu wenig ist, also Leute, die im Sales arbeiten, die rufen wahrscheinlich am Tag irgendwie 100 Leute an, wenn nicht sogar mehr, und sind es einfach gewohnt, dass sie abgewinkt werden, aber wenn man da irgendwie 20 Leute am Tag anruft und man bekommt nur Absagen. Das macht einen schon echt fertig. Und dann fragt man sich auch echt so, wozu mache ich das eigentlich? Gehe ich vielleicht nicht lieber einfach wieder in die Anstellung zurück und habe da irgendwie meine Sicherheit? Aber dann macht man doch irgendwie weiter und findet irgendwie seine Wege. Genau. Und das ist halt irgendwie bei mir so ein Mix aus Kontakten zu Altkunden, doch immer mal wieder was bei irgendwelchen Plattformen bekommen. Ja, dann irgendwie auch wieder so Mundpropaganda. Irgendjemand kennt jemanden und der weiß, dass ich das und das baue. Das sind so die Kanäle. Kann man sicherlich optimieren. Bin auch froh über jeden Tipp. Aber wie machen das Christian und Wolfgang?",
            "start": 3462555,
            "end": 3518474,
            "confidence": 0.8158316326530611,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Dann mach ich mal weiter. Es gibt ja diese Plattformen, die du auch schon erwähnt hast. Also Upwork, Fiverr und Co. Da steht dann immer hier, ich baue dir eine App für 70 Euro oder so. Fünf Screens, drei Revisionen. Und das war auch, ich habe am Anfang gedacht, hey, wenn gar nichts läuft, dann melde ich mich da an und dann habe ich mir das mal angeschaut und habe mir gedacht, leck mich am Arsch. Also für, das geht nicht. Für die Preise kann ich das, das geht nicht, das kann ich nicht machen. Und ich finde auch tatsächlich, dass diese Plattformen so ein bisschen den Freelancer-Markt kaputt machen, weil natürlich die ganzen Leute, da gehen halt die Leute hin natürlich, die gar keine Ahnung haben von was das kosten wird und die irgendwie zusammen im Wohnzimmer sich gedacht haben, ich will jetzt eine App haben, dann gehen die auf diese Plattform. Aber es sind halt zum Teil dann schon auch Projekte, die solche Leute irgendwie anstellen, die so ein bisschen dann diesen Freelancer-Markt kaputt machen, den Preis kaputt machen. Weil wenn jemand anderes das für 60 Euro macht, dann ist es halt schwierig zu verargumentieren, warum ich jetzt irgendwie 120 Euro dafür bekommen kann. Ich glaub natürlich schon irgendwie sowieso, dass wir hier in so einem Industrieland bisschen mehr in so führende Rollen gehen müssen in den Projekten, weil die einfachen Programmierarbeiten, die sind natürlich in den Emerging Markets, die sind genauso gut, die Entwickler da, ja? Von daher, warum sollte man denen das nicht bezahlen? Natürlich ist da die kulturelle Barriere irgendwie da, die Kommunikationsprobleme, aber wenn du trotzdem so viel weniger zahlst, dann lohnt sich das, diese Leute anzustellen. Also muss man sich schon noch als ... Also ich glaub, so als einfacher Code-Monkey wird es langfristig schwierig, als Freelancer zu arbeiten. Aber ansonsten kann ich die Erfahrung von Thomas schon auch teilen. Ich war total überrascht, weil ich finde, wenn man nach einer Festanstellung sucht, dann rennen einem die Recruiter ja die Tür ein, ne? Also es ist dann so, jeder schreibt einem und sagt hier, Willst du nicht da arbeiten? Willst du nicht da arbeiten? Und in dem Moment, wo ich dann geswitched habe auf, hey, ich suche hier Contracting-Arbeit, habe ich die angeschrieben und habe nicht mal, weiß ich nicht, ich habe jeden Tag, glaube ich, fünf Projekte angeschrieben und die haben nicht mal wirklich geantwortet. Ich habe dann zum Teil auch festgestellt, dass manche Recruiter Projekte eingestellt haben, die es gar nicht gab, weil ich habe dann mal angerufen und dann haben die irgendwie gemeint, ach, das Projekt, ja, das ist eine Ausschreibung, die gewinnen wir wahrscheinlich gar nicht, weil die wahrscheinlich einfach nur versuchen, ihr Portfolio so ein bisschen oder halt ihren Katalog an Recruitern aufzuhübschen. Das heißt, das ist schon tatsächlich richtig Akquise, die man da machen muss. Man muss jetzt nicht, also ich persönlich musste jetzt nicht wirklich mega viel Arbeit reinstecken. Ich habe meinen Lebenslauf aufgehübscht, ich habe ein Portfolio gebaut und habe das halt einfach an alle Projekte, die irgendwie passen, mit, weiß ich nicht, zwei Absätzen geschickt und habe auf den gängigen Plattformen geschaut, natürlich freelance.de, glaube ich. freelancemap.net oder .de, weiß ich gar nicht. Gulb natürlich ist für iOS leider nicht ganz so gut. Dann gibt es noch Mold, da habe ich auch geschaut. Und was für mich interessant war, weil ich ja auch dachte, ich würde gerne direkt irgendwo landen, war, dass ich auf LinkedIn und auf Twitter gezielt gesucht habe nach iOS Freelance, iOS Contract, aber nicht in den Jobs, sondern in den Posts. Also, was Leute geteilt haben über LinkedIn. Und da findet man auch immer mal wieder echt spannende Projekte. Und da hatte ich auch ein paar Gespräche, die ich theoretisch annehmen hätte könnten. Aber dann ist eben mein aktuelles Projekt dazwischen gekommen. Und das war viel spannender und interessanter für mich.",
            "start": 3518494,
            "end": 3698011,
            "confidence": 0.7813149001536099,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber hast du dann auch Agenturen angeschrieben oder Recruiter?",
            "start": 3698031,
            "end": 3702872,
            "confidence": 0.4161111111111111,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich hab dann zum Teil auch direkt Recruiter angeschrieben. Aber ich meine, die Leute, die auf freelance.de und so posten, das sind eigentlich die Agenturen. Muss man wirklich dazu sagen. Also, für mich war ... Wenn ich direkt an ein Projekt kommen wollen würde, wäre mein Way to go jetzt, dass ich zum einen, das habe ich mal eine Zeit lang gemacht, dass ich mir anschaue, wie dieser Recruiting Text da geschrieben ist, auf freelance.de zum Beispiel, und den einfach mal suche, weil häufig sind die Freelancer so faul, dass sie die Stellenbeschreibung von den Firmen eins zu eins da reinkopieren. Das heißt, man findet dann die Firma, die das eigentlich ausschreibt, darüber.",
            "start": 3702912,
            "end": 3732698,
            "confidence": 0.8099026548672567,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die Frage ist halt, ob die Firma überhaupt dann direkt mit dir kommuniziert und jetzt exklusiv das dann an die Agentur übergeben hat. Aber die konkrete Agentur, für die du jetzt arbeitest oder die dir den Job vermittelt hat, wie hast du die gefunden, über so eine Plattform?",
            "start": 3732989,
            "end": 3746135,
            "confidence": 0.7614583333333335,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die haben mich tatsächlich gefunden, einfach nur über mein Profil auf freelance.de. Ich kann es auch sagen, das ist Computer Futures. Das ist, glaube ich, einer der größten Recruiter. Das gehört zu S3. Die haben natürlich auch alle ihre Plattformen. Wobei, wenn man diese Plattformen anschaut, da fragt man sich, wie die überhaupt IT-Entwickler vermitteln können. Kraut und Rüben, aber genau die haben mich tatsächlich einfach nur über mein Profil gefunden. Also es lohnt sich, diese Profile zu pflegen, auch wenn es wahnsinnig viel Arbeit ist, weil jeder möchte natürlich, dass man das selber einträgt. Aber so ist für mich die Akquise gelaufen und ich dachte auch immer, ich möchte gerne am besten ein privates Projekt ohne Recruiter irgendwie haben. Aber da waren meine Erfolgschancen am Anfang wirklich eher mau.",
            "start": 3746155,
            "end": 3784105,
            "confidence": 0.7968692307692308,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und ich finde deshalb, weil wir ja am Anfang oder am Anfang vorhin darüber gesprochen haben, wie man das mal vergleichen kann mit einer Anstellung. Ich finde, das ist so ein Punkt, wenn du nicht jemand hast, der sich die ganze Zeit um Sales kümmert und da irgendwie Provisionen kassiert und fest mit dir zusammenarbeitet und sich um neue Projekte kümmert und so weiter, ist das halt etwas, was du die ganze Zeit machen musst. Also das kann man sich schon irgendwie fast so vorstellen. wie wenn du in einem Anstellungsverhältnis bist und du musst halt jeden Tag ein paar Stunden oder ein, zweimal die Woche für ein paar Stunden Bewerbungsgespräche führen sozusagen. Und das gehört einfach dazu, denke ich. Das lässt sich schwer vermeiden als Freelancer. Und deswegen kann man das, glaube ich, gar nicht so stark mit so einer Anstellung vergleichen, weil du immer Zeit dafür investieren musst, in der du nicht arbeiten und Geld verdienen kannst aktiv.",
            "start": 3784545,
            "end": 3830136,
            "confidence": 0.8124687500000001,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Was aber natürlich auch cool ist, das zu lernen. Also mir persönlich hat es extrem viel gebracht, auch damals, auch dann in meinen Anstellungsverhältnissen, dass ich die ganze Erfahrung gehabt habe im Projektmanagement. Wie geht man mit Kunden um? Weil Kunden sind ja auch alles andere als leicht. Du musst teilweise Kunden managen. Du musst mit den IT-Abteilungen von Kunden umgehen oder mit den verschiedenen Stakeholdern. Also du lernst das Stakeholder-Management schon sehr, sehr früh als Entwickler und das würdest du sonst wahrscheinlich in einem normalen Arbeitsverhältnis am Anfang gar nicht lernen, was ich schon mit 18 Jahren erlebt habe. Wie verkaufst du was? Wie machst du ein Kundengespräch? Ja, wie stellst du überhaupt was dar? Wie machst du Schätzungen? Wie stellst du ein Projekt auf die Beine? Und, und, und. Also das sind schon sehr coole Learnings, die du da hast und die dir vielleicht dann auch später extrem viel bringen. Ob du jetzt Spaß daran hast, ist nochmal eine ganz andere Sache.",
            "start": 3830456,
            "end": 3881800,
            "confidence": 0.7932195121951221,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das ist, glaube ich, die Schwierigkeit daran.",
            "start": 3881840,
            "end": 3884321,
            "confidence": 0.451875,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Vor allem, umso älter du wirst, hast du vielleicht weniger Lust, dich mit dem ganzen Nicht-Technischen dann auseinanderzusetzen, wenn du ein klassischer Entwickler oder Entwicklerin bist. Ich könnte mir schon vorstellen, dass das ein Problem ist.",
            "start": 3884361,
            "end": 3895187,
            "confidence": 0.7660277777777776,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, oder genau andersrum. Man merkt dann, dass diese Sachen eigentlich einem vielleicht viel mehr Spaß machen als die eigentliche Programmierung.",
            "start": 3895527,
            "end": 3901070,
            "confidence": 0.7837142857142858,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Klar, also ich mache ganz wenig Programmierung, muss ich auch dazu sagen.",
            "start": 3901910,
            "end": 3905772,
            "confidence": 0.6827500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber würdet ihr denn sagen, dass es wahr ist, dass Software-Ingenieure eigentlich wirklich total kacke im Sales sind und ihre eigene Arbeitszeit beziehungsweise ihren eigenen Output meist unter Wert verkaufen?",
            "start": 3905812,
            "end": 3917336,
            "confidence": 0.8496666666666666,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist immer die Frage, ob du Spaß daran hast. Ich glaube, es gibt wahrscheinlich sehr gute, aber ich würde mal sagen, der Großteil hat keinen Spaß daran und wenn du keinen Spaß daran hast, bist du scheiße drin.",
            "start": 3917396,
            "end": 3925920,
            "confidence": 0.6676052631578947,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich wollte eigentlich auch vorhin sagen, was man braucht, um zu freelancen, das habe ich vergessen. Man muss schon auch ein bisschen Bock haben, sich selbst zu vermarkten. Weil das ist schon auch eine wichtige Fähigkeit, dass man irgendwie gut in diesen Gesprächen ist. Das ist auch für mich, ich habe nie ein Problem gehabt in den Gesprächen mit dem Kunden selbst, bis mal mich ein Recruiter einem Kunden vorgestellt hat. schwierige, weil da habe ich kein persönliches Gespräch gehabt. Also ich würde nicht durch die Bank sagen, dass alle Entwickler innen irgendwie schlechter drin sind, sich zu vermarkten. Ich glaube, viele haben da keinen Bock drauf und man muss es halt wie einen Skill auch irgendwie lernen. Und das ist auch anders als in der Festanstellung, weil ich habe das Gefühl, in der Festanstellung ist es so, dass, also alles natürlich anekdotische Erfahrungen, aber dass da die Firmen zum Teil sich ja freuen, wenn Leute sich bewerben und sich so denken, okay, Du bist da, du bist hier, noch zwei weitere Bewerbungen und du hast super wenig Konkurrenz. Im Freelance-Bereich hast du natürlich, weiß ich nicht, wenn du auf LinkedIn guckst, da siehst du ja immer, wie viele Leute sich bewerben. Wenn man jetzt mal die Quatschbewerbungen rauszieht, sind es wahrscheinlich trotzdem noch 20, 30 Leute, die sich auf eine so eine Freelance-Stelle da bewerben und mit unterschiedlichsten Erfahrungen und eben auch mit einem unterschiedlichen Stundensatz und da geht es dann eben nicht um paar tausend Euro, sondern da geht es halt dann vielleicht wirklich und ganz schön große Unterschiede, wenn man das irgendwie hochrechnet. Von daher würde ich jetzt sagen, man muss Bock haben, sich zu vermarkten, ich würde aber nicht pauschal sagen, dass Entwickler schlecht da drin sind. Oder Andi würdest du sagen, du kannst dich schlecht vermarkten. Ich finde mich eigentlich auch, dass du wahnsinnig gut bist.",
            "start": 3926180,
            "end": 4006581,
            "confidence": 0.7621923076923073,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, Andi ist ja kein Entwickler. Andi ist ja Engineering-Manager. Der schreibt mir nur mehr Slack-Messages den ganzen Tag.",
            "start": 4006601,
            "end": 4012963,
            "confidence": 0.5874736842105264,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das Problem ist, zu wissen, was man kann. Und ich denke, das Problem ist, nicht egoistisch rüberzukommen oder als ... ich kann alles gut was man natürlich schon sagen muss ist und das ist glaube ich auch statistisch mehrfach bewiesen wenn man eine sache zum beispiel ios entwicklung für drei vier fünf jahre am stück macht wenn man das professionell macht dann ist man relativ schnell besser als der durchschnitt und theoretisch reicht das ja um sich gut zu verkaufen in dem Bereich. Das Problem ist, glaube ich, was wir als Entwickler alle haben, ist, wir sehen immer, wie toll die anderen sind, wie intelligent die anderen sind, weil die sich mit anderen Fachbereichen beschäftigen und wir deswegen immer denken, uh, der Bereich, in dem ich unterwegs bin, den verstehe ich komplett, der ist ja einfach, aber die Person da drüben, die ist so intelligent, die weiß natürlich auch alles über iOS-Entwicklung. Und das hindert uns dann, glaube ich, so ein bisschen, uns selbst zu verkaufen und selbst zu vermarkten. Das ist, glaube ich, die eine Geschichte. Und dann ist die andere Geschichte, ist, glaube ich, das, was man von außen sieht und den internen Struggle, den man sowieso immer hat. Ich glaube, zumindest das, was ich gelernt habe, minimal zu übertreiben, finde ich völlig in Ordnung. Und man schießt ja nicht übers Ziel hinaus, sondern man challenges sich vielleicht ein bisschen. ich denke aber sehr sehr viele leute verkaufen sich unterwert und ich mich selber auch und ich glaube ich wertschätze meine eigene zeit nicht so wie die zeit von von anderen ich glaube da kann man besser werden und ich glaube man muss aber auch dann akzeptieren dass man ab und zu vielleicht auch übers ziel hinaus schießt und einfach nein bekommt Christian.",
            "start": 4013303,
            "end": 4109447,
            "confidence": 0.8418383838383838,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Wie siehst du das? Sehe ich ganz genauso. Ich habe am Anfang, als ich mich beworben habe auf Projekte, war ich auch total picky. Hatte gesagt, ah nee, hier App-Architektur, Spezialist für App-Architektur bin ich nicht, bewerbe ich mich nicht. Und dann nach zwei, drei Wochen, wo ich nichts gefunden habe, habe ich einfach alles, was irgendwie einigermaßen passt, Einfach beworben, ja. Und dann kriegt man auch eine Menge Absagen, aber ich habe dann sogar eine Liste geführt, also ein richtiges CRM in Anführungszeichen, wo ich irgendwie sehe, mit wem bin ich, an welcher Stelle in dem Prozess und so weiter. Also man muss da schon so auch ein bisschen die Balls haben zu sagen, ich schaue jetzt einfach mal, was passiert, wenn ich mich da bewerbe. Aber was ich auch gelernt habe, ist, dass es manchmal eine Tür öffnet, wenn man sagt, nee, das kann ich nicht. Also ich hatte auch das Projekt, was so nebenher gelaufen ist, da wurde ich auch gefragt, ob ich irgendwie so Animationen, Transition-Kram machen kann. Da habe ich gemeint, das kann ich nicht. Und ich habe das Gefühl, seitdem ich das gesagt habe, will er mich noch mehr. Weil der halt irgendwie Vertrauen, ja, Vertrauen aufgebaut hat. Und ich habe auch, was du gesagt hast mit diesem, hey, ich mache iOS und der da drüben macht irgendwie Backendentwicklung, das geht doch besser. Ich hatte in meinem Lebenslauf am Anfang iOS-Entwicklung und Projektentwicklung stehen und habe quasi keine Antworten bekommen, bis mir irgendwann mein Recruiter gesagt hat, ja, also, was bist denn du jetzt? Bist du ein Projektmanager oder bist du ein iOS-Entwickler? Und seitdem ich, dann hab ich dieses Projektmanager rausgenommen, weil es stand halt sehr prominent unter meinem Namen, und dann kamen die Antworten rein. Also, es ist schon auch echt so, wie du gesagt hast, man muss wissen, was kann ich, und am besten ist, ich schreib da nicht einfach nur rein, ja, ich bin ein hochqualitativer Entwickler, sondern vielleicht so ein bisschen, meine Schiene ist so ein bisschen, ich geh auf Empathie, ja, mir ist Kommunikation superwichtig, ich kann gut mit Menschen, und dass das meine Stärke ist. Aber wenn ich in einem anderen Bereich irgendwie gut wäre, wie in Datenbanken zum Beispiel, ja, Wolfgang, dann würde ich halt versuchen, das auch so ein bisschen rauszustellen, anstatt einfach nur der Standardentwickler zu sein.",
            "start": 4109487,
            "end": 4216881,
            "confidence": 0.7788804071246824,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das wäre dann also eher der Jack of all Trades, den du dann da rausgestrichen hast. Und du hast dich dann durch, ich sag mal, durch das Wegstreichen, auch wenn du das kannst, dich eher, ich sag mal, besser als Spezialist positioniert.",
            "start": 4216921,
            "end": 4228210,
            "confidence": 0.7739285714285715,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, genau.",
            "start": 4228310,
            "end": 4229070,
            "confidence": 0.362,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich glaube, man muss sich einfach auch fokussieren auf irgendeinen Bereich oder zumindestens für die jeweilige Bewerbung, wie man es bei einem normalen CV ja auch macht. Du musst einen Spezialbereich suchen, kannst aber unter Umständen auch dementsprechend anpassen, je nachdem, wo du dich bewirbst. Und viele Firmen suchen zwar einen Spezialisten, aber brauchen eigentlich jemand, der sie umfänglich berät und vielleicht auch ein Netzwerk hat und dann weiterleitet an die jeweiligen Spezialisten und Trotzdem bei den Bewerben oder wenn man mit der Firma spricht, muss man irgendwie als Spezialist in einem gewissen Bereich wenigstens auftreten, üblicherweise.",
            "start": 4229150,
            "end": 4259711,
            "confidence": 0.8105670103092784,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber das, was ich immer so sehe, ich meine, viele Entwickler haben ein sehr breites Spektrum für Themen, die sie interessieren. Und Christian, du hattest ja auch am Anfang gesagt, Ich will an interessanten Projekten arbeiten. Da frage ich mich, ist das nicht ein Konflikt? Auf der einen Seite willst du dich neu challengen, du willst was lernen, aber du darfst dich nicht als Jack of all Trades positionieren. Auf der anderen Seite möchtest du den Luxus haben, nur an Projekten zu arbeiten, die dich interessieren. Aber du musst halt auch Geld verdienen. Also ich meine, Thomas, du machst das jetzt schon seit 5, 6 Jahren. Wie managst du da die Balance zwischen ich muss meine Miete zahlen und Essen auf den Tisch bringen und ich mache Projekte, die mich selbst fordern und die ich wirklich interessant finde?",
            "start": 4259751,
            "end": 4305625,
            "confidence": 0.7761594202898551,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also wie vorhin schon kurz erwähnt, es ist halt tatsächlich so ein bisschen auf und ab und zumindest für mich aus meiner Erfahrung. Und es gibt Situationen und Zeiten, da kann man sich die Projekte aussuchen und hat vielleicht ein paar mehr Anfragen und Sachen in der Pipeline und sagt dann, okay, ich entscheide mich für das, weil das finde ich interessant, da habe ich Bock drauf. Und der Kundenkontakt hat sich auch richtig angefühlt. Das scheint alles zu passen. Und dann gibt es halt Zeiten, wo man so merkt, irgendwie ist nichts in der Pipeline. Ich muss mich mal irgendwie auf die Suche nach neuen Projekten machen. Und dann ist man halt froh, wenn ein Projekt überhaupt bei rumkommt und man wieder was in der Pipeline hat. Und dann muss man halt auch mal was machen, was vielleicht jetzt nicht so viel Spaß macht, aber halt Geld einbringt. Aber ich meine, das ist ja in einem Angestelltenverhältnis, glaube ich, auch nicht sehr viel anders. Es gibt Aufgaben und Projekte, da ist man irgendwie Feuer und Flamme und will gar nicht aufhören und setzt sich irgendwie noch hin und macht Überstunden. Und dann gibt es Projekte, die schiebt man gerne so weit auf wie möglich und macht sie dann halt irgendwie auf den letzten Drücker. Also von daher, so meine Erfahrung ist unterschiedlich, je nachdem.",
            "start": 4306360,
            "end": 4366665,
            "confidence": 0.8207654867256637,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ich glaube, ein guter Tipp ist auch, umso uninteressanter das Projekt ist, umso höher setzt man den Stundensatz an. Und so bekommt man dann entweder wenigstens einen guten Stundensatz, Oder das wird nichts, aber dann hat man wenigstens die Zeit. Und ich glaube, es ist immer besser, die Zeit zu investieren in die Projektsuche oder in den Markenaufbau von sich selber, was es auch immer ist, anstatt irgendwie ein unterbezahltes Projekt anzunehmen, nur damit man irgendwie das Geld bekommt. Das ist zwar kurzfristig klar, fein, wenn man Geld bekommt und teilweise auch nötig, aber langfristig ist es, glaube ich, immer schlecht, uninteressante Projekte und womöglich unterbezahlte Projekte anzunehmen. Also entweder bin ich dann sehr unmotiviert und habe keinen Spaß dran, oder ich bekomme noch vielleicht beide sogar und wenig Geld auch noch. Das ist das Schlimmste dann. Aber langfristig sollte man das, glaube ich, nie machen. Und darum ist meine Devise immer, umso uninteressanter das Projekt, umso höher setze ich den Stundensatz an oder lehne es überhaupt ab. Sogar wenn ich jetzt die Zeit hätte, mir ist die Zeit einfach mittlerweile zu schade und lieber verdiene ich weniger und habe dafür mehr Zeit.",
            "start": 4366705,
            "end": 4430477,
            "confidence": 0.8105492227979274,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich frage mich gerade, wie ehrlich kann man denn da sein? Du hast einen langjährigen Kunden, bei dem chargst du immer, weiß ich nicht, so 100 Euro. Einfach nur mal so. Und dann so, ah ja, ich habe ein neues Projekt. Ja, mein Stundensatz ist jetzt angewachsen auf 190 Euro. Herr Gassler, warum sind sie denn so teuer? Das Projekt ist voll langweilig.",
            "start": 4431125,
            "end": 4447575,
            "confidence": 0.703936507936508,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, bei dem selben Kunden ist es natürlich schwierig. Das ist auf jeden Fall klar. Das macht man auch nicht. Aber üblicherweise kennt man den Kunden dann ja auch, kann das besser einschätzen und kann das vielleicht auch zu einem interessanten Projekt machen. Also ich muss ja auch dazu sagen, es gibt wenig Projekte, die ich wirklich absolut uninteressant finde, weil, wie gesagt, Liegt vielleicht an meiner Persönlichkeit, aber grundsätzlich kann ich fast immer irgendwas Interessantes daran finden. Und es ist selten, dass ich jetzt wirklich irgendwas ablehne, weil ich mir denke, das macht keinen Spaß. Eher, dass ich sage, okay, das ist nicht mein Bereich, da habe ich keine Expertise darin, leite die Leute vielleicht auch weiter. Kommt viel öfter vor, als dass ich sage, okay, da sehe ich jetzt wenig Sinn dahinter.",
            "start": 4448351,
            "end": 4486378,
            "confidence": 0.7889029850746266,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wir haben ja vorhin mal kurz über Fixpreise geredet und was ich interessant finde, also zwischen Fixpreisen und ich berechne über Stundensatz oder Tagessatz, ist bei einem Stundensatz verkaufe ich ja meine Zeit für Geld, logischerweise. Und eine Sache, die auch bei Chris Doe mal erwähnt wurde, in einem Interview auch, vielleicht können wir das irgendwie in die Shownotes packen, fand ich sehr interessant. Da hat einer erklärt, dass als er das eben wahrgenommen hat, ist ihm ein Problem aufgefallen. Und zwar ist er sehr erfahren in dem, was er tut und braucht für viele Dinge viel weniger Zeit durch seine Erfahrung als jemand, der das noch nicht so lange macht. Und das bedeutet, er hat Projekte viel schneller umsetzen können, hat aber trotzdem halt stundensatzbasiert abgerechnet und hat am Ende dann eigentlich weniger verdient als jemand, der weniger Skill hat als er und dann mehr Geld verdienen würde, weil er länger braucht. Und das ist immer so ein bisschen Konflikt, den ich schon auch sehe mit Stundensätzen im Vergleich zu irgendwelchen Fixpreisen. Wie macht ihr das denn, Wolfgang, Christian? Habt ihr die Erfahrung irgendwie auch gemacht?",
            "start": 4486818,
            "end": 4545560,
            "confidence": 0.7937486631016045,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Also ich bin mittlerweile einfach wesentlich besser im Schätzen geworden. Darum traue ich mir bei kleineren Projekten eher mehr Fixpreise zu. Aber ich würde nie bei irgendeinem Projekt, wo es um mehrere Personenmonate oder so geht, einen Fixpreis mittlerweile machen. Ich hatte das teilweise gemacht und wie gesagt sogar mit Freelancer-Teams und habe ziemlich drauf gezahlt und das werde ich sicher nicht mehr in meinem Leben so machen. Also umso größer die Projekte, umso weniger Fixpreis.",
            "start": 4545600,
            "end": 4569490,
            "confidence": 0.8054605263157893,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber ich meine, wegen deiner Expertise und das, was du chargst, da gibt es da so eine schöne Story, die heißt Knowing Where to Tap. Und zwar geht die Story wie folgt, du hast ein riesen Containerschiff und irgendwie ist der Motor kaputt und dann holen die halt so einen unglaublichen Schiffsexperten. Der geht dann zu diesem Motor, schaut sich den an, geht zweimal um den Motorblock, holt dann einen ganz kleinen Hammer aus seinem Köfferchen, macht einmal Klick und der Motor läuft wieder. Zwei Wochen später kriegt der Schiffsbetreiber eine Rechnung von 10.000 Euro. Und sagt so, ruft da an, hören Sie mal, wieso berechnen Sie mir denn jetzt 10.000 Euro? Sie haben doch eigentlich nichts gemacht. Sie kamen an, haben einfach mit dem Hämmerchen draufgekloppt und sind da weiter gegangen. Ja, und zwar sieht meine Rechnung wie folgt aus. Der Schlag bei dem Hammer, 2 Dollar. Zu wissen, wo man schlagen muss, 9.998 Dollar. Und vielleicht kann man, ich weiß nicht, wie wahr diese Story ist, aber ich meine, das ist halt wirklich dann die Erfahrung, die man da mitbringt. Und es geht halt irgendwie schon so ein bisschen in deine Story, von Christo, die du gerade erwähnt hast, Thomas. Vielleicht sollte man da einfach mit gesundem Bewusstsein reingehen. Also These, ja?",
            "start": 4570273,
            "end": 4637205,
            "confidence": 0.7567102803738316,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin kein Freelancer, alles Theorie.",
            "start": 4637245,
            "end": 4640409,
            "confidence": 0.6490000000000001,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ich würde das so machen und wenn ich dann in der Situation wäre, bin ich dann eher wie Christian und lasse mich runterhandeln. Nee, keine Ahnung. Aber ich finde die Analogie halt schön.",
            "start": 4640449,
            "end": 4649856,
            "confidence": 0.7699090909090908,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, absolut. Ja, ist genau das Thema eigentlich.",
            "start": 4649876,
            "end": 4652357,
            "confidence": 0.6897500000000001,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Was mir aber auch noch unter den Fingernägeln brennt, ist, im Angestelltenverhältnis arbeitet man in einem Team. In einem Team lernt man auch sehr viel. Man nimmt sehr viel mit von anderen. Aber je nach Freelance-Arbeit ist man ja oft auf sich gestimmt. Und ich sag mal, Thema Weiterbildung und am Ball bleiben liegt ja dann auf deinem Tisch. Ist das ein reales Problem für euch? Oder sagt ihr, nee, in den Projekten, in die ich involviert bin, lerne ich immer so viel, dass ich automatisch am Ball bleibe? Christian, wie machst du das in deinen letzten sechs, sieben, acht Monaten?",
            "start": 4652377,
            "end": 4680986,
            "confidence": 0.8046534653465351,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, also bei mir war's tatsächlich so, dass ich, nachdem ich gekündigt hatte, also ich hab auch gekündigt, ohne was Neues zu haben. Also ich hatte noch kein bestehendes Projekt, weil meiner Erfahrung nach, oder ich hab wirklich versucht, was Neues zu finden, aber mit drei Monaten Vorlauf, da findet man einfach nix. Also ich hab das Gefühl, es ist immer so ein Monat, vielleicht sogar nur zwei Wochen Vorlauf, Und da hab ich natürlich so ein bisschen Hummeln im Hintern gehabt, dass ich da was Neues finde. Und nachdem ich die ganzen Projektbeschreibungen gelesen hab, hab ich mir auch so ein bisschen gedacht, oh, das kann ich irgendwie vielleicht ja gar nicht alles so richtig. Das heißt, ich hab dann irgendwann angefangen, die ersten eineinhalb, zwei Stunden am Tag tatsächlich für Weiterbildung mit reinzustecken. Und das hat sich für mich auch natürlich angefühlt, weil ich ja irgendwie diesen Druck hatte. Mittlerweile ist es auch nicht mehr so krass. Aber ich hab schon das Gefühl, dass seitdem ich Freelancer bin, dass ich durch diese Weiterentwicklung, also durch dieses, dass ich mir immer zwei Stunden am Tag für mich selbst genommen hab, dass ich eine extrem steile Lernkurve hatte und mich allein in diesen acht Monaten so viel weiterentwickelt hab wie, weiß ich nicht, in den letzten zweieinhalb Jahren. Natürlich, wenn man halt einfach in seinem Job eingesessen ist, dann wird die Lernkurve natürlich immer flacher. Deswegen ist jeder Wechsel bringt erst mal diese Steigung. die ich da erfahren habe. Ich würde aber schon sagen, dass ich mittlerweile auch einfach durch das Projekt, was ich habe, hängt natürlich auch wieder total davon ab, wo bin ich. Ich habe jetzt das Glück, dass ich in einem Projekt bin mit vielen anderen Entwicklern, die alle eigentlich oder viele davon sind erfahrener als ich. Und es ist auch eine ganz andere Art von Projekt, mit der ich bis jetzt gearbeitet habe, dass ich dadurch eigentlich jeden Tag neue Dinge lerne und dass ich jetzt gar nicht mehr so krass den Drang habe, mir noch was anderes drauf zu schaffen. Trotzdem ist es so, dass ich mir immer als Ziel setze, jeden Tag so eine halbe Stunde irgendwie für meine eigene Weiterbildung reinzustellen in meinen Kalender. Also irgendwie mal ein Video angucken oder einen Artikel lesen und so weiter. Also ich glaube, man muss schon so ein bisschen Bock haben, was zu lernen weil das natürlich auch es ist auch so ein bisschen so ein akquise thema ich will mitreden können wenn mich jemand was zu dem thema frag ich muss irgendwie up to date bleiben ich kann nicht in der technologie weiterarbeiten, in der ich irgendwie ja mit der ich angefangen habe sondern ich muss up to date bleiben ich werde ja auch zum teil gekauft, damit ich ein Projekt voranbringen kann. Und das ist zum Beispiel auch eine coole Sache, die ich habe, dadurch, dass ich mit anderen Freelancern zusammenarbeite. Ich habe das Gefühl, wir sind total am Zahn der Zeit. Obwohl das so ein großes Projekt ist, weil die haben alle Bock, mit dem neuesten Scheiß zu arbeiten. Ist auch nicht nur gut für das Projekt, auch nicht unbedingt. Aber wir haben dadurch halt, ja, also ich habe das Gefühl, ich lerne dadurch halt extrem viel und meine Lernkurve ist eigentlich nur steiler geworden, seitdem ich Freelancer bin.",
            "start": 4681267,
            "end": 4825527,
            "confidence": 0.7934838129496407,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also vielleicht, um das schnell zu beantworten, nachdem ich ja sehr viel Beratung mache, zahlen mich die Leute ja, dass ich ja sehr breites Wissen habe und teilweise eben nur ein, zwei, drei Stunden, aber dann intensiv, was man machen kann, wo man eben mit dem Hammer auf diesen Motor schlagt, wenn man das in Andis Bild setzen will. Und daher wird natürlich eigentlich mein Wissen bezahlt und daher ist Wissen recht wichtig, würde ich mal sagen, und muss mich fortbilden und die Fortbildung wird dann halt nicht bezahlt. Dafür wird die Stunde vielleicht besser bezahlt. Insofern ist es schon sehr wichtig und ich kann es nicht einfach in Projekten lernen, obwohl ich da natürlich auch viel lerne, aber Ich könnte nie 100 Stunden so verrechnen. 100 Prozent. Das wäre nie möglich.",
            "start": 4826207,
            "end": 4872137,
            "confidence": 0.8117121212121214,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ähnlich bei mir auch. Durch die verschiedenen Projekte, die ich immer wieder mache, lerne ich einfach viele verschiedene Sachen auch dazu und erweitere da irgendwie immer meinen Horizont. Früher habe ich zum Beispiel, also ich habe ja angefangen mit der Frontend-Entwicklung. Mittlerweile bin ich auch mit dem Backend gut vertraut und habe mich beispielsweise ja auch sehr intensiv in den letzten Jahren in das System Shop R6 eingearbeitet. Und solche Sachen kommen immer wieder und die Lernkurven bleiben, glaube ich, gut steil und interessant. Und ja, wenn man Bock auf Programmieren hat, dann bildet man sich wahrscheinlich sowieso irgendwie immer auch selbst weiter.",
            "start": 4872157,
            "end": 4907043,
            "confidence": 0.8338349514563106,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ist das der Grund, warum ihr und Wolfgang vielleicht einen Podcast macht? Dass ihr euch immer dann zwingt, regelmäßig in neue Sachen wieder reinzugehen?",
            "start": 4907243,
            "end": 4914087,
            "confidence": 0.8219166666666665,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, eindeutig. Also ich sehe den Podcast schon als Fortbildung und nehme mir auch gerne die Zeit. Macht Spaß, aber ich kann natürlich davon profitieren, ganz klar.",
            "start": 4914487,
            "end": 4922912,
            "confidence": 0.7861851851851852,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, absolut auch, ja. Ich habe zwar immer noch keinen Plan von iOS-Entwicklung, aber ... Vielleicht kann Christian mir das beibringen.",
            "start": 4923338,
            "end": 4931301,
            "confidence": 0.7726190476190476,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Seit 60 Folgen versuche ich das.",
            "start": 4931341,
            "end": 4933182,
            "confidence": 0.6523333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau. Wir machen einfach so ein Format, du bringst mir iOS-Entwicklung bei. Nee, aber also klar, das ist halt eines von vielen neuen, verschiedenen Dingen, die man irgendwie immer nebenbei so macht.",
            "start": 4933202,
            "end": 4944047,
            "confidence": 0.7668124999999999,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ich glaub, es ist eher ein Symptom tatsächlich als ein Ausleber. Also, eher weil wir Bock haben auf neue Sachen, machen wir den Podcast. Der Podcast ist nicht die Art und Weise, wie wir neue Sachen lernen.",
            "start": 4944467,
            "end": 4956856,
            "confidence": 0.7273243243243245,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Spannend, spannend, spannend. Ich glaub, das Thema ist noch unendlich groß, weil es gibt, glaub ich, noch so viel zu besprechen. Work-Life-Balance haben wir teilweise ein bisschen angerissen. Dann die ganze Steuerthematik ist, glaub ich, für den einen oder anderen auch mal so eine Kopfhürde. Kompliziert ist das eigentlich in deutschland oder in österreich dann vielleicht gewerbeanmeldung oder wirklich frei berufler stichwort katalogberuf und so weiter und so fort ich denke da kann man auch noch ewig drüber sprechen diese podcast folge kommt aber jetzt zu einem ende und bevor wir jetzt hier wirklich sense machen, würde ich euch noch einzeln fragen, habt ihr noch irgendwas, was ihr den Hörerinnen und Hörern mitgeben wollt? Und da fange ich mit dem Wolfgang an, weil sonst jede Engineering-Podcast-Episode mit dem Wolfgang endet. Und das wollen wir diesmal nicht.",
            "start": 4956916,
            "end": 5012195,
            "confidence": 0.8405073529411762,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich möchte gleich einhaken, was du gesagt hast, die ganzen steuerlichen Dinge und so weiter, die man sich viel, viel komplizierter vorstellt. Auch das Risiko, was man hat, haben wir eben besprochen. Und daher würde ich einfach sagen, jeder, der sich überlegt, irgendwie vielleicht mal sowas zu machen, auf jeden Fall versuchen. Einfach ausprobieren. Es gibt weniger Risiko, als man denkt. Auch das ganze Steuerliche und so weiter ist weniger kompliziert, als man denkt. Das ist ein super kleiner Teil von dem Ganzen. Da gibt es viel wichtigere Dinge. Also einfach mal ausprobieren. Man hat bei uns in Europa dieses, oder zumindest in Deutschland, Österreich, Bremen, dieses soziale Netz. Es kann nichts passieren. Wir in der IT finden super schnell einen Job wieder. Also einfach mal loslegen.",
            "start": 5012615,
            "end": 5050957,
            "confidence": 0.8140390624999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Thomas.",
            "start": 5051578,
            "end": 5052439,
            "confidence": 0.804,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wolfgang hat ja allen Zuhörern und Zuhörerinnen schon die Angst genommen, das mal auszuprobieren. Deswegen brauche ich da nicht noch einhaken. Ich würde sagen, weiterhin schön Engineering Kiosk hören und dranbleiben und vielleicht auch mal bei Index out of Bounds vorbeischauen, wenn ihr es nicht schon gemacht habt. Und vielen Dank fürs Zuhören von meiner Seite.",
            "start": 5052479,
            "end": 5069637,
            "confidence": 0.7548035714285714,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Christian, was gibst du unseren Hörerinnen und Hörern noch mit?",
            "start": 5069900,
            "end": 5072382,
            "confidence": 0.1862,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Es wurde alles gesagt. Ich möchte mich auch ganz herzlich bei euch bedanken. Ich würde jetzt noch gern als Abschluss, wir haben so viel über Freelance gesprochen. Andi, deine zwei Sätze, warum du dir das alles anhörst und trotzdem grinst und dir denkst, nee, Freelancen mach ich nicht.",
            "start": 5072402,
            "end": 5084410,
            "confidence": 0.7574583333333337,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also das Riesenproblem ist, ihr habt mich jetzt hier in so ein Dilemma gebracht. Auf der einen Seite, ihr verkauft das alles allzu einfach. Aber ich glaube, unten drunter ist ja schon wirklich eine harte Nuss an Arbeit. Warum bin ich kein Freelancer? Ich denke, ich hätte die technischen Skills als Freelancer zu arbeiten, aber auf der einen Seite bin ich einfach eine Schissbuchs. Also das bedeutet, ich weiß nicht warum und ihr habt das ja auch bestätigt. Ich male mir den Worst Case aus, obwohl der Worst Case eigentlich genau das ist, was ich jetzt gerade habe, eine Festanstellung. Deswegen ist das eigentlich Schwachsinn. Aber was ich mir auch noch einbilde, ist, dass ich in einem Arbeitsumfeld auf einem Scale arbeite, für einen Datenbank-as-a-Service-Provider, wo ich gerade noch wirklich unglaublich viel lerne. Nicht nur auf technischer Seite, sondern auch auf menschlicher Seite, weil wir arbeiten wirklich weltweit komplett remote. Ich bin jetzt im zweiten Jahr komplett remote arbeiten. Das hat auch sehr viel mit mir gemacht und wirklich mit weltweit verteiltem Teams arbeiten und dann wirklich die Schwierigkeit automatisiert Datenbank zu hosten und das ist schon eine Herausforderung und da bin ich mir wirklich nicht sicher, ob ich an solch spannende Projekte in meinen ersten drei bis vier Jahren Freelancertum kommen würde. Deswegen bilde ich mir ein, dass ich da noch eine ganze Menge lernen kann.",
            "start": 5084991,
            "end": 5162595,
            "confidence": 0.8209647577092514,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Sehr guter Punkt, Andi. Verstehe ich komplett.",
            "start": 5162695,
            "end": 5164356,
            "confidence": 0.18571428571428572,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, absolut.",
            "start": 5164376,
            "end": 5165176,
            "confidence": 0.4205,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ich auch.",
            "start": 5165236,
            "end": 5166417,
            "confidence": 0.72,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Festanstellung ist für mich jetzt auch.",
            "start": 5166437,
            "end": 5167898,
            "confidence": 0.7228333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Nein, Spaß. Jetzt auch zu einem.",
            "start": 5167938,
            "end": 5172080,
            "confidence": 0.5398333333333333,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Ich finde das auch komplett okay, da hin und wieder zu wechseln. Hin und her habe ich ja auch gemacht und schließe sie auch nicht aus für die Zukunft. Kommt auf das Projekt drauf an, auf die Anstellung. Und ich glaube, das ist ja keine Entscheidung, die man dann für sein Leben trifft, sondern man kann da durchaus hin und her wechseln.",
            "start": 5172120,
            "end": 5185586,
            "confidence": 0.7996451612903226,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich suche mir jetzt auch den Nächsten, der dabei ist als Service Provider und bewerbe mich da.",
            "start": 5185806,
            "end": 5189528,
            "confidence": 0.5458888888888889,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Vielen lieben Dank, Christian. Vielen lieben Dank, Thomas, dass ihr euch die Zeit genommen habt. Vom Wolfgang erwarte ich das, weil er.",
            "start": 5191446,
            "end": 5197996,
            "confidence": 0.7741363636363636,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist natürlich Podcast-Host hier.",
            "start": 5198016,
            "end": 5199698,
            "confidence": 0.574,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber ich möchte mich auch bedanken bei Thomas und Christian. Definitiv danke. Und auch danke für den Index-Out-of-Bounds-Podcast, den ich auch sehr gerne höre. Und schwere Empfehlung für alle, die Engineering-Kiosk schon satt haben und an die Stimme und meine Stimme. Schaut mal dort vorbei, ist echt gemütlich und ist schön einfach zum Zuhören, angenehm zum Zuhören. Vor allem, was ihr für Interna ausplaudert, finde ich sehr cool.",
            "start": 5199738,
            "end": 5221778,
            "confidence": 0.7847941176470588,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Damit, denke ich, wurde alles gesagt. Ich hoffe, alle Leute hatten Spaß. Wenn ja, bitte weiterempfehlen und auch bitte den Index-out-of-Bounds-Podcast weiterempfehlen. Ansonsten würde ich sagen, sehen wir uns bei der nächsten Episode. Tschüss, viel Spaß.",
            "start": 5221818,
            "end": 5234567,
            "confidence": 0.7535555555555559,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ciao.",
            "start": 5235123,
            "end": 5235303,
            "confidence": 0.15,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielen Dank.",
            "start": 5235323,
            "end": 5236786,
            "confidence": 0.40449999999999997,
            "channel": null,
            "speaker": "D"
        },
        {
            "text": "Dankeschön. Ciao. Ciao.",
            "start": 5237007,
            "end": 5239972,
            "confidence": 0.455,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und nicht vergessen, Schulungen im Bereich der Webentwicklung gibt es bei unserem Episodensponsor workshops.de. Link in den Shownotes.",
            "start": 5240012,
            "end": 5246866,
            "confidence": 0.8657222222222222,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7930513180197523,
    "audio_duration": 5247.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}