{
  "language_code": "de",
  "audio_url": "https://audio1.redcircle.com/episodes/4e365934-8578-45ca-8c48-61afefa4185a/stream.mp3",
  "punctuate": true,
  "format_text": true,
  "dual_channel": false,
  "webhook_url": null,
  "webhook_auth_header_name": null,
  "webhook_auth_header_value": null,
  "audio_start_from": null,
  "audio_end_at": null,
  "word_boost": [],
  "boost_param": null,
  "filter_profanity": false,
  "redact_pii": false,
  "redact_pii_audio": false,
  "redact_pii_policies": null,
  "redact_pii_sub": null,
  "speaker_labels": true,
  "speakers_expected": 2,
  "content_safety": false,
  "content_safety_confidence": null,
  "iab_categories": false,
  "custom_spelling": null,
  "disfluencies": false,
  "sentiment_analysis": false,
  "auto_chapters": false,
  "entity_detection": false,
  "summarization": false,
  "summary_model": null,
  "summary_type": null,
  "auto_highlights": false,
  "language_detection": false,
  "speech_threshold": null,
  "id": "6201t1af79-d8d5-4c94-96fa-40e8761e333a",
  "status": "completed",
  "error": null,
  "utterances": [
    {
      "text": "Leute im Tech-Bereich werden oft als Knowledge-Worker bezeichnet. Und es gibt auch noch diesen Mythos, dass im Team jeder alles wissen muss, damit jeder alles übernehmen kann. Bis heute bin ich mir gar nicht sicher, ob dieser Zustand jemals erreicht wurde. Dennoch ist das Teilen von Wissen wichtig. Schon allein, um sich selbst als Blocker aufzulösen oder den sogenannten Boost-Faktor nach oben zu treiben. In dieser Episode machen wir mal eine kleine Tour durch die verschiedenen Knowledge-Sharing-Formate. Hackathons, Coding-Challenges, interne Konferenzen und Guilds, Bookclubs und Co. Was bringt wirklich was? Wie viel Aufwand ist es, sowas am Leben zu halten? Wer sollte das organisieren? Und wie sieht's aus mit der Balance zwischen Contributor und Information-Lurker? Und was passiert eigentlich, wenn solche Events zu inflationär genutzt werden? Wir teilen unsere Erfahrungen und worauf es besonders ankommt, wenn du etwas ähnliches in deiner Firma starten möchtest. Los geht's!",
      "start": 4257,
      "end": 59530,
      "confidence": 0.8505821917808217,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Andi, was ist das coolste Meetup, das es so in Europa gibt? Dir ist klar, dass jetzt nur eine richtige Antwort sein kann.",
      "start": 59570,
      "end": 65473,
      "confidence": 0.7433913043478261,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hoffe, es ist irgendein Meetup in Spanien, wo die sich abends bei der untergehenden Sonne treffen und wirklich Tapas essen. Ich hoffe nicht, dass das coolste Meetup jetzt irgendein Tech-Meetup ist, weil ich denke, es gibt noch viele schöne Dinge, die man machen kann. Oder man geht zusammen wandern und knallt sich irgendwie so ein paar Bierchen oben auf der Alm rein. Könnte ich mir auch als cooles Meetup vorstellen.",
      "start": 65533,
      "end": 83803,
      "confidence": 0.7554929577464788,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Es war jetzt deine Chance gewesen, dein Düsseldorf Meetup zu bewerben, das Web Engineering Meetup.",
      "start": 84189,
      "end": 89673,
      "confidence": 0.6352,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der Podcast ist ja geografisch unabhängig, deswegen, na natürlich, Düsseldorf ist eine schöne Stadt, Duisburg ist auch eine unglaublich schöne Stadt und da gibt es auch ein paar tolle Meetups, aber ich will ja nicht das FOMO-Gefühl von Leuten wecken, dass sie ja etwas verpassen könnten auf diesem Web Engineering Meetup, was jeden Monat stattfindet, wo natürlich unglaublich gute Talks gemacht werden. Und wo natürlich jetzt auch schon zum Beispiel jetzt über das Cup-Theorem gesprochen wird oder über Analytics-Pipelines auf AWS, über Time-Series-Databases und so weiter und so fort. So, Wolfgang schläft hier schon in dem Videocall ein. Deswegen, ich denke, dass jede schöne Stadt ein tolles Meetup hat. Politische Antwort Ende.",
      "start": 89693,
      "end": 127365,
      "confidence": 0.7981785714285714,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Du hattest schon recht mit dem Wandern. Es geht natürlich um die Alpen und wir haben ja unser tolles Engineering Kiosk Alps Meetup, das gerade kürzlich stattgefunden hat, wieder vor ein paar Tagen, und da hatte ich wirklich ein sehr cooles Erlebnis. Wir haben das ja erst kürzlich gestartet, vor ein paar Monaten, und auch so mit der Idee, wieder ein Meetup einzuführen, weil es gibt ja irgendwie eigentlich sehr wenige Meetups. Seit Corona sind Meetups ja fast ausgestorben. Wann habt ihr begonnen mit eurem Meetup wieder?",
      "start": 128080,
      "end": 153353,
      "confidence": 0.7551839080459771,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nach corona auch erst dieses jahr wieder weil vorher die planung echt so ein bisschen unsicher war da gab es die ganze zeit lang okay musst du masken tragen musst du nicht alle leute waren noch so ein bisschen unsicher wie die sich in größeren menschengruppen verhalten sollen ausreden ausreden deswegen haben wir sehr lange gewartet weil wenn du sowas schon in deiner freizeit organisiert dann sollte es ja schon auch ein bisschen safe sein Du solltest da nicht vom Start abhängig sein, wie die heute und morgen entscheiden. Deswegen, glaub ich, im April 2023 haben wir wieder gestartet. Also fast drei Jahre Pause.",
      "start": 154002,
      "end": 183448,
      "confidence": 0.7536153846153849,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und irgendwie haben wir eigentlich diese menschlichen Meetups, also nicht online, sondern wo man halt wirklich Menschen trifft, ziemlich vermisst. Oder wie man bei uns in Österreich sagt, sie sind mir abgegangen. Um gleich mal dir wieder ein Wort beizubringen. Auf jeden Fall haben wir das letzte Mal geschafft, dass der Raum überfüllt war. Und man würde ja meinen, dass eigentlich so ein überfüllter Raum irgendwas Unangenehmes ist. Und keine Ahnung, vielleicht bin das nur ich, aber da entsteht einfach sofort eine ganz andere Stimmung. Wenn da einfach so ein überfüllter Raum gemeinsam bei einem Talk Spaß hat, lachen kann, das Networking irgendwie funktioniert, so gewisse Nähe auch sein muss, weil einfach der Raum überfüllt ist. Ich habe das bisher noch nie erlebt in irgendeinem Raum, der halb leer ist. Das ist einfach Ein sehr gutes Gefühl, meiner Meinung nach, und es hat mich auch sofort daran erinnert an einen Talk oder an ein Format, das du mal gegeben hast bei einer internen Konferenz, und zwar mit einem Jeopardy-Game. Der Raum war auch komplett überfüllt, es war geniale Stimmung, es wurde gemeinsam gelacht. Und meiner Meinung nach ist es einfach so, dass man das in einem Online-Meeting oder so einem Online-Format einfach nicht hinbekommt.",
      "start": 183488,
      "end": 246294,
      "confidence": 0.8260049019607842,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hole mal alle anderen ab, die nicht wissen, wovon Neverfong spricht. Und zwar ging es damals bei diesem Jeopardy um das Spiel aus den 90er-Jahren, was durch die Fernsehgeräte gestreamt wurde, aus Amerika, aus Deutschland, überall. Wo, für die Leute, die das Spiel nicht kennen, es wird die Antwort auf dem Bildschirm gezeigt, und der Kandidat muss die Frage erraten. Also eigentlich andersrum, kein klassisches Frage-Antwort-Spiel, sondern ein Antwort-Fragen-Spiel. Und was wir gemacht haben ist wir haben uns große rote buzzer gekauft drei gehäuse dafür 3d gedruckt also wirklich hardware.",
      "start": 246714,
      "end": 281327,
      "confidence": 0.8344505494505496,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wir reden wir sprechen jetzt von hardware und nicht irgendwas virtuellen. Andi hat gebastelt.",
      "start": 281367,
      "end": 286611,
      "confidence": 0.7515,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Der Lars hat eine kleine Patine gebastelt wir hatten noch ein Raspberry Pi über haben Python Software geschrieben haben irgend so eine React App. Auf GitHub gefunden haben wir ein bisschen dran rumgehackt, dass die Signale vom Buzzer dann auch wirklich Mausklicks in der React-App sind und so weiter und so fort. Und im Endeffekt war es dann 45 Minuten oder 60 Minuten Talk auf einer Konferenz, wo wir natürlich dann die Fragen und Antworten und Kategorien sehr technisch machen konnten oder vielleicht sogar irgendwie firmenspezifisch oder, oder, oder. Haben wir zum Beispiel so was wie HTTP-Status-Codes Einfach mal eine ganze Kategorie, die hatte sich Hello World genannt, und da haben wir Hello Worlds in verschiedenen Sprachen, in verschiedenen Programmiersprachen dargestellt, und dann musstest du sagen, was ist Ruby oder ähnliches. Und so was kommt natürlich sehr gut an, weil das natürlich was anderes ist als ein klassischer Präsenzvortrag, wo jemand vorne steht, 48 Slides durchklickt, und jeder ist ... jeder ist still, wenn Jeopardy Game natürlich Engagement hat. Und ja Wolfgang, wie du sagtest, Remote-Meetups, also Online-Meetups, finde ich ebenfalls schwierig. Der Grund ist ganz einfach, nur du sprichst so ein bisschen ins Void rein. Also du kriegst ja kein Networking in einem Zoom-Call mit 50 Leuten hin. Und das ist irgendwie, ja, zu distanziert. Ich meine, jeder sitzt zu Hause oder weiß ich nicht, wo die Leute sitzen. Auf der anderen Seite ist es natürlich auch so, speziell zu dem Zeitpunkt, wo die ganzen Remote Meetups online kamen, ja, saß sowieso jeder zu Hause wegen Corona. Das bedeutet, du hast schon acht Stunden vor dem Rechner gesessen. Da warst du ja primär froh, weg vom Rechner zu kommen. Denn während der Corona-Zeit hatte ich so wirklich das Gefühl, die Leute haben den Wert von physikalischem Wechsel von Meetingräumen in Büros wertschätzen gelernt. Weil dieses Aufstehen, Laufen, du gehst nochmal kurz in die Küche, ziehst dir einen neuen Kaffee, gehst weiter, auch wenn es wirklich Back-to-Back-Meetings sind, du entkoppelst deinen Kopf vom vorherigen Meeting, holst dir einen neuen Kaffee und bist frisch im neuen Meeting. Und bei Corona war das so, ich gehe aus einem Google Meet raus und springe ins nächste Zoom.",
      "start": 286631,
      "end": 415808,
      "confidence": 0.7944670329670328,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und darum soll es heute über interne Knowledge-Sharing-Formate gehen und die Organisation von denen, weil Andi und ich haben eigentlich schon relativ viele Formate organisiert, sei es Hackathons, interne Konferenzen, Reading Groups, Discussions, Panel Discussions. Also da haben wir eigentlich schon relativ viel gemacht und haben am Weg auch sehr viel gelernt, was man beachten muss in der Organisation. Und da wollen wir einfach ein bisschen aus unserer Erfahrung erzählen. Und ich glaube, da sind ein, zwei Punkte auch dabei, die man sehr gut in der Praxis dann anwenden kann. Und ich hoffe mal, dass in Zukunft einfach mehr Leute auch wieder physikalische Events machen, intern oder extern. Und vielleicht kann man da auch die eine oder andere Information dann dementsprechend anwenden. Werbung.",
      "start": 416208,
      "end": 458162,
      "confidence": 0.8199268292682925,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eine einfache umzusetzende Alternative zu internen Knowledge-Sharing-Events sind die erstklassigen deutschsprachigen Schulungen, die von unserem heutigen Episodensponsor Workshops.de angeboten werden. Egal ob du dich für Angular, React, Vue.js, Springboot, Docker, Security, Data Science oder einfach für die Grundlagen von HTML, CSS, JavaScript und Typescript interessierst. Workshops.de bietet ein breites Spektrum an hochwertigen Schulungen. Du hast die Wahl. Du kannst einen einzelnen Platz in den Remote-Schulungen buchen oder du investierst in maßgeschneiderte Inhouse-Schulungen, die speziell auf die Anforderungen deines Unternehmens zugeschnitten sind. Ein besonderes Angebot von Workshops.de sind die sogenannten Lifetime-Schulungen. Das sind Videotrainings inklusive wöchentlichen Livecalls mit erfahrenen TrainerInnen, Musterlösungen, regelmäßigen Updates und uneingeschränktem Zugang zu allen Lernmaterialien. Du bestimmst dein Tempo und behältst lebenslang Zugriff auf sämtliche Ressourcen. Schließlich wissen wir alle, dass im Leben manchmal etwas dazwischenkommt. Alle Infos auf workshops.de oder in den Show Notes. Werbung Ende.",
      "start": 460062,
      "end": 523446,
      "confidence": 0.8234428571428573,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber, bevor wir da ins Thema einsteigen, hat der Andi jetzt etwas zu beichten.",
      "start": 523525,
      "end": 528170,
      "confidence": 0.8382142857142857,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin mir gar nicht sicher, ob ich was zu beichten habe, aber ich.",
      "start": 528210,
      "end": 530732,
      "confidence": 0.7478571428571428,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wurde freundlicher... Nein, nein, natürlich hast du was zu beichten. Dank eines Hörers, der Tobias, der hat bei uns in Discord festgestellt, dass Andis Lieblingsaussage, dass die DIN-Norm ja doppelt gemoppelt ist, weil den ja schon das Gnome im Namen hat und mir immer vorgehalten hat, seit keine Ahnung wie viele Episoden schon. Danke Tobias. Tobias hat festgestellt, es ist absolut korrekt, den Gnome zu sagen.",
      "start": 530772,
      "end": 554553,
      "confidence": 0.8178181818181817,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist richtig und ich danke auch Tobias. Ich habe wirklich was gelernt und ich mag ja so Trivia wissen, weil auf dieser Ebene zu klug scheißen, das ist so richtig Wie soll ich sagen unangenehm ja so richtig richtig schön hier so aber für alle was ich immer gesagt habe die die norm ist doppelt gemoppelt weil die die abkürzung für deutsche industrie norm ist und die norm würde dann bedeuten deutsche industrie norm norm. So ähnlich so wie PIN-Nummer, ja? Wo die PIN-Nummer entsteht, natürlich dann auch für Nummer. Aber, was der Tobias jetzt gefunden hat, beziehungsweise mich darauf hingewiesen hat, ist folgendermaßen. Die Abkürzung DIN steht für das Deutsche Institut für Normung. Also, es ist wirklich ein EV. Und somit wäre dann eigentlich eine DIN-Norm eine Standardisierung, also eine Norm, laut des Deutschen Instituts für Normung. Ist auch so ein kleiner Zungenbrecher. Deswegen ist DIN-Norm korrekt. Jetzt aber. Aber.",
      "start": 554614,
      "end": 613054,
      "confidence": 0.8405555555555558,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, du wärst nicht Andy, wenn du nicht irgendeine Ausrede hättest.",
      "start": 613094,
      "end": 616075,
      "confidence": 0.6862727272727271,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe natürlich recherchiert und der Wikipedia-Artikel zu dem Wort DIN-Norm besagt im zweiten Satz, ich zitiere, die Bedeutung der Abkürzung DIN als deutsche Industrienorm ist veraltet. Das bedeutet natürlich auch, es ist nicht mehr gültig. Danke, Tobias. Ich bin ja immer ein Fan davon. Aber es bedeutet auch, sie war mal gültig.",
      "start": 616115,
      "end": 639204,
      "confidence": 0.8188113207547169,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, aber vor 20 Jahren oder so. Ganz abgesehen davon, wenn du mehr wissenschaftlich arbeiten würdest, würdest du ja wissen, dass Wikipedia keine vertrauenswürdige Quelle ist.",
      "start": 639910,
      "end": 649122,
      "confidence": 0.8138846153846155,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich meine aber gehört zu haben, Wikipedia darf man unter anderem bei Bachelorarbeiten auch schon studieren. Zitieren, nicht studieren.",
      "start": 649162,
      "end": 655290,
      "confidence": 0.7984210526315789,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, also keine Ahnung. An der Uni meines Wissens nicht, aber kommt vielleicht auf die Uni auch drauf an.",
      "start": 656264,
      "end": 661689,
      "confidence": 0.7943684210526317,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Aber danke, Tobias. Mega gut.",
      "start": 661890,
      "end": 663811,
      "confidence": 0.6134,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ist natürlich balsam auf meiner Seele, wenn solche Sachen dann richtig gestellt werden. Also gerne in meinem Discord vorbeikommen. Wenn sonst noch jemand Korrekturen hat für Andi, bei mir ist es eigentlich egal, da braucht ihr nicht vorbeischauen. Aber wenn es um Andi geht, gerne vorbeischauen und korrigieren. Aber dann tauchen wir mal in unser Thema ein, in deine Knowledge-Sharing-Formate und vor allem auch die Organisation von denen. Und ein Punkt, der ganz gerne gefragt wird und diskutiert wird, ist eigentlich, wer ist denn verantwortlich, um solche Events auf die Beine zu stellen? Das heißt, woher kommt denn da der Wunsch nach solchen Formaten? Wie schätzt du das eigentlich ein, Andi? Weil damals, wo wir das gemacht haben, wir waren Engineering Manager die meiste Zeit. Ist das die Aufgabe von dem Engineering Manager? Gibt es das auf anderer Ebene auch? Was würdest du da einschätzen, auch wenn man jetzt so die Karriereleiter und die üblichen Anforderungen an die ganzen Jobpositionen ansieht?",
      "start": 663851,
      "end": 718817,
      "confidence": 0.8135465838509321,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich habe eine ganz starke Meinung. Ich sage, jeder ist verantwortlich dafür, weil die meisten Leute sagen, okay, ich möchte mehr über das Thema wissen oder ich möchte mehr über das Thema wissen. Also ziemlich viele Leute fordern immer und deswegen sage ich, jeder ist dafür verantwortlich, das machbar zu machen oder möglich zu machen. Das Problem ist oder beziehungsweise die Herausforderung, wir sind ja im positiven Wording hier, Wir haben keine Probleme, wir haben nur Herausforderungen. Ist ganz einfach, dass wenn jeder verantwortlich ist, ist keiner verantwortlich, weil dann sagt ja, hey Wolfgang, du bist ja auch verantwortlich, warum machst du das nicht? Und deswegen bin ich der Meinung, jeder sollte das auf dem Zettel haben und jeder sollte es auch übernehmen können und jeder sollte in irgendeiner Form Enabled werden sowas zu treiben dazu zählt unter anderem zeitfrei geräumt werden im täglichen doing ja weil man hat ja zum beispiel verantwortung irgendwie ein feature live zu bringen oder ähnliches ja da ist natürlich die organisation von hackathon oder ähnliches vielleicht jetzt nicht wirklich dein dein responsibility scope. Aber ich denke, jeder sollte da mitwirken, weil jeder möchte es ja auch. Möchte ja mehr Wissen haben, möchte ja den Buzz-Faktor reduziert haben. Was natürlich aber schon wichtig ist, dass das Management immer involviert ist bzw. die Zeit freiräumt und Leute enabelt. Und wenn, was auch sehr oft passieren kann, beziehungsweise sehr oft gesehen habe, das Team ist zu busy, um irgendwas zu enablen, zu busy, um sich Zeit frei zu räumen oder sie haben wirklich nur den Launch von der neuen Webseite oder von der neuen App im Kopf und sind wirklich so fokussiert, dass dann natürlich keine Zeit bleibt zum Nachdenken, so was brauchen wir wirklich, um das Team auf den nächsten Schritt zu heben. Und dann kann das natürlich vom Management, von der Teamleiterin oder ähnliches natürlich schon getrieben werden, vorgeschlagen werden, weil hoffentlich diese Person öfter mal ein bisschen mehr übers Team nachdenkt.",
      "start": 719243,
      "end": 829591,
      "confidence": 0.8166727828746178,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also, ich bin da eigentlich auch deiner Meinung und man hört ja oft, das ist Management-Sache, das muss das Management da oben irgendwie machen. Aber auch wenn man heutzutage in die ganzen Beschreibungen der Levels, sei es jetzt Senior, Staff oder diese Dinge genau hereinblickt, also auch die ohne Personalverantwortung, die haben ja alle überall in irgendeiner Form Knowledge-Sharing drin und als Anforderung und als sehr große Anforderung. Ich glaube, umso mehr Senior man wird, umso mehr muss man auch in die Richtung Knowledge-Sharing gehen. Und meiner Meinung nach gehört da eben die Organisation von solchen internen Events, müssen ja auch keine großen Events sein, können ja auch kleinere sein oder irgendwelche Reading Groups, gehört das einfach absolut dazu. Und du musst keine Personalverantwortung haben, damit du so irgendetwas treiben kannst oder organisieren kannst. Das ist meiner Meinung nach extrem wichtig. Und daher gibt es eigentlich wenig Positionen wahrscheinlich in dem Unternehmen, die sowas nicht können oder nicht auf dem Schirm haben sollten. Also wenn man vielleicht ganz neu einsteigt, okay, als Student oder so. Aber ab dem Zeitpunkt, wenn man länger dabei ist, glaube ich, kann man in die Richtung Knowledge Sharing gehen und da das Ganze auch vorantreiben. Und von ganz vielen Positionen, ich würde sagen, ab mit Senior ist das einfach auch erwartet.",
      "start": 830472,
      "end": 900875,
      "confidence": 0.8233194444444446,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Für mich ist aber schon wichtig, da ein bisschen genauer reinzuschauen. Was heißt denn Knowledge Sharing? dass jemand im team jetzt einfach ein paar slides zusammen häckt sich dann im meetingraum mit dem team vollzieht und einfach durch das thema geht und sagt okay jetzt wisst ihr das ohne dass die team member danach das neue erlangte wissen nicht anwenden finde ich immer ein bisschen schwierig das ist so damals wie der französische unterricht in der schule wenn du kein französisch sprichst verlernst du die sprache auch und kannst höchstens vielleicht eine pizza.",
      "start": 901115,
      "end": 924983,
      "confidence": 0.745021505376344,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bestellt ist mit pizza italienisch aber egal.",
      "start": 925003,
      "end": 927284,
      "confidence": 0.5791428571428572,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja gut oder fromage oder Man merkt.",
      "start": 927324,
      "end": 929856,
      "confidence": 0.7004285714285715,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Schon, Andi kann auch nicht mehr viel von seinem Französisch.",
      "start": 929876,
      "end": 932497,
      "confidence": 0.5584,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Nee, in der Tat, weil ich brauche Französisch nicht in meinem täglichen Doing. Deswegen ist es natürlich schon nützlicher, wenn man das erlernte Wissen und das Wissen, was geteilt wird, schon irgendwie praxisnah irgendwie inkludieren kann in die tägliche Arbeit. Muss jetzt nicht heißen, okay, du kriegst jetzt irgendwie eine Schulung, wie Kafka funktioniert, dass du jetzt nur noch Kafka-Operations machst oder so. Aber dass das halt schon ein essentieller Part ist und dass du das halt schon verinnerlichst, so ähnlich wie Fahrradfahren.",
      "start": 932517,
      "end": 957227,
      "confidence": 0.7677108433734939,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also im Idealfall ist es ja Wissen, das du dann auch in irgendeiner Form anwenden kannst in deinem Alltag. Aber wir sprechen in dieser Episode jetzt nicht über Formate im normalen Arbeitsalltag, also kein Baird-Programming oder wie man dokumentiert oder Design-Documents macht. Wir haben da ja auch einige Episoden darüber gemacht, über diese Dinge und allgemeiner über Knowledge-Sharing. Wir haben da übrigens auch einen Tag. Das heißt, wenn man auf unsere Webseite geht und den Knowledge-Sharing-Tag sucht, dann findet man da auch alle Episoden zu dem Themenblock, also da kann man gerne mal reinhören in andere Bereiche. Und wir wollen aber in dieser Episode eben über Knowledge-Formate sprechen, die außerhalb des Arbeitsalltags stattfinden. So was eben wie ganz klassisch das Paradebeispiel Hackathon.",
      "start": 957920,
      "end": 1001667,
      "confidence": 0.8426557377049179,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ich glaub, Hackathons sind immer so das Stereotypenformat, ja? Die ganzen Techies sitzen sich zusammen, haben Clubmate und machen die Nacht durch. Find ich auch ein bisschen schwierig, denn ich denke, es gibt auch andere Formate, die ...",
      "start": 1001848,
      "end": 1014126,
      "confidence": 0.8099743589743588,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ist dein Lieblingsformat?",
      "start": 1014136,
      "end": 1015217,
      "confidence": 0.748,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meine Lieblingsformate sind so eine Art Book Clubs.",
      "start": 1015677,
      "end": 1019139,
      "confidence": 0.7555,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was verstehst du unter Book Clubs?",
      "start": 1019339,
      "end": 1021621,
      "confidence": 0.6226666666666666,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Jemand schlägt ein Buch vor oder ein Scientific Paper oder ähnliches, das liest jeder. Oder man liest ein Kapitel, muss ja nicht das ganze Buch gelesen werden. Und dann trifft man sich und dann diskutiert man darüber, was ist gut, was ist schlecht, was hat einem gefallen, was hat nicht gefallen. Wie kann das, was geschrieben wurde, im Arbeitsalltag, in meinem Team, in der größeren Gruppe, in der Kultur angewandt werden? Was für eine Relevanz hat das? Man spricht so ein bisschen über das, was man gelesen hat. Und so kann man natürlich Stück für Stück ganze Bücher durcharbeiten oder Ähnliches.",
      "start": 1021641,
      "end": 1053659,
      "confidence": 0.8095544554455448,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Wie ist da deine Erfahrung, dass die Leute das auch wirklich lesen?",
      "start": 1053739,
      "end": 1057040,
      "confidence": 0.6790833333333334,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Meine Erfahrung ist oft, sehr viele Leute sind sehr interessiert bei solchen Events. Das bedeutet, zum Kick-off-Meeting, wo man dann das Paper wählt oder das Buch wählt, sind sehr viele Leute da. Das erste Kapitel wird dann meist noch gelesen, und dann kommen die auch, und dann wird's über Zeit immer weniger Leute. weil du musst halt schon das kommitment hochhalten was dann immer schade ist ist wenn mehr leute im raum sitzen die dann das kapitel nicht gelesen haben aber ihre meinung abgeben auf basis dessen was andere gesagt haben was ich immer schwierig finde weil also die wollen dann auf gut deutsch und achtung jetzt habe ich ein englisches synonym information lurken also lurker also die die sitzen dann nur und wollen nur nehmen, anstatt zu geben. Und das finde ich dann schade.",
      "start": 1057080,
      "end": 1101364,
      "confidence": 0.8396444444444443,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also so die Reddit-Kultur, oder? Wenn wir eine Podcast-Episode posten auf Reddit, dann bekommen wir ganz viele Antworten und man sieht eindeutig, es hat sich niemand die Episode angehört, sondern jeder will nur seinen Senf dazugeben.",
      "start": 1101404,
      "end": 1113750,
      "confidence": 0.794527777777778,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, ist bei Hacker News auch so. Wenn du auf Hacker News auf der Startseite bist, hast du, glaube ich, einen Traffic-Spike von 20.000 Visits oder so pro Stunde oder vielleicht sogar noch in einem geringeren Zeitrahmen, sind trotzdem nur 200 Kommentare. Also da ist ja auch eine große Differenz.",
      "start": 1114190,
      "end": 1128197,
      "confidence": 0.68146,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das heißt, harte Regeln einführen, die, die das Kapitel nicht gelesen haben, dürfen den Mund nicht öffnen, oder?",
      "start": 1128755,
      "end": 1133700,
      "confidence": 0.8581666666666669,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, das ist ja nochmal ein bisschen schwierig, kommt auf die Kultur an. Auf der einen Seite, also komplett ausschließen willst ja auch keinen, weil du möchtest ja das alles zugänglich machen. Auf der anderen Seite hat immer jemand was Wichtigeres zu tun, verstehe ich auch, aber dieser Book Club oder Paper Club oder wie man es immer nennen möchte, oder eine Reading Group, ist halt dafür da, um auch in irgendeiner Art und Weise ein gegenseitiges Commitment zu erzeugen, damit man seine Ziele ja auch erreicht, damit man natürlich auch ein bisschen was lernt. Und je nach Buch kann das natürlich auch einen positiven Impact auf seinen Beruf haben und auf seine Karriere.",
      "start": 1134281,
      "end": 1162405,
      "confidence": 0.7397192982456142,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und dein Platz Nummer zwei?",
      "start": 1162445,
      "end": 1164367,
      "confidence": 0.6298,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich bin mir gar nicht sicher, ob es Platz Nummer eins ist mit dem Book Club, aber es ist schon sehr, sehr hoch. Aber meine Lieblings-, mein zweitliebtes Format ist dann so interne Konferenzen, finde ich ganz cool, wo sich wirklich für einen ganzen Tag Zeit genommen wird. Ich rede davon jetzt nicht von zwei, drei Stunden, sondern wirklich dieser Tag ist für die Konferenz. Vielleicht sogar präferiert an einer externen Location. Ja, wirklich mit dem Kopf raus aus der täglichen Arbeit, so dass man auch wirklich keine Zeit hat, mal eben während der Pause zum Computer zu gehen und E-Mails schicken. Nein, disconnecten.",
      "start": 1164387,
      "end": 1196884,
      "confidence": 0.7685096153846156,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Okay, da kommen wir eh noch ins Detail dann, weil da werden wir auch ein Beispiel liefern von einer großen Inhouse-Konferenz, die wir gemeinsam mal organisiert haben. Mein Lieblingsformat ist ja eigentlich Lunch Talks. Und zwar, weil das sehr einfach zu implementieren ist. Du kannst da sofort losstarten, du kannst einfach sagen, jeder holt sich was zu essen, vielleicht ist das Unternehmen so nett und sponsert auch das Essen beim Lunch Talk oder stellt was zur Verfügung, das wäre natürlich noch besser, aber sonst kann einfach jeder was bestellen, man trifft sich irgendwo und jemand präsentiert irgendwas im Talk. Man schaut sich ein gemeinsames Video an, diskutiert danach darüber. Also es kann sehr viel sein. Man schaut sich einen Konferenz-Talk an gemeinsam. Kann alles sein. Also man braucht eigentlich fast null Organisations-Overhead. Man kann das einfach mal ins Leben rufen. Man kann starten. Jeder hat normalerweise Lunch. Das heißt, die Leute sind sowieso gewohnt, haben meistens sowieso die Mittagszeit in irgendeiner Form geblockt. Das heißt du hast da seltener andere Meetings, kannst einfach mal losstarten, so ähnlich wie dein Book Club, aber halt während dem Lunch Talks anschauen oder ähnliche Dinge dann diskutieren.",
      "start": 1196944,
      "end": 1260040,
      "confidence": 0.8186787564766838,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja ich finde das Format nicht so gut muss ich zugeben, denn auf der einen Seite denke ich, dein Lunch sollte wirklich auch eine Pause sein. Und ich denke, Learning und Knowledge Sharing gehört zum Teil deines Jobs. Auf der anderen Seite, finde ich, ist die Interaktion bei diesen Lunch Talks auch oft nicht gegeben. Was ich halt in der Praxis erlebt habe, ist, dass Leute sich in einen Raum setzen, dann auf YouTube irgendeinen tollen, interessanten Talk anmachen, und dann sitzt du da 30, 40 Minuten, guckst den Talk, und danach ist deine Pause in der Regel schon wieder zu Ende. Und das finde ich dann schade, denn ich denke, da kann man mehr rausholen. Ich denke, man kann mehr interagieren miteinander. Und ich denke, die Pause sollte auch wirklich dafür da sein, um vielleicht über das Hobby zu sprechen oder eine Runde Sport zu machen oder mit dem Hund zu gehen oder was auch immer raus. Ja, also wirklich auch wieder eine Pause von der Arbeit zu machen. Und nicht, wenn ich jetzt im Frontend-Engineer bin, da mein React-GraphQL-Serverbau oder ähnliches, dass ich mir dann noch irgendwas über React-Hooks in der Pause ansehe. Das finde ich dann auch ein bisschen schwierig.",
      "start": 1260641,
      "end": 1313343,
      "confidence": 0.7757586206896548,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was es sonst noch gibt, was eigentlich sehr ähnlich zu Hackathons ist, sind Code Challenges, also was dann wirklich ums Programmieren geht, ist eigentlich, würde ich sagen, so wie ein Hackathon, aber mit einem sehr spezifischen Thema, wo das Problem vorgegeben ist. Teilweise wird das auch so extern gemacht, dass man das irgendeine Challenge, die man im Unternehmen hat, dann auch public macht und dann mit anderen reinzieht. Also es kann sowohl intern wie auch extern gemacht werden. Kann auch in Zusammenarbeit natürlich mit anderen Organisationen sein. Konferenzen haben da ganz oft Challenges, wo das Unternehmen dann vielleicht irgendein Dataset zur Verfügung stellen kann und man muss eben mit dem Dataset irgendwas machen und es können dann Leute aus der Firma sein, extern, wie auch immer. Also ich habe da auch mal sowas mitorganisiert für die REXIS, also das ist so die größte Konferenz im Recommender-System-Bereich. Die hat auch immer eine Challenge zusammen mit einer Firma. Also auch da kann man solche Code-Challenges dann vergeben und man hat dann vielleicht nicht nur einen Tag reserviert wie bei einem Hackathon, sondern kann halt über eine gewisse Zeit einfach probieren, diese Challenge zu lösen und hat das vielleicht auch so ein bisschen abseits des normalen Arbeitsalltags, weil es meistens irgendein abgekoppeltes Problem ist, was jetzt weniger mit dem Tagesgeschäft zu tun hat, sondern wo man mal einfach rausgehen kann und sich damit beschäftigen. Natürlich immer schwierig, wenn es nicht im Arbeitsalltag stattfindet, wie du richtig gesagt hast, auch mit Konferenzen. Die Zeit muss halt in irgendeiner Form reserviert sein.",
      "start": 1313623,
      "end": 1395396,
      "confidence": 0.8187354085603104,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Hast du mal ein spezifisches Beispiel, was so eine Coding-Challenge ist? Weil ich hab da jetzt grad irgendwie so Code-Golf im Sinn, wo es heißt ...",
      "start": 1395671,
      "end": 1402551,
      "confidence": 0.696923076923077,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was ist denn Code-Golf?",
      "start": 1402561,
      "end": 1404103,
      "confidence": 0.743,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Code-Golf ist unter anderem ... Du hast einen spezifischen Code, und das Ziel ist, den so klein wie möglich zu machen. Also Lines of Code oder Character oder Bytewise.",
      "start": 1404143,
      "end": 1412234,
      "confidence": 0.7746206896551724,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, also die RECSYS-Challenge, was wir damals gemacht haben, also es war natürlich dann eine externe Challenge auch in dem Fall, aber das könnte man intern ja genauso machen.",
      "start": 1412600,
      "end": 1419145,
      "confidence": 0.7384137931034482,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "RECSYS ist eine Konferenz, Recommender Systems?",
      "start": 1420206,
      "end": 1423089,
      "confidence": 0.7160000000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Genau, ist die Recommender Systems Konferenz oder die, also sie heißt RECSYS und es geht um Recommender Systems und in dem Fall war das ein Dataset, was wir zur Verfügung gestellt haben. Das heißt, man macht da ein ganz spezifisches Dataset, große Datenbanktabelle, wie du das auch immer siehst, mit Daten drin. Und dann gibt es eben eine Challenge, in dem Fall, du musst ein Recommender-System bauen, was gewisse Sachen vorhersagt, und dann wird am Ende geprüft, welcher Algorithmus am besten funktioniert hat und die Sachen am besten vorhergesagt hat, zum Beispiel. Also eher im Data-Science-Bereich. Aber du kannst natürlich auch jede andere Code-Challenge haben. Wir haben irgendein Problem, was zu langsam ist und wir wollen da eine schnellere Lösung und die Challenge ist, wie kann man das möglichst schnell machen oder eben auch möglichst klein, was es dann auch immer ist. Also du hast dann ein sehr klares Goal und im Idealfall sogar Tests oder Evaluierungen, die man selbstständig schon testen kann, wie gut man ist, um so ein Gefühl zu kriegen, bevor man da mitmacht oder es gibt dann ein Leaderboard vielleicht, wo man was hochladen kann, dann wird das automatisch gecheckt und du siehst dann, wie nahe du bist oder in welchem Rank du hast. Solche Dinge kann man natürlich auch machen. Ist natürlich dann mehr Aufwand. Ist klar, wenn man was Größeres macht, wie bei so einer offiziellen Challenge, die public ist, bei einer Konferenz macht man natürlich sowas. Intern wird es man wahrscheinlich anders lösen. Aber dass man halt so eine Evaluierung auch zur Verfügung stellt, um dann optimieren überhaupt zu können.",
      "start": 1423129,
      "end": 1503704,
      "confidence": 0.8051722846441947,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Was ich auch noch kenne ist, was ein, zwei Kollegen schon mal gemacht haben, sind sogenannte Captcha, also Flag-Schnitzeljagd. Das bedeutet, du kriegst nur die URL und da ist dann eine Website oder ein Service hinter und du musst dann die nächste Information finden, sei es jetzt in dem HTML-Source-Code oder du musst irgendwie ein Get-Parameter herausfinden und das bringt dich auf den nächsten Schritt oder ähnliches. Und so hoppst du dich durch die Systeme, durch die einzelnen Hinweise, bis du dann diese Schnitzeljagd gelöst hast. Und da hinten dran findet dann oft Tracking statt, wie zum Beispiel, welches Team war das schnellste? Wer hat eigentlich Steps übersprungen auf Basis von irgendwelchen Informationen? Oder, oder, oder. Ist natürlich auch enorm viel Aufwand sowas zu erstellen. Gibt es auch fertig im Internet. Irgendwie so Hack the System oder sowas heißt das. Aber im Security Bereich nennt sich das eigentlich Capture the Flag. Also wer als erstes die Flagge hat. Vielleicht kennst noch wer von früher von diesen Shootern Unreal Tournament oder ähnliches. Dass du die Flagge von Gegner Team holen musstest und dann bei dir platzieren musstest. Aber wenn du sowas natürlich jetzt für deine Firma selbst erstellen möchtest, ist natürlich sehr viel Aufwand, ist aber technisch auch eine enorm spannende Thematik. Du setzt da irgendwie einen Docker-Container auf, der ist nur dafür da, der expost ein paar Logs und du kannst da so viel Schweinerei machen. Da geht schon mal mein Herz auf, muss ich zugeben.",
      "start": 1504028,
      "end": 1580370,
      "confidence": 0.7639268292682921,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ja, wir hatten das mal für Recruiting auch gemacht, war extrem viel Aufwand, aber es haben erstaunlich viele Leute dann durchgeschafft und die da auch Spaß daran hatten und am Ende natürlich dann in der Prio Pipeline bei uns im Recruiting Prozess drin waren.",
      "start": 1580990,
      "end": 1594341,
      "confidence": 0.792522727272727,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also eigentlich ist ja zum Beispiel, ich glaube Reddit macht das, wenn du auf Reddit.com gehst und dann dir den HTML-Sourcecode ansiehst oder die Dev-Konsole, aufmachst, dann machen manche Webseiten so, hey, we are hiring, und packen das dann via Console.log im JavaScript raus. Ich meine, im Endeffekt ist das auch schon in irgendeiner Art und Weise so eine Art Schnitzeljagd oder so eine Art Capture-the-Flag, sofern denn die Firma dahinter natürlich auch jetzt nicht den standard Recruiting-Link rausgibt, sondern einen anderen Link, wo du dann vielleicht irgendeinen Benefit hast, weil du dann über den Console.log-Output oder so ins Recruiting-Funnel gegangen bist.",
      "start": 1594381,
      "end": 1626769,
      "confidence": 0.7382450980392157,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Was man natürlich sonst noch machen kann, ist, solche offiziellen Challenges gemeinsam zu machen. Also irgendein Hacker-Rank oder dieses Code of ... Advent of Code? Code of Advent?",
      "start": 1627475,
      "end": 1638201,
      "confidence": 0.7372857142857144,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Advent of Code. Beginnt auch wieder am 1. Dezember. Für alle Leute, die wirklich, ich nenn's mal, vielleicht Lead-Code oder algorithmische Probleme lösen wollen. Advent of Code, ab 1. Dezember. Jeden Tag bis zum 24. werden ... jeweils immer nur ein problem dargestellt und dann sollst du es natürlich lösen bis zum 24 werden die immer immer schwieriger die ersten kann man vielleicht noch mit brutforce lösen danach wird es mit brutforce relativ schnell kommt man an seine grenzen aber das tolle ist du kannst jetzt auch noch bis zum ersten dezember natürlich die rätsel aus den vergangenen jahren nachmachen und da schon ein bisschen üben und dann gibt es natürlich auf reddit etliche subreddits die sich dann für die Lösungen in anderen Sprachen interessieren, die kann man mal nachgucken. Da gibt es auch wirklich ganz coole Leute, die das in LOL-Code machen oder alleine in SQL oder in Excel. Ich rede nicht von Excel-VBA, sondern wirklich Excel. Ist schon eine sportliche Geschichte.",
      "start": 1638241,
      "end": 1697725,
      "confidence": 0.8048404907975458,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber auch da einfach einen internen Slack-Channel oder Teams-Channel oder was es auch immer ist, öffnen und dann kann das schon zu einer gemeinsamen Firmenaktivität werden und man kann sich da gegenseitig hochpushen. Also auch das ist eine ganz einfache Art, um internes Knowledge-Sharing dann auch schon wieder irgendwie voranzutreiben.",
      "start": 1698077,
      "end": 1714851,
      "confidence": 0.8011,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das, was noch gar nicht erwähnt wurde, sind so so eine Art Chapter-Meetings oder vielleicht andere Leute kennen das eher unter Guilds. Also eigentlich eine Gruppe, die sich für dasselbe Thema interessiert. Und dann ...",
      "start": 1715191,
      "end": 1728411,
      "confidence": 0.827714285714286,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das sind einfach nur coole Namen, oder? Guilds und Chaptermeetings und so weiter. Eigentlich sind es ein paar Leute, die sich treffen.",
      "start": 1728421,
      "end": 1734145,
      "confidence": 0.690590909090909,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja, eigentlich muss man ja auch ehrlicherweise sagen, ist das ein firmeninternes Meetup. Das bedeutet, ihr habt eigentlich einen regelmäßigen Kalenderinvite bei euch in der Firma zum Thema Cloud oder zum Thema Python oder zum Thema Infrastructure as Code. Und ... In dieser Gilde, also in dieser Interessensgruppe, könnt ihr natürlich dann Themen beziehungsweise Projekte oder ähnliches zum Thema Python, Infrastructure as Code oder Cloud besprechen. Da könnt ihr natürlich dann auch anfangen, sofern ihr das intern wollt, Firmenstandard zu entwickeln, weil dann alle Leute, die sich für das Thema interessieren, da halt vor Ort sind. Manche machen das, manche nicht. Manche sagen, ja, man sollte diese ganzen Firmenstandards direkt rauslassen, sondern nur eine reine Plattform für den Austausch bieten. Das überlasse ich euch, wie ihr das macht. Aber bei einer Firma habe ich die Cloud-Gilde geleitet und wir haben das über zwei, drei Jahre, ich glaube alle zwei oder drei Wochen gemacht, immer eine Stunde, sehr viel mit Vorträgen, so 20 Minuten Vorträgen über Projekte, die in der Firma gerade abgehen, was das Thema Cloud berührt. Manchmal irgendwie auch nur Erfahrungsberichte, weil jemand bei der AWS Reinvent in Las Vegas war oder bei der Google IO oder ähnliches. Und das ist schon eine ganz interessante Geschichte, nicht nur für Leute, die dann zum Beispiel im Cloud-Bereich oder im Python-Bereich arbeiten, sondern auch für Leute, die in dieses Thema rein wollen. Also das bedeutet, man hält die Barriere sehr niedrig, um Leuten Zugang dazu zu geben, um eine Idee davon zu bekommen, wie wird eigentlich Python in der Firma programmiert oder ähnliches.",
      "start": 1734586,
      "end": 1830815,
      "confidence": 0.8148053435114511,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und zwei Bereiche, die meiner Meinung nach absolut unterschätzt sind und meistens nicht so unter dem Aspekt Knowledge Sharing gesehen werden, sind Treffen von Personen, also so wie Interestgroups nur ohne Interest. Was meine ich damit? Also es gibt ja oft einfach so All-Hands-Meeting, wo ein Thema besprochen wird zum Beispiel, wo es eine Panel-Discussion gibt in irgendeiner Form, also wo sich Leute gar nicht wegen einem speziellen Thema treffen, sondern weil das halt einfach in der Struktur mit dabei ist. Auf derselben Ebene sind für mich Team-Events. Also man trifft sich ja auch nicht für Team-Events, wo man gemeinsam irgendwas essen geht, was trinken geht, trifft man sich ja nicht explizit für Knowledge-Sharing. Trotzdem glaube ich, dass bei beiden Formaten, also bei einer Panel-Diskussion, Team-Events, was es auch immer ist, extrem viel Knowledge geshared wird am Ende, wenn Leute einfach miteinander sprechen. weil die wenigsten sprechen ja nur über private Dinge, sondern es ist halt extrem viel Firma dabei und da kann unter Umständen wirklich vielleicht jetzt weniger, wie kann ich die perfekte Cloud-Funktion schreiben, geshared wird, aber vielleicht wird das neue coole Feature von der Cloud-Funktion geshared oder es wird irgendeine firmeninterne Information geshared von einem anderen Team, wie ein anderes Team das macht und das ist eigentlich die wertvolle Information, die geshared werden sollte und die sonst vielleicht nirgends geshared wird, weil sich diese Leute gar nicht treffen. Also ich glaube, diese ungeplanten Knowledge-Sharing-Events, wenn ich sie mal so nennen darf, sind sehr, sehr wertvoll und da sollte man vielleicht auch mehr Augenmerk drauflegen bzw. im Hinterkopf haben, dass das sehr wohl auch was bringt und nicht nur ein gemeinsames Trinken ist, wo man sich menschlich kennenlernt.",
      "start": 1830855,
      "end": 1929483,
      "confidence": 0.8266107142857139,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das hört sich sehr negativ an, gemeinsames Trinken, wo man sich menschlich kennenlernt. Aber genau dieses menschliche Kennenlernen ist essenziell für gute Teamarbeit. Nicht nur in einem Office-Job, sondern auch im Remote-Job. Die meisten Remote-Firmen bieten Budget an, um sich an irgendeiner Location zu treffen, um einen Offsite zu machen, um sich wirklich im realen Leben zu treffen. Damit man, ich sag mal auf gut Deutsch, zusammen trinkt. Muss kein Alkohol sein, kann auch nur ein Kaffee sein. aber danach hat man andere art von video calls danach hat man ich sag mal stärkeres bonding ob man möchte oder nicht und ob man will oder nicht auch bei den abendlichen team events wird primär über die arbeit gesprochen weil das eigentlich der gemeinsame nenner ist und weil sich wahrscheinlich diese gruppe sonst nicht so in diesem rahmen treffen würde Genau, und.",
      "start": 1930090,
      "end": 1979795,
      "confidence": 0.8486879432624111,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Das ist etwas, was üblicherweise eigentlich schon allen klar ist und darum wird vom Management ja auch meistens Geld dafür ausgegeben, aber der Knowledge-Sharing-Aspekt, den denkt man oft nicht mit und ich glaube, der ist aber auch sehr, sehr wichtig bei diesen Events und Team-Events.",
      "start": 1979835,
      "end": 1993695,
      "confidence": 0.8275333333333335,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Fun fact ich habe die tage gelernt dass du sogar dein mittagessen wenn du mit deinen arbeitskollegen auswärts mittagessen gehst dass du das teilweise von der steuer absetzen kannst sofern du nachweisen kannst dass ein teil des gesprächs über die arbeit ging was beim mittagessen ja oft der fall ist. Dann musst du nur nachweisen in der Steuererklärung, wer denn alles mit bei diesem Mittagessen war und über welche Themen gesprochen wurden. Sofern du das protokollierst und dann mit deiner Steuererklärung abgibst, kannst du dein Mittagessen auch als Arbeitnehmer partiell, also zum Teil von der Steuer absetzen, zumindestens in Deutschland.",
      "start": 1994496,
      "end": 2032093,
      "confidence": 0.8502899999999997,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Da waren jetzt viele, wenn das gegeben ist, wenn das protokolliert wird, dann zum Teil vielleicht und überhaupt, wenn du das im Finanzamt klar machen kannst.",
      "start": 2032673,
      "end": 2040475,
      "confidence": 0.8563076923076924,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Im Endeffekt hat die Dame oder der Herr beim Finanzamt eh das Sagen.",
      "start": 2041235,
      "end": 2048637,
      "confidence": 0.8376153846153845,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber man kann es ja probieren, man verliert ja nichts dabei. Im schlimmsten Fall wird es rausgestrichen. Okay, aber kommen wir mal zu deinem Lieblingsthema In-House-Konferenzen, Andi. Und wir hatten ja das Vergnügen, vor Corona in dem Fall, gemeinsam ein recht großes Event zu organisieren. Und was mir und wahrscheinlich den meisten TeilnehmerInnen von damals auch noch im Kopf ist und sehr klar im Kopf ist, ist das Spielen von Schere, Stein, Papier in einem Raum mit 500 Leuten gemeinsam. Und es geht auf dich zurück.",
      "start": 2048777,
      "end": 2082532,
      "confidence": 0.8000465116279073,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Also, was ist eigentlich passiert? Wolfgang und ich haben eine interne Konferenz für eine Firma organisiert. Diese Konferenz haben wir nicht nur einmal organisiert, sondern über mehrere Jahre, jedes Jahr einmal. Hatte ungefähr eine Größe, also die finale Ausbaustufe waren dann 500 Leute aus dem Tech-Bereich. Das bedeutet Softwareentwicklerinnen und Softwareentwickler, Data Scientists, Leute aus dem Design, Product Owner, Product Manager. Und alles sowas dazugehört, um halt so ein Tech-Produkt zu bauen. Und bei solchen großen Events, das ist eigentlich nichts anderes als wie bei Bezahlkonferenzen, hat man meist entweder einen Keynote-Speaker oder zumindest jemanden, der sagt mal, hallo, wir sind hier auf dieser Konferenz und so läuft das in der nächsten Zeit ab. Und man kennt das vielleicht aus diesen Retrospektiven, dass man so einen Icebreaker hat. Und damals durfte ich mir einen Icebreaker Lion, kann man so sagen, kopieren, den ich mal in einem Management-Workshop hatte. Und zwar ging es darum, man hat Schere, Stein, Papier gespielt. Wir waren in dem Management-Workshop, glaub ich, zehn Leute. Das bedeutet, bei der ersten Runde hat man fünf Teams. Schere, Stein, Papier, alles gut. Der Verlierer von diesem Spiel folgt dem Gewinner zu seinem nächsten Kandidaten, zu seinem nächsten Gegner, steht während des Spiels hinter dem Gewinner und feuert ihn an, so wirklich, ja, ja. Nach der zweiten Runde hat der Gewinner dann zwei Leute hinter sich, die den anschieren. So, jetzt haben wir das während des Management Workups mit zehn Leuten gemacht, war also eine relativ schnelle Nummer. Und irgendwann hatte ich die Idee, ja lass das doch mal als Warm-up-Game machen und dann habe ich den Consultant da angeschrieben, der mit uns den Management-Workshop gemacht hat. Und dann habe ich gefragt, was ist denn eigentlich das Größte, wo du das mal gemacht hast? Also mit wie vielen Leuten? Da saß der irgendwie so bei 200. Da sage ich, hättest du ein Problem damit, wenn ich das kopiere und wenn ich das für eine Konferenz mit 500 Leuten mache, sagt der, Ne mach mal aber lass mich mal wissen wie das war haben wir ausgearbeitet ich habe die regeln ein bisschen verbildlicht und habe das dann in der intro speech vorgestellt und dann haben wir schere stein papier mit 500 leuten gespielt. und das finale waren zwei leute in einem unglaublich großen raum spielen schere steinpapier und 248 leute stehen sich gegenüber also hinter den leuten jeweils 248 und machen so wie in so einem fußballstadion ja und danach wird gefühlt die gewinnerin war das glaube ich auf auf auf händen getragen und sie wurde gekrönt bitte sogar. Das faszinierende ist, da wir natürlich immer durch zwei teilen, ja, war das ganze Spiel in unter fünf Minuten mit 500 Leuten durch. Ich hab dazu auf andigrunwald.com einen Blogpost gemacht mit Bildern, und da unten findet man auch das Video, wie das aussah und allem Drum und Dran. Sehr, sehr schönes Warm-up-Game. Nicht so ein Standard-Warm-up-Game. Schnell gemacht, jeder ist so ein bisschen hyped. Kann ich nur empfehlen, verlinken wir auch in den Shownotes.",
      "start": 2083192,
      "end": 2265631,
      "confidence": 0.8023518886679917,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Hat super funktioniert, gibt auch noch ein paar Videos auf Andis Blogpost, inklusive der Krönung mit einer Burger King Krone, weil das Event war low budget, da hatten wir nur das Budget für eine Burger King Krone.",
      "start": 2266278,
      "end": 2279562,
      "confidence": 0.8190810810810811,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es geht ums Zeichen ja, nicht ums Materielle.",
      "start": 2279602,
      "end": 2281463,
      "confidence": 0.8197500000000001,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Aber der Erfolg von so einer Inhouse-Konferenz wurde natürlich nicht über dieses Intro-Spiel definiert, sondern vor allem über den Content. Und da hatten wir uns damals was Neues einfallen lassen, dass wir möglichst nah an einer Konferenz sind. Also wir hatten auch früher mal Unconferences ausprobiert, aber wir wollten diesmal wirklich eine konferenzartige Situation erzeugen, dass man wirklich die Vorträge einreichen muss, dass man mehrere auch einreichen kann und dann wird wirklich entschieden, welche Vorträge schaffen es, welche Talks, welche Formate. Wir haben das auch zum ersten Mal sehr weit geöffnet gehabt. Also davor war es mehr auf Technik fokussiert und dann hatten wir das immer weiter geöffnet auf Product Owner, Project Manager, Designer. bis hin zu GrafikerInnen eigentlich, also es war dann wirklich sehr sehr breit und offen, hat meiner Meinung nach wirklich einen Mehrwert gehabt gegenüber den reinen Techies, weil es einfach noch ein diverseres Team war aus verschiedenen Bereichen und diverse Talks auch eingereicht wurden, also kann ich auf jeden Fall empfehlen, wird glaube ich heutzutage auch allgemein mehr gemacht, dass man die nicht Techies auch einbindet, die in irgendeiner Form mit dem Produkt zu tun haben. Man kann da ja auch weitergehen, Support, egal. Es muss halt Sinn machen am Ende. Aber die Diversität hatte ich da auch sehr, sehr positiv jetzt im Kopf noch.",
      "start": 2282661,
      "end": 2360649,
      "confidence": 0.8455251141552511,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Eben, man muss ja auch mal kurz drüber nachdenken, was hat das für einen Effekt, wenn du bestimmte Leute, die in der Technologiesparte deiner Firma arbeiten, nicht einbindest, ja? Also du explizit sagst du ja dann, hey, pass mal auf, ihr gehört jetzt nicht zu Tech, sofern du das als Tech-Event-Brand ist. Was motivationstechnisch schon ein harter Hit ist. Was liegt denn auf der Seite des Kontras? Auf der Seite des Kontras könnte man sagen, ja, wenn ich mehr Leute habe, dann kostet mich das mehr Geld. Da würde ich ganz mal zur Frage stellen, wie viel mehr Geld kostet das denn wirklich, diese Motivation so zu zerstören? Weil im Endeffekt ist es ja schon eine Motivationszerstörung. Und die Realität sieht halt oft anders aus. Du bietest den an, an diesem Event teilzunehmen. Und wenn du Glück hast, sind dann 60 Prozent dabei. Es werden ja nie 100 Prozent mitmachen. Aber was ich sagen möchte, und was jetzt auch grade wieder durch den neuen State-of-DevOps-Report 2023, der vor Kurzem veröffentlicht wurde.",
      "start": 2361109,
      "end": 2421092,
      "confidence": 0.8104444444444443,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bewiesen wurde ... Verlinken wir natürlich auch gerne.",
      "start": 2421112,
      "end": 2423853,
      "confidence": 0.648375,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Verlinken wir auch in den Show Notes. dass die Kultur in deinem Unternehmen essenziell für gut performante Teams, für schnell reagierende Teams, für guten Output und auch für eine hohe Motivation ist. Denn offengesprochen, wenn da eine Kultur im Arsch ist, bin ich mir nicht sicher, wie hochperformant dein Team wird. Und solche Events zählen zur Kultur, ob man es möchte oder nicht, denn man bietet den Leuten eine Möglichkeit, sich weiterzuentwickeln, außerhalb der Arbeitszeit, innerhalb der Arbeitszeit, weil sie werden dafür bezahlt. Es gibt immer Leute, die entwickeln sich auch weiter außerhalb ihrer Arbeitszeit, doch das kann man ganz offen gesprochen nicht von jedem erwarten. Man hat Familie und Co. Eine Sache aber noch, weil der Wolfgang gerade Unkonferenzen erwähnt hat, für die Leute, die das Wort noch nicht kennen. Klassische Konferenzen, man reicht einen Talk ein oder ein Programm und das Programm wird dann vom Komitee irgendwie bestimmt, der Talk wird vorbereitet und man hat weit im Voraus, mehrere Wochen im Voraus eigentlich schon das Wissen darüber, wann welches Thema, wann in welchem Saal vorgetragen wird bei einer klassischen Konferenz. Eine Unkonferenz ist jetzt eigentlich genau das Gegenteil. Und zwar treffen sich ganz viele Leute an einer Location. Jeder schlägt irgendwie ein Thema vor, zu dem er was sagen kann oder einen Talk halten kann. Und vor Ort, am Konferenztag, am Morgen, werden dann die Talks gevotet. Jeder hat dann zwei, drei Sticker. Man klebt das dann auf die Themen, die man hören möchte. Und dann wird das Thema beziehungsweise die Agenda für den Tag bestimmt. Und somit ist das ganze Programm der Konferenz, der Unkonferenz, eigentlich von den Gästen bestimmt. Ein sehr schönes Format, hat natürlich ein paar Nachteile in Bezug auf, du bereitest was vor und da gibt die Gefahr, dass du dein Talk nicht hältst.",
      "start": 2423873,
      "end": 2535560,
      "confidence": 0.8411966666666676,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder du bereitest was nur halbherzig vor, weil du sagst, der Talk wird eh nicht gevotet, dann wird er plötzlich gevotet. Man kann aber auch sehr spontane Formate einreichen. Hatten wir auch so Diskussion-Formate, Diskussion-Panels, wo man gar nichts vorbereiten muss. Das ist ja auch so die Idee, wenn das länger geht, dass man am zweiten Tag zum Beispiel irgendwie am ersten Tag gemerkt hat, da gibt es ein, zwei Themen, da könnte man einfach fünf Leute auf die Bühne setzen, die miteinander darüber diskutieren, weil es da einfach Bedarf gibt. Also sowas ist natürlich dann super, wenn man das auch machen kann. Aber da sind wir schon bei dem Punkt, der eigentlich so den Kern betrifft bei so einer Inhouse-Konferenz, und zwar Content Talks und die Vorbereitung. Und da muss man schon auch sagen, wir hatten da jetzt bei dem großen Event mit 500 Leuten wirklich viele Talks. Ich kann mich gar nicht mehr genau erinnern, wie viele es waren, aber ich glaube über 100. wenn ich das richtig im Kopf habe. Aber um mal zu diesen 100 Talks zu kommen, das ist ein langer, langer Weg. Das muss man schon auch ganz klar sagen. Also wir haben da im Hintergrund schon sehr viel Werbung machen müssen, Personen persönlich ansprechen, Werbung bei den ganzen Leads machen, bei den Tech-Leads, bei den Lead-Developern, dass die ihre Leute anstoßen. dass man da wirklich Gas gibt und den Leuten auch gut zuredet. Wir haben das ja auch schon öfters erwähnt, man hat ja immer dieses Imposter-Syndrom, dass man glaubt, man hatte nichts Interessantes im Team, man hat selber noch nichts Interessantes gemacht, wo man einen Talk draus machen kann, was ja eigentlich immer falsch ist, muss man ganz klar sagen. Und da muss man einfach die Leute ermutigen und die Kette auch anstoßen, da braucht man viel, viel andere Leute, die auch Werbung machen. Und wir hatten eigentlich am Ende ziemlich Stress, weil wir hatten noch sehr wenig Einreichungen, muss man sagen, am Ende. Und es hat sich dann aber super aufgelöst. Am Ende hatten wir, glaube ich, zu viel. Und wir haben am Ende, glaube ich, 30 Prozent abgelehnt oder sowas in der Richtung. Also vor allem Leute haben dann auch zwei Talks eingereicht. Und wir haben dann natürlich probiert, das in irgendeiner Form so zu machen, dass möglichst jeder einen Vortrag hat, aber dass man eben dann Doppellungen irgendwie rausnimmt, ähnliche Vorträge. Da haben wir dann recht viele Stunden auch verbracht, da eine gute Auswahl zu treffen. Aber es kommt nicht von selber. Also man braucht nicht glauben, man stellt da irgendeinen Call-for-Paper online in einem Slack-Channel und dann bekommt man plötzlich 200 Einreichungen. Also das passiert einfach nicht. Und da muss man sich viel, viel, viel Zeit reservieren und investieren, damit da was weitergeht und die Leute dann wirklich einreichen.",
      "start": 2535975,
      "end": 2676334,
      "confidence": 0.8230594479830151,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ja man denkt sich immer ich poste einfach mal was in slack und ich schicke eine rund e-mail und dann hat das jeder auf dem zettel und dann ist das ein selbstläufer für manche leute ist das genau so dennoch wenn man jetzt mehr als 50 einreichungen möchte oder mehr als 100 einreichungen haben möchte und dann wirklich ein diverses programm auf die beine stellen möchte dann ist das leider nicht so denn Auch wenn man die ganze Sache frühzeitig startet, mehrere Wochen vorher, dann ist ein typischer Gedanke, ich hab die E-Mail gesehen, cool, ich hab noch vier Wochen Zeit, mach ich später. Flap. Wird nicht aufgeschrieben und somit verschwindet der To-Do wieder und es wird dann im Endeffekt vergessen. Was bedeutet das aus organisatorischer Sicht? Du bist natürlich konstant am rumspammen, am overcommunicaten, die Leute konstant reminden. Aber dieses Shout-out in the void mit Slack und E-Mail, das reicht leider nicht. Was wir gemacht haben, wir sind primär zu den Leuten hingegangen, an den Tisch und sagt, hey, hättest du nicht Lust, einen Talk zu machen? Oh, und dann fing's immer an. Aber ich weiß doch gar nicht, worüber ich reden kann. All das, was ich weiß, weiß doch schon jeder. So diese Art von, ich bin doch eh der Dümpste hier im Raum. Und es waren unglaublich viele Gespräche notwendig, um den Leuten mal zu zeigen, dass sie doch schon sehr, sehr einzigartiges Wissen haben zum Teilen. Einfach durch Basisfragen wie, woran arbeitest du denn gerade? Oh, das ist interessant. Kannst du mir ein bisschen mehr darüber erzählen? Und flups, hattest du auf einmal einen Talk über die Optimierung von asynchronen Netzwerkkalls in iOS-Apps.",
      "start": 2677043,
      "end": 2763511,
      "confidence": 0.8061046931407944,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und ich glaube, das ist genau das, was man dann auch machen muss, du musst das Interesse zeigen, du als Organisator, als Lead, was auch immer, und dann auch erklären, dass das interessant ist und darauf hinweisen, hey, das ist super interessant, ihr habt das auch noch nicht gewusst. Also dieser Kick, den brauchst du, diesen Push, dass die Leute realisieren, okay, es gibt andere Leute, die vielleicht sogar Elite sind, die das interessant finden. Und diese Reaktion ist meiner Meinung nach extrem kritisch, und die muss man spielen.",
      "start": 2764251,
      "end": 2794558,
      "confidence": 0.8223370786516856,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ich hab jetzt kein Psychologiestudium oder so, aber ich hab mich immer gefragt, warum ist das so? Ich hab das bei mir auch beobachtet. Warum denken die Leute immer, sie wären die Dümmsten, und das, was sie wissen, wissen schon alle? Meine Theorie ist folgende. Du beschäftigst dich mit einem Thema, Mobile Applications oder Web Performance oder ähnliches. Du bist da super tief drin und du hast das verstanden. Du weißt, wie das funktioniert. Du weißt, wo du anpacken musst, um was zu ändern. Du verstehst das Thema. Du bist, ich sag mal, ein Subject Matter Expert in dem, was du tust. Deswegen kommt dir das Thema so einfach vor, weil dir geht's ja auch einfach von der Hand. Und dann siehst du im Slack oder irgendwo in dem Meetingraum jemand spricht über die Architektur von Stream-Processing und geht ganz besonders auf das Sliding-Window und das Joinen von drei Streams ein. Und du denkst so, what the fuck, was geht denn da ab? Keine Ahnung, wovon diese Person spricht. Und dann denkst du, das sieht super kompliziert aus. Diese Person ist unglaublich smart, intelligent. Natürlich weiß diese Person auch all das über Web-Appoints, was ich weiß. Weil sonst könnte die Person ja nie etwas über das Sliding Window und das Joining von drei Topics im Stream-Processing erzählen. Der Clou ist aber, das, was du dir denkst, denkt die Person sich ganz genau auch über Web-Performance. Und jeder ist so ein bisschen in seiner Bubble und durch so einfache Fragen und durch das Zeigen von ein bisschen Interesse weckt man diese Leute ein bisschen auf und sagt, hey, du bist wirklich ein Experte und ich beschäftige mich nur mit einem anderen Thema. Kommt da mal ein bisschen raus. Ein bisschen Selbstvertrauen oder ein bisschen mehr Selbstvertrauen tut vielen Leuten gut. Kann natürlich auch in die Negative gehen, ganz klar, wenn man ein bisschen zu viel Selbstvertrauen hat. Aber traut euch mal und gesteht euch mal ein, dass ihr euch in einem Feld richtig gut auskennt und ihr müsst euch einfach nicht in allen anderen Feldern richtig gut auskennen, aber das tun die anderen ja auch nicht.",
      "start": 2794919,
      "end": 2902523,
      "confidence": 0.7893014084507037,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Ein anderer extrem wichtiger Punkt meiner Meinung nach bei der Organisation ist, dass man nicht nur im Vorhinein das Interesse zeigt, sondern auch während der Konferenz dann das Interesse und den Dank und zwar gerade von Management-Ebene. Das heißt, man muss sich im Vorhinein von der Management-Ebene oder am besten C-Level, je nach Größe der Firma, dieses Commitment abholen, dass diese Leute auch bei der Konferenz dabei sind, im Vorfeld vielleicht auch schon bewerben, und dann aber auch den Dank zeigen bei der Konferenz. Also wenn ihr eine Konferenz habt mit 500 Leuten oder auch weniger Leuten und die Firma ist jetzt nicht vielleicht 100.000 Leute groß, dann hat meiner Meinung nach der CEO dort zu sein. Der CTO sowieso, aber auch der CEO. Also versucht dieses hohe Management herzubekommen und Der muss dann auf der Bühne stehen und sich bei den Leuten bedanken. Das ist einfach so oder sie. Also das gehört dazu und das muss im Vorfeld abgeklärt sein, dass es da keine Terminkollisionen gibt oder ähnliches. Und durch dieses Commitment beziehungsweise durch das Buy-in vom Management hat man ja dann auch die Möglichkeit zu sagen, okay, wir haben das Buy-in, ihr könnt euch vom normalen Hamsterrad entfernen von eurem Alltag, euch nur auf die Konferenz konzentrieren. Das ist wirklich was, was die Firma will. Also das muss im Vorhinein abgeklärt sein. Das kommt, wenn das stattfindet, meistens so als normal rüber. Aber es muss einfach im Vorhinein ganz, ganz viel Kommunikation passieren im Hintergrund. Und wenn man die Dinge organisiert, auch nur den kleinsten Hackathon, dann müssen die Leute informiert sein, die es betrifft. Wenn fünf Leute in dem Team bei einem Hackathon sind, dann muss das der Product Owner wissen. Und zwar nicht am Tag, wo das stattfindet, sondern im Vorfeld, dass das Team weg ist, dass das Team ein zwei Tage, was es auch immer ist oder auch nur drei Stunden nicht verfügbar ist. Das ist ganz kritisch, sonst führt es zu Konflikten oder die POs wissen nicht Bescheid, die Project Manager schreiben dann den Leuten, die beim Hackathon sind und die müssen dann remote womöglich oder im Idealfall remote, weil sie irgendwo anders sind beim Hackathon, dann irgendwas noch fixen und dann haben sie keine Zeit für den Hackathon, haben keinen freien Kopf. Also das muss im Vorhinein einfach super kommuniziert werden mit allen Beteiligten und möglichst ganz nach oben.",
      "start": 2903143,
      "end": 3031900,
      "confidence": 0.8447449494949505,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Im Allgemeinen hoffe ich, dass die Arbeit, die zur Organisation eines Talks oder der Konferenz beitragen, dass das wirklich Arbeitszeit ist und somit natürlich der Aufwand und auch die Teilnahme von eurem Management wertgeschätzt wird. Das ist jetzt nicht nur durch die Anwesenheit des CTO oder CEO. wie Wolfgang es gerade beschrieben hat, sondern wirklich auch kann man während der täglichen Arbeitszeit Zeit freiräumen, um einen Vortrag vorzubereiten. Natürlich muss man da die Balance finden. Wenn ihr jetzt einen 45-Minuten-Talk für eine komplette Woche vorbereitet, weiß ich jetzt nicht, ob das jetzt irgendwie in der Balance ist. Das müsst ihr abklären, aber einen gesunden Mittelweg sollte man da schon wählen.",
      "start": 3032288,
      "end": 3070318,
      "confidence": 0.789109090909091,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und es ist natürlich auch einfacher, wenn jetzt der CEO oder CTO da dahinter steht und das offiziell auch announced wird, dann kann natürlich ein PO oder ein PM jetzt nicht mehr sagen, ja, hey, Moment, warum bereitest du da jetzt einen Vortrag vor? Sondern das ist halt dann auf höchster Ebene bestätigt und kommuniziert und dann gibt es da auch keine Probleme. Also da auch früh genug immer darauf einwirken.",
      "start": 3070687,
      "end": 3090905,
      "confidence": 0.7761830985915495,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ein anderer wichtiger Punkt ist die Location. Ich persönlich find's immer super, wenn ein Event nicht im Büro ist. Wenn ein Event außerhalb des Büros ist. Wenn der Arbeitsweg zu diesem Event auch schon ein anderer ist. Weil da fühlt sich das immer so ein bisschen besonders an. Es fühlt sich nicht so an, ich fahr ins Büro oder wieder zur Arbeit, sondern es ist etwas Besonderes, man ist in einer neuen Location. Man muss sich neu umgucken, der Kopf muss sich neu orientieren. Wo ist die Toilette, wo krieg ich den Kaffee? Das sind so kleine Dinge, da freue ich mich immer, weil dein Kopf richtig ans Denken kommt. Jetzt kann man natürlich sagen, okay, man wählt eine Location, die in derselben Stadt ist oder in der Nachbarstadt. Ja, also das bedeutet, dass die Leute abends nach Hause gehen können und in ihrem eigenen Bett schlafen können. Ist super, ist auch super für die Brieftasche des Unternehmens, weil das in der Regel keine Reisekosten oder ähnliches hat.",
      "start": 3091165,
      "end": 3140955,
      "confidence": 0.7945773809523813,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Oder zumindest ein anderes Gebäude oder anderes Stockwerk, wenn es sowas gibt in der Firma. Also, dass man irgendwie nicht an seinem Arbeitsplatz sitzt. Natürlich, umso weiter weg, umso besser. Aber unter Umständen schafft man es ja auch mit einem anderen Raum. Oder wenn die Firma kleiner ist, kann man vielleicht einen anderen Raum im Gebäude anmieten. Dass man aber zumindest nicht an seinem Schreibtisch sitzt. Und zwar hat es den einfachen Grund, weil man sonst auch einfach nicht rauskommt. Und ich habe das selber erlebt. Wir hatten mal einen Hackathon und da waren wir, glaube ich, sogar auf einem anderen Stockwalk oder in einem anderen Gebäude. Aber die POs haben es trotzdem geschafft, ihre Leute in irgendeiner Form zu erreichen, klarerweise online. Und da sind dann einige rausgedroppt, weil irgendwas Wichtiges passiert ist. Ich meine, wenn es ganz kritisch ist, ist es ja okay, dass man da rausdroppt. Aber in dem Fall war es gar nicht so wichtig. Es war scheinbar im Team nicht gut kommuniziert. Und dann sind einfach ganze Teams weggebrochen. weil die einfach wieder in die Arbeit rein sind und irgendwo ein Problem war und dann haben sie sich einfach rausreißen lassen. Und umso weiter das natürlich weg ist, umso besser. Und das ist, glaube ich, eine Grundvoraussetzung für alle diese Events. Und umso besser das Event sein sollte, meiner Meinung nach, umso weiter sollte es weg sein.",
      "start": 3142125,
      "end": 3210697,
      "confidence": 0.7850474137931037,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Die königsklasse ist natürlich wenn man als firma oder als tag team zusammen wirklich weg fährt eine stunde oder zwei wirklich fahrt hat und dann dort mit einem hotel übernachtung die ganze sache bringt der nachteil ist natürlich ganz klar familie und so weiter man ist eine nacht weg, Nicht jeder möchte das, was völlig verständlich ist, aber das ist dann immer so eine Hürde. Der Vorteil ist jedoch, dass man dann zusammen dann noch Abendessen kann und nicht jeder springt sofort nach der Konferenz nach Hause, wie als wenn das in derselben Stadt ist. Also dann hat man schon so eine Art großes Team-Event mit Konferenz irgendwie aneinandergebracht und das hat natürlich schon einen enormen Effekt.",
      "start": 3211417,
      "end": 3250700,
      "confidence": 0.8323675213675211,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Also ich glaube ganz allgemein, wenn man das koppelt mit irgendwas gemütlichem, ich nenne es immer make it fun, einfach sei es jetzt Schere-Stein-Papier-Spiel, bei einem Lunch-Talk, Lunch eben, bei einem größeren Off-Site kann man eine Party am Abend machen. Wir hatten bei diesem großen Tech-Event eine LAN-Party sogar am Abend. Wir hatten eine Disco, das war natürlich größeres Event und wir hatten da auch genug Hilfe und ganze Tech-Teams, die sich um die LAN-Party gekümmert haben und um Technik und so weiter. Das geht natürlich in einem größeren Unternehmen, aber man kann es auch im kleinen Unternehmen machen oder im kleinen Team. Man kann genauso gemeinsam Abend essen, man kann genauso was trinken, dann hat man halt keinen großen DJ da, sondern macht das in irgendeiner Location. Aber dass man das mit einplant, dass man eben nicht nur die harte, trockene Kost hat oder vielleicht auch mal einen lustigen Vortrag zwischendrin oder den Andi, der mit seinem Jeopardy-Game einfach da ein Spiel draus macht und wirklich viele Leute mitgerissen hat bei dem Spiel.",
      "start": 3251601,
      "end": 3309063,
      "confidence": 0.7924310344827583,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Kleiner Funfact. Dieses Jeopardy-Game, die Buzzer, ist alles Open Source. Das bedeutet, wenn ihr einen 3D-Drucker habt, wenn ihr kleine Lötkolben habt, da gibt es sogar eine Bill of Materials, was ihr euch bestellen müsst, um das Ganze nachzubauen. Das ist alles Open Source, alles auf meinem GitHub. Kann ich einmal unten in den Shownotes mit verlinken. Da sind auch zwei, drei andere Events mitgemacht worden, so Sport-Events, so eine Fitness-Competition habe ich dafür gebaut, so ein Frontend und so weiter und so fort. Also, wenn ihr Bock habt auf Hardware-Buzzer, die könnt ihr euch gerne selbst nachbauen.",
      "start": 3309103,
      "end": 3338389,
      "confidence": 0.7386020408163267,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und man muss einfach die Chance nutzen. Jetzt habt ihr alle Leute da irgendwo rausgebracht in ein anderes Gebäude, in eine andere Stadt und da macht man nur inhaltliche Sachen. Also das ist natürlich das Schlechteste, was es gibt. Man muss, glaube ich, die menschliche Ebene einfach mitspielen und das nutzen und gemeinsam eben was essen, gemeinsames Team-Event vielleicht noch mit einbauen, irgendwelche Spiele. Es ist jetzt keine Rocket Science, aber einfach, dass man sich da was überlegt, damit die Leute auch beschäftigt sind in den Pausen, gewisse Zeiträume mit einplant, wo man eher in Richtung Team-Event, was menschlichen geht und damit nicht alles mit hartem Content gefüllt ist.",
      "start": 3339050,
      "end": 3374032,
      "confidence": 0.8118899082568806,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Es ist auch wichtig, die Art des Contents vielleicht ein bisschen zu guiden. Macht nicht nur Work-Related-Kram. Zum Beispiel, wir hatten auch Themen wie, wie kann man einen einfachen Einstieg in die Heimautomatisierung haben. Oder Wolfgang hat ein Thema präsentiert, Files sind die beste Art von Datenbanken, die man haben sollte. Und also einfach sowas was sie dir denkst packst besser nicht in produktion.",
      "start": 3374432,
      "end": 3396921,
      "confidence": 0.8097343749999997,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Warum war das nicht das war natürlich work related und natürlich packt man das in produktion du hast es falsch verstanden.",
      "start": 3397162,
      "end": 3402883,
      "confidence": 0.639857142857143,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Auf jeden fall einfach zur inspiration und du kannst natürlich auch als organisator externe speaker einladen kommt natürlich auf die auf die auf die dicke des pommes an denn es gibt ein paar speaker, die kosten richtig Geld. Es gibt ein paar Leute, die sind für, ich sag mal, die sind super engaging, vielleicht aus der lokalen Community, die kosten ein bisschen weniger, aber was da die Herausforderung ist, du hast ein sehr diverses Team, du hast das Mobile-Team da, dann machst du vielleicht noch ein Web-Applikationsteam, dann hast du noch das Business-Analytics-Team und Data-Scientist und Product-Owner und so weiter und so fort. Und wenn du dann zum Beispiel nur ein Fachtalk über Datenbanken machst oder über Stream-Prozesse oder frontend entwicklung oder irgendwas also der kino speaker muss dann halt schon ich sag mal auf einer art meta ebene schon in irgendeiner art und weise eine große variable audienz abholen und das ist dann unglaublich schwierig so das richtige thema zu finden.",
      "start": 3402903,
      "end": 3455790,
      "confidence": 0.766407407407408,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und meistens nicht sehr billig also wir hatten das bewusst bei diesem größeren event dann nicht mehr gemacht, Und meine persönliche Meinung ist, dass es eigentlich nicht irgendwie gefehlt hat. Also ich habe es völlig okay gefunden und wenn man dafür andere Dinge macht und einfach viele parallele Tracks und interessante Vorträge von der Firma selbst oder vielleicht auch den einen oder anderen Partner mit einlädt oder befreundete Firmen, kann man ja unter Umständen auch machen. Man hat da dann ein diverses Feld und mir persönlich ist so ein Keynote Speaker oder Speakerin nicht abgegangen oder ich habe es nicht vermisst, um das auf Hochdeutsch zu sagen.",
      "start": 3456030,
      "end": 3491265,
      "confidence": 0.8059532710280374,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Ein Thema, wo man auch darauf achten muss, ist, dass man solche Art von Events nicht inflationär betreibt, denn umso öfter sie stattfinden, umso weniger spannend werden sie. Wenn man halt jetzt jedes Quartal ein Hackathon macht, einmal im Quartal eine große Tech-Konferenz, dann alle zwei Wochen irgendwelche Guild-Meetings und du hast auch noch immer nur ein Book-Club noch nebenbei laufen und Team-Events hast du auch noch jeden Monat. Also irgendwann wird es halt ein bisschen viel und irgendwann ist halt das der neue Standard beziehungsweise das neue Normal und dann sind die Leute halt auch einfach satt davon. Und das hat man dann natürlich schon gemerkt, umso öfter man die ganze Sache macht, desto weniger Interesse ist da, weil man denkt, ach, geh ich heute nicht, kommt das nächste Event. Und das ist natürlich auf der einen Seite ein bisschen schade, aber auch verständlich.",
      "start": 3491946,
      "end": 3542058,
      "confidence": 0.8201034482758623,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und das Ganze ist auch auf der Organisationsseite ein großer Punkt, weil solche Events, egal wie groß sie sind, man braucht MitstreiterInnen für die Organisation, für das Pushen der Leute, dass alle Personen ihre Teams ansprechen, pushen. Die Organisation selbst, also so ein großes Event mit 500 Leuten, wir hatten da zwei Personen, die nur für die Event-Organisation da waren. Die waren sehr erfahren, haben die Event-Organisation gemacht mit dem Venue, das alles geklärt, das Rahmenprogramm und so weiter. Man braucht Technik. Für große Events braucht man Audio-Equipment, Mikrofone. Klar, bei einem Mini-Hackathon braucht man relativ wenig. Das kann man einfach machen. Aber auch da, es muss ein ordentliches Internet da sein. Wenn man bei einer anderen Location ist, man muss das vorbereiten. Wenn man eine LAN-Party macht, muss das auch irgendwer machen. Das heißt, man braucht ganz, ganz viele andere Leute. Und das passiert nicht, dass das nur zwei Leute auf die Beine stellen. Also auch bei uns, wir waren für den Content verantwortlich und die Struktur. aber da haben definitiv eine zweistellige anzahl an anderen leuten noch sehr stark mitgearbeitet im hintergrund und die leute muss man erst mal finden und die muss man die soll man auch finden also versucht egal was es ist keinen hackathon alleine zu starten man kann ihn starten aber man muss sich in dem ersten schritt und das glaube ich der absolute pro tipp andere personen suchen die einem helfen egal auf was für einer ebene Aber man muss ein Team sein, anders funktioniert sowas nicht, egal wie groß das Event ist. Und wenn man ständig solche Events hat, dann ist es extrem schwierig, natürlich Leute zu finden, weil jeder sagt, jetzt habe ich da den Hackathon schon mitorganisiert und da dieses Ding organisiert und so weiter. Und darum muss man das einfach im Rahmen halten. Und dann findet man auch die Leute, die da gerne mitmachen und die auch Spaß daran haben, Teile aus der Organisation zu übernehmen oder eben, wenn es auch nur ist, im Team das weiterzureichen und jemanden anzupushen, hey, mach doch einen Talk dort.",
      "start": 3542278,
      "end": 3650666,
      "confidence": 0.8196512968299705,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und bitte, bitte, bitte unterschätzt den zeitlichen Aufwand, den ihr damit habt, nicht. Denn das ist keine Tagesaufgabe, das ist keine Wochenaufgabe. Je größer das Event, desto eher gehen da Wochen rein. Und ich rede jetzt nicht von Wochen kontinuierlich 40 Stunden Arbeit, sondern immer mal wieder. Und dann läufst du wieder drei Stunden durchs Büro und kümmerst dich um Kommunikation und hast Alignment-Meetings. Und ich glaube, wir haben allein für die Erstellung des Programms, also des Ablaufs der Agenda mehrere Stunden gebraucht, damit man einigermaßen diverses Setup hat. Also spricht das bitte dann auch mit euren Vorgesetzten ab. Und ganz wichtig, checkt das vorher ab, ist das Arbeit, die auch anerkannt wird von euren Vorgesetzten. Denn Eventorganisation, und all das gehört zu Eventorganisation, steht oft nicht in der Stellenbeschreibung eines Software-Engineers, eines Engineering-Managers oder oder oder.",
      "start": 3651328,
      "end": 3709593,
      "confidence": 0.8551970802919708,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Beziehungsweise muss halt klargestellt werden, dass das keine klassische Event-Organisation ist, sondern eigentlich Knowledge-Sharing. Also man macht es ja, um dann Knowledge-Sharing zu ermöglichen erst. Und diese Connection muss man oft herstellen, auch wenn in der Profilbeschreibung drin steht Knowledge-Sharing, ist klar. Aber dass man dann ein ganzes Event organisiert, ist oft dem Management einfach nicht klar. Und diesen Link muss man herstellen. Und das kann man ja, glaube ich, auch gut zeigen. Aber das muss einfach klar sein, dass das verdammt viel Arbeit ist. Und wir hatten für die große Konferenz sicher eine Vorlaufzeit von fast einem Jahr, würde ich sagen. Und natürlich, wie gesagt, nicht nur auf unseren Schultern, sondern auf ganz vielen anderen Schultern auch.",
      "start": 3710093,
      "end": 3745871,
      "confidence": 0.8313474576271189,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und wenn ihr das mal auf kleinem Scale üben wollt, sind Meetups natürlich eine unglaublich gute Art, sowas mal zu üben. Denn eigentlich ist es genau dasselbe, wenn du zwei Talks, a 30 Minuten an einem Abend hast, ist das so eine Art Minikonferenz. Du hast Gäste, du hast Speaker, du hast Technik zu organisieren, Da kriegt man so einen kleinen Vorgeschmack, was das eigentlich bedeutet.",
      "start": 3745912,
      "end": 3768328,
      "confidence": 0.6803181818181818,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und bei den meisten Meetups kann man sich auch relativ einfach einbringen und vielleicht da mal reinschnuppern. Das ist definitiv möglich. Und in der Firma, man kann ja auch mit den kleinen Meetups eben starten, mit Guild-Meetings, was es auch immer ist. Also ich empfehle auch jetzt nicht gleich mit irgendeiner großen Inhouse-Konferenz zu starten, sondern da schon mal langsam reinzuwachsen. Aber auch bei einem kleinen Hackathon unterschätzt man oft, wie viel Aufwand es am Ende ist, um das Ganze zu organisieren.",
      "start": 3768368,
      "end": 3790748,
      "confidence": 0.8140000000000001,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Wenn man jetzt natürlich eine Public-Konferenz organisiert, da gibt es natürlich nach oben hin keine Grenzen. Da gibt es zum Beispiel eine sehr, sehr schöne Podcast-Episode vom Working Draft Podcast, wo Marc Thiele zum Gast ist. Und er ist der Organisator von der Beyond-Tellerrand-Konferenz, die es unter anderem in Berlin und in Düsseldorf gibt. Eine unglaublich schöne Konferenz. Was da alles zugehört, ist natürlich eine deutlich größere Ecke.",
      "start": 3791114,
      "end": 3817873,
      "confidence": 0.8437205882352944,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und wir haben auch schon mal in Episode 29 über Meetups und Konferenzen organisieren gesprochen, also gerne auch da mal reinhören. Und ganz allgemein haben wir aktuell, glaube ich, sieben Episoden zu Knowledge Sharing, zu diesem Topic, also auch bei dem Tag. Wir verlinken den natürlich in den Show Notes, gerne mal reinhören, wenn ihr dann noch was nicht gehört habt, was ja durchaus passieren kann.",
      "start": 3818465,
      "end": 3837911,
      "confidence": 0.7728030303030303,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Uns würde aber schon mal interessieren, A, organisiert ihr solche Events innerhalb eurer Firma? B, besucht ihr solche Events in der Firma? Und wenn ja, was denkt ihr darüber? Sagt ihr, die sind wirklich sinnvoll? Oder wir würden einfach auch gerne mal wissen, findet ihr ebenfalls Bookclubs oder Readingclubs top-notch? Oder seid ihr eher so der Team-Event-Freund? Kommt gerne in unsere Discord-Community. Link auch in den Show-Notes. Oder schreibt uns eine E-Mail. Wir sind wirklich wirklich interessiert daran, denn wie gesagt Kultur und das all das ist schon irgendeine Art Contribution zur Firmenkultur ist essentiell, nicht nur für eine gute Arbeitsumgebung, sondern auch für gutes Output Delivery möchte ich mal sagen.",
      "start": 3838171,
      "end": 3879447,
      "confidence": 0.8155945945945943,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Und für schnelles Feedback, wie immer, scrollt mal runter in den Shownotes. Daumen rauf oder Daumen runter, wie euch die Episode gefallen hat. Wenn ihr einen Daumen rauf wählt, bitte überlegt auch, wen könnt ihr dieser Episode noch interessieren. Schickt es mal die Runde an andere interessierte Leute. Würde uns sehr freuen und auch sehr helfen.",
      "start": 3879997,
      "end": 3897321,
      "confidence": 0.754125,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Das war's von uns. Bis zum nächsten Mal.",
      "start": 3897361,
      "end": 3899161,
      "confidence": 0.7686249999999999,
      "channel": null,
      "speaker": "A"
    },
    {
      "text": "Bye bye. Tschau.",
      "start": 3899201,
      "end": 3902722,
      "confidence": 0.43966666666666665,
      "channel": null,
      "speaker": "B"
    },
    {
      "text": "Und nicht vergessen, Schulungen im Bereich der Webentwicklung gibt es bei unserem Episodensponsor workshops.de. Link in den Shownotes.",
      "start": 3902762,
      "end": 3909583,
      "confidence": 0.8265555555555556,
      "channel": null,
      "speaker": "A"
    }
  ],
  "confidence": 0.8051875856164371,
  "audio_duration": 3909.0,
  "webhook_status_code": null,
  "webhook_auth": false,
  "summary": null,
  "auto_highlights_result": null,
  "content_safety_labels": null,
  "chapters": null,
  "sentiment_analysis_results": null,
  "entities": null
}
