{
    "language_code": "de",
    "audio_url": "https://audio1.redcircle.com/episodes/b28d79d5-f0c1-418b-8c7c-a29a8869087f/stream.mp3",
    "punctuate": true,
    "format_text": true,
    "dual_channel": false,
    "webhook_url": null,
    "webhook_auth_header_name": null,
    "webhook_auth_header_value": null,
    "audio_start_from": null,
    "audio_end_at": null,
    "word_boost": [],
    "boost_param": null,
    "filter_profanity": false,
    "redact_pii": false,
    "redact_pii_audio": false,
    "redact_pii_policies": null,
    "redact_pii_sub": null,
    "speaker_labels": true,
    "speakers_expected": 3,
    "content_safety": false,
    "content_safety_confidence": null,
    "iab_categories": false,
    "custom_spelling": null,
    "disfluencies": false,
    "sentiment_analysis": false,
    "auto_chapters": false,
    "entity_detection": false,
    "summarization": false,
    "summary_model": null,
    "summary_type": null,
    "auto_highlights": false,
    "language_detection": false,
    "speech_threshold": null,
    "id": "6vqq96iohj-ed50-43b6-b4ee-171f3077ff51",
    "status": "completed",
    "error": null,
    "utterances": [
        {
            "text": "In vielen Diskussionen geht es darum, welche Lösung die bessere ist und einen größeren Impact hat. Viele Entscheidungen werden aus dem Bauch heraus getroffen, obwohl gesagt wird, dass wir datengetrieben arbeiten. Doch Daten und Ergebnisse sind oft nicht vorhanden. Experimente wie A-B-Tests und ein passendes Mindset können in solchen Situationen helfen. Hypothese aufstellen, Experiment umsetzen, Ergebnis evaluieren und das Ganze wiederholen. Klingt einfach. Experimentelles Mindset? Check! Doch wie macht man sowas denn im Detail? Auf welche und wie viele Metriken schaut man während eines Experiments? Wie lange darf es dauern? Kann ich das Ganze auch mit wenig Kunden und Traffic umsetzen? Was sind die typischen Fehler beim AB-Testing? Und was ist eigentlich ein P-Wert, eine statistische Signifikanz, eine Power-Analyse, ein AA-Test oder der Priming-Effekt? Das und noch viel, viel mehr in dieser Episode mit unserem Gast Dr. Philipp Monreal. Viel Spaß!",
            "start": 4131,
            "end": 56592,
            "confidence": 0.8450567375886526,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "So, Andi, jetzt erklär mal unseren guten ZuhörerInnen, warum wir remote miteinander telefonieren, obwohl ich in Düsseldorf bin.",
            "start": 61696,
            "end": 70583,
            "confidence": 0.7828888888888889,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es fängt alles immer mit dem Kegelclub an. Jeder, der im Kegelclub ist, weiß, dass man Mitgliedsbeiträge für ein großes Event pro Jahr zahlt. Die Kegeltour. Die war am vergangenen Wochenende. Was habe ich mit nach Hause genommen? Corona.",
            "start": 70623,
            "end": 83854,
            "confidence": 0.8590256410256409,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Gratuliere.",
            "start": 83894,
            "end": 84795,
            "confidence": 0.823,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Lohnt sich.",
            "start": 84855,
            "end": 85575,
            "confidence": 0.528,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die Konferenzenseuche quasi. Nur, dass es keine Konferenz war.",
            "start": 85595,
            "end": 88658,
            "confidence": 0.8059999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Meines Erachtens nach verschieben wir den Podcast aber, ich sag mal so, im Modus der modernen Arbeitswelt. Erst waren alle remote und jetzt langsam gehen sie wieder hybrid und zurück ins Büro, drei Tage die Woche. Und genau das tun wir heute auch, denn wir haben heute mal wieder einen Gast. Wir haben aber ein Hybrid-Setup. Der Wolfgang, der Österreicher, sitzt in einer Düsseldorfer Wohnung.",
            "start": 89038,
            "end": 110729,
            "confidence": 0.8735999999999998,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich bin extra nach Düsseldorf gereist für unseren heutigen Gast.",
            "start": 110749,
            "end": 113712,
            "confidence": 0.7474999999999998,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vor Ort die erste In-Persona-Aufnahme. Ich, der eine Stadt weiter wirklich wohnt, sitze zu Hause im Büro mit Corona. Na ja, schauen wir mal, ob dieses Hybrid-Arbeiten so wirklich funktioniert.",
            "start": 113752,
            "end": 126083,
            "confidence": 0.8391666666666667,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Also ein sehr experimentelles Setup und das ist genau das Thema, worüber wir heute sprechen.",
            "start": 126303,
            "end": 130565,
            "confidence": 0.7716666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und zwar haben wir von Experimentieren eigentlich relativ wenig Ahnung und haben uns deswegen einen Experten ins Haus geholt. Hallo Philipp.",
            "start": 130604,
            "end": 136768,
            "confidence": 0.8295714285714285,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Hi Andi, hi Wolfgang. Dankeschön für die Einladung.",
            "start": 137148,
            "end": 139849,
            "confidence": 0.7925,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Freut mich. Ja, danke fürs Kommen.",
            "start": 139889,
            "end": 141310,
            "confidence": 0.48666666666666664,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Freut mich, dass ich hier sein kann, mit euch quatschen kann.",
            "start": 141330,
            "end": 143570,
            "confidence": 0.7014545454545456,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Lieber Philipp, du hast einen Doktor in angewandter Mathematik von der RWTH Aachen. Deine komplette berufliche Laufbahn dreht sich auch um Daten. Wir haben uns beruflich bei Trivago kennengelernt, da wurde unter anderem Business Intelligence Analyst und für den Marktplatz von Trivago verantwortlich warst. Danach hast du dir mal gedacht, okay ich gehe mal in die Energiewirtschaft und warst Head of Data bei Lichtblick und arbeitest inzwischen als Head of AI für Eneco, das ist, soviel ich weiß, ein niederländisches Energieversorgungsunternehmen. Und du hast 2015 mal ein Slide Deck, eine Präsentation mit dem Titel Street Fighting Mars gemacht. Und ich würde gerne wissen, welche Art von Mathe brauche ich, um Straßenkampf zu gewinnen?",
            "start": 143610,
            "end": 186311,
            "confidence": 0.8469734513274336,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay, danke für die Intro. Ist tatsächlich immer noch ein Thema, was mir sehr am Herzen liegt. Und zwar glaube ich, dass ein ganz nützlicher Skill, den viele von uns, auch Developer, sehr gut gebrauchen können, ist es, schnell Abschätzungen zu machen. Das ist so quasi das Pareto-Prinzip auf die Mathematik gemünzt, dass man nicht lange braucht, um ein exaktes Ergebnis zu finden, sondern wie man schnell eine einfache Abschätzung machen kann. Zum Beispiel, wie lange brauche ich, um MVP zu launchen. Dass man einfach, dass man gut darin wird, schnell zu schätzen, schnell zu überschlagen. Das war damals das Thema.",
            "start": 186972,
            "end": 223325,
            "confidence": 0.8363366336633664,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Da räst du ja bei Andi die Türen ein, weil er ist ein Fan vom dreckigen Programmieren und alles schnell machen.",
            "start": 223345,
            "end": 228310,
            "confidence": 0.6959047619047619,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sagte der, der ein eigenes Meetup-Anmeldesystem vor kurzem geschrieben hat und dann die typische Frage bekommen hat, hey, wieso registrieren sich eigentlich alle immer Bot-User hier? Kann ich jetzt selbst meine Bot-Detection bauen? Jeder normale Entwickler würde sagen, lieber Wolfgang, baue einfach mal ein Capture ein. Nee, ich habe gelesen, man baut ein Hidden-Secret-Input-Feld ein und Bots füllen eh immer alle Felder aus und deswegen baue ich jetzt meine eigene Bot-Detection.",
            "start": 228330,
            "end": 251404,
            "confidence": 0.7841408450704225,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, das war ein super Tipp von Frankie aus unserer Community übrigens, den ich in Düsseldorf getroffen habe. Also danke dafür. Das funktioniert nämlich wirklich. Die Bots sind jetzt ausgeschlossen vorerst.",
            "start": 251424,
            "end": 262047,
            "confidence": 0.7622903225806452,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "War das dein erstes Experiment?",
            "start": 262067,
            "end": 263168,
            "confidence": 0.742,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das war mein erstes Experiment, ja. Wobei mein Test-Setup natürlich sehr schwach ist, weil ich schaue einfach in den Logs nach, ob da irgendwo was auftaucht oder nicht.",
            "start": 263888,
            "end": 271744,
            "confidence": 0.7894285714285715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Manuelle Body Detection.",
            "start": 271784,
            "end": 273287,
            "confidence": 0.607,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau, also quasi.",
            "start": 273307,
            "end": 274349,
            "confidence": 0.5843333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, nein, nein, ja.",
            "start": 274389,
            "end": 275651,
            "confidence": 0.68,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber genau das ist das Thema von heute, wie man richtig testet und wie man richtige Experimente aufsetzt, weil wir Entwickler haben ja sehr oft damit zu tun eigentlich in irgendeiner Form und programmieren da im Hintergrund was. Aber was da eigentlich dann wirklich passiert und warum man das macht, da hat man entweder wenig Einblick oder man arbeitet halt weniger damit. Da hat man dann irgendwelche Data Scientists oder Data Leute, die das aufsetzen. Und da wollen wir mal ein bisschen Licht in das Ganze reinbringen, wie das denn so funktioniert grundsätzlich und warum man das überhaupt macht. Und da bist du ja absoluter Spezialist. Und ich kann mich nur erinnern an unsere Trivago-Zeit, wo man irgendwie hunderte Tests parallel am Laufen gehabt hat. Und irgendwo ist die Magic im Hintergrund passiert und dann ist irgendwo eine Zahl rausgeputzelt und man hat gewusst, die Änderung war gut. Der rote Button war besser als der blaue Button. Und man hat dann gewusst, wie man weitermacht. Aber wenn man so ein Setup angeht, so ein Experiment, wo startet man denn da? Wenn ich jetzt irgendwie auch mal ein kleines Produkt oder so am Start habe und ich möchte jetzt irgendwas ausprobieren, wo fange ich denn da überhaupt an grundsätzlich?",
            "start": 278555,
            "end": 343037,
            "confidence": 0.808081730769231,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, das Wichtige ist, dass man anfängt mit dem Mindset und mit der Kultur. Dass man Klarheit schafft, was wollen wir hier überhaupt erreichen. Aus meiner Sicht ist der Purpose, der Sinn und Zweck vom Experimentieren ist, dass wir so schnell lernen wie möglich.",
            "start": 343872,
            "end": 361923,
            "confidence": 0.858533333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also das ist wie beim Streetfighting, dass man möglichst schnell an ein Ergebnis kommt. Seht ihr das richtig?",
            "start": 362323,
            "end": 368107,
            "confidence": 0.6148333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kurze Frage, was ist das Ergebnis vom Streetfighting? Dass der Gegner K.O.",
            "start": 368127,
            "end": 370809,
            "confidence": 0.6764166666666668,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ist? Ich ignoriere jetzt einfach beide eurer Aussagen. Dass man Purpose ist, in meinen Augen, dass man so schnell lernt, wie es geht. Meine persönliche Sichtweise ist, dass die Welt ist viel zu vuca, viel zu komplex, viel zu kompliziert, viel zu volatil. Es ist unrealistisch, dass man lange in die Zukunft plant. Und es ist unrealistisch, dass man von vornherein weiß, was der Effekt sein wird, wie ein Produkt ankommt, wie das Feature auf der Webseite von den Usern genutzt wird.",
            "start": 370829,
            "end": 406043,
            "confidence": 0.8471829268292681,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber wenn jetzt ganz klassisch, das kennen wir ja alle, MVP-Ansatz, ich komme jetzt irgendwie schnell mit einem Produkt oder mit einem Feature raus, warum brauche ich da überhaupt mein experimentelles Setup? Ich kann ja einfach drauf losprogrammieren, habe jetzt dann mein Feature und das geht dann online und fertig.",
            "start": 406600,
            "end": 421081,
            "confidence": 0.74166,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Ich glaube, dass gehört total zusammen. Die agile, iterative Softwareentwicklung, die passt wie die Hand in den Handschuh mit dem experimentellen Mindset.",
            "start": 421442,
            "end": 430865,
            "confidence": 0.675695652173913,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber ist das dann schon ein experimentelles Mindset, wenn ich jetzt sage, ich bin MVP getrieben?",
            "start": 430885,
            "end": 435106,
            "confidence": 0.661125,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein, noch nicht. Das experimentelle Mindset ist dann, dass ich sage, okay, in jeder Iteration, die ich jetzt mache, will ich verstehen, bringt sie mich ein Stück dahin, wo ich hin will? Löse ich wirklich das Problem, was ich lösen will? Habe ich also Klarheit darüber, was überhaupt meine Hypothese, was mein Ziel ist?",
            "start": 435166,
            "end": 452330,
            "confidence": 0.8054074074074073,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt, ich muss aber überhaupt mal ein Ziel definieren oder eine Hypothese. Was ist eine Hypothese? Ist Ziel und Hypothese dasselbe?",
            "start": 453170,
            "end": 460832,
            "confidence": 0.7280000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee. Eine Hypothese ist eine Formulierung, eine Annahme, was geschehen wird.",
            "start": 460892,
            "end": 466914,
            "confidence": 0.8746363636363637,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Hast du da ein Beispiel aus der Praxis, was sowas sein könnte?",
            "start": 466934,
            "end": 470814,
            "confidence": 0.7836666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Klar. Also ich fange an mit einem Purpose. Und zwar sage ich, ich will ein Produkt bauen, das soll meinem Kunden ermöglichen, X zu tun. Ein Self-Service-Produkt. dass er nicht bei mir eine Hotline anrufen muss, um irgendwas nachzufragen, sondern dass er selber sich informieren kann. Da fange ich jetzt einfach mal an. Das ist jetzt das Problem, was ich lösen möchte. Und kommt das Team zusammen und überlegt, okay, was können wir machen? Wir können Website dafür bauen, wir können ein Chatbot implementieren, I don't know. Eine Hypothese ist, wenn ich dann sagen würde, indem wir ein Chatbot live nehmen, reduzieren wir die Anfragen per Telefon um 30 Prozent. Das wäre ein Beispiel einer Hypothese und ein Experiment ist etwas, das man tut, um diese Hypothese zu verifizieren.",
            "start": 470854,
            "end": 519193,
            "confidence": 0.7647751937984497,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Oder zu widerlegen wahrscheinlich.",
            "start": 519232,
            "end": 520254,
            "confidence": 0.7014999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Oder zu widerlegen, genau. Und das heißt, in Quintessenz ist, worum es beim Experimentieren geht, ist, so schnell zu lernen wie möglich. Dass ich verstehe, das, was ich getan habe, funktioniert das, geht das in die Richtung, löst das das Problem, was ich lösen will. Und im besten Falle auch, dass ich das quantifizieren kann. Also wenn wir jetzt im Sinne von Conversion Rate denken oder so.",
            "start": 520274,
            "end": 545887,
            "confidence": 0.7245671641791046,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt aber auch, dass ich die Antwort auf diese Hypothese oder die Validierung eigentlich nach hinten verschiebe, weil was man ja ganz oft und gern macht, ist in der Diskussion, zu sagen, das würde uns 30 Prozent dann Support-Hotline reduzieren und darum bauen wir das jetzt. Und dann nimmt man das schon an als gegeben und baut drauf los. Und in dem Fall nehme ich es aber nur mal an, beantworte das noch nicht, baue das Ganze und beantworte dann später wirklich mit Daten, ob das gestimmt hat oder nicht.",
            "start": 545927,
            "end": 574367,
            "confidence": 0.8252637362637365,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. dieses Hypothesengetrieben entwickeln, das erlaubt auch am Anfang, dass man viel konstruktiver miteinander diskutieren kann. Sobald man Sachen quantifiziert und sobald man über Annahmen und Hypothesen spricht, kann man meiner Erfahrung nach viel konstruktiver miteinander diskutieren. Um ein Beispiel zu geben, wenn du zehn Leute vor ein Whiteboard setzt und dann überlegt man, wie kann ich Problem X lösen? Dann kommen dabei 20 Ideen raus und jeder argumentiert, nee, das ist aber besser und nee, das ist aber besser. Und dann kann man sich fröhlich stundenlang im Kreis drehen. Sobald man anfängt, seine Annahmen explizit zu machen, hat man viel greifbares Thema in der Diskussion. Kann man sagen, hey Wolfgang, warum glaubst du, dass dieses Feature von 50% der Leute wirklich genutzt wird? Ich glaube, die Annahme ist viel zu hoch. Ich glaube, höchsten 10% der Nutzer werden das jemals verwenden.",
            "start": 574407,
            "end": 628885,
            "confidence": 0.8318591549295775,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber ich spare mir dann eigentlich die Diskussion, weil ich das eigentlich dann später beantworte. Ich brauche mir gar nicht festlegen, ist es 50 Prozent, ist es 10 Prozent. Ich kann natürlich was festlegen, wie weit es gehen soll, aber die Zahl, die dann am Ende rauskommt, die kommt ja dann später. Also ich muss jetzt nicht mich mit irgendwem festlegen auf eine Zahl, oder? Vielleicht auf eine Minimalzahl, die ich erreichen will.",
            "start": 629943,
            "end": 648021,
            "confidence": 0.7364520547945207,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, die Zahl, die Hypothese am Anfang, die bringt vor allem, dass man denkt, ist es das überhaupt wert? Wenn ich jetzt ein Produkt bauen will und von vornherein ist meine Annahme, das verwenden nur zwei Prozent der Nutzer und ein schlauer Softwareentwickler sagt hintendran, okay, das dauert aber drei Monate, das zu entwickeln, dann spart man sich das gleich von vornherein. Wenn man sagt, okay, Wenn das die Annahme ist vom Wert und das ist meine Annahme der Komplexität, dann brauche ich es gar nicht, in die Entwicklung einzusteigen.",
            "start": 648782,
            "end": 680373,
            "confidence": 0.8189120879120878,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also man muss wirklich alles ausprobieren.",
            "start": 680413,
            "end": 682294,
            "confidence": 0.6934999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das bedeutet aber auch, ich meine kulturtechnisch, auf der einen Seite veränderst du die Diskussion und auch die Diskussionsgrundlage. Auf der anderen Seite muss natürlich auch eine ganze Menge Arbeit investiert werden, um die Hypothesen dann entweder zu verifizieren oder halt zu sagen, okay, die ist falsch. Das bedeutet auch, dass man in der Regel für eine Lösung vier Prototypen baut und diese testet, oder? Oder fünf oder wie viele Ideen noch immer auf dem Tisch sind.",
            "start": 682314,
            "end": 705788,
            "confidence": 0.8056233766233767,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Genau, dass man einfach kontinuierlich iteriert. So würde ich sagen. Du fängst mit einer Iteration an, schaust, ist die gut? Ist die gut genug? Und du überlegst, okay, will ich daran weitermachen oder will ich jetzt versuchen, ein anderes Problem zu lösen? Aber diese Kultur, ich glaube, man braucht als Unternehmen drei Dinge, glaube ich, die Teil von dieser Kultur sind. Das eine ist überhaupt, dass man die Bescheidenheit hat, sich einzugestehen, dass man meistens keine Ahnung hat, was passieren wird. Das hört sich im ersten Moment trivial an.",
            "start": 705808,
            "end": 740224,
            "confidence": 0.8065955056179774,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich glaube, dass die meisten das nicht annehmen. Die meisten nehmen an, sie wissen alles.",
            "start": 740424,
            "end": 745007,
            "confidence": 0.7991333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das Schlimme ist, je erfahrener man ist, je länger man im Job ist, desto mehr nimmt das oder kann das tendenziell abnehmen. Ich weiß sowieso, was passieren wird. Ich weiß sowieso, dass das klappt. Ich weiß sowieso, dass das nicht klappt. Und das ist ein ganz wichtiger Punkt. Wenn man so drauf ist, wenn man einen Chef hat, der so drauf ist. Ich weiß eh, was der beste Marketing-Channel ist. Ich weiß eh, das Produkt fliegt nicht. Jungs, dann sparen wir uns erst mal die Arbeit. Das ist, glaube ich, schon mal der erste ganz wichtige, fundamentale Punkt, dass man sich eingesteht, dass man überhaupt lernen will, dass man zwar eine Idee, eine Annahme hat, aber es mag anders kommen. Ich glaube, das ist total wichtig da anzufangen. Wenn man von dieser Grundidee anfängt in der Kultur und sagt, okay, Lernen an sich ist für mich jetzt ein Wert, dann glaube ich, hat das total positiven Einfluss auf die gesamte Kultur. Weil wenn Lernen für mich ein Wert ist, dann ist es auf einmal nicht mehr schlimm, wenn ich einen Fehler mache, solange ich nur dadurch was Neues verstehe oder dadurch schlauer werde. Ich bin überzeugt, das ist fundamental nützlich. Das gibt so ein total angenehmer, wie sagt man, psychological safety. Dass man nicht mehr Angst haben muss davor, dass man irgendwas zerschießt. Und es gibt auch mittelfristig einfach die besten Ergebnisse, wenn ich meine Kultur darauf trimme, schnell besser zu werden.",
            "start": 745027,
            "end": 827747,
            "confidence": 0.795304526748971,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt, so ein Hypothesen getriebener Ansatz ist dann eigentlich eine Implementierung von so einer Learning Culture. Wenn ich die umsetzen will in meinem Unternehmen, dann ist das ein Punkt, der in diese Richtung dann geht und das überhaupt ermöglicht, wenn ich solche Hypothesen mache. Wenn ich so Hypothesen dann mich entschieden habe im Team, ich möchte eben das erreichen mit 30 Prozent, Was ist denn dann der nächste Schritt? Der klassische nächste Schritt ist einfach mal losprogrammieren. Aber muss ich dann irgendwie auf anderen Ebenen noch zusätzlich was sicherstellen, bereitstellen? Also wie kann ich das sicherstellen, dass das nicht der reine, was heißt Failure auf Deutsch?",
            "start": 827807,
            "end": 864519,
            "confidence": 0.7872056074766351,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Misserfolg.",
            "start": 864539,
            "end": 865359,
            "confidence": 0.781,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Misserfolg, genau. Klingt aber sehr eigenartig, Misserfolg. Aber dass das eben kein Misserfolg wird.",
            "start": 865399,
            "end": 869840,
            "confidence": 0.6327142857142858,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Also ich glaube, da fehlen noch zwei Sachen. Die eine Sache, die oft unterschätzt wird, ist, die eine Metrik zu finden. The one to rule them all. Man denkt, okay, ich ballere jetzt einfach einen Test raus und schaue mir zehn Metriken an und dann werde ich schon irgendwas lernen.",
            "start": 869880,
            "end": 884424,
            "confidence": 0.75184,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber es setzt schon mal voraus, dass ich überhaupt Metriken habe. Also bei ganz vielen Projekten und Produkten habe ich ja womöglich gar keine Metriken. Oder vielleicht habe ich so Server Speed oder so, gerade wenn man im technischen Bereich unterwegs ist. Die Metriken, die du jetzt meinst, sind ja wahrscheinlich dann irgendwelche Metriken, die im Bezug zu dem Produkt stehen oder die mir helfen, meine Hypothese zu bewerten.",
            "start": 885065,
            "end": 906085,
            "confidence": 0.7449130434782606,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, das ist ein ganz wichtiger Schritt und ich glaube, der wird oft total unterschätzt und oft auch vernachlässigt und ist auch in den meisten Fällen alles andere als trivial. Wie finde ich denn eigentlich eine Metrik, die das misst, woran ich wirklich interessiert bin?",
            "start": 906105,
            "end": 919359,
            "confidence": 0.8150666666666669,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn wir bei dem Beispiel bleiben mit den 30% Telefonsupport und ich mache jetzt da dieses Portal, wo sich meine Kunden selbstständig einloggen können, was wären da dann sinnvolle Metriken?",
            "start": 919899,
            "end": 930350,
            "confidence": 0.8079333333333334,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In diesem Beispiel würde ich jetzt sagen Kontaktvolumen.",
            "start": 930410,
            "end": 932913,
            "confidence": 0.863625,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also beim Telefonsupport.",
            "start": 932953,
            "end": 935115,
            "confidence": 0.8306666666666667,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Anzahl der Anrufe pro Tag.",
            "start": 935195,
            "end": 936837,
            "confidence": 0.6396,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber sollte man Metriken dann wirklich einzeln betrachten, weil wenn ich mir dein Beispiel jetzt rausnehme und wir betrachten den Zeitraum, wenn Deutschland gerade bei der Weltmeisterschaft spielt. Ich gehe mal stark davon aus, dass das Kontaktvolumen in einem Callcenter in Deutschland, wenn Deutschland ein WM-Spiel hat, relativ niedrig sein wird. Sollte man jetzt in deinem Beispiel dann zum Beispiel nicht die Anzahl der Logins in diesem Portal noch gegennehmen als zweite Metrik, um zu verifizieren, okay, die Leute sind wirklich von dem einen Telefonkanal auf den Webkanal gewechselt oder ähnliches?",
            "start": 937357,
            "end": 968935,
            "confidence": 0.8362857142857143,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Nee, das kommt später im Teil, wenn wir ein bisschen darüber quatschen, wie ich einen Test aufsetze und wie ich einen Test evaluiere. Also meine Message wäre, dass man erstens sich nur eine einzige Metrik nimmt, nicht mehrere. Ja, weil sobald ich mehrere Metriken habe, passiert in den meisten Fällen, dass derjenige, der die Idee hatte, möchte gerne, dass seine Idee gut war, weil das fühlt sich total klasse an. Und wenn ich mehrere Metriken habe, aus denen ich mir aussuchen kann, dann suche ich mir doch die aus, die zeigt, dass meine Idee geklappt hat. Und das ist so Punkt eins, eine Metrik in einem Test, in einem Experiment, nicht mehrere. Und die zweite ist, dass man Proxymetriken vermeidet, dass man wirklich das misst, woran man interessiert ist, dass man das misst, was man will.",
            "start": 968975,
            "end": 1016797,
            "confidence": 0.8155367647058822,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Was wäre eine Proxymetrik?",
            "start": 1016837,
            "end": 1017838,
            "confidence": 0.60875,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Bleiben wir bei dem Beispiel. Was ich eigentlich will, ist, das Kontaktvolumen im Callcenter zu minimieren. Jetzt sagt mir irgendjemand, ja, aber das Callcenter läuft über Applikation XYZ und da haben wir kein Logging und das geht nicht. Aber ich kann genau loggen, wie viele Seitenaufrufe mein Selfservice hat. Das wäre eine Proxymetrik. Und dann kann es passieren, dass mein Self-Service total viele Seitenaufrufe hat, dass da aber irgendwas draufsteht, was die Nutzer noch mehr verwirrt und deswegen noch mehr Leute anrufen. Das heißt, miss wirklich das, woran du interessiert bist, nämlich in dem Fall das Anrufvolumen, auch wenn du vielleicht neues Logging implementieren musst irgendwo, anstatt einfach nur die Seitenaufrufe dir anzuschauen, die im schlimmsten Falle vielleicht sogar das, was du eigentlich verbessern willst, verschlechtern.",
            "start": 1018835,
            "end": 1064795,
            "confidence": 0.8088333333333331,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und wie lange misse ich dann so eine Metrik? Woher weiß ich wann? Also bei dem Beispiel jetzt, wenn der Andi sagt, da ist jetzt irgendwie die Fußball-WM oder sonst was. Also wenn ich nur diesen Zeitraum nehme von der Fußball-WM, dann werde ich wahrscheinlich irgendwie komische Daten sehen. Aber wie lange macht denn dann Sinn? Ist es ein Tag, eine Woche, ein Monat, ein Jahr?",
            "start": 1065538,
            "end": 1086417,
            "confidence": 0.7614242424242422,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das ist dann der Teil, wo wir darüber sprechen, wie designt man ein Experiment? Wie setze ich einen Test auf? Und was man dafür braucht, ist, dass man sich darüber unterhält, wie groß ist die Unsicherheit, die ich akzeptieren kann? Wie groß ist die Unsicherheit, die ich in Kauf, die ich bereit bin, in Kauf zu nehmen?",
            "start": 1087498,
            "end": 1104403,
            "confidence": 0.8259824561403509,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Die Unsicherheit wären jetzt einfach Prozentabweichungen oder von diesen 30 Prozent, die eigentlich erreichen werden?",
            "start": 1104423,
            "end": 1111085,
            "confidence": 0.7205999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt mathematisch gesehen gibt es zwei Arten von Fehlern, die ich in einem Test machen kann. Das eine ist die Wahrscheinlichkeit, dass meine Aussage, dass ich falsch positiv bin, oder dass ich falsch negativ bin. Also, kommen wir mit dem Beispiel zurück. Wenn ich ein Chatbot implementiere, dann kann es sein, dass mein Test mir sagt, der Chatbot hat was gebracht, in Wirklichkeit bringt der aber gar nichts. Das wäre also falsch positiv. Falsch negativ wäre, der Test sagt mir, der Chatbot bringt gar nichts, in Wirklichkeit ist der total klasse. Das sind die zwei Arten von, strukturell die zwei Arten von Fehlern, die man machen kann. Und je nach Kontext, je nach Applikation sollte man besprechen, okay, was ist mir jetzt an der Stelle wichtiger? Ist es jetzt das, weiß ich nicht, das Feature, was ich jetzt baue, macht meine ganze Applikation langsamer? Also will ich wirklich sicher sein, dass das Feature was bringt, bevor ich das Ding sozusagen in den Code einbaue? Das kann sein. Es kann aber auch sein, dass ich sage, okay, diese Art von Fehler ist für mich nicht so relevant. Wenn ich aber einen Uplift holen kann, will ich den auf jeden Fall haben. Also das, glaube ich, gibt es keine Standard für. Beziehungsweise es gibt in der Industrie so ein bisschen so ein Standard. Es ist dann die berühmte p-Wert von 5% und die 20% im Typ 2. An der Stelle möchte ich aber sagen, das halte ich für totalen Schmarrn. Es ist blöd, sich da auf so einen Standardwert zu verlassen, sondern man sollte immer, wenn man so einen Test designt, sich darüber unterhalten, okay, was für Unwahrscheinlichkeiten, was für Wahrscheinlichkeiten bin ich bereit, in Kauf zu nehmen. Und dann gibt es einfache Webseiten, wenn man mathematisch Bock hat, kann man es auch selber versuchen zu implementieren. Gibt's eine Formel, die tippe ich ein, und dann kommt raus, aha, ich brauche x User in der Testgruppe und x User in der Kontrollgruppe. Und dann kann man, das ist deine ursprüngliche Frage, dann kann man die ursprüngliche Frage beantworten, wie lange muss so ein Test denn laufen?",
            "start": 1111105,
            "end": 1218231,
            "confidence": 0.7619265536723165,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jetzt hast du gesagt zwei Gruppen. Würdest du jetzt beim Design von dem Chatbot zum Beispiel, um den Support zu erleichtern, würdest du dann auch zwei Gruppen designen? Also eine Usergruppe, Kundengruppe, die keinen Zugriff hat auf den Chatbot und eine andere Gruppe, die den Zugang bekommt?",
            "start": 1218251,
            "end": 1235634,
            "confidence": 0.7823829787234046,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau so. Das ist die Grundidee von einem AB-Test.",
            "start": 1235674,
            "end": 1238335,
            "confidence": 0.7889999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt, du müsstest dann aber beim Telefonsupport auch jeweils die Kundennummern abfragen, damit du die Zuordnung machen kannst, oder? Also aus welcher Testgruppe kommen die Kunden? Das heißt, das musst du im Vorhinein dann auch alles mitdesignen und festlegen und sicherstellen, dass du das eben auch trackst auf der Support-Seite, dass die Kundennummern mit aufgenommen werden und, und, und, dass das also wirklich im Vorhinein alles schon gesammelt wird, die Daten.",
            "start": 1238895,
            "end": 1263517,
            "confidence": 0.7923194444444449,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Richtig. Es gibt ja viele Plattformen, Experimentation-Plattforms, die dieses technische Problem lösen. Und das ist ein Aspekt, den die eigentlich alle haben, den man meistens, glaube ich, Feature-Flagging nennt, dass man eben genau diese Zuordnung macht.",
            "start": 1263577,
            "end": 1276685,
            "confidence": 0.8276111111111111,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wobei, die Zuordnung musst du ja dann wirklich, also du musst sicherstellen, dass dein Support zum Beispiel nach der Kundennummer fragt. Also wird wahrscheinlich eh immer der Fall sein, aber dass du das halt alles irgendwo aufzeichnest und das ja teilweise gar kein technisches Problem ist, sondern ein Prozessproblem oder ja, dass der Prozess halt so designt ist, damit du, dass du alle Daten auch wirklich mit aufzeichnest und danach verarbeiten kannst, irgendwo abgespeichert werden, damit die nicht die Kundennummer fragen und dann geht das irgendwo verloren, sondern dass das aufgezeichnet wird, getrackt wird, wie viele Anfragen kommen darüber hat.",
            "start": 1277485,
            "end": 1304413,
            "confidence": 0.7862299999999997,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 1305033,
            "end": 1305293,
            "confidence": 0.569,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber dieses Kriterium, wonach unterschieden wird, das kann ja wirklich alles sein, oder? Ich meine, ich kann würfeln im Web und dann einfach eine Session zuweisen. Ich kann sagen, alle Benutzer aus Deutschland kommen in die eine Gruppe, alle aus Frankreich aus der anderen, oder?",
            "start": 1305333,
            "end": 1320359,
            "confidence": 0.8735777777777776,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Super, dass du das ansprichst. Nein, du musst würfeln. Die Entscheidung, ob ein Nutzer eine Test- oder eine Kontrollgruppe ist, die muss zufällig sein. Ihr habt bestimmt schon mal gehört, Doppelblindstudien im pharmazeutischen Bereich. Wenn ich von vornherein sage, ich schwenke jetzt mal auf ein anderes Beispiel, ich glaube, dass das jeder kennt. Ich will jetzt wissen, ob meine Pille den gewünschten Effekt hat, dass die Effekt X hat. Wenn ich von vornherein sage, okay, aber alle Männer kriegen jetzt die Pille mit dem Wirkstoff und alle Frauen kriegen jetzt den Placebo, dann ist das kein wirkliches Experiment. Also die Zuordnung muss zufällig sein und der Grund dafür ist ganz einfach. Die Welt ist kompliziert und es gibt unvorstellbar viele Zusammenhänge und dadurch dass ich die Zuordnung komplett zufällig mache, nämlich also diese, man nennt das Confounding-Variables, nämlich den Effekt von denen raus. Also es hat ja einen Impact, ob ich zum Beispiel bei der Customer-Hotline anrufe, hat es, glaube ich, einen Impact danach, je nachdem, wie alt ist ein Kunde. Die eine Altersgruppe ruft vielleicht mehr an als die andere. Es hat auch einen bestimmten kulturellen Impact. Es gibt, wenn ich aus bestimmten Ländern würde, wahrscheinlich lieber eine Customer-Hotline anrufen als aus anderen Ländern.",
            "start": 1320399,
            "end": 1389400,
            "confidence": 0.7645073170731704,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber wenn wir bei dem Beispiel bleiben, mit dem Alter, würdest du dann, wenn man das zum Beispiel designt, dass man sagt, okay, ich möchte meine alten Kunden, die werden das sowieso nicht mehr auf die Reihe bekommen, ich baue dieses Feature jetzt nur für die Jungen, würdest du dann das trotzdem komplett randomisieren oder wirklich dann in den jungen Zielgruppen randomisieren?",
            "start": 1390135,
            "end": 1409335,
            "confidence": 0.7619032258064516,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Okay, dann randomisiere ich halt in den jungen. Aber der Punkt ist, am Ende des Tages, die Zuordnung in Test- und Kontrollgruppe muss zufällig sein. Sonst funktioniert die gesamte Statistik nicht mehr. Die Idee von der zufälligen Zuordnung ist, dass ich den Effekt von meiner Änderung messe. Und sobald ich mir selbstständig angucke, wer kriegt A, wer kriegt B, messe ich nicht nur den Effekt von meiner Veränderung, sondern messe ich auch den Unterschied zwischen diesen Menschen. Und ich kann es nachher nicht auseinanderhalten, was ist was.",
            "start": 1409395,
            "end": 1437883,
            "confidence": 0.7873908045977012,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also jetzt ganz praktisch gesprochen, wenn ich jetzt eine kleine Firma habe und zehn Kunden, kann ich dann überhaupt so ein Experiment designen, dass das funktioniert? Oder brauche ich da wirklich tausende Kunden? Also klar, es gibt diese Formel, aber jetzt wenn wir mal ganz einfach möglichst abstrakt denken, geht das überhaupt mit zehn Leuten oder ist das absolut unmöglich?",
            "start": 1437923,
            "end": 1457414,
            "confidence": 0.7628500000000003,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Es geht. Statistik und A-B-Testing, was wir heutzutage A-B-Testing nennen, was sonst Online Controlled Experiment heißt. Das kommt aus einer Zeit, in der es das Internet nicht gab. Das kommt aus einer Zeit, wo es diese Datenmengen nicht gab. Also ja, ich kann auch mit sehr kleinen Nutzerzahlen experimentieren. Ich kann mit sehr kleinen Nutzerzahlen nur große Effekte messen. Das ist auch logisch. Wenn ich 100 Nutzer habe auf meiner Plattform, dann kann ich keinen einprozentigen Effekt messen, weil je kleiner die Nutzerbasis, desto volatiler sind ja die Metriken E. Das heißt, ich kann dann nicht mehr das Signal vom Rauschen unterscheiden. Andersrum argumentiere ich immer, wenn ich eine kleine Nutzerbasis habe, dann interessieren mich auch nur die großen Effekte. Wenn ich eh nur 100 Nutzer auf meiner Plattform habe, dann brauche ich nicht wahnsinnig viel Zeit und Energie, da reinzustecken, dass ich 1% mehr Leads hole. Das ist einfach meine Energie nicht wert. Ich will nur die Sachen machen, die auch echten Impact haben.",
            "start": 1457694,
            "end": 1523800,
            "confidence": 0.8263151515151511,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber das heißt, auch das kleine Startup kann sehr wohl AP-Testing machen. Auch wenn ich da jetzt meine 100 User habe oder 1000 aus den User, kann ich da sehr wohl sinnvoll Testergebnisse herausholen.",
            "start": 1524460,
            "end": 1534804,
            "confidence": 0.7306176470588236,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Kann und sollte in meinen Augen und von vornherein aber dann eben auf die Features zielen, wo ich meinen 20, 30 Prozent Impact habe auf die Leads, auf die Conversion.",
            "start": 1534844,
            "end": 1544108,
            "confidence": 0.7684666666666667,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und gerade nochmal, weil du gesagt hast, AP-Testing ist so alt, das heißt, das Klassische, was jetzt jeder kennt aus der Corona-Zeit, jeder weiß mittlerweile, es gibt diese Testgruppen und die Kontrollgruppen, genau das ist auch AP-Testing. Also es ist genau dasselbe, es ist nur ein anderes Wort für diese Anordnung von dem Experiment.",
            "start": 1544908,
            "end": 1561582,
            "confidence": 0.7457777777777778,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "A-B-Testing ist eine umgangssprachliche Bezeichnung davon, dass man eine statistische Analyse macht, dass man den Effekt von einer bestimmten Veränderung isoliert.",
            "start": 1561982,
            "end": 1571611,
            "confidence": 0.8141904761904761,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also Pfizer hat damals auch einen A-B-Test mit den Corona-Impfungen gemacht sozusagen.",
            "start": 1571631,
            "end": 1576055,
            "confidence": 0.6583333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, das ist ein sehr schlechtes Beispiel, weil die ganzen Corona-Impfungen, da wurde aus statistischer Sicht alles falsch gemacht, was überhaupt nur falsch gemacht werden kann. Deswegen ist das kein gutes Beispiel.",
            "start": 1576075,
            "end": 1586304,
            "confidence": 0.7997187499999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, dann bleiben wir bei den technischen Beispielen hier.",
            "start": 1586325,
            "end": 1587726,
            "confidence": 0.10688888888888888,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber du hast gerade vom statistischen Rauschen gesprochen. Und du hattest auch schon mal den Wert P50 vorher erwähnt. Kannst du uns mal ganz kurz einen Mathe-Crash-Kurs in zwei Minuten geben? A, was ist statistisches Rauschen? Und B, was ist eine magische Zahl P50?",
            "start": 1588106,
            "end": 1605039,
            "confidence": 0.8046136363636364,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Okay. Beim Experimentieren geht es darum, dass ich den Effekt messen will von einer Änderung, die ich mache, von einem neuen Feature, einem neuen Chatbot, einer anderen E-Mail, irgendwas.",
            "start": 1605880,
            "end": 1616228,
            "confidence": 0.757655172413793,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Einer neuen Farbe auf der Webseite.",
            "start": 1616637,
            "end": 1618258,
            "confidence": 0.31649999999999995,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Einer neuen Farbe, die berühmte 41 Shades of Blue von Google. Ja, ein ganz berühmter EV-Test. Und wenn ich jetzt weiß, was meine Metrik ist, ich habe jetzt meine Hypothese, dann Menschen sind unterschiedlich. Das ist ja das Wunderbare an Menschen. Und jeder einzelne Mensch verhält sich anders. Und ich kann nicht vorhersagen, welcher User was, wann, wie macht. Das ist, was ich mit Rauschen meine. Ich habe eine Varianz in jeder Art von Daten. Egal, was ich logge, egal, was ich messe.",
            "start": 1618298,
            "end": 1644366,
            "confidence": 0.7735180722891565,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Varianz heißt Rauschen.",
            "start": 1644406,
            "end": 1645747,
            "confidence": 0.576,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, das heißt, wie irgendwas rauf und runter geht, sich ändert. Und wenn ich jetzt was ändere, dann möchte ich ja, dann habe ich jetzt auf einmal zwei Stränge an Daten, die ich mir jetzt anschaue, die in der Test- und der Kontrollgruppe, aber die haben natürlich beide so eine Varianz, die haben beide so einen Ausschlag. Und was die Statistik macht, ist dann zu schauen, wie kann ich das isolieren voneinander? Wenn ich weiß, wie hoch ist meine Varianz in meiner Metrik eh schon in der Vergangenheit und jetzt mache ich eine Änderung. Okay, wie sicher kann ich sein, dass der Unterschied, den ich sehe, zurückgeführt werden kann auf eine echte Änderung? Und wie wahrscheinlich ist es, dass ich diesen Unterschied, den ich sehe zwischen Test- und Kontrollgruppe, dass der zurückzuführen ist auf die Varianz?",
            "start": 1646607,
            "end": 1688888,
            "confidence": 0.806051470588235,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und daher auch umso größer die Gruppen, umso kleiner ist dann die Varianz, was sich das dann ausgleicht.",
            "start": 1689980,
            "end": 1695964,
            "confidence": 0.8141111111111112,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und das ist der berühmte p-Wert, der, glaube ich, schon sehr vielen Mathematikern und Statistikern Albträume bereitet hat, weil ihn wirklich absolut jeder falsch versteht.",
            "start": 1696284,
            "end": 1710453,
            "confidence": 0.83572,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es ist jetzt deine Chance, es allen richtig gut zu bringen. Also der p-Wert... Und noch dazu nur bei Audiospur. Das macht das Ganze noch ein bisschen schwieriger.",
            "start": 1710513,
            "end": 1719660,
            "confidence": 0.6839999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Der p-Wert, was man umgangssprachlich oft statistische Signifikanz nennt. Mathematisch bedeutet das, was ist die Wahrscheinlichkeit, dass ich einen Effekt dieser Größe sehe unter der Annahme, dass die Nullhypothese stimmt? Was ist die Nullhypothese? Nullhypothese ist, zwischen Test und Kontroll besteht kein Unterschied. Ich sage das nochmal. Nehmen wir an, ich gebe Leuten Placebos, Pillen, die nichts machen. Das nennt man statistisch die Nullhypothese.",
            "start": 1719720,
            "end": 1748921,
            "confidence": 0.8303281250000004,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also wenn beide quasi Traumzugruppe kommen.",
            "start": 1748941,
            "end": 1751223,
            "confidence": 0.7398333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das macht nichts. Jetzt mache ich eine Test- und Kontrollgruppe, zufällig natürlich. und gibt denen aber beiden ein Placebo. Dann sehe ich ja auch durch das Rauschen, wenn ich mir das jetzt angucke, ich messe jetzt irgendwas, wie oft die Kopfschmerzen haben, ich habe jetzt eine Metrik, dann sehe ich ja immer einen Unterschied zwischen Test- und Kontrollgruppe. Mal haben die einen 2% mehr Kopfschmerzen, die anderen 3% weniger Kopfschmerzen. Und der p-Wert, die statistische Signifikanz, sagt, nehmen wir mal an, das ist ein Placebo, das ist die Nullhypothese. Nehmen wir mal an, das ist ein Placebo. Was ist die Wahrscheinlichkeit, dass ich einen Effekt von dieser Größenordnung sehe, wenn mein Treatment, wenn meine Änderung nichts macht?",
            "start": 1751243,
            "end": 1790453,
            "confidence": 0.7374273504273502,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also wenn alle Traubenzucker bekommen, wie groß sind die Abweichungen?",
            "start": 1790920,
            "end": 1795041,
            "confidence": 0.8255000000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau.",
            "start": 1795081,
            "end": 1795542,
            "confidence": 0.919,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und wenn die größer sind als diese Nullhypothese, dann weiß ich, dass es einen Unterschied gibt.",
            "start": 1795622,
            "end": 1800363,
            "confidence": 0.7213125,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wie wahrscheinlich das ist, genau. So, und das wirklich Tragische ist, dass diese statistische Signifikanz in der Tech-Welt überhaupt benutzt wird, weil dieser p-Wert Der wurde erfunden in der Zeit, wo man hauptsächlich, hat man das ursprünglich benutzt, um herauszufinden, ob Medizin was tut. Das heißt, da war man wirklich daran interessiert, ist die Nullhypothese wahr oder nicht? Hat das überhaupt irgendeinen Effekt? Wenn wir was an der Webseite ändern, dann ist die Nullhypothese ja per Definition falsch. Wir wissen ja, dass was anders ist. Wir wissen ja, dass das kein Placebo ist. Wir haben ja ein Chatbot implementiert. Das ist ja auf keinen Fall ein Placebo. Wir wissen ja per Definition, dass die Kunden was anderes sehen. Das heißt, wir missbrauchen ein statistisches Modell, eine statistische Berechnung, die für diesen Fall total erschmarrn ist. Das ist total tragisch, weil wir benutzen ein statistisches Instrument, was gar nicht das tut, was wir eigentlich wollen. Und es ist eine ganz berühmte Fehlinterpretation, dass die Leute sagen, oh, die statistische Signifikanz ist 5 Prozent, also ist mit 95 Prozent Sicherheit, dass der Chatbot besser ist. Das ist falsch. Das ist ein Statistiker, reißen sich die Haare seit Jahrzehnten aus, weil alle das so annehmen. Und es gibt Paper und Paper und Paper. Aber wir haben es noch nicht geschafft, das sozusagen so gut zu kommunizieren und ein so gutes alternatives Konstrukt rauszubringen, dass die Leute aufhören, dieses schreckliche Statistische Signifikanz zu verwenden.",
            "start": 1800403,
            "end": 1891994,
            "confidence": 0.8210458333333335,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also es gibt auch keine sinnvolle Alternative oder schon?",
            "start": 1892054,
            "end": 1894916,
            "confidence": 0.7926666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "In meinen Augen gibt es die doch. Das ist dann, was man Newton-Statistik nennt. bei Usain Statistics, habt ihr vielleicht schon mal gehört, da spricht man immer von bedingten Wahrscheinlichkeiten und von prior und posterior, dass man also anschaut, ok, wie Wie ist die Wahrscheinlichkeitsverteilung vorher? Und wenn ich eine Änderung mache, wie ist die Wahrscheinlichkeitsverteilung später? Das ist in meinen Augen der mathematisch-statistisch gesehen bessere Weg. Nur ist der Output von so einem Test am Ende eine Wahrscheinlichkeitsverteilung, die für einen Endnutzer, der so ein Experiment jetzt macht und sich anschaut, im ersten Moment erst mal schwerer zu verstehen ist. Da fällt dann nicht so eine Zahl raus. sondern da fällt dann auf einmal so eine Verteilung raus. Und dann sage ich, hey, aber Philipp, ich wollte doch nur wissen, ob das besser ist oder nicht. Jetzt ist da so eine komische Kurve. Was soll das? Und dann spart man sich es leider an den Analysten, die einem das interpretieren. Und deswegen nutzt man tragischerweise eben ein Instrument, was eigentlich gar nicht, was man falsch verwendet.",
            "start": 1894936,
            "end": 1956133,
            "confidence": 0.7846610169491525,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber das grundsätzliche Design mit Hypothese und so weiter, das bleibt grundsätzlich gleich. Es ist dann nur auf der Auswertungsseite ein Unterschied. Oder ist dann mein Setup auch schon ganz anderes?",
            "start": 1956687,
            "end": 1967278,
            "confidence": 0.7893225806451611,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Richtig. Die grundsätzliche Hypothese, die Metrik, das Logging aus technischer Sicht, das bleibt alles genau gleich.",
            "start": 1967298,
            "end": 1973665,
            "confidence": 0.7906875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich habe gerade so ein bisschen Angstzustände, Angstschweiß gehabt. Du hast Begriffe genannt, die mein Professor damals in Statistik 1 in meinem Wirtschaftsinformatikstudium auch genannt hat. Ich glaube Statistik 1 habe ich mit ganz knapp 3,7 bestanden. Also ich möchte jetzt hier nicht mehr reden.",
            "start": 1975418,
            "end": 1994741,
            "confidence": 0.7320444444444445,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich finde das total schade, dass das bei dir so eine negative Assoziation hervorruft. Ich finde Mathe cool. Ich glaube, das ist sowieso klar. Aber ich finde es auch schade, dass so viele Leute so eine früh geprägte Aversion gegen Kandidaten haben. Bei wirklich allen anderen Dingen auf der Welt ist jedem kleinsten Kind klar, das ist Übung. Natürlich kann ich kein Klavier spielen, wenn ich das noch nie probiert habe. Ich muss das halt üben, dann werde ich besser. Ob das Fußball ist oder Python-Coding oder Vorträge halten, alles ist Übung, ist jedem klar. Nur bei Mathe, da denken die Leute aus irgendeinem Grund, das kann man entweder oder man kann es nicht. Und ich kann es jetzt nicht. Ich finde es tragisch, finde ich total schade.",
            "start": 1995570,
            "end": 2038268,
            "confidence": 0.7844921875000002,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, kann ich gut nachvollziehen. Ja, das stimmt.",
            "start": 2038328,
            "end": 2040511,
            "confidence": 0.3805,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Jetzt hast du gesagt, wir werten die Tests eigentlich alle falsch aus, weil wir alle die einfache Antwort haben wollen. Wir wollen, ist das besser oder nicht. Ist denn die richtige Antwort, okay, wir müssen jetzt mehr Analysten heirn, damit wir diese Verteilung interpretieren können, oder gibt es noch einen alternativen Weg, wie man die Antwort vielleicht auch einfacher gestalten kann?",
            "start": 2041031,
            "end": 2058686,
            "confidence": 0.8368360655737703,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Man kann der einfachen Antwort dann trauen, wenn man eben die statistischen Methoden auch so benutzt, wie sie gedacht sind. Also wenn man von vornherein die Hypothese aufschreibt, wenn man sich von vornherein auf die Metrik einigt und die hinten raus irgendwie sich dann aussucht. Wenn man von vornherein überlege, haben wir uns geeinigt darüber, was sind unsere Wahrscheinlichkeiten, unsere Unsicherheiten, die wir akzeptieren wollen. Und wenn man dann wirklich nach den Parametern ein Experiment auch macht und dann auch analysiert, dann ist alles gut. Also es ist nicht sozusagen die Statistik, die falsch ist oder so. Die Methoden sind da. Und ganz ehrlich zu sein, in den letzten Jahrzehnten, glaube ich, hat sich auch in der Statistik als solche relativ wenig geändert. So die großen Statistiker, die so in den 30ern, 40ern, 50ern, Wald und so, im eigentlichen statistischen Modell hat sich nicht schrecklich viel geändert seit Wald und Bayes. Gibt schon seit Jahrzehnten. Es ist tatsächlich, wie wir dieses Instrument verwenden.",
            "start": 2059987,
            "end": 2116660,
            "confidence": 0.8206625766871162,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Jetzt hast du schon gesagt, ein großer Fehler ist, dass man die Metrik im Nachhinein einfach so mal aussucht und sich nicht im Vorhinein festlegt. Gibt es noch irgendwelche anderen typischen Fehler, die man so gerne sieht oder die man machen kann, wenn man mit dem mal einfach losstartet?",
            "start": 2117332,
            "end": 2131158,
            "confidence": 0.7685714285714288,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also es gibt so zwei wissenschaftliche One-Liner, die ich glaube, die total gesund sind, wenn man sie einfach im Kopf hat. Das eine nennt man Sagan Standard nach dem Wissenschaftler Carl Sagan. Der hat gesagt, extraordinary claims require extraordinary evidence. Hört sich erstmal so nach gesundem Menschenverstand an. Hört sich total logisch an. Wenn ich was behaupte, was sich total verrückt anhört, brauche ich wirklich, wirklich starke Beweislage. Wenn ich was behaupte, wo alle im Raum sagen, ja, klar, dann muss ich auch nicht so viel da reinstecken, das verifizieren. Und ich glaube, diese Idee von gesundem Menschenverstand, die tut jedem gut. Und auch da wieder ist so ein Ding, im ersten Moment nickt man natürlich mit dem Kopf, ja, ist doch klar. Habe ich persönlich in meiner Karriere aber schon oft genug gesehen, ich weiß nicht, ihr vielleicht auch, wo dann auch Daten einfach blind getraut wurde, wo was rauskam, wo ihr gesagt habt, hä? Wie kann denn das sein? Da stand dann Conversion Rate Impact plus 30% und man launcht das Feature. Und das wäre dann so ein Moment, wo ich denke, okay, lasst den AB-Test doch einfach nochmal machen. Genauso wie er war.",
            "start": 2131598,
            "end": 2203800,
            "confidence": 0.7496751269035531,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das wäre so das Beispiel von der Fußball-WM, oder? Wenn plötzlich niemand mehr anruft bei der Support-Hotline, ist komisch. Also dann kann es vielleicht nicht der JetBot gewesen sein, sondern es ist die Fußball-WM.",
            "start": 2203820,
            "end": 2212727,
            "confidence": 0.7283529411764705,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, und so der zweite One-Liner, den ich den Leuten gerne mitgeben möchte, ist Twyman's Law, heißt es. Im ersten Moment hört es sich ein bisschen zynisch an, aber auch das ist, glaube ich, ein ziemlich gesunder Spruch. Any figure that looks interesting or different is usually wrong. Also ganz wichtiger Spruch erzähle ich immer, wenn ich Analysten oder Data Scientists einstelle, erzähle ich ihnen diesen Spruch immer zehnmal, damit sie ihn nicht vergessen. Any figure that looks interesting or different is usually wrong. Also...",
            "start": 2213446,
            "end": 2245689,
            "confidence": 0.6608941176470586,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt eigentlich, es ist schwerer, was zu beweisen, als es sich vielleicht darstellt. Ist das richtig?",
            "start": 2245729,
            "end": 2252212,
            "confidence": 0.7625294117647058,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaube, dass es... Also meine Interpretation davon ist, man sollte in keins der beiden Extreme fallen. Eben haben wir so ein bisschen... Also ganz am Anfang habe ich davon gesprochen, man braucht so diese Kultur, dass man sich überhaupt erst mal eingesteht, dass man nicht genau weiß, was passieren wird. Das wäre das eine Extrem. Das andere Extrem, Das ist aber genauso falsch und genauso dumm, dass ich sage, ich vertraue jetzt blind 100 Prozent komplett nur der Statistik. Das ist genauso doof, das andere Extrem. Meine Interpretation ist, wenn ich jetzt Daten sehe, wenn ich jetzt eine Metrik sehe, die für mich gar keinen Sinn macht, aber ich vertraue ja einfach blind, dann bin ich auch irgendwie auf dem Holzweg. Der Königsweg ist dann in meinen Augen, wie schaffe ich es, Intuition, Menschenverstand, Erfahrung zu kombinieren mit so einer bescheidenen Attitüde und dem, was ich lernen kann aus Daten, Statistik und Hypothesen.",
            "start": 2252272,
            "end": 2306975,
            "confidence": 0.820331168831169,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn ich jetzt als ganz normaler Entwickler oder Entwicklerin da jetzt ein Problem habe, ich arbeite in einem Startup, in einem kleinen, gibt es dann irgendwie Möglichkeiten, dass ich da mal losstarte, ohne jetzt einen Analysten zu hirnen? Ist immer schlecht, wenn man mit den Spezialisten redet, weil die sagen meistens, es braucht einen Spezialisten. Aber was ist deine Einschätzung? Kann man sowas in sinnvoller Zeit lernen oder so viel Einblick gewinnen, dass man da was auf die Beine stellen kann?",
            "start": 2307978,
            "end": 2333170,
            "confidence": 0.7795925925925927,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, also nochmal, das ist meinen Augen technisch, mathematisch ein gelöstes Problem. Es gibt die Statistik, es gibt die technischen Plattformen, es gibt die Tools, das in den Deployment-Prozess einzubauen. Das macht auf jeden Fall, denke ich, Sinn, dass man sich, wie immer, dass man sich mit den Basics vertraut macht, wie irgendetwas funktioniert. Aber es gibt genug Tools, Plattformen, Technologien auf dem Markt, die ich verwenden kann. Vielleicht an der Stelle auch einfach ein Link für die, die irgendwie tiefer reingehen wollen. Also es gibt zwei, die ich persönlich sehr empfehlen kann. Das eine ist der Ron Kohavi, absoluter Thought Leader in dem Feld, sowohl aus wissenschaftlicher Sicht, also den Stanford-Promovierter auch gelehrt, aber auch aus Industrie-Sicht. Der war dann Vice President bei Microsoft, war Director bei Amazon, war bei Airbnb. Der hat jede Menge Bücher, Online-Kurse, Blogs. Kann ich total empfehlen, Monko Habi. Richtig guter Typ.",
            "start": 2334207,
            "end": 2389079,
            "confidence": 0.7966824324324329,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Verlinken wir natürlich in den Show Notes.",
            "start": 2389119,
            "end": 2390900,
            "confidence": 0.5674285714285715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und der zweite, die vielleicht auf die Mathematik auch ein bisschen Bock haben, ist ein Professor, der nennt sich Andrew Gellman. Der ist Professor in Columbia, glaube ich. hat auch einen Blog, hat auch sehr viele Paper, teilweise so für die breite Öffentlichkeit, teilweise wirklich für Experten geschrieben, aber wenn man Bock hat, in die Tiefe zu gehen und wirklich zu verstehen, warum Statistiker-Albträume über einen P-Value haben, dann ist das cool, das zu lesen. Und natürlich nicht die Marketing-Slogans von den Plattformen, bitte. Das ist, glaube ich, klar.",
            "start": 2390980,
            "end": 2422370,
            "confidence": 0.7978988764044944,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt also, auch wenn man die Plattformen verwendet, muss man sich trotzdem in irgendeiner Form auskennen, beziehungsweise die Hypothesen und so weiter muss man ja trotzdem erstellen. Das heißt, alles was außenrum passiert, das nehmen mir die Tools und die Plattformen natürlich auch nicht ab.",
            "start": 2423263,
            "end": 2437877,
            "confidence": 0.8122608695652176,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die Kultur, den Mindset, dass ich eine Metrik definiere, dass diese Arbeitsweise, diese Denkweise, das kann mir keiner abnehmen. Das können mir Konsulten zwar erzählen, aber das muss man auch wirklich leben.",
            "start": 2437897,
            "end": 2452811,
            "confidence": 0.7797812499999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wie siehst du das allgemein mit zu Tools und Plattformen, was sie selbst bauen? Können die auch in größeren Projekten dir weiterhelfen oder würdest du eher sagen, ab einer gewissen Größe muss man einfach sich das ganze Framework selbst irgendwie zusammenbauen? Wie ist da deine Erfahrung?",
            "start": 2452851,
            "end": 2471490,
            "confidence": 0.752695652173913,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, ich muss sagen, vor fünf bis zehn Jahren habe ich noch relativ stark Richtung Selbstbau argumentiert. Mittlerweile sind sowohl die technischen Plattformen und Frameworks als auch die statistischen Modelle, die Python Libraries, so gut, dass ich das kaufen kann. Ich denke, in den allermeisten Fällen ist es leichter, schneller, einfacher, sich das einfach einzukaufen.",
            "start": 2471510,
            "end": 2498144,
            "confidence": 0.8218545454545452,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn ich dir so zuhöre, dann frage ich mich, warum macht das eigentlich nicht jeder? Und wenn ich da jetzt auch mal kritisch hinterfrage, weil du sagtest auch gerade, immer wenn eine Zahl oder ein Fakt sehr interessant aussieht, kann der falsch sein. Das ist so für mich jetzt gerade hier, das hört sich an wie ein Traum. Ist das denn hier auch alles richtig? Dann gibt es ja auch das Risiko, dass wenn ein AB-Test, ich sag mal auf gut Deutsch, in die Hose geht, besonders bei einem Startup, dass da natürlich auch ein kleiner oder vielleicht auch größerer finanzieller Schaden hinten dran steht. Ich meine, du testest ja mit deinem Produkt rum, du hast eine Hypothese, machst das vielleicht auf deiner kompletten Userbase und dann kann das natürlich, dass dein Ad-Spend oder dein Ad-Income oder was weiß ich, nicht richtig in die Binsen geht. Also, dass das auch richtig Geld kostet, dieser Test, oder?",
            "start": 2498164,
            "end": 2541552,
            "confidence": 0.7755384615384612,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Klar, aber es hat ja nichts mit dem Experimentieren zu tun. Wenn ich jetzt nicht experimentiere, wenn ich jetzt einfach so deploye, was auch immer ich da gecodet habe, dann geht es ja genauso in die Hose. Also klar.",
            "start": 2542132,
            "end": 2551881,
            "confidence": 0.7344102564102565,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das ist korrekt, aber ich sehe die Zahl ja nicht.",
            "start": 2551902,
            "end": 2553883,
            "confidence": 0.6325999999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Verstehst du?",
            "start": 2553903,
            "end": 2554204,
            "confidence": 0.43199999999999994,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also ich weiß das ja nur nicht. Wenn ich den Test nicht mache, dann verliere ich vielleicht Geld, aber das weiß ich ja nicht. Wenn ich den Test mache, dann weiß ich ja wirklich, dass ich Geld verliere. Das ist ja schon psychologisch ein bisschen was anderes.",
            "start": 2554224,
            "end": 2564653,
            "confidence": 0.7193617021276598,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja. Klar. Und es gibt auch den Fall, also du sprichst jetzt auf den Fall an, dass ich nicht gerne, dass ich das nicht will, das Experimentieren nicht will. Anderes, worüber wir noch nicht gesprochen haben, ist teilweise ist es ja auch einfach schwer oder extrem teuer zu experimentieren. Also für uns, ich glaube, wir haben alle einen Tech-Background, deswegen denken wir jetzt an digitale Produkte. Und da ist Experimentieren sehr günstig bis kostenlos. Ich baue jetzt ein Auto. Ich bin jetzt Tesla und baue den Cybertruck. Das Ding ist Käse. Aber das ist halt unvorstellbar schwer, da zu iterieren und zu experimentieren. Ich kann ja einen Kunden schlecht in so einen Prototypen setzen. Das ist irre komplex. Das heißt, wir drei und ich nehme an, die meisten unserer Zuhörer sind in der total luxuriösen Situation, dass wir sehr gut experimentieren können. Viele Industrien, wenn ich ein Kraftwerk baue oder ein Auto oder sonst was, da kann ich nicht experimentieren. Oder es ist wahnsinnig teuer.",
            "start": 2564674,
            "end": 2627150,
            "confidence": 0.7714606060606062,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Schönes Beispiel. Die NASA hat gerade ein Software-Patch auf irgendeinen Satelliten geschickt, der seit 46 Jahren im Weltraum rumturnt. Und allein das Bespielen des Patches oder zumindest ein Command senden, dauert halt 17 Stunden oder so. In einem solchen Environment kann man halt leider auch nicht wirklich experimentieren, weil wenn der Software-Patch irgendeinen Fehler hat, dann ist der Satellit halt hops.",
            "start": 2627170,
            "end": 2648357,
            "confidence": 0.7735409836065574,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, es sind ja auch die Laufzeiten viel kürzer. Also bei digitalen Produkten hast du sofort Daten, aber wenn du jetzt auch medizinische Studien oder so hast, die laufen ja teilweise ewig oder Jahrzehnte im schlimmsten Fall. Und online hast du einfach im besten Fall eine Stunde später die Daten.",
            "start": 2648812,
            "end": 2665182,
            "confidence": 0.78836,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Und so gesehen vor kurzem in den Studien für die Corona-Medikamente, die in tragischerweise vielen Fällen einfach hart verkürzt wurden. wo der Statistiker gesagt hat, okay, wir brauchen jetzt so viele tausend Leute und müssen die jetzt so und so lange beobachten. Und da hat man einfach gesagt, nach zwei Wochen, ah, das ist bestimmt gut. Komm, das hauen wir raus. Ich habe hier irgendwie Druck. Wir brauchen das jetzt.",
            "start": 2665242,
            "end": 2687677,
            "confidence": 0.7591267605633801,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber die hatten wenigstens viele User an sich. Das war schon ein gewisser Vorteil natürlich. Und dass man die leichter bekommt, vor allem. Das ist ja sonst schon schwieriger. Alleine Kranke zu finden, also die, die Corona infiziert sind, ist ja leichter gewesen, als wenn du irgendwie keine FSME oder so testen willst.",
            "start": 2687857,
            "end": 2706810,
            "confidence": 0.7849245283018869,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn wir über Experimentieren sprechen und über Testing, dann hört man von zumindest von den sehr großen Firmen ja auch oft, dass sie nicht nur ein A-B-Test fahren, sondern vielleicht einen A-B-C-Test fahren oder zwei A-B-Tests auf der Plattform fahren. Inwieweit wird die ganze Thematik mit Hypothese, Berechnung, Signifikanz und Co. eigentlich schwieriger, umso mehr Tests man gleichzeitig fährt? Experiment, Entschuldigung.",
            "start": 2706830,
            "end": 2731802,
            "confidence": 0.8291311475409837,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Auch da, das ist für mich ein Teil von dem Design von einem Experiment. Teilweise möchte ich verschiedene Varianten gegeneinander testen. Ich möchte jetzt wissen, welcher Farbton am besten ankommt. Dann lohnt sich das, verschiedene Varianten nebeneinander zu halten. Es gibt verschiedene Arten, das zu tun. Was mittlerweile sich als Best Practice etabliert hat, ist Multi-Armbanded, wo ich dann verschiedene Varianten gleichzeitig live schicke und die nicht nur gegeneinander auswerte, sondern auch noch gleichzeitig einen Mechanismus einbaue, der während der Test läuft, die Populationen verschiebt. Also wenn ich jetzt Variante 1 bis 5 habe und ich sehe schon ziemlich schnell, 5 performt total mies, dann lasse ich sozusagen diese Variante aussterben. Dann kriegt die weniger und weniger und weniger Nutzer kriegen das dann zu sehen, bis es irgendwann weg ist. Das heißt, ich evaluiere nicht nur die Metrik zwischen den Varianten, sondern ich adaptiere auch dynamisch, wie viel Prozent der Nutzer welche Variante sehen. Das hat sich als Best Practice, glaube ich, relativ gut etabliert, auch da die Methoden dafür sind gegeben. Das ist jetzt allerdings wirklich ein Fall, den man in meinen Augen nur machen kann, wenn man eine große Nutzerzahl hat. Da reden wir jetzt wirklich von, wenn ich jetzt 100, 200 Nutzer habe, da kann ich nicht fünf Varianten gleichzeitig gegeneinander testen. Das ist, denke ich, das klappt nicht.",
            "start": 2732082,
            "end": 2814210,
            "confidence": 0.811144144144144,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und dasselbe gilt wahrscheinlich, wenn ich mehrere Experimente parallel machen will. Also wenn das klassische Problem, was man ja immer so vor Augen hat, ist, man misst, wie viele Leute konvertieren, irgendwas einkaufen in meinem Shop zum Beispiel. Und ich ändere einmal die Button-Farbe, aber irgendein anderer Test ändert, keine Ahnung, den Checkout-Prozess oder so. Dann spielen die ja gegenseitig unter Umständen mit rein und ich kann wenig Aussage treffen, ob der eine oder der andere jetzt mehr negativen Impact hatte oder positiven oder was es dann auch immer ist.",
            "start": 2814484,
            "end": 2843955,
            "confidence": 0.8071444444444444,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das Problem kann man vergessen. Ich versimplifiziere jetzt die Aussage so ein bisschen. Prinzipiell hast du recht. Praktisch tatsächlich ist dieser Effekt vernachlässigbar.",
            "start": 2844375,
            "end": 2855582,
            "confidence": 0.769086956521739,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Wenn ich genug User habe natürlich immer.",
            "start": 2855602,
            "end": 2857843,
            "confidence": 0.7027142857142857,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Das hat auch was damit zu tun mit der zufälligen Auswahl von Nutzern. Wenn ich nur zufällig splitte, echt zufällig splitte, dann ist der Effekt davon, mehrere Tests parallel laufen zu lassen, das ist kein Problem. Das kann man an sich grundsätzlich, würde ich das so einfach beantworten. Das kann man machen, ohne dass man sich darüber groß Gedanken machen muss.",
            "start": 2857883,
            "end": 2876571,
            "confidence": 0.8438032786885249,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Das heißt, auch wenn ich jetzt wenig Events habe, also Einkäufe habe in meinem Webshop, dann kann ich da trotzdem recht schnell Aussagen treffen.",
            "start": 2877268,
            "end": 2884792,
            "confidence": 0.8001250000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ich wenig Events, wenn ich wenig Kunden in meinem Webshop habe, dann bin ich, glaube ich, gar nicht so schnell in der Implementierung, im Coden, dass ich das schaffe, so viele Features live zu kriegen.",
            "start": 2884812,
            "end": 2895358,
            "confidence": 0.7473333333333333,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ist vielleicht ein Luxusproblem, was man dann hat.",
            "start": 2896518,
            "end": 2898599,
            "confidence": 0.35837500000000005,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, genau. Ich glaube, das ist wirklich nur dann relevant, wenn ich die seltene Situation habe, dass ich wirklich ein großes Team habe, das echt eine Menge an Features raushaut und ich habe ein komplett neues Produkt, eine extrem kleine Customer Base. Ich glaube, das ist der eine Fall, wo ich mir darüber Gedanken machen muss. Also im Allgemeinen recht, recht selten.",
            "start": 2898619,
            "end": 2916530,
            "confidence": 0.7774354838709676,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Okay, das heißt, man kann aber dann eben auch parallele Experimente fahren, braucht sich da keine großen Sorgen zu machen.",
            "start": 2917100,
            "end": 2922425,
            "confidence": 0.7806,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ja, kann man vielleicht an der Stelle einen Hinweis für einen, eine, für so einen statistischen Dummy-Check, für so eine Überprüfung, die man immer machen kann und immer machen sollte und die auch an der Stelle hilft. Sample-Ratio-Mismatch heißt das. Und damit der Andi sich nicht schlecht fühlt, gehe ich jetzt nicht so wahnsinnig auf die Mathematik ein. dürft ihr gerne bei Chats GPT eingeben.",
            "start": 2922705,
            "end": 2947079,
            "confidence": 0.7555076923076921,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es gibt Leute, die wollen das lernen und ich möchte das auch lernen.",
            "start": 2947479,
            "end": 2950380,
            "confidence": 0.7281538461538462,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Früher hatte man gesagt googeln, jetzt sage ich, ich könnte das bei Chats GPT eingeben. Also.",
            "start": 2950400,
            "end": 2956083,
            "confidence": 0.699125,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Hausübung für dich.",
            "start": 2956103,
            "end": 2957124,
            "confidence": 0.6696666666666666,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Sample Ratio Mismatch, ganz leicht erklärt. Ich sage, ich mache einen 50-50 Test. Die Hälfte meiner Nutzer sollen den Chatbot sehen, die andere Hälfte soll den nicht sehen. Eine ganz einfache Überprüfung, die auch oft vergessen wird, ist, dass ich am Ende gucke, habe ich denn überhaupt gleich viele Nutzer in der Test- und in der Kontrollgruppe? Das dauert ja in der SQL Query zehn Sekunden. Weil wenn ich da sehe, das stimmt nicht überein, selbst wenn das kleine Abweichungen hat, verwässert das die Aussagekraft enorm. Und kann auch ein guter Hinweis dafür sein, dass ich irgendwo Back habe oder so. Und hilft auch an der Stelle mit verschiedenen Varianten.",
            "start": 2957164,
            "end": 2997841,
            "confidence": 0.7932999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Du hattest den Podcast mit dem Satz begonnen, Lernen ist wichtiger als Wissen. Und immer wenn ich das Wort Wissen höre, dann denke ich immer automatisch an Wissensweitergabe. Was sind denn so deine Best Practices aus vergangenen AB-Tests, die Ergebnisse innerhalb einer Organisation weiterzugeben? damit auf Basis der Mitarbeiterfluktation nicht dieselben Tests kontinuierlich jedes Jahr wiederholt werden?",
            "start": 2997881,
            "end": 3021698,
            "confidence": 0.8770701754385964,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich finde, das ist eine gute Frage. Ich glaube, meine Antwort ist, niemand interessiert sich für Zahlen. Wir Menschen, wir sind nicht so gebaut, dass uns Zahlen interessieren. Wir Menschen sind so gebaut, uns interessieren Geschichten. Und deswegen ist die Antwort auf deine Frage, glaube ich, dass man am Ende immer verstehen muss, was ist die Geschichte? Das ist für mich die eigentliche Erkenntnis, der eigentliche Erkenntnisgewinn, der liegt darin. Der liegt nicht darin, dass ich sage, bloß drei. Das kann ich irgendjemandem erzählen und das vergisst der innerhalb von ein paar Stunden oder ein paar Tagen. fast immer. Aber wenn ich eine Geschichte erzähle, das gilt übrigens nicht nur für das Experimentieren, das gilt, glaube ich, für jede Art von Datenanalyse. Wenn ich eine Geschichte erzähle, dann kann ich einen echten Erkenntnisgewinn herstellen.",
            "start": 3021979,
            "end": 3069334,
            "confidence": 0.7977164179104477,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber was machst du gegen diese Geschichten von Leuten, die dann immer sagen, wir haben das vor fünf Jahren schon probiert, das hat nicht funktioniert?",
            "start": 3070214,
            "end": 3077818,
            "confidence": 0.7908799999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Eure Frage geht so jetzt Richtung Best Practice. Und ich denke, es ist ein total guter Punkt, dass man auch Sachen einfach versucht zu replizieren. Wie eingangs gesagt, in unserem Feld sind Experimente meistens kostenlos. Das heißt, selbst wenn ich glaube, das klappt, ich kann ja den Test einfach nochmal laufen lassen. Ein Jahr später, fünf Jahre später oder so. Why not? An der Stelle vielleicht auch ein spannender Seitenschwenk, den ich mal machen kann. Ihr habt vielleicht schon mal gehört von der Replication-Crisis. Ein sehr großes Thema, insbesondere in der Psychologie, die, glaube ich, ein schönes abschreckendes Beispiel sind. In dem Sinne, was ist das Gegenteil von Best Practice, Worst Practice? Wo, wie kann ich euch da einen Hook geben? Ihr habt wahrscheinlich schon mal gehört von Daniel Kahneman, Thinking Fast and Slow, Nobelpreisträger. Sag dir was. Und der hat ein wahnsinnig inspirierendes Buch geschrieben, finde ich, wenn man das liest. Das ist so, wow, krass und geistesblitz und aha und hey Schatz, hör mal. Und wenn man abends mit den Freunden in die Kneipe geht und ich habe gelesen und so weiter. Und in der Psychologie gab es insbesondere von 2010 bis 2020 so einen ganzen Schwung an Experimenten, die wirklich ein extraordinary Claim nach dem anderen rausgehauen haben. Also es gibt wirklich Beispiele. Ich habe es auch nochmal gegoogelt für unseren Podcast, um zu gucken. Ein Paper, das heißt A Day in the Life of Oscar the Cat. Das ist ein Paper, das wurde veröffentlicht in einem Peer-Review-Journal zu einer Zeit, wo wirklich, wo man gesagt hat, okay, wenn das Ding peer-reviewed ist, dann stimmt das Ergebnis. Und in diesem Paper wurde gesagt, da hat ein Wissenschaftler, der hat in einem Arzt, der hat in einem Hospiz gearbeitet und der hat die Hypothese aufgestellt und bewiesen, mit Anführungszeichen bewiesen, dass diese Katze Oscar, die in diesem Hospiz lebt, dass die voraussagen kann, wenn jemand stirbt. dass die Katze bei den Leuten, die bald sterben, mehr Zeit mit denen verbringt. Und das ist jetzt meine Interpretation. Er hat das einmal beobachtet, dass da ist jetzt jemand gestorben und irgendwie kurz bevor war die Katze da zu oft da. Und er hatte dann diese Hypothese im Kopf, Und hat dann dafür, war dann biased quasi, das so zu sehen. Das ist jetzt nur meine Interpretation der Dinge, wie sie geschehen. Und hat dann da eine statistische Analyse in Anführungszeichen gemacht und eben die Hypothese aufgestellt, dass diese Katze das spüren kann, dass jemand bald sterben wird. Und dieses Paper ist veröffentlicht worden in einem guten Journal. Und selbst Daniel Kahneman, der der Nobelpreisträger ist, wahrscheinlich der berühmteste, einflussreichste lebende Psychologe, hat Paper veröffentlicht, hat Paper in seinem sehr berühmten Buch zitiert, von dem er selber heute sagt, das ist Quatsch, das wird man nie replizieren können. Das sind dann so viele Experimente, die so Richtung Priming gehen. Es ist so dieses, dass man, wenn man Leute zum Beispiel, eine der Sachen unter anderem, die er behauptet hat, ist, wenn ich Leute zum Beispiel als Scrabble so ein Bordrätsel machen lasse und ich setze denen viele Begriffe vor, die was mit Alter zu tun haben, also Alter des Körpers. Nachdem sie mit dem Test fertig sind, bewegen sie sich langsamer. Das ist jetzt ein Beispiel für diesen Priming-Effekt. Und da gibt es eine ganze Reihe von diesen, die wurden für richtig gehalten, die wurden für erwiesen gehalten. Und da komme ich jetzt wieder zu Tryman's Law und so weiter, wo man denkt, hä? Kann das denn eigentlich stimmen? Und mittlerweile weiß man, es stimmt nicht. Und das wurde eben rausgefunden, unter anderem von dem eben erwähnten Andrew Gelman, der sich sehr stark dafür gemacht hat, hey, wenn hier was rauskommt, was total gegen die Intuition geht, was total merkwürdig klingt, dann reicht es vielleicht nicht, dass ich das einmal an einer Katze mit ein paar Patienten gesehen habe, sondern sollte ich, glaube ich, bevor ich das wirklich als Wahrheit raushaue, wesentlich mehr.",
            "start": 3077858,
            "end": 3324361,
            "confidence": 0.7946419939577031,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es gibt ja dieses bekannte Meme, wo diese Katze vorm Fernseher sitzt mit dem Motorrennen und sie klatscht dann so auf das Display und dann stürzt dieser Motorradfahrer. Also die klassische Korrelation ist keine Kausalität. Aber jetzt, wenn du sagst, okay, es ist ein sehr eigenartiges Ergebnis, dass man dann vielleicht nochmal nachdenkt. Aber wenn man jetzt die Daten hat bei meinem Experiment von meinem Online-Shop, wie kann ich da möglichst verhindern, dass ich da irgendwelche Korrelationen in Kausalitäten umwandle?",
            "start": 3325942,
            "end": 3355501,
            "confidence": 0.798,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ein anderer Teil Best Practice, der, glaube ich, an der Stelle hilft, ist, dass man AA-Tests macht, so nennen die sich. Also den echten Placebo, dass ich meinen Kunden einen echten Placebo verabreiche. Jetzt auch hier für die Developer unter uns, dass ich auch einfach gucke, stimmt meine Implementierung überhaupt alles? Weil das ist natürlich klar, was ich von einem AA-Test erwarte. Dann schleuse ich den einfach mal durch meine Pipeline, ja, von vorne bis hinten inklusive Analyse.",
            "start": 3355541,
            "end": 3380930,
            "confidence": 0.7567692307692305,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also AA heißt, ich verändere eben nichts.",
            "start": 3380970,
            "end": 3383110,
            "confidence": 0.7759999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich verändere eben nichts, genau.",
            "start": 3383170,
            "end": 3384711,
            "confidence": 0.708,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Und prüfe dann, ob das Ergebnis immer noch da ist.",
            "start": 3384731,
            "end": 3387151,
            "confidence": 0.7698,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, und dann sollte ich ja, wenn.",
            "start": 3387171,
            "end": 3388372,
            "confidence": 0.7002857142857142,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Alles stimmt... Keine Veränderung sehen. Nee.",
            "start": 3388392,
            "end": 3391673,
            "confidence": 0.8368333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Wenn ich jetzt, ich sage, ich akzeptiere in Fehlern fünf Prozent der Fälle und ich mache hundertmal einen A-Test und ich habe alles richtig implementiert, Dann in fünf von diesen AA-Tests kommt raus, es gibt einen Unterschied. Und in 95 von diesen AA-Tests kommt raus, es gibt keinen. Dann habe ich alles richtig implementiert.",
            "start": 3391693,
            "end": 3408753,
            "confidence": 0.7724074074074074,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber macht es nicht Sinn, solche Art von Tests dauerhaft nebendran laufen zu lassen? Also sozusagen immer als Kontrollgruppe?",
            "start": 3408793,
            "end": 3415822,
            "confidence": 0.884157894736842,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, genau. Macht Sinn. Und es gibt auch so eine Practice, das nennt sich Universal Holdout Group. Das ist genau das, dass ich eben so eine universelle Referenzgruppe habe. Ja.",
            "start": 3415842,
            "end": 3425887,
            "confidence": 0.7081666666666666,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Um nochmal auf die Frage zurückzukommen. Teilweise ist es gar nicht schlimm, wenn man das Wissen gar nicht so groß in der Organisation teilt, weil wir leben in der Tech-Welt. Experimentieren ist günstig. Und ab und zu kann es auch von Vorteil sein, wenn man dieselben Tests wiederholt.",
            "start": 3425927,
            "end": 3441193,
            "confidence": 0.8340833333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich würde sagen, es ist schade. Es ist eine vergebene Möglichkeit, wenn ich eine Analyse mache, ohne dass ich die in eine Geschichte transformiere.",
            "start": 3441473,
            "end": 3450857,
            "confidence": 0.8504166666666664,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also das heißt nicht nur am Ende die Daten abspeichern, sondern auch das Ergebnis in irgendeiner Geschichtenform, Storyform, Ausarbeitung, textuell, Fließtext, was es auch immer dann ist, um ideal das weiterzugeben an die nächste Generation sozusagen oder ans nächste Jahr.",
            "start": 3451798,
            "end": 3467327,
            "confidence": 0.8166499999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genauso wie man am Anfang immer aufschreiben sollte, was war eigentlich meine Hypothese, sollte man immer am Ende immer aufschreiben, was ist meine Analyse und was ist meine Was ist meine Interpretation? Was ist meine Geschichte?",
            "start": 3467367,
            "end": 3480034,
            "confidence": 0.7374999999999998,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also wenn ich das zusammenfassen kann, gute Vorbereitung ist wichtig und die gute Nachbereitung ist auch wichtig, weil das dazwischen macht man sowieso. Und da sollte man möglichst viel Zeit investieren in dieses gute Setup und dann in die Aufbereitung oder Nachbereitung.",
            "start": 3480815,
            "end": 3494561,
            "confidence": 0.8142142857142858,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau, würde ich so unterstützen. Und das sind auch die Teile, die am ersten Mal so ein bisschen verschludert werden, dass man eben Das lässt man dann gerne mal weg. Müssen wir uns jetzt wirklich darüber so lange unterhalten, was die Metrik ist? Müssen wir jetzt wirklich das so genau aufschreiben, was Hypothese ist? Das schludert man mal weg. Komm, mach mal.",
            "start": 3494601,
            "end": 3514074,
            "confidence": 0.8233387096774194,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es ist beim Programmieren eh das Gleiche. Das ist am Anfang das Konzept erstellen, das überspringt man gern, sofort loscoden und am Ende die Dokumentation, die vergisst man auch immer gern. Ja, das ist erscheinbar überall dasselbe, ja.",
            "start": 3514114,
            "end": 3524923,
            "confidence": 0.7050526315789474,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und ein anderer klassischer Fehler, der häufig geschieht, ist, dass man Experimente zu früh beendet. Dass man sagt, hey, ich monitor das jeden Tag. Ich habe meine Analysten jetzt so lange genervt, dass sie mir das jetzt automatisch geben. Und jetzt sehe ich eben, die Metrik, die mich wirklich interessiert, ist positiv. Das wäre doch dumm, wenn ich das nicht jetzt sofort akzeptiere. Ich verliere ja was mit jedem Tag, in dem das schlechtere weiterläuft. Und dann kribbelt es mir unter den Fingern. Ich möchte, dass so schnell es geht, die bessere Variante akzeptieren. Und dann ist ein sehr häufiger Fehler, dass man das eben zu früh tut, dass man Literatur als Peaking bezeichnet, dass ich mir also quasi die Ergebnisse, dass ich zu früh sozusagen durch den Türspalt luke. Und das darf man nicht. Und da muss jeder gute Analyst stark bleiben und das seinem Produktowner, CEO, whatever, liebevoll und direkt verbieten. Hier, lieber Chef, du kriegst die Ergebnisse dann, wenn das Experiment fertig ist.",
            "start": 3524963,
            "end": 3596230,
            "confidence": 0.8179939759036147,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Es heißt auch da, das Commitment am Anfang von allen Beteiligten schon einholen beim Design. So lange dauert es, so lange braucht es, so viel Daten benötigen wir und davor passiert nichts. Umso früher, umso besser.",
            "start": 3597415,
            "end": 3607457,
            "confidence": 0.8067777777777777,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Richtig. Wenn man ein Experiment designt, dass man dann sagt, okay, bei den Sicherheiten, die ich haben will, muss das Ding vier Wochen laufen, dann akzeptiere ich das auch erst nach vier Wochen. Mit dem einen Häkchen, was ich da einschieben würde, ist, Wenn ich jetzt sehe, das ist ein absolut katastrophaler Fehler und ja, der Chatbot in 99 Prozent der Fälle stürzt da einfach ab. Da brauche ich natürlich nicht die armen Nutzer mit dem Bug zu malträtieren für einen Monat, wenn ich eh schon weiß, das Ding ist einfach kaputt.",
            "start": 3607517,
            "end": 3641463,
            "confidence": 0.7997956989247313,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber dann musst du wieder von vorne anfangen, wenn du das fixierst.",
            "start": 3641523,
            "end": 3644344,
            "confidence": 0.43691666666666656,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Dann muss ich wieder von vorne anfangen. Aber jetzt mal ausgeschlossen, das ist ein absolut katastrophaler Fehler. zieht es dann auch so durch, wie du es designt hast, weil sonst ist die Aussage einfach nicht verlässlich.",
            "start": 3644364,
            "end": 3656669,
            "confidence": 0.6563611111111111,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Aber die richtige Laufzeit beziehungsweise die Länge, die definierst du selbst in deiner Hypothese. Also da gibt es jetzt keine mathematische Formel?",
            "start": 3656709,
            "end": 3663832,
            "confidence": 0.7974545454545455,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Doch, da gibt es die, das nennt man Power Analysis. Da gibt es auch viele Open-Source-Tools, Webseiten. Einfach mal Sample Size Calculator eingeben oder Chat GPT direkt fragen, kann es, glaube ich, auch so. Und dann sage ich, ich habe eine Baseline-Conversion von x, ich habe einen Effekt von y, den ich detektieren will, und ich bin bereit, diese Rate an Falsch-Positiven, diese Rate an Falsch-Negativen zu akzeptieren. Wie viele Nutzer brauche ich? Und dann gibt es eine Zahl. Bam.",
            "start": 3663852,
            "end": 3690573,
            "confidence": 0.7675374999999998,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ich lerne hier gerade wirklich so viel, das ist unglaublich.",
            "start": 3690613,
            "end": 3693816,
            "confidence": 0.7502,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Darum machen wir das Ganze ja. Nur für dich, Andi.",
            "start": 3693856,
            "end": 3697239,
            "confidence": 0.7715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich habe mir gerade erstmal so einen Kalkulator aufgerufen. Ich werde jetzt gleich mal schauen, ob wir das für die Engineering Kiosk Webseite machen können.",
            "start": 3697259,
            "end": 3703322,
            "confidence": 0.68596,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich kann gerne einen guten verlinken.",
            "start": 3703362,
            "end": 3704582,
            "confidence": 0.5299999999999999,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Packen wir alles in die Show Notes natürlich, damit wir endlich unsere eigenen Daten besser analysieren können. Unsere Up- und Downvotes zu den Episoden, die wir haben.",
            "start": 3704923,
            "end": 3712246,
            "confidence": 0.7940740740740742,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wenn ich schon so viel in diesem Podcast, in dieser Stunde hier lerne, frage ich mich, was muss man eigentlich in Bewegung setzen, dass die Organisation das versteht. Weil du sagtest ja, Lernen ist wichtiger als Wissen. Aber super viele Leute wollen einfach nur schnelle Ergebnisse. Du bist da, um dem Business irgendwie mehr Geld zu bringen. Und jetzt kommst du erst mal an, ich mache jetzt erst mal Try and Error. Also ich habe das Gefühl, so eine Kultur zu schaffen, dass Lernen wirklich wichtiger ist als Wissen. Und ich sag mal, man auch so eine Art Budget hat zum Lernen, dass man akzeptiert, dass manche Tests auch in die Binsen gehen. Ich glaube, das ist wirklich, wirklich, wirklich schwer zu erschaffen, oder?",
            "start": 3712486,
            "end": 3749076,
            "confidence": 0.8009600000000006,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, ich glaube, auf der einen Seite fängt es an mit der Kultur im Sinne von, dass man sich in die Augen schaut und sagt, okay, wie wollen wir eigentlich miteinander diskutieren, miteinander sprechen, miteinander entscheiden? Und das andere ist, ich glaube, es ist einfach smart im Sinne von Investment, darüber nachzudenken. Klar, das ist ein Invest. Ich muss Leute dafür haben, die müssen ausgebildet sein. Ich brauche die Infrastruktur, ich brauche die Tools und gleichzeitig ist das ein Invest, der sich einfach langfristig immer wieder rentiert.",
            "start": 3749516,
            "end": 3781853,
            "confidence": 0.7907701149425287,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "In der modernen Arbeitswelt hat man aber auch immer wieder Leute, die arbeiten für sich und nicht für das Unternehmen. Also wirkliche Leute, die ich sage mal harte Politik betreiben und dann vielleicht nach den ersten zwei, drei Experimenten, die du in den Sand gesetzt hast, beziehungsweise wo die gute hypothese nicht bestätigt wurde den sogenannten i told you so dance tanzen und dich dann vom management schlecht machen oder ähnliches sowas ist ja dann reinstes gift aber im endeffekt versuche ja die datenbasis zu liefern die alle leute immer nur ich sag mal mit bauchgefühl getroffen.",
            "start": 3781933,
            "end": 3815817,
            "confidence": 0.8198969072164947,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Haben oder ja das ist glaube ich so das berühmte hippo highest paid highest-paid-person's-opinion. Ich glaube, der Schlüssel ist, dass man die Awareness hat. Das war ein Moment, den ich in meiner Karriere mal sehr inspirierend fand, als der CEO in einem Unternehmen, in dem ich gearbeitet habe, hat genau das zu mir gesagt. Hey Philipp, mit deinem Team, bitte kümmere dich darum, dass ich nicht zum Hippo werde. Das ist ja mega. Klar, du musst mit dieser Awareness anfangen. Aber auf der anderen Seite, wenn du das einmal hast, dann hast du eine bessere Kollaboration, eine bessere Kooperation. Und ich glaube, auch Lernen und sich weiterentwickeln ist ein ganz fundamentaler menschlicher Motivator, ein Treiber von ganz, ganz vielen. Neben Appreciation, dass einem jemand Danke sagt, und neben Impact, glaube ich, dass man besser wird in etwas. Das macht Bock, uns allen.",
            "start": 3815857,
            "end": 3872652,
            "confidence": 0.7452042253521127,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also das ist, glaube ich, ein guter Tipp für alle Chefinnen und Chefs da draußen. Werdet keine Hippos und versucht, eure Leute so viel Kompetenz zu geben, damit ihr keine Hippos werdet.",
            "start": 3873992,
            "end": 3885339,
            "confidence": 0.7065,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich fand das aber auch ein super schönes Abschlusswort, was du gerade gesagt hast. Hört nicht auf zu lernen. Ich glaube, jeder Software-Ingenieur und Software-Ingenieurin kommt da leider nicht drum herum, so wie die Techwelt sich entwickelt. Philipp, vielen lieben Dank für deinen Auftritt hier, für vielleicht mal auch ein bisschen die Angst neben von Statistik und Mathe. Also vielleicht werde ich mich mal mit der Power-Analyse jetzt ein bisschen beschäftigen. Schauen wir mal, warum mich der Abend noch so hintreibt.",
            "start": 3885359,
            "end": 3912491,
            "confidence": 0.7586913580246912,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Und es ist ja wie bei jedem Bingo-Blatt eigentlich. Hinter den Begriffen steht ja auch nur irgendeine Theorie, die man relativ schnell eigentlich nachlesen kann. Da muss ja kein Spezialist drin werden. Aber mal was nachgoogeln funktioniert ja schon ganz gut. Vielen lieben Dank auch von meiner Seite. War wirklich cool, ein bisschen Einblick zu bekommen. Kleiner Funfact, Rande, du hast ja den Oskar, die Katze, erwähnt. Was du nicht weißt, ist, dass die Katze, die um dich herumläuft, von unserem Host Danke Matthias übrigens, der unsere Audio-Technik macht und neben uns sitzt, seine Katze heißt Oskar, der Kater.",
            "start": 3912531,
            "end": 3945547,
            "confidence": 0.7914646464646465,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nein!",
            "start": 3946668,
            "end": 3949930,
            "confidence": 0.866,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also der begleitet uns auch während der Podcast-Aufnahme.",
            "start": 3949970,
            "end": 3952512,
            "confidence": 0.7382500000000001,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Philipp, hast du noch ein Abschlusswort für alle anderen?",
            "start": 3952793,
            "end": 3954754,
            "confidence": 0.7134444444444444,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Abschlusswort an euch, danke. Danke euch für die Einladung, hat mir Spaß gemacht.",
            "start": 3955054,
            "end": 3959456,
            "confidence": 0.6636923076923077,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Gerne wieder. Wir machen dann eine zweite Episode, wo wir wirklich tief in die Mathematik gehen, damit der Andi dann, das ist dem wirklich schlecht.",
            "start": 3959496,
            "end": 3965898,
            "confidence": 0.76664,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Anderer Funfact, ich habe hier ein Buch stehen, das heißt Statistik von Kopf bis Fuß. Und die fangen das Buch an mit, wie man mit Datenvisualisierung seine Meinung durchgedrückt bekommt, indem man die halt anders darstellt. Deswegen weiß ich nicht, ob ich dafür geeignet bin.",
            "start": 3965938,
            "end": 3983497,
            "confidence": 0.8431555555555558,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ich probiere es ja seit Ewigkeiten schon, Andi immer klarzumachen, dass meine Titel von Episoden immer besser performen als Andis Titel. Aber er glaubt mir da nie so.",
            "start": 3983537,
            "end": 3992279,
            "confidence": 0.7984285714285715,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich helfe euch gern diese Hypothese zu verifizieren.",
            "start": 3992299,
            "end": 3995780,
            "confidence": 0.646875,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Ja, das ist aber jetzt mal interessant. Wie würde man Podcast Episode Titel AB testen, denn eigentlich müssten wir zwei Podcasts releasen, oder? Mit demselben Inhalt, mit derselben Hörerbasis?",
            "start": 3996140,
            "end": 4008266,
            "confidence": 0.8505172413793104,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das Problem bei Podcasts ist, dass du eigentlich nicht das unter Kontrolle hast und keine zwei Gruppen machen kannst, weil du die Herausgelieferung nicht unter Kontrolle hast vom Podcast.",
            "start": 4008286,
            "end": 4017171,
            "confidence": 0.7676206896551725,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Richtig, ihr müsstet eigentlich den Kollegen bei Spotify schreiben.",
            "start": 4017251,
            "end": 4020413,
            "confidence": 0.7053333333333334,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Genau, die könnten das machen.",
            "start": 4020453,
            "end": 4021914,
            "confidence": 0.7661999999999999,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Die könnten das sehr gut herausfinden.",
            "start": 4021934,
            "end": 4023215,
            "confidence": 0.31816666666666665,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Also, alle, die von Spotify mithören, lasst uns erstmal wissen. Aber die arbeiten ja immer mehr an Podcasts, vielleicht kommen sie dann endlich mit sowas auch an.",
            "start": 4023816,
            "end": 4032105,
            "confidence": 0.775111111111111,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Aber meinst du, die machen das für die Großen hier? Wie heißen die? Joe Reagan oder wie soll er heißen?",
            "start": 4032145,
            "end": 4036270,
            "confidence": 0.6469499999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ihre eigenen Produktionen können sie das natürlich gut machen.",
            "start": 4036310,
            "end": 4038773,
            "confidence": 0.8873333333333333,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich glaub schon, sicher. Die haben ja auch jedes Interesse dran. Die Main KPI von Spotify ist, wie viele Stunden am Tag hört der durchschnittliche Nutzer. Die haben ja jedes Interesse dran, das zu erhöhen. Klar helfen die ja den Podcast-Machern, das zu optimieren, oder?",
            "start": 4039373,
            "end": 4056227,
            "confidence": 0.7473333333333332,
            "channel": null,
            "speaker": "C"
        },
        {
            "text": "Sehst du, Andi, und wir streiten uns immer nur, wer mehr redet in den Podcasts, wer mehr Redezeit hat. Eigentlich sollten wir den anderen KPI einführen, wer hört uns zu, anstatt wie viel wir reden.",
            "start": 4056607,
            "end": 4067033,
            "confidence": 0.7292,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Nee, das Schöne nach dieser Episode ist, ich kann einfach jede Diskussion, dein Titel ist zu langweilig oder meiner ist besser, kann ich jetzt einfach stoppen. Und sag Wolfgang.",
            "start": 4067093,
            "end": 4075197,
            "confidence": 0.8269310344827584,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Philipp hat gesagt, es funktioniert so nicht.",
            "start": 4075217,
            "end": 4077278,
            "confidence": 0.6005714285714285,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Genau. Lass mich in Ruhe, zeig mir die Daten, damit wir mal eine bessere Diskussionsgrundlage schaffen.",
            "start": 4077318,
            "end": 4081340,
            "confidence": 0.7344374999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Ja, sehr schön.",
            "start": 4081750,
            "end": 4082631,
            "confidence": 0.30466666666666664,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Ich merke schon.",
            "start": 4082651,
            "end": 4083031,
            "confidence": 0.11233333333333334,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Trotzdem hättest du die falschen Argumente geliefert.",
            "start": 4083051,
            "end": 4085032,
            "confidence": 0.5472857142857143,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Vielen lieben Dank, Philipp. Vielen lieben Dank, Wolfgang. Vielen lieben Dank, Matthias, für dieses hybride Setup.",
            "start": 4085052,
            "end": 4089936,
            "confidence": 0.7191249999999999,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Das scheinbar gut funktioniert hat, zumindest wenn ihr uns jetzt aktuell hört, dann hat das ganze Setup, das experimentelle Setup von uns funktioniert.",
            "start": 4089956,
            "end": 4097060,
            "confidence": 0.7417826086956522,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Alle Links, die der Philipp erwähnt hat, verlinken wir natürlich in den Show Notes. Auch, wie ihr Philipp mal kontaktieren könnt, wenn ihr mal eine Frage zu Power-Analysis habt oder ähnliches. Und deswegen sage ich einfach mal... Oh.",
            "start": 4097100,
            "end": 4110109,
            "confidence": 0.7587105263157895,
            "channel": null,
            "speaker": "A"
        },
        {
            "text": "Da ist unser Oskar.",
            "start": 4110149,
            "end": 4111050,
            "confidence": 0.67725,
            "channel": null,
            "speaker": "B"
        },
        {
            "text": "Und wer ein Bild von Oskar haben möchte, das verlinken wir auch in den Show Notes. Dankeschön, bis nächste Woche und tschüss. Ciao.",
            "start": 4112729,
            "end": 4119381,
            "confidence": 0.6886956521739129,
            "channel": null,
            "speaker": "A"
        }
    ],
    "confidence": 0.7851719615024235,
    "audio_duration": 4126.0,
    "webhook_status_code": null,
    "webhook_auth": false,
    "summary": null,
    "auto_highlights_result": null,
    "content_safety_labels": null,
    "chapters": null,
    "sentiment_analysis_results": null,
    "entities": null
}