{
    "Team": {
        "short_desc": "Wir besprechen die täglichen Herausforderungen in IT-Teams und wie diese besser gelöst werden können.",
        "long_desc": "Die täglichen Probleme von Teams stehen für uns als Engineering Manager an der Tagesordnung. In diesen Episoden sprechen wir über unsere Erfahrung mit meist Cross-functional Teams und deren Herausforderungen in der täglichen Zusammenarbeit: von Konfliktlösungen bis hin zur besseren Kommunikation.",
        "usage_count": 32
    },
    "Backend": {
        "short_desc": "Alle Podcast Episoden zum Thema Backend, Architektur und Skalierung.",
        "long_desc": "In diesen Episoden sprechen wir über Backend Themen. Gerade mit Andy’s Dev-Ops und SRE Schwerpunkt und Wolfi’s Datenbanken Wissen sind Skalierung und Architektur im Backend ein ständiges und beliebtes Thema.",
        "usage_count": 45
    },
    "Frontend": {
        "short_desc": "Das Frontend aus dem Blickwinkel von Backend Engineers - Alle Frontend Episoden.",
        "long_desc": "Alle Episoden zu Frontend Themen aus der Sicht von Backend Engineers.. Fontend ist gerade für EntwicklerInnen aus dem Backendbereich oft schwer verständlich und trotzdem wagen wir uns in diesen Bereich und versuchen diese Themen möglichst Back-end-freundlich zu verarbeiten. Hört rein.",
        "usage_count": 15
    },
    "DevOps": {
        "short_desc": "In diesen Episoden besprechen wir die Prinzipien und Praktiken von DevOps und wie sie angewendet werden können, um die Entwicklung und Betrieb von Software-Systemen zu verbessern.",
        "long_desc": "DevOps ist ein Softwareentwicklungsansatz, der sich auf die Zusammenarbeit und Kommunikation zwischen Entwicklern und IT-Profis konzentriert, um schnellere und effizientere Bereitstellung von Software zu erreichen. In diesen Episoden erkunden wir die verschiedenen Aspekte von DevOps, einschließlich Continuous Integration und Deployment, Infrastructure as Code, Monitoring und Observability. Wir besprechen auch, wie Organisationen eine DevOps-Kultur implementieren und wie diese den Softwareentwicklungsprozess verbessern kann.",
        "usage_count": 24
    },
    "Tech Kultur": {
        "short_desc": "Tech-Kultur bezieht sich auf die Werte, Normen und Verhaltensweisen, die die Art und Weise, wie wir im Technologiebereich arbeiten und interagieren, formen.",
        "long_desc": "In diesen Episoden befassen wir uns mit den verschiedenen Facetten der Tech-Kultur und wie sie die Art und Weise beeinflusst, wie wir im Technologiebereich arbeiten und interagieren. Wir erkunden Themen wie Inklusion und Vielfalt, Work-Life-Balance und die Bedeutung von Schaffung einer positiven und unterstützenden Arbeitsumgebung. Wir besprechen auch, wie Organisationen eine gesunde Tech-Kultur fördern und wie dies ihren Mitarbeitern und ihrem Geschäft insgesamt zugutekommen kann.",
        "usage_count": 44
    },
    "Karriere": {
        "short_desc": "IT-Karrierepush nötig? Die folgendene Episoden geben dir die nötigen Inside-Informationen um deine Karriere zu verbessern.",
        "long_desc": "Von Bewerbungen über Interviews bis zu relevanten Themen um dein Job-Leben zu verbessern: Als langjährige Team-Leads besprechen wir in den folgenden Episoden Karrierethemen und geben Tipps zur Verbesserung der Tech-Kultur bzw. der (Zusammen)arbeit im Team.",
        "usage_count": 49
    },
    "Software Engineering": {
        "short_desc": "In diesen Episoden besprechen wir die Prinzipien und Best Practices des Software Engineerings und wie sie angewendet werden können, um hochwertige Software zu entwickeln und zu warten.",
        "long_desc": "Software Engineering ist der Prozess der Analyse, Design, Entwicklung, Tests und Wartung von Software-Systemen. In diesen Episoden erkunden wir die verschiedenen Aspekte des Software Engineerings, einschließlich Architektur, Modellierung, Qualitätssicherung und Projektmanagement. Wir besprechen auch, wie Organisationen die Software Engineering-Prozesse verbessern und wie sie die Qualität ihrer Software sicherstellen können.",
        "usage_count": 83
    },
    "Code mit Impact": {
        "short_desc": "",
        "long_desc": "",
        "usage_count": 3
    },
    "Papers we love": {
        "short_desc": "",
        "long_desc": "",
        "usage_count": 3
    },
    "Open Source": {
        "short_desc": "In diesen Episoden besprechen wir die Prinzipien und Praktiken von Open-Source-Software und wie sie in der Softwareentwicklung angewendet werden können.",
        "long_desc": "Open-Source-Software macht Quellcodes frei zugänglich und wird von der Gemeinschaft entwickelt. In diesen Episoden erkunden wir die verschiedenen Aspekte von Open-Source-Software, einschließlich Lizenzen, Communities und Contributions. Wir besprechen auch, wie Organisationen Open-Source-Software nutzen und wie sie sich an Open-Source-Projekten beteiligen können.",
        "usage_count": 16
    },
    "Datenbanken": {
        "short_desc": "Von SQL bis zu NoSQL, DataScience und Big-Data besprechen wir Datenbankthemen in den folgenden Episoden.",
        "long_desc": "Durch den Forschungstätigkeit von Wolfi im Datenbankbereich und der praktischen Datenbankerfahrung von Andy tauchen wir in den folgenden Episoden in die Datenbankwelt ein. Von SQL bis NoSQL aber auch DataScience und Big-Data stehen am Themenplan. Vor allem ist uns aber auch immer der praktische Aspekt wichtig und manchmal ist die beste Lösung auch gar keine Datenbank, sondern eine einfache Datei...",
        "usage_count": 18
    },
    "Bewerbung": {
        "short_desc": "Vorbereitung auf Job-Interviews: Alle Episoden zum Thema Bewerbung",
        "long_desc": "Du willst dich auf ein Job-Interview vorbereiten oder eure Recruiting Pipeline verbessern? Hier bist du richtig, egal ob von Firmenseite oder von der Seite der BewerberInnen - in all diesen Episoden gibt es viel Praxisinformation zu Bewerbungsthemen von Andy aund Wolfi, die bereits hunderte Interviews als Hiring Manager durchgeführt haben.",
        "usage_count": 11
    },
    "Software Qualität": {
        "short_desc": "In diesen Episoden besprechen wir die Praktiken und Tools, die erforderlich sind, um die Qualität von Software-Systemen zu gewährleisten.",
        "long_desc": "Software Qualität beschreibt Praktiken um die Qualität von Software zu messen und sicherzustellen und Fehler zu vermeiden. In diesen Episoden erkunden wir die verschiedenen Aspekte der Software Qualität, einschließlich Tests, Code-Reviews und Qualitätssicherung. Wir besprechen auch, wie Organisationen die Qualität ihrer Software verbessern und wie sie sicherstellen können, dass ihre Software den Anforderungen und Erwartungen der Benutzer entspricht.",
        "usage_count": 21
    },
    "Projektmanagement": {
        "short_desc": "In diesen Episoden besprechen wir die Praktiken und Tools, die erforderlich sind, um erfolgreiche Softwareprojekte zu planen, zu verfolgen und abzuschließen.",
        "long_desc": "Projektmanagement ist der Prozess der Planung, Überwachung und Abschluss von Softwareprojekten. In diesen Episoden erkunden wir die verschiedenen Aspekte des Projektmanagements, einschließlich Projektplanung, Ressourcenmanagement und Risikomanagement. Wir besprechen auch, wie Organisationen erfolgreiche Softwareprojekte planen und verfolgen und wie sie die Qualität und den Fortschritt ihrer Projekte sicherstellen können.",
        "usage_count": 7
    },
    "Kommunikation": {
        "short_desc": "In diesen Episoden besprechen wir die Praktiken und Tools, die erforderlich sind, um effektive Kommunikation in Teams und Organisationen zu fördern.",
        "long_desc": "Kommunikation ist der Austausch von Ideen, Informationen und Gedanken zwischen Menschen. In diesen Episoden erkunden wir die verschiedenen Aspekte der Kommunikation in Teams und Organisationen, einschließlich Meetings, Feedback und Dokumentation. Wir besprechen auch, wie Organisationen die Kommunikation verbessern und wie sie sicherstellen können, dass alle Beteiligten auf dem gleichen Stand sind.",
        "usage_count": 43
    },
    "Side Projects": {
        "short_desc": "In diesen Episoden beleuchten wir unseren Umgang mit Side Projects, unsere Erfahrungen damit, und wie man diese erfolgreich zum Ende führen kann.",
        "long_desc": "Side Projects sind Projekte, die neben der Haupttätigkeit durchgeführt werden. In diesen Episoden erkunden wir die verschiedenen Aspekte von Side Projects, einschließlich Ideenfindung, Zeitmanagement und Motivation. Wir besprechen auch, wie man Side Projects erfolgreich planen und verfolgen und wie man sie zur Verbesserung der eigenen Fähigkeiten und Karrierechancen nutzen kann.",
        "usage_count": 4
    },
    "Remote work": {
        "short_desc": "In diesen Episoden besprechen wir die Praktiken und Tools, die erforderlich sind, um erfolgreich im Homeoffice zu arbeiten.",
        "long_desc": "Remote Work ist die Möglichkeit, von zu Hause aus zu arbeiten. In diesen Episoden erkunden wir die verschiedenen Aspekte von Remote Work, einschließlich Kommunikation, Zeitmanagement und Zusammenarbeit. Wir besprechen auch, wie man sich auf Remote Work vorbereiten und wie man die Remote-Arbeit in einem Team koordinieren kann.",
        "usage_count": 4
    },
    "Produktivität": {
        "short_desc": "In diesen Episoden besprechen wir Techniken, um die eigene Produktivität zu verbessern.",
        "long_desc": "Produktivität ist der Grad, in dem man Zeit und Ressourcen effektiv nutzt, um die gesetzten Ziele zu erreichen. In diesen Episoden erkunden wir die verschiedenen Aspekte der Produktivität, einschließlich Zeitmanagement, Priorisierung und Konzentration. Wir besprechen auch, wie man die Produktivität verbessern und wie man effektiv mit Ablenkungen umgehen kann.",
        "usage_count": 15
    },
    "Automation": {
        "short_desc": "In diesen Episoden besprechen wir die Praktiken und Tools, die erforderlich sind, um Prozesse und Aufgaben zu automatisieren.",
        "long_desc": "Automation ist der Prozess, bei dem man Prozesse und Aufgaben mithilfe von Technologie automatisiert. In diesen Episoden erkunden wir die verschiedenen Aspekte der Automation, einschließlich der Auswahl von Tools und Technologien, der Integration von Automatisierung in bestehende Prozesse und der Nutzung von Automatisierung zur Verbesserung von Effizienz und Qualität. Wir besprechen auch, wie man die Automation planen und implementieren und wie man sie nutzen kann, um Zeit und Ressourcen zu sparen.",
        "usage_count": 8
    },
    "Knowledge Sharing": {
        "short_desc": "In diesen Episoden besprechen wir die Praktiken und Tools, die erforderlich sind, um Wissen innerhalb von Teams und Organisationen zu teilen.",
        "long_desc": "Wissensaustausch ist der Prozess des Teilens von Informationen und Erfahrungen innerhalb von Teams und Organisationen. In diesen Episoden erkunden wir die verschiedenen Aspekte des Wissensaustauschs, einschließlich Dokumentation, Präsentation und Teamarbeit. Wir besprechen auch, wie Organisationen den Wissensaustausch fördern und wie er die Leistung und Zusammenarbeit verbessern kann.",
        "usage_count": 13
    },
    "Leadership": {
        "short_desc": "In diesen Episoden besprechen wir die Fähigkeiten und Praktiken, die erforderlich sind, um eine effektive Führungskaft in der Technologiebranche zu sein.",
        "long_desc": "Führung ist die Kunst, andere zu motivieren und zu leiten, um gemeinsame Ziele zu erreichen. In diesen Episoden erkunden wir die verschiedenen Aspekte der Führung in der Technologiebranche, einschließlich Mitarbeiterführung, Teamführung und Strategieentwicklung. Wir besprechen auch, wie Führungskräfte die Leistung ihres Teams verbessern und wie sie die Mitarbeiterzufriedenheit erhöhen können.",
        "usage_count": 30
    },
    "Gehalt": {
        "short_desc": "In diesen Episoden besprechen wir die Faktoren, die das Gehalt in der Technologiebranche beeinflussen und wie man faire und angemessene Gehälter verhandelt.",
        "long_desc": "Das Gehalt ist ein wichtiger Faktor für die Zufriedenheit und Motivation von Mitarbeitern in der Technologiebranche. In diesen Episoden erkunden wir die verschiedenen Faktoren, die das Gehalt beeinflussen, einschließlich Erfahrung, Qualifikationen und Marktlage. Wir besprechen auch, was faire und angemessene Gehälter sind.",
        "usage_count": 9
    },
    "Sicherheit": {
        "short_desc": "In diesen Episoden besprechen wir die Praktiken und Tools, die erforderlich sind, um die Sicherheit von Software-Systemen zu gewährleisten.",
        "long_desc": "Sicherheit ist ein wichtiger Aspekt der Softwareentwicklung, da es darum geht, die Integrität und Vertraulichkeit von Daten und Systemen zu schützen. In diesen Episoden erkunden wir die verschiedenen Aspekte der Sicherheit von Software-Systemen, einschließlich Risikoanalyse, Sicherheitsaudits und Sicherheitsmaßnahmen. Wir besprechen auch, wie Organisationen die Sicherheit ihrer Software verbessern und wie sie ihre Systeme vor Angriffen schützen können.",
        "usage_count": 5
    },
    "Cloud": {
        "short_desc": "Podcast Episoden zum Thema Cloud, Skalierung und Container-Technologien",
        "long_desc": "Schwerpunkte dieser Podcast Episoden sind die Skalierung von Clouds (Anwendungsskalierung, Kosten), AI und Chatbots, Container-Technologie (containerd, Kubernetes, CRI-O, OCI), Cloud vs. On-Premise-Lösungen, Cloud-Monitoring und Observability (Metriken, Tracing, Alerting), Stufen der Cloud-Adaption und Entscheidungshilfen zur Frage Make or Buy.",
        "usage_count": 16
    },
    "Engineering Kiosk": {
        "short_desc": "Entdecken Sie die Hintergründe des Engineering Kiosk Podcasts! Die Gastgeber sprechen über Themen wie Produktion und Auswahl der Inhalte sowie die Entstehungsgeschichte des Podcasts.",
        "long_desc": "In diesen Episoden und Blog-Posts blicken die Gastgeber Wolfgang Gassler und Andy Grunwald hinter die Kulissen der Produktion des Podcasts und damit verbundene Themen. Erfahren Sie mehr über die Hintergründe und Entstehungsgeschichte des Podcasts, wie die Gastgeber ihre Themen auswählen, auf welcher Technik die Webseite basiert, und wie der wöchentliche Podcast produziert wird.",
        "usage_count": 6
    },
    "Interview": {
        "short_desc": "In Interview-Episoden sprechen wir mit Gästen, die Spezialisten in ihrem Feld sind.",
        "long_desc": "In diesen Episoden führen wir Interviews mit herausragenden Persönlichkeiten, die Experten in den Bereichen Engineering-Kultur, Open Source, Menschen, Technologie und anderen damit verbundenen Gebieten sind. Deine Gastgeber teilen ihre Einsichten, Erfahrungen und Erkenntnisse zu Themen wie Softwareentwicklung, Teamzusammenarbeit, Innovation und vielem mehr. Tauche ein in inspirierende Gespräche und erweitere dein Wissen.",
        "usage_count": 58
    },
    "Turing Award": {
        "short_desc": "In diesen Podcast-Episoden sprechen wir über Preisträgerinnen des Turing Awards, ihre Erfindungen und Leistungen, ihre Bedeutung und den aktuellen Stand sowie die Zukunft in ihren Fachbereichen.",
        "long_desc": "Der Turing Award ist eine der angesehensten Auszeichnungen in der Informatik. In diesen Episoden befassen wir uns mit den Preisträgerinnen des Turing Awards, ihren bahnbrechenden Erfindungen und Beiträgen zur Informatik. Wir diskutieren ihre Bedeutung für die Technologiebranche, den aktuellen Stand ihrer Entwicklungen und wie die Zukunft in ihren Fachbereichen aussieht. Episoden zu Innovation, Entwicklungen und wegweisenden Ideen in der Welt der Informatik.",
        "usage_count": 3
    },
    "Women in Tech": {
        "short_desc": "Podcast Episoden mit Frauen in der Technik, über weibliche Vorbilder in der IT und zu Themen wie Diversity und Inklusion.",
        "long_desc": "In diesen Podcast Episoden sprechen wir mit Frauen in der Technik, über weibliche Vorbilder und die Bedeutung von Diversität und Inklusion in der Technologiebranche. Wir diskutieren Themen wie Gleichberechtigung, Karriereentwicklung und die Herausforderungen, denen Frauen in der Technik gegenüberstehen. Wir teilen auch Erfolgsgeschichten und inspirierende Beispiele von Frauen, die in der Technologiebranche erfolgreich sind.",
        "usage_count": 15
    }
}