{
    "Team": {
        "short_desc": "Wir besprechen die täglichen Herausforderungen in IT-Teams und wie diese besser gelöst werden können.",
        "long_desc": "Die täglichen Probleme von Teams stehen für uns als Engineering Manager an der Tagesordnung. In diesen Episoden sprechen wir über unsere Erfahrung mit meist Cross-functional Teams und deren Herausforderungen in der täglichen Zusammenarbeit: von Konfliktlösungen bis hin zur besseren Kommunikation."
    },
    "Feuerwehr": {
        "short_desc": "Feuerwehr und IT sind stark verknüpft, denn viele Best-Practices können aus der Feuerwehr in das IT-Wesen übernommen werden.",
        "long_desc": "Da Wolfgang bei der Freiwilligen Feuerwehr ist, kommt auch das Thema und die Verbindung zur IT-Welt nie zu kurz. In den folgenden Episoden gehen wir mehr auf die Ähnlichkeiten zwischen IT und Feuerwehr ein und besprechen auch, was man in der IT noch von der Feuerwehr lernen kann. "
    },
    "Backend": {
        "short_desc": "Alle Podcast Episoden zum Thema Backend, Architektur und Skalierung.",
        "long_desc": "In diesen Episoden sprechen wir über Backend Themen. Gerade mit Andy’s Dev-Ops und SRE Schwerpunkt und Wolfi’s Datenbanken Wissen sind Skalierung und Architektur im Backend ein ständiges und beliebtes Thema."
    },
    "Frontend": {
        "short_desc": "Das Frontend aus dem Blickwinkel von Backend Engineers - Alle Frontend Episoden.",
        "long_desc": "Alle Episoden zu Frontend Themen aus der Sicht von Backend Engineers.. Fontend ist gerade für EntwicklerInnen aus dem Backendbereich oft schwer verständlich und trotzdem wagen wir uns in diesen Bereich und versuchen diese Themen möglichst Back-end-freundlich zu verarbeiten. Hört rein."
    },
    "DevOps": {
        "short_desc": "",
        "long_desc": ""
    },
    "Tech Kultur": {
        "short_desc": "",
        "long_desc": ""
    },
    "Karriere": {
        "short_desc": "IT-Karrierepush nötig? Die folgendene Episoden geben dir die nötigen Inside-Informationen um deine Karriere zu verbessern.",
        "long_desc": "Von Bewerbungen über Interviews bis zu relevanten Themen um dein Job-Leben zu verbessern: Als langjährige Team-Leads besprechen wir in den folgenden Episoden Karrierethemen und geben Tipps zur Verbesserung der Tech-Kultur bzw. der (Zusammen)arbeit im Team."
    },
    "Software Engineering": {
        "short_desc": "",
        "long_desc": ""
    },
    "Open Source": {
        "short_desc": "",
        "long_desc": ""
    },
    "Datenbanken": {
        "short_desc": "Von SQL bis zu NoSQL, DataScience und Big-Data besprechen wir Datenbankthemen in den folgenden Episoden.",
        "long_desc": "Durch den Forschungstätigkeit von Wolfi im Datenbankbereich und der praktischen Datenbankerfahrung von Andy tauchen wir in den folgenden Episoden in die Datenbankwelt ein. Von SQL bis NoSQL aber auch DataScience und Big-Data stehen am Themenplan. Vor allem ist uns aber auch immer der praktische Aspekt wichtig und manchmal ist die beste Lösung auch gar keine Datenbank, sondern eine einfache Datei..."
    },
    "Bewerbung": {
        "short_desc": "Vorbereitung auf Job-Interviews: Alle Episoden zum Thema Bewerbung",
        "long_desc": "Du willst dich auf ein Job-Interview vorbereiten oder eure Recruiting Pipeline verbessern? Hier bist du richtig, egal ob von Firmenseite oder von der Seite der BewerberInnen - in all diesen Episoden gibt es viel Praxisinformation zu Bewerbungsthemen von Andy aund Wolfi, die bereits hunderte Interviews als Hiring Manager durchgeführt haben."
    },
    "Qualität": {
        "short_desc": "",
        "long_desc": ""
    },
    "Projektmanagement": {
        "short_desc": "",
        "long_desc": ""
    },
    "Kommunikation": {
        "short_desc": "",
        "long_desc": ""
    },
    "Side Projects": {
        "short_desc": "",
        "long_desc": ""
    },
    "Remote work": {
        "short_desc": "",
        "long_desc": ""
    },
    "Produktivität": {
        "short_desc": "",
        "long_desc": ""
    },
    "Automation": {
        "short_desc": "",
        "long_desc": ""
    },
    "Knowledge Sharing": {
        "short_desc": "",
        "long_desc": ""
    },
    "Leadership": {
        "short_desc": "",
        "long_desc": ""
    },
    "Gehalt": {
        "short_desc": "",
        "long_desc": ""
    }
}